[
    {
        "post_id": "3myheq",
        "author": "shittyfriend-tw",
        "title": "[UPDATE] I [34/F] suspect my husband [34/M] is having an affair with our mutual friend [29/F] and I'm not sure how to proceed.",
        "url": "https://www.reddit.com/r/relationships/comments/3myheq/update_i_34f_suspect_my_husband_34m_is_having_an/",
        "score": 2211,
        "num_comments": 220,
        "created_utc": 1443615773.0,
        "selftext": "Original post is [here](https://www.reddit.com/r/relationships/comments/3mqmvs/i_34f_suspect_my_husband_34m_is_having_an_affair/), but it's locked. I'm not sure if you can see it or not, but the tl;dr was I suspected my husband of having an affair with our mutual friend (Jade, who is married to Fred, who was a friend of my husband's), but I had no physical evidence.\n\nSo yesterday I tracked my husband with gps and watched where he was going during the day. When I saw that he was in a car (travelling fast down a road to out of town), I casually texted him and asked what he was up to. He said he was walking to the store, which was in the opposite direction of where he was headed. I watched him all day. Stopping here and there, going out to eat with her, travelling all over the place. I would periodically text him to make conversation, and he would lie the entire time. At one point he said he was just walking around the neighborhood thinking about \"us.\" My blood was boiling. I knew he was with someone who had an iPhone because there were no calls or texts made that morning, so he must have communicated via iMessage. Jade has an iPhone. I highly suspected he was with her, but I had no proof. After he was dropped off at home he texted me saying he was sorry for being distant today, he was just doing a lot of thinking. I didn't tell him I knew he was lying the whole day because I had planned to gather more evidence.\n\nLater in the evening I couldn't take it any more. I asked him where he was all day, and he said \"What do you mean, I told you I was walking around.\" In my rage I said \"I know you are lying. I know where you've been.\" He admitted to spending a little time with Jade, that they went and grabbed something to eat. I told him I knew about everywhere he went. I knew about the late night phone calls (while I was watching him yesterday I checked the phone records and saw an unbelievable amount of calls going back and forth between them. I don't know why I didn't think to check the call records on Monday). I knew about the secret private messages on social media. I knew about it all. He confessed that he and Jade have gotten really close and spend a lot of time together, talking. At first he said it was innocent. I told him if it was innocent, he wouldn't be lying and sneaking around. He agreed and admitted he knew what he was doing was wrong.\n\nI texted Fred last night and told him everything I knew. He said he had been uncomfortable with their friendship for a while, but didn't know if I was or if I even knew. We talked for a while, but I don't know what they are going to do. All I know is I am getting a divorce. My husband claims their relationship was never physical but I can never trust him again. No matter what he does or where he goes, I will always question who he is with and if he's lying to me. I cannot and will not spend my life tracking my husband and making sure he is where he says he is, and isn't sneaking around with other women.\n\nI deleted and blocked Jade off of all my social media accounts. I didn't text her or say anything to her. I know if I even tried I would end up saying some pretty foul stuff to her, which she deserves, but I'm better than that. So not only did I lose an extremely shitty friend in this whole thing, I am also losing my best friend, the love of my life, and the father of my children. I am destroyed.\n\n\n\n   \n**tl;dr**: He admitted to emotional infidelity, but nothing more. That was enough for me. He has broken my trust irreparably and we are going to divorce.",
        "permalink": "/r/relationships/comments/3myheq/update_i_34f_suspect_my_husband_34m_is_having_an/",
        "comments": [
            ">No matter what he does or where he goes, I will always question who he is with and if he's lying to me. I cannot and will not spend my life tracking my husband and making sure he is where he says he is, and isn't sneaking around with other women.\n\nShit. Sorry it turned out like this OP but you're right about trust. To me it always reminds me of that Brady Bunch episode where they broke the vase and glued it back together. It still ended up leaking. ",
            "I hear Fred is available.",
            "You did the right thing OP - the overnight trips were likely the times it got physical. There were countless other opportunities too! :/\n\nDidn't he fight for the marriage at all?",
            "I know it's bleak and scary for you right now... but this is not how your life will look.  Somewhere in the future you'll look back and actually be grateful for this to have happened.  You are going to experience things, find inner strength you never knew existed, and come out the other side a better, stronger, wiser person.  Trust me!\n\nWhen I was in my early 30s I found myself a single mom with an ex who declared he'd '*drag me through court and make me spend every penny I had*' which I believed because he came from a well-off family and he had the education and money-making career going for him.  I didn't.  I was an insecure, frightened, financially challenge mess.  Whoa... did I ever discover a different me!\n\nHere's some things that worked for me, so maybe keep these in mind as you move forward:\n\n* If you can afford therapy, go.  What I discovered about myself, and why I married who I married (so I wouldn't repeat the mistake) changed the trajectory of my life.  It also sent me off on a journey of discovery and self-awareness which has been fascinating.\n\n* If you can't afford therapy, read.  Go to the library.  It's free.  Read autobiographies about people who have gone through adversity and come out the other side.  You may read a dozen books till an author resonates with you... but there are people who have taken this path before you and are now showing you the way.  Find someone who you can relate to.  (For me it's my dog-eared copies of \"Broken Open, How Difficult Times Can Help Us Grow\" by Elizabeth Lesser, and \"The Power of Now\" by Eckhart Tolle that helped me.)\n\n* Accept help and support from family and friends.  \n\n* Anger and fear and worry are not good places to make decisions from.  When you are making plans, whether long or short term, do your best to brush the emotional shroud away from your thinking.  Do what's best for your kids, for you... and don't do something to specifically hurt your ex.  That's just wasted energy.\n  \n* Don't speak ill of your children's father.  That helps no one and your kids will remember when they're older.\n\nBuckle down and accept the fact that your life will now look different.  But the good thing is that from here on in, you are the driver and in control.  Look out into the future and decide what you want that to look like, and then set off on this new journey.  It's a long road but you can do it.\n\nFYI, I'm now 60, happily single, mortgage and debt-free, retired, enjoying a wonderful friendship with my adult son... and am living a life far better than I ever dreamed possible.  But it took some sacrifice, some hard decision making, and patience in believing things would get better.  Then somewhere along the line the scales tipped in my favour (WAY in my favour) and everything paid off.  I truly believe you can eventually have all this too.  \n\nGood luck!\n\n\n\n\n\n\n\n",
            "> My husband claims their relationship was never physical\n\nYet you know they spent the night together more than once. He is, of course, still lying, because he's a liar. Just not a very good one.",
            "No advice, but just wanted to commend you on the choice of the pseudonym \"Jade\" for your husband's downlow paramour. (It being a euphemism for \"prostitute.\")",
            "I respect you for just blocking her and letting her husband deal with her while you deal with your soon to be ex. Marriage is tough and your husband fucked it up by not putting his energy in the right place. I'm sorry OP, this is a fucked up situation.",
            "\"I cannot and will not spend my life tracking my husband and making sure he is where he says he is, and isn't sneaking around with other women.\"\n\n\"I know if I even tried I would end up saying some pretty foul stuff to her, which she deserves, but I'm better than that.\"\n\n\nYAS QUEEN. You kick so much ass. Way to go for doing what's best for you AND being a classy motherfucker. You just keep doing you Op, because you are awesome.",
            "I'm sorry, OP.  I hope the days to come go as smoothly as possible for you and that in the future you find love again with someone who is faithful.",
            "Please repeat this to yourself s this is happening.\n\nA. He isn't your best friend, friends don't treat best friends like this. So the position is up for grabs, use your people and love them tightly. \n\nB. He isn't the love of your life, he's the love of your life so far. And a shitty one, so the bar is low. I have a feeling you'll be surprised.\n\nC. He might be their father, but he isn't a husband. That's for fucking sure.",
            "GD Jade!! I'm sorry it ended up this way. Did you kick him out? ",
            "I'm so sorry it came to this. However, I'm pleased that you have dignity, a level head and know not to spend a moment longer wasting your time with him.",
            "Emotional affairs are often worse than sexual ones IMO.\n\nNot proud, but I was \"the other woman\" in what I label an emotional affair years ago. \n\nThe dude was constantly emailing me telling me how crappy his marriage was and how lucky any man would be to have me. My dad was dying of cancer and I could not focus on a \"real\" relationship. So I ate up every single thing he told me. The kicker was his jealousy when I went on vacation with my male BFF and he acted like we shouldn't be sleeping in the same bed together. WTF?\n\nHot Married Guy and I never had sex but looking back had I been his wife and seen those 100s of emails over the course of several months it would not have seemed that way.\n\nThey eventually divorced, after we had not talked in years.  I thought that meant an open door for us to be together. We went out once. Then he ghosted. True colors.",
            "[deleted]",
            "Reading up ur story this gave me a sinking feeling in my stomach. One I have felt before. Because I've been there-discovered my partner was being unfaithful (twice now). The emotional infidelity really hurts,  because when you're in a relationship that emotional bond is meant to be something sacred between partners. I'd say it hurts more than your partner going off and having random, meaningless sex with someone.\n I just want to commend you for your strength and composure throughout this. You will get through this. And remember, this too shall pass.",
            "Where there's smoke, there's fire. Bet he is only admitting to the bare minimum that you can prove. Respect to your sleuthing skills!",
            "[deleted]",
            "[deleted]",
            "Good for you.  You stood up for yourself and refused to be a doormat.  You should feel proud.",
            "Ugh. My ex used the 'it was never physical' line on me. It's bullshit. You don't spin exciting lies unless it's physical. I'm sorry you're going through this. ",
            ">I texted Fred last night and told him everything I knew. He said he had been uncomfortable with their friendship for a while, but didn't know if I was or if I even knew. We talked for a while, but I don't know what they are going to do. All I know is I am getting a divorce. My husband claims their relationship was never physical but I can never trust him again. No matter what he does or where he goes, I will always question who he is with and if he's lying to me. I cannot and will not spend my life tracking my husband and making sure he is where he says he is, and isn't sneaking around with other women.\n\nI see people on here try to make it work by having the other person earn their trust back by tracking them all the time and I've never understood how that could possibly work.  If you don't trust them to the point where you have to track their every movement and communication then it's over.  I realize the default answer on here to infidelity is to move on, but you really do sound like you need to move on.",
            "> I lose an extremely shitty friend in this whole thing, I am also losing my best friend, the love of my life, and the father of my children. I am destroyed.\n\nNo. It's a good thing. You lost shit a friend, and a shit husband. And now you can focus on brighter, greener pastures and you'll come out happier. I promise.",
            "An affair starts in the heart. The fact that they were spending all that time together, means they were forming there own relationship. To me the emotional betrayal is worse, cause it means there hearts were involved, and sooner or later the physical will follow.",
            "OP you seem like a strong woman, I'm glad you're getting out if you feel like that is the only route you can take here. However, have you thought about maybe going thru marriage counseling before you make the final decision? Either way, I wish you and everyone involved the best. ",
            "Yuck, what a loser, good riddance! Hugs from me.",
            "Happened to me, but I let myself be strung along for years.  Never having proof, all the lies and excuses about what was actually being said and done.. it eats at you.  In retrospect, I should have done what you are doing and just walk away.  It still would have been immensely difficult, but less so than what actually happened.  I wish you luck.",
            "[removed]",
            "I read your original post from yesterday. It actually sounds like this has been going on for awhile. \n\nWhy the fuck can't people just control themselves, or do the right thing and leave the relationship, then go start hooking up?  Gawd!\n\nYou mentioned that Fred is wealthy. I don't know if you need a lawyer, but perhaps he could hook you up with a good one.\n\nI think the following is correct, not positive:  don't leave the house for any length of time, don't move out. It can be considered abandonment, and you could risk losing the house. \n\nAnd a shout out to /u/moyyyle, who was helping you with the GPS tracking yesterday, wondering if you could see where your husband had already been, or could only see him in the present:\n\n>No, but wait. Soon enough he'll give you some bullshit story about where he's headed. \n\nAnd fuck Jade. I hope the silence coming from your end is deafening. \n\n",
            "You are amazing OP, you deserve (and will get) much better in the future. You are a very strong woman and thank you for posting :)",
            "OP I feel for you. This is a terrible shock. However you sound like a kind and smart person who is making the best choices for herself and her kids. You will come out of this better and stronger. Don't be afraid to either ask for shared custody with 50/50 responsibilities so you aren't saddled with 90% of the childcare, OR if your ex can't or won't take responsibility get decent child support. \n\nIt sounds like he is not being defensive about destroying the marriage so now might be the best time to hammer our childcare etc agreements. ",
            "It really isn't worth staying in a relationship where all your partner is doing is lying. Even if he  hasn't physically cheated, there's way too much effort going into his lying instead of effort put into making your relationship better. \n\nStaying in the relationship is going to drive you nuts wondering what he's up to. He proved he can't be trusted just by continuous lying. Why would he bother to change now? Because you busted him? Doesn't usually work that way with chronic liars.",
            "I'm so sorry for this. I myself am going through the exact same thing right now. I can't belive that the person I trusted my life, my heart, my future with could do something like this. I am about three weeks in and meeting with lawyers and filing for child support and dealing with mountains of paperwork trying to figure out my options. We have to sell the house, find new places to live, all of that. And while I'm doing all these things, my idiot husband is saying \"Oh I can't take the kids, I have to go out for my sisters birthday this weekend\" I'm only asking him to take them two days a week as a courtesy to the children. My children are not a burden to me but obviously they are to him. Sorry for the venting there. Just be prepared for this to get even uglier. Once he has an ounce of freedom he will most likely take advantage of the situation to live life as he pleases since he knows you will be there to take care of the kids. ",
            "Good for you, OP. It will be tough but in the end you will get to the point where you'll think, \"I'm GLAD I made the right decision, my life is so much better now!\" - just hang on, be patient and know that everything will be alright in the end.",
            ">So not only did I lose an extremely shitty friend in this whole thing, I am also losing my best friend, the love of my life, and the father of my children. I am destroyed.\n\nThat just broke my damn heart! You are so FIERCE AND STRONG, like damn, I do not know if I could do it in your position but stay the course because no one ever deserves to feel the way you do now.",
            "OP, you are **great**. Best of luck to you moving forward!",
            "I learned the hard way too that if ONE female's texts keep getting deleted, there's a reason.",
            "May I ask how exactly you GPS tracked him all day?",
            "Damn.",
            "Collect all the evidence OP and go to a lawyer! You never know what's going to happen. ",
            "It takes an incredibly strong woman to know that this can't be undone. You'll be alright! ",
            "Seriously, you have 100% completely the right attitude here.  It doesn't really matter if the penis went inside - it just doesn't.  He's skulking around and lying.  You're an inspiration to all.",
            "I feel like saying \n\n>so I assumed it was all in my head\n\non /r/relationships is like saying \"I'll be right back,\" in a horror movie.\n\nYou are making the right decisions.",
            "To me that's worse than a physical affair anyway. There's so much more involved. ",
            "> I am also losing my best friend, the love of my life, and the father of my children. I am destroyed.\n\nSee that's what I'm terrified of. Finally opening yourself up to someone, finally deciding to trust someone, invest yourself and your time and your youth and your best energies wholly to them... only to have something as devastating as this happen. It's even worse for single older women too; as they age, their prospects dwindle at a rate far quicker than men's.\n\nI am so sorry this has happened to you. But I am also proud of you for knowing yourself well enough and respecting yourself well enough to not stand for this betrayal. I hope your husband realizes what a mistake he's made, what he's lost, and grovels at your feet for the rest of his life (or at least for a long, long time).",
            "Ugh he sounds like he wanted to have both of you so he would have the best of both worlds, i bet he thought he was cool. So assholeish",
            "You are one classy lady! Good for you!  He doesn't deserve you.",
            "Youre a strong, smart woman, you'll end up fine ",
            "I'm sorry. I know it isn't nearly the same, but I founded my first boyfriend (after almost a year) when I was fifteen had been cheating on me with at *least* six other girls. I didn't really know any of them, and even though we'd been together for a while, I know that it isn't nearly as serious as marriage. I'm so sorry. \n\nI guess I'll say that I'm here to talk. It isn't offering too much, but it's what I'm able to offer. I'm sorry all of this is happening. None of that should've happened to you to begin with. I wish you the best of luck.",
            "You sound like a VERY strong lady and there are so many men out there who would prob love to be with someone like u. Keep ur head high my friend and I guarantee one day u will look back on all this and wonder what took u so long to leave him.  Stay strong gf. ",
            "You are so fucking strong OP. Major respect. Sorry it hurts, but it will not last.",
            "I'm sorry, OP. Even though your mind sounds made up, I want to share my story, because maybe there's a chance that this doesn't have to be the end if your family.\n\n\nMy family went through a very similar situation, except that I'm the daughter and not the wife. The day it all came out is burned into my memory - September 27th. I was 17, that Sunday I came home from work at 2 pm to find my mother laying on her bed and crying. At first she wanted to 'protect' me and not tell me, but I didn't let it go. When she told me - same thing, the phone locations and calls and lies - it felt like everything was over. I couldn't even begin to emotionally process so I found some boxes and started packing - obviously we wouldn't be living here anymore. \n\n\nMy dad came home not long after. However he was feeling about my mom at the time, I think watching me pack while crying and trying to ignore him had an effect. He was willing to fool around but he didn't want to lose his family. The next week was a blur of tears but somehow, the end didn't come. What he did was never forgotten, of course - sometimes my mom has moments where she can't help checking where he is and what he's been doing, and occasionally it rears it's ugly head in arguments - but we still are a family.\n\n\nPlease OP, confront him and ask if losing his family is worth it, and if he's willing to fight for it. Every day I think about how grateful I am that my mom was willing to get past my dad's cheating. Please, for your kids.",
            "This will be unpopular and I fully understand if you ignore this, but if there is any chance of salvaging your marriage, fight for it. I know he doesn't deserve you even allowing him the possibility of that, but sometimes love gives what isn't deserved. Maybe it won't be possible for you two to be reconciled at this point, but the stakes for you, your children, and your husband are high enough that it's worth exploring every option before making your final decision. Maybe it's marital counseling, or maybe it's a major life change, but if there's anything that's worth fighting for until the end, it's your marriage and your children. I'm so sorry that this has happened OP. If I can help in any way or if you'd like to talk, I'm available. Married for five years and have two little ones of my own. Thoughts and prayers are with you right now.",
            "Head on over to the divorce subreddit, and check out www.thechumplady.com",
            "Sounds like both you and your husband will be happier now.  Best of luck going forward.",
            "More power to you. I like that you've taken this bold decision. My only concern is with regards to the children. Hope they realize whose fault it was and come to terms with it soon. ",
            "Standard Jenny and Carlie scenario ",
            "|So yesterday I tracked my husband with gps\n\nHow does one do this?",
            "Had to log in to say this; divorce is not 6 months of bad times while you get the 'business side' of it worked out. Especially when kids are involved. It's a lifetime of regret, frustration, and second guessing for many, many people.  It's clear many commenting here don't realize this. \n\nI'm always dissapointed to hear the divorced and single people forming a chorus line of \"divorce his ass\" or \"dump that bitch\"... egging on married people with difficulties to just throw it all away. \n\nOP, take your time with the divorce proceedings. Just because he made a series of stupid mistakes does not make him a useless and horrible person. You admit things were problematic before all this. Guys don't typically have lots of people to talk to about emotional problems. Obviously his choice of confidant was poor, and execution was terrible, however you did marry him so there must be something in him that's worthwhile. If not, divorce is always available to the both of you. \n",
            "Honestly you should try counseling before you rush into a divorce.  Turning your life upside down and the life of your kids just because your partner spent time with another woman is kinda dumb.  Even if he did get physical with her, people can and do change.  There is no hard and fast rule that says your husband can't be a loyal and loving partner again, despite what all of the people here are saying.\n\nI feel like people are pressured by society to instantly dump someone that cheated on them to spite them and make sure they don't look bad.  It's kind of like cutting your nose off to spite your face.  You owe it to yourself and your kids, not your husband to at least try.\n\nDon't let the \"white knights\" and the \"you go girl\" crowd here encourage you to rush into anything.  Maybe divorce is the best thing for you, but it is a very serious decision and not one to take lightly.\n",
            "[deleted]",
            "Wow jumping ship pretty soon huh? Not even going to try and talk it through? I mean if that's it then your marriage was pretty fucking shit to begin with. ",
            "[deleted]",
            "I wonder what she was giving him that he didn't get at home?\nI wonder what his story is, if he were to tell it? Not that it matters, he was still being a shady prick, but I always want to hear the other side.",
            "Nice stalking skills. Hope you enjoy your divorce. ",
            "[deleted]",
            "[deleted]",
            "I just have one thing to add to all of the comments. Look at the world we are living in where we give up so easily when times get tough. We take vows \"for better or WORSE\" which includes but is not subject to: Trust, loyalty, communication etc. When these things are broken that is when you make the most efforts to work on the relationship. Obviously some things can't be fixed and if he was truly unhappy after effort was put in to make it work. Well then that would be grounds for a divorce. No offense but this is just sad. No effort to build on the trust that's been lost? you're just going to get up and leave that easily. No one is perfect and we all make mistakes. Marriage means nothing to people anymore and it makes me utterly revolted that people waste their time gathering friends and family to watch someone make promises that they don't intend to keep unless it's on THEIR TERMS. Putting all the blame on one person for his lack of communication. What about you? what have you done to push a man to the point he needs to turn to another woman for affection/ attention. So quick to blame it on someone else just because you caught it. Maybe try working on your relationship instead of throwing it down the tubes, and at such an early stage you guys could have recovered. ",
            "lol divorcing him because you think he's cheating? that's pathetic as fuck. ",
            "This might be an unpopular opinion but that shit you did was crazy stalker shit.  If someone wants to cheat they will.  Just move on.  Now you are going to be going through the next guys phone or tracking him and justifying it by saying look at my past.  ",
            "It sounds like there are much larger relationship issues, and if you were already at divorce before this, it seems reasonable to let this be the final straw and move ahead. But if this is the primary trigger for divorce, it's smart to take a serious cooling off period before taking drastic, family-disrupting action. In fact, a cooling off period is not a bad idea even in the first case, because all your decisions will be better coming from a calm and rational place rather than driven in rage and hurt.",
            "Given your actions during all this, I'd say he dodged a pretty big bullet getting out of a marriage with you. No wonder he was hanging out with Jade, and was afraid to tell you.",
            "You seem insane.",
            "Dude he didn't cheat on you.\n\nYou're over reacting, fucking give the guy a break and maybe look into why he was finding his friendship needs not with you. What are you doing to make him look for fiendship elsewhere? To the point where he has to hide it from\nYou?\n\nYou sound crazy.",
            "Yes he lied, and it was bad, but come on, you wouldnt have been ok with him having a female friend. This made it more taboo. \n\nI'm sure he regrets his choice in the person, but I can almost guarantee that he's telling the truth about needing someone to talk to. Hear him out, go to counseling for a few. \n\nOr... you know.... just walk away and realize his fear of loneliness once in for all. ",
            "I wanted to post this in the other thread, but it was locked before I could.  First, I am glad you updated us.  Second, I am sorry that things aren't working out the way you want.  Third, you mention in your original post that you always have ups and downs and in your post right now I read how you justify yourself and send all the blame on your husband.  I understand that, but what I originally wanted to say is that there could be a reason he was seeking out friendship from another woman, and it's because you weren't meeting his needs.  I don't know all the reasons for your little fights and such, but what if you were at least partly responsible?\n\nI am not saying that you deserved to be cheated on, or anything like that, that shit sucks.  It is just that in the future, you'll have relationships and maybe you'll see that the little things you fought with your husband are not really important things to fight about.",
            "It's probably better for him that you leave. I doubt a relationship where you *GPS track* your significant other would ever be healthy. \n\nAnd no, finding out he was \"emotionally cheating\" on you doesn't justify that, even if you found him fucking a dog in an alley, that wouldn't justifying invading someone's privacy like that.",
            "Do you think it's not possible for someone to have friends of the opposite sex?",
            "Are you so naive to think they **weren't** fucking?!",
            "your original story reads like a trashy romance novel you see at wal-mart, oh my god. how many times did you raise your eyebrows?",
            "Ever consider entering a poly relationship?  \nThough, that lying...",
            "[removed]",
            "this is obviously completely made up.  Patent-pending Reali-T-Score: 2/10.  boo."
        ]
    },
    {
        "post_id": "3cvaxr",
        "author": "Jsidndijwisnsjd",
        "title": "[Update] Friend [F25] who once rejected me [M25] now says she likes me - Now that I have money.",
        "url": "https://www.reddit.com/r/relationships/comments/3cvaxr/update_friend_f25_who_once_rejected_me_m25_now/",
        "score": 2204,
        "num_comments": 346,
        "created_utc": 1436579682.0,
        "selftext": "[Here](https://www.reddit.com/r/relationships/comments/3baukx/friend_f25_who_once_rejected_me_m25_now_says_she/) is the original.\n\nSince she told me she didn't want me many years ago, it's not like I've been lusting after her, but the feelings were still there. I know that everyone told me that it was a bad idea, but I had to try. I took everyone's advice and made sure that I didn't pay for anything that was extravagant or over the top.\n\nAnyway, last week we went on two dates. We did the whole dinner and a movie thing and we also went to the museum. Earlier this week we went to a play, which sucked, got some food after which we had sex - which has been a long time coming. All was good. Great, actually.\n\nYesterday I went over to her house to bring her lunch. I knew she was home. I picked up some Chinese food and drove to her apartment. I have the spare key to her place, so I opened the door and went in, and see her fucking some guy on the couch. We made eye contact, then I just walked out. She called me like an hour later and told me that we weren't exclusive and that if I didn't want her to be with other guys, that's fine, but I needed to tell her in advance. I told her to get fucked. I don't have time for bullshit like that.\n\nSo that was fun...\n\n**tl;dr**: She had sex with another guy. Claimed it was because we weren't exclusive. We are no mas.",
        "permalink": "/r/relationships/comments/3cvaxr/update_friend_f25_who_once_rejected_me_m25_now/",
        "comments": [
            "Honestly OP, if you didn't try this, you probably would be thinking \"what if\" and regret not trying. I know it hurts, but now you know for sure.",
            "> I know that everyone told me that it was a bad idea, but I had to try.\n\nWell that's okay. At least now you tried and you know you don't want to be with her. ",
            "Weren't exclusive but you had the keys to her apt?  Ya right. \nDodged a bullet. ",
            "A lot of people seem to think you're wrong for assuming exclusivity, but given the fact you guys have known each other and were friends for a long time before dating I think that makes the situation different than if you were essentially strangers prior to dating. I think there is a different standard of care which must be considered when longtime friends start dating, especially given that she was the one who proposed changing the nature of the relationship. For what it's worth I think you made the right call on all fronts.",
            "Here's the thing: if you hadn't had the \"we're exclusive\" conversation, her sleeping with or dating other people is fair game. That tends to be how things work. That being said, since she was the one who expressed interest in you, I think you made the right call. If she was really invested in making this work (and it wasn't about the money), she wouldn't have been so keen on fucking another guy. If she really wanted you (and since you've been friends for years, didn't need to do the whole \"getting to know you\" thing), she would have acted like it.",
            "[removed]",
            "A loss of about, say, $400 > years of time and money with that girl.",
            "[deleted]",
            "Well, I think you dodged a bullet anyways. Even if you were not friends for years and she gave them to you, she should have *asked* if fucking other guys was still a thing. Even people who have a lot of partners let the other people know \"I am seeing other people too.\" ",
            "uh... good on you for noping the fuck outta that. If you are friends with someone, good enough friends to have a spare key, and then start dating them, isn't there, like, an unwritten rule that you are exclusive or that if you're not, you let them know? Especially if one of those people has confessed their love previously? Idk with anyone I dated if they weren't the only person I was dating I let them know upfront just cause it seemed most fair. BUt maybe I'm old fashioned or something, idk.",
            "[removed]",
            "I don't understand how there's an exclusive and non-exclusive way of dating. Dating in my culture means boyfriend-girlfriend and that means you don't get to fuck other people but only me. And if some guy/girl try to pursue 2-3 person at the same time (not dating, just flirting) and one of them found out, he's probably dead. ",
            "I want this to be in the sidebar of this sub. Specifically this sub.\n\n\"When someone shows you who and what they are, believe it.\"",
            "At least you found out early without putting too much emotional or time investment into the relationship. She was obviously going to settle for you for financial security and had no respect for you. \n\nNow you can go and meet someone that likes you for you, and respects you the way you deserve. ",
            "You absolutely did the right thing. Nice job op.",
            "[deleted]",
            "This is why I don't like getting into sex so early in the \"getting to know each other\" phase of dating (before it's even really dating), and why I don't care for people who do. How the hell are you supposed really see if anything can happen between the two of you if you're off fucking other people? And if your deal is to simply fuck multiple people, why even agree to anything that remotely resembles a \"date\"? By all means, date multiple people in that first few weeks, but don't fuck them.",
            "I'll drink one for ya op.",
            "I wouldn't give her any more money",
            "I feel like a horrible person saying this but I'm almost glad this happened. I read your original post thinking \"oh god, this guy is gettin swindled by this chick but cant see it, she is sooo using him for his money and will bankrupt him\" \n\nBut now that this happened early on, hopefully you won't spend any more money on her and you can move on to nice girls who actually like you for who you are. Good luck!",
            "I ain't sayin' she's a gold digger......",
            "Good riddance. \n\n",
            "Good riddance buddy. Everyone pretty much warned you this will happen, but be glad you caught on early before you got serious. She wanted a piggy-bank for a bf, always avoid gold-diggers buddy.",
            "DUDE WE TOLD YOU *HUGS!!!!",
            "I kind of don't like that you barged into her house without calling. Unless you're in a sitcom.",
            "sorry dude.\n\nyou should get sti checks just in case.",
            "Get tested",
            "At least you had a good bang?",
            "You dodged a bullet! Good for you.",
            "Just for sport, you should she her a video of you swimming in a pool of money and laughing hysterically ",
            "Sounds like somehow you knew this would happen. Pretty much every dude I know who got involved with a gold digger walked straight into it and knew what was coming. They just didn't know how bad it would be when push came to shove. I'm sorry if your feelings are hurtish but she sounds like a fucking disaster. Women like that will take you down with them. Good on you leaving her to swill in her own BS.",
            "I know she's sad now that she has lost her financial security. Inb4 she tries to have OP rationalize the fact that she was seeing others while seeing OP wasn't wrong. Open relationships aren't exactly the norm, being exclusive is usually something of a default dating procedure unless stated beforehand.",
            "im so sorry:(",
            "[removed]",
            "I think you were way out of line using your spare key to enter her apartment uninvited after 3 dates. Without a talk about exclusivity she was in her rights to be shagging another bloke. You sound creepy and weird... She probably did like your money and can see why she wasn't so keen on you at the start - stage 5 clinger right here...",
            "> I told her to get fucked. I don't have time for bullshit like that.\n\nSeems she was way ahead of you. At least you had a good time on the dates and a good night. You dodged a bullet.\n",
            "You should probably get tested for STIs/STDs just to make sure you are 100% in the clear OP. You live and you learn so at least now you can move on to better things.",
            "Good riddance.  Did her boyfriend know about you?  Was he in on it?",
            "I hope you manage your business better than you managed this relationship. In life, personal or in business you need to do your due diligence and make sure certain things are spelled out before they come and bite you in the ass.\n\nHer?\n\nNo major loss.\n\nReally.\n\nBut something to do with your business because you have a habit of making these sorts of foolish assumptions?\n\nSo bad.",
            "what do you mean by exclusive? i dont get it.",
            "Hit it and quit it. Bitches like that aint worth it.",
            "Omfg I did not expect that op. Well now you know she wasn't a good woman.  ",
            "I am proud of you OP. I think you did everything right.",
            "I think you had to try. I know the feeling of being in love with a very close friend who doesn't reciprocate. I would have tried too. Now you know she is a skank and u can move on with closure.",
            "I don't know how much money you have, but something that is really important for people with money is not to flaunt it, and to not even mention it at all. Its okay if people are attracted to your intelligence or work ethic which often happens to have the side effect of a high income, but you don't want the immediate attraction to be to your money and that way it won't/ ",
            "At least now you know, everything worked itself i guess, be happy you dodged this GD, dont have the \"What if\" in the mind, and can move on to someone who actually likes you instead of your bank account. An advice to future dates, dont pay for everything, if you give everything in the beginning, they will expect you to pay for everything in the long run.",
            "Well...at least you banged.\n\nIf you don't want to get hurt again or something, just keep Kanye in mind fam.\n\nPraise Yeezus!",
            "We warned you what would happen and you didn't listen, I hope you now know not to date someone that has a history of financial problems and is clearly using you as an atm",
            "I was going to defend her because, come on. Two dates does not mean exclusivity. But then I thought about how often I've given someone a key to my place. WTF? Who does that? Giving someone a key to your place is a pretty big deal. If I was given a key I would not expect that person to be fucking someone else. What a jerk!",
            "What are you doing walking into people's homes unannounced?  That's creepy and entitled.  And your reaction to finding her having sex makes you sound clingy.  I think she dodged a bullet.",
            "Hey, at least you got to hit that. Teen-aged you would totally give you a fist pump.",
            "Good on you for scoring.  Give her a satisfied smirk next time you see her.  From a distance.\n\nI'd send the key back now so you never have to help her or assist her in any way.",
            "[removed]",
            "I wouldn't be surprised if she ends up pregnant and coming after you for child support. Even if the kid is someone else's.",
            "When you said you fucked her I knew what happened. I told you what she was doing and how cold they are the ones like her.",
            "Doesn't matter, had sex.",
            "[deleted]",
            "I'm confused why you have her spare key if you're just dating?  \n\nThough I am probably on her side.... if you havent said yes, lets be exclusive she can fuck whoever she wants.  TOTALLY IS HORRIBLE that you saw it.    But. yeah.\n\nThat was very sweet for you to pick up lunch for her though.\n\nAlso well.  Good for trying but she did seem pretty vapid from the beginning.  ",
            "ITT: People who don't understand how dating works and that exclusivity is an explicit agreement.\n\nYou were dating a woman non-exclusively and walked into her residence unannounced while she was in the middle of a date with somebody else. How does this make her the bad guy? And then you got mad about it? If a woman did this to me I would write her off as totally insane.\n\nP.S. possession of a key to your friend's house from \"ages ago\" doesn't count as having a conversation together about dating exclusively. Come on man.",
            "Yes, you broke the rules in 2 ways: 1) wanting exclusivity and not asking for it, and also the corollary, treating her as if she cheated when you had no agreement in place; and 2) using your key with absolutely no warning. In both cases, you invaded her privacy very seriously. The first is also a breaking of trust.\n\nYou cannot reasonably expect people to read your mind.\n\nAlso, you apparently think that she should not have free will, since you are now punishing her and apparently are going to refuse to even be her friend. Edit: clarity",
            "Shame you're increased funds didn't help you buy some self respect.  You should have known better, hopefully you learned something through this and won't get taken advantage of again.\n\n",
            "You shouldn't be upset. You're not exclusive. You walked into her apartment. Her apartment. \n\nIt seems like you like her. Give her another shot. Make her exclusive and see what happens."
        ]
    },
    {
        "post_id": "3itqxu",
        "author": "abouttogetangry2",
        "title": "[Update] I think my husband is up to something.",
        "url": "https://www.reddit.com/r/relationships/comments/3itqxu/update_i_think_my_husband_is_up_to_something/",
        "score": 2206,
        "num_comments": 283,
        "created_utc": 1440835786.0,
        "selftext": "Original post...\n\nhttps://iy.reddit.com/r/relationships/comments/3iqp42/i_think_my_husband_is_up_to_something/\n\n\n\nI left work and called him and told him i was gonna stop at the liquor store, he said \"ok!\" So I stopped and bought stuff to make drinks, went to his job and pulled up to see him standing by her fucking car, kissing her. I honked my horn, waved pathetically and drove off. 15 years down the drain.\n\n\n\n\nTo the person who said that I showed no love for him in my post... you have no idea what my life has been like the last few months.\n\n\n\n\nI'm drunk now, getting divorced, what a waste. Goodnight all, thanks for your help.\n\n\n\n\nTl:dr. He's cheating. \n\nETA, Thanks for all the support, people of Reddit. I think I'm in shock,  mostly just really mad at him. We will be getting divorced, I can not stay with someone I don't trust. We have 3 cars and a house to divide, luckily I know a good attorney.  He cheated on me, he'll cheat on her. I'm lucky I found this out now, not a year and some diseases later. :/",
        "permalink": "/r/relationships/comments/3itqxu/update_i_think_my_husband_is_up_to_something/",
        "comments": [
            "This is going to sound a bit weird but you have been lucky to catch him in the act. It could have been months of lies and him making you look a fool. \n\nMonths of you wondering, doubting him, doubting yourself. \n\nIt might hurt like a b**** now but at least you don't have to deal with constant anxiety of \"is he? Isn't he?\" \n\nPlease seek the support of your friends and us. You can lean on both to not feel alone. \n\nDon't let him destroy you and you will rise above with your head high! \n\n*sends virtual hugs* ",
            "[deleted]",
            "Sometime in the next couple of days, he's going to start blowing up your phone, telling you what a huge mistake he made and that he wants to be with you instead.\n\nDon't fall for it.\n\nWhat happened is that Becky (I think that's her name) dumped him because of the divorce drama.\n",
            "I'm sorry, OP. I know this pain. \n\nGet drunk tonight. Cry. Get angry. Throw things. Hell, go out in the back yard and break old dishes if you feel the need. Just stay safe.\n\nIt's gonna hurt for a damn long time. But give yourself credit, ok? You weren't fooled. You aren't an idiot. You trusted because you had no reason not to until now. NOT all people are like this and the fault is his, not yours. Don't take him back. No matter how much he begs and apologizes.\n\nIt's not that difficult to stay faithful. It's not that difficult to at least attempt to solve problems if you're unhappy in the relationship. It's not that hard to end a relationship before starting a new one. He is a coward.\n\nShe hasn't won a prize. She's won a lying cheater. She did you a favor and took him off your hands. He will lie to her too, eventually. ",
            "You honked and drove off? That's awesome! Fuck him and uhWhatshernameohyeahbecky. You say 15 years down the drain,  I say that it's better then 15 more.  Or even 15 more minutes.  You have found him out and the outcome is devastating,  but you sound like a very intelligent,  strong   independent woman.  You will survive this!! \n Edit : typo",
            "once Becky finds out that you're divorcing him, the allure of being with a married man will disappear and he will be dumped twice.\n\nfuck that douche.  There are plenty of men out there that will treat you well.  ",
            "Oh, sister. What a shitty fucking day :( Hope you've got some stellar gf's to have a drink with, I'm raising an over-filled class of Tesco special offer Prosecco to you x ",
            "I would have loved to see his ghostly white face after you honked your horn. What a total ass. ",
            "What an asshole!!! \n\nI'm so very sorry that this is happening to you. Best of luck and wishes your way",
            "Fuck that guy. \n\nBut, if he'll cheat with you, he'll cheat on you.",
            "What a dick! I'm sorry you're going through this... but you know, I once heard someone say \"whenever a mistress becomes a wife/girlfriend, there's a job opening\"  ",
            "I am so very sorry you are going through this awful time.\n\nGood you have a good lawyer. Now I will suggest three more things that you need to do:\n\nGet a full physical if you haven't had one in a year, tell your doctor what's happening when you are there and ask for STD testing.\n\nI urge you to seek counseling/therapy to give you needed emotional support and to clarify your thoughts and reason during this time.\n\nI hope you have seen your lawyer already for your legal options. If you haven't - get in there ASAP.\n\n\nYou take care. It will be a bumpy road for while but time really is your friend. \n\n\n*Nana internet hug*\n\n",
            "OP, make sure you get tested! You never know, he may have already fucked her. ",
            ">He got mad and said \"because when I broke my hand I had to learn to do everything as a lefty!\" that made sense and I felt bad.\n\nCompletely unrelated to this guy cheating on OP. But do you really make sure the hand with your wedding ring doesn't do anything gross? That is something that \"makes sense\"? I'm just surprised that is a thing to anyone.",
            "You showed great restraint not running them over with your car! Kudos to you!\n\nI'm sorry it went down this way, but the silver lining is that you had definitive proof -- and didn't even need to hire a PI. Divorce is never easy, but having that image in your mind of the two of them kissing will help propel you through the process. \n\n",
            "Holy shit, you inspired me. Thanks a lot OP. God bless you and I hope you'll get the best out of this situation. I'm having a shitty month due to some asshole too, and your self-confidence is a huge inspiration to stop whining over myself and get my shit together. You're a star ^^ ",
            "Sounds like someone (your ex) is investing in a bus pass!\n\n",
            "You had a shitty day. But the only thing worse than 15 years with a cheater is 16 years with a cheater.",
            "Fucking Becky ",
            "If I were you I'd keep drinking and eat some burgers n shit. Keep on keepin on. ",
            "He was probably just helping her get dust out of her mouth.",
            "I wish I could slap the stupid out of his face for you, OP! I wouldn't normally suggest being vindictive, but CLEAN HIM OUT during the settlement. See if uh, Becky will still take him for what he is. In the meantime, my thoughts are with you! ",
            "I can't imagine what you're feeling, and I know this doesn't help the pain, but it wasn't a complete waste: you're armed with the tools to weed out cheating shitbags from your future. Take that as solace. You are strong, you will find someone better, and you know what to look for now. ",
            "So sorry to hear this :( You seem like a strong woman and what you're going through is going to be hell for a while but you will get through this as a stronger person. Now that you know what kind of scum this guy is, you don't have to waste another day of your life with him.\n\nI wish you some happier times ahead!!",
            "Nothing pisses me off more than someone who acts aggressively defensive when they damn well know they're the ones doing something wrong.\n\nGood riddance. I hope the rest of your life from here out is nothing but sunshine and butterflies.",
            "I'm sorry for all your pain. That's a really hard situation.\n\nWhat will help you and him the most is to hire a mediator to work out the terms of the divorce, rather than both of you paying attorneys. If you pay attorneys it will cost at least 4X as much at minimum, will take a LOT longer, and will be infinitely, infinitely MORE painful.\n\n\nShop around for the mediator and have a 30 min free consultation with them. ",
            "I have read both posts and each of your responses. You seem like an incredibly self-possessed woman who knows her worth and has a solid appreciation for herself. There is just an innate confidence there that shines through. This is going to be bad, of course, but I just can't help but feel you are going to be better than Okay when this is all said and done. \n\nThat being said, I am sorry for what you are going through and wish you the absolutely best.",
            "I'm so sad to hear this, but you are strong and independent. From your earlier post and replies, you seemed really level headed. I'm glad you aren't going to let him crawl back into your life. Virtual hugs!",
            "Holy fucking shit! Call his boss and inform them of the cheating, maybe they have a no fraternization policy not something Idk. But daaaamn the fucking balls on that asshole. Fuck him. ",
            "I'm very sorry to hear this. Hang in there. :( \n\nI'm curious what his pathetic excuse for this is. Has he tried contacting you or coming home?",
            "Well, now we know why he was over by her car (from your first post yesterday).  Seems kinda stupid to be out kissing in full view like that.  \n\nOffice romances rarely work out, and without the thrill of cheating, these two will fizzle quickly. \n\nThis guy just screwed up his life big time. What an idiot.\n\nStay strong and focused.  Things will get better.",
            "OP REMEMBER YOU R AWESOME. IT ISNT ANYTHING THAT U HAVE DONE UNFORTUNATELY U LOVED A LYING BASTARD,.. PLENTY OF US HAVE... U R NOT ALONE PRAYERS N BEST WISHES TO 1 HELL OF A WOMAN ...U R A SOLDIER U GOT THIS... THANK GOD FOR WOMEN'S INTUITION AT LEAST U HAD ' THE FEELING\" SO HOPEFULLY IT ALREADY WAS MAKING YOUR HEART COLD FOR THIS ASSHOLE",
            "holy fuck.\n\nraging at this motherfucker so hard. what an asshole...i wish i could give him an old fashioned beatdown for you. he deserves it\n\n15 years...wow... i am so sorry",
            "It was removed! :(",
            "I'm so sorry that this has happened to you.  But I am glad that you are going to handle it the only way that will work.\n\nSomething similar happened to me and I can tell you that my subsequent marriage made the one that ended in cheating look like a hell, even though at the time it didn't seem that bad.  You will come out of this better off.",
            "I was just cheated on recently, and I know how much it hurts. It's been over a month and I still cry about it. I wasn't with him no where as long as you were with your husband, so I can just imagine how much more you are hurting. You are very strong. Cry, drink alcohol, scream and break things. Do whatever you need to get it out. Use your friends and family as support, but not too much. Mine got sick of me after 2 weeks, so a therapist will come in handy. I wish you the best of luck. I know I'm a stranger, but sometimes talking to strangers was easier for me, so PM me if you need to talk to someone. Good luck. ",
            "Frankly I'm glad it turned out this way. You don't have to wonder anymore and every point you made in your original post made sense then and now you know the truth.\n\nNever let anyone tell you that you're over-reacting when all the signs point in the direction of cheating.",
            ".. I probably would have ran his ass over. Good call, OP.",
            "God, I'm so sorry. I hate guys that are like this, it's truly horrible. I know many men are awesome, and women for that fact. But these kind of partners, they are the bottom of the barrel. Stay strong and prosper! You do afterall, have an entire reddit community here for your support.",
            "It would have taken SO MUCH self control for me to not drive my car straight into them, back up, and run over them again",
            "Intuition is one strong, mysterious thing. Good for you for being strong enough to listen to yours.\n\nThis totally sucks (to say the very least) but you're a successful woman who's doing well in life and will continue to going forward. When you do emerge from the dumps you'll be pleased to find a world of freedom where you can flourish in the things you're passionate about. That may or may not include having some fun dating. ;) it's strange to think of your husband as not being \"the one\" but he wasn't. That means your one is out there ready to be found. Yes I truly believe this.\n\nSo thank your POS ex for being so very clumsy in his affair and making this process quicker and easier. You've got better things to do with your time than spend another minute being underappreciated.",
            "[removed]",
            "They are both dirt bags who deserve each other. She knew you guys were still together because you were happily picking him up and dropping him off regardless of what he told her. Once you get over this and come out on the other side you are going to be so much happier without his lies and deceit in your life. You just sit back and let them be misrable pieces of dirt together they won't last because they are both liars and cheats. Just focus on making yourself happy and getting through the divorce. Lean of friends and family. I wish you all the happiness in the world!",
            "Fuck that douche. Fuck him for thinking he can treat you that way and disregard the commitment you made and the vows you said. He's fucking coward for trying to make you think that you were crazy when you knew that something shady was going on. Hugs, girl. But I could tell from your OP that you're strong and awesome. You'll get past this and leave that loser eating your dust.",
            "I'm so sorry, my heart goes out to you. Just like Dr. Phil said once (yes, I'm gonna quote him), you say it's 15 years wasted, what would be worse would be 15 years and one day.\n\nGood luck OP, take care of yourself.",
            "I'm sorry, OP, I know that feeling. It's like having a fuckton of bricks dropped on your chest. You can't breathe and you can't fathom why everyone else is going about there day like everything is okay when yours just came crashing down around you. It fucking sucks. \n\nBut it gets better. Just walk away. Disengage and no matter what, don't let your husband think you give one flying fuck what happens to him now or in the future. He wanted a life without you by his side and now he gets it. Make sure he sees that. Go out and do nice things for yourself. Do everything you've been wanting to do since before you met him. The great thing about being single, is you're not responsible for making sure another person is as happy as you are. You get to be selfish and it's acceptable. You may not be divorced yet, but you are single and it's time you acted like it. \n\nDo what you want, when you want and if he has anything to say about it, just shrug and walk away.",
            "Disgusting POS. It's so unfair to you, but I'm glad you have the spine to leave him right away. He threw it all away... I hope it eats away at him for the rest of his life, while you move on to greener pastures.",
            "I'm sorry, but now you know. You have a solid point to move on from. Change the locks, pack his stuff. Throw him out and get a lawyer. Good luck.",
            "I'm so sorry you've got to go through this, I wish you all the best :/",
            "Oh wow, I am so sorry! Fuck that dick!",
            "Glad you found this out when you did. What an asshole for breaking your trust like that. At least now you can move on. Stay strong. ",
            "I'm so sad for your betrayal of trust. \n\nIf that's how he rewards your commitment to him he's not worth another second of your time. Doesn't make you feel much better I'm sure, but my heart is with you. \n\n*virtual hugs*",
            "I am so sorry for your pain.  ",
            "So, uh... we never got to find out what specific sex act he wanted you to do?",
            "**Well shit.** I'm sorry he cheated, OP, but glad you found out. Fuck that guy. And fuck what's-her-nuts...Becka? Betty? \n\nAlso, just to stick it to that fuckface, constantly refer to her as Brittany now. Stupid ~~Becky~~ Brittany. \n\nI wish you the best through this divorce, darlin'. You can make it. You've already made it further than most in your situation on this sub. Good on you for having the resolve and strong will to sick to your guns! ",
            "My heart breaks for you. My wife cheated. She doesn't know I know she cheated but I have a written account of what she told a mutual friend. Should come in handy come settlement time.\n\nThings will get better. Before they do though, things will really suck. I'd suggest a therapist for you. Can't tell you how much it helped me. Drinking can make you feel better \"now\" but be careful going down that road. \n\nShoot me a message if you ever need to vent. So sorry you're going through this.",
            "So sorry to hear this happened. There's no better revenge than letting \"Becky\" keep him. From the sounds of it, they deserve each other, and she gets to live with the dishonesty, secrecy, lies, and uncertainty her relationship is founded on. She's not getting a prize, that's for damn sure. In the long run, she did you a favor by taking a toxic jerk like him off your hands. He's all hers now. \n\nContact that attorney, and nail your soon to be ex's ass to the wall.",
            "Yeh forget that shit! He can live a lonely miserable life and I hope he does! Call your friends and go whoop it up! \n\nHugs!!",
            "So you know your Husband better than he thought you did. Good for you. What sorry POS he is. He will try and give you every excuse in the book. I would close that book and burn it before he even gets a chance to open it. Hope Becky gets the same raw deal he gave you. ",
            "I was pretty sure he was cheating and certain you'd catch him. You seem to have a much better sense of self and personal agency than most of the people making these kinds of posts. You'll get through this. I hope you take him to the cleaners. Oh, and if the girl (what's her name?) has a boyfriend, be a sport and give him a heads up.",
            "When you know you feel something, you really feel it. I'm sorry for your loss. I say this as a \"loss\" because if it were my fucking husband, he would be dead to me. \n\nI read your previous post of your thoughts of how he maybe cheating, and from your assumptions, I didn't see it as much of cheating as I did paranoia on your part... Maybe that was me hoping he wasn't cheating. The wedding ring thing was a big red flag, especially his excuse for it..But that was the only reasoning where I saw maybe he was cheating out of all this things you listed. \n\nI feel sad that he did this to you. And I hope you can pick yourself up from this and move on with your life and find some positivity down the road. ",
            "You're really smart to file for divorce before his affair goes south.  An affair is never good, but an affair with a subordinate or lower-ranking co-worker is like shooting your foot off with a shotgun.",
            "Well, you've had hundreds of responses to read - but just in case you are passing the time reading them all - I think you are awesome and have handled this like an absolute CHAMPION.\n\nYou are strong like bull.  My sympathies for your pain - sincerely.  It truly is his loss to lose such an awesome life partner.",
            "Fuck all that. I'll raise my drink to you, to moving forward and finding happiness again.",
            "Aw :( I didn't expect an update so quickly. Fuck that guy\n\nHas he tried to talk to you since? Where are you moving or is he the one moving out (please this)",
            "Always trust your gut instinct.",
            "You trusted your gut and you were right.  Be glad you're a smart cookie.  You are better off without him.",
            "GODDAMNIT! I so wanted you to be overreacting and everything be okay. You're living through one of my biggest fears. I'm so sorry. ",
            "As much as I sympathize with you and think he's an asshole, I wouldn't call it \"15 years down the drain.\" I mean the better half of your marriage was good...? Otherwise you wouldn't be together for that long. Not the entire marriage was a waste.",
            "Always trust your gut, and stay strong. You deserve better! ",
            "Lawyer up, be strong. It's probably gonna be hell for awhile but it will get better.",
            "I'm sorry you have to deal with this, but did you take a picture so he can't deny the cheating or anything?",
            "All the love and good vibes to you. I'm sorry you have to go through this, but you are still young in my eyes. You will find someone you love who loves you so much they wouldn't dream of doing something so terrible. Best of luck to you, and I really hope karma does what its supposed to do and ruins his life.",
            "What's her name...uh...Becky can have him. Good on you for how you've handled this all. Stay strong. We're all rooting for you!",
            "Cheating is painful. I'm so sorry it was true.  Your life will be ten times better eventually with him gone.  The divorce was tough but years on my life is so much happier without someone around who blamed me for all his problems.\n\n",
            "What a douchebag. You deserve so much better. I really wish you all the best",
            "I'm so sorry :( Here if you wanna talk.",
            "You have better self control than I do. I would have run him over, or at least thrown the fucking bottle at his skull.\n\nIf he can be drawn away so easily then he isn't worth having. Divorce his ass and treat yourself. He'll realize his mistake too late.",
            "I've been there. It hurts like a bitch. Get some therapy. The rage, the fear, the paranoia are all going to make moving on really hard.\n\nIn the meantime. Get a lawyer. Get some money saved up and let his boss know what's going on. \n\nSilence will make it easier for him to move on with his life. Make that shit as loud and as public as you can stand. He deserves nothing better. \n\nGood luck. If there's anything in can do, let me know. ",
            "Good luck, OP.  Stay strong and focus on moving forward.",
            "oh man :( glad you didn't have kids yet though",
            "I'm not sure if someone mentioned this or not, but tell Becky he's a cheating a******.\n\nMake sure she doesn't hate you and start sprouting s*** about you because of the web of lies he's spun.",
            "Sorry to hear this - I went through the same thing and I call it the Best Worst Thing To Ever Happen To Me.  It was hell going through but coming out the other side was wonderful.  Best of luck to you",
            "I'm a little late but I just wanted to say that if I had to guess, your ex did this because of two reasons.\n\n1. The thrill of cheating.\n2. He wanted to be with someone whom he could feel superior over.\n\n>We have been together for 20 years, married for 15, we have a nice life together, we get along well, we have sex probably at least 5 times a week. We have good jobs, make pretty decent money, own a house, yada yada... they hired 4 women about two months ago. None of these women are particularly attractive, \n\nYou are clearly confident, intelligent and successful.  And from your description, you are likely more attractive than her.  The only thing the other woman may have on you is age, but I don't know since you didn't mention what's-her-name's age.\n\nBut even if it is that, I think for your ex, it would be more of a superiority thing . . . wanting the be the \"man\" in a relationship.\n\nI suppose I'm rambling, but my point is that I'm sure that he did this because you are too freaking awesome for him.  You sound like an amazing person and he needs to be with a much less amazing person to stroke his tiny little ego.",
            "Has he tried talking to you since this happened? Any updates? Dying to know. I'm sorry this happened to you.",
            "You're awesome and have been very, very smart about this whole thing and you should take a long vacation after it's all over!!",
            "I'm so sorry for you :(",
            "I am so, so sorry. ",
            "That's really rough OP, your husband is a dickhead. You have a strong intuition, at the very least you can trust yourself and I hope you can find some comfort in that.",
            "I am so sorry that he did that to you. \n\nYou deserve so much better!!! Lots of virtual hugs sent your way!!!",
            "=( \nStay Strong",
            ":/// I'm sorry it had to be this",
            "Oh man, I'm so sorry, that bites.",
            "Holy shit, what a piece of shit. Im so sorry! Please stay with friends or family and kick his ass to the curb. What goes around comes around.",
            "Fuckkkkkkk it got removed before I could read it. Wtf happened???????? All these comments got my ass hyped up",
            "Oh OP so much *hugs* and Mai tai's are super yummy if you need a fruity drink. ",
            "I too go through this...I still love him.  You need do what right for you, I understand.",
            "Lawyer up!",
            "I'm so sorry. I'm glad you trusted your gut on this one. \n\nI'm really hoping he is shitting bricks right now. Is there any way you can pack bags and leave before he gets home? ",
            "On the plus side, at least you are getting rid of a complete idiot. I mean, how stupid is he? It's like he wanted you to find out based on the things you posted in your original post. I'm sorry you are going through this.",
            "Wow, are you me? 15 years married, she found a boyfriend and says she no longer loves me out of the blue.  My sympathies, I know it's not easy.",
            "I'm so sorry your hunch was right, I've been there and it's awful.",
            "I am sorry to hear about how this turned out.  I hope my upvote and literal laugh out loud for your tl:dr is some bit of good news. ",
            "Came here to say sorry about how this went down. My only advice is use the divorce to end things with him and to move forward with your life and not to punish him. The only winners in long drawn out divorces are the lawyers. ",
            "[deleted]",
            "That was me that said you showed no love for him in the post - and it's still a true statement. I wasn't judging you - I was just saying regardless of whether or not he was cheating you should've broken up with him.",
            "I am sorry this is happening to you. How are you gonna get to work since you share a car with him?",
            "Besr Tl;DR evaaa!!!!!!!!",
            "[removed]",
            "-",
            "[deleted]",
            "If you don't trust him, the relationship is already over.  ",
            "[removed]",
            "I don't know why American woman hate cheating so much. In China, if man is successful he can play around. He is man, who cares!?",
            "[deleted]"
        ]
    },
    {
        "post_id": "g84v87",
        "author": "Weeeeeee20",
        "title": "My boyfriend [29/M] wants to wait to propose to me [29/F] after 8 years",
        "url": "https://www.reddit.com/r/relationships/comments/g84v87/my_boyfriend_29m_wants_to_wait_to_propose_to_me/",
        "score": 2201,
        "num_comments": 490,
        "created_utc": 1587861739.0,
        "selftext": "My boyfriend (29) and I (29) have been together for 8 years. In the past, whenever I would bring up marriage, he would blow off my questions with a joke of something along the lines of \"I don't believe in marriage\". I finally had a conversation with him last year to help clarify if he really meant this or was truly joking. He said he wants to wait until both of us are our best selves. In his case, this meant more financial stability, which he achieved last year with a raise in salary. I was previously really unhappy with my old job and my unhappiness carried over into our relationship, so he was pushing me to switch jobs. I switched jobs in February, but between the current Covid19 situation and having a new manager with unprofessional behavior and gaslighting tactics, I am again stressed out and unhappy. I also gained about 20 pounds at my old job and am not finding success with losing it with how much overtime I still have to do with my new job. He makes comments about my food consumption and about me needing to exercise more. \n\n---\nTLDR: Is 8 years too long? Are we ever going to be our best selves?",
        "permalink": "/r/relationships/comments/g84v87/my_boyfriend_29m_wants_to_wait_to_propose_to_me/",
        "comments": [
            "I'm sorry you're having a tough time. A few things:\n\n1. Being your best self isn't a state you somehow achieve and then stay in forever.\n2. The true measure of one's relationships is how people support, inspire, defend, and appreciate each other when everything is collapsing around you--in other words, when nothing is perfect, and you are trying and failing to be your best self.\n3. I don't know you, and I couldn't possibly know the complexity and depth of your relationship from one post. At the same time, I want to say without equivocation that I would never want a loved one to marry someone who makes comments about their food consumption, weight, and exercise routines. I have a strong feeling that if he was making **kind and concerned** comments, you would've framed it as such and not simply tagged it on the end. I get the impression that his critiques of your body wear down your self-esteem and enable his movement of goal posts.\n\n**So, what does a kind and concerned comment look like?** \"I'm nervous about bringing this up, because I know it's a sensitive topic for most people, including me. I've noticed you've been depressed because of this job, and it feels like eating more XYZ has become kind of a coping mechanism. What do you think? How do you feel about it?\" **or** \"I've noticed you've been really stressed. Do you want to try this online workout with me before dinner?\" **or** \"I think you're sexy no matter what, but it feels like you've been worried about losing weight lately. Is there anything I can do to be more supportive?\"\n\nIf you wait around long enough and apply enough pressure and make yourself small enough to fit into his little boxes, he might propose to you. I'd be sad for you if he did. Eight years? You deserve someone who cannot wait to marry you. Good luck with everything.",
            "The whole “best selves” thing is a way to keep moving the goal post on you. Especially when he gets to be the judge of what your best self is.\n\n\nIf marriage is important to you, I would not keep waiting on him. Yes, you want to continually work towards improvement but someone shouldn’t be holding their understanding of “your best self” over your head in order to move forward with deeper commitment. Especially not after 8 years.",
            "Why would you need to be your best self? Isn’t the point of marriage that you’re both going to support each other to continue improving your life for... the rest of your life? You’ll never be your best self, there will always be room for improvement. Also who’s idea of “best self” is he basing that off of?",
            "I think he's moving the goal posts, and I genuinely doubt he's ever going to propose. I'm sorry.",
            "This happened with my ex. I ended up breaking up with him. We were together 8 years knew each other for 10. I figured if he wasnt ready after all that time I'm too old to keep wasting it. In another 8 years I'd have no time to meet, marry, and have kids with someone else.",
            "I’m 46. Years old, I can remember thinking in my early /mid /late 30s that I had all the time in the world to settle down and get married and have kids.\n\nYour 30s go by in a flash. one day,  you wake up and you’re 40.  You blink and your 45...\n\nIf by that time you haven’t met the goals of marriage  (if that’s what you want) or kids, (if that’s what you want) then your odds dramatically decrease on having a child of your own. \n\nAnd you find that many of your dating choices after 40 already have a child of their own, or one or two divorces under the belt. \n\nI’m not saying there’s anything wrong with this. Not at all. But I will say as a 46-year-old woman it is much easier to find men to date, Marry, and have children with in your 30s.\n\nYou don’t have time to waste waiting on a man who keeps moving the goal post.",
            "I think it's one thing to have goals and want to hit them, such as finances in a good place, etc. Those make sense. Tangible, concrete goals to help set up your future.\n\nHis  definition is so arbitrary, as other redditors said, the goalpost is just going to keep moving. What does he define as 'best selves'? What are tangible things you and him can do to reach that stage? I have a feeling his answer will be vague and change as your lives change. \n\nAlso, the food and exercise comments seem unwarranted. Different if you asked for his support and help, but his comments sound cruel and hurtful.",
            "There's a difference between, \"I really want to marry you, but now's not the right time. Let's focus on improving your work situation, and waiting for this pandemic to pass, then have this conversation in 6 months time,\" and \"I don't believe in marriage, let's wait until we're our best selves\" bullshit. \n\nIf he'd come back with the first statement, I'd be inclined to believe him. My fiance and I were keen to get engaged, but there were a few years where it was not the right time for us - we both had career and mental health issues to iron out. Once all that was sorted to a point we both felt happy with, my fiance bought the ring...then got unexpectedly fired from his job. I said, \"Well, I guess that delays our plans to get engaged...\" and he said \"fuck it\", put the ring on my finger and said, \"I don't want to let this stop me from living the life I want with you.\" Life will always throw a spanner in your works, even when you're engaged or married, so there's no point in waiting for life to be \"perfect\" unless there is legitimately something you want resolved. I actually asked my fiance the other night, \"Soo...do you feel like you'll be ready to have kids in the next year or two?\" and he said, \"I feel a lot less ready now than I did before this pandemic. I don't think this is a great situation to bring kids into, but I'm really interested in having the conversation again in a few months time when things are a little more settled.\" So, even when you don't feel ready to make a big life change, you can still have conversations where you acknowledge these big life changes are on the horizon.\n\nI don't think that's what your boyfriend is doing. What does \"financial stability\" look like for him? Is there an exact figure? Does it mean \"we have a house and two cars\"? Does he want you to have a job, or does he want you to be happy and unstressed (because right now, those two appear mutually exclusive)? Can he see himself marrying you in the not-too-distant future, even if that future isn't now? Or is he still waiting for some other sign?",
            "Agree 100% with what everyone else is saying and I want to add - please don't fall for the \"sunk cost fallacy\".\n\nOne of my best friends came out of an 8 year relationship this year. They met at 23. Right after the break up (he cheated on her so it was easy to walk away from), she had the whole \"I'm in my 30s and want kids, oh god what will I do\" -- let me tell you, it's only been a couple of months and she is THRIVING.\n\nEven though she's in lockdown in an apartment by herself, she's been going to therapy every week since the break-up (virtually for the last few sessions), she has an excellent support system in the form of friends and family.\n\n*\"When someone tells you who they are, believe them\"* \\-- he has told you several times he doesn't want to get married. Don't waste time on a relationship when you have different end-goals.",
            "“Being your best selves” is a really good way to keep changing the parameters of what he requires in order to propose. He’s being shitty. This is just a cop out way of avoiding what he doesn’t want to commit too. Also, if he can’t love you enough to propose to you at your worst, he doesn’t deserve to have you at your best. The phrase “for better, for worse” is there for a reason. I completely understand that he wants to be financially stable etc, that’s all sensible. But to me it just sounds like he’s avoiding the commitment by creating movable goal posts.",
            "Have you considered that the relationship is the thing holding you back from being your best self?\n\nIt's hard to like work when you're not fulfilled in other parts of your life. It's hard to be healthy when you've got no one supporting you to want to do better",
            "[deleted]",
            "Stop wasting your youth on this man!",
            "Unfortunately, I don’t think he sees you as his forever.",
            "don't give your thirties to this guy. he actually has told you the truth, but he expects you to be the one to act on it instead of him. he doesn't believe in marriage to you. an imaginary different you maybe, but probably not even her.",
            "He's telling you what he wants, and what he doesn't want.\n\nAnd he doesn't want to marry you.\n\nThere's nothing wrong with that. Maybe he just never wants to get  married. Maybe he's not totally against the idea, but just doesn't want to marry YOU.\n\nEither way, he's made his choice.\n\nThis goal-post-shifting around your \"best selves\" is him trying to get you to shut up about it, without requiring himself to make any changes.\n\nNot the best plan in the long-term, but I guess it's been working for him so far.\n\nSo now what?\n\nWell, you get to make your own choices.\n\nAre you happy with him as things are right now? If you never got married to him, would you have a happy life?\n\nIf so, stay with him as long as you like (as long as he's also happy to be together).\n\nIf not?\n\nIf getting married is important to you?\n\nIf being with him, but not being married will leave you unhappy in the long-term? Then make the changes you need to make. Make a plan and get out of there.\n\nIf you're just not sure right now? Especially with the current state of the world? Then take some time to think about it.\n\nMake some progress towards \"becoming your best self\", but for you, not for him. Work towards finding a new job. Learn something new. Save money. Exercise. Whatever you think will get you one step closer to your goals.\n\nThen, 6 months from now - re-evaluate things. If you're still not sure, give it another 6 months. Rinse, repeat.\n\nThere are no right or wrong answers here. It's your life, so make the best choices you can with the information you have right now. \n\nIf you end up making a mistake? It'll be ok. You can start again.\n\nYou got this.",
            "He doesn’t want to be with you.",
            "Sounds like you’re wasting your time for a dangling carrot. \n\n\n\nIf marriage is important to you , I’d advise you to find someone who sees eye to eye with you on the subject. I hate to jump straight to the dump him subtext but too often these sorts of situations lead to a whole lot of wasted time from one party and the very same only realizes it when one day the partner in question either ends the relationship or runs off elsewhere and suddenly there’s not qualms about taking the next step, whatever it may be. \n\n\n\nHopefully you can come to a more reasonable timeline with him. Relationships are work. But don’t rule out leaving if there’s no consensus. In this context, your happiness takes precedence.",
            "Dude doesn’t want to marry you. Time to move on.",
            "I don't think he wants to get married.\n\n&#x200B;\n\nBTW if you are unhappy with your job and your weight gain you should fix that...for yourself.",
            "Why wait around to find out? You can make the decision to leave the relationship because the 2 of you are now on different paths. Go and make your own happiness.",
            ">wait until both of us are our best selves.\n\nThis is the equivalent of kicking the ball forward every time you try to pick it up. You'll probably never achieve his idealized version of your best selves.",
            "I am sorry you have been waiting this long. I'll tell you my experience of this.\n\n\nI aim to be close to my \"best self\" on my wedding day.  I am engaged to my best friend and we had been together at 2+ years at the time we got engaged. 2 years isn't long, but we are still in engaged and I am 32.\n\nHe approached me and told me he loved me, and I don't know what came over me but I cried telling him I about how I had expected to be engaged by now from our conversations. I wasn't sure if he was joking too much or if I had been misunderstanding him. He went and bought a ring that day, after we talked seriously about marriage.\n\nIt was an honest moment that resulted in him proposing a few days later. He said he was waiting to save enough money for a ring and more, but we are in a time in our lives where finances will be tight for a while (graduate school). I said please get me something with your birthstone, I just want it to come from you.\n\nHe made it happen, because he wanted to get married. I am not perfect, and least of all right now. But we share common goals to better ourselves and help each other achieve them, and cheat together (on our diet by eating pizza) along the way. We love sharing our lives together. There is a part of me that wants everything to line up perfectly, but on the other hand, life is messy sometimes. He is wonderfully loving and uplifting and I'm insanely lucky to have found him. I love our engagement.\n\n\n\nI have been married before, and there was no proposal. It's a long story but the short of it is, some guys can feel a lot of pressure to propose. We had a bad and short-lived marriage, and it made me realize how important the *proposal* was to me.\n\n\n\nI don't know if this is what you want to hear, but 8 year might be telling you.. he's still not ready to get married",
            "“Best selves” means he thinks he can do better but is just too lazy to look. When the reality is, YOU can do better and get outta tbere.",
            ">He said he wants to wait until both of us are our best selves.\n\nThat's not how life works. If you have to reach this nebulous, undefined level of perfection before you actually live your lives, you won't ever get around to the living part.\n\nAnd even if it that line wasn't bullshit, why is *he* the lone arbiter of what is and isn't your \"best selves\"? He decides and you just live with his judgement?",
            "He doesn’t wanna get married. Do you wish to continue the relationship even if you never get married? That’s something that you might have to accept in order to stay with him. \n\nI’m going through something similar, we are committed but he doesn’t believe in marriage and that’s ok for me since the actual ceremony is not that important to me, what’s important are his actions. So, do your bf’s actions make you want to stay or is never getting married or being common law a dealbreaker (which is fine) for you?",
            "It took you 7 years to realise that maybe he wasn’t joking when he said he didn’t believe in marriage? Girl, this one’s on you. Those conversations need to happen well before 7 years into a relationship.",
            "When he said he didn't believe in marriage earlier on in the relationship, why didn't you believe him and make your decision then.  I'm confuse as to why you are surprise now. When he gives such a vague answer with regard to the proposal with no timeline, coupled with what he told you earlier, I'm guessing the answer is never. You have to make your decision based on that.",
            "Honestly, being \"our best selves\" isn't a real concept. Because as humans, we are always changing and learning. There is no definitive point where you are \"your best self.\" That's just my personal opinion but I feel like this is relevant to your situation. Also, another personal opinion but I think 8 years is too long to not be married. Think about it this way, you have already spent a significant amount of time with him. Life is a gift that shouldn't be wasted on people who don't deserve it. I'm not saying he doesn't deserve it because I don't know him but definitely consider whether or not you want to continue wasting time with someone who doesn't even know if he wants to spend the rest of his life with you. On the other hand, I would try to figure out the root of his reasoning for not getting married yet. Maybe he does a legit reason that he hasn't told you yet or maybe it stems from his childhood. The takeaway from this is do what you feel is going to benefit you in the long run. It may mean you end up being sad for a while but you'll find new happiness with someone who shares your desire for spending their life with you or perhaps he'll come to the conclusion that he does want to marry you and it'll all work out. So just try to look at this from both sides and see which situation is going to better you in the end. I hope that helps a little. :)",
            "I think everyone should know within the first couple of years of dating if they want to marry, (of course maybe not the real young ones, they may need to grow up more ..) so if you both don't know, and he is wasting your time, and some of your best years, throw him to the curb. You won't have trouble at all moving on. He sounds like an absolute fucker.",
            "8 years?! Sorry girl, when a guy knows.... he just knows. If you were his ‘mountain woman’, he would have already proposed. You’re a stepping stone. He might not even know that but when it comes down to getting married to you, he will always come up with an excuse because it just doesn’t feel 100% right. My personal timeline is a year. After a year a man already knows if he sees forever with you or not, just like a woman already knows. Stop wasting your time and go after unconditional love. You guys might end it and funny thing is he might marry the next girl after 6 months. When you are truly in love, all the conditions go out the window.",
            "[deleted]",
            "He's stringing you along. Ditch him.",
            "\"He makes comments about my food consumption and me needing to exercise more.\" IMO that's a warning sign and a red flag in itself making comments like that.",
            "My uncle waited 12 years before marrying my aunt. Some people just take a really long time. However that does not mean that it is the case here. By the way he is acting and putting things of or putting it on his view of your best self (only you should judge what your best self is), makes me think he is stringing you along. He is not planning on ever getting married imo. If marriage is really important to you, then perhaps you should have a hard look at your relationship and decide if you want to take the gamble or cut your losses now. \n\nAnd if you are always waiting for your best self it’ll never happen, because there is always room for improvement...\n\nTalk to him again, how does he feel now? Tell him how you feel about it. Let him know he is at the brink of loosing you here, by telling him your feelings. Don’t go make ultimatums however, marriage ultimatums are never a good thing imo.",
            "If he doesn't want to marry you after 8 years, I think he just doesn't want to marry you.",
            "He is never going to marry you",
            "I have this very odd way of looking at things- which is maybe counter productive and horrible. Here goes- Perhaps Your Boyfriend Is Correct- and YOU are not your best self. You are stressed, unhappy, in poor physical shape, and needy. \n\nYou've been with the guy for EIGHT years. So did you ever consider that perhaps HE is what is keeping you from being your best self?\n\n I would venture to guess that with positivity around you, you'd have the self-confidence to address the things that you personally find objectionable about both yourself and the situations in which you find yourself. This is possible IF you give yourself the opportunity, and that opportunity does not involve this man.",
            "I had the same problem with my boyfriend.\n\nAfter A LOT of fights and some communication, we are together. \n\nWhat I found out, was that I was pushing marriage when actually I just wanted to know he was committed. It's the engagement and promise I needed. The wedding could wait til we were more economically stable, even if that takes a year or two.\n\nWhat his issue was. Wasn't that he didn't want to marry me. But as a man he feels a lot of pressure to provide for US and make sure we are stable and safe. A wedding and marriage just seemed stupid to him when we BOTH know we can't afford it now. What he didn't realise is that people can take over a year to plan a wedding. In his head, a proposal meant we'd get married maybe 2 months later while broke.\n\nAfter talking, we have figured it out. He'll propose soon, while I get enough time to plan out the wedding.\n\nSo my main advice is:\nIs your man generally a good man in other aspects? Few mistakes but still a good man?\n\nIf so, then talk to him. Tell him it's the commitment, that you're scared about your biological clock. That you are willing to work on your better self and move forward together. That the wedding doesn't have to happen NOW, but you need to know that he cares.",
            "I'm going to be really straightforward here. Things aren't looking good for your prospects for marriage, and you only have yourself to blame.\n\nHe point blank told you he didn't believe in marriage. You decided that he wasn't serious. That was not a smart thing to do. He does not want to get married, and you're trying to nag him into it.\n\nYou know that he's predisposed to not wanting to get married. That means if you're going to motivate him otherwise, you're going to have to really show him something that he doesn't think he's ever going to be able to do without. Gaining 20 lbs with no end in sight is not going to make that happen.",
            "It's way too long. They only way I'd put up with that is if you're either o.k. with not getting married, period, or you're willing to work on the relationship and how you're going to deal with his ambivalence. \n\nHowever, right now?  Wait two years. Nothing will be the same. You'll know then.",
            "I was going to say “just talk to him about it” until I read the part about the comment he had about your weight. That’s an incredibly weird/harsh thing to say, especially to a partner of 8 years. \n\nIn my opinion, there are better ways to bring up the concern of weight, most of which are listed in other comments.  \n\nBut, I can understand if you would want to work things out between this guy and yourself. I would have an honest, heart to heart conversation about this. Talk to him and explain to him your want to get married and start a new life (kids, new experiences, etc...) and really emphasize the fact that you want to do it with him. He may be nervous. Especially with all of this COVID shit going on, maybe he lashed out because he’s anxious about job security, or finances, or who knows what. \n\nIf that conversation fails it’s not worth putting yourself through a relationship only to be let down. Remember, you guys are partners, not just individuals. It does matter what you want. Just because he doesn’t feel it’s right to get married doesn’t mean that you have to feel that way as well. Find someone who does have the same plans as you.",
            "He has no interest in marrying you. Make choices about your future accordingly.",
            "Unfortunately as a lot of other people are saying on here he will always find an excuse not to get married. If marriage is really important to you and not to him then you need to think if you want to be in this relationship, especially with someone who can’t just be honest with you.",
            "I was you a few years ago. At the age of 28 I got engaged to my (now ex) boyfriend of almost 6 years. I had been asking him about marriage for a few years at that point and he always put it off like “that’s not really important. Maybe someday”.  Our engagement lasted three months before I called it off and broke up with him because the writing was on the wall, and had been for some time. He made it very clear to me that he thought weddings and marriage were stupid, and he only proposed because he knew I wanted to get married. He refused to even talk about the wedding with me as I was starting to plan it, and he acted super immature - like wouldn’t even try to figure out a guest list with me.\n\nHe did not criticize my weight or appearance, but he did start implying that I was an idiot about half way through our relationship, and after years of hearing this I had started believing this to be true. Which is ridiculous - I am a college professor and he had barely graduated high school for christs sake. I’m not an idiot, but I was young and gullible when he started gaslighting me. The wedding planning process made this all so clear to me and I ended it. I lost a few thousand dollars in deposits, but at least I didn’t end up marrying this jerk who didn’t want to marry me.\n\nThis guy does not treat you right, so even if he did want to marry you please don’t settle for someone who is going to criticize you. You’re better than that. But after 8 years he doesn’t want to marry you yet... he’s never going to. This isn’t about you, it’s about him. Please move on from him before he wastes any more of your time.\n\nWhen I broke up with my ex, I took a year to do some self reflection and really find myself again before starting to date. Now I’m with the love of my life, because I realized what I needed to make me happy in a relationship and found that person.",
            "He told you from the beginning: he doesn't believe in marriage. (Or maybe he does, but he doesn't want to marry you specifically. This could be conscious or sunconsious.) In any case, marriage isn't on the table, so accept that and decide on the future you want within the options available to you.",
            "My gf and I already knew that we want to be married within a year of dating. \n\nWhen you've dated several people and know what you like and dont like and finally find that perfect match, you just know that it's right and you don't need any other validation. \n\n8 years is way more than enough time to know. You two might not be as happy or as well matched as you think. \n\nTime for a serious discussion I'd say.",
            "Nobody who really wants to do something waits 8+ years to do it. Unless there's something preventing them. In your case there isn't.",
            "he does not want to marry you, sorry...\n\nbut also, don't marry someone who obsesses about physical appearance and makes you feel less than/monitored, especially if this is related to your \"best self\". marriage is (hopefully) a very long time. you will both get older, go through trials, and bodies will change. this is not a \"for better and for worse\" person. he may become one but i doubt it will be with you\n\nand finally, sad to say, it's likely he'll be married to someone else in just a couple years",
            "Marriage is up and downs. We show our best and worst sides in marriage, and any long term relationship. I'd say he got unrealistic expectations of you.",
            "Honestly I’d have married you by now. But there might something blocking him from taking that step that has nothing to do with you. Financial stability is a good reason, but it might be an excuse but not one about you, one about him.",
            "Best selves? He's just given you a bullshit answer. Nothing more. Financial stability is a reasonable goal, but *best selves* is such a vague and useless notion that he can interpret it in any damn way he pleases and still not be ready. Get a more concrete answer from him, one which doesn't involve such meaningless words. Relationships don't thrive on uncertainty.",
            "After 8 yrs.  More patients than me",
            "This sounds like what one of my best friend’s is going through. It breaks my heart, he should not be weight shaming you! It’s proven that saying that kind of stuff only demotivates people. You deserve better than that. As for the marriage thing, if it’s something that is important to you and not to him, at a certain point you have to ask if your life goals are compatible.",
            "Look there’s always going to be something.  If it’s not the economy, your family, personal issues or in this case, a pandemic - conditions will rarely achieve perfection.  And the idea of a best self as the holy grail that triggers marriage is well, waaay too weighed with expectation. \n\nIf I was making a commitment with someone & to that someone, wouldn’t you want to choose a person who loves you as you are - even while knowing you can, might and will do better ?  When Rilke wrote about how we prepare ourselves for the task of loving, he didn’t speak of achievement - he spoke of ripening to the task, not perfection.  There is inherently a humility in loving someone and choosing them to be your life partner.  It’s this awareness that love is difficult & it asks greater things of us.  \n\nDo you think someone who’s waiting for you to be your best self is ready for that? \n\nAdditionally, let’s not focus on the person you can’t control, let’s focus on the one you can: you.  Why do you want to marry him?  And how do you feel it will change things? \n\nI realize 8 years is a long time together but depending on the people, that can either be a deep or shallow period.  It’s important you think on these questions as this relationship may or may not work out, but the reasons for wanting what you want will remain. \n\nReading your post, you seem self aware enough to know what you need and want to work on for yourself.  Your bf on the other hand sounds like he’s simply telling you in his own way, that he isn’t ready and/or that he may not be ready for it with you. \n\nLastly, we’re in the grips of a pandemic.  A world crisis of unknown proportions.  Historically, situations like this tend to make us all more critically aware of how little time we may have - if after 8 years he doesn’t think you’re the one to be in the foxhole with, when a post-pandemic world isn’t going to be tinder-friendly well, I think you have your answer.\n\nPS I’m not fussed about using time as a sole metric to determine furthering a commitment, so please note that my comments here are specific to the OP.  I’m not one to wait long but some people need a lot of time and as long as they’re on the same page as their partner, it works out.  Best of luck op.",
            "Do you guys live together?",
            "He’s comfortable with your relationship how it is. If someone wants to marry you, they do. Please take a close look at if he’s worth waiting for because you may be waiting a long time for something that may not happen.",
            "remember learning stuff about marriage and “waiting” periods in school and it really stuck with me. There is no better chance of staying married if you wait longer than 2-5 years to get engaged. The divorce rate actually goes up after that because there’s obviously some sort of hesitation (unless of course the couple starts out dating in their teens). The whole “best selves” thing is pretty much BS, marriage is about “for better and for worse, for richer or for poorer” ect. You’re both almost 30, you’re at a prime age to get married really. Its selfish of people who dont want to get married who simply sit in the comfort of a relationship whilst knowing their partner wants to take that step when they dont. It wastes a lot of the other person’s time (and makes it worse if they want to have children.) Sounds like he’s just sitting where he’s comfortable and doesn’t intend on really moving forward.",
            "Spoiler: you will never be the \"best self\" that he is waiting for. Your irons are to settle with these knowledge, or leave and find someone who thinks you're amazing.\n\nPlease bear in mind that you wouldn't be \"throwing away so many years\" in the relationship - you don't keep going to high school after you graduate just because it's taken you 12 years to get to that point.\n\nIf it no longer serves you, it is smart to move on.",
            "You have to make a decision,  fo you can't to be married or do you want to stay with him? I told my husband after dating for 5 years and having a house together, that he would need to marry me or we would be breaking up.  He didn't believe in marriage but loved me enough to do it. We eloped and ate happy 8 years later. Give the ultimatum but be prepared to leave and move on if he says no.",
            "RUN. RUN. RUN. And I know it will be hard, but don't look back.\n\nI dated my ex-husband for 8 years, heard the exact same BS the whole time. \"Financially stable\", \"best selves\", etc. etc. He cheated on me and gaslighted me our entire relationship, which I unfortunately didn't realize until much later. I waited and waited until FINALLY, after our umpteenth 'break', I put my foot down and said we aren't getting back together unless we are engaged. He proposed to me with a $25 ring in a parking lot while playing on his iPad (a real romantic, that one). But I didn't care because I was finally **enough**. (or so I thought)\n\nFast forward - we walk down the aisle, he looks miserable the entire wedding and in all the photos. Two weeks after our wedding, he told me \"We rushed into it\". After 8 years. Rushed. Into. It. He moved on with his mistress-turned-girlfriend but dragged our divorce out for 2 years.\n\nI remember being 8 years into the relationship and thinking....I've invested too much time/energy/tears into this, I don't want to start over, we are obviously MEANT to be together if we have been together this long i.e. the **sunk cost fallacy**: Individuals commit the sunk **cost fallacy** when they continue a behavior or endeavor as a result of previously invested resources (time, money or effort). It was an incredible mistake but my self esteem was so low at that point, I couldn't see any other way.\n\nI was never skinny enough, athletic enough, hair the right color, etc. I was never enough, period. And this is what sounds like is happening to you. He makes you feel bad about yourself while acting like *he* is the responsible adult who is just waiting for you to get it together. Don't listen to him. It will be really tough to break away after that much time invested. But I can 100% promise you that you will feel BETTER once you are free from this person. If I can be of any assistance or just someone to listen, please reach out to me. <3",
            "He's not going to marry you.",
            "You’ve been together eight years and he has told you the entire time he doesn’t really believe in marriage. Why are you still asking?",
            "You know when you won't be your best self? Very freaking often. You won't be the best version of you when work is hard, when pregnancy is tiring you out and a newborn is screaming all night, when family deaths cause you to grive for months. \nIf the man wants to marry you, that includes the bad parts of you. It doesn't seem like he wants that.",
            "He's stringing you alone because it's convenient and you'll be too old to have kids.\nThen he'll leave you.\nA guy tried to do this to my friend. She left, found another guy and got married 3 years later to someone who couldn't wait to marry her and still clearly adores her 7 years later.\nYou deserve that.",
            "I was in a very similar situation, I was with my ex boyfriend for 10years all in all, but officially in a relationship for 7years. He also gave me the 'i dont believe in marriage it's just a piece of paper' and this continued for many years from when I first brought it up. He was also the same with kids. I had the conversation with him that one day the fact he didnt want kids or marriage would probably come between us but I couldn't make him compromise in what he wanted. We bought a house together and lived a happy 11months together, I got a new job and with my manager being awful with me I was so unhappy. I got no support from him at all and that for me was the final straw. I left to find myself again after all that time. He was heartbroken and told me he was looking for an engagement ring and had been thinking about kids recently, but at no point did he ever say this to me. It was like when he lost everything suddenly he tried to hold on as much as he could. \n\nEveryone is different I know but for me walking away was what I needed, we had become friends living together and there was no romance between us and I dont think he would of ever proposed. But I could of never asked him or been happy if he compromised on the true him.\n\nYour situation is different in the fact he wants some stability before he proposes, I would have a conversation him and see where he stands and see if he will marry you in the end or if he is just moving the goal posts in the hope of dragging the situation out. Never compromise what you really want in life, even after an 8 year relationship you still need to be happy and you still need to put you first.",
            "Time to dump him & move on, if he doesn’t know by now that you are “the one” he never will.\nThis Best Selves BS is Gaslighting. Hes keeping you hanging around until something better comes along.\nDon’t waste another 8 years with someone who won’t commit to a future with you.\nYou cannot pressure a man into marriage even if he goes along with it, he will end up resenting you & will leave.",
            "They won't ever. I left my ex after 6 years. He kept dragging it on. He'd make every excuse. One was even that I didn't get paid enough. Know what I did? I got a 20k raise two months later. Unbelievable, I know- but all it did was turn the \"we're not ready\" into another issue.\n\n. If you leave it's the only way to get them to realize they have to decide. In my case my ex decided the split was the best option. But it's better than me waiting another six years. Not gonna lie tho it was unbelievably hard to come to this reality. And Im still sad 6 months later.",
            "He's delaying it because he doesn't want to marry you.\n\nIf getting married is important for you, and I understand if it is, you need to get out and start a new relationship.\n\nAlso, get in shape. Being fit will immensely increase your ability to find high quality men.",
            "Yes it’s too long this man will never marry you.",
            "Hes told you he doesn't believe in it.\n\nHes moving the goal posts to keep you because he knows you want this and he doesn't.\n\nHes not allowing you to meet someone who does.\n\n\n\nBeen there granted not as long I left and in time he did the same to the next girl ..  so it's not a you problem it's a him problem.\n\n\nAre you happy with this stagnant relationship or just comfortable and too scared to leave.\n\nIt's ok to say to someone I'm not putting you in a situation where you feel forced to marry me to make me happy. It's not ok to keep giving wishy washy excuses... you said you dont want to , it's something I do want so i am ending the relationship.\n\nBe prepared this might get a bit ugly it's the first time you won't be doing what he wants . So just be prepared that he will beg and or offer engagement ... but remember it's no relationship if u have to resort to leaving to get what you want",
            "I’ll be blunt here: that sounds like a measly excuse on his end. If somebody wants to marry someone, they will do it as soon as they can. And even if he was being genuine, why can’t you figure out your best selves... together? No one is ever fully ready for marriage. It takes maturity, selflessness, and patience. Perhaps marriage is something he isn’t ready for. This is something that both of you need discuss because you wouldn’t want to waste your precious time with someone who doesn’t share the same goals as you do.",
            "Go read The Art of Fuck Yes by Mark Manson. Basically if either of you is not a fuck yes to getting married, then it's a no. He sounds like he isn't all in. You are at a great age to marry. Spending 8 years together means you know each other well enough to make that decision. I wouldn't invest any more time with him if he can't say yes now....and mean it.",
            "My now husband had done something similar. We were together for 5 years before getting married. I was startling 2 jobs and clinging to something that I really wanted that should of been a hobby. Finally committed to my money making job which stabilized my career and schedule. We got married a year after that. There is an argument for growing together. Marriage isnt about being your best self at the time. It's about committing to your partner that you are going to continue to grow together and get better with them. Maybe you can talk thru that. But I also agree with dont force it no happy marriages start with an ultimatum. And marriage isnt everything. We mainly did it because we want to have kids. Otherwise what's the point of contractually obligating your love.",
            "When my husband and i got married we weren’t working top shelf jobs so we didnt have a giant wedding. But it didnt matter to us. All tht mattered was tht we were both there n happy. So the fact he wants to push it off wven longer makes me think he doesnt want to marry u at all unfortunately. It sounds like he will just keep making excuses.",
            "Omg big hugs to you.  I am sorry but 20 lbs shouldn't be a deal breaker.  I gained 100 (which I fully realize is a deal breaking weight for a lot of people and completely understand), and my husband never complained once because it was directly related to having our daughter and I soon lost it but he was supportive the ENTIRE  time, even at my heaviest. \n\nAsk him to be more sensitive, sometimes other people don't realize they are hurting your feelings.  Let him know you're aware and trying.  He should back off then, if he doesn't I would take a minute to evaluate how much he cares.",
            "I mean he’s made it pretty clear he doesn’t want to marry you.  He wants a you with a better job and 20 pounds slimmer.  Maybe.  Maybe when you get a better job and lose some weight he’ll want you to wear red lipstick too.  Who can tell?\n\nNobody.  He may like future you he may not.  But he has already told you he doesn’t want to marry YOU.",
            "If you,  as you are now,  aren't the person he wants to marry them the person he wants to marry isn't ever going to be you.  It might look like you-but-thinner, but it isn't your personality,  your quirks,  your sadness or your happiness.  He wants to pick and choose the things in you he thinks will make the perfect partner which means he doesn't like whole segments of the things that make you YOU. \n\nSo yes op,  8 more years is too long.  The eight years already past is sufficient for you to know he isn't changing and he isn't joking.  He doesn't love you.  Not when he's waiting for you to change.",
            "I'm kind of shocked that people will stay with their partners for this long without some kind of commitment. It has been 8 years, shit or get off the pot already. I would be gone after 3-4 years at the most.",
            "8 years, in a way you are married. What you are in is a relationship fading with time.",
            "For eight years, your boyfriend has told you that he won't marry you. As soon as it began to seem like you actually might leave him over that, he now will marry you, but only once you become your \"best self\" as defined by him? \n\nHe doesn't want to marry you. He's told you that two different ways. He is consistently telling you that you, as you are now, are not someone he would marry.\n\nPlease listen to him and believe him. It's up to you to decide what to do with that information, but please stop thinking that a man who keeps telling you that he doesn't want to marry you doesn't actually mean it after eight years of sticking by what he says.",
            "I was also in a relationship for 8 years and said exactly the same things. The similarities are spooky. The truth was that I didn’t want to marry her and I didn’t want to admit it to myself because I knew it would hurt her and I would feel like an absolute failure. My fear of change kept me paralyzed, and in the end it just made things harder.\n\nWe broke up a year and a half ago. It was very painful, but in the end we have both agreed that it was the best decision, and we are both happier with our new lives. If he won’t pull the trigger on marriage or a break up, I think that you probably should. If you ask him to marry you and he says no, there is more life ahead of you, and you will be ok. If you choose to break up, the same is true.\n\nI wish you the best.",
            "I've two things to offer:\n\n r/loseit for weights loss advice and a knowledgeable community. They're very positive and encouraging. Even when someone's down, so long as they talk, that sub can help out. Pair that with r/GetMotivated and it adds some brightness to your day.\n\nI dated my partner for 10 years. Mainly we took so long because I refused to marry sooner. We started dating in early high school and I never wanted to get hitched before finishing university. I took a bit longer than my partner did in getting my degree, then studied abroad for a bit, but the very hour I got back home it was to a proposal. I gave a definitive goal (and honestly, I was okay with breaking it about halfway through, but by then it was a goal for both of us), and I was always very clear about why. \n\nDuring the decade between \"wanna go see a movie?\" and \"I do,\" I gained a good bit of weight. (We both did, admittedly.) The only time either of us spoke about the other's weight or fitness was out of concern. Maaaany words of complaint about our own bodies, but I never encountered anything except support from my partner. Never. He never judged how I was doing or why, never commented on if I should eat that or diet like this. He was very respectful because he loves me.\n\nEight years is a long time to hold out hope in muddy waters. For us, by year eight the waters were crystal clear but the goal posts were still a bit ahead but obviously growing closer. Do you feel any closer to your goal by now? Something else worth asking, do you want your boyfriend's approach to end up being applied to your next goals? Buying a place to live? Maybe later. Having kids? Maybe later. Traveling? Maybe later. How old do you want to be before you're happy with your life, like this?",
            "He doesn’t want to marry you.",
            "Marriage isn’t for everyone and isn’t required in every relationship. A couple of my friends have been together for about 12 years now, still not married. They’re waiting until he finishes his MD before they do that, however it was basically an agreement that would be the timeframe.\n\nI feel like if marriage was this important to you you should have bounced when he said he didn’t believe in marriage. He let you know up front, you continued to stay hoping he would change. I think that reflects negatively upon you, not him. This may just not be what he wants, and for many people that’s okay. For you it isn’t, so time to start over I think. You’re only 29, you’ve got a long time left on this planet to find someone you want to marry.",
            "I’m sorry to say but if after 8 years he doesn’t know if you’re the one, he never will.",
            "I know two people who were together for 12 years before they got married. 8 is a long time but not unheard of.",
            "So, you're unhappy with your job, your boss's gaslighting you, you gained weight and can't seem to lose it.\nWhy is marriage your first concern?\nI 100% agree with him. If he actually want the two of you to marry as your best selves and it's not just an excuse, then right now it's not the time.",
            "Why do you need to get married? What does it mean to you? Would you not have kids if you weren’t married? Get a house?\n\nIf you have a real answer then it means you guys have different priorities",
            "So do you really want to marry this guy or are you seeing a potential marriage proposal as a gaslight for all the crap happening with your job and the world right now?\n\nA proposal doesn’t last, the wedding planning follows and it can be very very stressful.\n\nEverybody else on here will focus on your boyfriend “stretching the goal posts” because it appears to be not what he wants. That is totally his decision and by the sounds of it he has been pretty honest with you in the past.... \n\nMaybe instead focus on your self improvement? \nYou may only want this as a quick endorphin boost, to your otherwise depressing set of circumstances right now.",
            "Might get downvoted and unpopular but I find his point pretty reasonable tbh. Financial stability before having a family is important, and he may see you as somebody who lacks hard work or determination. Also getting stressed and taking 20 pounds in few months due to stress isn't really normal.\n\nIf I was him I would question indeed your job and psychological stability towards stress. If you can't really handle jobs and stress when it's just the two of you how can you when there will be also children on top of that?\n\nHe has every right to look for certain qualities in a person before committing into something that big and you, imho, should talk about what he sees and what he finds important. Jm2c at least but I don't get why he gets all the blame for making sure he's marrying a reliable person.\n\nMaybe others are right and he's moving the goal, but then ask yourself why? Is it related to you or him? Maybe he loves you but he sees some red flags.",
            "Lol you've hit the wall and want to lock him down. Hes understandably reluctant. Dont be too pushy or you'll kill it dead",
            "I think once you get rid of this dude, you will become your best self on your own terms and by your own definition. Then someone will propose to you who is so afraid you'll say no his hands are shaking and he's trying not to cry! Best of luck.",
            "It's possible that you will break up and then a year or two down the road you look him up and see that he's married the next person he dated. But who knows, maybe he doesn't want to be married.\n\nBut I think the \"we have to be stable before being married\" mindset is pretty dumb. If you don't imagine that you're going to grow together, it's going to seem like things are fucked up the moment there's a setback in either of your lives or in the marriage.",
            ">a joke of something along the lines of \"I don't believe in marriage\".\n\nThat's not a joke.\n\n>I switched jobs in February, but between the current Covid19 situation and having a new manager with unprofessional behavior and gaslighting tactics, I am again stressed out and unhappy.\n\nSo new job, same shit. Your BF now sees you as the common denominator.\n\n>I also gained about 20 pounds at my old job\n\nWas your old old job to eat, or powerlift? Because if not, you gained 20 lbs all by yourself. From his perspective, *again,* you are blaming your personal shortcomings on work.\n\n>and am not finding success with losing it with how much overtime I still have to do with my new job. He makes comments about my food consumption and about me needing to exercise more.\n\nSame again. No time to exercise? Fine, blame the job. Over-eating? That's all you.\n\nHonestly, you sound full of issues and excuses for them. You do not sound ready for marriage. That's why your BF isn't proposing to you.",
            "It seems like the topic of being married may be not as important to your SO as to you. And there is nothing better about it than having a clear conversation, where YOU state your position, your emotions and your EXPECTATIONS to him. Then let him explain his side and just dig deeper into his \"best selves\" idea. Maybe he has some good points, why he is hesitating in his process of deciding.\n\nMarriage per se is a topic not everyone wants to give in to. It can be quite expensive and in the end it's just a construct of dependency. It's not a bad thing not wanting it. Respect his opinion too. (I don't say this IS his opinion.)\n\nIn the end, the question is: Is being married THAT important to you. Why is it THAT important to you? What about the idea of living a happy life with your SO WITHOUT being married?",
            "In situations like this you need to be selfish.",
            "Your \"best self\" to marry is like the \"right time\" to  have children. There are objectively a few boxes one needs to tick off before getting married or becoming a parent but there hardly is a perfect timing to do so. \n\nSounds like he's not ready or you're not the person he wants to spend the rest of his life with. You should find out what is, exactly,  that's stopping him but stop pressuring him. He's saying, albeit not in the clearest way,  that he doesn't want to marry. Listen to him,  communicate.",
            "You are never your \"best selves\" anymore than you are now. You either are or your not ready to be married. He obviously isn't and probably won't be. He likes it the way it is and he's suckering you into something that will never be. Why buy the cow when the milk is free?",
            "Il agree with what others have said in terms of holding the idea of \"best selves\" over your head. \nMy 2 cents: the bottom line is that whatever the excuse is, it doesnt seem like hes ready right now, and maybe you're not either given the difficulties with work and current pandemic. You should definitely talk to him more about marriage in general.. there might be something else you're missing. \n\nIve heard of women proposing to their boyfriends before, maybe this isnt out of the question? And besides, agreeing to marry doesnt mean on the spot.. u can plan your wedding for whenever suits you.. when your lives are a bit more settled rather than \"the best they can be\".",
            "This man needs to eff off about your body and your fitness. He's going to give you a complex. Get out of there before it fucks you up.",
            "Why are you focusing on the \"best selves\" bit when he told you he doesn't believe in marriage? You are putting all your hopes in that if you hit some random, obscure metric he will finally change his mind, but he won't; odds are he's stringing you along and telling you something to keep you around.\n\nAfter 8 years, if he's not telling he wants to marry you it's because he doesn't want to. It's one thing having a definite plan and a good reason to not propose, it's totally another to keep things so vague and not give you a straight answer after EIGHT years together. I'd almost bet he's using the \"best selves\" excuse because he sees you have had unstable jobs and put on weight so he can blame you in a way for no getting engaged.",
            "does he have divorced parents? sometimes people with divorced parents get quite nervous about the thought of getting married. Also for comparison my parents have been together for over 15 years and never gotten married even though my mother would like to and yet they've lived a happy life together so far. i wouldn't say this is something to break up over at all, him not wanting to currently marry you doesn't mean he doesn't love you, you both need to be ready for marriage to get married, have a think about if you're willing to wait or not.",
            "Be very careful with everything going on. The comments from the redditors, there is a heavy victim bias here. Have a deeper discussion. Be very emotionally articulate and understand no one here, but you and your boyfriend, can choose what to do.",
            "His comments on your weigh are shitty imo, and his \"conditions\" are an excuse to avoid marriage which he has subtly tried to explain to you he doesn't want, but he's probably afraid (correctly) he will lose you if he says the truth. But one thing is true, you seem pretty unhappy with where you are right now in life in general, why is marriage so important to you now?",
            "He doesn't want to get married the rest is BS which being on this sub I have begun to hear quite a bit. It may be the new, it's not you it's me Since he's getting on you about your weight he's actually saying, it's not me, it's you. \n\nHe should find a new term other than best self, it's meaning has nothing to do with materialism or consumerism. Part of it is the opposite of being mercenary. \n\nUsing the *norma*l human definition of best self, nobody becomes that person. Keanu Reeves may be the only one who comes close. If you're going by his standard of salary and weight, than you may make it, but that's not your true best self. Best is subjective anyway, and who knows what could be on that list-- especially if he's making it.\n\nSorry about the 8 years. When someone says they don't believe in marriage, they aren't joking, even if they're laughing as they say it, they don't want to get married.",
            "Why does *he* get to decide when you're your \"best selves\" and therefore finally ready? What a load of crap. People grow and change together as a couple over their lives together. Who's to say your \"best selves\" won't be in your 70s or something? If dude can't commit yet after 8 years it is never going to happen.",
            "Being your best selves before getting married is bullshit. You're not gonna be your best selves your whole life. That's the entire point of promising to spend you whole life with someone, through sickness and in health blablabla. Now I understand not wanting to marry young without a lot of life experience and wanting to feel you really know your partner before you commit. And I personally don't care about getting married but I care about the commitment. Has he ever said to you that he wants to spend the rest of his life with you? Have you had discussions about your future, marriage, kids, fantasized about being that old couple holding hands down the street? After 8 years you both should have an idea where you want this relationship to go.",
            "I never particularly \"believed\" in marriage either, whatever that really means. All through my 20s my stance was \"why get married?\". In my 30s I didn't really change my stance, and my girlfriend also wasn't super into marriage, but she asked \"well, why NOT get married?\" so now I've been happily married for six years. We had a very small and cheap reception/party and didn't make a big deal out of it. Sounds to me like your boyfriend actively doesn't want to get married.",
            "What \"are our best selves\" actually mean?\n\nTo me it means he is wasting your time.\n\nPs: now his \"excuse\" will be related to your weight gain, and when you lose it he will change his excuse.\n\nThe power os all in his hand. You begging and pleading... His goal is some bullsh!t that dosnt mean anything or everything \"our best selves\" while your goal is something way easier to achieve (marriage). WHY IS HIS GOAL SO MUCH MORE IMPORTANT THAN YOUR SIMPLE AND ATAINABLE GOAL? Maybe because youre disposable for him?\n\nDont put youraelf on that place NEVER EVER.\n\n#YourLifeMatters\n#YourGoalsMatters\n\nPs. 2: his goal is something you achieve old in the end of life, old with grandkids and reflecting about everything you did back rhen. No young people are their best selves, they are mostly their worse, actually.\n\nThis is a \"shut-up-and-suck-it\" excuse.\n\nSorey for my bad english?",
            "If he wanted to marry you, he would have done it by now.",
            "I dont think waiting to be our bestselves is the best answer. You should be building your best selves together even now. Marriage more than just a commitment. You could talk to him about trying to be better together. Personally i believe marriage eould definitly make you be better and grow yourselves together. In times like these, its important to remind yourselves of how little time you realky have together and how important it is to appreciate moments and opportunites to actually be together are. \nCommunication isn't the key to relationships. Its comprehension what the key really is. To do that, you need to clear your heads approach each other in a way thats comfortable for the both of you and talk maturely like adults. Express what each of you really wants and weigh the pros and cons and eventually, doing qhats best for each other and what makes both you happy.  Thats being your bestselves really. Plus, marriage is one of the most beautiful and meaningful realtionships to exist. If he still doesnt understand, take some time for yourself. Think about things. Ask him ahat he really wants. Maybe he's afraid of commitment. Or maybe he doesnt ever want to marry. When youve thought about yourself and himself, and if difference of opinion is too much for your need to marry, what I would do is leave him. It's your relationship. You know him better and what would be best for you. \nGoodluck. ❤",
            "He doesn’t want to marry you.",
            "I would be furious. If there's no interest and you two aren't on the same page, there's no reason to continue, OP. If it hasn't changed yet, it won't.",
            "He's stalling and if you allow it, he's going to stall forever.",
            "“Wait until both of us are our best selves” = “I don’t want you yet”.  \n\nIf he wants you to change, then it’s “Don’t you want to get married?”  \n\nThis is no way to live. It’s extremely manipulative, all mercurial and shifting sands. Anything can now be the basis of why you're not good enough to be marriage material. It’s a lie that he’s subject to the same process since you already said you wanted to marry him.  \n\n8 years is too long not to know if he wants you permanently.",
            "I proposed to my wife when I was about your BF's age after we had been together for 6 or 7 years. When we talked about marriage (which was often after about year 3) we had things we BOTH  wanted to accomplish, and things we BOTH wanted the other to improve on. Like concrete relationship traits to work on in order to get married (and I had a few more for her to work on because she'd never been in an LTR before). That whole time we talked about time frames and had status check conversations for a couple years of how we're doing towards our goals. \n\nWhat I'm saying is if he can't have that conversation on what you guys need to do to be your \"best selves\" or a rough time frame (after covid? 6 months? 1 year? 3 years?) then he's just telling what you want to hear to delay the conversation and shine you on until the future. If he can't have that conversation after 8 years, he may not ever be able to with you.",
            "OP, after a string of long term relationships I met my now wife who was better than the rest.  All relationships go through phases of birth growth and death (the relationship, not the person usually).  After 8 years you may want to move on, if marriage and kids are important (and I do not think you should have kids out of marriage due to legal protections). \n\nThe usual advice is to break up, but what makes you happy?  Does he make you happy?  Can you imagine this life forever?  Because that's basically what he's saying.  And what does your weight have to do with anything?  This is shifting goal posts as they said.  We waited until mid 30s to have kids and it's pretty hard.  By the time my eldest will be in college I will be close to retirement.  Whereas some people have kids in college and they are in their 40s.  The kid era i think really defines you, its a solid 20 years where you have to put your life on hold somewhat, and just realize that whatever you do, you do with your children (go to the bathroom, go outside, etc).",
            "I have a feeling that a lot of stalling happens with this kind of thinking. After a while you realize that you'll never be stable enough, you'll never fix how you guys fight through things, you'll never live the lifestyle they want, whatever it is they tell themselves they are waiting for. If you are in two different boats, eventually you're going to have to raise anchor and float on.",
            "Main takeaway: you need to have an open discussion with tech other\n\n\nA) It's unfair of him to move the goalposts and you both need to be able to talk openly about things that are important. \n\nB) Knowing that we're only getting one side, the tiniest part of me wonders if he's nervous about committing long term until he sees you happy for a bit. I would be nervous if my partner were always upset about work. Again, complete conjecture and either way he needs to be able to say what he's thinking and have an adult conversation\n\nC) This is only two examples of workplace fits, but I have to wonder what your part is in these workplace scenarios. (If you ran into a jerk in the morning, you met a jerk; if everyone you ran into was a jerk, then it's you)\n\nD) Completely sucks and it's not okay that he's making those comments about your weight",
            "There isn't such a thing as waiting too long, but there is such a thing like utter disrespect from your partner, like pushing you into things and body-shaming. To be completely honest, the marriage stuff sounds like just a tiny symptom of a generally dysfunctional relationship. It won't be fixed by a wedding.",
            ">Are we ever going to be our best selves?\n\nWhen I got married, it's safe to say that neither one of us were \"our best selves.\" We both had crappy jobs, and we lived in a crappy triplex apartment. We got married anyway, because we decided to *become* our best selves *together*.",
            "Sounds like there will always be a reason now isn’t a good time. What does your best self even mean? If your partner doesn’t want to commit to you through the ups AND the downs then why keep validating the relationship? \n\nUgh I’m sorry now is probably a terrible time to feel the pressure of these decisions on top of everything else. I have a few friends that have been reevaluating their end goals and realizing they need to end relationships because they just don’t want the same things at the end of the day. It hurts now, but it will hurt way more the longer it is.",
            "So I agree with most comments that with that response of his you should be wary. But, please don’t jump to any conclusions before communicating with him some more.\n\nIt’s been 8 years. That’s really crap of him he can’t give you reassurance that he’d like to marry you. Saying he’s waiting for you both to become your best selves...what rubbish.\n\nHas he other doubts? What are his doubts? Why does he have them?\nWhy does he not want to commit alongside working on improving both your lives?\n\nIt sounds like he’s a bit worried about committing because you’ve not been happy in recent years?!\n\nHave you sat him down and said you need to talk about this, and about his responses to the word marriage and find out WHY he is saying and thinking these things?\n\nWhat is going to make him feel fully committed?\n\nDo you want to stay with someone that can’t commit until things are ‘perfect’?...life may never be perfect.\n\nAnd are you deep down feeling sad and low because he hasn’t proposed yet? You’re not satisfied with your job. But what else are you not happy about?\nWhat do YOU need to do to feel happier?\nReally have a look at everything and think hard about it all.\n\nYou need to both step back, evaluate, COMMUNICATE and ASK each other where you stand and what is happening here.",
            "He doesn’t want to marry you. Not now, maybe not ever. You can’t make someone do something they don’t want to but you have choices.\n\nLeave and find a partner who wants what you do.\n\nStay and hope one day you’re enough for him to decide he’s ready.",
            "So here's my take.  As a guy.\n\nIf I'm with someone a year and I don't have an idea that I want to be with them long term.  I'm probably needing to move on and let them move on.  At the very minimum we need to have had a talk about me not seeing a long term relationship.  At 8 years, it's a shit or get off the pot scenario.\n\n\nTo me be in you best self... It's just being happy with who you are.\n\nIt doesn't matter if your a billionaire or live in a Box. if you aren't happy with who you are.  You're not going to be happy with anything.",
            "Sometimes it’s better to just cut your losses. You’re 29 and you shouldn’t have to wait around for your boyfriend to decide when he wants to take the next step. You could be waiting another 10 years. You want marriage, he’s being coy about it and making excuses. I know it will be hard because you’ve been together for so long but don’t keep tagging along in his world. I was able to move on from a 7 year relationship and I met my now husband a little over a year after that.",
            "Surprise! You wont always be \"your best self\" after marriage always. It will have its ups and downs.",
            "I think its less about the 8 years, and more about how you feel. If you're reading for marriage and he isn't, then thats valid. You can feel like youre no longer compatible or that you want different things.\n\n My boyfriend and I have been together for 9 years but we're 23 so we wont realistically want to get married for 7 or 8 years. But we are both on the same oage about that stuff.",
            "You say he keeps commenting on your diet and workout \"requirements\" and that's not cool coming from someone who's supposed to love you. What he means by \"our best selves\" is that he wants you to be his idea of a perfect trophy wife. If you lose the weight, he'll likely propose and if you don't he'll break up with you. This is going to happen again in the future even if you lose the weight now. Bodies change over time. I really think you need to think about whether this guy is someone who actually deserves you. He sounds like a jerk to me.",
            "I understand both sides of this. On one hand it's scary going into something so serious if you're unsure which it sounds he is, not doubting his love for you but it's a big commitment so understandable. I jumped into a marriage with someone I wasn't sure about and she was awful, she drank too much, cheated, didn't look after herself and I stopped fancying her. That whole situation ruined my next relationship as I put those issues into the next girl who I was deeply in love with but feared she would go down a similar route and destroyed my relationship. It's hard. \n\nBut then on your side I also understand, how long does it take? When are you both ever really going to be ready? If it's love then the rest shouldn't matter and I've had a similar conversation with someone I loved who told me the same things and it all felt like excuses. \n\nMy advice is be patient but firm, don't wait around for someone who's never going to commit but also don't push him away in the process because he may have his own issues he needs to deal with too. At the end of the day I think calm communication is key and not over text or a phone call, sit him down on a good day when things are good and ask if you can talk. \n\nSorry that's all I've got. I do wish you luck and hope it works out. Life's too short to waste so make sure whatever choice you make it is well thought through.",
            "> He makes comments about my food consumption and about me needing to exercise more. \n\nI see girls say this all the time and its insane to me. I would never even think about commenting on how my gf eats. If she's my gf then who she is was what I wanted in life and I wouldn't try to change her.\n\nIt really just sounds like your bf wants you to become \"hot\" before he'll commit, why do so many girls put up with little boys like this? Because they have abs? I'm just confused but to each their own I guess",
            "Im in the same situation but we have kids. Its easier to lie to yourself and pretend everyones comments arent true and thats why we stay. But its time for me to move on. He gives me enough reason to believe he wouldnt even be with me if we didnt have kids",
            "You'll never achieve becoming your \"best selves\" - once you get to one goal, another one will pop up. Another job opportunity, another raise, another 5lbs to lose... There's nothing wrong with not wanting to get married, but if it's something that you really aren't willing to compromise on, then you really need to think about whether or not you want to continue with the relationship. If he doesn't want it and you do, one of you will always harbour resentment towards the other.",
            "He won’t propose because you don’t like your new job (which you got at his behest) and could stand to lose a couple pounds?\n\nOh honey, *he isn’t going to propose. Not ever.*\n\nAnd even if he did propose, what he’s telling you with this “best selves” crap is that **his commitment to you is conditional!** it’s explicitly conditioned on both of you being your best selves! So what happens if having a kid is stressful, if someone loses a job, if someone gets sick? Divorce?\n\nI say dump him. But at minimum, sit him down for an ultimatum conversation and tell him that his best selves theory is bullshit.",
            "Don't be a forever girlfriend",
            "This exact same thing is happening to a friend of mine. He finally proposed (with an ultimatum) and it feels like he was worried about loosing his bread winner and having to start doing and paying stuff for himself.\n\nI think after all this time he has told you who he is and what he wants. Why would you want someone to 'give in' and marry you?!",
            "I'll be cruel to be kind.  He's not going to marry you.  He's not ready now and will probably never be ready.  I'm really old and I've seen this played out before.  He'll give you all sorts of reasons for not wanting to get married.  And guess what? Some other gal will come along and he'll be married to her in a flash.  He doesn't need to marry you, you're already acting like his wife.  If you want marriage and children, leave now.  If you're happy with him and what's going on, stay.  Only you can make this decision.  You need to put yourself first.",
            "Eight years and he still has excuses? It ain’t happening, OP.",
            "There were no improvements in 8 years? \nYou really should've had this talk way before 8 years passed, marriage is important to you and he doesn't seem too interested in it even for you. \n\n\nI think there's pressure on both side, he feels pressured to marry you and you feel pressured to become good enough for him to consider marrying. There should be a serious talk about this where you express your concerns. Relationships shouldn't be one sided, compromises can be made on both sides, maybe you'll understand why he doesn't like marriage or maybe he'll see how important it is to you. It just needs more in-depth communication.",
            "r/waiting_to_wed May help you.",
            "He is totally goal-posting you. He has set the bar for marriage, and you have agreed to let him decide when you meet it. He is clearly NOT interested in a commitment. (You should be engaged at 12-15 months, not years!) Smh....",
            "Knew a guy that dated a woman for 10 years and she finally broke up with him because he wouldn't propose and she wanted kids and didn't want to have kids until they were married.  The crazy part is that he always wanted kids too.  Like, it was pretty important to have kids for him, but he just wouldn't propose for some reason.\n\nThat was about 8 years ago.  She's married to a dude she adores and they have a kid.\n\nMy buddy is also married with a kid.  When she broke up with him he realized how insane he was being.  It really woke him up.\n\nNeither of those things would have happened if she hadn't broken up with him.",
            "Im in a long term relationship and i dont think this is a huge deal. Money is for real. If you don't have parents paying for a wedding it would be silly to go into debt for it, or to get married before u really know. If u have the money it would be a better move to buy a house. Its not some landmark that is going to change things. Why are u waiting for him to propose anyways? Do it uself if u really want the state to rubber stamp yoir ability to procreate.\nDoes he bring up u losing weight in response to u mentioning marriage or are u just connecting the 2 urself? 8 years is not too long! Morons be gettinf married after 3 years together and then they ate miserable.",
            "I don’t know what to say about telling you to leave him if he doesn’t marry you.. I suppose it depends on how much a marriage means., to you both and if you did choose to get married would boyfriend be stifled and caught in thst restrictive marriage at his unhappiness because he seems kind of aloof and not really a validating kind of guy... but I think he and you have to think if the cost of yiur love is worth a marriage certificate.",
            "He doesn’t want to get married.  You could probably talk him into it eventually, but that is unlikely to lead to a long and happy marriage.  You can’t change him.  So now you decide: do you want to stay with bf? Or do you want to find someone to marry?  There’s no one right answer.",
            "I was with my ex for nine years. I would ask him if he was ever going to propose and there was always some excuse. It wasn’t until after we broke up that I realised he was never going to. And I’m glad because with distance from the relationship I now realise that if we had gotten married it would almost certainly have ended in divorce.\n\nYou are still young, and even if you weren’t, you should never settle for less than you deserve, which includes somebody who keeps you on the hook but will never commit. Don’t waste any more time on this person.",
            "Don’t blame your weight gain on your job. Just stop eating so much.",
            "Married person here.  You need to set down what you want.  If he’s not it, it’s time to mourn and move on.",
            "Give him a year to propose then dump him if he doesn't",
            "He's dragging this out because he's comfortable and you've already gone this long without forcing him to make a decision, so he thinks you'll keep allowing him to kick the can down the road. \n\nYou're wasting precious time on him. Have the courage to leave.",
            "To me, it seems like he's basically saying that you're not good enough for him yet (which is wrong, your partner should like you for who you are. Yes, encouraging self improvement in your partner is good, but I dont think commitment should be made on condition of \"when you're good enough\"). It doesn't sound like you have a lot of debts or anything. Honestly, I wouldn't have put up with the \"I don't believe in marriage\" for so long. Me and my partner have said we want marriage for sure, but both understand we aren't financially there. To me that is more vulnerable and honest than a dismissive joke. Does this mean if you lose your job after you're married he's going to leave you? I think partners should support each other during stressful times like not being employed as long and they're working to find something. If his reasoning was \"life is really stressful right now, and I don't want to add to that stress with the pressure of wedding planning.\" Rather than basically saying he wants you to make more money first. That's how I'm interpreting things from your post.",
            "Its pretty simple. The guy doesn't want marriage. He's perfectly happy with you as his girlfriend, only. If you want to get married, you should leave.",
            "I waited 7 years for my boyfriend to propose to me . . . And he did. We spent a year engaged and have been married for 13 years next month. We started dating young -19 - and my husband just wasn’t ready to get married on your more typical timeframe. He also wasn’t sure if he wanted kids, something I wanted, and you really have to sort that out *before* you get married. He didn’t spell that out until after he made his decision though (as was his right), so at the time the delay felt pretty arbitrary. He did eventually decide he wanted a child (just one) and I decided that I could be happy with just one. Our son turns 10 next month. He’s really happy to be a dad and surprisingly to me, I’m REALLY happy to be “one and done.”\n\nIt does seem like your BF is dragging his feet for no reason but since most posters are going to say that this is a red flag (which it may be), I wanted to show you that in at least one instance, it did end up in a happily ever after.",
            "He doesn't believe in marriage. He wasn't joking.",
            "My husband and I got married after dating for 8 years.\nWe were only 18 when we first started dating. 8 years in We had already bought a house together, and car we has a cat since the beginning of our relationship. We never planned on marriage it just happened. It was something that we both talked about it really thought it over and in 3 months time we were married! Now were going on our 15th year together (8 dating, going on 7 years married). \nMarriage is hard if haunt been easy. You always think you will wait until you're the best version of yourself...tbh that better version of our self is a continuous thing till death. You will or should I say you SHOULD never be 100% done growing and learning that is what this life is all about. \nThe reason why we got married because we knew as this life goes on. We are going to have have good and bad times in life. And there is no one else is this world I would like battling it out with. \nI knew that no matter what happened in life (kids,work,pandemics) he would be the person I would want to go hrough it all with. People are usually good at being their for the happy and good times. No one has stayed by my during the toughest times like he has, including my family!",
            "The concept of Waiting Kate\n\nA man promises you something , or hints that perhaps you guys have a future together . So what you do is live up to the potential of that future .\n\nIn this case you wanting marriage .\n\nIf he really wanted to marry you , he would know . He doesn’t need 8 years to decide if he wants to spend the rest of his life with you.\n\nAlso you’re lucky you don’t find out after 8 years that he wasn’t really serious .",
            "When you break up, he'll marry the next person within a year. That's the way this goes. You will see.",
            "This is gonna be harsh.\nIf you don't lose the weight he won't marry you. You are a different version of yourself now, he didn't sign up for that. Every man on this earth can understand a stressful job, but they don't wanna see their woman gain weight as years pass by. And even with the weight loss, he might not want to get married. Try introducing a prenup, today's men don't marry because of the easy divorces that could ruin their lives.\nI wish you all the best.",
            "It looks like he’s seen the version of yourself that is available and doesn’t want to commit to marriage with you.\n\nHe seems to value the ability to balance work and life and it looks like you aren’t very skilled in that ability. Might not even be your fault, but from how you describe it, it looks pretty much like you’ve given up on fixing it.\n\nFor future relationships: if a man says he doesn’t believe in marriage, don’t assume he is joking. Men who want to get married usually wouldn’t joke about that.",
            "I don’t think you can put a time constraint on when is the right time to be married.  My brother and his wife got married maybe 16 years later into the relationship, so they were in their 30s. I’ve been with my BF for 7 years and we aren’t engaged.  For us it was the same thing, we needed to be financially stable.  We’ve finished grad school and college together.  Now we are financially stable.  In both of our hearts, we know that we will just spend the rest of our lives together whether we get married or not. We’re in this for the long haul.  There isn’t a rush for a wedding.\n\nNow you mentioned he was now financially stable. You mentioned that you changed jobs, but you’re unhappy at yours? Would you consider both of yourselves stable now?  And you also mentioned weight gain and being unhappy. I just feel like there’s more to this than just being upset that 8 years in you’re not married yet.  I think you guys need to discuss whether or not marriage is really important to either of you. Maybe he’s ok without being married and still being with you until the end. But if marriage is that important to you and cannot be compromised on, then it’s something you need to ask him again.",
            "As with many questions posed in the subreddit, I  think that you already knew the answer to your question. You may have even noticed that with every question posted the community's default answer is \"You should leave.\"\n...However,  in your situation that really is the ONLY answer. I mean, unless you like being so blatantly strung along. I don't think you do, but you likely have had your self esteem so beaten down that you can't find the strength to have that difficult conversation or face being alone for a while. Maybe you think, \"Well, it's not all THAT bad.\"\n   Thing is, the most basic dealbreakers in relationships are whether to get married and/or have kids. Any time you spend coupled with someone who doesn't want what you want is Wasting. Your. Life.",
            "That sounds tough and sorry you're going through that. Although my husband didn't propose after 8 years of being together, he never talked about needing to be our \"best selves\" or saying hurtful things about your weight. However I did have a serious conversation with him that if I wasn't the one to just tell me so I could move on. You may need to have that conversation with him and evaluate your relationship from that as well. Although from what you're saying about this guy, you may need to just leave him if he's not enthusiastic about wanting to be with you or going the next step.",
            "He doesn't want to get married. I would leave during COVID IF your not in a high risk area. He has 8 years at this point. He will promise he will do XYZ when he sees you leaving but it was because you force his hand, but because he wants to.",
            "Do not marry this man. I don’t think it’ll be a problem because he’s not making any “I want to marry you” noises but this guy is not marriage material.\n\nMarriage is not about getting to “your best self” and then ?staying there? (What in the world is his long term plan here?)\n\nMarriage is a three legged race. It’s for when you’re great and good and when you’re down and out. Your eight-year guy might stick around but he isn’t with you for the down and out for some stupid reason. When things are bad for you, he makes them worse. That’s no kind of friend, let alone partner.\n\nI want someone who’s excited about you for you. You deserve so much better. You’re describing a completely lackluster relationship with someone who can’t handle standard shittiness like weight gain and work problems without blaming and criticising you. There are people in this world who will support you through things and be excited to marry you on your *worst* day.",
            "You'll have to find out what exactly a best self is.",
            "He may be buying time to see if, with coaching, you develop enough as a person (in his eyes) to tick the marriage box.",
            "You know the answer here you just don’t want to face the reality. I was in a 4 year relationship and 2 of those we were engaged. I kept moving the goal post for the criteria to set a date. It wasn’t quite “our best selves” but close. Deep down I knew getting married was a bad idea but our lives were so entangled (we owned a house together, joint assets, close working relationship) I wanted to believe it would magically work.\nAfter 8 years if he wanted to marry you he would. It’s clear he won’t. If that’s important to you then you need to walk. Don’t get lost in the sunk cost fallacy. You gave it 8 years and you learned some things. Find someone that is going to share in your life goals and support you whether or not you are tour best self at that moment. Life is wide open to you and you don’t have to spend it waiting on someone who will never be ready.",
            "He doesn't want to marry you. Don't stay just because of the sunk cost fallacy. You'll never find someone who is enthusiastic about marrying you if you stay with Mr. Best Selves.",
            "Your bf isn't interested in marriage and will keep stringing you along.\n\nBe smart!",
            "He has some time to get to his best self, but you have basically lost the moment of your \"best self\" potential.\n\n+ Judging by those 20 pounds you gained, if you don't do anything about them now then you will most likely just go down hill from there.",
            "He's not really into you is he? I think this is your answer.",
            "You got fooled. That is a classic stall tactic. And he seems to not love you as much if you don't have the perfect body for yourself. I say that because that's how it starts. With that one comment.",
            "It's clear from what you say, that, for you, it's too long. If he's not ready now, will he ever be?",
            "You don't want to chase moving goalposts and your partner doesn't want a situation where he stays with someone who may dump their stress into the relationship.  Both perspectives are valid, you have a history of taking out stressors into it and he has a history of putting off conversations about the future.\n\n\n\n\n\nSo, have you two considered couples counselling? Do you have safeties in place of any kind that show you have alternate resources for hard times? Does he show his commitment to the relationship in other ways that are consistent? What are you two doing to tackle these issues as a team? Marriage wont make problems disappear, it will exacerbate unresolved issues.",
            "He will never propose.  He meant it when he said marriage was not for him.  He is being shitty now though because he knows you want to get married, never pans on getting married, but wants to keep you around.  He will keep moving the goalposts until you walk away, and then he will blame you for it.  Stop wasting your time, or accept that you won’t get married.",
            "He doesn't want to marry you.",
            "\"your best selves\"? Sounds like he is telling you're not good enough. No one is always their best selves, you might be your best self for a day, but not every single day. 8 years is long, being 30 especially. He will not marry you. So now the choice is up to you, are you okay with that? Or is it a dealbreaker?",
            "I, too, had a boyfriend who wanted to put off marriage after years together. Right around the 8 year mark he dumped me for someone at work. Turns out I was just a placeholder. My advice is to cut your losses.",
            "I was in your shoes a few years ago. We’d been together for 8 years and he was always making up excuses. \n\nWe broke up, he moved his ex in immediately and they were married within a year. \n\nStop wasting your time.",
            "Yes, 8 years is too long.",
            "Work on your self. You’ll leave him.",
            "You’re never going to be your best self. It’s an impossible thing to reach and is used as an excuse for never doing something. It sounds like he doesn’t want to get married but doesn’t have the guts to say anything.",
            "Sorry if this is not really helpful I see a lot of advice being given. Some I find not so useful. But I’d say during these torrid times it’s probably not right to make any sort of decision. I agree with being the self dependent version but then again I don’t know much about life. If your weight bothers you. Maybe you can start with fixing your sleep schedule first and decluttering your house. That’ll get you moving so you can plan better. One day at a time and it’s important to have support. Eh.. I don’t even know if this makes sense but I did it and it worked for me. So that’s all... hope things work out for you! Keep at it!",
            "Marriage is not an agreement anyone should ever be pressured or convinced into. If you are ready for marriage and your boyfriend isn’t, he’s telling you it likely won’t ever happen. Men know fairly quickly that they want to get married. He’s stringing you along.",
            "Get out now. I was in a relationship for 7 years, he gave me same excuse. He said, because I wasn't financially secure. But I made more money than him. Plus, he would comment on my weight. But he had gained his own weight and never wanted to workout with me.  He kept saying we would get married. But there was no ring, and he had the money for it. \n\nI waited. But then I felt myself drifting away. And I didn't want to be with him. We were supposed to b moving into a bigger place. Turned out, I went through his phone. He was messing with a co-worker. She looked like a man. Lol At least that's what everyone told me. I broke it off with him, the same day I don't out. I was the happiest ever. I lost all the weight right after I moved out. Being single is always a reset of who we are. But we should always be ourselves. Because I wasn't happy at home, I wasn't happy at work. No one should get in our way of being happy all the time. \n\nI met someone else with time. I'm not happy now. This quarantine will either make or break us. It is what it is. We shall see what happens. Good luck. Save your 💰. Do a pro and Cons list, and come out this quarantine doing WHAT YOU WANT.",
            "Waiting for your best self isn’t really a good reason. If you are marrying someone, you’re not going to be at your best self 100% of the time for the rest of your life! I think he is setting an unrealistic standard. He comments about your food consumption? That’s just a jerk move no matter what the reason is. People eat when they’re stressed and unhappy, he’s contributing to that stress and unhappiness by not supporting you and sending mixed messages. \n\nAll and all, if you’re starting to think that 8 years is too long then you’re probably right. Move on to someone else who shares your interests and goals.",
            "What he is telling you is he doesn’t think you’re good enough to marry. Please listen to him.\n\nI know how heartbreaking that is. I heard something similar from a boyfriend after 5 years when he turned down my proposal. And I tried to stay friends. And we ended up dating again. And after 8 years I suggested marriage again. And he cane up with some other excuse. And I dumped him again. And tried to stay friends. And ended up dating again. And a year of couples counseling got him to admit he was afraid of marriage for reasons having nothing to do with me. I dumped him and went no contact. Another year of individual counseling helped him sort out his issues. And we ended up running into each other and dating again. And when I proposed the third time, he said yes. We got married 13 years after we started dating. \n\nHaving him tell me he didn’t want to marry me and breaking up, being told I wasn’t good enough, was the worst thing I have ever gone through. It hurt in my chest like a heart attack. And I stretched out my suffering for YEARS. It ruined my self esteem. It took years of therapy to get back to a good place. And yes, we both worked on ourselves and had a happy ending. We have an amazing solid marriage. But honestly that was super good luck on my part, because he refused counseling for five years. And 90% of the time that doesn’t change. I’m the exception. Not the rule. And I was only the exception after I dumped him and went no contact and decided I was worth more.",
            "He thinks you're going to be your \"best self\" for starting a family at 37?",
            "I have a cousin who at 17 got his gf preggo. 29 years later and two kids, they are together and not married. Marriage isn't for everyone and the pressure society puts on people to marry because the bot of you have been together for a decade is ridiculous. I know friends along the way who married and divorced in less then a decade. If you're in a relationship and marriage is the end goal make sure you express that up front and draw a line. People who just hang on hoping one day they'll propose will only end with that person having a lot of resentment in the end when it doesn't.",
            "I think it’s just an excuse, tbh. He doesn’t want to marry you, so he says “oh, when x happens we can get married” but love doesn’t work that way. \n\nWhen you truly love someone, you make them feel loved and wanted. You don’t tell them to change, but you support them IF and WHEN they want to change.\n\nDrop him like a hot potato.",
            "What are you arguments for marriage? It is possible he doesn't see a benefit in being legally married vs your relationship now that has been strong for 8 years without it.",
            "“Your best selves” hahahah. Oh, please. Spare me.\n\nYou’re a placeholder/forever girlfriend in this mans life, and the faster you get out..the better off you’ll probably be. Even *IF* he marries you, it’s not something he has any interest in doing. And, I’d bet that he’ll never propose. This is one of those situations where you need to look at what has happened in your life. Not what he promises or “jokes” about. \n\nHonestly, don’t waste another second on him. There is a guy out there who would be so EXCITED to marry you. Don’t settle.",
            "He's not the person for you. After 8 years of dating, one would expect to at least be discussing a future and planning a general roadmap for what to do before getting married. In his case, he is positioning himself as the judge yet refuses to lay down any rules or standards. He's stringing you along on the hope that  someday, no one knows when that day will be, he'll marry you.\n\nThe decision to marry is something where either both partners are totally on board for the long-run or not at all, and there's no middle ground. If one person is not totally on board with the idea, then the marriage is going to one day result in divorce or infidelity.",
            "I don’t know why marriage is more important to you as being together with him\n\nI would not pressure him to do something he don’t want to do or don’t want to do yet and if you want to make the choice to marry him or leave him -> just buy a ring and ask him - it’s 2020 - women can do this too!\n\nbut I would suggest that you just think about it - so you want to marry someone or do you want to marry him?\n\nthe part with the eating and pounds and fitness - he is definitely not happy with your body right now - he didnt leave you because of it - that’s good news - so he loves you - but he is still not happy with it - physical attraction is important too in a relationship or he just don’t like that you let yourself go or he is afraid about your health\n\nwhat I want to say is that you have to talk to him and tell him why you are eating more like you did here and maybe he can help you with your problems\n\nthe weight thing could be connected with the marriage thing but it could be still two different problems you are facing in your relationship",
            "All I can say is, I can completely relate. I’m so sorry you’re going through this.",
            "Umm, even if a person does achieve their \"best self\" they don't stay in that spot at all times. Marriage is a co tract where you agree to stay with the other person even when they are their \"worst self\". Its kind of like having children. If you are waiting until you are ready, you will never have children.",
            "Take this with a pinch of salt, as you should take anything you read. But to me, if he's willing to say 'we should wait until we're our best selves' why is he even in a relationship?\n\nLife is full of struggle and suffering. A relationship isn't just there for two perfect people to get together and do nothing. Your partner should be there to support you through the hardships. Marriage is a commitment - it is saying that only if you die will you stop helping your significant other, and stop being there for them.\n\nThe way I see it, relationships can help refine people. Occasional bits of conflict can chisel away parts of people that are nasty, unhelpful or destructive. And who really is their best self? Who can honestly say they have no insecurity and no inner struggle?\n\nSo personally I think he needs to reevaluate what he thinks a relationship is for. I'm sure he has helped you in the years to become who you are. And maybe he's just a little scared of the commitment. But truly, if he is waiting until you are both 'ready' to marry, you will never marry him. So you should be very Frank with your discussions with him in future and tell him what you want. Maybe he has other reasons for not wanting marriage. Maybe his own parents had a bad relationship.",
            "There is no perfect moment to get married, you either want to be with that one person for the rest of your life, or you don't.",
            "Why does marriage have to be a capstone? Why do you have to wait when you are done with doing stuff until you can get married? Look, after 8 years y’all are probably living together and after that long you probably have money figured out, too (whether you’re money is yours and his is his, y’all combine your money, whatever it may be). At this point, getting married isn’t going to change much but it’s what you want and you should have a say in when it happens.\n\nPersonally, I’d give a timeline. I’d do something like engaged in a year, married in 2 or maybe you’re out. It seems harsh, but marriage is a 2 person decision and it sounds likes making it about his position. “Being your best self” is a never ending goal, why is he so against it otherwise?",
            "8 years isnt too long, people move at their own pace. However it is important for you guys to be on the same page with this, and it seems like youre not. \nMy man and I (30M/29F) have been together almost 10 years, living together for 6, and we are not married or engaged either.  We have talked about it, and a few years ago we had the same talk about financial stability, and wanting to afford a wedding. We are on the same page, and are in no rush as honestly not much would change except having a ring. \nThere is nothing wrong with moving slow, but you both have to want that and it sounds like you are ready to take the next step and he isnt. You need to have a serious conversation about the idea of marriage and ask yourselves if you really see yourself with each other, getting married, having a future etc. Dont let him treat it as a joke, or brush you off. If this is something that is important to you, he should care enough to talk to you about it and do so honestly. \n\nNow, something else you should talk about are his comments about your weight. That is not okay, and you do not have to put up with that. Honestly that was more of a red flag to me that being together so long and not being married. I get if he’s genuinely trying to motivate you and help you better yourself thats one thing, but he needs to do it in a way that is not hurtful to you and your feelings. Please talk with him and tell him how you feel!",
            "My husband (bf at the time) said the exact same sort of thing about \"not believing\" in marriage, that we didn't breed a \"piece of paper\" to be committed, blah blah. \n\nI explained to him the possible legal ramifications of *not* being legally married, my concerns with my image with his (mormon) family, and that I just didn't want to live my entire life as just a girlfriend. \n\nHe proposed at the end of that year. \n\nMy point is, after 8 years and having had similar talks, if he hasn't decided to go ahead and propose, then he doesn't want to marry you.",
            "So he got a raise and is financially stable meanwhile you’re miserable and gained 20 pounds. But yet you’re expecting a ring? You’re probably an amazing woman but your post doesn’t sound too convincing that you should be getting married",
            "If your in a happy relationship and have been going on for 8 years strong, why mess up a good thing? Marriages at time can destroy relationships. Been 10 years strong with my girl and were 2 kids in, aren't married and while we eventually plan to do so, don't think being married or not will change any of that. My 2 cents....",
            "It's hard to comment on your timeline - each to their own. My parents got married after 13 years together and there was no proposal.\n\nEqually, when I met my partner he didn't \"believe\" in marriage. Mainly because of the broken home he came from and relationships he saw around him. I knew I wanted to get married, at some point, but given my parents example, I never felt the pressure for it to be rushed and joked that when we're 50, we'd be lying in bed one morning and he'd say \"shall we do it?\" (\"it\" being marriage).\n\nHe surprised me 2 years ago by proposing (after 5 years together). But I somewhat get your partner's \"best self\" thing, because me and my partner, while completely dedicated to each other, have far bigger priorities and aspirations (both professionally and personally) than marriage. Haven't planned/looked at anything!\n\nFriends who got engaged after us, haven't been together as long as us, have already walked down the aisle. But we genuinely feel so secure in our relationship that we will get married when personally and professionally, we are in a \"better\" place.\n\nWhy he proposed? Fuck knows! Ha. I joke. But what it did mark for him was an acknowledgement in himself that he is not the same person he was when he came into this relationship, and for us, that was enough.\n\nIf it's not \"enough\" for you to be in your relationship and you need the marriage, I would first be compelled to ask you why? Because the foundations of your relationship are so much more important than that (unless you are religious of course, which if that is the case I understand).\n\nMy parents, after waiting 13 years to get married and still happily, and I mean that, they are the genuinely happiest most in love couple you will ever meet.\n\nWhile my friend who has been with her partner for 9 years, and he's just proposed (during a rough patch), well, I'm honestly not sure how far they'll make it based on their foundations.\n\nI get the \"better self\" thing because we are jointly going through that. \n\nP.s.... Maybe, it's because he wants to be able to propose with the ring of your dreams and be able to go straight into planning a wedding (of which the average cost is something like 20k plus!) rather than waiting another eight years before actually getting married. Hence wanting to be in a better place financially also to be able to say to you, here, you can have whatever wedding you want - no expense spared. And I say that because I said to my partner about eloping or a small registry office wedding and he says he knows me, yeah of course I will be happy with that, but he also knows I am a money worrier and wouldn't have the wedding I actually want so wants to be in a better place professionally/financially so money isn't a question.",
            "Spoiler: he wasn't joking. He doesn't believe in marriage. You need to believe him. Also, why do you want to marry someone who makes you feel bad about yourself?\n\nHe keeps moving the goalposts. He doesn't want to marry you. The question is, why do you want to marry someone who doesn't want to marry you or needs to be nagged into doing so? Or who keeps telling you that you need to be \"better\" to earn a proposal? It should be a carrot on a stick. Don't you want more for yourself? \n\nStop wasting time on this dude if your goal is marriage. He's made himself clear. You need to listen.",
            "Don’t waste anymore of your time. I was in a relationship for 5 years and my story is identical to yours. He’s never going to commit or he would have. I’d leave. I’m sorry you’re going through this.",
            "&#x200B;\n\nNo one is ever going to be perfectly ready to get married. But, in 8 years, he has figured out if he wants to marry you or not. If he loves you, and it is a love that is long term, he should want to marry you, just as you are.  Because married life gets harder.  As hard as it is to start over, find someone who thinks you are amazing, even 20 pounds heavier than you were and stressed out.  Cause it's much easier to get to where you are your best you when you have a cheerleader behind you and not a peanut gallery.",
            "If he wanted to marry you, you would be married. He just wants to be in a relationship because it’s comfortable. \n\nIt’s time to re-evaluate. Is marriage a dealbreaker? Do you want to have kids? If so, you need to move on to someone who wants those things as well. \n\nI lived through this. I forced my guy to get married. We divorced not long after. He got engaged within 2 years of dating the next person because he wanted to marry her. I got engaged within one. \n\nWe are both much happier with our new partners, and we each have children in our new marriages.",
            "You are supposed to grow together..... if you aren’t perfect match for him now after 8 years, then when is he supposed to know? \n\nDecide what you are worth and if you have matching goals with this person.",
            "Why do you feel the need to have to get married? All marriage is, is the gov sticking their noses into your love affairs. Or is it so you can show off your ring and can finally say I got married. If you love him then keep loving him",
            "He wasn't blowing your questions off, he told you he has no interest in marriage, whether his is no interest in marrying you or no interest in marriage at all he has been very clear this whole time. He is never going to marry you, if this is not something you are OK with then you need to break up and move on.",
            "I told this to a friend that was in a similar situation. “He believes in marriage and he will marry someone. He just doesn’t want to marry you” It maybe unconscious that he’s doing this. Maybe it is conscious but the reality is that you deserve better. You deserve someone that it’s eager to spend his life with you. You deserve someone that wants to experience his growth not only as a person but that can look back and laugh, cry and reminisce about how far the two of you have done. RUN girl RUN, don’t waste any more of your time with him. Don’t settle for less than you deserve.",
            "I haven't read all 421 replies but, I've read enough to get a flavor of them.\n\nCamp 1 He's never going to marry you so break up with him.\n\nCamp 2 Give him some more time and lose those awful 20 pounds.\n\nCamp 3 8 years isn't really that long of a time, so hang in there girl.\n\nNow let me ask you to join my camp, camp 4. First stop reacting in any way about his comments about your weight gain, 20 pounds is nothing. React as if his comments are interesting observations, do not let yourself be manipulated.\n\nThe next part that needs to be tackled is your career or job, I don't know which you have because they are completely different things. In your case it sounds like in both of your jobs you have been unhappy. Your boyfriend has stated that he'll want to get married after the both of you are your best selves, well lets give him what he wants and see if you're good enough to marry at that point.\n\nGo out somewhere today or in the next week where you can be alone and really think, think about what would be your dream job, and think about weather it is attainable or not. If not then move on to another idea. Come up with at least 20 jobs, you really want to figure out where you would be happiest. Then eliminate out of your list of 20 for whatever reason until you are down to three or four that you would love, look over the commonality in these jobs and select one to go for.By the way fellow reddit posters and OP I am not Bull Shitting about this crap. There are so many people who spend their lives in a career or job they absolutely hate and they spend their lives in misery. So why do this, you are making yourself the best you can be, which is what your boyfriend stated he wanted.\n\nIn his career he is financially secure so he should have no problem what so ever with financially supporting you when you tell him you're going back to school and getting a Phd in lesbian dance theory (just kidding) or whatever you decide to do. You might even want to go into business for yourself or something that doesn't need a degree. Contrary to popular belief it is not a mans world, it is in fact it's a woman world (if you're American). There are grants, loans, and a shitload of other advantages waiting for women (in America) to take advantage of if you women would open your eyes and look around.\n\nSo Camp 4 is stick around until you have a career you like or love, lose the 20 lbs or not, be happiest with yourself. Then stay or leave. Who knows you may decide after you've gotten your life where you want it that HE is not right person for you to marry.\n\nIt shouldn't take more than 2 years to decide if the person you are with is worth marring or not. Historically people have gotten married straight out of high school at 18 or in their very early 20's. The median age for first marriages today is 29 for men and 27 for women.",
            "[deleted]",
            "This is going to sound cynical, but I promise I'm coming from a loving place. And take it with a grain of salt since all I can go off of is what you told us. \n\nHe has been telling you he doesn't want marriage, in both words (the jokes) and actions (no ring), this whole time. It wasn't until you really pushed him for clarity that he made it apparent why he doesn't want it. He doesn't view it as achievable or something that flawed humans can succeed at. \n\nHe doesn't want to lose you, but he also likes it just the way it is, or was. You as his forever-girlfriend who was 20 lbs lighter and generally happier. \n\nI would hazard a guess that part of the reason you're unhappy is that you're realizing that he isn't moving into a longterm relationship with the same goals as you.\n\nThere are people out there who want marriage. They want to grow and change and support a partner and build a beautiful life together. They know this for sure and are seeking that special person.. It isn't the end of the world if your boyfriend isn't that person. You are young, but eight years is too long. You'll never be what he wants for you two in order to be \"worthy\" of marriage. No one will because his expectations are unachievable. \n\nGood news is the marrying-type guys will let you know after a year whether or not that ring is coming. Dump your boyfriend and go find yourself a man that loves that little extra curve while it's still around and wants to marry you for who you are AND who you want to be. You are WORTH IT.",
            "> he wants to wait until both of us are our best selves.\n\nthis is only a slightly less dickish way of saying you're not good enough for him.",
            "Either he wants to marry you or he doesn’t.  \n\nIf you want live with not being married break up with him.  You are almost 30. Almost out of time. \n\nOtherwise live with him.  \n\nBall is in your court.  Quit whining and make a decision.  He’s stringing you along.",
            "I don't think he's looking forward to marrying you at all",
            "You marry when you know you have found the right person.  Apparently he doesn't know that.  Draw what conclusions you wish.",
            "Sounds like hes not planning to. If you really and truly want marriage this has to be a deal breaker or not for you. 16 years to get married? Itd be one thing if you both want that but you'll be 37 by then, are you happy with that? What really sets an alarm bell to me is him getting on you for your weight. To me someone who says something every time you eat is a huge red flag. I think you should get away from this guy. He can't be man enough to give a real answer, I'd put money on him saying in 7 years \"were both in our late 30s. What's the point now\"\n\nWill you be happy if how he treats you and where you are is your life?",
            "You're nearly 30. Just let that sink in a little.",
            "Been there, done that. He will keep dragging his feet, always have a new excuse, and you’ll never get a proposal. If a guy knows he wants to marry you, he’ll know within the first year. Run far away and use your precious 30s to meet someone who wants to marry you.",
            "Marriage should be where two people aim to grow into their \"best selves\" together, not a goal where being your best self is a criteria.\n\nSome people would say you should leave him and cut your losses, but 8 years is a long time to invest yourself in someone and just leave. That being said, think long and hard about your next steps. Talk to your boyfriend and tell him your side of things. Eight years is long time, yes. But in the end, if your goals in life are intrinsically different, perhaps it IS time to leave.",
            "He is never going to marry you.",
            "I am so sorry this is happening to you. But you need to understand that if you want to have kids, that clock is ticking, and yours has a much shorter timeline than his. Getting and staying pregnant is harder in your 30s than 20s (I’m 33 and pregnant with my first right now, so I speak from experience here), and once a woman hits about 45, it is almost unheard of. Even if he does come around to wanting to marry you in the future (which, as PP have pointed out, seems unlikely), how much longer will you have to wait for the engagement, the marriage, and trying to conceive? If you do want to be a mom, you might run out of time waiting around for him, particularly if you want more than one or two children. This is just one thing to think about along with what PP have said, but having kids is extremely important to some people, and might mean you have less time to wait around for him than someone who doesn’t want kids.",
            "don't wait another 7 years to have a conversation about the topics that matter, at least",
            "Marriage doesn't need perfect selves. Marriage makes you a team to work on everything together.\n\n\nI think either he doesn't want to get married and this is an excuse or he sees marriage as the be all and end all of relationships rather than something that needs input and work.",
            "If you want to get married so much, why not bite the bullet and propose to him? It’s 2020 now, why bother sticking to the gender norms. And women proposing to men is already commonplace",
            "What if you proposed instead?",
            "Why do you propose to him?",
            "You are not his forever person, and he does not want to marry you. It sucks, but that is what it sounds and looks like to a T.",
            "Best time for marriage is 2nd-4th year of relationship. Its still hot, u still have butterflies, lots of things are still unexplored, not bored of each other. \n\nWaiting 8 years and having no progress in relationship means u will never get married. Be it focus on career, immaturity, mutual decision... but the fact stays a fact. \n\nI suggest speaking about future plans early (like 1 year into relationship). This way nobody is surprised and if there is a disagreement u can either change partners decision or move away.",
            "If you knew in the 1st year he never wanted to marry you, would you still be with him today?\n\nIf you're interested in children and martiage, time to end this. If you live together, start working on moving out. \n\nStaying with him is preventing you from having what you really want.",
            "As my wife’s Polish grandmother said when we got engaged after 11 months of dating - if you’re going to get married you either do it quickly or not at all.",
            "He strung you along for 8 years with this bs??? What a waste, it doesn’t take someone that long to know if they want to marry you. And he still doesn’t want to even after all this time and continues to make lame excuses. He is wasting your time and you deserve better.",
            "He going to dump you or cheat unless you exercise and feel good",
            "I don't think anyone here has the right to tell you whether or not eight years is too long. Only you and your partner can know the answer. And if either one of you thinks you're not ready, then it's not too long. \n\nWhat determines whether a particular time is long enough or not? How can anyone be ready for something just because they're told it's time? \n\nUnpopular opinion based on this thread, but if you're both on different pages, then you're not your best selves. I think best selves isn't just about your individual life journeys, but also how well you're in sync. It seems to me that there are a lot of issues both of you need to work through. \n\nIs this the right time to do that? Personally, I think you might both be under abnormal amounts of stress visible or not, because of the current situation we're all in. It might negatively affect any conversation about the future you might have. Then again, only you know both of your lives best. \n\nI thnk you should also think of what this does to your partner. You come online because you're upset, and get a bunch of strangers who tell you your partner's being crap and then you act on it, would that be fair to your partner? What if it were the other way round?",
            "Don’t listen to any of your single girlfriends. They haters and want you away from him. experienced Married people for many years are best.",
            "My husband didn’t believe in marriage when I met him in December 2015. I spent a good amount of time deciding whether or not I was okay with that. Ultimately I decided that I was, but he proposed in October 2016 and we got married in July 2017. \n\nIf marriage is important to you, and you’ve expressed that to your boyfriend but he doesn’t feel the same, I think after 8 years it’s obvious it isn’t what he wants- be it marriage in general (which is totally fine) or just married to you (which is also fine). You deserve someone who has the same wants as you! And so does he.",
            "He should love you for who you are. You shouldn't have to change in any way.\n\nEveryone needs self improvement in their lives, but it sounds like he isn't happy with you the way you are now - he either thinks you aren't marriage material, or you don't meet his expectations (stable income) as prerequisites to marriage, or he simply doesn't want to get married (it has connotations of feeling like you're a responsible mature adult, which is scary). There's obviously something going on here with his thinking. There's a remote chance he's trying to surprise you, but given lockdown it's not worth it now.\n\nI also want to ask, why does he have to be the one to propose? Seems sexist, and seems like the happiness of your relationship is dependent on him alone.\n\nI would ask a few things to help clear this up:\n- Does he ever want to get married? What are his concerns? Is it money, commitment, attention, time and effort, fear of tax benefits, fear that it puts a marker in your life and there's no going back from being seen as a 'grown up? \n- Where does he see himself in 10 years? Are you in his picture? \n- What are your reasons for getting married? (E.g. celebration, bringing friends together, starting a new chapter in your lives). It's very possible he's never fully understood the reasoning behind marriage and doesn't see it the way you do. To some people it's not important, or it's a fairly trivial thing, to others it's a huge gamble and makes you part of some larger system that you might not feel prepared for or want to be part of, to some it's seen as narcissistic.\n\nI'm actually surprised myself, the average age for first marriage varies between 19-35 depending on location. In the UK, the age of marriage seems to be rising and is now between 35-41. I'm 30 and male, but marriage still seems off the cards to me.  Marriages have also gone down a lot since 1972, especially religious ones.",
            "I genuinely think he's stringing you along. He's complacent and doesn't want to commit. He'll just stay with you until something better comes along or you get fed up and finally break up with him.\n\nBeen there.\n\nEdit: you guys have been dating since you were very young. Is it possible that he doesn't once you commit because he feel like he hasn't sown enough wild oats?"
        ]
    },
    {
        "post_id": "3vd9qo",
        "author": "suppluxmasorgtfo",
        "title": "[Update] We (Husband 32M & Me 26F) have been told by his brother (37M) and SIL (30s) that we should supply all xmas gifts for the kids due to our lack of kids??",
        "url": "https://www.reddit.com/r/relationships/comments/3vd9qo/update_we_husband_32m_me_26f_have_been_told_by/",
        "score": 2198,
        "num_comments": 413,
        "created_utc": 1449198883.0,
        "selftext": "Thanks for everyone who came and tossed in their 2 cents. It was wonderful to hear from other people without having to worry if they would repeat my chatter to the other party involved. \n\n[First post link in case you dropped your phone in a toilet.](https://www.reddit.com/r/relationships/comments/3v240s/we_husband_32m_me_26f_have_been_told_by_his/)\n\nSo... I'm not 100% sure where I should start I am about 3 drinks in just to calm myself. For one I did show my husband the post after we talked. I brought up T-Day2015 and asked him if he wanted some more input than I normally give on his family drama. He said yes, I pointed out the favoritism of his brother over him in almost anything. I made a list showing times when it had happened were they and he were fully in the wrong just to prove the point.\n\nWe went over the texts from his brother, SIL, Mother, Father, Aunt and Cousin. Just to recap names...\n\n* Brother - Timmy\n* SIL- Candy\n* Mother - Rhonda\n* Father - Keith\n* Aunt - Kira\n* Cousin - Ben\n* Husband - Tod ( this is shorter than husband, I'm lazy.)\n\nSo,  the day I posted after we went over the texts which started after we missed their call and went up until we sent the email... all just... spiteful shit about how we waste our money, time, and life volunteering and don't spend enough time with their children/cousins/cousins children/family anymore. It started out telling Tod he was being a 'candy ass bitch who is whipped' by his 'cold harpy child hatin wife'. And just degraded from there. Tod only sent back a few saying he'd email him about it and asking him to not talk about me.\n\nSo we sent the email here is basically what we sent I semi edited it. Tod send it as if it was just from him, we almost added in his parents but decided we'd just forward it to them if it really got out of hand, NP Timmy did it for him!\n\n> Tim, I'm sending you an email so we can talk about what happened on Thanksgiving. I think this would be better for us both since when we are heated we say things rashly. You didn't give me much time to really think about it so here it goes.\n\n> I don't understand why you volunteered us to buy gifts. We are happy to buy gifts for your children as we have every year. Is there something going on? Is someone having financial problems? While we would gladly help anyone who asked (As we have before, you should recall Cathy and Kiki 2 years ago. you helped too!) being set up in front of young children was rude. Not to mention you telling us we aren't allowed at Christmas now. \n\n> The texts and angry voicemails were also uncalled for.\n\n> Please take some time and get back to me. I hope we can work this out as our family is very important to us. Tod\n\n\nYes well that went over about as well as water on a grease fire.\n\nFor one Timmy forwarded the email to Rhonda and Keith, Kira, and Ben. That was rude but we were going to do the same thing either way. Ben sent us a email letting us know what Timmy did and said he was sorry he wasn't there to jump in but would try and talk to Timmy. Timmy and Ben are actually really close so it was nice to see he thought Timmy was being unreasonable as well since they are normally very close/like minded. \n\nI'm not going to put his email here I'm just going to highlight what he said and then tell you what Keith and Rhonda said in their email/visit.\n\n* I am a cold, child hating, harpy, and I sleep around.\n* I'm an atheist, or a muslim... or something, he never really picked.\n* I am dragging Tod from the church and his family.\n* We don't spend any time at all with the family anymore. \n* We never spend any time with our niblings.\n* We are wasting our life/time/money volunteering with animals.\n* Helping/wanting to help refugees was un american and this is my fault since I am a first generation american and don't understand what it means to be one/deserve to live here. \n* I'm rude and never talk to them unless it's about animal rescue/animal rights\n\n\nYeah so... um. At this point we're kinda laughing and kinda crying and kinda shocked. We spent the rest of the day cleaning up our house and talking about what we wanted to do/reply back. We hadn't checked our email and we'd stuck our phones on vibrate and were just trying to enjoy our day off together, they're pretty rare sadly. So suprise! His parents drove all the way out to talk to us.\n\nI say talk, but it was more like being talked at. They asked me to leave so they could talk to Tod about 'his actions/rude email'. Tod said no, said I was his family and his wife and we were handling this together. They then tried to convince us we had said fuck in front of the family. We didn't. That we had mentioned buying gifts for everyone before. That we didn't love Jesus anymore since we hadn't been going to church. And some of what Timmy has sent in the email too. When his Father started to insult me and then in turn my Father, Tod was done. He stood up and said \"Thank you for coming to visit us in our home for the first time but we have errands to run and you need to leave now.\". They refused, he told them they had to go, now or he'd have to call the police. They left. He cried, I  cried, our cats knocked over their cups. \n\nWe ended up calling my Dad and telling him everything as well as showing him both emails. He told us they have before talked shit about me/us to him. \"You should be able to fix your child still we're still working on ours.\" was something he told us had been said. We decided we aren't going to their Christmas either way. I told Tod I can't go back there again, nor can I look at any of them the same again. I knew they'd always not liked me as much as some of the other daughter in laws but I didn't know it was to that extent. They have always been nice and polite to my face. Invited and included me in all events. No one had ever said anything to Tod either.\n\nAs it stands I'm waiting for my Dad and brother to get into town and then we're going to sit down and decide what we would like to do. Tod said he just wants it to be small and doesn't mind where Christmas happens and said he felt closer to my Dad and brother anyway.\n\nWe told Ben what happened and shipped his gift to him. I haven't decided yet what I will do with the niblings gifts but I already donated all of the adult gifts. \n\nTLDR I suck, Tod is pussy whipped bitch, we are blind, fuck it. All hail the red squiggle for making this spelling look less stupid. \n\nEdit TLDR: Sent email, got email back. Email sent around. Parents showed up, BS , all my fault, we aren't going to xmas or talking to them until after holidays are over. \n\nI'd also like to add I am not of another ethnicity. My father is German and moved to the US when he was 20 to marry my Mother. So I'm a pasty white chick but I guess since my Dad isn't american dats bad. ",
        "permalink": "/r/relationships/comments/3vd9qo/update_we_husband_32m_me_26f_have_been_told_by/",
        "comments": [
            "This is really shitty but what stood out to me was how united the two of you are in this.  It sucks for Tod that he now has a full realization of how terrible his family is.  That's hard for him and I know he's going to be dealing with a lot of emotions from this.  But the two of you took this hit *together* and that's awesome.  So, a bit of a silver lining?  Maybe?  ",
            "I'm proud of your husband for standing up for you. Go him.\n\nHis family sucks. They really are terrible, greedy people. You are Better off without them. ",
            "[deleted]",
            "FWD their emails and texts to their pastor. \n\nMaybe take a nice warm climate vacation over Easter and volunteer there locally. ",
            "> our cats knocked over their cups\n\nBest part of this whole post. \n\nBut seriously OP, it's great that you and your husband are united and working through this together. Sorry your in laws are horrid. :(",
            "Gosh, these people are such wonderful advertisements for the teachings of Jesus!  How could you not want to go back to church with sterling examples like this to guide you?\n\nSeriously, I'm glad you both stood your ground, and very sorry that it turned out so nasty.  ",
            "> our cats knocked over their cups\n\nYour cats are pretty badass. \n\nSeriously, though, I'm sorry. But it sounds like you and your husband have been handling this like a united front, and that's awesome. ",
            "This definitely isn't over yet. Keep your eyes open and continue to stick together. He's going to have a hell of a time cutting his family out of his life and I'm sure the drama train will be back with a vengence soon.",
            ">He cried, I cried, our cats knocked over their cups.\n\nYou already knew your husband had your back. Your cats have your back too. I'd say that makes this a happy update. Have fun over the holidays, it should be much better from here on out without them.",
            "> our cats knocked over their cups. \n\n/r/animalsbeingbros",
            "It is just sad how many racist family stories have surfaced lately. \n\nOP, I'm glad to hear your husband stuck by you and you still have your family in your life. \n\n",
            ">Tod said no, said I was his family and his wife and we were handling this together. \n\n>Tod was done. He stood up and said \"Thank you for coming to visit us in our home for the first time but we have errands to run and you need to leave now.\". They refused, he told them they had to go, now or he'd have to call the police. \n\nTod's the best.  He should send them an email or text saying, \"That wasn't very Christian of you\" as a cherry on top and call it a day.",
            "[deleted]",
            ">I'm an atheist, or a muslim... or something, he never really picked.\n\nIt doesn't matter, you are UNCHRISTIAN and UN-JESUS-LOVING, which makes you evil and responsible for Hitler or something. \n\nSeriously, bullshit to them. They have some bullshit idea that being Christian makes them better than you, and are trying to throw their weight around. Good on you for presenting a united front against them.",
            "I don't think that those people are worth having in your life. Best of luck in whatever you decide, but if I were you I'd put an indefinite hold on any kind of contact with them. There is no excuse for how they have treated you.",
            "[deleted]",
            "Well that wasn't satisfying. Oh sweet justice, where art thou? ",
            "The part of this I find the funniest and the most sad is when he said wanted to take care of refugees was on American when it literally says on the Statue of Liberty \n\n\n>Give me your tired, your poor,\nYour huddled masses yearning to breathe free,\nThe wretched refuse of your teeming shore.\nSend these, the homeless, tempest-tost to me,\nI lift my lamp beside the golden door!\n\n\nIdk. But to me wanting to help out refugees and the homeless sounds like one of the most American things you could ever do. Especially considering literally every single person in this country except Native Americans are  the children of  immigrants",
            "Shout out to Ben for being rational.",
            "> how we waste our money, time and life volunteering\n\n... This is some grade-A \"American Jesus\" shit right here. Reading the original post definitely made me angry but so much of this one was straight up disgusting. If nothing else thanks for the reminder of how fortunate I am to have a positive relationship with my super reasonable family. On the plus side your husband's reaction sounds wonderful.\n\nGood luck op... wow.",
            "I blame Trump. ",
            "Oooohh!!! *evil plan*: You and Tod should buy a ton of toys to give to the church instead of your kid relatives.\n\nThat way your pastor calls out your generosity in front of the whole congregation and makes Tods parents sound like selfish assholes when they complain to their friends that you wouldn't buy any for Timmy's kids.",
            "I'm sorry you've had to learn almost all  of your in laws are complete douche canoes, but at least you have your husband. He's a fucking rock and has your back, you should be proud of him because not every man would be a able to stand up to his family like he has done. \n\nDonate the gifts you've already brought to charity. Have an awesome Christmas free from selfish materialistic twats. ",
            "1. I love that they told you to leave your *own home* so they could talk to your husband. Classy. \n\n2. You're bad people for wanting to help refugees? You don't understand what it means to *deserve* to be here? Wow. Just ... wow. They're horrible people, you're great for helping with the crisis. \n\n3. What the fuck is a nibling? Is that like a child-free saying? \n\n4. Don't give the kids the presents. It sounds like they're spoiled enough. Plus I doubt they'd even know it was from. From now on you are Bad People because the grown-ups have labeled you so. Nothing you can do, sorry. Maybe when they're older and if they haven't followed in their parents footsteps they'll want a relationship. Maybe if one of them turns out to be gay or atheist and the rest of the family have disavowed them you'll have an unexpected refugee of your own some day. \n\n5. There's nothing else, I just like ~~round numbers~~ things in multiples of five. ",
            "This will get buried but I just wanted to admit that I was very very wrong about this situation and Tod's family.  \n\nI suggested that you two should strongly consider buying gifts for all the kids at Christmas because of your financial situation, I didn't realize all the time and money you spent volunteering and helping animals.  \n\nFamily is #1 for me so it was hard to comprehend how backwards Tod's \"family\" really is.  \n\nI'm sorry that you are going through this but am happy that you two are sensible enough to stick together and not let their hatred break you apart.  \n\nGood luck.  ",
            "My father-in-law and mother-in-law were both the \"outcasts\" of their families for whatever reason. FIL has a couple of siblings while MIL has many. I know they had times where they wondered how and why and what. But they were their own team. United in their happiness instead of their misery. And now I'm married to their wonderful daughter. And we are creating our own family history. As our ancestors once did and that's why we can't trace our shit back more than a couple hundred years. Which is truly shitty in the grand scheme of time and space. ",
            "> When his Father started to insult me and then in turn my Father, Tod was done. He stood up and said \"Thank you for coming to visit us in our home for the first time but we have errands to run and you need to leave now.\". They refused, he told them they had to go, now or he'd have to call the police. They left. \n\nIf you don't already have one, please think about getting a security system with video surveillance or at least some cameras.  I have a feeling that you guys might get a lawn tantrum or two as the entitled in-laws ramp up the BSC.\n",
            "Didn't see this linked in either thread, but tell your husband to check out /r/raisedbynarcissists, if he hasn't already.  Might help him come to terms with how terrible his family is and make it easier to tell them to fuck off.",
            "There's a black sheep in every family.  Be thankful that your awesome husband is the one in his.  \n\n",
            "Ah.... the true meaning of Christmas....\n\nAs an atheist I do Christmas waaaaay better than this family.\n\nSorry about your situation.  For some people there is no seeing reason/kindness/humility/ ect.\n",
            "I'm so sorry for the stress and sadness this has brought to your lives. I would say that dropping dead weight like Tod's family out of your lives will make room for more good things that will bring you joy, but with family it's always more complicated and emotional than that. I hope you have a wonderful Christmas with your family.\n\nTell your hubby to mosey on over to r/raisedbynarcissists. ",
            "I'd say your husband's done exceptionally well to turn out the way he has, coming from that stock. What a set of cunts. ",
            "*big hugs* well, now you've seen who his family really is. my god..",
            "I'm sorry, I can't imagine how hurt your husband must be.  But he sounds like a good man, I'm so glad that you were able to stand up for yourselves.  You've done the right thing.",
            "You and your husband sound like high class and caliber people. Be thankful that you have each other. You are acting reasonably and that is not easy given the circumstances here, just wanted to give you a compliment because these people who are supposed to be your family are behaving like detoxing addicts. ",
            "I can't believe how heartless and rude his family is. Well done to the both of you for handling it so well.\n\nTo: Tod's family\n\nFrom: A woman on the Internet \n\n\nYou're a pack of cunts.",
            "These are adults, right? I mean, seriously, what in the hell is wrong with these people? You aren't Christian because you spend time and money helping others? What kind of backwards reasoning is that?! Maybe when they grow the fuck up and grovel, they can be allowed back in your lives. ",
            ">All hail the red squiggle...\n\nI read that as red squirrel\n\nSounds like your in laws are all religious and racist bigots",
            "Wow, a lot of racist families exploding in their white-hot hatred this time of year.",
            "As someone who was raised in the South, I would like to extend my apologies for all of the ignorant yokels down here. \nThey're being entirely un-Christian, greedy, hateful hypocrites, and I hope that one day they see the error of their ways.",
            "> Helping/wanting to help refugees was un american  \n\nYeah, uhhh, about that. Thanksgiving?",
            "Fröhliche Weihnachten my dear.  It's SO strange to me when people are prejudiced against first gen Americans, especially when their parents are freaking European of all things (NOT to say that an Indian/Middle Eastern/Mexican immigrant would deserve their treatment, it's just extra weird that they are still super prejudiced against an extremely common, traditional, and accepted ethnic heritage in America).  Sounds like they have a very, very, very narrow view of the world.  People like that surely aren't worth your time and certainly not your money.  Pity they'll miss out on the joys of meeting new people from different places and learning about other cultures.\n\nI am happy your husband is backing you and that you both have very good spines.  Don't ever think that you are the ones in the wrong here-- their behavior is just so unbelievably awful and greedy.  They are the opposite of who they profess to be.  Don't let them get you down.  Proud of you!",
            "Bad timing, cats.  You should've knocked the cups over on them.",
            "[removed]",
            "So it's not Christian to not buy presents.\n\nBut it is un-American to help war refugees. I guess that's also not Christian?",
            "They sound like massive rednecks.\n\nAre they mormons or something?",
            "Tell me about a great Christian behavior these people show.... Really really ironic.",
            "Your husband is good. Its hard to stand up to and leave your own family behind. I've read far too many posts where he'll cave to the family instead or not stand up for his wife.\n\nKnow this, that all Christmas relations between you two and his family are now ruined because of *presents!* at no fault of yours, that really goes to show the values there. When in the future, if they think back to when you stopped coming to Christmas, a part of them will remember that this is why.",
            "My fav bit:\n\n> all just... spiteful shit about how we waste our money, time, \n\nOkay maybe they are just concerned.....\n\n> and life volunteering\n\nAll my wut.",
            "The email you two received sounds - just *sounds* - like it was either written in all caps, or as one long paragraph with no formatting or spacing. ",
            "I still think you should send them kazoos as /u/el_chapulin-colorado suggested in your original post.",
            "What terrible people. Solid proof church attendance doesn't actually make you a decent person. Based on everything that was hatefully spewed out, this has been building for a while.\n\nI think it's best to go no contact or limited contact with Hubby's family for the time being. They clearly don't respect you, your husband or your marriage. Spend the holidays with your family and be grateful that you are in this together, no matter what.",
            "Wow, the level of ignorance in that family, beside your husband is astounding.",
            "Wait... Helping refugees is unamerican? Do they have any fucking clue about American history? ",
            "Your story scares me a little because my husband and I are in a similar situation, minus the big family blow-out. No children, decent income, not able to visit family often, far more liberal beliefs than rest of family, stopped attending church, have considered volunteering with animals... Anyway, hearing stories like yours make me afraid of what our relatives think of us sometimes.",
            "They are still shitty for throwing around religion/Christianity for reasons on why they think you should buy gifts. These people are the type of people that make a lot of Christians look bad and they will receive sound judgement in the end (according to their beliefs). It's nice you were able to salvage a relationship with the cousin though, he sounds like the only non-crazy person in that family.",
            "Y'all are one badass team and combined, a force to be reckoned with, and because of this, I have an inclination to believe things that you'll be getting some apologies from the in-laws in the future. I'm sorry you married into such atrocious genes, but have mercy on them if they ever do come around. It's evolution before your very eyes. ",
            "I wish I could \"waste\" my life volunteering for animals\n\nEdit: but really, they sound like terrible people. ",
            "They made it easy to walk away, didn't they? Let them have their shitty, petty, judgmental little lives. You clearly already know how to better spend your money and time. Sorry for the mess, but I sure ain't sorry for your loss. ",
            "Gotta love that good old fashioned Christian hypocrisy.",
            "The thing that strikes me as odd is that so many of the people in the \"in-law\" family think this way.  I could see if it was just BIL and SIL, but parents, aunts and uncles too?  All of them are whacked out nut jobs against OP and her husband?  For what?  Just for not having kids?  WTF is going on over there?  I feel as though something is being omitted.",
            "I wish there was a button you could have pushed giving me the opportunity to tag team into your family affairs and tear into the POS side of that family. Its disgraceful that that even pretend to \"love jesus\" or be good what ever the fucks they are with toxic attitudes like that.\n\nNot that it would of helped solve anything. I just like watching stupid peoples stupid reasoning blow up in their faces. \n\nHang in there and merry christmas. ",
            "Are you guys permanently childfree or just not having kids on their timetable?  I think this is all about the no kids and has nothing to do with your money, where you volunteer, your dad's country of origin, or gift giving.  It's your parents-in-law revolting against the idea of no grandkids from you and thinking they can push you out in favor of his next wife.",
            "Deep religiosity develops a sense of moral superiority and illogical thinking patterns!? Stop the presses!",
            "my in laws are like this in some regard.  You are fortunate your husband immediately saw it.  Took my wife a few years.  Still...its pretty crappy.\nI just wanted to lend my support such as it is.  ",
            "That has got to be the most fucked up, toxic family I have heard of yet (and I read /r/raisedbynarcissists reguarly).  ",
            "OP, I do hope you read this, and maybe showing it to your husband would be a good idea as well.\n\nSometimes, cutting off all ties with toxic family members is what's best. My family no longer speaks to anyone on my father's side (his mother and siblings). Basically, here's what happened; Grandpa died from cancer, and he asked my dad (Grandpa's youngest child) on his deathbed to take care of Grandma financially. He had a bank account that was to be used to help out Grandma if she can't pay her bills.\n\nSo every month, my dad would go over to Grandma's trailer and calculate her bills for her, and tell her how much. She would *always* give less than what he told her, so he kept going into the bank account to take out whatever she owed to pay off her bill. He kept doing this until one day Grandma suddenly said \"The bills were never this expensive. I don't think you're telling me the truth\". Basically, my dad's sister (my god mother) had gotten it into Grandma's head that my dad was taking Grandpa's money to pay for his own shit (he had just recently bought a motorcycle with his bonus from work, as a GM of a car dealership... so sure he needed to steal money from dead Grandpa.../s) and my dad was highly insulted at the idea that he would betray his own father, when this was the only thing he had ever asked of my dad his entire life. So, my dad essentially said \"fuck you\" and left his brother to do the bills.\n\nHis brother contacted us a month later saying that my dad was right, he was doing the bills correctly, and Grandma wasn't paying enough. Neither Grandma nor my god mother apologized to my dad.\n\nThe rest of his siblings cut contact when my parents decided to stop talking to Grandma.\n\nBut we're not miserable. Cutting them off was for the better; what kind of grandmother would be so stubborn that she would refuse to apologize and now can't see her grandkids anymore?\n\nPoint of my story is, just because they're your family doesn't mean they're your *family*. Being blood related doesn't make them good people, doesn't make them love and respect you, and it certainly doesn't make this type of behavior acceptable. You guys are 100% justified in cutting them off, and I doubt your husband will be happy if he kept attempting to fix relations with them. It may be hard but it's better for everyone in the long run, especially if you decide to have children; you don't want them to be sucked into this mess.\n\nAlso, I really admire that you volunteer your life/time/money on animals. Not enough people do.",
            "Omg, you lost me at \"un-american\". \n\nSide note: there are some 330ish million Americans, to ascribe the idea that all of those people will agree that something is good American vs bad American is preposterous. \n\nIts usually used by lesser educated people that want a quick way to filter through a life of information inputs into something easy to understand... Imgrants bad. Guns good. Steak good. Obamer bad. \n\nDo what you can with these people, but limit their impact. ",
            "Your husband is awesome. His family is not. If I were you, I'd do absolutely nothing to include them in my life going forward. If they want to be part of your life, they need to respect you and your decisions, and if they can't do that, fuck 'em.",
            "I'm still trying to wrap my head around how volunteering and wanting to help those in need is \"unchristian.\"\n\nIsn't that supposed to be the backbone of their religion? \n\n\nEither way I'm sorry your husband (and you) had to see the ugly side of his family like that. No one deserves to be slandered over something as petty as this. ",
            "> our cats knocked over their cups\n\nKitty knows what's up.",
            "Please make a donation to animals and refugees in all of their names!",
            "Welcome to religion, enjoy your stay. Their religion has made them shitty people.",
            "Buy the kids The Koran and The God Delusion.\n\nTy",
            "Have you considered giving the children's gifts to ISIS? Show them how an anti-American atheist Muslim really rolls. ",
            "I'd donate those sweet kids gifts to some refugee children. They need them more than your shitty in-laws. ",
            "I am so sorry you and your husband are going through this.  It's great that you are both there for each other and supporting each other.  And your dad sounds like a great guy, too.",
            "I hope you two have a great Christmas this year in good company. Clearly, you have been missing out on it. It'll be sad, sure, but the way you two handled this? You can handle anything. Make it something amazing!",
            "Wow, and just imagine that if you guys had bought gifts for the entire family, everyone would have just pretended to tolerate horrible, horrible you, with your animal-loving evil ways.",
            "Yay for another crazy religious family! You are better off without them. ",
            "You should stir away from these people. As for talking I don't think there's any point when everything is so heated up. \n\nAfter some time when things quiet down you can all sit down and talk in a civilised manner. Now it will just be shouting and name calling and twisting things of the past and so on.\n\nI have similar problems with my in-laws and whenever they want to talk my only line is \" I really don't want to talk about this right now.\" until they get it. \n\nAs for the gifts for your niblings I think you should find a way to give them to them (maybe the post?). As for your attitude towards them i really think you should try your best to stay as you were with them as much as this is possible. This has nothing to do with them.",
            "Damn, this family is totally nuts...I say cut all ties to them. Forever. No amount of apologizing will ever do...",
            "This is agian kind of \"petty\" but maybe for ending the last year. You could send some rather \"Not so good\" aka shitty gifts to end the terms with them, and the christmas letter on their gift could be from that site (Send your enemies glitter) And just imagine the shit that will unfold when they open it on christmas.",
            "What revolting inlaws you have!",
            "Thanks for the update.\n\nI'm sorry that Tod's family have such severe issues.  But it's obvious that you and Tod have an awesome partnership.  You both did the right thing and stuck together.",
            "OP, you sound pretty awesome.  I hope you and your husband return the gifts you still have and, if you don't spend time with *your* family, do something you both want.  Cruise, trip to a bed and breakfast, go out of the country, something.  I also hope you stick around reddit, you're pretty hilarious.",
            "What awful people. They are against you spending your time helping refugees and animals? They said it's unAmerican? Ugh. How hypocritical are they? \n\nThey need to be told that even if you're not paying lip service to Christianity by attending church, you're actually behaving in a far more Christian way by actually devoting your time to helping others who are less fortunate. That they are so angry that you're helping people who are in terrible situations and instead want you to spend your time and money on them and their offspring is just monumentally hypocritical and just the opposite of what Jesus would do. Ask them to think about whether Jesus would turn away desperate people fleeing persecution in favour of providing material gifts for people who already have enough of what they need. I'm not Christian myself but can see how disgusting these people are and how far from the actual teachings of Christ they are. They should be ashamed of themselves!",
            "(((hugs)))  I'm so glad your DH is sticking up for you.\n\n\n",
            "lol\n\nWhat a bunch of miserable bigots\n\n\nMerry christmass to you and Tod!",
            "always trust the cats. and knock over their cups before the cats get to them. all over the parents. ",
            "My heart goes out to you. What a terrible thing to go through, especially during the holidays. I hope after this settles, you still don't feel like this is your fault. They are the ones acting childish and greedy. \n\nBut if they want to talk about doing the \"right Christian thing\" tell them instead of buying gifts for 15 children, you will donate to a charity in each of their names. ",
            "Lmao. You got family problems like I do. <3 fuckem so long as you love him, all you need is one another.",
            "It's just jealousy, pure and simple. Ignore them. ",
            "You're very lucky to have Tod in your life. A lot of spouses wouldn't stick up for their SO, but wow you hit the jackpot!\n\nAnd hey, at least you don't have to deal with those selfish shitburgers anymore",
            "i'm glad you've both resolved to move beyond caring what the extended family thinks.  my wife and i had a similar epiphany in the past year but was NOTHING compared to this.  we still have a relationship with them we just can't allow ourselves to invest a ton of emotion into it.\n\nwhat state do you and they live in?  i always want a geographical frame of reference to these stories, because often different cultures treat situations differently, but if this pretty much a religion/bigotry-based shit-fest i guess it could be happening anywhere.  just curious is all. ",
            "I honestly wouldn't have believed there are people so terrible in real life.  What awful people.  It's amazing your husband turned out the way he did. It's so great that you have each others backs, I just cannot get over the horribleness of this family.",
            "This is manipulative narcisistic bullshit.  Ask them to look up what a gift is.  It's voluntary.  Being completed and forced to do something that should be voluntary is the rudest thing anyone can do, in my opinion.\n\nTod has much more self discipline than I do.  I would have straight up told them that I don't know what makes them think that because they can't take care of their own lives that you have to take care of them for them like some kind of disabled kid that can't wipe their own butt.  That if they wanted my support they shouldn't have talked shit about my wife.  I would have told them to fuck off and hopefully they can learn one day to not have to live off of others hard work like some kind of wellfare recipient.\n\nI know some of that isn't really PC but I feel sometimes you have to speak the lingo that the crazy people understand to get your point across...\n\nTo Tod:  you're the man in your life, and you owe nobody but your wife anything!  Believe it and live it.",
            "You should start a blog. Just take news articles and put them into your own words. I love your writing style. \n\nGood luck with the family, and enjoy your dad and brother's company! ",
            "These people seem awfully foul mouthed and greedy for a family that is concerned that you're an atheist and your husband is being stolen from church.",
            "Wow, this family is horrible and weird. How did your husband come out normal and decent? Luck?\n\nI suggest you spend the money you would have spent on Christmas on just your family (if you want to) and spend the rest on a cruise for you and your husband.\n",
            "The pious man is concerned about the well-being of his own soul and his neighbor’s wallet. For the ordinary man, it’s the other way around.",
            "What's amazing to me is when you asked them why they thought it was ok for you to buy all the gifts, they never answered.",
            ">They then tried to convince us we had said fuck in front of the family. We didn't.\n\nGaslighting?\n\n>I'm an atheist, or a muslim... or something, he never really picked.\n\n> I am dragging Tod from the church and his family.\n\nOverly religious/possible racism?\n\n> the favoritism of his brother over him in almost anything.\n\nGolden Child?\n\nCODE RED! It sounds like your husband was /r/raisedbynarcissists\n\nMy condolences to the two of you.\n",
            "Your husband has shown you he will always have your back & you no longer have to spend Christmas trying to get along with angry, bigoted, selfish, close-minded assholes. So that's something. ",
            "I love how if you don't go to church and pander into consumerism at it's worst (Christmas) you are a hateful, unamerican athiest/muslim. You both seem like a great couple. Tod's family sucks. Hope you all have a great christmas! ",
            "Also I salute your cats.  ",
            "I wish my parents would read this. i wish pamphlets of stories like this could be dropped all over the U.S. spammed into emails, \n\n...made viral some other way so old, religious people can see it's not heathenism that drives people away..it's theu shitty hateful way the use their religion against people that make them not want to spend time with them.",
            "They asked you to leave!! In our own home! That's... something else. ",
            "First of all, let me say I do hope this ends well for you and if anything I support you because I had this happen to me last year.\n\nOH, I've had this done to me last year. Let me say every year my group(Which is a video game commentary group) and I save up money for two months and do constant donation streams to give toys, clothing, money, and other items to very poor families around the US and the UK. Well, one year as I was purchasing one of our fans who part of the list of kids a 3ds because not only was the child amazing and sweet but he to me deserved a good Christmas. My family sees it, and all hell broke loose since I had over $5000. from the charity. All of it was going to charity I had already bought gifts for my family and a few others. But my family thought my commentary group was giving me plenty of money and wanted me to pay for ALL of my cousins gifts I have 30.(Side note I'm Hispanic it explains why I have so many dang cousins)\nWhen explaining one would think they would be happy but not I have never seen fucking greedy people in my life. I did do a little revenge and the day of Christmas brought empty gifts with the names of families and kids we donated to and explained that if I was banned from the family so be it. I am, and they didn't want their precious children to learn about kids who are poor. On a side note, we did get thanks from almost all of the families, and we are still currently gathering money to buy things for them and a lot more this year.\n\nLike I said, I do hope this ends positively and as someone who childfree you have my support because reading everything they said makes me feel very ill.",
            "Maybe take a trip over to /r/raisedbynarcissists. That behavior from the parents such as gaslighting is typical narcissist behavior. As is the blatant favouritism of his brother (golden child) and worse treatment of your husband (scapegoat).",
            "Wow.  Well at least its all out in the air now.  How awful.  I hope you two manage to still have a Merry Christmas.  ",
            "Interesting how you were well and dandy until you refused to spend money on them...\n\nYou are better off.  I'm so sorry that you and your husband have been treated so poorly.",
            "This whole situation would have returned a quick \"fuck you eat my dick\" from me.",
            "Just to pass along a funny idea my mom had one year. My mom and my dad's mom didn't get along very well, so for Christmas one year my mom found a jewelry set (earrings and necklace) that had a lump of coal where a diamond should have been. I'm sure you can imagine the hysteria that centered around that when my dad's mom opened her \"gift\". lol\n\nYou guys should buy bags and bags of charcoal and wrap it all kinds of creative ways and give that to all of them. (Except maybe the kids, because I'm sure they don't really understand what's going on, if they are really young.) \n\nIf all else fails, you can buy on Etsy, these Christmas cards that say Merry Christmas ya little (emoji for shit) on the front and you open it up and it just looks like shit has been finger painted everywhere. It's the funniest thing I've ever seen.\n\nI hope my years of dysfunctional Christmases(?) (Christmas')?,  serve at least as a laugh, but maybe even a way to handle difficult people. :) Good luck to you and your husband. You guys sound like a strong couple and it's great his sticking by your side in all this.",
            "All you need is each other, and it sounds like you've got that part sorted. Have a fabulous Christmas doing things you both enjoy. Spend the extra money you're saving on yourselves, or put it towards a nice getaway. Eat, drink, shag, be merry and fuck 'em all!",
            "It seems that your Husband's family is generally acting in poor taste and don't even respect their own Christian ideals of compassion and kindness. Ironic since they go to church every week and complain you don't. In fact it's even more ridiculous because you volunteer to assist others/animals and they don't even give you the respect that is granted to another human being. I'm sorry nothing worked out in order to quell their strange Xenophobia towards you and your father. It obviously sucks that your Husband is being cut off from his family but to be honest these seem like the type of people who are not really concerned about their loved ones. Just them and their own. Let them have Christmas without you, it seems that they are hellbent on punishing you (for what? who knows?). Please keep in touch with Ben it seems he has a level-head. Send the Niblings gifts to Ben and ask if he could send them out under the guise that they are from him (then of course hidden in the gift include a card from you Tod and you). Children don't deserve this sort of family drama but they should know that you do think of them.",
            "Stupid cats knocked over the cups? Damn. ",
            "[deleted]",
            "r/raisedbynarcissists ",
            "Sorry to hear of your in-laws treating you like a heathen outcast, and a hedge fund for gifts at the same time.  But it is good to see you have a rock of a husband that won't tolerate his family being crap towards you.\n\nHope you and your husband have a good Christmas with your Dad and your side of the family.",
            "Glad you're untied for sure and man if that's what being \"christian\" is about then i'm glad i'm not set in a religion.",
            "Timmy's complaints seem a little too fixated on you. ",
            "Tell them to get stuffed...animals.",
            "> I'd also like to add I am not of another ethnicity. My father is German and moved to the US when he was 20 to marry my Mother. So I'm a pasty white chick but I guess since my Dad isn't american dats bad.\n\nYour situation sounds like a bad Seinfeld episode, and you are the \"Christmas Nazi\".  It's totally wacky and sad/funny at the same time.  I'm sorry for you and your husband, but 10x more sorry for your foolish relatives.",
            "You are grown ass adults. The request is fucking insane. In our family the kids play with other kids, I don't go looking for kids on either side to go play with or buy things for.\n\nTell that side of the family to act like normal fucking people, no one with self respect says shit like that.\n\nPeople always bring up the Jesus shit to give the appearence of being on the 'right side'. It's a twisted position to take by self-righteous douchebags.",
            ">They left. He cried, I cried, our cats knocked over their cups.\n\nI love this so much.",
            "It's just weird to me they brought Jesus into this...was there a financial problem? That's the only thing I can think of, to be honest. ",
            "Stick to your guns. Why do breeders hate us childfree so much? Jealousy of us being able to do what we want without little brats attached to us ? ",
            "This appears to be a prime example of political rhetoric informing the lives of people around them.\n\nI'd bet you that in two years, when Donald Trump isn't around to talk shit about immigrants, and the Democratic nominee (hopefully Bernie) has taken the oval office, they will fall back in to the rut of being pleasantly shitty.\n\nEDIT: Also, if you have become atheists during your marriage, you may as well let everyone know right now while the surface tension has been broken by the rest of this bullshit.",
            "Isnt there some rule about TL;DR? And that there was no TL;DR.",
            "I am redirecting you to /r/raisedbynarcissists\nYou're welcome. ",
            "Just my 2 cents here. You say they have always been polite to your face and invite you to everything. Yet you choose to sit in a separate room or area and read because your not \"super-social\". That right there is them having reached out to you and you not applying yourself. Even if what you say is true and they really don't like you and never have, they are at least trying to treat you like a part of the family and extending an olive branch, but you are just acknowledging the branch is there rather than taking it. \n\nI'm assuming all of your conversations with these people are fake right? It's all just bullshit and you count down the minutes until you get out of there? This happens with in-laws. The only way to fix it is to have a 100% honest discussion with the entire family. If feelings get hurt, who cares? You guys already can't stand each other, so what difference does it make? You guys should go to Christmas and make it happen there. Your husband needs to bring it up in front of everyone. Keep your cool, let him say what needs to be said. Then when the discussion gets heated say whats on your mind with no holding back. But, try to be at least respectful (i wouldn't just start cussing them out or anything). \n\nGet all that shit off your chest. But you have to portray that you actually want to be part of the family while doing so. The real question is do you really want to be part of his family? Or do you just want to be his Wife? If it's the latter, you need to make sure your husband understands that.\n\n",
            "[deleted]",
            "[deleted]"
        ]
    }
]