[
    {
        "post_id": "3ch6pe",
        "author": "dumbstruckhusband",
        "title": "Me [35M] with my wife [33F] of 9 years, wants to give up our daughters for adoption",
        "url": "https://www.reddit.com/r/relationships/comments/3ch6pe/me_35m_with_my_wife_33f_of_9_years_wants_to_give/",
        "score": 2202,
        "num_comments": 342,
        "created_utc": 1436305758.0,
        "selftext": "Using a throwaway because I'm pretty active in some other subs and don't want this associated with my main account. \n\nMy wife and I have been together since college and got married a little while after she graduated. When we first got together she told me she didn't really like kids and while I was a little disappointed, I didn't care too much about it. I didn't feel very strongly about it either way. We were very in love and things were perfect for a good while. Her birth control failed six years ago, and I told her that I would support whatever choice she made. She scheduled an abortion, but backed out the day before and we became loving and enthusiastic parents. Later on down the road, she decided she wanted another child and so we had our second daughter. They are five and three years old, and absolutely perfect. They are both very well behaved and ahead of the curve for kids their ages. \n\nAnother thing that's worth mentioning, my wife is a SAHM. My job is very demanding and I am out of town for weeklong stretches at a time once a month, and then 9-6 the rest of the month. I've had this schedule since we were married, basically. I make good money, in the low six figures, and we've never had any kind of financial struggles.\n\nFor the past few months, I've known something was up with my wife. She is obviously the primary caretaker of our daughters, but recently she's been completely hands off when I'm at home. I don't mind spending the extra time with my daughters taking care of them, but it's more than that. She will completely ignore them while I'm around. If they ask her for anything at all she tells them \"go ask Daddy\" and will go in our bedroom and lock the door to get away from them. I've been asking her if she's alright, and she had been insisting everything was fine until last night. \n\nAfter we put the kids to bed, she came to me and sat me down at the table. She started talking about fun things we had done right after we got married, what a great adventure everything had been, just generally reminiscing. She was being sweet and funny and loving and my guard was down. She said \"back before we had the girls, we could do anything we wanted. I wish we could go back to that.\" I asked her what she meant. After much prodding she admitted that she regretted having kids. I said that there were times where I felt overwhelmed too, but that I would always love our daughters. She got quiet. She mumbled something and I asked her to say it again. She yelled \"I DON'T LOVE THEM\" and then started sobbing.\n\nI sat there with my mouth hanging open. She composed herself and then started talking again. She was saying how she had been looking into adoption agencies and foster care. She had contacted one agency already. She was making plans to give away my CHILDREN. I continued to listen, too dumbfounded to say a word, as she babbled on about how amazing it's going to be to have our lives back, how great our relationship will be when we don't have kids anymore.\n\nI didn't know what to do. I let her talk herself out, and when she went to bed I went and got my babies, packed some things, and drove to my mother's house. I called in sick to work today. I told them I'd probably be out the rest of the week.\n\nI have a ton of missed calls, voicemails, and texts from my wife. I haven't looked at any of them. I've spent the day talking to my mom about things and keeping the girls occupied. My mom doesn't know what to do either.\n\nI'm thinking I have a couple of options: start calling lawyers or start calling mental health professionals. Maybe both. I don't know if she's having some kind of psychotic delusion or if she's just that awful of a person. I really don't want to go back home to her now. Ever. I'm thinking divorce is the best choice, but I can't take care of my kids on my own. What should my next move be? Should I try to call my wife?\n\n\n   \n**tl;dr**: Wife went off the deep end, tells me she regrets having our daughters (3 and 5) and wants to give them up for adoption so we can go back to our old life. I do not know how to proceed, in any regard. Please help me figure out how to handle this.\n\n**EDIT: Additional Info\n\n She's not at home all the time with them. They go to pre-k for six hours a day four days a week. My mom takes them pretty much every other weekend. She gets a lot of time to herself, even though it could be more, and on nights when I'm home she goes out with her friends often, and lately when I'm home she doesn't see the kids at all... It's still possible that she's overwhelmed, but she's not the isolated 'barefoot and pregnant' chained to the stove woman you're picturing here.\n\nWe've both always been pretty low libido, I would say we have sex once a week and we try to have a date night every other week (leaving the girls with my mother). We are very affectionate towards one another.\nShe graduated with an art degree. When we first got married she was working as a teacher, she taught english and art in a local high school. She hated it, and she quit when she was pregnant with our first. She has a \"studio\" in our house, basically an extra bedroom with all her art stuff in it that the kids aren't allowed in, and she paints when the kids are out of the house. She feels like her degree is useless, but told me she wasn't interested in going back to school.\n\nWe used to pay for a weekly maid service, but my wife decided she didn't want to spare the expense.\n\nI'm just looking for input right now. Honestly I feel like her response to this situation was completely out of line and nearly unbelievable, and I'm not sure I want to continue a relationship with someone who considers giving away her kids before even asking for help. She has consistently denied that anything was wrong and apparently put up a front to make me think that she wasn't struggling.**",
        "permalink": "/r/relationships/comments/3ch6pe/me_35m_with_my_wife_33f_of_9_years_wants_to_give/",
        "comments": [
            "Just out of curiosity, I know the girls are little, but have you asked them how mommy is when your not there?\n\nNot to say she would neglect them, but that's just an interesting situation to me. What's life like when dad is gone? \n\nI think you're doing the right thing removing the girls from the situation. It sounds like she needs some sort of help. I hope it works out for all of you. \n\nGood luck dude! You sound like a pretty good Dad.",
            "I don't know why everyone is being so hard on you for taking your babies over to your mom's place when YOUR WIFE HAD BEEN CONTACTING ADOPTION AGENCIES WITHOUT YOU!!!! That is nuts! Totally nuts! Your reaction is completely understandable, holy crap. \n\nThat said: I think that marriage counseling and individual counseling are in order. And a nanny. And everything u/hopefulthr0waway says. \n\nETA: Keep your kids at your mom's place as long as you can, they shouldn't be around your wife if it can be avoided. Also, talk to a lawyer. If you divorce your wife, what would the alimony situation be like? I mean, I feel like you OUGHT to be given primary custody, if it comes to that, and if you're making six figures you can probably hire someone to help you take care of them.  ",
            "I... don't know what's up with people in here.  A woman goes behind her husband's back to call an adoption agency, and everyone is jumping on *him?*\n\nYes, she needs help.  But also, yes, he did the RIGHT THING in packing the kids up and taking them to his mother's.  The children come FIRST AND FOREMOST.\n\n",
            "Your wife sounds like she has a serious  problem. You did the right thing to take the kids and leave the house.\n\nShe was contacting an adoption agency and her talk about leading a life without the kids certainly was giving me some chills down the spine.\n\nPlease get her help before you let her near the kids again - she is sick, has fantasies living without them, she says she does not love them - it will not hurt her if she has some time off them.\n\nI think this is a temporary state. You would not have had the second baby otherwise. She just needs some help at the moment.\n\nWish you well.",
            "Any person who says they don't live their children and have called adoption agencies, all the while dreaming up a new childless life for her and he spouse.. Is CLEARLY in crisis. Get her some help. ",
            "Okay I'm going to get downvoted to Hell and back but I think she's completely at fault here. Yes she may need professional help, yes she may be burned out but for God's sake, SHE ALREADY CALLED AN AGENCY BEHIND OP'S BACK!!\n\nShe's already started the steps towards getting rid of their children! Right now he needs to make sure his children are safe and together with him. His wife made a decision to not have the first abortion, and she \"wanted\" to have a second child. She's now making the decision to get rid of their children because she regrets it. \n\nI understand that she's overwhelmed, that she may be completely burned out or that she may have never wanted children. But the fact that she took that step without speaking to her husband about it before hand is sickening. And then continued on to talk about how \"their lives\" will go back to the way it was before and all the stuff they could do.  \n\nOP please look after your children. Once they are safe and out of the equation please help your wife seek the helps she needs.",
            "Dude I'm reading half these replies, and they're shit. Consulting an adoption agency before talking to you is absolutely not okay.\n\nLegally though taking the kids and running I feel like could put you in a lot of trouble. Definitely consult a lawyer.\n\nAs a dad, I completely get where you're coming from, if my wife to be did that with our son I'd be scared shitless of what she'd try to do.\n\nI would also consult a psychiatrist or a counselor on what you should do for your wife. Personally I don't know how to approach this. I know that's definitely a scary situation and you're not the devil.\n\nShe's got a lot of issues and just sounds really immature and living in the good old days, and is just going off her emotions, like really hardcore. That's not expert advice at all though.\n\nGood luck.\n\nEdit: mobile",
            "First, keep the kids with your mother or have your wife move out of the house. I am afraid when you inform her that the girls aren't going anywhere, she is going to do something drastic.\n\nSecond, your wife is having some sort of mental breakdown. Sounds like she never wanted to have kids and has been miserable with them. She is not a bad person for not wanting kids, but she is kind of crazy to think you would just pass off your kids like its nothing. \n\nThird, You need to have her evaluated.\n\n\nAs for the rest of it, if she does not want the kids then she can give up her custody and move out. ",
            "I've had PPD, I've been a SAHM and have been through bouts of depression and anxiety but I have never, in my life considered giving up my children, much less taking active steps to do it.  OPs wife may be the primary caregiver, but it sounds like she has it alright.  Her youngin's are out of the house a lot during the week for PreK, she gets regular \"grownup\" time with her friends and her husband and she doesn't have to sweat financials because they are stable.  There were times when we had almost none of those things and still kept standing.  There is something truly, seriously wrong here.  She's obviously in need of mental help, however, OPs primary concern right now should be those kids.  I'd go as far as to say this woman should not be left alone with them, period.  She called local agencies!!  She cannot be trusted and is not in her right mind.  OPs mom should watch them if he has to return to work.  Get a lawyer ASAP even if you consider staying married to your wife.  Make sure that your parental rights and your children are protected from this sick woman.",
            "Start with the mental health angle. I've read accounts from some mothers that when they were in the grip of postpartum depression, they felt nothing for their babies, couldn't bond with them. Is it possible that your wife has been faking it all this time, thinking she's irreparably incapable of loving the girls, when maybe she's just in need of medical intervention? \n\nAnd of course, some people simply aren't cut out to be parents, and unfortunately don't figure that out until they've been muddling miserably along for years. Whatever is going on with your wife, thank god those little girls have you. I tend to defend people's behavior by raising the possibility of legitimate illness, but your wife's having gone behind your back to research *giving up your babies* is a whole other level of disconnect. I wish you and your girls all the best. ",
            "[deleted]",
            "Your wife really does need to speak to a professional. Maybe you should also consult a lawyer, just in case, as she has already contacted an adoption agency...sorry to here this is happening to you. ",
            "I feel for you and your daughters, if this is as out of the blue as it seems it could be due to some kind of mental issue, and you should reccomend she go to therapy. As for your kids you should talk to a lawyer and make sure he is aware of the situation so he can tell you if there is anything you should do to protect yourself and your kids(worst case sinario she tries to get the kids taken away and it looks bad on you), and start preparing to be a single dad. You can try talking to your wife, but be very clear that losing the kids is not an option, and see if she is willing to work things out. Make it clear that the life you had as a couple without children is over, you have moved on from that place in your lives, you cannot just go back and give up your responsibilities, she is living in a fantasy world if she thinks things will magically go back after giving up your kids. \n\n\nI wish you and your family the best of luck.",
            "Don't move straight to divorce. This could be an acute mental health issue that can be resolved. Wanting to give your kids up for adoption is NOT normal.\n\nTalk to her and tell her:\n\n1. **That adoption is absolutely not an option.** That if she decides **she** doesn't want to be a full-time parent anymore, you could get a divorce, *you would take custody of the kids*, and you would expect her to have regular visits with them (and help cover the costs of raising them once she has a job). But you'd like to try therapy for her first if she's up for it, and reassess over the next few months how she is feeling.\n2. That she absolutely must get into therapy right away. 2x weekly individual sessions for her, 1x a week for you two together. \n3. That she should start applying to jobs so that she can get outside of the house. And potentially support herself after the possible divorce that she has essentially requested.\n4. That you guys will do a date night every weekend. \n5. That a nanny (and your mom?) will pick up the bulk of the childcare from now on.\n\n\n\nI'd lock down any accounts you'd rather she not have access to and have a quiet consultation with a divorce lawyer now just to get your ducks in a row.\n\n**Do NOT leave her alone with the kids for the foreseeable future. You don't want some sort of tragedy where she really goes off the deep end and hurts them. I know it sounds impossible, but it's not. She's clearly unstable.**\n\nEdit to add: The therapist's records could also be subpoenaed someday for a custody battle if needed (doesn't sound like she'd want custody, but...) so it will help to get documentation of her current state.",
            "She's talking about wanting the life before kids back, the thing is if she gives up the kids she can't have you. You are a dad now and you don't want to just dump your kids on the steps of a church to go off and party. \n\nI think before you do anything have a conversation with her in a neutral place, where you outline this to her. If she wants out of motherhood she can go, but she is also leaving her marriage. She might be having a breakdown and need  mental help. But if she really wants to give your kids away, then you are the one who gets them. Not some foster family. ",
            "How are people jumping down the OPs throat and completely overlooking the fact that his wife CONTACTED A FUCKING ADOPTION AGENCY TO INQUIRE ABOUT GIVING AWAY THEIR KIDS!!!",
            "Oh, c'mon everyone demonizing him. My dad worked/s full time, and when they got divorced the oldest of us 3 was 5. He didn't have a sometimes wife either. He worked all day and came home and did all the chores too-until we were old enough to help at least. I'm sure my dad was stressed out of his mind, and tons of single parents do it.\n\nHe also didn't try to give us up for freaking adoption. He never made us feel bad about it, and he did it alone.\n\nAnd his edit says the have pre k. Its not like she's chained to them and the house, she's messed up. What'll happen to those kids if they ever find out their mother tried to get them adopted?",
            "Counselling for her right away.  Get in a nanny part time and go to marriage counselling as well.  Even though she didn't want kids, she CHOSE to keep the first and CHOSE to have the second.  If she hasn't bonded to them at all she could be struggling with late post partum depression from the second child.",
            "Please tell me it's not that easy. A mother can just call an adoption agency, sign some papers and hand-off your children? Please tell me you would have to be involved in that for it to actually be legal and binding.",
            "Mental health problem for sure. Get her treatment ASAP.\n\nGood luck.",
            "[deleted]",
            "[deleted]",
            "Reddit is basically anti-kids so youre going to get a lot of  responses saying your wife is justified in her craziness. Even if she is exhausted and never has time to herself (which isn't the case according to your edit) it is completely abnormal and disturbing for someone who chose to have a child (which she did by not having an abortion and choosing to have a second child) to not love them and not want to raise them after 5 years. I would divorce her because you can never trust her with your children and how can you ever look at her the same way? You can encourage her to get help for her emotional issues, but you should definitely move forward with a divorce either way. And look in to an au pair.They are less expensive than a nanny.  ",
            "[deleted]",
            "With nannies or daycare or the help or your mother you can make it work. If your wife feels trapped and doesn't want to keep your daughters you can always divorce and take full custody of them",
            "[deleted]",
            "[deleted]",
            "[deleted]",
            "[deleted]",
            "[deleted]",
            "I can't believe that you looked at your wife breaking down in front of you and you turned your back on her.\n\n",
            "OP, i think the \"awful person\" assumption is a bit too far at the moment.  I understand that you are emotional right now, but assuming she is an afwul person won't help anything at this point, she could very well be overwhelmed or having other difficulties.  Obviously here actions and mentality are shocking, but \"awful person\" is a bit far right now.  \n\nFirst step is to call her doctor/therapist and ask how you can set up an emergency meeting with them.  I'm not talking about next week, but an appointment tomorrow.  You also need to contact her and tell her that you both need to go in and talk to some healthcare professionals to see what is going on.  I would leave your kids with your parents, if you need to ask your Mom/Dad to take extended leave and pay them, then that is what needs to be done.  You will need to be free to work out things with your wife.  You can go and see an attorney if you really think that is important (actually not a bad idea especially if you think she is unstable and may have access to the kids at daycare), but your very first step needs to be making sure your wife is ok and that there aren't any medical problems that are effecting her.  Seriously, it would be a HUGE mistake if she is suffering from some type of mental illness that can be easily treated and you just take the kids and run.\n\nTake the easy first steps (doctors appointment and staying with your family) and get to the bottom of this.  If it turns out that nothing is wrong with her and she really just doesn't like your kids and wants a carefree like, then you have the option of moving forward with divorce proceedings.  Right now, find out why she thinks her actions are reasonable.  ",
            "You definitely both need some counseling ASAP. You need to hire some help,  no matter what the cost.  You need to reinvest in your marriage, not run from it. ",
            "You need to talk to her one more time to see how she feels after she has had time alone. If same take your kids as far as you can away from her. Convince her into counseling, after all she was your wife for so many years and you must care about her well being.",
            "You do need to talk to your wife. Calmly, away from the house, and without the kids. While her actions do seem reprehensible, she is reacting to a life she sees no way out of. She is the sole caretaker of two small children 90% of the time. It may be that she loves them but doesn't love what they've made her life. You need to own your part in this. Leaving the kids with her for a week every month on top of working long hours is not a good situation. You don't say whether she takes time out for herself, but it doesn't seem like she'd have much of an opportunity. Counseling is very much in order here. Stop looking at your wife as the villain, and remember that she is a woman you feel in love with and chose to start a family with. Find a good counselor go from there. \n\nEdit: can someone explain the down votes? I don't mind people disagreeing with me; I just don't know why communication/counseling is bad advice. ",
            "Maybe you should pull your head out of your ass and help your wife before she goes all Susan Smith on your children. Take time off from work, hire a goddamn nanny. I hope your job was worth this. ",
            "Take this with a grain of salt. I'm not going to comment on the actual problems, or try to offer any advice you haven't already received. Its tough with the edit for people to make comments based off all the facts.\n\nHowever, what gets to me, is that she told you. Think about it for a minute, she said it, out loud, to you, without the fear that you would disagree.\nHave you ever given her a reason to think you'd be on board with this? \n\n She may actually be going through some type of mental break, and that would need to be addressed by a professional. \n\nI cant really get a feel for the tone, when she told you, but it seems she thinks its a perfect little plan, and that youd be in agreement for whatever reason. \n\nTake solace in the fact that if she really wanted to get rid of them without telling you, she would have. They'd have been gone already, plenty of creeps are accessible, black market type shit for child selling and such. \n\nWhat I'd focus on here, is her telling you her plan, and not at all seeing how crazy it might be. If she snuck around, and you found out without her telling you, I'd be more concerned for the children. That would she she knows what she is doing is morally wrong, and that shes \"evil\" about it. \n\nPersonally though, it sticks out to me that she would tell you all about this expecting her plan to be mutually accepted and reciprocated. \n\nIs it possible she was just ranting, and joking around to gauge your reaction? To make it a point to you how terrible she is feeling? Or did she come off as serious? I'd make some phone calls, she definitely needs to be evaluated by a professional. ",
            "So, it's safe to say that your wife is literally alone with the children more than half of the hours in the month. If we subtracted out the hours that the 4 of you were asleep, then that percentage increases. That would be difficult even if she didn't have toddlers. I can imagine she literally never gets a second alone when you're gone. And when you're there, she probably doesn't get much time alone with you. \n\nNo wonder she's stressed out and hates the children. Does she get any help with the house, like a maid? Does she get a few days a month without kids, and do you and her get any date nights without kids?\n\nI highly doubt she's just an awful person. You would have picked up on her lack of bonding with the children years ago if she was just a terrible person. This is assuming that you're attentive and supportive. I have a hunch that she's super stressed out, especially when you're gone for a week at a time.  Have you considered that the weeks that you're gone, it's entirely possible for her to go several days without any sort of genuine interaction with another adult. \n\nShe needs some help right now, whether it's mental help, or help throughout the day.  \n\nEDIT: My cousin was in a similar situation. She was a SAHM with 3 young children and her husband had a high stress sales job that brought in a lot of money, but also required him to travel once a month, just like you. She was with the kids 24/7 and the times her husband was travelling were terrible.  It got to a point where she cried herself to sleep every night he was gone because she was so stressed out and so deprived of any real adult interactions.  How is she doing now? The kids are a little older, elementary school,  and things are awesome. They started getting a babysitter every Friday night and made a weekly date night. He stopped travelling for work. They take regular family vacactions, vacations with just my cousin and her husband, and vacations with friends, on top of being highly involved in their children's activities (coaching soccer,  pta, music recitals). I can honestly say that the children are well adjusted, bright for their age, and my cousin and her husband are 100% in love along with being rock star parents. \n\nThey'd never be where they are now if her husband had kept things at the status quo. ",
            "Get a nanny. It is hard to take care of kids. Also get her to a psychiatrist."
        ]
    },
    {
        "post_id": "4rfa8g",
        "author": "depressedcantaloupe",
        "title": "I [32M] asked my girlfriend [33F] of 12 years to marry me, and she said no, now she is being extremely distant and i am really confused",
        "url": "https://www.reddit.com/r/relationships/comments/4rfa8g/i_32m_asked_my_girlfriend_33f_of_12_years_to/",
        "score": 2200,
        "num_comments": 589,
        "created_utc": 1467757851.0,
        "selftext": "Me and my girlfriend have never fought, we get along fine. We have been living together for 9 years now, and have been dating for 12 years. We have a healthy sex life, we both have decent jobs that bring in decent money. In the past we talked about marriage a lot and would often joke about what our wedding would be like (yes i know how stupidly lame this sounds), however we always agreed we needed to settle down first. \n\nWe bought a house about a year and a half ago, and were finally able to settle down. Our work schedules normalized, we were able to remove a huge waste of time from commuting, and we were finally able to take various activities after work (e.g. Dancing classes, cooking classes, etc). We were able to finally settle down. \n\nFinally we decided to take a week off and unplug on the week of 12 year anniversary. She wanted to go camping and hiking, and do the things we used to do when we were first dating. Unbeknownst to her i secretly decided to pick the exact same area where we met to do our hiking/camping trip. \n\nTwo weeks ago as we are leaving she realizes where we are going and becomes ecstatic, and gushes about how romantic i am. More or less everything seems perfect. We do our hike, and we unpack, setup and by sundown everything feels perfect. So i decided to pop the question. \n\nThis is where everything kind of falls apart, i ask her, and she just says \"no\". We literally went from \"i love you's\" to the single most akward silence i have ever had in my life in the time span of about a minute. We sat there kind of not saying anything before she says she is tired and goes to bed. She basically proceeds to cry her self to sleep while i sat there doing nothing. I basically didn't sleep and the next morning, she says she wants to go home. So we pack up and have a really awkward 3 hour hike back to our car. There were a few times where things kind of felt normal and we were joking around like we used to be for a bit. \n\nOn the way back home, we are talking and chatting normally, but it just feels akward. At one point we stopped for coffee, and asked if she wanted to talk about what happened and all i got was a curt \"no\". This is followed by another extremely long silence for the rest of the drive home. We finally get home and i unpack everything while she goes off to bed she is going to bed.\n\nCue more crying, i tried really hard to talk to her but she pretty much told me that she just needs time to be alone and think. The next day she tells me she is going to take some time and see her family (which is literally on the other side of the country). \n\nIt has been about two weeks since i dropped her off at the airport, she sent me a few messages to tell me she is fine, and that she needs some more time to think. Her best friend has been asking me every other day about what is going on with her, since she hasn't really been responding at all. I know she is okay though due to her posting some pictures of her and her family on Instagram. But it just feels really weird.\n\nI am an absolute giant mess, i just don't quite understand what is going on. None of my friends have really offered me anything of value. I just feel if i didn't ask the question everything would be absolutely fine, and i don't really understand what is going on. \n\nI keep wanting to grab her laptop to try and figure out anything. I am not close to her parents at all, but i trust her and want to respect her space, but I don't know when she is coming back. I even sent her a message this morning and i know she saw the message and received it. But hasn't replied. \n\nAlso her work has called me this morning asking about where she is. Apparently she had taken an extra week off last week, but she was supposed to be in yesterday.\n   \n**tl;dr**: Asked my girlfriend of 12 years to marry me, and she said no. Now everything feels like it is falling apart and i have no idea what to do. What should i do?\n\nP.S. I am sorry if this comes off really rambly, i am just trash at writing, and have rewritten this half a dozen or so times. \n\n*EDIT* To clarify a few things.\n\nThe reason why it took so ong for us to get married, is we both agreeded we wouldn't move to the next step until we finished the following:\n\n* We both finished school, for her that wasn't until 2 years ago\n* We both had stable jobs\n* We had a place where we could agree would be good enough to take stuff to the next step\n* We both had decent working hours, for a long time she was doing her residency and we more or less worked opposite shifts.\n\nWe did talk about marriage, and kids and both agreeded it would be part of the next step after we got settled. \n",
        "permalink": "/r/relationships/comments/4rfa8g/i_32m_asked_my_girlfriend_33f_of_12_years_to/",
        "comments": [
            "I feel like your girlfriend is  going through some sort of crisis. It's unusual that she would be so cool to you after proposal but then disappear for over two weeks abandoning your relationship and her job which I'm sure was not easy to get. Considering that she just completed her residency it's very unwise for her to pull something like this on her employer. It's as if she's trying to throw everything she knows away at this point. That's very concerning to me. I hope that you can get the truth out of her soon.",
            "I am just guessing, but I wonder if there is some deal-breaker about marriage that you don't know about, like she can't have kids or something. So she's been putting off all talk of marriage, putting conditions in front as long as she can, but now there's nothing in the way and she just can't tell you.\n\n",
            "I am so angry with your girlfriend.\n\n\"Yes\" is an acceptable answer.\n\"No, I don't think that's what I want right now\" is an acceptable answer.\n\"No, honestly I'm not sure I will ever want us to be married\" is an acceptable answer.\nEven \"No, and actually we need to talk because I don't feel the same any more and I think we should break up\" is a sad but acceptable answer.\n\n\"No\", then running away and refusing to talk to you is not an acceptable answer. It's incredibly disrespectful to your relationship. There is no valid reason to treat someone you supposedly love in this way.\n\nTell her it's okay she turned you down, that it's okay if she doesn't want to get married now or (assuming you *are* okay with it) doesn't ever want to get married. Tell her whatever is wrong, you're there to support her. If she is just undecided and needs time to think about it, let her have as much as she needs without bothering he with this subject. But do *not* accept completely refusing to communicate. If you don't talk, it's going to end one way or another. If that's what she wants, she should say so and not mess with you.",
            "I'm wondering if there is something up with her health. Could that be possible? ",
            "I think at two weeks its reasonable to be a bit strong in your wording in asking her what the heck is going on.  Up to and including giving her parents a call.\n\nIt is possible this is the start of her running away from... whatever it may be.  I would set a date in the future to consider yourself broken up.  Say 2-4 more weeks (1-1.5 months total).  I would not send a passive aggressive \"so does this mean we are broken up?\" as that just lets her cop out. ",
            "Wow that sucks, I'm sorry!  The only thing I can think of is you guys were kind of coasting along, but this made her confront how things actually were and she isn't happy?  I had one relationship where we never fought, which I thought was great...but later on I realized it was because we had no passion and no communication. Could that possibly be an issue?",
            "[deleted]",
            "I have several thoughts, all of which are guesses, but maybe one will ring true based on what you know about her. \n\n1. She may be having second thoughts about your relationship. She may have been thinking of how to break things off, and just wasn't sure how to. You asking her to marry has thrown a kink in that plan. \n\n2. She changed her mind about wanting to get married at all. \n\n3. She may have given up on you asking her to get married (she's 33). If she had wanted to have kids, she's now getting to the point where it will start becoming increasing difficult/risky to do so. She may be mad you didn't ask years ago, and is now trying to sort out her feelings as to this proposal that she thinks is too little, too late. \n\n4. There's another man in the picture (that you aren't aware of), and she's torn between the choice of you or him. ",
            "She owes you an explanation.  I would be on her parents doorstep demanding one.  The way she treated you is an immature and thoughtless way to treat someone you love , not to mention self centered!! ",
            "[deleted]",
            "I really have no suggestions. I'm just a bit concerned at the number of people who suggested she was disappointed in some way by the proposal.\n\nA woman really in love is not going to care if he has the ring on him or not, or if the location isn't the most romantic in the world. If  goes \"no communication\" for two weeks and blows off her job, there is something else wrong. If she had just cried that night and talked about it with him later, then maybe. But this is something else entirely. I don't know what. But it's something other than the location/ring. ",
            "My wife originally told me \"no\" when I proposed, so I can relate. Although you have been dating a long time, marriage may not have felt \"real\" to her until you officially presented her with the choice. Remember that you had all the time in the world to mentally prepare for this, plan the proposal, get hyped for it, etc. and she had a single moment to decide yes or no. Given how she kept pushing off this commitment for years, I assume change is not something that comes easy to her so she may need the same time you took to REALLY adjust to the idea of marriage.\n\nThat being said, disappearing for weeks with little to no communication is not the way that a healthy couple resolves conflicts. If the relationship continues, you really should go to counseling to work on your communication with one another.\n\nI hope you emerge from this a stronger couple.",
            "Well, to be clear, she's treating you like shit right now. Regardless of her justification for doing so. Ignoring someone for 2 weeks after that is cruel and terrible.",
            "Hey man, any updates here? ",
            "I'm going to be the asshole who says, dude, snoop. \n\nYou've given her time, though you didn't really have a choice, as she bolted after twelve years with little explanation. I find it odd that she left her laptop there. You obviously love her a lot; there's no way she doesn't know she's got your heart in a blender right now. This is unfair as hell and super disrespectful. Assuming she comes back, do you think you'll be able to start back right where you left off? \n\nLook for answers. It's rude, yes, but it's much more forgivable than what she's done, assuming she ever finds out about this. Desperate times.",
            "Okay, you need to give your girlfriend some time. There is something else going on here, and it probably won't help for you to push it. You have to let her have some space and then approach you.\n\n\n\nPeople are saying that she just changed her mind about marriage or was getting cold feet, but I don't believe that. You're not the only one who is a giant mess right now, *she is too*. To the point where she is missing work. To the point where her own best friend doesn't understand what it is going on. I mean if she just didn't want to marry you and you had forced the issue, why could she not say that to her own friends?\n\n\n\nHas she seemed ill or in any way off lately? Has she had any extra doctor visits? I mean from your story it seems more likely that she is privately facing the onset of a serious illness and is unwilling to burden you with a marriage heading into it than it is that she's just been stringing you along. People don't spend days crying themselves to sleep when someone they only feel lukewarm about proposes to them. The fact that she was ecstatic about the romantic trip and then *completely shut down* when you proposed is a strong indication that there is something much more complicated at play right now. And you won't know what it is until she feels comfortable talking about it to you.\n\n\nRight now the best thing for you to do is exactly what you are already doing. Be willing to be there for her, and work through it when she is ready to talk.\n\n\n\nNo matter what, **do not let the internet convince you that your girlfriend doesn't love you when she might actually need you the most**. Wait and communicate with her. You've been together twelve years, you can give her another week if she needs it.",
            "There's something you don't know. Health, mental health, past trauma, affair, something hurtful you did or said, a strong unvoiced opinion of hers... whatever it is, you're not going to find out by sitting on your ass.",
            "I know I am way late to the ballgame on this one but I wanted to say that you are a lot more understanding and patient than I would have been.\n\nThe moment she said no, we would have been having a conversation about the why's, if's and when's.  I get that maybe you wanted to let her have some space for a min. and I'm sure you needed it as well.  But there is zero chance in hell that we would have went to sleep that night without at least getting some form of explanation.\n\nThe fact that she bailed to the other side of the country and is avoiding talking to you is pure and utter crap.\n\nThe fact that she is a pediatrician and has not shown up to work after going past her approved time off is totally irresponsible.  This makes me think there is some form of very serious issue here.  Be it health, mental health, another guy, mid life crisis or whatever.  People don't generally piss away 12+ years of schooling for no good reason.\n\nI hate to ask but what exactly do you do for a living?  You said she makes 75% more than you do and I wonder if there isn't something there to look at.  Not just the money but sometimes the status of your S/O is also in question. \n\nI'm sorry this happened to you, she is being totally unreasonable here.",
            "I read your post the other and and have been looking for it *everywhere!*  So glad to have found it... \n\nDo you have an update?\n\nI really feel for you and your situation.\n\nDid you find out what's up?\n\n",
            "OP I need an update here. Please. ",
            "I'm wondering if she isn't already married - made a mistake at 19, and has just never bothered to fix it.\n\nHence the emergency trip back to her home state? ",
            "Part of me wonders if there is something in her past haunting her. Either a past marriage (failed or even still legally without you knowing). Or maybe she cheated and guilt is catching up to her? I don't know. Interested in an update though. ",
            "If after 12 years you can't have an honest and open discussion about something as big as marriage, you don't have nearly the relationship you think you do, sorry man.",
            "Have the two of you discussed proposals before or just the idea of getting married?  Maybe she's always assumed this would be a decision you'd come to together and felt blindsided.   If she didn't want a traditional proposal, she may be doubting how much you get her.",
            "Dude, stop asking \"Should we talk about it?\" and start asking \"Why not?\" maybe throw in a \"It's driving me crazy not knowing why and I'll try my best to understand if you'd just tell me.\"",
            "I can't speak for your girlfriend, but I have reacted in very similar ways when I've been confronted with life changes while I was depressed. The depression was there, lingering in the background, but it wasn't until there was a change or the possibility of change that it boiled to the surface. I'm not sure why. You mentioned she's missing work now and even her friends are saying she's acting weird, she may need to get her mental health checked. ",
            "Ahh, that sucks. When a relationship lasts as long as yours does without getting married (this is dependent on whether or not both parties even care about marriage), things can get a little... brittle. I know this because I dated my gf for 7 years before popping the question, and near the end it definitely could have gone \"either way\" - that is, marriage, or breakup. \n\nBased on her reaction, I would definitely say that she's rethinking things. She doesn't want to get married to you, for any number of reasons, but I think she's not happy about this relationship ending. Or, more to the point, she doesn't know where your relationship is going now. It's not really fair to you at this moment, for her to run away and not give you a clear answer. But I'm not sure there's much more you can do than give her some space to think things through and tell you what's going on. ",
            "Get on a plane or in a car and go and find her.  Take emergency leave.  Make it clear to her that the proposal is not a marry me or split decision but a request to consider marrying in the future and that you'll love her and be with her regardless. Go find her.  In her heart that's probably what she really wants.   ",
            "OP, just checking in to see if the throwaway name pun was purposeful. Depressedcantaloupe = depressed can't elope? If so, bravo.",
            "Okay, so my SO and I have been together for 10.5 years, and we're finally eloping in December. I have no ring, no desire for a ring, and all the decisions were made together. \n\nBut! He's told me that if it wasn't so important to me, he'd stay the way we are, not married. He's happy, but if marriage is what I want, marriage is what we'll do. He came home one day, like, almost a year after we'd started talking about when would be a good time to get married and told me about this thing called Weddings To Go Key West. So he was the one who made the wedding suggestion, though I'm the one who firmed up the plans. \n\nWe came to this decision together. After being together for so long, we had to. People like to ask me what he's waiting for, why hasn't he proposed, but he was waiting for me to be ready. And if he wasn't ready, I'd still be waiting for him. \n\nMy gut is telling me she's happiest being together but not married. There's nothing wrong with that, unless it's a dealbreaker for you. That's a huge conversation and it may not end well. She also just might have wanted to make the decision together, and not have a surprise proposal. She said \"when we're settled\", but she's having trouble communicating something to you. Maybe she doesn't even know what the problem is. But if my love had gotten a ring and proposed, I'm not sure I would have said yes right away because it's not what I wanted, and he knew that. (Except a jumbotron proposal at a Celtics game. That would have been a winner!)\n\nI hope you two are able to work everything out. Best of luck.",
            "I think it feels like there's hidden guilt, and you asking her to marry you caused it to surface. What kind of guilt? I am not sure. I could be completely wrong. But that's just the message I received. Especially all the not wanting to talk about it and going so far away from you ",
            "12 years. She said no.\n\nWhere else is this going?",
            "It honestly sounds like she is hiding something major from OP. It could be a illness, infidelity or something else serious, but this is the reaction of someone with major guilt.",
            "To reiterate what others are saying: You may have your school, jobs, house, and money ducks in a row, **but marrying someone with whom you can't have a timely, rational conversation about conflict is going to cause you both grief over the long haul.**\n\nIt'd be one thing if she'd explained, \"Wow, I'm shocked! After 12 years, I wasn't prepared for this. I'd like a day to myself to think things over\" or even \"I'd like to visit my family for a weekend to think about what this means to me, but I want to reassure you that I still love you, and that I'll be back.\"\n\nHowever, it's quite another thing for her to refuse to talk about the proposal minutes, hours, and days after the fact, vanish for two weeks (even her friends and job are concerned), and give no reassurances of love or commitment.\n\nMany folks here have gone out of their way to be empathetic, and have done a terrific job making hypotheses both plausible and less so to explain OP's girlfriend's behavior, but at this point I'm inclined to be less generous. **OP: Would you do something like this to your gf? Leave her hanging for two weeks? If not, why is it okay that she gets to do it to you?** \n\nThe fact that it's about marriage is irrelevant. Shutting OP out for so long shows a serious lack of maturity and empathy, and warrants some serious chats, or perhaps a few visits to a relationship counselor for more effective communication tools. I don't think it's a necessarily a deal breaker, but unless OP wants to wait a few weeks every time they have a tiff, they need to learn some better techniques for conflict-resolution. \n\nOff the bat, I can recommend the books *Nonviolent Communication,* *ACT With Love,* and *Hold Me Tight.* These have been great read-together material for my husband and I. For what it's worth, we had quite a few big fights when we got engaged, but worked hard in counseling and on our own, and do much better now. It's possible! But I think the time for waiting has ended. Call your lady. Tell her that you want to be with her, and that means you need to talk about where you're going. Tell her that if she cares at all for you, she'll be willing to explain herself now, at least partially, after so much time.",
            "I don't know why I had to read so far down to see someone suggesting he goes to her at her parents. OP has OVER A DECADE with this woman. He is entitled to be able to show up in person, even unannounced. This isn't a 2 year friends with benefits scenario where he can get the info he needs via text/phone/continued non contact.  \n  \nOP whether you're leaning towards fighting to get her back or breaking it off you owe yourself, your girlfriend, and the years you spent with each other the grand gesture of flying out there and seeing her in person to sort this out. ",
            "I'm disapointed there hasn't been an update, I'll just assume this was all made up",
            "I think the \"no\" was almost a reflex response that caught her off guard and she was shocked by it, to the point where she's questioning herself on what she wants for her future. ",
            "I had a friend who waited 8 years for her man to propose. He kept putting it off because \"they weren't ready yet\", he had a plan, certain things had to be in place first. She really had no choice but to agree and and play along. But over time she grew tired of waiting and became bitter and resentful. When he finally proposed she said \"no\". He had waited too long. She had given up, broke her heart waiting, and healed it accepting it wasn't likely to happen. When he finally decided things were \"just right\" to get married, she didn't want to hear it. It was really sad. They broke up.\n",
            "An update would be fantastic, please",
            "How come it took you so long to pop the question?",
            "Oh man that sounds like a beautiful proposal and that you love and cherish her, what a shock! \n\nShe really owes you an explanation, good for you for respecting her when she said no but she really has lost time and owes you an explanation and a good one.  I hope you are able to get one on why she declined and didn't want to talk then basically ran away. \n\nYou mention she went to her parents' - are they both her bio parents? Could she have fears that marriage = divorce, and that just staying where you guys are will avoid that? \n\nGood luck dude. My heart goes out to you, and I hope you can update (hopefully a happy one!) soon. ",
            "Maybe she wanted friends and family around. Or if you asked her parents for her hand in marriage? ",
            "I am really sorry this happened to you.  I think this might work out for the best, but I think your relationship is over.  It doesn't sound like your communication as a couple is that great.  You do this grand romantic thing after 12 years, and she goes silent and vanishes for two plus weeks.  She seems to have some issues, and she never mentioned any of them over all these years.  You don't treat people you love like that.",
            "I don't think needing some time to think about marriage is THAT weird. Definitely uncomfortable and awkward, but I mean... I spent a week deciding between two job offers. I get wanting a week to decide about spending your life with someone till the day you die. \n\nNow, her communication is worrisome. I think it's very unfair to refuse to explain yourself. Asking someone to marry you is really putting yourself out there, even if you feel they will say yes, it's a very, very vulnerable thing to ask. So to just refuse to explain, that seems like a bad sign. To just disappear and jet across the country.. it's definitely not good. In life, you two will deal with hard shit. Parents dying, tough decisions about kids, financial setbacks, getting old, health problems. And you can't do that with someone who has this \"turtle\" or flight response - you gotta be able to sit down and talk about it. \n\nWe don't know any better than you. But what I would say is that either way, your life isn't over. The 12 years aren't wasted if she doesn't want to marry you. Whatever you find out, you know that you want marriage and if she doesn't, then you're not compatible. And that's OK. While it would have been nice to know this 6 years ago, you can't go back. You can only go forward. ",
            "I'm sorry this is happening to you. To be honest, it sounds to me like you did everything right. Whatever is going on, how can you be expected to know if she does not communicate. Can you try and reach her or her family by phone? If even her workplace is becoming concerned, it's not an unreasonable thing to try. You deserve answers.",
            "Take a week off, book a hotel. Go see what's up. It's time.",
            "Okay you gave her time to think - it is now time to contact her and let her know you deserve and expect an explanation of why this is happening.",
            "Sounds like one of the following:\n\n1. You are comfortable and familiar but she doesn't really love you\n2. She cheated on you but rationalized it with \"well we aren't married so it isn't a big deal\"\n3. She has some major thing that she is hiding from you and rationalizing it with the \"it doesn't matter we aren't married\"\n\nIMO you should set a deadline to discuss it. \n\"Hey GF, I know there is a lot going on in your head but we have been dating for 12 years, we have discussed this, and this shouldn't come as a shock or be a hard decision. I am hurt and confused at the short answer with no explanation. There needs to be a discussion about the \"no\" and it needs to happen by _____. I need to be able to make a decision as to my/our future and if we want the same things.\"",
            "Sounds like at some point, her feelings changed. Is it possible she might be seeing someone else?\n\nAt any rate, none of it matters - you proposed and she declined without any reason or explanation given. There's really no coming back from this. It's over. \n\nSorry to be so blunt. You'll find someone way better than this heartless, cruel witch. You deserved much better after 12 years. ",
            "I don't know if you're still reading replies, but I'll put my two cents in. I think she has been hiding something from you for a while that she thinks would likely end your relationship if you found out. Your proposal made her realize that she can't get away with it any longer, because she can't see herself marrying you without confessing that secret. My #1 guess is infidelity, either ongoing or in the past that she didn't confess. After that I would guess health, or something work related. \n\nMaybe I'm wrong and it's something more minor. It's important to note that she's probably still under a lot of stress, considering some of the things you mentioned - new homeowner, new car lease to pay off, new job that she finally got after years and years of school - all of that adds up. Some more minor transgression, combined with the proposal and all of that stress could definitely trigger some sort of fight or flight response. The time she is taking is trying to figure out a way to tell you something, and how to respond when she does.\n\nYou might want to prepare yourself for a bombshell being dropped when you finally get to talk to her. Good luck man.",
            "Man I really hope I'm wrong, but there was another poster that tried to propose to his 8+ year girlfriend while on vacation and she said no because she had been having an affair with her coworker and felt guilty over it.",
            "Maybe she has been contemplating a breakup for a while. It's also possible she is seeing someone else. ",
            "12 years together and she doesn't have the guts to tell you what's going on?  That alone would be a deal breaker, no matter what the reason is.  I'm sorry to say, but I'd start lining up my exit plan if I were you.  ",
            "Sending you a \"Hug\".  \n\nThis is tough, but 12 years dating is a Veeery looong time.  By chance did you take those classes together or separately?  \nShe may have met someone.\n\nSending you another \"Hug\"",
            "OK, so to me it sounds like she finally gets to chill out and hang out and be normal again after a lot of stress and hassle. She just wants to be with you! And spend time. You are both pretty settled already.\n\nWhen I read your post, I got a great sense of franticness then a huge sense of relief when you were both able to relax.\n\nThen you (totally lovingly and best-interested-ly) pop the big question. She says no. I'm sorry, dude. But maybe she just wanted to have a relax and breather for a little while?\n\nI can totally see why you thought this was the best time. I really do. I feel for you 100% and am sad she didn't say yes, this would have been a good time now all the stress is gone. But can you also see why she didn't want to instantly take on more stress immediately after the previous stress had just finished? Wedding planning and, fuck, even committing to.marriage are big life changes for anyone and if I'd come out of a long period of high-octane-stress I'd probably instinctively say 'lemme think' rather than take on a other 12-24 months of stress and planning.\n\nI wouldn't jump to the worst conclusions. She probably needs some time to unwind and debrief (like imagine someone springing the prospect of a 2 week eurotrip on you after a long day at work? You'd probably say, hey let me sit down and sort my head out first! But you know it's a great idea... Just... Let me take my shoes off and have a cuppa)",
            "Did you propose with a ring? Down on one knee? I'm wondering if she had very specific ideas of how she wanted you to propose. Had you ever discussed that? Even if that's the case, this is a massive overreaction. Perhaps you could have brought up marriage more recently, but you did discuss it in the past and I understand why you felt the conditions were met. At this point all you can do is hang on, keep going and wait until she is willing to talk.",
            "Short of her trying to save you from her extreme medical condition, its over (even then). She's running away from having to tell you why.",
            "To me it sounds like she was happy with every part of your relationship (BTW, in your state you may already have a common law marriage), but the reality of marriage and where her life was at was too much.\n\nIf she continues to cry herself to sleep and won't  talk to you at all, and you can't get an answer from anyone else in her life... well, you know what to do.",
            "How well do you know her family?  Is it out of character for her to go visit them out of the blue?  Could be fertility issues has she discussed children?  If she can't she may be afraid of your reaction.  Another reason could be related to her parent's marriage.  Either way try to get her to see a counselor and open up.  \n\n\nDo not give up on her!! Wishing you the best of luck!",
            "As of right now, it's all speculations from the community whether it's cheating, tragedy occurred, or something happened to her health. The best way right now is to continue to try to talk to her and let her open up for you. Don't force it out, but keep trying to support her and keep telling her that you'll be there for her and listen to her. \n\nI wish you best of luck and hope nothing serious is happening. ",
            "She is confused, just read her actions. A straight up No, followed by an impromptu trip home with extended time off work.   \nI'm only guessing but she made a mistake in the relationship and you proposing made her face that mistake head on. She is now confronted with an immediate decision that she had to make and she felt too guilty and confused to say \"yes\"\nThis is just me guessing based on her actions. I'm not saying she cheated on you physically but she very well have become emotionally attached to someone recently at work who is putting the full court press on her and it's made her question everything. I'm probably wrong but that's my theory. \nOnly other theory I have is she has a terminally ill close family member and she's torn about going home and helping taking care of them with the family, indefinitely. In which case this proposal could not have come at a worse time. Something doesn't add up with her sudden drastic change. I pray you get answers soon, you deserve that much. \nHoping for the best. ~Rich",
            "My guess is that she doesn't yet want to enter the phase of life what  marriage entails to her. Maybe she still has dreams to chase and experiences to be sought before formally settling.",
            "I'm going to say be hopeful and keep trying to communicate. The thing about proposals is the guy has loads of time to think about it and prepare (from the planning to the ring to the actual question) and women feel pressured to answer right away. You have weeks/months/years of prepping yourself and she was probably not sure until you just dropped it on her. She needs time to think, time to process, and time to come to a decision even if it's not one you agree with.",
            "She may be frightened that getting married is \"the end\" - you've been together since she was 21 and she may think she didn't have enough fun on her own, didn't experiment with guys enough etc. And even with a what sounds like a perfect relationship with you, she may feel conflicted because of what getting married would mean (i.e. she will never have these things). But clearly dropping a perfect relationship for these silly reasons is not an easy and reasonable decision to make. I don't think she's cruel and whatnot, I think the reason why she cannot talk to you is that she doesn't know what to say. You may have met too young. ",
            "It seems like though you've been together a long time and share activities, I wonder whether your at all emotionally in tune. I think it's odd that after she didn't want to talk about it, you didn't try to press her for some answers. We're you scared of what she might say? Is it possible that she is depressed and has been going through the motions without actually being emotionally invested in the relationship. I think she needs to come clean with you but perhaps you need to be more demanding. Tell her she has to talk to you - not about why she doesn't want to get married, per se, but what is actually going on with her. \n\nIt's all very perplexing - I hope you do an update because I'm just really curious.",
            "Go see her and talk to her. You two need to talk. There are a thousand possible reasons we can come up with, but only she can tell you what it actually is. So take a week off, and go see her.",
            "Maybe you asking her made her realize I want something more and now she's looking for it??? That my friend is a qualifying life change event!!!! She just got hit with that I'm getting old and do I wanna settle... The real question is do you let her come back when she realizes that you were the dope she needs????",
            "first off - who fucking cares \"why you waited 12 years to propose\". If you two have been happy for that long, a long-form contract with the state sure as shit isnt going to improve it in some magical way.\n\nMy next point is about marriage itself. You can have a perfectly happy healthy relationship for the rest of your life without it. So she doesnt want to marry you? Consider that a blessing. \n\nHowever there is a fundamental rejection happening with her declination. Rejection sucks, but the more you internalize, stew and brood over it the further you will likely push your lass away from you.\n\nSo assume that she's out of your life picture going forward, what do you want to do about your life? Focus on that for a while.",
            "Holy shit that is weird. Honestly you might just have to wait till she gets back and is ready to talk. I cannot even begin to guess what happened, this is odd.\n\nGood luck man maybe she just had some weird moment of panic for who knows why.",
            "It sounds like there is something big that you don't know and there's no way we can know what it is.  You're going to have to wait until she spills the beans.  She will eventually explain herself I'm sure and then you two will have to discuss the future of the relationship.  But right now there is something she needs to tell you and she hasn't been able to figure out the words yet.  The only thing you can do is wait and keep asking her.",
            "From her response either she was cheating or planning on breaking up.  Honestly I'd guess the former as the reaction screams guilt and shame.",
            "The truth is you can speculate all you want, but you don't know. You've reached ultimatum time, where you demand an explanation of what's going on. You've given her some space, but now she needs to respect that you've been in emotional turmoil for something like three weeks now, and at this point she needs to either ovary up and break up, or else tell you what's wrong.",
            "It sounds like she just ran away from her life. My wild speculation is that she has some secret she is afraid for you to know but feels like she can't marry you without your knowing this secret. ",
            "It is possible that she didn't know she didn't want to marry you and proposing to her made her realize that she needs to shit or get off the pot.\n\nThe thing is though, you have been together 12 years and she needs to be a bit more open to at least give you a sense of a timeframe she needs to think and have space and she needs to give you an assurance that there isn't something completely wrong. The thing is, it isn't fair to you how she left because she is essentially allowing you to go over every possibility in your head possibly jumping to the worst or wrong conclusions. It isn't fair to you to leave you hanging. While she might not be ready to tell you everything (as she might still be processing feelings) she does owe you a \"hey so this happened more suddenly than I was prepared for and I am going to take 2 weeks to visit family and process this, if I need more time, I will let you know\".",
            "The thing I have the biggest issue with is that she's left you hanging for at least 2 weeks now with absolutely no explanation as to what's going on.  That isn't right in the least.  You've been together 12 years now and have lived together for 9.  I'm willing to bet you've had all sorts of uncomfortable conversations during that time.\n\nShe's off trying to \"figure stuff out\" and you are just left with your life on hold until she decides to finally share whatever it is she's thinking.  Whatever she's thinking she needs to share that information with you so that you can also attempt to prepare yourself for whatever may be coming when she finally gets her shit sorted out.  It would be absolutely horrible for her to make you wait 3 or 4 weeks for her to finally let you know what's going on only to blindside you with her saying she can't be in the relationship any more so lets figure out how to separate ourselves now.\n\nEverybody here seems to agree you need to find out what is going on from her but i don't see anyone else mentioning how screwed up it is that she's just leaving you hanging this entire time.  Even if she does come back and say she wants to get married or at least just stay together is this what you're going to have to deal with every time she doesn't know what she wants to do?",
            "Your girlfriend finishes med school and gets a job. I'd imagine this job is very demanding. Is it possible that she hasn't had time to acclimate to this newly stable environment? She might have the idea that getting married = having kids. Would this mean destroying everything she's worked for in her years of preparation for medical work? It's very possible that she's been so focused on achieving these goals that she's lost purpose in them. Med school is overwhelming. While it's easy to feel hurt by this, she'll need you to be understanding. \n\nShe said no to getting married. This is the result of something deeper which should be the heart and focus of the discussion. She might even feel guilt about how she handled it. If you try talking to her about how she's feeling in general you'll probably expose the root of this issue.",
            "Time to get on a plane and talk to her face to face. Only way this gets resolved.",
            "Call her parents. It's worrying that she would not only be ghosting you, but also her friends. Perhaps she had a mental breakdown and now needs psychiatric care. It's looking out for her best interest to communicate your concerns with her family in case she hurts herself. At this point, I'd be very shocked if she just has cold feet. Something weird is going on here. \n\nOn second thought, it couldn't be that she's already married, could it? Maybe she was previously in a relationship and left him as suddenly as she left you and doesn't want you to find out? I know it sounds like a Lifetime movie, but that would explain why she keeps backing out of marriage.",
            "It's really unfair that she isn't communicating. We don't have the answers- she does, and should just be honest and say what she means. ",
            "I'm really sorry you are in this situation OP, and I hope you have some friends you can lean on instead of just trying to handle it yourself.\n\nIt really sounds like maybe in the heat of the moment, things crystallized for her that she hadn't previously considered about your relationship.\n\nAt this point I would say you have given her enough time and consideration to figure things out, and you need to start looking out for *your* best interests. Sadly, your interests may no longer converge.\n\nTalk to a lawyer about how best to untangle your financials (you said that you bought a house together AND have a lease, so it sounds a bit complex), as well as how to start seperating your money out from any joint accounts.\n\nOnce you have figured out how you can proceed...call her and insist on having a conversation.\n\nAt this point I don't know if you still want to be with her, but figure out where you stand with each other.\n\nAgain, sorry you are going through this difficult situation, and I hope the road somewhere ahead leads to something brighter.\n",
            "Maybe she never really considered the weight/gravity of the commitment that marriage is? You say she's always said 'wait until we're settled, wait until we're settled', etc. Maybe she was happier with the idea of marriage being some future, distant thing, and now she's realised that you've been together for 12 years and she's 33 and you want to get married and she's just scared. \n\nI'm sorry this is happening to you, I can't imagine how worried and hurt you must be feeling. ",
            "See, this is exactly why I don't think surprise proposals are a good idea. I can understand why you decided to. You had been led to believe for YEARS that marriage was on the table and that your partner was on board. I'm so sorry you're going through this.\n\nAt this point in your relationship you're already functioning as a married couple. Making it legal wouldn't actually alter your life together that drastically. Assuming this is the case, logic dictates that she hasn't been completely honest with you about how she's been feeling about marriage. \n\nAfter 12 years, she should be able to talk to you about these things -- not run away across country, cut contact with her partner as well as best friend, and ditch work. It I were in this situation, I would be mentally preparing for a worst-case scenario.",
            "Is she traditional? Did you ask her father first? Maybe she had a different picture of what the proposal would be like...?",
            "I just flat out think she doesn't want to get married. She probably never wanted to. Probably doesn't want everything that goes along with it too, like having kids. It's very easy to avoid conversations like this in LTRs, especially if you get along. It's assumed you want the same things, until, of course, they hit the wall.",
            "This all sounds pretty awful.  I didn't see you mention it in your post but did you offer her a ring?  Maybe she is disappointed about that or she had different thoughts about how a proposal from you would be. It may not be something \"petty\" like that but if it is, she might be too embarrassed to admit it.  Good luck OP. ",
            "Did you have a ring?  Could she be upset that you didn't give her one? ",
            "I would think you would be offered some explanation given all that time together if asked.  I guess the question is what does no to marriage mean in her view. Not a good sign she left work and is NC with her friends. I would wait for a short time say 1 or 2 weeks then decide.",
            "first of all, OP i'm so sorry this happened. you weren't expecting that as a response and now you're worried and confused. my personal guess is that either she changed her mind about marriage or she never wanted to get married to begin with. which either is fine, honestly, but if either of those are the case then that's something she should have communicated to you. some people expect marriage, change their mind about it, or couldn't care less about it. someone else said that she grew complacent with how things were and the marriage bit may have been a weird wake up call to her.",
            "When was the last time you two had a serious discussion about marriage? Not joking about it, like you mention in your post, but seriously sitting down and affirmatively saying \"this is what I want?\"",
            "Do you have a gut feeling about what it could be? I just got engaged myself (33F) and there are a lot of reasons she could be feeling like that. Not all hope is lost, she just needs to breathe a little. Try not to get too hooked into reading negative comments. Sounds like you guys have a great relationship, she'll reach out soon I'm sure. ",
            "I wonder if she had a big, romantic, non-outdoorsy (not that that's a bad idea) proposal. Like, fancy ass 4 star Michelin restaurant and a capella band singing to you guys... ",
            "I don't understand this situation either, but I just wanted to say that I'm so sorry you are in this situation, and I hope it works itself out and gets resolved, like she thinks she has some kind of crazy disease that turns out to be nothing. I'd be really curious to see an update when you do find out. ",
            "Some people spend their entire lives convincing themselves to want this particular safe respectable pattern of life, and then when faced with it becoming a reality, they find that they never succeeded. Career as Doctor, house, marriage, kids; it is nice and formulaic and what everyone expected of her and you. It's ok to dream of those things. But it could be what she was expected to dream about wasn't what she actually wanted and now that she's settled she hates the idea of being settled forever. ",
            "Do you have any other milestones in the relationship after getting married? \n\nSometimes the excitement of the next milestone is better than actually getting it and she may be worried that there will be no more milestones. \n\nIt is best to discuss this with her. She should speak to you - its not fair to torture you like this. ",
            "I think there has been a good cooling down period and it reasonable for you to demand an explanation at this point. \n\nAt these crossroads either you will get engaged, you will decide neither of you wants the official marriage and stay the same, or break up because she got cold feet/wants something else. ",
            "She's not telling you something. My guess would be some kind of medical issue that affects fertility like asherman syndrome. Ever notice irregularities with her menstrual cycle? That could be a clue. Usually women  at 33 jump at a chance to settle, I wonder what is blocking that.religious or differences? Health concerns?",
            "Ohhh, I have no idea what's up and you guys figure everything out! All the best to you.",
            "Maybe she's afraid of the commitment of actually being married. I mean you guys have been together since she was 21 she probably missed out on a lot of the experiences single women have in order to really find themselves at that time. It's possible that she said she wanted to wait until you guys were stable to put it off and she may have thought you guys would never get to that point. \n\nI think she may have gone home so she could analyze the relationship and think. She probably got scared when you popped the question hence her practically ghosting you. Now she may be unsure if she actually wants to be in the relationship or not. Give her the time she needs to think and be alone but don't wait forever.",
            "So sorry for you guys. Please let us know how it works out. Good luck ",
            "God, this is a horrible situation to be in. I'm so sorry, OP. I can't even imagine how you must feel. *hugs*\n\n\nI don't have much advice, but I think the longer this limbo continues, the more painful for you and the higher the risk that she will lose her job. I'd call her parents and talk to them about it. Specifically mention that she is supposed to be back at work. Also talk to her best friends. By now they will all know that something is wrong. They will either be able to add some clarity or if they also don't know what is happening, they can talk to her and advocate for you. Go through the possibilities listed here with them. Tell them you don't need to get married if she doesn't want to, you'd adopt kids if she is infertile, etc. Your call will hopefully urge them to approach her. She can't just stay away from work and from you like that forever. After they have talked I'd give her a week max before I would ask her to come home and talk about this.",
            "Maybe all of her friends told her you'd propose right after she became a doctor?  And she always told them they were wrong.  And then you did exactly that?",
            "Might just be a fear of the actual commitment.  There just needs to be a conversation about what's going on. It seems like you guys were content with whatever you had. Everyone doesn't want the marriage and the hoopla associated with it and that's ok. There's too much awkwardness in her reactions for anyone to give you anything of value. \n\nYour situation is just abnormal, so it's hard to pinpoint what's going on. It doesn't sound like she's doing anything untrustworthy though so just open up. ",
            "I don't think she loves you. It sounds like she's happy with you and you both get along well in all, but now it's time for true commitment she has realised she doesn't feel the same about you as you do for her. She may say it, but I doubt she means it. If you really want to find out the truth, I'd tell her that she now has to stay at  her parents while YOU think think things over. Tell her how she's made you feel and that you're not about to waste time if she isn't about to open up to you. ",
            "I think you've got to talk to the family and see what they will share. I wouldn't be overly pushy, just mention her work expecting her, friends worried, you in the dark, and see what they say. Even if they're unwilling to disclose the reason, the way they treat you in that convo will tell you a lot. Are they sympathetic? Do they seem frustrated with her behavior? After 12 years I'd hope they consider you as an important part of their daughter's life and will care about how you're being affected in all this as well (whatever the reason).",
            "From anecdotal experience, the reading of texts without response and her being seemingly happy while with her family suggests she may be trying to break it off with you, without her having to actually do anything. She may be waiting/hoping for you to react in a certain way which gives her some sort of excuse to break up. This could be due to any number of things from an affair to depression.\n\nLike I said this is just anecdotal and I could be completely wrong.",
            "Dude, something major is up. I'm hoping it's as other people guessed and an abortion she's struggling over, or an inability to have kids, rather than something like a terminal illness.\n\nSend her a message, tell her how much you love her and how worried you are about her, remind her she can talk to you about anything that's going on, that she's the most important person in the world to you and you can get through anything with her, but her silence is hurting you. Tell her you want to help her through whatever might be wrong, and you're going crazy with worry over what that might be. If she's \"the one,\" for you, and it sounds like she is, then you need to decide whether to follow her and tell her this in person.\n\nGood luck OP. I'm pulling for you.",
            "What should you do? You should get on a plane to the other side of the country. Something's seriously wrong - and there are two things that should be attended to. The first is her well-being - she may be having a crisis of some kind; we don't know her and can't diagnose her. The second is that you deserve some kind of answers - this is a relationship that's already lasted longer than a lot of marriages, and if you two can't talk through it, you need to weigh all your options. You deserve better than this, but if she is in crisis, you need to go to her.\n\nGo to her. Figure it out in person.",
            "That this is her reaction to a crisis is pretty telling to me. I'm no expert in marriage as I've only been married for 2 years but in that span of time we've had to deal with a fair share of bad situations. Abandoning your partner during moments of tension and neglecting all of your life responsibilities as a result is no way to function in a relationship. My first reaction when anything bad happens is to immediately go to my husband to talk about it, and I wouldn't want to be in a marriage where it's any other way. Obviously, you have to weigh out what matters most to you and then decide if continuing this relationship is worth risking her doing this to you during future crises.",
            "She doesn't want to commit to marriage right now, and needs time alone to think.\n\n>What should i do?\n\nWait.",
            "Talk to her about it. I doubt it's you. She may have discovered something that impedes her from marriage.  ",
            "Remindme! 3 days \"did she figure out what was going on?\"",
            "Maybe she just doesnt want to get married to you and never had the guts to break it off, or was just really comfortable for 12 years but had no intention of marrying you. Now shes asking herself wtf she did for the past 12 years... Why she did this to you.... Etc",
            "Wow this is wild. She owes you an explanation. Two weeks is more than enough time. I'm sorry this happened to you OP. Hope there will be an update!",
            "Is there any chance that she hasn't been faithful and that she is torn between two men right now?  Like, she doesn't know if she should go with the new passion she feels for someone else, or stick with the safe choice that is you\n\nDoes the two of you spend enough time apart for that to even remotely be a possibility?  Or maybe its just an emotional affair.  Has she been secretive with her phone and constantly texting someone?\n\n\n",
            "I can only surmise that she's hiding something from you. When I was reading your post my first instinct was that she didn't want to get married and you'd just ignored her and proposed anyway but I can see you discussed it with her so her reaction is bizarre.\n\n12 years is a long time and what you have obviously shouldn't be thrown away lightly but it sounds very much like she's hiding something from you and maybe has been for a long time.\n\nIt must have occurred to her that one day you'd propose. Whatever it is your proposal has awoken something in her.\n\nI don't really know how I'd react in this situation but I think I'd give her some more time to consider things. If she doesn't come clean after that and open up I'd give her an ultimatum 'come home and talk to me face to face or I won't be here when you get back'.",
            "It's a mystery! But please keep us updated. I feel like I'm invested in this story now. \n\nIt seems like she's expecting you to know, for some reason.",
            "Sorry man, but after 12 years she owes you a detailed explanation why she said no. If she can't do that the. It's time to move on. As sad and as impossible as that may seem. ",
            "Man that sucks, sorry man. Any chance her parents disapprove of you or something? Like is there a cultural divide where they're semi-sort-of-okay with you guys being BF and GF but marriage would be a step too far? Or are you a different race and they're super racist?\n\nI just wouldn't fly out to see my family to \"be alone and think.\" You also said you're not close to her parents at all but apparently they're important enough to her that she runs to them when she's upset? That seems weird to me",
            "My guess is that a part of her screamed \"No!\" in here head when you asked and she is now desperately trying to analyse what is going on there. Sadly it looks like she has gone from \"understandable time needed\" to \"sticking her head in the sand in an environment where no one forces her to face the problem\". She doesn't want to go back, because she doesn't want to face the relationship talks and having to explain herself. She doesn't want to talk to her best friend, because she will ask wtf is going on. She doesn't want to deal with you, because when she does, she will sooner or later have to face you and your questions and your disappointment. It is now going so far that she is missing work, which is very worrying. \n\nI would call her parents and inform them that her work called and that you are very con earned. Then I would give it a few more days to see if anything happens. By the end of the week I would send her a message saying that you are very upset by her handling of the situation and you want to book the two of you some couple's counselling right away to deal with what happened. If she says no/blows you off/ignores you, I would get on with selling the house and send her everything related to be signed for. Even if she does come around, this will be very hard to work through. Is it worth it? \n\nWhat did stick out for me was that you never fought. That is very unusual for a 12 year relationship. She might have things from your dating time that have festered and she has grown bitter about. There might be an awful lot of working back to do. Again, I ask you - is this women who has now ghosted you for almost a month worth that? ",
            "Regardless of the issue is is so disrespectful and hurtful that a woman you have spent 12 years with can't even tell you why she doesn't want to get married. I wonder what your communication has been like all those years because what she has shown you here in terms of communication isn't conducive to a happy marriage.",
            "Did you have a ring? Just asking because I didn't see anything in the post about one. I mean I know it's shallow and all but maybe she's upset about the proposal itself? Location/ring",
            "You need to get it from the horse's mouth.  There's a wide variety of possible explanations for her behavior.  The circumstances are rightly confusing, and r/relationships isn't going to help much to diagnose the root cause.  Reach out to her folks, her friends, etc.  You've been partners for 12 years, so anyone would expect you to be assertive in finding out what the heck is going on.  2 weeks is plenty of time to think.",
            "I'd see about getting out of the relationship\n\n ASAP. You asked her to marry you and she ran away? Also who paid most of the bills while she was going to medical school? Bet you did or helped her a lot, now this? Get out.\n\n\nEdit- this is an interesting thread. I give it a day before it gets locked and/or the original post removed as this seems to happen to any topic on this sub where I'm interested in seeing the fallout.",
            "I think she is upset that the proposal didn't go the way she had imagined it and is taking that out on you.",
            "Okey I might be late, but I just wanted to say that one of my brother's friends was with a girl for five years and they have always had great relationship and so romantic and it was going great until the day the guy proposes to her and she gets scared, tells him no and ask for time to think. He was shocked and tought that she didn't love him anymore. Some time later, she finaly explains her reaction and it turns out that during her childhood she witnessed a lot of divorces and awful marriages starting from her parents to her aunt to her neighbours so she kinda grew scared of marriages and that's why the minute their relationship was going to have the aspect of a marriage she got scared. The guy was patient and understood her reaction and gave her time, he also kept promising her that if they did get married it doesn't mean it'll end just like the other marriages and after a year I think she finaly came around the idea. It's been four years I think, and so far they're doing just great and they have a girl. I don't know if this was talked about since I didn't read all the comments but I just tought bringing this up. I apologize for the spelling mistakes, I usually don't put a lot of efforts to avoid them. ",
            "Is it possible she's already married and had been hiding it all this time? That would explain a lot.",
            "Tbh, she is wasting your time if marriage/kids is a big part of your plan. If she comes back and says she doesn't want to get married but still wants to be together what are you going to do?\n\nIf she comes back and says she wants to get married what are you going to do?\n\nYou guys were practically married already, legally anyway. At that point, it's more of a title.\n\nShe just cut all communication to you after being your partner for 12 years because you asked to marry her. Took a plane to the other side of the country. Maybe she's been looking for a way out recently? \n\nIt sucks op, but it's hard to come back from this, for both of you.\nIf I were you, i'd stop talking to yourself inside your head about this and pick up a hobby or two in the meantime and let things fall as they may. \n\nAll I know is, once her decision is made you'll know. If you don't hear from her, then it's time to take a big gulp and pick up the pieces.",
            "I'm wondering if this has something to do with the way you proposed. She was excited about the trip and gushing about how romantic it was. Maybe that means the actual proposal was not romantic enough for her expectations. This could lead to her wondering if you don't think she's worth a grand proposal, giant ring, etc.  I'm not saying she is shallow by any means but it could be possible that she is just feeling misunderstood. ",
            "People here will encourage you to dump her or pour terrible things into your ears about how she doesn't want you / is cheating / has lupus or something.\n\nI think that the proposal was a giant shock. After 12 years, it's probably something that she thought would never happen. Now all her pent up feelings about it not happening are all pouring out at once.\n\nI think you should just tell her: I love and support you, and I'm not going anywhere. I can see that this is a shock and I know you're not ready to talk about it. Do you want to write me a letter explaining how you feel? Or would you like to go and talk to someone together? \n\nOpen up options besides direct confrontation so you guys can find a way through this. \n\n"
        ]
    },
    {
        "post_id": "6pqopf",
        "author": "BookWoorm",
        "title": "[UPDATE] My [24/f] boyfriend [29/m] of a few months has made inappropriate comments about money and other miscellaneous choices I make. Are these major red flags this early on?",
        "url": "https://www.reddit.com/r/relationships/comments/6pqopf/update_my_24f_boyfriend_29m_of_a_few_months_has/",
        "score": 2195,
        "num_comments": 218,
        "created_utc": 1501099314.0,
        "selftext": "Original Post: https://rr.reddit.com/r/relationships/comments/6p2xtq/my_24f_boyfriend_29m_of_a_few_months_has_made/\n\nThanks to everyone who gave me great advice. I basically ended up breaking things off with him after he, once again, was acting very rude towards me. I briefly let him know it is because I thought he was disrespectful and didn't feel like he even liked me.\n\nHe acknowledged that some of his treatment towards me was \"unfair\" but said he \"wouldn't have spent time with me and talked to me if he didn't actually like me.\" There was also some other BS in there about how he doesn't feel good about it and tried to tell me that it isn't a good place to be in. Nothing he said really made sense, as usual. Lol.\n\nAll in all, I am pretty happy about my decision and although it didn't last too long, I should have called it quits one week in. Lessons learned!\n\n\n**tl;dr:** Broke it off with him after he was rude and he tried to get me to empathize with him. Bye.",
        "permalink": "/r/relationships/comments/6pqopf/update_my_24f_boyfriend_29m_of_a_few_months_has/",
        "comments": [
            "'And nothing of value was lost'",
            "Your ex sounds like he took tips on dating on some PUA forum, lmao. Oh well, good riddance to yesterday's trash. \n",
            ">said he \"wouldn't have spent time with me and talked to me if he didn't actually like me.\"\n\nIf that's the way he treats people he likes, I'd like to see how he is with people he's not so fond of. I love how he tries to get you to feel sorry for him as a last-ditch effort too. What a piece of work. \n\nGreat update! Glad you decided to kick this guy to the curb, you deserve better.",
            "I briefly dated a guy which coincided with buying a new couch. He actually got mad about what I was paying for the couch and said that we shouldn't be together if I had such expensive taste. I would have saved myself future headaches if I listened to him then!  I'm glad you moved on from him! ",
            "Good for you. The constant negging, golddigger accusations, and resentment towards women sound very red pilly. ",
            "Ehh, a few months isn't too much of an investment, and hopefully you got a funny story or two out of it.  Good job on having the backbone to do what is best for yourself.  Keep up the good work.",
            "Ha. A former coworker who just got married said when she met her beau that she was so confused why he was treating her so well. She asked him and he said\"Well I like you. Why wouldn't I treat you well and be nice to you.\" He said it as if it's the most common sense thing ever and yet...It's really not! \n\nHope you stay broken up!! He has issues. ",
            "Word salad. He even admitted to know he treated you unfairly. So he knew what he was doing when he did it, continued to do it, and when consequences hit him, literally spit out any words that he could string together which didnt even make sense. Good riddance to bad rubbish.",
            "Yea!  A friend of mine said to her daughter, \"if you don't like how you're being treated now, you should get out of the relationship. You will never be treated better by a guy than when you are being courted.\"",
            "Oh, I'm glad to see this update! You deserve to be with someone who treats you with respect and kindness, and who actually likes you.",
            "Glad you ended it, kinda sad you didn't throw a drink in his face.\n\nChalk it up as a good story to tell the grandkids.",
            "Good job, it takes courage to get out of toxic situations.",
            "I'm happy to see this update. My first serious relationship was with someone like this and it took such a toll on me. I'm happy you didn't put up with it for two years like I did. \n\nGood on you for standing up for yourself and ending things.",
            "Your ex-boyfriend sounded a lot like my ex. I applaud you for kicking him to the curb so early on, I was with mine for 7 years and let it forever be a grim reminder of just how deep my lack of self-worth was.",
            "I just read your original post. Oh my god, I dated this guy too. Condescending, chauvinist around whom I was always walking on eggshells because any little thing set him off. Acted surprised when I was right about something (on the rare occasion when he could admit I was in fact RIGHT) and would constantly pop-quiz me on many topics. Good for you for dumping this ass. It's no way to live.",
            "Its good to know you broke up with him, he sounded like a huge jerk that didn't respect ya. Too many times ive seen women with dudes that treat them like shit and it baffles me.  ",
            "Don't ever let anyone make you feel like garbage. This individual sounds like he has some personal issues to work out. ",
            "> He acknowledged that some of his treatment towards me was \"unfair\"\n\nHoly fuck he sounds like a dumbass. Good riddance.",
            "Good for you ~ why be with someone that doesn't make you jump for joy ",
            "Congrats for taking action. If a partner deliberately lashes out and criticizes you, major red flag!! That's not a hallmark of a healthy partner or relationship.",
            "You made a wise choice in ending it sooner instead of later with him, as it would have only been downhill from here. Maybe he liked you, maybe he liked the idea of you, or the idea of what a life with you could be like for him, but all that's irrelevant. What matters are his *actions*, and his actions speak volumes about who he really is. If this is how he treats someone he supposedly 'likes', then he's probably even worse to those he doesn't. You can't save him or fix him, and if he started this shit a week into the relationship, then he's honestly beyond help. It sounds like he was trying to get you to stay on and fix him when he said it 'wasn't a good place to be in,' and I'm glad you didn't take the bait. That's manipulation and gaslighting. Besides, no adult should have to be taught how to be a good person, because this is stuff they should have learned in kindergarten. Whatever's going on with him, he sounds toxic af. \n\nHindsight's 20/20, and when you're in a lousy situation, you don't really see it until you've found a way out of it and are on the outside looking in. There are consequences for treating people in abysmal ways the way he treated you, and you leaving him is the feedback he deserves. I know it's easier said than done, but try not to beat yourself up over whatever you overlooked or didn't know to look for in the beginning. You had nothing to compare this to, and you didn't know back then. ",
            "You did it!!! Congrats lady. Maybe he'll grow the fuck up before he tanks more relationships in the future, lol. It's so grade school: \"I'm mean to her because I like her, tee hee.\"\n",
            "I recently dated a guy like this (i feel like i could have written both your op and your update, tbh)\n\ngood for you for not putting up with his bullshit. i don't miss my asshole of an ex and it sounds like you don't either, so good for you. and good for you for recognizing it early on. I didn't and still kinda feel insecure about making decisions because of all the shit he would give me about ALL choices I made... :-/",
            "I read your op. God, my husband does some of the exact things: the shit with money, restaurants, not believing facts. You chose wisely, girl. I wasn't so smart. ",
            "I dated a guy who would say shit like \"I wouldn't have spent so much time with you if I didn't like you\". People who make those kinds of excuses to explain away their shitty behavior, are not people who are worth your time. Good on you for getting away from him.",
            "This reminds me so much of my most recent ex-boyfriend, except he lived at home and was chronically unemployed. From the way he talked about MY money, to never believing me about facts, to being scatterbrained, and to never really listening (he's fallen asleep before multiple times while i was talking to him), he was the same way. However, i ended up keeping the relationship going for almost 4 years. I had definitely seen these behaviours as red flags, but i ignored them because i thought his qualities outweighed his downfalls.\n\nNot to mention his extremely poor social skills and spacial awareness, as well as being extremely caught up in his own self. \n\nI think the money thing is a learned trait of maleness, in which they feel they have to reign in the women in their lives from overspending. All in all its rather tragic that he could never see how pretentious this way of acting was, even though it was never warranted. ",
            "Here's some advice, OP. In your next relationship, pay your own way. If your guy wants to treat you one time, you pay for both the next time. Split bills. \n\nDon't let the guy \"insist\" on paying every time. You clearly have your own money, so pay your own way. Some guys that \"insist\" on paying every time use it as a form of control, to put you in their debt. Then they complain that you're expensive. You can't win. You're a strong, independent woman. So pay your own way. It will help you avoid manipulative jerks like your ex.",
            "Good for you! You will find someone much better :)",
            "it's hard to make a decision. You're a brave girl. Good luck to you!",
            "You go girl he was a real ass. Now find someone who deserves you and treat you how you want to be treated!",
            "Hooray! Congrats on a good choice.",
            "[deleted]",
            "If you're happy, sounds like you made the right choice. Best of luck!",
            "Sounds like your ex has borderline personality disorder. The walking on eggshells part and the randomness to what will please or displease speaks to this. I had to deal with a similar situation. I am glad to hear you got out of that realtively unscathed. ",
            "My guess is that your ex boyfriend was Asian, I see alot of these behaviors on alot of Asian guys, mostly fobs. ",
            "[removed]"
        ]
    },
    {
        "post_id": "3i1530",
        "author": "nurseladyherpaderp",
        "title": "[UPDATE] My husband (33M) refuses to spend time with me (26F) or our son (1 month)",
        "url": "https://www.reddit.com/r/relationships/comments/3i1530/update_my_husband_33m_refuses_to_spend_time_with/",
        "score": 2198,
        "num_comments": 123,
        "created_utc": 1440292204.0,
        "selftext": "Link to original: https://www.reddit.com/r/relationships/comments/3h9gtg/my_husband_33m_refuses_to_spend_time_with_me_26f/\n\nThank you guys so much for your advice! Monday he was off and I had a job interview anyway, so I left my son with him.  He seemed very anxious as I was leaving, but I just told him he would do fine and if something drastic happened to call me. After my interview (which went very well, on a side note ) I called to check on him. He was laughing and telling me about the funny faces our baby was making! I told him since he had it under control I was going to run some errands while I was out. Long story short, I was gone for about 4 hours, and when I came home he was happy and cuddling the baby on the couch. It totally transformed him! He even took the baby with him to run errands on Tuesday by himself and gave me a couple of hours home alone! He is helpful and playful with the baby and it just makes my heart sing! Thank you again for your advice and encouragement!\n\nTL;DR Left the boys home alone. They finally bonded, now I have to pry that baby out of his arms :)",
        "permalink": "/r/relationships/comments/3i1530/update_my_husband_33m_refuses_to_spend_time_with/",
        "comments": [
            "This is really sweet to read. It sounds like your husband was really just afraid when the baby came and everything was suddenly \"real,\" but it seems like he's taken to his role and that's great!",
            "[deleted]",
            "Good! Sometimes it takes a bit for the men to warm up. We have a 4 month old and my SO didn't really start bonding with him until he was 6 weeks old. Little babies need their moms more during those early stages and the men tend to feel useless. Plus, the baby just kinda lays there.\n\nOnce our son started smiling and interacting more my SO was smitten. They're big pals now and play constantly.",
            "Great to here. My son is 11 months old and it took some time for me to bond with him at first. Now we are best friends!",
            "I had the same problem.   \nI swear it is a first time dad thing.  \nMy wife did exactly the same, left me with our daughter and said have fun.  \nI had a blast, I was so stupidly scared of hurting her or her being hurt before that.  \nGlad everything worked out.",
            "How about the sleeping situation? That's wonderful he's more attentive to the baby, but what about you? ",
            "I think one thing more people need to realise is that kids bounce. Literally, if necessary.\n\nIn other words, for all that they're needy little attempted-suicide-machines, babies and toddlers are resilient and tough. Knowing some basic rules like not leaving them unattended on a change table, not leaving them unattended near water, etc, is important. Beyond that... you're pretty OK. Especially if you keep in mind that the kid is trying to communicate with you and help you meet its needs.\n\nI think a lot of people are terrified of breaking the baby somehow, and can't get over that part. I felt a bit like that before I had my son. Now ... yes, I am walking down the street holding him by his ankles while he bounces against my back and giggles, why do you ask?",
            "We did it Reddit!",
            "This makes me really happy to read ",
            "So adorable and perfect. Babies can be intimidating as hell because they are so fragile, I'm so happy you put your husband in a challenging, yet safe (comfort of your home, access to phones for help, etc), zone for him to see that he CAN do it. ",
            "When I was a new father, the hardest thing was to hear the baby crying inconsolably.  Once you make the mental leap that, once you've done all of the basics, feed, change , burp, etc.   sometimes the baby is going to cry, and it's not your fault, and he's not in danger.\n\nA switch flipped in my brain where a crying baby no longer felt like someone blaming me for failing at what I'm supposed to do.\n\nWhen most men are in a situation where they're losing despite their best efforts, a common default reaction is to get angry.  In the context of caring for your baby, that's scary.  If you're someone that has become angry in the past and punched a wall, or something like that, and regretted it after, the idea that it could happen around a baby is paralyzing.  \n\nOf course it won't, but as a new dad you have no idea that it won't.  You don't know what to expect.\n\nIf he gets to that place where a baby's cry causes sympathy for parents and the baby, so many things become easier.  In public you feel like helping young parents.\n\nNow, age three to five... That's where managing anger and having realistic expectations is really hard.",
            "good",
            "All of my buddies that were father's before me (all have girls... Weird) told me they didn't really have any connection or bonding with their first kid until it was 6+ months old. I don't know what's wrong with them. I immediately connected with my daughter. I still cherish every day she wants to lay on the couch and watch Princess movies and she turned 4 yesterday. ",
            "Glad to hear a happy update! Congrats OP!",
            "This update really made me smile. Thanks!",
            "Okay, so this deserves a fist bump, high five, and a chest bump! \n\nI'm actually surprised by the level headed responses in your first post by the commenters, they hit the nail on the head.\n\nI wonder how they knew what the issue was. I know I myself feel a little unwanted during the babies first few months but that's why I corner the tummy time market and make sure no one creeps on my territory.",
            "So glad your boys made some progress! That's great. \n\nMy husband had a little trouble bonding with our son, so I made sure to make one \"baby thing\" his job. My husband was in charge of bathing my son. It gave them some isolated time to be father and son. My son is now 5 and my husband still oversees bath time. Some days my husband will grunt in disapproval (he is tired after working after all), but there are plenty of nights where I hear nothing but laughter coming from the upstairs bathroom. I sit downstairs in the living room, listening and smiling like a fool. \n\nEnjoy your little guy!",
            "It's a scary thing to suddenly be responsible for the safety and well-being of a tiny human. I'm happy that it's worked out well for you guys.",
            "Sounds about right from my experience (father of 3... 2 boys and daughter that's 8 months).  It takes some time for some men to truly get that \"OMG\" feeling like moms have day 1.  Babies are hard.  They need constant attention, holding them, playing with them, feeding them, changing them... It's not easy for someone that is used to being able to walk away and do something else for a bit.  \n\nThat said... something does just click all of a sudden.  The baby smiles, laughs, grabs at a ring or watch, or just generally responds and all of a sudden we get it.  \n\nThe first kid is especially hard.  I was lucky to have a friend explain the situation to me very simply.  \"You will no longer be the most important person in your wife's life.  You will be a very distant number 2.\"  That rang so true from the first moment.  That has re-rung with every additional kid.  If he learns to deal with that for a while things can work out just fine.  The occasional guest room sleep is just part of the game sometimes.  It's very rare for us, but if I'm sick or a kid is sick enough that my wife feels she needs to have them in the bed next to her I go into the other room.  If she's happy to have the kid and I'm happy to get some sleep, it all works out.  \n\nEveryone is different too.  I have friends who's kids slept in their room for 6 months or more.  We decided early on the kids would all have their own place to sleep and we have always done that on the first day they're home.  Just be open with each other and things are far more likely to work out. ",
            "Two things.\n\nFirst, this is just my personal preference as my wife does the same things sometimes and it's kind of hurtful, you said \"so I left my son with him\" it should be our.    But this is not the point of my post.  \n\nMy point is this, I bonded with our son right away but I think your husband will really start to hit it off (even though he kind of has already) once your son starts to become more active.   Trust me it's more than enough fun when they start to giggle and laugh at the things you do, walk to you and all that.   I pretty much don't like to give my son up (15 months) when I'm with my wife.  I hold him and do most of the stuff for him.  He's just so entertaining to be around.\n\nSo your husband will probably become more and more close to your son as he grows older. ",
            "This is nice.",
            "This is the most positive ending I have ever read in this sub :)",
            "This made me giddy with happiness for you guys! :D",
            "This is awesome to read, now your son has two wonderful loving parents. And hope you get the job, glad the interview went well atleast... hope its a good sign.",
            "I'm SOOOOO happy to read this. Good on you ! And good on your husband !!",
            "What a wonderful update! I'm so glad things turned out well for your family. Sounds like it was a case of new dad worries (at ineptitude, financial shortcomings, change in lifestyle, etc). Best wishes for your family.",
            "This is the kind of follow up post that really makes me happy with humanity :)",
            "Awesome news.",
            "Put this on /aww. What a great update thanks so much for sharing",
            "I think it's very normal. A lot of people just have anxiety at first.",
            "Absolutely beautiful! ",
            "That's awesome! Maybe update us again in 18 years?",
            "So basically every \"first time parents\" ever.",
            "Father proofing a house goes a long way.",
            "So happy for you that everything worked out! Good luck with parenting! :)",
            "That is so sweet I think I just got diabetes :)",
            "Right on!\n\nGood luck with your growing boys :)",
            "Its good that he bonded and clicked.  I had a lot of problems last year when my daughter was born.  My wife would get pretty pissed at me and would always question if I really wanted to be a father.\n\nBasically she would be willing to sit on the floor, watch Barney and full on play with her.  I would only be willing to feed her and change her here and there, during the rest of the time I didn't really care what she was doing.  My wife would get all excited over the first time  she did this, or the first time she did that.  For me, that stuff was always meh.  I don't know, I just didn't see what she was seeing.\n\nOver time I have gotten better, but my wife does occasionally bring it up.  I tend to have her take care of the baby the most as she is a stay at home mother, though as soon as I get home from work the wife throws my daughter at me and she's mine for the remainder of the night.  I know it has been up and down.   I know I told my wife last year that I didn't see the bond she saw as the baby just sat there staring at us.  I don't know, a part of me wishes she was already a few years older rather than 15 months. ",
            "wow, that is so sweet.",
            "This made me happy.",
            "Aw, this made me happy-tears. I'm glad that your son and husband finally bonded!",
            "Best update ever! Yay!",
            "Glad to hear that!  Sometimes people take forever to bond with their children, or don't know how.  Glad things worked out for you and the guys.",
            "Best update :)",
            "Maybe he was scared before, and having that day helped him realize that it's not that scary.  :-)\n\nSo glad to hear this positive update!",
            "Glad to hear everyone has worked out but jeez, what sort of place makes a new mother go back to work after only a month?"
        ]
    },
    {
        "post_id": "11ppj92",
        "author": "None",
        "title": "My (32M) wife (40F)'s daughter suddenly called me \"dad\" and I don't know how to react.",
        "url": "https://www.reddit.com/r/relationships/comments/11ppj92/my_32m_wife_40fs_daughter_suddenly_called_me_dad/",
        "score": 2198,
        "num_comments": 203,
        "created_utc": 1678654419.0,
        "selftext": "I (32M) have been married with Rose (40F) for 4 years and we dated for 2 before that. Rose has a daughter, Lola, she is 9. Her father, John (42M) is quite present in her life and is a good dad ( he lives 2 hours away due to his work but he spend a lot of time with her during the weekends, holidays, they video chat a lot, he comes to all her school plays, sport events etc etc).\n\nWhen I started dating Rose, I didn't know what my relationship with Lola would be. I have had both a step-mother and a step-father so I know these kind of relationships can get bad easily, so I tried to do my best. I played with her, listened to her whenever she wanted to talk, helped if she needed help and I didn't set any rule but made sure she followed Rose's rules. In the past 6 years, we bonded.\n\nSomething happened yesterday: she aced a math test (the only full score in the whole class. Am I allowed to be proud of her? I will be anyway). I wanted to reward her and she wanted an ice cream, so we went to the ice cream shop. When I gave her the ice cream, she said \"thank you, dad\" and rushed back in the car. I was stunned. I didn't know how to react. She never called me dad, she normally call me by my name or nickname. She seemed to not realize she had done it so I acted normally and brought her back home and we celebrated with Rose.\n\nI don't know what I should do if she calls me dad again. I'm happy about it, don't misunderstand me. I love her as if she was my own daughter but she already has a father and they love each other a lot and I think he wouldn't like hearing her call someone else \"dad\". Should I tell her something? What?\n\nTL;DR : my step-daughter suddenly called me dad and I don't know how I should react.",
        "permalink": "/r/relationships/comments/11ppj92/my_32m_wife_40fs_daughter_suddenly_called_me_dad/",
        "comments": [
            "I called both my mom and my step mom \"mom\" and neither of them had an issue with it. I wouldn't even say I was closer to my step mom, I was much closer to my actual mom but I also felt that my step mom gave me enough support in life to call her that too.",
            "Speaking as a guy who became a little girl's \"dad\" when she was 10 or so:\n\n\"Dad\" is a title (like \"Sensei\" or \"Elder\") that cannot be taken, it can only be bestowed.  And *when* it is bestowed, it is an indication of high regard.  Take it as such, and accept it as an honor that she thinks of you in that way.  It's not an exclusive title that only one person can hold.\n\nYou may wish to have a conversation with Lola (or *Rose* may wish to have a conversation with her) about how John might feel if he knows, so she can be sensitive to that.",
            "James Fell (author) often talks fondly of both of his dads. His biological dad who was present in his life and his stepdad who was with him more and also helped shape him. It doesn’t have to be an either/or thing. She has bestowed upon you the highest honor, but it just means you are also revered, not that you are replacing anyone.",
            "You sound like a great dad.\n\nMaybe tell your wife what happened, just in case your stepdaughter is having feelings about it. \n\nBut it sounds like you've earned being called dad. Happy for you!",
            "I have two step sons, who were 7 and 9 when I started dating their mother. I tried really hard not to make the mistakes I had seen other step parents make, one of the main ones being insisting that they start calling me \"dad\" - they have a dad, and I wasn't replacing him.\n\nMy biggest regret is that I didn't react much when one called me dad on his own. With my focus on not even being perceived as trying to get them to call me dad, I missed the real honor and affection being shown when one did anyway. \n\nShe may have run away after saying it because she was embarrassed, or because she was scared you wouldn't like it. It would be good to somehow let her know that you did, I think.",
            "I have 2 guys I call dad, my bio dad and my stepdad. They're both dads to me. They're not married to each other. Sometimes you luck out in life and get more than one dad. Lola got lucky.",
            "You seem to be sensitive to everyone's feelings, which is a great start. Talk to your wife and, depending on how close you are to your step-daughter's biological father, you may want to all sit down and have a discussion. It might be important for him to know that you did not encourage it and you are not trying to isolate him or change the dynamics in the relationship. It may have been a one-off. She may repeat it. You are the adults and you need to work out your feelings about it behind the scenes and only bring to her attention what she needs to know, so she won't feel embarrassed or feel the need to hide her feelings.",
            "> Am I allowed to be proud of her?\n\nYes.",
            "Just tell her you love her and take it as what it is.  You and your wife might want to discuss it - but let her know you appreciate her calling you that.",
            "No personal experience with this, so I don’t feel qualified to give you advice, but I will say: sounds like your instincts are bang-on, and that you’re doing an amazing job. I’m sure you’ll take whatever good advice you get and handle this beautifully. Go you, man.",
            "You react with a smile. It doesn't matter what HE thinks. What matters is that your stepdaughter thinks well enough of you and trusts you enough to call you Dad too.",
            "At 9 she should be making her own choices on what she calls you. Let her.",
            "I grew up w two dads! My bio father and mother were never together.. my mom and my (step) dad started dating while I was 1. It was confusing for others when I said “dad” bc they didn’t always know which one, but that was there problem🤷🏼‍♀️ I remember once when I was like 6/7 I was playing up on Something high and called “dad” to help me get down.. Wellp both of them came from different directions ( at a function where they both were, parents all part of similar social circle) and even at a young age I felt the awkwardness In the air. It got better with time, but it was never a big deal to my bio dad… I think he realized my (step ) dad was a big part of my life as well. As an adult I keep their contacts separated / address them to others as “father” and “dad” simply so that they don’t get mixed up. If this girl sees you as a father figure be great full you’re making an impact, and don’t discourage her from it to spare his feelings. Having  another positive adult role model/ relationship as a kid is always a positive thing. \n\nAs an adult now in a serious relationship, I often think when it comes down to walk down the isle it will either be both of them taking me or neither! I couldn’t imagine leaving one or the other out.",
            "It's not surprising considering from what little you described you sound like a good caretaker. Even though she already has a bio dad, she probably sees you more than him, and you have been in her life for about as long as she can remember. I would talk to her mother, and have her mother talk to the bio dad about it. I don't think there's anything wrong with her calling you dad, but the bio dad could suddenly become (understandably but irrationally) insecure and make life difficult.",
            "That is really nice - embrace your new family! Her allowing you that title is a show of respect. Don't ever break that trust.\n\nThere was a subreddit  relationship post awhile ago from a married woman with a 16 year old who asked the woman's husband if she could call him Dad. He said no and it destroyed the family - it sounded really awful and, I believe, like he regretted it. Be mindful of how you proceed when talking about such emotional things that words and meanings are not misconstrued.",
            "As a step parent to my eldest (now 6 and I've been around since they were 1) my wife and my position was always that this sort of thing is the child's choice\n\nMy son, and he is my son despite what bio dad might say, starting calling me dad after about a year, my wife and I didn't correct him but for a period continued referring to me by name until he started correcting that at which point we embraced it. It took some getting used to but I couldn't imagine how much damage it may have done to have rejected him especially now we have more children that are mine biologically as well\n\nI think your child might be old enough that your wife should maybe have a talk with her and ask her what she wants. Maybe it was a slip of the tongue and she's actually more comfortable calling you by name. Or maybe she was testing the waters and letting her know it's ok if this is her choice will help her feel more comfortable about it\n\nBut either way like I said I think the child should get the choice",
            "Firstly congrats on having the title of dad bestowed upon you as it means this little girl really loves and looks up to you. In regards to how her dad will feel about it, that’s a conversation that all of you can have together, it’s not odd for a kid to call their bonus parent mom or dad or even come up with a separate name like pops or honestly whatever suits you guys as a family, at the end of the day what’s most important is what’s comfortable and makes your guys daughter happy. Good luck:)",
            "Congratulations! You earned it!",
            "If it becomes a trend then maybe you have a conversation with your wife about it because you're right you don't want to hurt her biological dad, but it could've just been a glimpse into how much she loves you...basically like a dad. Sounds like you're doing a great job as a stepdad though and damn right you can be proud of her and celebrate her accomplishments. :)",
            "I would just mention it to your wife and see how she wants to handle it, just in case it causes issues with her relationship with the kid's father.",
            "I have two dad's. My stepdad raised me and I visited my biological dad. I call them both dad. Let it be her choice and all the grown ups can love and support her.",
            "She can have 2 dads if she wants. It’s up to her.",
            "Luckily, it isn’t up to her bio dad what she calls you unless you’re forcing her or there’s some sort of parental alienation happening. This is not that so as long as your wife backs you up it’s fine.",
            "I came my step father dad while he was alive and I don't think it made my dad feel like he was any less my dad.  There is room in hearts for so much love. If she's choosing to call you dad,  let her.  Your saying anything negative about it to get or get wife would be painful.  Let get decide the relationship she wants with you.  Be happy about this,  and feel no guilt.  So few step parents are great step parents.  She promoted you on her own,  don't turn it down!",
            "I don’t have step parents, but my sister in law does. She called both her dad and step dad (both very present in her life) “dad”. \n\nI don’t think you should do anything about it. She called you dad because to her, you feel like dad- or a dad to her. You’re filling a role. It doesn’t necessarily mean she loves her bio dad less, if that might be a concern for you.",
            "I have a step dad. My biological father died when I was 14. It took me YEARS to call my step dad, dad. So when I finally called him Dad I meant it. He’s the quiet type so he’s never really reacted outwardly about it but I know he’s thrilled by it. How do I know? He calls me baby girl. Sometimes it’s the little things. And let me tell you, when he called me that I was so happy I cried.",
            "It's ok to have 2 dads. Take it as she appreciates you in her life, and you are a provider. \n\nFor kids, divorced parents don't need to be more than bigger families. The way you talk about bio dad, sounds like there's some respect there. All good, whatever is best for the child.",
            "When I was a kid my stepdad insisted on us calling him Dad and calling our dad by his first name. It was messed up. He was jealous, possessive and territorial and it really hurt my dad. My dad let us down in lots of ways but didn’t deserve that. However, I was not a thoughtful child, apparently, because I used to call out “Dad,” when they were in the same room and see if I could get them both to respond. I only stopped when Mum said I was hurting Dad’s feelings. I’m a stepmum and my stepdaughters have never called me Mum and I don’t mind at all. I know their mum would be hurt if they did, and I know their dad would be hurt if they called their stepdad “dad.” However, I also have bio kids and I’m pretty confident that if they were being mothered by someone else, as long as I was comfortable with the level of parenting i was able to provide, I wouldn’t mind them calling another mother “mum.” I think it’s a very personal, case by case situation and the best thing to do is just share exactly what you have here with your wife and see if she has an opinion on how to proceed. Presumably she’ll know what her ex’s feelings on the matter would be. You’ve made it clear that you’re not trying to step on anyone’s toes or usurp anyone, but trying to respond lovingly to the honour that your stepdaughter has offered you. She deserves to have her feelings validated, too. She didn’t ask for her parents to separate or for a stepdad, so expecting her to follow rules and customs that only respect the feelings of the adults is a bit unreasonable. She needs to feel like she has some certainty in and control over her relationships.",
            "Seems like she sees you in a good enough way to call you that. My son has always called me Da and called his ex-stepfather Dad (until it came out he was cheating on his mother, now he calls him a few other names instead). It never really bothered me.\n\nOn a side note, my son's sister has accidentally called me Dad a few times now. I am neither her father nor her step-father. I adore her and treat her like a daughter, but I'm thinking there's a serious issue there.",
            "I call my bio dad and my step dad “dad”. my father was very much ok with it and they even hung out. Heck still today my biological father comes to my mothers house for holidays and my dads hang out together and bs a lot. They’re good.\n\nMy recommendation is talk to your wife and ask her her feelings on. Then sit down and talk to your step-daughters birth father and make sure he understands that if she decides she wants to call you dad that you’re ok with it but don’t want to offend him or make him feel as if he’s being replaced because that is definitely not the intention, you just want to be a second father figure for her and help in her upbringing.",
            "If you have been in her life since age 3, she probably thinks of you as a parent and not just a sorta kinda parent. Adults often get very caught up in this idea that kids can only have 2 “real” parents and it’s just not true. Adults also get really hung up on who is being called “mom” or “dad. But, you being called “dad” doesn’t make her biological dad any less her dad. He’s still her dad just as much as he was before she called you that. \n\n\nYou have been playing a parent role for her since she was very young, so she thinks of you as a parent and referred to you that way.",
            "I would personally talk to her day and ask if it's ok with him since you know, he is the DAD.",
            "It sounds like you're okay with it. But just want to be respectful of her father. You're not doing anything to disrespect him. She called you dad on her own.\n\n Would you want to hurt her feelings or make her feel uncomfortable about it?\n \n(I have two dads and call them both dad.)\n\n Sure it could make the bio dad feel weird... but it shouldn't be about him. I think that little girls feelings are more important than his. (And he should want her to be happy and be glad that she has good/supportive rolemodels in her life) If she feels like she has two dads, she can love and appreciate them both without it diminishing her feelings for one or the other.",
            "You have been blessed with the DAD title. It is hers to give. DAD is not a scarce title, but it is one that is only bestowed upon the worthy.\n\nFeel warm inside. Bask in the glow. Keep doing what you’re doing. Consider talking to her bio dad about boundaries, etc. But also know that if he’s hurt, those are his emotions to work through: it’s not his daughters job to protect his feelings. It’s the adults’ jobs to love that kid and raise her to be a good adult.",
            "Going through this with my g/f's 7 y/o. It more often than not slips out subconsciously, but we don't make a big stink or anything about it. I love her just as much as my gf, and she loves me just as much as her mom. I love it, and if that's what she wants to call me, and wants that kind of relationship with me, I'm all for it. I plan on marrying my gf, and we plan on having discussions about that kind of stuff in due time.",
            "Since her biological dad is present and doing a good job, out of respect for him, maybe talk to her about having a different name for you. Pappa Steve or whatever works.",
            "It may have been an accident, if it happens again, speak to her or her mom and see what everyone is comfortable with. I wouldn’t be comfortable with my step daughter calling me mom and she only knows me by my name, she’s a lot younger than Lola and we haven’t been in each others lives nearly as long as you have been in hers. So, just let it go. Talk about it if it happens again.",
            "Acknowledge it!!!  She knows what she's doing and it will make her feel good to be appreciated -- *being seen, heard, & acknowledged are the most useful things you can offer children in most any scenario.* \n\nNext time, Pause, look at her & give back & soft & grateful Smile. It will in turn fill her with joy as well.  Maybe even mouth a Thank you or  an I love you if you two say that to each other yet. \n\nCongrats *Dad* .",
            "Don't you dare say a word. Either it was an accident and likely won't happen again or it was intentional and she was petrified of your reaction. \n\n\nYOUR best reaction is none. If her father is smart he will be grateful she has such a great support system and will understand it doesnt lessen her feelings for him. And if he's not that smart, it's not your problem.\n\n\nAnd congratulations on evidently doing this right. We so often hear the horrors of blended families, nice to see one that's flourishing. Bravo.",
            "She has two dads. It’s not that complicated. If she wants to call you dad then let her.",
            "I call both my biological father and my step father dad. You don’t have to tell her anything. \n\nIf you’re ok with it and she wants to then it shouldn’t be a big deal. It’s up to her and you what she calls you and if it’s fine with you and her then bio dad will just have to deal. \n\nIt’s never been an issue for me.",
            "Kids can have more than one dad. It's okay.",
            "Honest r/GuyCry moment for me",
            "9 year old me would have NEVER been allowed to address my parent's friend, boyfriend, girlfriend by first name or nick name.  It's always with an honorific \"uncle\" or \"aunt\" somebody.  Maybe it's time the adults had a conversation about how a 9 year old should address the adult after 6 years into a relationship.",
            "Your post disappoints me.  What do you mean you don't know how to react.",
            "My bf has two step parents since he was a kid and he calls both sets \"parents\", and both mother and stepmother are \"mom\". I think it's awesome she trusts you. Have a chat with your wife but don't make it awkward!!",
            "1) Very sweet, congratulations! 2) Find out what Rose thinks. Her opinion will matter more than any of ours.",
            "No. Ppl can have more than one. Say \"you're welcome\"",
            "Dad is a top tier. Congrats, you made it.",
            "This made me tear up. She obviously adores you. Congratulations OP.",
            "You don’t have to have same-sex parents to have two dads. Nor do such families have one dad who’s more real than the other.\n\nIt doesn’t have to be an exclusive title just because in many families there’s only one dad.\n\nI’d discourage you from assuming that her bio dad would take issue without actually getting his opinion and from talking about it with her without speaking to either of her bio parents first and seeing how they want to handle it.",
            "We have more than one grandparent, usually a few aunts,uncles, cousins, niblings, etc. We don't only call one of them an honorific. So, she have have two dads. Give her a special dad name if that helps you. Ie her bio dad is dad, you are whatever.",
            "It's very normal for a kid to call a man figure who's very close to her a dad. Yes, she can have two dad's in her mind, and that's actually very healthy - shows that she trusts you, and you are doing it right.",
            "Good job. As far as dilemmas go, this is the best one to have.",
            "Honestly I think you should let her take the reigns and figure out the relationship between the two of you.",
            "My boss’ parents divorced when she was younger and both remarried. She always calls her step parents mom and dad even tho she has a good relationship with both of her actual parents. She’s like I’ve known them all since I was a toddler, why wouldn’t I just call them mom and dad? \n\nI say enjoy it and let her call you dad if it feels right to her.  And also, yes you absolutely should feel pride about her successes, you may not have created her biologically, but you’ve helped shape her! Congratulations!",
            "I have a really close relationship with both my father and my stepfather and I call them both dad. I didn’t start calling my stepfather “dad” though until much later, like college aged. My brother also refers to him as dad as well (although this can admittedly be confusing for both of us when we talk about them as our fathers also both have the same first name so it is hard for us to differentiate). I don’t think there is anything wrong with her choosing to call you that, though! Let her call you whatever she feels comfortable with.",
            "My kids go back and forth between calling my partner of 2 years his name and dad and same with his daughter between my name and mom. The dads and mom's are mostly by accident but we don't point it out because it's up to them what they want to call us, respectively.",
            "I met my step dad when I was 7 years old. For a long time I called him Mr. Steve and then as time went on o realized how safe I was with him, how much he loved me and how much I loved him I felt comfortable enough to call him. I don’t ever remember a specific reaction from him when I did but it felt right and I’ve called him that ever since. He’s been way more of a dad to me than my bio father ever has been. You’ve just been given a big honor and you are very special to your step daughter",
            "I don’t really know how to answer your question I just wanna say it sounds like you earned the title and should just allow it as it happens. Maybe in the future if she says it again just be sure to smile so she knows it’s acceptable to you and she has that non voiced permission to continue.",
            "You need to take out her biological dad. He's competition. Take out the competition. \nThen, you'll be her real dad forever \n/s\nTalk to your wife. Don't make any big changes jn how you treat her. If ever the subject of her dither comes up, make sure to identity him as \"your dad\" so you make it clear you're not pushing yourself onto her",
            "I have been in a similar situations and all I can say is, enjoy this. You earned it obviously. Do not expect it. It may disappear. And if it does, appreciate that it happened. I wouldn't draw attention to it, because it will lessen what it means to her. E.g. it will go from being from the gut, to something out of obedience or acceptance. You don't want her saying it 'because she knows how happy it makes you'. You want it from her gut. Relish now, and keep up the good work.",
            "Congrats man, you’re knocking it out of the park. You keep doing exactly what you’re doing and let her call you what she wants to call you. I’m sure you’ve had the talk that you’re not trying to replace her dad, and it sounds like she’s accepted you into that role as well anyway. It’s a good spot to be in, just like others have suggested, make sure the other parents are brought in the loop so there are no unexpected unpleasant reactions in the future.",
            "I wouldn't make a big deal about it, I would just act like it's normal and casually refer to her as your daughter if it comes up naturally in conversations.\n\nI may talk to my wife about it and figure out the best way to proceed with letting her bio father know. Sounds like he's a good guy and this is a very healthy co-parenting situation. I'm sure he will be happy that his wife married a good man who treats his daughter well and feels safe but it might be a shock if it catches him off guard.",
            "As someone who shallot refers to their biological parents by their birth name, I’m crying!!! What a beautiful transition. It’s a really big deal it like don’t make it one and be weird.\nKudos to your blended family.",
            "If you correct her or object in any way you will absolutely humiliate and crush her. \n\nTake it as a compliment.",
            "If her real dad is cool with it then it should be fine.",
            "This is wonderful. Congratulations. I would tell her that you love her and how much hearing her call you \"dad\" meant to you so that she feels comfortable calling you that. She may have been wanting to call you that for a while, but was working up the courage to do so.",
            "Is it awkward because you call your wife \"Mommy\"?",
            "I'm about to marry my Love and he has a 5 year old daughter. We've been together since she was almost 2. The first time she called me mom, I had a similar reaction. My fiancé gave her permission to call me whatever she liked when it became a more regular thing. I've been \"mom\" since  even though we weren't even engaged yet. At first, birth mom was really upset but seems to be putting up less of a fight as time passes. My fiancé told our daughter, whenever she would come to our house, to call me whatever she wanted (my name, nickname, or mom) because it was between her and me so the birth mom had no say. \n\nBe excited! I support the letting it happen when the feeling is there and not forcing it. I would bring it up with Rose and let her know your stance so she can steer your daughter with the guidance that matches your wishes. That way if birth dad has any issues, she can also back up the daughter's wishes.",
            "You help take care of her, you help provide for her, you talk to her when she wants/needs, you feed her, you praise her, you're with her mom. You're checking all the dad boxes, so it's not a stretch for her to say.\n\n\r  \nIt might not even be a big deal, could just be a slip of the tongue, it might not happen again. \r  \nThe only thing I can see being a problem are the bio parents, so talk to them first.\n\n\r  \nIf for some reason they DO have an issue with it, then it's their place to address it. If you say, “I’m not your dad.” Now you could severely break her trust, and as a step parent you don’t want that to happen, especially if you don’t have a problem with it.\n\n\r  \nIf bio's don't have an issue, the best response next time would be something to the effect of, \"You're welcome honey.\" As you internally cheer.",
            "When you are a true father figure you earn the title of “dad”. You sound like a great dad to her. Take the W man! :) \n\nI personally never wanted kids, but we recently inherited one from a crummy family member. \n\nShe Has changed me into a big softy…. It like a whole purpose I never new I needed in my life…\n\nWhat you’ve accomplished here is goalzzz!",
            "I call both my step mom and bio mom, \"mom\". She may have just felt unsure of how you would react to it and rushed to the car. I would just give her some time and see if she continues calling you dad, if you're comfortable with it then just go with it.",
            "I have an adopted mom, a bio mom, and a step mom.  I call them all mom and none seem to be offended about it.  I’m in my 40s though, so very different age brackets are involved.\n\nI’d definitely involve your wife in the conversation.  You’re handling this very respectfully towards all involved and that’ll go a long way, I’m sure.  Some of this is going to depend on your relationship with Lola’s father, too.  I have no idea what you do if he’s completely opposed.  Who wants to be the person telling a nine year old that she’s not allowed to call the step dad that she clearly loves “dad” as well?",
            "That is so sweet!  My stepfathers were AHs and abusers, you obviously enrich her life.  Maybe her bio father can remain dad and you can be Pa, Papa, Da, Papí,  or whatever other father figure name she and you like.  Congratulations, Dad, it's a girl!",
            "Some people have two dads/moms. Most people I've met who got a stepparent at a young age call that parent mom/dad along with their bio mom/dad. You've been in this girl's life since she was 3 and you've been fulfilling the role of a parent in her household for years. \n\nI think it's completely normal that you'd be \"dad\" too after all that. I would talk to her biological father about it though. I wouldn't want him thinking I'm trying to replace him. If he's reasonable, I think he'll understand and even be happy.",
            "As a teacher who has been called “mom” countless times by accident, I would caution you not to get ahead of yourself, and end up with hurt feelings. Wait and see if it sticks before you say anything to Lola. But definitely have a chat with mom to prepare what you want to say.",
            "I'd take your win and not overthink it. She clearly thinks of you as a father-figure. It doesn't mean she's making you and her bio dad compete. But that just like him, you have found a place in her life as an important male figure.",
            "She's lucky to have 2 wonderful dads.",
            "I would talk to your wife. I asked my step dad as a little girl if I could call him dad and he said no. That was one of the worst rejections of my life. I know that he did it because he didn’t want to be between my father and I, I think. But I barely talk to my father now and there were 10+ years where we didn’t talk at all. Haven’t seen him in 26 years. I wish my mom would have been the one handling that situation from the start, because it still hurts. My step dad is still my dad but I call him by his first name, and I will always feel insecure about how he views me",
            "probably nothing, but if it happens again then maybe a chat between you Rose and John altogether so that there isn't any sort of suspicion or jealousy and you're all on the same page on how to approach it.",
            "Could just be a little slip. My stepdaughter calls me mum occasionally, but never intended ;).  \nShe has a mum, it's not me ;)",
            "I have a 9 year old myself.\nHer calling you dad means the two of you occupy the same space in her head, which is not a bad thing, trust me.\nMy 9 year old constantly call me \"mom\" even though, ya know, I'm her father.",
            "I come from the other end of this: My family disputed me having 2 dads, and to this day it is a topic that comes up every now and then I avoid. There shouldn’t be anything wrong with it, but some people are irrationally sensitive. I hope no one makes a fuss over it and she can just be happy she has so many people who love her!",
            "Take it as a complement.  I'm a teacher and students will occasionally call me \"mom\" and then be embarrassed.  I tell them not to worry about it -- just don't call me grandma!  ;- )\n\nI think it's flattering that they equate me with their mother, and if she has a good relationship with her father she just complimented you.  It doesn't mean you replace him; it means she feels safe and comfortable with you.",
            "Well, you are married to her mom, and if you are committed to your daughter, it is fine.  It doesn't have to decrease her relationship with her other dad.",
            "Well did she call you daddy after you fucked her",
            "You are a role Model and you are rocking it dude",
            "Just reminds me of a saying:\n\n\"Any man can be a father, but it takes someone special to be a dad.\"\n\nCongratulations!",
            "It could have been a slip of the tongue, \nI wouldn’t do anything, just be happy she is comfortable enough with you to call you dad.\nShe may do it again, she may not. I wouldn’t make a big deal about it but it it happens again maybe mention something to your wife. Approaching your stepdaughter may embarrass her.",
            "No don't say a word. Just accept.",
            "Who cares what her father would like to hear? It’s about how she feels. I was adopted, but it was an open adoption. It was kinda backwards for me, where I called my adopted father Dad and then found out I was adopted (was still a little kid, my older half sister by blood and cousin by adoption—I know, kinda confusing/complex, my birth mom was married to my adopted mom’s brother and they split up and I came along, adopted mom had been trying to adopt for years, and birth mom was gonna get back together with her husband—knew and blurted it out to me during us arguing.) It took me years to feel comfortable switching from “Uncle Name” as he was introduced to me as a kid to explain who he was when they didn’t tell me yet (half sister, and they were split up, affair baby, so not my uncle at all even by adoption, they just needed to make that up bc I was little) to Dad. \n\nOFC I do remember accidentally calling a teacher “Mom” once by accident and being mortified, so it COULD have just been a brain glitch that she felt embarrassed about….but if it’s not, and she says it again, do your absolute best to be Dad. Tell her you’re proud of her with her good grades. Tell her you love her like your daughter and it’s okay to call you that, and that it doesn’t take away from her birth father, that she’s just lucky to have two dads. And be careful. Try not to break her trust if you earned it. That’s special.\n\nOnce my birthdad divorced my stepmom (again, sorry I know my family structure is really weird…not birthmom or adopted mom, wife of birth father), it didn’t change that she was a mom to me. I still visit her. YEARS later. If you’re worried about that aspect if anything goes wrong with your marriage, don’t. Just don’t ghost her and let her know to you she’s still family and you love her.",
            "Man, as someone who only had a mom most of the time and a dad on everyother weekend, that did meet a woman who tried to take on the stepmother role from the start (but never could because she was so horrible). I really tried for my dad, she came into our lives when we were 8 and 6. She was bad and too controlling, my dad took her side constantly. My mom was and still is the best and calling someone else mom for me was inconceivable. I do think I've been... Scarred by it. I called her my dads wife if I had to go by not using her name.\n\nWhen I was 25 and in uni I got a call from my dad while I stood in the line at mcdonalds, telling me that they broke up, divorced and the whole shebang. Tbh I did order me something more luxurious to celebrate for myself.\n\nAll in all, I'll just say it would take A LOT from myself to call a parents partner either mom or dad. And her dad being so present, I would take this up first with her mother and then take it from there. Like who knows how the kids father would react. But it must be so endearing and precious to get that title. Just respect all sides wishes and ofc the kids as well!",
            "The fact is, she has two dads, and it sounds like you both love her immensely, so there shouldn't be a problem. I would talk to Rose and her bio dad and tell them what she said and that you will not stop her from doing so.",
            "My step daughter calls me “mama Annie” (fake name) \n\nIt caught me off guard. But imo- it means the kid sees you as a parental figure and looks up to you. I wouldn’t police it. I love that your thoughtful of her bio dad! I was the same way. I’d talk it through w wife and have her unpack that- because you saying “don’t call me dad” will feel like rejection to a child. And it’s also ok to have more than one dad. Maybe pops? Or like a different name that isn’t “dad” would be more comfy?",
            "I have one mom and two dads. The guy my mom let after divorcing my dad is also my dad. I'm 36 years old now and this has been my life for over 30 years. \n\nDon't overthink this, the kid is clearly not confused so don't hurt yourself in your own confusion (to quote Pokemon).",
            "At that age I once called my home room teacher “mom” by mistake.\n\nIt was a slip of the tongue.\n\nDon’t read too much into it unless she doesn’t it again.",
            "Whatever happens, you are not the one who gets to have a conversation with her about this. \n\n\nYou absolutely should tell your wife, and she should be the one who takes it from there. She can have a conversation with her daughter, and her ex, and they can make the call on what is/is not appropriate.",
            "She’s 9, you have been a father figure to her for a third of her life. She may have simply slipped up while speaking. I wouldn’t even bring this up because this is exactly the kind of thing that can get hurtful (to her, she’s literally a child) and become a sour memory way into adulthood.",
            "If you have a good relationship with her father, maybe talk to him about it and ask him how he feels. If he's a decent guy, he probably won't mind and will be happy his daughter has a stable father figure in her life when he is not around. At the same time he will feel included in the process and not replaced or left out. Make sure you talk to your wife first of course and that she is on board with it.",
            "Crying over this. Of course you are allowed to be proud of her. 😭 I'm happy for you.",
            "Oh my man, this is truly the greatest gift you will ever receive. Just be her dad, buy her ice-cream when you reckon it's right to, but no matter what, be you and support her no matter what. Honestly, this is about the greatest gift you'll ever be given. Just keep supporting her, and stop second-guessing yourself.\n\nHonestly, I have daughters, and I'm envious. All the best to all of you.",
            "It’s truly beautiful to see how OP is concerned about everyone’s feelings.\n\nWay to go, dude, you sound like a great human being",
            "Step dad here, \"Dad\" is not a name, it is a title. She used it to express the role you have in her life. \n\n> I don't know how I should react.\n\nYou react happy and proud. You have done a very good job and this is your proof :-)",
            "Man, you’re one of the good ones. Made my heart happy reading that",
            "If you raise someone, I feel like you earn a parental title, like mom or dad. Rather the kids call you that or not is up to them ofc.\n\nBut i’m pretty sure the main reason why kids won’t call their step-parents mom or dad is bc they’re told not to out of ‘respect’ for the bio parents. Especially if they’re both still in the picture. I would get it being more complex if she was older, but you’ve been with her 6 of her 9 years of life, which is basically all of the life she can remember lol. So it’s not surprising she thinks of you as a father.",
            "So my situation is a bit different but this kinda feels similar at least this story really resonates with me.\n\nBackstory:  I lost my dad when I was four due to a brain tumor, my mom remarried quickly after and I’ve been raised fully by my mom and ‘stepdad’. I have an older brother of 8+ years and sister +16 years who where the typical ‘your not my dad’ type of kids that would cause family drama all of the time. \n\nSo I ended up learning from them and my mom to call my stepdad by his first name and that was how it was for years. My brother and sisters relationship worsens trough out the years and they separated me emotionally from being from the same family and treated me as a outsider since we don’t share the same ‘past’. My mom was uncomfortable with me calling my stepdad ‘dad’ and put my birth father on a pedestal jadajajaj. \n\nAnyway around the age of 25 I realized how my family was so hung up around the fact of all being individuals and kept complicating and not moving on. At some point you almost made felt guilty when I wasn’t mourning my dad that I actually did not mis. Because I have no memory, I have my stepdad. \n\nAnd that’s when it hit me although they all didn’t like it. He was my dad, he helped raise me and thought me as one of his own. He formed my character and therefor have a piece of him with me at all times. So whenever I meet anyone new, He is my dad and to my kids he is 100% their granddad. \n\nWhy? Because he is there and taking on that roll full on and it seems you are doing that to and that is beautiful. Yeah people might not all agree on it but it just means your doing a great job and you can be proud of the kid for accepting that emotion because if my bro and sis did that they would have been allot happier in life than they are now!",
            "If two gay men can both be \"dad\" to their kids, you can share the title with her bio dad as well. Doesn't have to be a competition.",
            "My daughters mother and I split up, and she’s been dating her boyfriend for three years now. I am very involved in her life and often my time with her overlaps his time with the family. When he says to my daughter, 7, ‘I love you kiddo, have a good day.’ And kisses her on the head it just turns my stomach. Not everyone feels this way, I do however. I don’t say anything and do my best to be civil and keep my cool but it just does something to me. I wouldn’t tell her though that showing affection to her mothers boyfriend is off limits. I would encourage it. It’s really a me problem but yeah.",
            "Why are you coming to Reddit about that? Just let her call you dad. You’re with her mom and you’re taking care of her. It’d only be weird if her dad is in her life.",
            "Find some way to work in \"daughter\".",
            "I remember being 10 and thinking about calling my step-dad 'dad' it was scary because even though I knew he loved me, I was scared he'd reject the name. She probably worked up the courage and felt nervous. You not acting like it was weird or bad, and also not focusing on it like a huge embarrassing deal will make it more comfortable for her to call you dad regularly. You could also mention to her that you weren't sure how to react because it made you happy but you didn't want to be embarrassing",
            "Don’t react at all. Don’t make a big deal out of it just accept it as what it is. Either a freudian slip or a concision decision to call you dad. \n\nYou are also definitely allowed to be proud of her just also tell her that you are proud. My own father has never said he’s proud of me that I can remember and honestly if he ever did I’d appreciate it more than he’d ever know. The fact he doesn’t ever say it makes me feel he doesn’t feel it. So tell her you are proud when you are.",
            "As a someone who still call her stepfather “dad” at 47, take it as a compliment.\n\nGrowing up, I had the sense to not refer to my stepdad as “dad” in front of my actual father, out of respect for his feelings.  But as a kid particularly around strangers (like in the grocery store or whatever) I called him “dad”.",
            "You aren't her real dad.  You cannot replace her real dad.",
            "Thanks!  I’m glad we had a dad kind of day” \n\nOr “thanks, you’re a great kid and I love being your extra dad”.   Or backup dad.",
            "It's usually just by accident",
            "this is an honor and absolutely not a problem. you aren’t a replacement, you are an additional dad. congrats 💖\n\ni’m a step kid, and i don’t call my stepdad dad, i call him by his name and that is due to his behavior. he’s an excellent partner to my mom, and he has been there for me in some certain cases more than my bio dad ever was, but he often chooses being a jackass (in that classic man way where you never work on your own childhood issues and traumas and inflict the same on your kids) over being kind and supportive. so, he stays being called by his name and referred to as a stepdad. i have love for him because of how he treats my mom, and for the few times he’s been there for me with no drawbacks. outside of that it’s a strained relationship and may always be but i made my peace with that. \n\nin a different way, i never called my stepmom “mom” but that’s more to the way she’s always been more of a friend figure, nothing negative. she was so excellent and there thru my formative years, i still consider her my stepmom even though she’s been split from my dad for like 10 years now. she’ll always be my bonus mom.",
            "Personally I would feel my heart burst out of my chest and fly to the moon if my step child called me mom or dad but that’s just me 🥲",
            "When she says dad she may just mean it as a general term for a man in her life that she trusts. If you take that away from her you could do far more harm than any good you feel you're doing protecting her relationship with her other dad.",
            "You do realize you're the girls step-father, right?   Dad is appropriate terminology, especially if she's 9 and she's known you since she was like 3 years old... \n\nThere's no 'reaction' necessary.  Take it in stride and feel good that she sees you as a father figure.",
            "This is something to discuss with your wife and then with John. Her wanting to call you dad is a good thing! It means you're doing it right! But definitely something to alert John to so he isn't taken by surprise. You're allowed to call 2 people dad- or if you decide together to talk to her about it instead of letting her do whatever you could suggest an alternative- Pops or something",
            "Congratulations! Clearly you have done things right.\n\nIf her bio dad has a problem with it and makes her feel bad about it, that's something to react to, but he could just as well be genuinely pleased that she has a bonus dad and thus an additional safe adult to turn to.\n\nIf bio dad talks to you about it, tell him like you told us that you were pretty stunned when it happened, thought it must have been a mistake, and that you fully intend to keep being worthy of her regard, because his daughter is a great kid.",
            "I dont know man, I suggest you correct her gently and  take a friend role in the future. I am saying this because you are not her dad, she has her bio dad who is present in her life. You shouldn't want to take that role away from him.",
            "My aunt and uncle adopted me when I was 8 after my mom passed away and my dad decided he didn’t want custody. I loved them like they were my parents and they loved and cared for me as their own. My uncle was already a step dad to my two oldest “brothers” (previously cousins) and then he took me in and had two more kids. I didn’t start referring to either of them as my parents until I was about 14. It wasn’t until I was 27 that I actually started calling them mom and dad.\n\nI’m not really sure of the point of this story other than to say, calling you dad is a big deal. It means she sees you as someone she can trust, confide in, love her unconditionally, and care for her as if you were her biological dad. Even if she already has a very present father, you’re just one more person who loves his kid and no should be mad about that.",
            "You should probably talk to her father and explain the situation if he really cares for his daughter then he will be okay with it also it’s very normal to be proud you kinda also raised her",
            "This story is interesting"
        ]
    }
]