[
    {
        "post_id": "41nwlk",
        "author": "anelaboratedivorce",
        "title": "[UPDATE] My [26F] mom's [54F] plan to surprise my dad [55M] with a divorce is kind of cruel",
        "url": "https://www.reddit.com/r/relationships/comments/41nwlk/update_my_26f_moms_54f_plan_to_surprise_my_dad/",
        "score": 2199,
        "num_comments": 349,
        "created_utc": 1453196866.0,
        "selftext": "[Original post](https://www.reddit.com/r/relationships/comments/3wku4h/my_26f_moms_54f_plan_to_surprise_my_dad_55m_with/)\n\n\n**EDIT:** People are messaging me saying they can't see the original post; I guess it got deleted. I'm going to repost it here, I hope that isn't against the rules.\n\n\nMy parent's have been married for almost 30 years. Their marriage is not great. My dad's the kind of person who will come home from work and get angry that there isn't dinner on the table. Growing up, my dad never treated my mother like an equal. She was expected to do all the housework and look after the children, and dote on her husband at all times. \n\n\nMy parents have been empty nesting for a few years now. I have one younger sister, and we are both out of the house and have our own lives. Neither of us kids have particularly LIKED our dad. Like, we love him in the way that you love family, and we are grateful that he provided for us and helped us pay for college. But my dad is an asshole who treats my mom poorly, and I never respected him for this. \n\n\nI recently got brunch with my mother, and she dropped some pretty heavy news. She's planning on divorcing my father. I was honestly relieved and happy for her that she's finally doing this, but her plan to do so is rather troubling. \n\n\nMy parents are Chinese immigrants. My dad's best friend growing up (Daniel) and his family have been saving up for a trip to the US for years. They will be visiting my parents over Christmas. My dad, naturally, put the burden of this whole trip on my mother. He told her to organize their whole vacation, planning meals, reservations, activities, etc. Basically my mom is expected to be the complete tour guide and handle all the stress and organization of their visit (including picking them up from the airport) while my dad just gets to hang out with his childhood friend and not deal with anything. My mom doesn't even KNOW these people.\n\n\nApparently, however, this was the last straw for my mom. She is retaliating. She has only been pretending to organize this trip and faked a bunch of reservations and stuff to appease my dad. My dad thinks everything is organized and Daniel's family is being completely taken care of. Her plan, instead, is to serve him with divorce papers the day she is supposed to pick up Daniel's family from the airport. My dad will be out of town on business up until the day Daniel arrives, so she will be moved out by then. Daniel's family will be stranded at the airport, and my dad will come home to an empty house and no family. \n\n\nWhile I support the divorce, I can't help but feel like this plan is a little too cruel. She can be as vindictive towards my father as she wants, but to drag another family into this seems unfair. My dad completely deserves this, but Daniel didn't do anything, and his family doesn't deserve to fly into the US and face this level of commotion.\n\n\nIs it my place to say anything? I voiced to my mother my concerns and she basically was like \"fuck it and fuck him.\" I barely talk to my father, but I don't know who I should reach out to or who I can talk some sense into. \n\n\nMy dad has never been violent towards my mom or anything, but I'm also nervous about what would happen if I told my father the truth before my mom has had a chance to gather herself and move out of the house without him being present. It just seems like an explosive argument waiting to happen. \n\n\n\n**tl;dr**: My dads family friends are visiting. My mother was assigned the responsibility to handle their whole trip, including picking them up from the airport. Instead, my mom is going to do nothing and serve my dad divorce papers, leaving this visiting family stranded and cause a lot of commotion.\n\n\n----------------------------------------------------------\n\n\n**Now, on to the update...**\n\nThank you to everyone who replied. It's been about a month since my post. Reading everyones responses made a few things to me very clear, that I especially had not thought of before:\n\n\n* It is highly unlikely that Daniel's family being \"stranded\" at a large international airport in the US would be that big of an issue. They speak good enough English, they have cell phones, they have money, they have my Dad's contact information. \n\n\n* My mom's decision to wait for him to get his news until he returns from his trip is a strategic one, so she can move out calmly and safely. While my father is not physically abusive, he certainly would not let my mom leave comfortably. She doesn't need that stress. \n\n\n* While some suggested that I step in and take over her duties, others claimed that it was risky for me to take over this role--my father may then just see me as replacement for his wife. This may set a bad precedent. \n\n\n* While I initially found her plan to be cruel, some of you rightly pointed out that surely this act of cruelty pales tremendously compared to the years of mistreatment she has dealt with. \n\n\nSo, Reddit, I opted to know nothing and do nothing. Here's what happened. Around the time Daniel's family was to be picked up, I get a phone call from my father. I decided (especially since this was the middle of a workday) to ignore it, because I frankly did not want to get wrapped up in the commotion. He called again and then sent me a series of texts, demanding to know the whereabouts of my mother. \n\n\nNow, if you recall, my father had been on a business trip this entire week. His first chain of messages/calls was when had a layover in Denver. He was to be in Denver for 3 hours before he could get on his connection home. This means that, at this point, my dad is aware that Daniel's family has not been picked up (because Daniel obviously called my father) and that my mother was not answering her phone, but he did not know why. He also called my younger sister, who said she genuinely had no idea what was going on, but also lived out of state so was unable to help (I later find out that my sister was also briefed by my mother about what might happen so that she wouldn't get caught off guard, and she was just playing a fool to help my mother along). I eventually text my dad back saying I have no idea what is going on, but I'm very busy at work and won't be able to get back to him for a while.\n\n\nMy dad, unable to find immediate answers, told Daniel there must have been some miscommunication. He told them to get a cab from the airport to the house and just make themselves at home until my father could get to them. He gave Daniel the keycode to the house, told him to call back once Daniel and his family were safely at home.  \n\n\nHere's where things get a bit theatrical. My mother apparently attached the divorce papers to an easel, with a nice big DIVORCE label and note, and placed the easel right at the entrance hall to the house so it's the first thing you see once you open the door. So, as you guess it, who get's the divorce news first? Daniel and his family. Daniel then has to tell my father that my mother is divorcing him. \n\n\nThis is precisely what happens (Daniel recounts this in private to me later, which is how I know). But apparently my father went through a range of emotions, from disbelief, to a fumbling stutter, to anger, you name it. This, by the way, is happening while he is at the Denver airport, surrounded by his colleagues. He then has to, presumably, give some sort of explanation to his work friends and deal with an awkward and uncomfortable plane ride back home. \n\n\nLong story short, my dad was incredibly embarrassed and flustered. He had no idea what to do or how to help himself or anyone. Daniel actually ended up coming to the rescue, because he is apparently quite the meticulous planner and had many suggestions for activities and sightseeing. Basically, Daniel took charge of his own vacation, while my dad fumbled around like a lost puppy, just tagging along their trip while being completely discombobulated. \n\n\nI expected my dad to put on a farce for Daniel and his family and pretend things were fine, but he was unable to do that at all. I think he legitimately and honestly believed that my mom would never leave him, and was too much at a loss for words to even be angry. \n\n\nLater on, I stepped in to help out Daniel's family and make sure they were doing okay, giving my dad some time to himself. Overall, while they weren't wined and dined in quite the way the probably expected, Daniel seemed like a good and understanding friend, and they managed to have a productive vacation. Daniel said towards the end, when the shock had worn off, my dad and he were able to have a little fun. It was probably a good thing that Daniel was around to help my dad through it. \n\n\nAs for my parents, in general, they are only communicating through their lawyers. My mom moved out to her own apartment. She hasn't told my father where she lives, and I am completely staying out of it. My mom seems like a brand new person to me. I am incredibly happy for her for being so brave and finally taking charge of her own life.\n\n\nMy dad is pathetic and completely helpless. He's been wrapping himself up in his work and eating lots of takeout. I've been careful with my involvement: I will be supportive enough so he doesn't feel completely alone, but I am adamant to not become some sort of caregiver for him. I refuse to answer questions about my mothers whereabouts, but I do express sympathy for her. It's important for me to make sure my father recognizes that honestly, I am on my mothers side, and that I never agreed with the way he treated her. That being said, I am also careful not to antagonize my parents towards each other. I want this breakup to be as clean as possible.  \n\n\n**tl;dr** I didn't intervene. Daniel had to get to the house on his own, where he found my parents divorce papers. Daniel had to tell my father that my mother was divorcing him. Daniel ended up taking charge of his own vacation, my dad tagged along, I helped a little. My mom is on her own and happier than ever, my dad is completely lost.",
        "permalink": "/r/relationships/comments/41nwlk/update_my_26f_moms_54f_plan_to_surprise_my_dad/",
        "comments": [
            "I'm so happy for your Mom. I think you have played it just right. Thanks for the update, I wondered how things ended up going for her.",
            "(Warning: long story.)\nWhoa this is so weird, I had to reread your title and make sure my siblings or my alter ego(???) didn't write this post. We're the exact same age and our parents are the exact same age and my mom just left my physically and verbally abusive dad last fall.\n\nAs soon as my youngest sibling left for college, we packed up essentials and disappeared. We had to hurry and move everything in less than a work day (uhaul and all in under 6 hours ugh), so when he came home, our stuff was gone and there were divorce papers on the counter with a letter from my mom. It sounds cruel, but there was no way she could have done this in person and left unscathed. He left us threatening and guilt tripping voicemails for months and even tracked her down at work a few times but she always saw his car first and hid.\n\nWhat's much crueler is abusing your wife and kids for 20+ years and threatening to put a bullet in our heads if we ever told anyone (or did anything remotely out of line), which made for very dark and lonely lives for all of us. We went no contact and the first few months were rough, looking over our shoulders constantly and dealing with the fallout with whomever he told his \"sob story\". In the end, we really see this like a new lease on life. \n\nMy dad doesn't know where we are and we're all breathing so much easier now that we're no longer essentially hostages in our own home. My mom got a new apartment and the furniture that she wanted and eats what she wants and sees her friends and goes on trips with her friends. She has become a totally different person, so much bubblier and happy.\n\nTL;DR My father was also an asshole, we disappeared and left him divorce papers. We are safe now and can finally work towards leading normal lives.",
            "[removed]",
            "[removed]",
            "[deleted]",
            "Your mom is an INSPIRATION for how well she handled that, I'm so glad you just let it play out. Great update! It also sounds like you set a good precedent moving forward for your role in this situation.",
            "Reading this made my desk at work raise up a few inches from the justice boner I got.\n\nBest of luck to your Mum.",
            "I feel sorry for Daniel and his family. Not exactly the vacation they were looking forward to I imagine",
            "I'm happy for your mother that she got out of there, but I can't help but feel for the family. It doesn't matter how well you speak the language or how much money you have, having to figure out shit like that on the spot at the end of a long flight is crappy. And then to be pulled into messy, private business at the end of it that they probably wanted no part of.... Idk. I would be so incredibly uncomfortable if that was me. I don't want to be dragged into the middle of someone else's personal business, especially not something like divorce. \n\nSo yeah, I'm really glad that your mom got out of there, but I still feel sorry for David's family. ",
            "Way to go your mom!",
            "Oh, I've been waiting for an update to this and I'm experiencing a raging justice girl boner right now. :D Also, I wish I could upvote your post twice for the use of the word \"discombobulated\". Good on you, good for your mom that she can finallly live a little and good that Daniel is such a good planner and collected person. All is well. ",
            "I really like your mom. What a bad ass.",
            "Omg this made a tear shed from my eye an actual Reddit user that stayed out of it and didn't make the situation worse bravo bravo.  ",
            "First I was thinking that while I was happy your mom was getting out, I was sad for Daniel being put in suck an awkward position.\n\n\nThen I read about the easel, and I was totally enamored with your mom. What a spectacular move on her part. But again, sorry (albeit much less sorry) for Daniel having to live that moment.\n\n\nProud of Daniel for negotiating those treacherous waters like a pro. And I wish I could hear his telling of \"The Trip From Hell\" tale to his friends in China :)\n\nPS, I hope your mom is happy, that your dad learns to cope, and that you and your sister navigate this yucky situation ok.\n\n\n\n\n\n",
            "What did the father do to the mother? I hate when people delete the original post, I have no idea why everyone is hating on the dad.",
            "Do you think your dad is going to be OK? Eventually he will run out of work to do.",
            "Your mother is a fucking amazing person. I'm sure I don't have to tell you that though. This was just brilliant to read. I know it's not right to feel good about someone being hurt. But your father needed this, he needs the wake up call to realise that his actions do have consequences. If it were up to him he'd of died treating your mother like that. I'm really really happy for her. For him too,  this is his opportunity to fix what's wrong with him. He won't be getting her back, but hopefully he is able to realise his wrong doings and find someone to be good to. \n\nGreat job to you, op. You made the right choice staying out of things. ",
            "Former therapist here. GOOD CALL.",
            "Wow! What an update... good luck in all this OP, challenging times ahead but I'm happy for your mom. Maybe your dad can grow from this experience too.",
            "Your mom has balls girl!",
            "Way to go OP! This was a perfect update. I'm glad your mom is doing better. ",
            "This is the best possible outcome for this situation. Now your mother can finally live the life she deserves.",
            "Did your mom ever confront your dad about his behavior? Did she express how unhappy she was with his bullshit or did she just put up with it? How is it possible that your dad would be this blindsided if he knew that his wife was so unhappy? It kind of sounds to me like the issues went a whole lot deeper than you've expressed here and it's probably good they're divorcing because they apparently can't communicate.",
            "[deleted]",
            "Gonna send this to my mom! Great story!",
            "Happy for your mom.  Your dad seems like a total douchebag and got what was coming to him.   It's almost like reading justice porn.   I hope he takes a long fucking time to reflect on who he is.",
            "My parents are going through a \"divorce\" right now, but my mother (the one who initiated it) keeps communicating with my abusive father (including getting into trouble with the law with him, i.e. hit and run, driving drunk, trespassing, etc.). I wish my mother was as much as a badass as yours is. ",
            "Pretty much the only way she could have really hurt that kind of asshole- embarrass him in front of someone he respects. Threaten to take your love away and they laugh and go \"where you gonna go, trash?\" But this. This was perfect. Good for her and good for you keeping him at arm's length. He absolutely is looking for a caregiver now, and god help whomever he sinks his claws into to fill that role... ",
            "Sorry about this, but can someone tell me who Daniel is? I missed the first post before it was deleted.",
            "I have no words. I am so happy for your mom. My parents are also Chinese - my dad is an immigrant but my mom was born here (and her parents were immigrants). My dad doesn't treat my mom very well either...he isn't physically abusive, but he definitely is emotionally abusive. He yells at my mom if she doesn't do things his way, and doesn't do anything around the house (leaving my mom to run the household while maintaining a professor music teaching job and take care of my grandma who lives with us). My mom has a heart condition and osteoporosis, but she will still shovel the driveway because my dad doesn't do it. Things like that. He'll yell at her if she says or does anything remotely against what he wants (e.g. my sister, who is 20 years old and in university at home, is driven everywhere, gives my mom A MEAL PLAN and does no chores at home) - my mom spoke up once and got yelled at full blast about how my sister has to concentrate on school etc (even though she failed a prerequisite course last year and is now half a year behind). My dad and his family (2 sisters and a brother) also demand that my parents pay them a certain amount of money each month - my dad says it's fine to help family out (while this has been going on for almost 30 years), but my mom got mad one year because she said they should at least send an email or note or something each time just to say they received the money. Nope. Got yelled at instead by my dad.  \n\nAnyways, didn't mean to ramble on so much about my own life there (I am so sorry) -  it is just nice to see someone else who sort of relates. I am so happy for your mom. She is now able to live her own life and do what she wants without worrying or stressing about how your dad would take it. Good luck with everything and thanks for the update!",
            "Your mom KICKS ASS. Im glad you reposted the original. I was in agreement that an innocent family didnt deserve being tangles in it, but they arent her friends. Theyre strangers to her. So, bit of a dick move, but ultimately forgiveable. Especially given the years of abuse.\n\nToo bad Daniel gained access to the house and spoiled the surprise lol.",
            "Your mom is a badass. Hell yeah.",
            "Honestly it sounds like your mom took the best route possible, and probably planned it to unfold this way. She got a bit of revenge, but not leaving your dad up shit creek, as his best friend was there to help him through the initial shock. \n\nAs long as the divorce goes cleanly, I can't imagine a better result. ",
            "Good for you, OP!",
            "I think you all sound like assholes",
            "I am so happy for your mum. My parents are like that except it's my mum that's being the abusive horrible person. I wish my dad had the strength to leave her but I doubt it. I am having divorce envy!",
            "Your mom is brave, I'm so happy for her. I hope your dad understands you, your siblings and your mothers views on his behavior and tries to change. That kind of behavior is unacceptable.",
            "This is awesome. \n\nAnd a good lesson, never get involved",
            "Good for your mom and a little justice was served on your father.",
            "Too bad she didn't talk to him to express what she was feeling. It would have provided them the opportunity to improve their marriage to their mutual benefit. Instead he got a 'gotcha' divorce service and a crash course in the nightmare that is divorce court. Did ANYONE in the family talk to him at all about these problems, did you?\n\nMaybe because I'm a man, or because I have empathy, I can relate to his side of this story. Think of what makes life REALLY worth living, then ask yourself if your dad or your mom got to experience those things while you were growing up. \n\nHe sacrificed so much of his life to provide for his family. Yes, he wasn't the nicest of men when he got home. There could be a hundred reasons. Maybe he felt cheated out of the really good things in life because of who he is and what he had to do. \n\nNow the family he's provided for, for almost 30 years, have abandoned him and taken his wife's \"side\" because he wasn't in a good mood after coming home from working hard during the day. I'm stunned.  \n\nWith stories like these, I'm not surprised marriage rates are on the decline. I would not want this happening to me or my sons and brothers. ",
            "Look I'm really glad your Mom removed herself from the situation.  Seriously that's great! But the way she did it? I'm sorry but that was really mean. One act of cruelty does not justify another.",
            "I don't know about your dad but what your mom did was, by any measure, abusive. I feel bad for him.",
            "Thank god I don't know any of these horrible people nor any of the horrible people here commenting and cheering them on.",
            "[removed]",
            "Was your Mother working when they were married or was she a stay home Mom/wife?",
            "tbh I don't really think your mom was that brave, in relationships communication is very important and she should confront your dad's behaviour at the begining if she felt mistreated, instead she was just his loyal, little helper for 30 years and then just ran away like it was nothing. And no wonder your dad felt crushed afterwards, everything she stood for came out to be a lie, he loved his secretary wife, yeah, the fact that he didn't get bored with her means that he must've had some feeling towards her and then she just betrayed him without a single word.",
            "[removed]",
            "I am just curious OP, was your father the primary bread winner for your family? Did your mother have any sort of employment and help pay for your upbringing? Your education? Your food? Your clothes? Your entertainment? \n\nI am assuming that your mom was employed and contributed 50% to the household finances, because that would completely justify your mothers behaviour as well as your reaction to your father by calling him \n\n>pathetic\n\nI will refrain from further comments, but I am just curious. \n\nCheers OP",
            "So you, your sister and your mother all just ganged up your dad?\n\nThere will be a blowout once he finds out that you all knew and decided not to tell. I d suggest that you never tell your father about knowing, ever. \n\n",
            "[deleted]",
            "All of the rationalizations and excuses and justifications you come up with for your mom pulling a stunt like this are bullshit, because of this:\n\n> My mother apparently attached the divorce papers to an easel, with a nice big DIVORCE label and note, and placed the easel right at the entrance hall to the house\n\nshe just wanted to be cruel. This was a revenge plot. I'd feel a lot better for you if you just said that instead of making it out that your *mom* had to pull this ridiculous stunt for her own safety.\n\ne: it's so much fun watching the karma swing my comments get on this sub",
            "I have no idea why you support your dad at all. It doesn't seem like you really understand how much abuse your mother had.",
            "Honestly, this is so sad. And the people praising you for what you did is equally sad. I'm a child of immigrants, not everyone here is, so its difficult for them to understand our culture. \n\nMy dad is also misogynistic, and conservative, and sometimes it infuriates me how he treats my mom. However, if my mom planned some shit like this, there's no way in hell I'd sit back and let it happen like you did.\n\nYour mom humiliated and embarrassed your dad in front of his friends and co workers. This was probably way out of the realm of possibility for him, and to just throw this on him, and humiliate him, is wrong and cruel\n\nI get it, it satisfies the revenge boner. But this is real life, shit doesn't work like that. Unless your a troll, which I don't believe you are, you should not allowed your mom to do this. \n\nIf your dad finds out... I feel so bad for that man",
            "The way you describe your father's terrible outcome in pleasure, it's so ungrateful. I mean seriously the man worked his ass off everyday to provide for his family. Ask your mother how was your father when they first started their journey, yeah very different I bet. When you put in too much time into work it's going change you into that person you vowed not to be. By the time you realize you've changed its too late. ",
            "Am I the only one who immediately thought of Daniel-san as in the original karatekid",
            "[removed]",
            "You said you didn't want to antagonize your parents towards each other but by knowing and not saying anything and admittedly not really helping your dad did that. You are also admittedly siding with your mom on an issue that is between her and your father. Unless your father was cruel towards you it is not your place to judge.",
            "That sucks and you sound like a lousy child.  You were a part to humiliating your father.  Being cruel was entirely unnecessary for your mother to leave him.  Did he not love and support you for years?  Did he not love and support your mother for years?  If she was so damned unhappy she could've walked a long time ago without the need for theatrics.  I hope he diverts any possible inheritance to his local SPCA.  ",
            "r/relationships does it again breaking relationships and lives since 2009 ",
            "You used to call me on your cell phone",
            "[removed]"
        ]
    },
    {
        "post_id": "6gmwdq",
        "author": "isthisstalking",
        "title": "The stranger (20s?M) who helped save my (25F) life might stalking me",
        "url": "https://www.reddit.com/r/relationships/comments/6gmwdq/the_stranger_20sm_who_helped_save_my_25f_life/",
        "score": 2190,
        "num_comments": 139,
        "created_utc": 1497205203.0,
        "selftext": "Burner account just in case. \n\nI have found myself in an incredibly strange situation. I live in a large city in the United States, and take the subway/metro to work every day. A few weeks ago, I was finishing up my breakfast outside the train station, and a little piece of toast got stuck in my windpipe. I tried to cough it back up but I couldn't breathe, and started freaking out. I ran to the nearest people, two men in their 20s/30s, and made it clear I was choking. One of them had a water bottle and I was able to drink some and dislodge the piece of toast. The two men were very concerned and made sure I was okay before I left, which I appreciated very much. I thanked them profusely and went on my way to work. I thought I would be done with this whole situation, but then things got weird. \n\nA few days after the choking incident, I was walking home from the store and all of a sudden a man runs up to me to stop me. I realize it was one of the men who helped save me, and he introduced himself (let’s call him “John”). We started talking and I thanked him again. He then started telling me he’s been thinking about me every day and talking to me about religion and how he thinks God put me in his life. He then asked where I lived, to which I gave a very vague answer, and said “I’m not going to ask for your number right now, but I would like to get to know you.” I told him that I am in a relationship, but that didn’t really seem to sink in. I told him I had to go, and the conversation ended with him saying “I know I’ll see you again.” \n\nI saw him again the next morning. He was standing outside the subway/metro entrance I normally use (and where I choked). I realized it was him and tried to quickly go past him so he wouldn't recognize me…but once I was almost at the end of the escalator, I heard someone running down the steps. Sure enough, it was John. He had run all the way down the escalator to catch up with me, and he said “I’m glad I saw you again. I’ll always be here for you.” I was really shocked, and said something like “oh” before I turned and hurriedly walked to the train platform. \n\nAfter that incident, I started taking a different entrance to the train. I hadn’t seen him for a week…until I saw him again today. I was walking home from the store with my boyfriend, and all of a sudden I saw someone come up from behind my boyfriend. I realized it was John but acted like I didn’t see him, and kept focusing on talking to my boyfriend. John got weirdly close to my boyfriend and was staring at me, seeming like he was going to say something to me, but then he pulled back and my boyfriend and I walked away. After I told my boyfriend that it was John, we checked to make sure he wasn’t following us, and used the back entrance to our apartment. \n\nI am at a loss regarding what to do or what to think. I’m grateful to John and his friend for saving my life, but his behavior has become very inappropriate and weirdly threatening. From speaking with him, it’s clear that there’s not something quite “right” about him, and I have no idea if he would have violent tendencies if I were to tell him to leave me alone. I hate feeling so trapped, and RESENT that this is the reality of being a woman in this world (can’t I just have a near death experience and have it not turn into some stalking situation??!?!). How should I approach this? Should I confront him or tell him off? Is this the beginning of behavior/stalking that is more sinister? Any advice would be much appreciated. Thank you. \n  \nEDIT: I should have made this more clear, but I expressed my disinterest in him multiple times during the second encounter. When he said he wanted to get to know me, I told him that I wasn't interested, that I needed to get on with my life, and that I am in fact in a relationship. The other two encounters happened too quickly and caught me too off guard for me to say anything, and as many others have pointed out, there is always the question of safety when faced with a man who can't seem to take \"no\" for an answer. Thank you for all the words of advice and support; I really do appreciate it. \n\n  ---   \n  **tl;dr**: A stranger who helped save me from choking to death keeps appearing when I’m walking in my neighborhood, saying things like “I want to get to know you” and “God put you into my life.” How do I approach this behavior?",
        "permalink": "/r/relationships/comments/6gmwdq/the_stranger_20sm_who_helped_save_my_25f_life/",
        "comments": [
            "This is absolutely stalking and not okay. Next time he approaches you, tell him firmly, \"You're making me uncomfortable. Please stop following me and approaching me. I just want you to leave me alone.\"\n\nIf he tries to argue and follow you, or if he approaches you again, go directly to a metro employee. If you see a police officer, even better -- but the employee will be able to summon one quickly. The nice thing about city train stations is that the police are typically around or ready to come at a moment's notice. Point him out to the officer and explain the situation. They will deal with it and tell you how to escalate if this ever happens again.",
            "I'd actually go to the police now, and not wait for it to happen again. They don't need to haul up and arrest him, but the sooner you make them aware that this risk is present, the sooner you can feel safe and secure. That way, if (god forbid) something bad happens or it gets worse, they already have a lead and a record on file. Try and document your interactions with him/things he's said, and as everyone is saying, get it on the record (and to his person, if he comes up again) that he's making you uncomfortable. \"I'm not interested in pursuing this relationship. Stop contacting me.\" \n\nAlso if he approaches you again in public, make sure that your statement about him leaving you alone is loud. You don't have to scream, but make sure passerby can hear you/are paying attention. \n\nIf you feel really unsafe, use the buddy system (your boyfriend, friend, a dog, pretend phone call) when you go out and about so someone else knows about your whereabouts or can provide you with an out like an appointment, movie showing, etc. ",
            "The part where he thinks god put you in his life is the really scary part. That kind of statement could signal the kind of crazy that thinks it knows what you need better than you do - like, I'm worried about how he was looking at your boyfriend. This doesn't seem like the kind of guy who is going to take no for an answer. I don't know that I have better advice than any you're already being given here, just please don't talk yourself out of taking it, and stay near metro police or employees as much as possible! If he approaches you outside a store, go in the store and say your Go Away speech where people can hear you!",
            "Jeeze, this is awful, I'm so sorry this is happening to you. \n\nYou should probably start by telling him, in no uncertain terms, to fuck off and stop trying to wedge himself into your life. Bring your boyfriend with you as backup. You're being too nice/nonconfrontational to the guy (something that society trains women to do, unfortunately, so I don't blame you for trying that tactic), and dudes like him see polite/awkward \"no\"s as \"if you try harder, YES\".  If he continues after being told to fuck off, it's time to get his full name and call the cops/get a restraining order.",
            "Ugh. If I were you, I might make a plan of what I want to say next time I see him, so that I can feel in control of the situation. I would even practice in the mirror. It sounds like you want to not have him follow or contact you again, and you are afraid of his (potentially unhinged) reaction. So you probably want this to happen with witnesses or allies (like your boyfriend) around, and be able to leave quickly afterwards. You probably also want to de-escalate and not increase his interest or ability to follow you.\n\n\nNow this is more what I might do: I would want to keep it light but firm. My style would be to say something like this: \n\"John, I hope that what you would do for me for anyone. It's important in the city that when things happen, strangers can help each other. But we are strangers and we are going to stay that way. I have noticed you following me multiple times, and I'm not OK with that. I do not want you to follow me or look for me any longer. We have nothing else to say to each other. You need to respect my wish for privacy. Goodbye.\" And then just leave. I wouldn't want to get into a further conversation at all. \n\n\nAnd then if you see him again, call the police or transit police.\n\nUgh. I'm sorry this is happening to you. It must feel so gross. I hope you find your own words to create that boundary, and the strength to enforce it.",
            "Jesus fucking christ, i thought this was the title to a nosleep thread when i first read it. Call the police now so they start making a record on this creepy fucks behaviour.",
            "Off topic but water can't dislodge something stuck in your trachea. Unless it was empacted in your esophagus. It was probably the coughing that moved things along. ",
            "There's honestly a lot of dangerous information here. When you're dealing with a stalker it's not the time to be a badass and vindicate all womankind (and I speak as an ardent feminist). You might want to look into Marc MacYoung's no nonsense self defense website. I really dislike how he characterizes feminism and PC culture yada yada, and his rape prevention strategies can come across as very victim blame-y, but he does have good advice that expands upon what you might find in The Gift of Fear. \n\nTrust your gut on this one: does this guy seem potentially violent or threatening? Let's review your language in this post. You've described him as \"weird\" and most importantly, \"threatening.\" You have also expressed worry about whether he is violent. You also say there is something not quite \"right.\" \n\nAre your instincts correct? Let's review his behaviour: he is stalking you, and he is escalating. He waited outside the metro entrance, followed you onto the platform (instead of just observing), and he knows the store you frequent. He has approached you when you have company, specifically your boyfriend, and behaved in a threatening manner by staring at you. He has asked for your address. Through his speech (specifically with references to God), he has shown that he feels entitled to you. Not just your time or energy, but you. \n\nTelling your boyfriend and taking care to not show him where you live is a great idea. Please expand on that and invest in your home invasion security measures, because honestly if he's this obsessive he might be observing just for the day you slip up. Tell your friends, your coworkers, your neighbours, the workers at the store, the metro employees. If you have a picture, or even just a good description, let them know, and get it into their heads that they must TELL you if they see him around! File a police report (and if they try to dismiss you DO NOT LET THEM AND INSIST) and a restraining order, and begin documenting everything. If you're afraid of violence (if he sees you documenting) then just turn on your voice recorder on your phone every time you exit the subway. In the meantime, if you can afford to take an Uber from a couple of stops away or have friends drive you home, do that, and also conceal your appearance while at it. \n\nDo you think confronting him would work? If you want, you can do it in a PUBLIC place in front of metro employees and/or police, and make it polite but firm. Asserting your dominance verbally can be dangerous because you don't know if he is carrying a weapon, just say that you don't want to see him again and to not follow you. His reaction could be very telling. \n\nI don't want to scare you, but please take this seriously. Don't wonder if your feelings are valid (they are) or if he's just nice if a little clueless (he is again, ESCALATING instead of de-escalating). \n\nIf you want local resources, hit up a woman's shelter and ask for help. They're experienced with domestic partners but I'm sure they have contacts with orgs and know of general reporting procedures. ",
            "> He then started telling me he’s been thinking about me every day and talking to me about religion and how he thinks God put me in his life\n\nThis guy is crazy, and the fact that he's *running* up to you and getting in your personal space is further proof. I'm not sure if he'll respond to a standard, \"You're making me uncomfortable, please stay away.\"\n\nStep one, go to the police. Step two, next time he approaches, YELL at him. Lift up on your feet, make your shoulders wide and yell at the top of your lungs, \"LEAVE ME ALONE. I DON'T KNOW YOU. STAY AWAY FROM ME. STOP FOLLOWING ME.\" This should have a handful of results:\n\n1) It should (ideally) make you feel braver. Martial artists will often yell before a fight.\n\n2) It will scare and/or startle your attacker. \n\n3) it will attract the attention of the people around you, thus making it harder for this guy to get near you. \n\n4) this guy will think twice about approaching you again. But you should carry some personal protection on you in case he decides to try his luck in more isolated areas. \n\nGood luck.",
            "I actually think you need to inform the police right now about this guy, either in person at the station or via the non-emergency line. He's approached you three times already, and is making you feel trapped and unsafe in your own neighbourhood. That's not something you should have to put up with, OP.\n\nAs others have already said, if he follows you again loudly tell him that you're uncomfortable and that he needs to leave you alone. Make it loud enough so that people around you can hear, but keep it succinct; you don't want to engage with this guy for any longer than is necessary. If he protests go straight to a nearby place where there is security present and inform them what's going on.\n\nI'm so sorry you're in this situation. I had a very brief incident myself with a guy a few years ago, which wasn't even in the same ballpark as your situation, but I remember the wave of nausea whenever I saw him all too well and can definitely sympathise. Stay safe.",
            "Others have given you good advice.  I just wanted to comment on a couple of things:\n\n>John got weirdly close to my boyfriend and was staring at me, seeming like he was going to say something to me, but then he pulled back and my boyfriend and I walked away.\n\nUgh.  The only time he *didn't* inject himself into your life was when your boyfriend was there -- typical \"woman as property\" behavior.\n\n>From speaking with him, it’s clear that there’s not something quite “right” about him, and I have no idea if he would have violent tendencies if I were to tell him to leave me alone.\n\nMost people who are psychologically \"different\" are not violent, and are actually more likely to be victims of violence rather than violent offenders.  But you can't take a chance on it here.",
            "[removed]",
            "I just logged back in to my account after my post yesterday afternoon, and I am floored by the overwhelming number of concerned and thoughtful responses. I will try to reply to each response throughout the day. Thank you to everyone who was concerned and kind enough to write a response. I feel much better knowing that others have experienced something similar. ",
            "Read, \"Gift of Fear\" by Gavin DeBecker.",
            "If a piece of toast is stuck in your trachea, drinking water won't change anything - water goes into your esophagus. So they really didn't do anything... he needs to stop thinking that he saved your life.\n\nChoking requires the heimlech y'all, not water or patting someone's back.",
            "[deleted]",
            "**1**. The police won't do too much unless there is evidence that he's stalking you constantly, by which I mean more than just following you from the train station. \n\n**2**. Set your phone to record the next time you see him at the station, and tell him bluntly that you appreciated his help and understand that he might have some \"hero\" complex, b/c it was not a big a deal as he thinks it was in his head. Then tell him that he is making you uncomfortable and to leave you alone. \n\n**3**. If he says \"ok\" nonchalantly and leaves or gets mildly offended and leaves, then that might be the end of it. If he gets **very** emotional, either sad or angry, find an attendant and tell them immediately.\n\n**4**. Make sure he doesn't follow you to where you work, and watch for him on the metro train and make sure he doesn't end up at another stop you take. If he does either of these things, record it and then call the cops, b/c you have an obvious stalker situation, and now you have evidence.\n\n**I've dealt with a very similar situation**. Even though I'm a male, I take the metro to work everyday b/c my job is in the middle of the city and I live in the suburbs, so it beats driving in, when I was walking to my stop, these two women pulled up and said they were lost, so I gave them some help and went on my way. They u-turned and stopped me again and asked if I could come with them to show them and they would pay me for my help. This is normally how muggings happen, so I said I was a tourist and only knew the street names not locations of places.\n\nThey followed me to the metro and I noticed one got out of the car and got on the same train. I switched trains a few times and lost them. \n\nSo just keep your phone recording if you see him again, be blunt and if you know he's following you past the train station, then hurry to your job and tell them to call the cops and look to make sure they see what you see. Also, I'd recommend walking to the metro with someone, either a co-worker or your bf if you guys work close, even if you have to wait after work for them.",
            "He obviously feels an obligation to you. I would confront him with your bf. Just be honest,  \"look im grateful truly, but this has to stop.  I feel uncomfortable with your behavior.\" Or whatever you honestly feel. Im sure he's not a bad guy and it sucks that its turned out this way. ",
            "Hey OP I hope you read this because I see a lot of people are advising you to go to the police, yet the police are unlikely to be about to help you in this situation. Depending on how your state words the law, I doubt this person has actually met the threshold for \"stalking\", I'm not dismissing that he makes you feel uncomfortable, just pointing out the words like stalking have specific legal meanings. You should contact them and see if they can help. But if they can't here's what I suggest. \n\nHe may or may not be an actual threat to you. You should treat him as a potential threat, but remember he may just be mentally slow and like you.\n\nIf it's legal in your area get and carry some pepperspray/mace. \n\nA little primer on legally using spray; you can't just spray him if he talks to you again. He needs to do something that elevates him from creep to immediate threat. \n\nNow, if he does anything to try to restrict your movement (grabs your arm, tries to steer you by the shoulder etc) or otherwise presents an immediate threat (immediate verbal threat, fighting posture etc) then you'll want to spray him. The purpose of pepperspray is to give you a couple of seconds to escape, so spray and run. Once a safe distance call 911 and report the incident. \n\nMake sure you get a can of spray you can actually operate under stress, those Keychain  ones with the leather pouch are too hard to use under stress. \n\nI recommend the First Defense/Defense Technology Mk-6 (make sure you get the \"stream\" model), it's small but is easy to operate. Get two, practice with one (outside!!!) by spraying it at some cardboard. \n\nPepperspray is not meant to counter a lethal threat, like a knife or gun. But it's better to have than nothing. If you're a gun person and in a state where it's legal of course I recommend CCW, however the decision to carry a gun is not something you should do based on one reddit post. If you want to do that seek appropriate training and learn your options.\n\nBe alert at all times. \n\nMake sure when you're out and about you are paying close attention to your surroundings at all times. Your objective is to spot him before he can spot you. If you do see him choose an alternative path to avoid him. If an alternate path is not available try to find an authority figure to accompany you (eg metro security guard or police officef)  as you go past him. You can just explain that he's creeped you out a couple of times and would appreciate if they would escort you past him. They probably will. \n\nIf that's not available stay in a large group of people. The objective is to avoid giving him a chance at a one on one encounter. \n\nYour plan should go like this ALERT, AVOID, DEFEND, ESCAPE \n",
            "Don't you know you're supposed to fall in love with your savior? It's how every movie ever made goes. \n\nIn all seriousness... That's probably how he is thinking.",
            "Saying \"God put you in [his] life\" is a delusion. That's the dangerous part. Go to the police with written documentation of each incident. Maintain firm boundaries--\"I am not interested,\" \"Stop following me.\" Document this as well. Chances are if he's doing this to you he's done it in the past, so if you're reporting him he may already have a record, if not prior complaints. ",
            "Please, if you do nothing else, read the chapter on stalking in The Gift of Fear, by Gavin de Becker. It has extremely relevant information to your situation, and you could be putting yourself in danger by taking some of the other actions suggested in this thread.",
            "\"John, you did a wonderful thing by coming to my aid. I sincerely appreciate it. I hope that is something you would do for anyone you came across that needed help. That being said, I'm really uncomfortable with the way you are trying to insert yourself into my life. I'm grateful for your assistance, but that doesn't put me in any debt to you, nor does it make it appropriate to treat me as if we are familiar to each other. I told you I was in a relationship because I felt that was enough to suggest that I am not interested in a relationship with you, but perhaps you did not understand, so let me be clear. I do not wish to have a personal relationship with you. You are a stranger. Please respect that and do not try to create a relationship with me that doesn't exist. I do not wish to turn our encounter into a friendship or relationship of any kind. I appreciate your understanding.\"",
            "One-up his crazy religious stuff: \"Ahhh, sorry! God talked to me yesterday and said the choking situation was a one-time thing, bye and good luck!\"",
            "Ok so, I know the logical answer has been said, which is to be firm and tell him off and to go to the police, but I almost feel like he's not aware that he's making you feel uncomfortable. Maybe I'm projecting from a character in a show I saw, but maybe he sees helping you as brining his life meaning, and he's just unable to channel good intentions in a non creepy way? If you see him, maybe try letting him know that you're thankful and the best way to help is to help others. I agree with all the above posters about being firm about how his behavior makes you feel, especially if you think you are in serious danger, but I just can't help feeling like he's riding this high of saving someone's life and is absolutely clueless about how to continue helping. ",
            "[deleted]",
            "I just want to say that I'm sorry that you're going through this, and that I can relate to those feelings of resentment and frustration.  I'm going through something similar right now (without the life-saving part - someone has just been following me) and my most recent step was a police report so that they can officially caution him.  Other than confronting him yourself (which may not be a safe idea, trust your gut on that one), there is not much else you can do.  ",
            "someone who has \"run into you\" on this many occasions.. he sounds creepy and I'm betting he may already know where you live. That part about him coming up behind your BF is unsettling to say the least. Please be very aware of your surroundings and try to have a friend or your BF with you for a little while. If you and your BF have iphones, turn on tracking.",
            "Any update/resolution?",
            "If it was just at the metro I would write it off as a coincidence, but he is quite clearly stalking you.\n\nI was never in your place so I am not sure what to do, but you should take it seriously and its def not just in your head.",
            "I feel like I'd go to the police station/call non emergency number to make some kind of report. So you have something on file in case anything happens again. Much easier to build a case this way than retroactively. If for some reason they don't let you report anything, you could at least ask for their advice. I would also tell someone else in your life about him, like a friend or family member if you haven't already. Seems like these cases can be difficult to prove if need be, best to be overly precautions imo. ",
            "Call the police, they'll advise you to go to the station and make a report. Make the report, and then move about your day. They won't arrest him right away because at this point it's a he said she said thing. They might question him. \n\nIf you see him, and he talks to you tell him you're thankful for the help, but you're not interested in any kind of relationship with him. Say something like it was a traumatic experience and you need to forget it. I have a feeling he will insist that God put you and him together for a reason. don't argue or anything. Someone like that will surely fail to understand that walking away from someone actively dying is a crime, and it's perfectly reasonable that anyone in that situation would have helped you. tell him if you see him again you will make a report of stalking and harassment. You don't owe him anything. \n\nUpdate police, and unfortunately try not to go anywhere that isn't public or alone for a little while. You don't know if he's violent, or how far he's willing to go in a situation like this. Hopefully (and most likely) he will lay off. He might have a \"nice guy\" shitty outlook but once again, you don't owe him anything. \n\nHope this helps. God Speed \n\nSource: work with police/ personal stalker experience ",
            "Also try r/legaladvice",
            "I think a lot of advice in this thread would make things a lot worse. Go to the police! Just ignore him! Get a tazer! Hope it goes away! Overreact! Underreact! \n\nI think you can just be an adult and tell the guy that he's making you uncomfortable and that you don't want to pursue this any further. Act like an adult, treat him like an adult, and anticipate a positive outcome. If you feel uncomfortable doing it alone, take someone with you. \n\nYou've got to give him the message if you want him to get the message. I truly believe you can end this thing without drama or histrionics.\n\nEdit: Oh, so OP's already done that. Not like *that* was a crucial detail originally omitted.",
            "I've heard of this before, and although I'm no expert, I think it's pretty common. People who save another person's life feel responsible for them. You should do some research on it, as I'm just relaying what I remember, and really don't know the details. It could give you some insight into this man's motives. Everyone else here keeps saying he's a crazy stalker, but that might not be the case. I'm not saying that it's appropriate behavior, but he might not be a psycho. Just a regular guy who saved someone's life and is dealing with the psychological repercussions.\n\nEDIT: Ok, so I just realized that my theory came from Chuck Palahniuk's book \"Choke\". He's usually good about researching things like this, but it could be a completely made up theory. So, I guess if you can find anything on it, cool. If not, nevermind.",
            "[removed]",
            "Fuck politeness!  Stay sexy and don't get murdered.  His toxic masculinity ruins the party again!",
            "I know you've got a lot of advice already, and a few people have said something similar already, but from your original post you don't mention anything about actually telling him that you don't want to see him again. There's a lot of talk about go to the police cause he's a nut job, but if you haven't done so already, my suggestion would be if you see him again, and you're in a safe, crowded area, just calmly tell him clearly that you are not interested. \"Hi John, I appreciate what you did for me the other week, but I'm not interested in being in a relationship or being friends. I would appreciate if you would leave me alone please.\". THEN if he persists, call the cops, but it doesn't seem like he's actually done anything more than be a but creepy to date, and has not been asked to stop. ",
            "Tell  him to back  off, he's  incapable  of  understanding  so you may  have  to  use force. I definitely  feel  like  you will  have  to  use force because  he  obviously  doesn't  understand ",
            "a tip I learned from a paramedic who had been on a call the day before of a choking girl-never give a person choking on bread, water. It can expand in their throat and make it harder to dislodge. Its what happened to a young girl while eating at a restaurant he was called for, she did not make it. They still suggest learning the Heimlich  maneuver ",
            "Why didn't you tell your boyfriend when it was happening? I'd tell him to stop following you and then if he doesn't, go to the police.",
            "[deleted]",
            "[deleted]",
            "[deleted]",
            "Why don't you say you have a boyfriend and that other than family or other friends you don't have male friends because it's inappropriate. This may be a way to let him off easy so he doesnt feel vengeful."
        ]
    },
    {
        "post_id": "79iolm",
        "author": "nothanksgivingleftov",
        "title": "In laws [60s M&F] are upset I'm [29/M] not attending upcoming events for my late-BIL [was 34/M]. Wife [28/F] not supporting me on this.",
        "url": "https://www.reddit.com/r/relationships/comments/79iolm/in_laws_60s_mf_are_upset_im_29m_not_attending/",
        "score": 2188,
        "num_comments": 93,
        "created_utc": 1509306717.0,
        "selftext": "5 months ago, my BIL passed away from a heart attack. Since his death, my in-laws have been beside themselves, statements like “they never saw this coming” and “he was SO young, it could happen to ANYONE” have been common. The thing is, my BIL was not the paragon of health. Frankly, I’m surprised he made it to 34. First, my BIL lived with his parents and worked as a library assistant. He worked from 11-7, would get two large pizzas on his way home, eat the pizzas, leftovers at home, drink 1 or 2 2L sodas and smoke probably more than a pack of cigarettes (20 regular cigarettes) an evening. He hadn’t eaten a vegetable in more than 20 years – something he was proud of – had diabetes, a bad back (which is why he couldn’t exercise) and would help wind-down every evening with about a gallon of cheap beer. He’d wake-up at 8:45, microwave himself a few breakfast sandwiches/burritos (7 or 8) and would smoke another 10 cigarettes. He’d toddle off to work. He did that M-F, on Sat & Sun, he laid in bed till 2, watched TV, chain smoked cigarettes, ordered either Chinese take-out (meat only) or burgers, would drink beer from 4 until 1 or 2 AM and then pass out. He literally never left his room. \n\nBIL was warned by numerous doctors to get healthier, cut the smokes, stop drinking and to clean up, but he never did. Even when he got diabetes and spent almost a week in hospital, it didn’t phase him. He had begun to walk with a cane – he was only about 5’7 but well north of 350lbs. He didn’t drink water, he didn’t eat a vegetable, he lived in his room and was never, ever healthy. Last year, he suffered a major heart attack and required emergency bypass surgery. He barely made it through the surgery, he was so unhealthy that he nearly passed away many times during surgery/recovery. He spent 3 weeks in the hospital. \n\nHe got home and immediately resumed his habits. Just days after he got home, he was in bed, with a bag of cookies on his chest and an ashtray next to his bed. The home care workers tried, his surgeons tried, everyone tried to break him of his habit… Except his parents who didn’t want to upset their son….\n\nAnyway, a couple of months after surgery he died in bed. He had deteriorated rapidly, could barely move, had no energy, was white & gaunt and had trouble breathing. He refused medical attention and finally passed away. It was tragic, and everyone mourned. Since then, my in-laws have had their eyes-opened to the fragility of life and have been booking the ENTIRE family on events. I went along with it for a while, but it’s gotten excessive – we’re expected to be with them every Saturday (even when they just sit around telling stories about someone who never existed…); we’re expected to be there when they need support and they’ve began booking us for every holiday: Thanksgiving & Christmas are being renamed “BIL Remembrance Days”. No celebration but rather informal wakes will be held in his honor. \n\nI get they are sad and upset, but this is beyond crazy. My wife [28/F] has another sister [34/F] and brother [37/M].  They & their partners think this is getting out of hand. They’ve all pulled out of these events, but my wife won’t stand up to her parents. She’s the baby and doesn’t want to disappoint them. The thing is, it’s gone way beyond. My birthday involved my in-laws coming over and making a “speech” (more like a lecture) about how deceased BIL would love this party. It went on for well over an hour, attempts to stop them failed and finally my mother had to physically remove them. They apologized when it became obvious everyone was so uncomfortable that they left. \n\nThey need therapy, but they think this is all part of the grieving process. They refuse to talk to someone; they refuse to get help in any way whatsoever leaving my wife to carry the burden and for me to deal with their shit. They both informally “retired” but can’t afford it; they didn’t really do their taxes (so I’m dealing with it) and aren’t keeping up with bills, so I’m their financial advisor. I haven’t had a weekend to myself in 5 months and I don’t want to give up holidays with my folks, so my in-laws can make-up stories about their son. I've had to help my FIL apply for jobs; I've had to give my MIL prepaid visa gift cards to prevent her from going wild on spending. I've structured their finances in such a way that they are okay, but what they need is long-term mental help to get them working again. \n\nI know it sounds cold & callous, but I’ve hit my limit. How can I get my wife to take my side and deal with her parents who obviously need therapy and support? \n\n  \n  ---   \n  **tl;dr**: BIL ate & drank himself to death and has sent my in-laws off the deep end. I can't handle their crap, renaming holidays after my BIL and need 1 weekend away from them. Wife won't stand up to them as she's afraid to disappoint them. ",
        "permalink": "/r/relationships/comments/79iolm/in_laws_60s_mf_are_upset_im_29m_not_attending/",
        "comments": [
            ">I don’t want to give up holidays with my folks, so my in-laws can make-up stories about their son. I've had to help my FIL apply for jobs; I've had to give my MIL prepaid visa gift cards to prevent her from going wild on spending.\n\n**STOP HELPING SO MUCH.** Because you're driving yourself crazy, and they're not getting better. I'm not saying leave them hanging out to dry, but you don't \"have\" to help your FIL, you don't \"have\" to give your MIL gift cards. You can TAKE a weekend for yourself. Your wife's siblings have bailed on events, **so can you**. Your wife still insists on going? Great, she can go, *but you stay home*. At the moment the status quo is working, just about, for everyone except you. If you back out, even a tiny bit, everyone will have to rearrange things. But so long as you're picking up all the slack, there's zero incentive for your in laws to get themselves help, and there's zero incentive for your wife to rock the boat.",
            "Can your SIL and other BIL talk to your wife as well? I don’t mean in a “gang up on her” sort of way, but just having one of them call her to share their feelings about how their parents need actual therapy and how they’re not going to xyz event because their own families need them too. It might help her to hear it from someone else who’s in her exact position. Ideally she’d listen to you and your concerns right away, but it seems like she’s shouldering the parental grief so it might take more than you.\n\nThroughout all of this, you do not want to demonize the brother or the parents. Yes, his early death was likely preventable, but that doesn’t make his loss any less significant. Don’t talk about how anyone could have seen this coming or his old habits. That’s something the parents will sort out on their own if they ever get into therapy. It’s also horribly, horribly depressing having to bury a child, so their grief is understandable (but obviously not their coping mechanisms). Don’t frame this as all the things *they’re* doing wrong, but rather how everything affects *you.*\n\nExample: Wife, I have spent the last x weekends and all my free time helping your parents get back on their feet. I’ve done xyz and I am exhausted. I am not an accountant, a therapist, or a pension and neither are you. I am going to hit my limit soon. I want your family to be stable again, but *we alone* cannot be responsible for everything. It’s going to burn us both out and that’s not healthy for anyone. I can’t abandon my family for all the holidays and I can’t be at every single event. I need to recharge. We need to think of how we can help your parents get the support they need from systems and other people, not just us.\n\nAnd then follow through. Don’t take on extra tasks. Give them the contact information/instructions for things they can do themselves. When that weekend rolls around, ask your wife to leave the phones on silent and take a nice long walk. Breathe. Eat good food. Watch TV. Do what you need to do and invite her to join you because you’re both going to snap if you don’t.",
            "They enabled your BIL and now you’re enabling them. Stop helping them with their finances and entertaining their reveries. They need consequences if they’re ever going to change their own behavior.",
            "First, talk to your wife about how you are feeling, explain that your current behavior is enabling them, and tell her you need a break from everything that is happening. Encourage her to talk to her parents about counseling and tell her she should also stop enabling them. You should not need to sacrifice your own sanity to help others. ",
            "You don't need your wife to stand up to them. You only need to back off and start making other plans on the weekend. If you're close enough to your in-laws to manage their finances then you're close enough to tell them \"I'm going fishing this weekend, I'm burned out and I need a break\". ",
            "They enabled your BIL, and now you're enabling them. Clearly they are grieving, and utterly misguided in how they related to their son, but if they're otherwise decent people there's no need to be cruel to them so soon after his death. That being said, there's a difference between \"Sorry, I have other plans this weekend\" (even if those plans are to sit on the couch and read) and \"Stop acting like insane people!!!\"\n\nThe former is acceptable, the latter is not. If your wife wants to spend her weekends with her parents without you - honestly, I'd let her. I imagine that a short time of being the only one catering to their needs is going to be a wake-up call for her - when you're there as well there's someone to share the load. \n\nMake plans with your parents/other family for holidays. If your wife chooses to go elsewhere, let her. It will be hard, but as I said it's likely short term pain for long term gain. \n\nIf you're handling their money, try and put some aside for therapy. They need it, so be blunt about it: \"Yes, I'm pulling away. After your totally unacceptable behaviour at my birthday it's clear you need more help than the family can give you. I know you're grieving and it's awful for you, and I want to help you find better ways to cope. This is a better way.\" Don't get into arguments, don't respond to \"Did you want us to just ignore BIL at your birthday, to never talk about him again?\" Keep repeating, like a broken record, \"I want to help you find better ways to cope\".  ",
            "[deleted]",
            "Others have given good advice about managing your in-laws' life affairs and stepping back for your own sanity. \n\nAs for the \"every holiday is a rememberance\" thing...look, it's been five months. For the first couple of years after my stepson's mother died, he and his sisters dragged a big framed photo along to basically sit in for her at Christmas picnics, birthday lunches, all sorts of things. The first time, we thought it was sweet, then when it kept happening we thought it was a bit awkward and mawkish and emotionally counterproductive. We didn't say anything, though - as the \"other family,\" you really can't. Once we got into the second year we sort of thought maybe this was the new normal. But it did peter out. It took longer than we expected, but it stopped. Even people who want to stay in their grief as a form of remembrance usually do get carried out of it by time. I would say to pick your battles here. Focus on getting their rest-of-lives in order, if you can, and grit your teeth through the special occasions for a while. It will probably pass.",
            "get your BILs and SILs to talk to your wife. In regards to your ILs, stop helping. They have decided to be trapped in their grief and refuse to move on. You're not obligated to support them in this. find a financial advisor in the area and give them his number.\n\nAs far as your wife goes, \"I love you,but I can't and won't do this any more. Your parents need help REAL help.\" and go from there. Go see your own family this holiday season. Stop in on the in laws if you must but don't get dragged into the grief party.",
            "You yourself are enabling this madness. Draw a line on the sand today. This is not healthy or positive for any person involved. ",
            "First, I want to address something that you might find unpleasant - you obviously have some unresolved issues with the deceased BIL. You spent about half of your post detailing his various choices and health issues. Quite honestly, all of that isn't necessary to your broader question. The issue - not just as I see it, but based on your summary - is how to manage the relationship with your in-laws going forward. I'm not saying this to be critical of you. But I do think there might be some unresolved issues lingering that you might want to think about pertaining to the BIL. \n\nNow as far as the in-laws - there are a couple of phrases that I want to focus on. \n\n> How can I get my wife **to take my side** and deal with her parents who **obviously need** therapy and support?\n\nYou can't, and quite honestly you shouldn't want to. This, to me, is a dangerous mindset. People are complex. It's easy to look at other people's lives and decide how YOU (an outsider) would make different choices to repair what you perceive as the problems in their lives. The in-laws sound like they have issues they need to work on, but something you need to work on as well is this controlling mindset. It seems to either be cause or at least exacerbated by being put into the position of controlling their finances and other issues. \n\nYou can't control how the remaining family grieves. Death hurts, and can fuck up the lives of people left behind for years after the fact. My suggestion is for you to slowly move out of the position of responsibility and authority you are in now with respect to finances and everything else. That's step 1. Step 2 would be to work on finding a balance between letting them grieve in whatever process that takes with the needs you and your wife have with your family on holidays. Where I'm from, it's customary to alternate holidays with families. Christmas with my family one year, her family the next. Or, if possible, have \"family holiday\" on a day close to the actual holiday. But honestly, it feels like those are relatively minor issues that are incidental to what I perceive to be the biggest elephant in the room. \n\nI don't mean to come across as too confrontational or anything like that. But I do think your perspective on some of these issues is a bit off. I hope you know this is meant as constructive feedback from someone without any skin in the game. ",
            "This seems like a cry for help on their end. Try to guide them in the right direction - losing someone is extremely difficult, but there is therapy out there to assist with just that. ",
            "None of the stuff about his habits and lifestyle are really relevant here, and if you're letting your contempt for your BIL show with your wife and in-laws, it's not going to help you. They lost a son/brother at a young age, and it doesn't matter if he was really unhealthy--that's traumatic. Focus on how this is affecting you and your wife. You both need time to take care of your own needs and time to relax. You haven't seen your family and want to spend the holidays with them. You and your wife can't provide the support her parents need so it's time to call in some professionals. Enlist her siblings to help you talk to your wife about the situation. ",
            "Seriously this is ridiculous.  I know they’re grieving but it doesn’t require your participation every weekend when your wife’s other siblings have stopped attending.  Sounds like you and your wife need to go to counseling to address this.\n\nIf you have to go see your parents alone for the holidays then so be it.\n\nI don’t know how you haven’t gone crazy from all of this.",
            "Everybody has made some great points, so I wanted to throw in some scripts for you. \n\n\"Honey, I dont feel like working on (finances, taxes, copyediting someone's resume). \n\nSweetie, I feel like (hiking, boating, taking the kids to a corn maze and letting them tear around like maniacs while we revitalize the lost art of French kissing, etc.). \n\nMy love, I am feeling (super burnt out, exhausted, frustrated, etc.) with having no free time. If you absolutely need to see them, I absolutely need to spend a couple of days (catching up on home repair projects, vegging, sleeping in, taking my bike out before winter sets in). \n\nDearest, I really miss having time with just you and I. I know you're worried about your parents, but our marriage is important, too.\" \n",
            "This is my grandmother. She's crazy. I just leave with my kids when she starts in with the talk about my dad. He was 49 but did it to himself as well. \nI just have to stay away from them for a few months when it gets this bad. \nMy grandfather thinks she's bat shit crazy though, he's an awesome guy! ",
            "HOLYYYYYY CRAP. That is way too much. No wonder you have hit your limit.\n\nI don't think there's anything you can do to make your wife see it your way or get her to stand up to them. She can only do this when she is ready. What you can do, is set boundaries around yourself. \n\nYou do not have to go to events if you can't handle them or need a night or weekend off. If it's really important to your wife, she can still go herself. This doesn't mean you are not supporting her, but that you are protecting your own well-being. If you feel like you can make a compromise with her on this, maybe you can agree to go to a certain number of events, for appearances, and after that she can go without you.\n\nThis really should not be your problem to manage. They're not even your parents! I firmly believe that when in laws are toxic like this, it's on their actual child to manage this and keep their toxicity away from their spouse, and not expect spouse to manage it.\n\nIt's okay to set boundaries around this for yourself. You may get push back from your wife as she's so conditioned to give in to whatever they want, so be empathetic to her, but firm on what you are and aren't willing to do going forward.\n\nGood luck. Xx ",
            "Have you considered starting small, and suggesting your wife seek some grief counseling?  She lost her brother, her parents fell apart, and her whole life got turned upside down.  Why her brother died doesn't change her grief, and in fact knowing it was likely preventable probably makes it worse for her.  She's not making great choices and likely needs some help processing how to best deal with her grief in a healthy way, and learn how to set appropriate boundaries with her parents.  It's clear she needs some help, and you sound like you're maybe too overwhelmed and too involved in the situation to be able to provide her with the objective and uninvolved viewpoint she needs right now.  \n\nAnd it sounds like maybe you need some help too, in learning how to set healthy boundaries, compassionately communicate your limitations, and deal with the major disruption to your life that your brother-in-law's death and the resulting change in your in-law's behavior brought about.\n\nAlso, it's time to call on your wife's family for help.  If you guys have been seamlessly taking care of her parents problems, the rest of the family probably doesn't know the real extent of how much you've been taking on or how much work it's been.  Her siblings need to be helping out, and it's time to let them know you guys have reached your breaking point and need to hand some tasks off to someone else.  ",
            "Your BIL clearly had a mental illness. I’d be a little more sympathetic when you discuss his lifestyle. BUT you should not be forced to attend countless events & your in-laws are probably feeling guilty for not getting him psychological help. ",
            "You realize you have just as much ability to stand up to them as your wife does right? You don't need to have your wife agree on every action you take. That doesn't mean you should blindside her or not explain yourself, but you need to make a change and you do not need her permission to do it.",
            "They aren't so much grieving they are guilty of enablement in the first degree.\n",
            "Get therapy for you and your wife. Together and separate. \n\nConveniently doing so will also remove your availability for a lot of these scenarios. ",
            "It's all very well for people to criticize you for 'enabling' your in-laws, but you have to help them figure out their finances... the alternative might be that they want to live with you later when their money runs out. \n\nI found it easier to do things with difficult relatives when it wasn't a major holiday. Any other dinner and the pressure is off. \n\nTry to take some time off. Let your wife go alone.",
            "At first reading this, I thought “geez, this guy is inconsiderate. They’re grieving!” However, by the end of it I completely agree that this is out of hand. A lot of people say to stop helping them. I disagree. Step back, yes...but you can’t just abandon them. They are your wife’s parents after all. I would start by seeing if your wife would agree to counseling. I’m guessing there’s a lot more going on in her head than just being too afraid to stand up to her parents. Maybe once she’s doing better, she can help her parents through this. In the meantime, set boundaries. Make plans for specific weekends so the in laws have something to look forward to, but not every weekend. If your wife still feels like she needs to go, don’t stop her. Support her, but make it clear you aren’t joining.",
            "This isn't normal grieving behavior, I don't think. I mean, it's normal to still be sad about losing someone months, years, decades later. It's normal to want to talk about your loss sometimes, or even to get emotional at seemingly inappropriate times. It's NOT normal to try to hijack every single family event, and even make up new ones, just to talk about that person, for months and months.\n\nI don't think that his health in life is really relevant to the conversation; it has nothing to do with how sad they feel or should feel. They lost their son--the fact that they probably should have seen it coming doesn't make the loss any less painful or significant.\n\nCan you talk to them about their behavior? If you can, maybe tell them that you're worried about them, because they really don't seem to be coping well, but also make sure to set some boundaries with what you will and won't do for them. I think it's good to help them out from time to time, but you can't do everything for them. Right now it's like you're basically running their lives, leaving them totally dependent on you, which isn't good for either one of you. Also make sure to be clear that you need to put a limit on time spent together, and time talking about BIL because you need to take care of yourself and your own mental health as well. Tell them as gently as you can, it's not a punishment or anything for them you just need to take care of yourself.\n\nKeep working on them to get into therapy. Honestly everyone who experiences a major loss should go. There's nothing wrong with it, and they clearly need help processing their grief. ",
            "I think the part about his personal lifestyle is kind of irrelevant here",
            "A part of the problem, I am afraid, seems to be your attitude. This post displays a troubling resentment and lack of empathy. You spend three paragraphs describing your disgust for your now-deceased BIL in a very judgmental, dehumanizing way. This was a difficult read as someone who's struggled with weight my whole life. It seems you looked at your BIL and saw mainly a number on a scale and a set of bad habits, because there's very little insight in all those paragraphs about what kind of man he was on the inside, e.g. his relationships, interests, and personality traits both positive and negative.\n\nThere are too many armchair obesity experts in the world. The short of it is that maintaining a healthy weight really isn't as easy and clear-cut as just eating good food and excercising regularly. Genetics play a huge role and there are numerous conditions that work in various ways to make it easy to gain weight and hard to take it off.\n\nYour ILs are going overboard and making unreasonable demands. But grief always unsettles people for a time, and there is no greater grief, perhaps, than that of parent forced to bury a child.\n\n>They need therapy, but they think this is all part of the grieving process. They refuse to talk to someone; they refuse to get help in any way whatsoever leaving my wife to carry the burden and for me to deal with their shit.\n\nIt's understandable that your ILs' demands are getting to you. They shouldn't be leaning so heavily on you and your wife in any situation. However, this is *their* grief, not yours. It isn't your place to dictate how they should process their son's death or for how long. It's clear from your post you think your BIL brought his death upon himself. But, to your ILs, he was their *son*, not his weight or poor choices. They are mourning a *person* they loved and knew for 34 years.\n\nYou don't have to do as much as you've been doing for your ILs. Don't be afraid to say no or set firm boundaries. But, at the same time, your lingering fixation with your BIL's weight and life choices and your apparent resentment of your ILs' grief aren't helpful.\n\nYour wife's older siblings should also step up to the plate and do their part to help instead of dumping it all on her and you.",
            "This is why I have no issue giving an enabler shit, they need to realize they are hurting the people they love.",
            "Eh, at least give them the traditional year of mourning before you lose your shit. In most western traditions, that's the expected length of time for parents' public mourning - in other words, part of the traditional grieving process. Your feelings for the deceased are irrelevant; it's their child. It's only been 5 months. Support right now may be, in part, respecting a traditional public mourning period, so instead of trying to get your wife to take up your side, take up hers and support that a while longer while encouraging her to set them up with professional grief counseling as well, which surely can't hurt. You seem like you've been very helpful to them in holding their finances together during this time. And that should be sufficient - I'm not suggesting your sacrifice all your Saturdays to them, but a regular get-together and a handful of holidays this year isn't going to kill you. ",
            "Show your wife this thread. Her brother died because he and his parents did nothing to prevent his self-destructive behaviour and did not seek proper help from professionals. Now her parents are engaging in self-destructive behaviour and you and your wife are enabling it. Their physical health may not be at risk but letting grief dictate their, and to a lesser extent your, lives, will badly affect their mental health. What is the point in constantly rehashing his death if no one learns from it?",
            "> My birthday involved my in-laws coming over and making a “speech” (more like a lecture) about how deceased BIL would love this party. It went on for well over an hour, attempts to stop them failed and finally my mother had to physically remove them. They apologized when it became obvious everyone was so uncomfortable that they left.\n\nGods, that sounds horrific. My sympathies OP. I think you're absolutely in the right not to want to go.",
            "Look I am not going to give to the answer you want to hear but if you love your wife you should suck it up and do it for her. It is her brother and she obviously feels this is important. As her spouse sometimes you make the decisions that is shitty for you for the sake of your significant other. If you aren’t willing to do that for your wife maybe you should reconsider your priorities.\n\nSure you can not go and piss of the family but understand the position you put your wife in when you make these choices. ",
            "Unfortunately, you are being callous and cold.  ",
            "Frankly, I think you should worry about your relationship with your wife and forget your in-laws. It sounds to me like the marriage is in serious trouble, and you both need counseling if you want to save it. ",
            "Can I start off by saying that you articulated all of that very well, and from a calm and collected headspace it would seem. In your position, people lash out when describing those that are wrong or oblivious to the real issues. Although difficult I think it’s imperative that you communicate these feelings how you’ve written them, verbatim to the family you feel you are looking for understanding from, including your wife. I’m sorry if you’ve explained this to her like you wrote it out. Unfortunately on issues like this you may not see the outcome you prefer. You really can only control 2 things here; your attitude and your effort. You can either be passive, go along so you keep the peace and hope you can grin and bear it. This is not recommended. You should tell those you care exactly how you feel, and how their stance on this issue makes you feel. At that point if they still don’t see things how you do and are against you then you may need to set boundaries. There may be issues you will not see eye to eye on and it’s up to you how you handle your relationship with them from that point forward. \nYou’re in a tough spot for sure but I see where you’re coming from and you’re not wrong. I hope things work out for the best. ",
            "Sounds like your inlaws have numerous problems, the least of which being their out-of-control behavior regarding their son.\n\nIts time to disengage. Your in-laws need to learn to take care of and regulate themselves, BY THEMSELVES. You've basically been treating them like errant children that you hold final responsibilty for. They are adults. Treat them like adults. \n\n\"MIL, FIL, I am no longer able to manage your finances. I've given you a detailed budget, coping stratagies for poor spending tendencies, and boundless advice. But you're adults and I think you both can and should handle this yourself. Here's a starter packet of everything you will need to do so.\" (Budget, number for a few tax preparers, etc) Your in-laws are in their 60s. Unless you plan to manage their finances for the next 20 years, you need to force them to do it. \n\nIf you can, talk to your wife. \"Wife, I understand your parents are trying to process your brothers death. But what they are doing is incredibly unhealthy and deeply unfair.\" Explain why. \n\nThe reality is that if your wife doesnt see why this is a problem, your problem isnt with your inlaws- its with your wife. Couples counseling may be wise. ",
            "Trouble is - they will soon start alienating more and more people and will soon have no one to ever visit them . Best to try and stop this behaviour now before it gets too far or they will end up alone.",
            "Tell your wife what you say here. Get her remaining siblings involved in what really needs to be an intervention.\n\nThey'll continue grieving for a long time, but they're not doing it in a healthy way.\n\nHow were they affording to support his lifestyle? I find it hard to believe that as a library assistant he made enough to buy all that stuff and never leave his room. How did he work from his room?",
            "I think you and your wife need to see a couple's counselor. I mean, her other siblings have seen the light and have moved on, but your wife still doesn't get it. It's a tragic situation, certainly, but you both need to set healthy boundaries with your MIL/FIL.",
            "Repeat after me:  \"My BIL ate, smoked, and drank himself to death.  I refuse to celebrate such self-destructive behavior.\"    \n\nRepeat that every time someone tries to tug on your heart strings.",
            "I'm sorry but this made me really angry. My dad died on the table for his bypass surgery.  He was a healthy man. Ate his veggies, exercised... \nThis made me very angry ",
            "What does your wife want you to do - work yourself to death, and die of stress-related illness, in order to parent your in-laws and dedicate every holiday for the foreseeable future to having endless \"memorial services\" for this guy?\n\nI think she is expecting way more than is reasonable from you.  \n\nFurther, with all due respect to your wife, this not wanting to upset her parents is the same reason her brother had such poor health, which contributed to his death.  Her parents didn't want to upset her brother, so they enabled his unhealthy behavior.\n\nIt's got to stop.  She is unwise to sacrifice her marriage, and you, on the altar of appeasing her parents.  Your marriage should come first, and honestly, she is not helping her parents grieve by helping them have a whole parade of memorial services.  It does nobody any good to have them transfer their unhealthy behavior from your deceased BIL to you.\n\nIs there some way you can transfer the financial advisor stuff to someone who does it for a living, and get it off your plate?  I would also tell your wife that you are not attending any more memorial services for her brother, and if that's what the holidays are going to be, celebrate with your own family or friends.  Or maybe her siblings who are done with the whole memorial service thing.\n\nOne form of abuse is for someone to act helpless to try to make someone feel obligated to them.  Are her parents really incapable of handling general life stuff, or are they just extending their \"grieving\" so that they \"need help\"?  I don't know, I'm just asking, because this seems really odd.\n\nOh, and just as a comparison: the people we consider family who live near us we see about once a month, which includes about half the major holidays (Christmas, Thanksgiving, Labor Day, Memorial Day, 4th of July, New Year's Eve.)",
            "Jesus Christ! Are they on Reddit? They should read this. ",
            "It sounds like they are sucking the life out of you and making their problems, your problems!!! Be honest with your wife (maybe choose the words because family can be a sore subject!) and pull yourself away slowly. They have other children who should be helping them too. They should help themselves. Good luck ",
            "You know you should stop enabling them, but that isn't easy. Your in-laws need *professional* help. A social worker may do what you are doing without the emotional burden crushing them and you wouldn't feel that you've dropped them like a hot potatoe. Contact your family doctor as they should be able to point you in the direction of professional resources available.\n\nYou can't force your in-laws to accept professional help, but you can no longer help them as what they need is above your pay grade. Enabling them is keeping them from the help they need. It may feel counter intuitive as you put in so much effort, but enabling harms.\n\nConsult your family doctor as that will also be a clear signal you are burning out from the stress and work. You need to quit to protect your health. Your wife may feel responsible for her parents, but you can no longer help. She should take this signal serious. You can't change how she feels, but you can communicate clearly you can't continue as it is now harming your health. Take the effects of stress on your health serious. If your wife has trouble with how she feels about her parents and her brother's death, there is professional help for her too.",
            "Make grief counseling a mandatory part of you continuing financial advisement. There are people specific to the field. Speak to such a person yourself for advice on how to introduce the therapy into the situation. ",
            "I can definitely see where you're coming from.  Parents aren't supposed to bury their kids,  and some help for them is necessary,  but you've done more than your share.  It's time to sit them down and tell them that they have other children that need them desperately.  They don't need to forget their son,  but they need to remember their other children too.",
            "Set and enforce hard boundaries, not just with your inlaws but with your wife.   Stop helping them or going to their events.",
            "These are grown adults. It's been 5 months. They need to get their shit straight and they won't as long as you and everyone else keep humoring them. At this point, it's cruel to keep enabling their insanity.\n\nJust stop.",
            ">How can I get my wife to take my side and deal with her parents who obviously need therapy and support?\n\nyour wife needs therapy too. You can be of emotional support but it's obvious she needs professional help that you are not trained or qualified to provide. Once your wife learns how codependent she is and ways to manage her emotions in regard to her parents/family, she will be able to set boundaries with them. Then, it won't matter what her parents do or don't do, because it will not have a negative impact on your life. So require your wife to get therapy. And for yourself, pull back on helping them so much. Refuse to engage in all these weekend get-togethers, and refuse to give up holiday time with your own family.",
            ">they didn’t really do their taxes (so I’m dealing with it) and aren’t keeping up with bills, so I’m their financial advisor.  \n\nStop your own enabling before you worry about your wife's",
            "You need to tell your wife in a way which helps her understand that this is now a problem for *your* marriage. Its not just a parents being parents thing anymore.\n\nI'm conscious that your wife is probably grieving her brother so you don't need to go in hard. But you do need to be firm in that things need to change. If it was my siblings, I would listen if my other sisters and SO were all saying the same thing - so can the older siblings help at all? \n\nIf not, and I'm a little reluctant to get them involved anyway, then its time for a long talk about how you can help the parents without sacrificing your time, money, life and well being. Tell her how its making you feel. Tell her that you can't keep going on like this. Have suggestions of financial advisers, recruiters etc to see what you can do that isn't your own time and money",
            "You need to be an @$$h0le here and tell your in laws that their resistance to get help (therapy) is the same reason why your BIL didn't seek help and died because of it. \n\n",
            "[removed]",
            "Be a reasonable and a free thinking man and give her a dilemma - it's you or them. That will teach her a lesson, to appreciate you more."
        ]
    },
    {
        "post_id": "ovsci3",
        "author": "cthrowaway12345678",
        "title": "I (29M) need to establish some new boundaries after my mom (57F) was aggressive towards my wife (28F). Would it be appropriate to talk to my dad (57M) about it first?",
        "url": "https://www.reddit.com/r/relationships/comments/ovsci3/i_29m_need_to_establish_some_new_boundaries_after/",
        "score": 2187,
        "num_comments": 225,
        "created_utc": 1627825365.0,
        "selftext": "My wife is pregnant and my mother offered to throw her a baby shower. This has now turned into a dramatic nightmare. My relationship with my mom is already strained because she has never been a kind person, and she has some narcissistic tendencies. This week she told my wife what she planned on doing for the big food item at the shower. My wife said it sounded good, then said if my mom still needed sides and treats, my wife found a mom's craving table idea, and sent 4 snack-like items she has been craving. My mom then snapped at her and said \"Did I ask for your input? Why don't you just show up and be happy?\" We were very taken aback and I have no idea where it came from. It is kind of the last straw and I want to set some new boundaries. My mother needs to know that she doesn't get to see her grandchild unless we say she can, and for her to be invited she cannot act like that. Would it be appropriate to talk to my dad about this first? My thought is I want to explain that he didn't do anything wrong and I'm sorry if this affects how much he gets to see his grandchild (my parents are still married)\n\n\nTL;DR on top of an already rocky relationship with me, my mother was aggressive towards my wife out of nowhere, and new boundaries are needed. Would it be appropriate to talk to my dad about my thoughts first?",
        "permalink": "/r/relationships/comments/ovsci3/i_29m_need_to_establish_some_new_boundaries_after/",
        "comments": [
            "No.  You go directly to your mom and you do it without your wife present.  You can speak to your parents together, but you tell them the boundaries and why and you also, with the wife’s permission here, tell her the shower she is throwing is cancelled, or you just won’t be there.   I’m surprised you haven’t said anything to your mom in that moment or yet about the way ag spoke to your wife.",
            "I would not ask my dad. I would tell him the new boundaries and why. I would also cancel any baby shower hosted by mom.",
            ">My mom then snapped at her and said \"Did I ask for your input? Why don't you just show up and be happy?\"\n\nIf my MIL said that to me, I wouldn't show up at all. \n\nStand up for your wife, on your own. If you have your dad try to run interference and reel his wife in, she probably won't take him seriously and will continue to treat your wife like shit.",
            "I have been in your wife’s position, my Mother in law has done some nasty things. I would defiantly suggest NOT going to your father first. Instead talking to both of them, without your wife present. I say without your wife because there is a chance your mom or parents, will say some horrible stuff about your wife. It’s not that your wife shouldn’t know what is said, it’s that it is YOUR job to deal with your family. Your wife has enough to deal with, this is on you. So get that backbone of yours ready to be taking some pressure. And be prepared to stand your ground.\n\nIt is common for family to remember and treat us like we are at a certain age, usually to exert power and control over us. ie treating you like your 15 because at that age your mom had power over you. \nDon’t fall for it, you are and adult and about to be a father. Stand up for yourself and demand to be recognized as a adult. Expect to hear your mom say “ I am your mother.” “ you have to do what I say.”  She is not going to want to give up her power, especially if she has Narc tendencies. She may cry, scream, plead, and demand, but you can not bend. So have a plan before you walk in there and stick to it. \nYour father may choose to stand by his wife, that is his choice. Or he may side with you, he is an adult it is his choice. \n\nRegardless of what your dad does it’s  time for boundaries. I would suggest putting your mom and dad in a “time out.” Yes both of them, they are a couple they get to be treated as one. \nThe point of “ time out” is that you and your wife has zero contact with your parents. None, they don’t call to bother or stop by. They get to sit over in their area being quite, because your mom did a bad thing. This allows you and your wife have a set amount of time ( at least 3 weeks) so you two can come up with boundaries that you want away from your mom.  I say 3 weeks because the first week or so there is a chance your mom is not going to behave well. This will help be an indicator on how Strong your boundaries need to be. Expect calls, from not only your mom but other family members as well. All with the intent on trying to shame/ guilt you back into line. DO NOT fall for it, stand strong for your family.\n\nIf you ever need support or a place to vent r/JUSTNOMIL is a sub for people with difficult moms as well as Mother in laws.",
            "Good luck with this one!  I feel so sorry for your wife.  I did not have a narcissistic mother but I did have a narcissistic sister.  At one of her grandchildren's birthday parties she showed up with a clipboard and expected all the mom's to sign some petition she was passing around.  And we could go on...\n\nIt would be appropriate to talk to your dad about it, but don't be too surprised if he can't take your side of the story.  He has been putting up with your mother for a long time.  His attitude may be, \"Oh that's just how she is.\"",
            "Are you afraid of your mom?  If not why do you want to talk to your dad first?\n\nYour mother needs to know she can’t treat you or your  wife badly.  \n\nI think you are in the wrong sub — you should be over at justnomil.\n\nIt is your job to protect your wife and your kids FROM your mom.  You deal with it.",
            "Jesus tell your mom she has been uninvited from the babyshower. It is a perfect way to start new boundaries. It is not that hard to move it to another location Even if invites are out. \n\nIf you just talk to your mom she will either see that actions dont have consequences and/or ruin the babyshower.",
            "Seriously OP, cancel the shower. Contact anyone who's been invited and let them know that it's not a good time for a shower. I'd mention how your mom is the cause because she's sure to try to spin it and blame you guys and you don't need flying monkeys coming after you. It's up to you if you want to give your dad a head's up or tell them together (would he back you up if you gave him advanced warning?) But tell your mom that you're canceling the party because of her actions and if she doesn't treat you guys, especially your wife, better, then she'll be lucky to even meet her grandchild. \n\nIf she plans on going through with the party, I like how someone else suggested throwing your own shower at a different location on the same day/time and tell people there's been a change of location and if they want to celebrate with you and your wife, they can come there. Still, let people know your mom has overstepped so she can't spin her own tale.",
            "No. You can tell your dad after the fact. If you mom is in her 50s and still acting this way, clearly your dad either isn't trying or isn't able to restrain her.  It's OK to set boundaries with your mom and it shouldn't be delayed.\n\n If you want to make it clear to dad afterwards that you aren't trying to restrict his access, that is fine, but keep in mind he may decide to exhibit enabling behavior.",
            "You need to stand up to your mother, asking your father to do it for you is a sign of weakness.",
            "First, congratulations to you and your wife on your baby! \n\nHonestly, I would cancel the baby shower. Seriously. It doesn't matter if invitations have been sent. You can let everyone invited know that you're sorry, but it's cancelled.\n\nThat is, of course, if this is what your wife wants. I don't think she should have to be subjected to a shower under these conditions that your mom has created, but it's her choice. Good for you for deciding to set more boundaries with your mom.\n\nIf she agrees, then YOU tell your mom that you/your wife won't be there and that it's cancelled. If your mom insists that it's not cancelled, stay firm that you/your wife will not be there. Period. If your mom doesn't need ANY input from your wife, then she doesn't need your WIFE there. Take this opportunity to be explicit about your boundaries. And stick to it.\n\nYou let everyone know by mail that it's officially cancelled. Don't count on your mom to do it.\n\nThen, a friend of your wife can host a baby shower later - before or after the baby is born. \n\nBest wishes!",
            "You’re an adult, you don’t need to ask permission to set boundaries",
            "This is where you walk the fine line of being kind and enabling bad behavior. I understand your desire to involve your dad, but your concern should be for *your* family unit. Set boundaries and enforce them; this is a good opportunity to do so. Sit down with your parents together and explain 1. what's changing and 2. what the consequences are for crossing the boundaries. You don't even have to get into why or past behaviors, and in fact, doing so would give your mother the chance to deflect her behavior. Regardless of how you handle this, be aware that your mom could have a very adverse reaction and take it out on your wife.",
            "A heads up to your father isn't a bad idea. But that's what it is, a heads up. A courtesy to him. YOU still need to have that conversation with your mother. Drawing lines in the sand, setting boundaries, ultimatum, whatever you decide to call it, you need to do it. Do it for your wife, for your relationship, and tbh for you. \n\nAlso, talk to your wife. Now especially, she needs to know that pissed you off. That you are not going to let that happen to her again. Wife might try to talk you down or back you off; it's really not a big deal, it doesn't matter, pregnancy hormones has me feeling it was a bigger deal than it was. Validate that within your own feelings; maybe it wasn't so bad in the big scheme of things but I'm not going to let anyone speak to my wife and mother of my children in such a way. \n\nI'll say from my own experience it won't get any better until you take a hard line with Mom. It'll suck for a while, it'll hurt for a while, you'll feel guilty for a while. But that's part of it. And you can still sneak granddad by every so often.",
            "Definitely narcissistic. The baby shower isnt about her, prioritize your wife and baby, shes probably already stressed about giving birth. Cancel it if your wife is not comfortable with it, throw one on your own terms.",
            "I’m not sure I would tell her she can’t see the baby. That will escalate the argument really quickly. I would start with “My wife was excited about the shower you were planning for her and wanted to show support so it was really hurtful when you snapped at her. I will not accept my wife being treated that way and would appreciate if you would apologize to her.”\n\nIf she balks at that, that’s when I would start setting up the boundary of not seeing the baby.",
            "\"Hey guys My Mom decided to be nasty to my pregnant Wife so shower is cancelled and will be rescheduled by someone who can support her and make the transition to motherhood stress free. My Mother is incapable of that since my Wife is unable to give any preference on snacks at her own shower. Sorry for the inconvenience!\"\n\nThe end. If you know your mother is unkind why would you allow her to handle anything? You put up a big ass boundary right now by a big public display of \"fuck you Mom\" and have a low-key shower without the stress of her.",
            "By still letting her have the baby shower you’re telling her that her behavior is acceptable and that you’ll tolerate it. So I’m the future she’ll keep pushing and pushing. That was extremely rude to say to your wife and she needs to acknowledge that and apologize. Period. If not, just go no contact. You can still talk to your dad and arrange for him to come over. You really should’ve put your foot down right when she said it…I know it caught you off guard but not saying anything just further deludes her into thinking her behavior is fine. I feel really sorry for your wife…you have to protect her.",
            "I've read the post, comments, and your replies. It doesn't matter that invitations have already been sent. You cancel it or have your own and do not show up at the one your mom planned. \n\nFirst off, your mom knew what she was doing with that comment. To continue to have a baby shower with your mom or to even have your mom at the shower LETS HER WIN and thinks she could continue to do this. Second, this is a party to honor and love your wife and baby. It should 100% be your wife's decision on what food, decorations, style, location, and guest. If your mom says otherwise she is lying to you and trying to gaslight you guys. \n\nThis is where you start the boundary. You move the baby shower to a new location. Let guest know. Then YOU call your mom and say \"mom. That behavior was uncalled for and rude. This baby shower is for wife and her request and opinions matter for this event. Because of your behavior you are no longer throwing a shower for us and we will not be attending any shower you are involved in\". \n\nHere is the thing. Your mom will \"melt down\" over this. It may look a different depending on what she thinks she can get away with. Because she knows that if she puts out a big enough fit then you will bow down. And it's time to show her that she cannot control you or manipulate you.\n\nBecause that's what she is doing. Harsh words and abrasive comments are used to make you back down. Tears, anger, threats are also tactics used to make you change your mind. \n\nBe prepared for:\n1. \"How could you do this to me! I'm your mother! I've done so much for you and just want to do this one thing for you\" - this is guilt. \n2. \"Fine! I'll never do anything for you ever again!\" - guilt/and threat\n3. \"I guess I'm just such a bad mother\" - guilt\n4. \"If you do this to me I'll never do anything for you ever again\" - threat\n5. \"I just wanted her to be grateful! I'm spending so much money and can't afford the extras she wants\" - this is a \"im not worng\" manipulation tactic. If she couldn't afford it, a normal response would have been \"I've spent a lot on this already. I might not can make that work, but I'll see what I can do\". So do not allow your boundaries to drop with this statement. \n6. \"If you do this, I'll never help with the kid\". -threat. And she is lying. Women can't stay away from babies. \n7. Or just be prepared for her to turn this around on your wife with \"I didn't say that. She misunderstood me. What I meant was.....\" - don't fall for that. Thats the classic narcissist phrase move. She is trying to damage control. \n\n\nAlso think of how to respond to all these statements. Maybe another redditor can help. \n\nBut whatever you do, don't go to that shower.",
            "This is hard. Normally I would say no, but talking to him first in this situation could be very helpful for everyone if it is safe to do. Not least because it gives your father a heads up about an impending storm. \n\nIf you think he has the sort of relationship where he is able to keep that info for himself, yes talk to him first. If he tends to get bullied around by your mother, and you think it’s something she’d drag out of him to weaponise within their relationship… maybe make time to sit down with him afterwards to explain.",
            "Cancel the shower\n\nmom is in time out\n\nget through the delivery, read lemon clot essay\n\nmom can maybe see at Christmas if there are no further attacks",
            "She said it to your pregnant wife, in front of other people, and you... just sat there...\n\nYou can't control other people, but definitely have agency to control yourself. It is important that wife feels safe during pregnancy, you are supposed to be wholly on her side.",
            "There's a sub, r/JUSTNOMIL that would have really helpful ideas for boundaries and wording. It's up to your wife to be present or not when talking to your parents and I wouldn't talk to your dad first. A sit down discussion of this isn't acceptable and here are our boundaries and the consequences if they aren't respected is what needs to happen. You and your wife can decide if they get those consequences as individuals or as a couple. You can explain you aren't asking for anyone to choose sides, this is how it will be for your family. End of discussion.",
            "Well I think it would be patronizing to go to your dad first because he’s not in control of her, she chooses her own actions. Why should dad be held accountable for mom’s behavior? What he should be held accountable for is being complicit in mom’s behavior. Confront him about enabling and not protecting other people from harm at her hands. If he doesn’t enable and does try to protect others, then keep him out of it. \n\nIf he straight up controls her and she’s his puppet, then yes.",
            "Dude, you said at thr very beginning of your post that your mom has never been kind, and she has narcissistic qualities.\n\nYour answer is right there. \n\nWhen dealing with narcissistic people, *strong boundaries with consequences* are your best friends. \nYou will need to (for lack of better word) train your mother how to act. \n\nStep on over to r/JUSTNOMIL and check out their side bar.",
            "Do 2/3 of what your mom asked. \n1/3 : don't give any input. \n0/3 : don't show up in shower. \n1/3: be happy.",
            "Your mom is absolutely rude. Your wife should absolutely have an input in her baby shower even if someone else has offered to organize it. \n\nWhy would you have to speak to your dad first? Go directly to your mother and confront her shitty behavior. \n\nHonestly, if I was your wife, the party would be canceled.",
            "You should take this over to the justnomil sub, they will know how to help you. However, it is a very woman dominated sub, and they tend to take things a bit too far sometimes, especially when a man is asking for help. Remind them that you are on your wife's side, and that you need help with setting boundaries. It sounds like this is a new concept for you, it is definitely better to get this sort of situation under control before the baby comes.\n\nCongratulations on the new baby, and I am sorry you are going through this with your mom. Good luck, op.",
            "I think you need to give a stern \"here's where the boundaries are\". IF you let her continue that behavior, it will be more justified in your mom's mind. Let her know that her actions were not ok, and she needs to apologize for it.  \n\n\nRegardless if it's your mom, or a friend, or some stranger, there's a thing called common courtesy.",
            "Cancel this baby shower and let your mom know she can't speak to your wife like that if she wants to be in your life. No need for any extra steps.",
            "100% talk to your mom alone about how awful she was, and on top of that, talk to your wife and then cancel/bail on the baby shower.  F*** THAT.  Your wife should not have to have a special moment tainted by your mom being there.",
            "Go directly to your mom. Cancel the shower. Who cares if invit d have been sent out.  She needs to learn there are consequences to her actions\n You shouldn't have to cross your own personal boundary of self respect just because of the inconvenience of tellin people the shower has been rescheduled.  Things happen.",
            "“We have no idea where it came from” - Yes you do.\n\n“-She had never been a kind person and she has some narcissistic tendencies” \n\nThis is who she’s always been. I understand where you may be surprised at how she could act like this over something so sensitive and meaningful, but it’s who she is. I feel as though you should stand up for your wife regardless of your father’s input. Talk to her alone, and lay it down for her. Tell her straight out if she wants to be involved, she WILL learn how to hold her tongue. Your wife and your baby are your family you chose and created, your mother needs to be more respectful towards that.",
            "I wonder if your mom is a very insecure person and being told she needed to add some items to the party food triggered her anxiety about not being good enough at things other people do. So she covers up her fear and anxiety by getting angry. Maybe someone else in the family could bring the additional party treats.",
            "Honestly if I were your wife, i would’ve already left. Ain’t gonna deal with family in law like that for rest of my life. \nWhy don’t you go talk to your mom directly? \nHonestly I’d say if you talk to my wife like that, you’ll never see me and my kids again.",
            "There is some very good advice here on cancelling and setting boundaries.  One more thing that I would like to add as a side note is to make sure you set up the guidelines from the hospital when you deliver.   Keep her out of the delivery room and away from your baby.  You can do that.",
            "Is your dad your mom's parent as well? Then no. He's not responsible for her behavior, she is. No need to filter info to her. Kind of insulting and counterproductive to boot.",
            "This reminds me of when my two dear friends offered to throw me a baby shower. They invited my MIL to help because they thought it would be a nice gesture for her to be included. I spent time going table to table, chatting with guests, playing baby shower games, opening gifts, eating, etc. I didn't have my phone out and I did not take any photos, one of my friends offered to be in charge of that. \n\nA few days after the shower, I get a scathing phone call and accused of not appreciating my MIL and all the money she spent because I didn't include her in the pictures on Facebook...pictures I didn't take... in a post I didn't make... 36 weeks pregnant, sobbing hysterically... I had no clue (still don't) how it was my fault or only my responsibility to ensure I took a picture with her so that HER friends and family could see on Facebook all that she did for me... \n\nShe's going to hold this over your wife forever. \"I did all of this for you and this is how you thank me\". She's not doing it out of the kindness in her heart or love for your wife and her future grandchild. She is doing it for the recognition she feels she's deserving of for doing it. Just like my MIL. \n\nI highly suggest you take her off as the host. You said you can't cancel because people from out of town have already been invited. There's still time to change the plans since the event hasn't happened yet. You won't regret a last minute change. Trust me. If I could go back and do my baby shower over, I would insist my friends not invite my MIL to help.",
            "OP, you're the first post I find in which the SPOUSE PROBLEM is actually asking a question. You mon was aggressive towards your wife WHO IS PREGNANT. Your mom has always been like this and your dad has enabled her for decades already. I don't think you will accomplish much by speaking to him. So go to her BY YOURSELF and lay down the law now. You have a baby on the way, grow that spine already. And cancel the shower. Your mom does not deserve to show off in front of family and friends at your and your wife's expense.",
            "I think this needs to be a family meeting.\n\nOn a side note: is your mother the attention-seeking type? It seems to me like she's throwing the party more for herself than your wife. Surely your wife (the mother-to-be) is the focus of the party? If she was craving onion and banana pizza, then get the lady what she wants. It's for her, after all.",
            "So your mother was publicly nasty to your wife and you just stood there? It wouldn't have felt good to be unnecessarily snapped at like that with nobody to stand up for her. \n\nYou know what your mother is like. You might be used to that \"unkindness\" since you grew up with it. Your dad probably enabled it, since it's easier to not rock the boat with narcissists. I doubt your wife is used to it and neither should she be expected to. Your wife is now your priority. Not your mother's or father's feelings.\n\nPeople are supposed to deal with their own parents. So if your wife's parent was unreasonably rude and aggressive to you, it's your wife's responsibility to shut that down. So it was your job in this case and you failed. If it happens again, call her out on it right there and then. Make a public showing of you standing with your wife and not standing for her being disrespected.\n\nIt may just have been stress that your mother reacted inappropriately to and will apologize. Hopefully. But if she refuses to see it that way or denies she was inappropriate, you might have a problem when baby comes. Prioritize your wife always.",
            "you should head over to justnomil for advice",
            "Keep frozing and doing nothing and your wife will leave you. \n\nThat's what i would advise your wife if she come back here and told us that you just idly stand by as your mom insult your pregnant wife in the open. \n\nGrow a fucking back bone and tell your mom what's up.",
            "you need to cut off thag umbilical cord you have attached to her. stop catering to her ego. you're fucking grown now.",
            "I dont know what your past with your mom is like, but if it was me with my mom, I would start with a conversation and ask for an apology.  What she said was rude, but not horrific.  If she can apologize, then I would forgive.  If she cant apologize, then I would move the baby shower.  I wouldnt tell her she cant see the baby over this - that sounds way too harsh.",
            "Nah directly to your mother  in front of your wife to show dominance",
            "It seems like there must be more to the story. I mean, is it not considered rude that your mother is throwing a shower for your wife and your wife is asking for a craving table? I think that's rude. If someone threw a shower for me, I would graciously accept what they offered and not be trying to pry more out of them. And then you said that if Mom is going to act that way she's not going to be invited. You mean she's not going to be invited to the actual shower that she is throwing? I feel like I'm missing something here",
            "My Mom is the same way. Found out she is hooked on Oxys and already is diabetic and has had surgeries. \n Has always caused friction due to her inability to just keep her unkind comments to herself. Took my xgf to visit my Mom which is 6 hrs away for Thanksgiving. X offered to help cut up potatos. she did but mom commented. \"who cut these?! theyre too small!!\" X was flabbergasted that she would ask who when she stood beside her amd watched her cut them. 10 years later ive moved back to help her pack and she still makes those kind of comments. \n Was at my Grandmothers feast and the sacred fire was burning and i was sitting with relatives i hadnt even met yet and my mom loudly says. \"i cant sit near the fire the smoke bothers my asthma!!\" I was kinda embaressed and wondered why she had to proclaim so loudly her dislike of the smoke especially when it must burn for 10 days and its sacred. After being around my mom for a month i realize she is really fucked up and i know its because of those damn pills. She arguementive and passive agressive. She wont wear her hearing aid and i must yell to talk to her, she used to get mad me when i was little because i didnt speak loud enough, could be because she liked smacking me n the ear when she was driving. When she didnt hear she stills give me a diry look and says \"huh??!\" \nShe did things to my brother and me that would shock you. Yet we still want to help her. \n I feel like im teaching a child morals and proper manners again. Just brutal. Ive told her 3 times in the last 2 wks to stop referring to people of Pakistan and India decent as \"pak$&\" Im Ojibwe and my Mom is half Ojibwe and Irish: I grew up with trafitional Ojibwe values but she acts like a racist white person and it fuckin depresses me. So im thinking its pills and dementia. These posts on FB keep popping up in my feed not to make our elderly parents feel guilty about the past but fuck its really starting to irritate me that im 45 and my mom 65 is a complete narcissist and has BPD. Im losing interest in takjng care of her now because of the oxy addiction and up and down behaviour. Ive worked with pill addicts and always found them people i just did jot want to associate with ecause of their sniffing/snorting jerky and rushed movements. So she is most likely a pill addict and a Karen.",
            "Sounds like your mum has rubbed off on you with you using her grandchild as a weapon.",
            "You've been way too sheltered.",
            "Baby showers and wedding-related stuff have gotten ridiculously complicated over the last thirty years. \n\nA baby shower used to be a bit of crepe paper and a cake. There was no such thing as a bachelorette. A wedding shower was a bit of food but no decorations. \n\nIf a person hosts an event I'd say they get to choose what the food and decorations will be. Your wife was wrong to bring up her Instagram fantasies of a shower because your mother probably did not sign up for that. She may think that it's pushy and a complicated shower is not what she had in mind.\n\nIn strict etiquette a relative is not allowed to throw a shower because that's like begging for gifts. All those people telling you to have your own shower are completely out of line. \n\nYou can use the etiquette rule to shift it to a friend's house. There's also nothing wrong with multiple showers with different friend or relative groups.\n\nDo not escalate the situation.",
            "I think you need to talk directly to your mom. You can ask your dad for advice on how to approach it but in the end you will need to talk with your mom.",
            "This could go either way. It depends upon how sane your dad is going to be about this.",
            "FYI- your mom is doing this shower for herself, your wife is only the excuse for having it, so she's expected to only play her role In your mother's shower.\n\nIf you have a relationship with your dad that isn't overshadowed by your mom, I would have a frank discussion with him.",
            "I would simply set your boundary with your mom to them both at the same time. The fact is, you are setting these boundaries with your mom, not your dad. He hasn't done anything wrong and frankly, it sounds like being married to her is punishment enough. So instead of doing the whole sorry, you won't get to see your grandkid cause of her - you can simply say - dad, these boundaries don't apply to you if you want to visit on your own. That leaves the ball in his court to decide if he wants to foster an independent relationship with your family or if he's going to stick by his wife's side on this. He's grown, let him figure that out himself.\n\nAs for your fears about your mom's potential retaliation/outburst. Remember this: it takes two to tango. She can't flip out on you if you don't give her the access to do so. \n\nYou can state your boundary verbally and if she starts flipping out, leave immediately. If you didn't get out all the words you wanted to before she went apeshit, send the rest of your declaration via text message. You can also set a boundary with her that you will not be responding to any communication that is aggressive or rude. She needs to communicate in a calm and considerate manner if she wants to get a response. End of story. So this way, you're not cutting her off, you're just setting strict rules about how she gets access to you.\n\nThere's a psychologist on YouTube called Dr. Ramani who does a series on narcissists. One of the things she refers to is called the narcissist's supply. Narcissists gravitate towards people who give them that attention and time of day to act out upon. If someone doesn't provide that \"supply,\" they eventually lose interest as it's not giving them the attention (positive or negative) that they so desperately seek. If you learn to just walk away, put her number notifications on mute, and only selectively reply to things that meet your standard of healthy and respectful communication, you take all the power back. I highly recommend it.\n\nHeck, if she comes banging on your door. You can slip a piece of paper out that states she needs to leave now as she has violated the healthy communication clause and try another time. Also, let her know if she doesn't leave immediately, the police will be called and she will be forcefully escorted off the property. You need a show of force here.",
            "I'd talk to the dad a bit first.  It could be that he's noticed things as well.  Perhaps she has early onset dementia or another mood altering health problem she hasn't shared with you.  The fact that you posted here says this is a little more than her usual tendencies",
            "Put on your own baby shower, that you’re wife will actually have some input in. \n\nAnd don’t invite your mother.",
            "I have been recommending this book to anyone who will listen, as it helped me more than therapy (but I think everyone can benefit from good therapy). Please look up “adult children of emotionally immature parents” by Lindsay Gibson, PsyD. \n\nMy mom and dad fulfill very similar roles as your parents. Overbearing and quick-to-anger mother and “easy-going”, loving father (you didn’t go into detail on your dad, but I am guessing he is similar to my dad). \n\nThe book goes into details about why your parents act the way they do, and the best way for you to react to meet your own emotional needs and set boundaries. The short version is, it’s best to distance yourself from your parents and know that they are not going to change who they are because they cannot see any problem with their behavior. You can tell your mom what bothered you and how you feel, but know that she probably won’t accept any responsibility for her behavior. \n\nOne more note. As I said earlier, you didn’t go into much detail on your dad, but you might consider your father’s role in your mom’s behavior. Did your dad ever stick up for you when your mom had narcissistic tendencies and unhealthy behavior towards you? Your dad may not have had an active role in your mom’s behavior, but he probably didn’t try to protect you from it, and that’s also not ok. \n\nI agree with other comments on here that you don’t need to talk to your dad before talking to your mom (whenever I do this, my dad defends my mom’s behavior). I just wanted to point out that your dad may have a role in this family dynamic too. For me personally, that was a pretty eye-opening realization.",
            "Tbh I'd explain how inappropriate that was and I'd ghost her. From somebody with a narcissistic mom that has ruined almost every relationship I have ever had on top of not taking my side when I needed her to...I'd just cut the chord and explain to your child that grandma is not nice to mommy.\nI'm struggling to decide if I want to dive back into my family by going to my sister's wedding. \nJust know that whatever choice YOU make it will be the right one for YOU.\nLove and hugs from one abuse survivor to another.",
            "\"Mom, I love you, but you can't talk to my wife like that.\"\n\nThat covers everything.",
            "Sounds like your moms a really asshole, mine too. Your dad is probably just as tired of her shit as you are, but he has to see her everyday. I wouldn’t want to stir shit up between them, you get to go about your life after the dust settles he will have to deal with it for a long time. Keep him out of it and go straight to your mother and tell her enough is enough.",
            "If you talk to your dad he may side with your mother. After that remark she made I just wouldn’t show up because you and your wife’s input should be important since it’s your baby.",
            "What did you say when this happened? That would of been the best time to slam down a boundary and check that behavior immediately. I would then follow up with my mother in a one sided conversation with my mother and if she didn't apologize immediately I would go NC until she sorted her shit out. That's your wife you are talking about, she needs to feel respected.",
            "Confronting a narcissist is only going to make things worse, and not solve anything. Let your Mom do her thing, show up, thank her and then distance yourselves.",
            "Don't mention the withholding grandchild thing. If this becomes a clear repeat behavior then yes you might consider that if it feels unhealthy for the child to be around, but we don't hold our kids over their grandparents and try to control other adults by threatening that they never get to see the kids. That's not healthy for the kids if grandparent is loving and kind  to grandkid. Never use the children as a way to control other people.\n\nI think you need to talk to your mom. Don't threaten her with not seeing her grandkid. Tell her that if she ever is rude to your wife again that she won't see you. \n\nYou can go no contact if the respect is not there. Leave the kids out if it completely. Your wife is your choice and disrespecting your wife is disrespecting you. She needs to understand that. \n\nYou did the right thing waiting until you can privately speak to your mom. If anything is going on that caused her to snap like that it can be revealed in a private conversation with you. You should talk to your mom privately and ask her why she said that and tell her that was super offensive to you. Keep your wife out if it as much as possible because your mom will blame it all on your wife, you coming to speak to her, she won't deal with it, unless it comes from you, unless it affects your relationship with your mom. Like my mother in law hates me but she won't address anything unless my husband is upset. My husband is her baby, so she doesn't want that relationship to fall apart, she could care less about my relationship with her.  So sit down with your mom and ask her, have lunch together, just ask her why she said that. Tell her it hurts you because this is the family you are creating and your role is to protect that family that you love her but you need her to be nice so the baby feels love and good things only and your wife feels safe. The thing is when people snap like that and say things out if character, it could be something totally unrelated. Your mom might be having a medical scare or something and not thinking right. I don't mean to worry you, but if it's out of character, that happens when moms get distracted with something totally unrelated and are worried or super upset but hiding it. Like my mom was also having severe hormonal issues with menopause and stared saying super rude things and having no patience, it was a hormone imbalance.",
            "Oh wow. My bf’s aunt snapped at me for talking once & I let her know I thought she was rude, to which she proved it by shouting stfu repeatedly like a crazy woman. My bf didn’t even budge. Your wife is lucky to have someone supportive who has her back.",
            "That is really crazy and I hope you guys will find peace soon from the narcs",
            "don’t talk to your dad at all.. this is between your mom and your relationship. this can get worse very easily so put your foot down and push mom out of your life until she complies. make sure you let both your mom and wife know this is you laying down the law.",
            "I would do it in front of both of them. Just be honest. Say that her behavior is not warranted and that if she continues and doesn’t get better there will be consequences. Plain and simple. Control YOUR life and YOUR family.",
            "Nahh, take it straight to her, and if she doesn't want to hear you out. She can kindly stay out of your life.",
            "Follow up all of this wonderful advice to confront her with subtle things aswell. Any time you are in a family or friend setting with her present be loud and say things like   \n\"You heard an aweful story of someones MIL who would not back off in the first few weeks of visits so the family had to cut contact for a while and wasnt that just aweful but you could totally understand the parents perspective blah blah blah.\"  \n\n\n\"You cant think of anything worse than unannounced visits with a newborn, people can be so rude not calling first so mumma can get a little together to have company over\"  \n\n\n\"How rude is it when people ignore boundaries set with newborns, like shouldnt the parents get a say in how the child is handled and introduced to the world\"  \n\n\n\"OMG you heard a horror story of the MIL announcing the birth on FB before the parents and you totally undertsnad why the parents were livid and cut her visiting rights back.\"  \n\n\nCover any scenario you can loudly in public and you can even include her in these conversations by saying, \"I'm so glad you wouldnt do something that batshit crazy, can you imagine how aweful that would be for the whole family?\" She'll have no choice but to back off or become the bad story.",
            "Since you didn't react then and there, I would go to your mom and say you were so upset with the way she SNAPPED at your wife for offering an idea, that you needed time to calm down. Now that you have... then say what needs to be said. This will quelch any comments about you not speaking up about it then. Do your parents pop over now unannounced? If not, no need to say anything until they do it the first time. If they do, you can say that until you know how you and your wife's schedule will be once the baby arrives and how tired your wife will be, you'd appreciate if they ask before visiting.",
            "If you keep taking help from people, or involving them in major events in your life, then they will think their behavior is acceptable.\n  \nSend  a letter to everyone simply stating \"Our deepest apologies, but do to the current PANDEMIC, and recent health concerns, the baby shower will be canceled. We will reach out to you when we are able to reschedule.\"",
            "Hey man, I had a pretty rocky relationship with my mum growing up, came from a divorced home and was always treated like a cuckoo in the nest when she re-married, but she always wanted a hand in everything I did as an adult. When I moved out I started to distance myself from her, and she kept getting quite aggressive about my new distance, snapping, being rude etc.\n\nI would say go straight to her, and tell her that if she wants to be a part of your child's life she has to tone it down, act like a grown person, and understand that your world doesn't revolve around her. If she can't handle that, thats her decision.\n\nThe biggest lesson you learn in life is that if someone makes you unhappy, either directly or indirectly, it is perfectly fine to start cutting them off, no matter their relationship with you. If you really matter to her, she will change how she acts, maybe not straight away, but in time the realisation will hit. Be hard nosed about it now, tell her how you feel to her face, and if she's capable of growing as a person, she will in time.\n\nBelieve me, its her loss if she can't behave. I hope you and your partner have a blast being parents, and I wish you the best of luck in resolving your social situation 💖",
            "Who cares if invites were sent out? I'd rather be comfortable and be a slight inconvenience than majorly uncomfortable and fake enjoying wanting to be there. We're all adults",
            "You are an adult who gets to choose who you interact with.\n\nAs a parent, it is your job to protect your child from negative influences and dangerous people.\n\nIf you insist on maintaining a (strained) relationship with your mother, that's your prerogative. Don't force your wife to have to deal with her just because they're your wife and mother and in normal families that's expected. Your wife shouldn't have to absorb unprovoked verbal abuse in order for you to play house with someone you know won't play by the rules. ESPECIALLY not while she's pregnant.\n\nYou are not going to change your mother. She is a grown ass woman who life has taught already that she needs to have basic fucking manners and play nice and she's ignored that lesson for 57 years. Your father is not lobotomized and is surely well aware that his wife causes social problems.\n\nStop giving your mother positions where she can behave badly with so much power.",
            "Go to your mom and call her out. My mom is 57 yrs old and can be so rude and aggressive abt the littlest things. Best way to handle it is to deal with it straight away, directly and bluntly.",
            "Cancelling the shower will take things to DEFCON 7.  It will never be forgotten.  Deescalate for now.  My advice:  ignore your mother’s snappish behavior.   Your mom would likely try to justify herself if you confront her. If your mother brings it up, don’t engage.  “We appreciate your hosting the shower.  Wife thought you were asking for input. We didn’t intend to offend you.” \n\nYour wife should be polite but not apologetic. She should enjoy the party despite her MIL. \n\nDon’t lay down your planned boundaries for grandparents just yet.  If you make a big ultimatum now it will be easily attacked.  Introduce your baby rules as they naturally arise and hold firm.\n\nEdit to add: And do not use your mother for childcare when and if your wife returns to work. That would be a never ending nightmare.",
            "No point going to your dad,  he is enabling her behaviour.\n\nTell your mother that she cannot ever speak to your wife like that again\n\nCancel the shower\n\nTime to grey rock her!!!",
            "There's a reason your father is still with your mother. Despite her narcissism he loves her and he has to deal with her too. He may feel he has to warn her about what is coming or if she finds out he knew without telling her, she will take it out on him.",
            "Please don't make your father pay for your mother's behaviour.  She is the one that has poor behaviour so go straight to her and tell her what is and isn't ok and if she crosses that line then you and your wife will not see her.  (I would also reccomend keeping the baby out of it because it sounds like you're using the child. A better way to think of it is that she won't be able to see *you* and *your wife*. The baby will naturally be an extension of that). \n\nIn terms of your dad - don't punish him too. Even though they're together,  your dad is an individual. Invite him to still have a wonderful relationship with you and your wife (and therefore your baby). Excluding specifically your mum highlights that this is *her behavior* that needs changing.",
            "You talk to the mom.  When I invited my mother in law to the first Christmas with my wife and young son I had to have a similar conversation with her. She had similar angry out bursts and was always yelling at her daughter (wife's younger sister). I did not want my first Christmas with my new family to have yelling and arguing. To her credit she was on her best behavior and she seemed to really respect me from that point on. It's been 15 years and she has never crossed that boundary.",
            "Please keep us posted, OP! Good luck to you guys and congratulations on the baby! We’re all hoping for a peaceful and relaxing time ahead for you.",
            "It’s kind of crappy to be already bringing grandchild visitation rights up when all she did was make a rude comment. I hope y’all won’t dangle that over her head in future, and you DEFINITELY don’t need to put it on the table in this conversation even if you privately think about it.",
            "What do you tell a mom with 2 black eyes? You got this brother.",
            "As someone who has a crazy mother in law who has gotten aggressive with me and my child I'd set the boundaries with your mother directly. I only say that because words can mean more when they come from the direct source.",
            "I know your mom. She doesn't have narcissistic tendencies. She's narcistic and bipolar. And yes - you need to confront her directly, and stand up for your wife. You picked your wife. You did not pick your mom. This isn't the first time this had happened and your wife needs to be supported by you.\n\nYour wife will leave you at some point if you don't address this yourself with your mom. Seriously. Step up."
        ]
    },
    {
        "post_id": "1blks72",
        "author": "ThrowRA_AngryBride",
        "title": "My (32F) future stepdaughter (12F) destroyed my wedding dress a week before the wedding. I'm torn between giving her another chance or calling off the whole thing.",
        "url": "https://www.reddit.com/r/relationships/comments/1blks72/my_32f_future_stepdaughter_12f_destroyed_my/",
        "score": 2190,
        "num_comments": 231,
        "created_utc": 1711172148.0,
        "selftext": "I am beyond frustrated right now and am on the verge of giving my fiancé, Alan (39M) an ultimatum that I really don't want to give.\n\nAlan and I have been dating for about 3 years and have been engaged for a year, with our wedding date in a week. He told me on our first date he was a package deal; his daughter, Rose, is his whole world. I was perfectly okay with it and we started hanging out together. Alan's ex, Carrie (38F) is still in the picture as she and Alan are coparenting. Carrie doesn't like me one bit. Alan told me that he and Carrie had been high school/college sweethearts and she had always held onto hope that he'd come back to her. But Alan also confided in me that Carrie wasn't a great partner. She adores Rose. But she treated Alan badly during their entire relationship. You name it, she did it; emotional abuse, gaslighting, financial abuse, belittling, etc. He finally got the courage to walk away from her when he discovered she was having an affair. Rose was maybe 6 when Alan learned about the affair. Unfortunately, the courts still granted Carrie 50/50 custody, despite the amount of evidence against her.\n\nRose and I have had a bit of a strained relationship. I understand it, having grown up in a divorced home that both parents remarried. She's a preteen and has some conflicted thoughts about her dad marrying a new woman instead of going back to her mother. But she's been really haughty and nasty to me. She makes cutting comments and will respond with \"You're not my mother\" when I ask her to stop. Alan has tried to set down ground rules but she flippantly tells him that \"OP's not going to last.\" I put up with it because I love Alan and, sometimes, Rose behaves herself.\n\nSeriously, she's not a horrible kid. She gets good grades in school, she's in the youth symphony and takes dance classes. She's really popular, bubbly and friendly when she isn't being mean to me. It's like Jekyll and Hyde. Alan and I have talked about it constantly and have even involved Carrie but Carrie just brushes it off, telling me to mind my own beeswax. We have tried therapy, groundings and everything else but nothing works.\n\nThat brings us to tonight. A couple of weeks ago, alternations on my wedding dress was finished. I was really excited. My late grandma (who I was really close to) made her own wedding dress after seeing photos of Grace Kelly and many women in our family have worn it to their weddings or have had their own dresses designed after it. As I'm taller than my grandma, I had mine made. It's really special to me. I have the dress saved in my closet, tucked in a garment bag.\n\nAlan and I don't live together. However, my apartment is close to one of Rose's friends so we have an arrangement that on some days Alan has custody, Rose will hang out at her friend's house and then come over for dinner with Alan and me. After we watch a movie or play Nintendo Switch, Alan will take Rose to his place. Today was one of those days. Alan was running late from work and called to let me know. Rose arrived and everything was normal. I stepped into the kitchen to finish preparing dinner, leaving Rose alone.\n\nIf I had any inkling of what was about to happen, I would've done something different.\n\nDinner was ready and I went to get Rose. I passed my bedroom door and something about the way the sliding closet door was positioned made me want to check.\n\nMy dress had been cut to pieces with a pair of scissors and was covered with glitter paint.  My veil is torn to shreds. It's completely ruined.\n\nI broke down crying. I was too upset to even be angry. Alan arrived and found me in a mess. He was beyond furious and went to Rose, confronting her about it. Rose admitted it with a shrug of her shoulders and said \"What's the point? She's just a fat old cow anyway.\" Alan confiscated her cell phone and immediately called Carrie to discuss a punishment.\n\nI don't know how or why, but this is the straw that is breaking the camel's back. I have gone through so much with Rose. I've tried to be caring and compassionate...and this is my reward?\n\nNow that my sadness has faded away, it's been replaced with a boiling anger. I'm tempted to just call off the wedding and leave Alan to deal with his brat of a daughter. This wasn't an accident. This was on purpose. But then I remember that Rose is part of Alan's life.\n\nI love Alan. But I don't know if I can keep taking it.\n\nWhat do I do now?\n\nTLDR: My future stepdaughter destroyed my wedding dress and veil a week before my wedding and I'm torn between just straight up abandoning him or giving his daughter yet another chance.",
        "permalink": "/r/relationships/comments/1blks72/my_32f_future_stepdaughter_12f_destroyed_my/",
        "comments": [
            "Your relationship with her is a part of the marriage. I wouldn't get married if that isn't right. It'd be just as ridiculous as marrying him when your relationship with him isn't right.",
            "Is this the future you want. Think about it thoroughly. It's gonna be a tough road ahead and I think you should prioritise yourself and your mental health.",
            "My great uncle married a woman who had a daughter like this! \n\n\nShe was apparently a nasty little shit who put sugar in his gas tank, would play jacks near the back tires of his vehicle so he'd run them over, puncturing the tires, bury his tools, taking his clothes off the line when they were drying and throwing them in the lot next door which was basically a mud pit when it rained. The last straw was when she snuck little rocks she found outside in his soup. It was like pozole or menudo or something he couldn't see through the broth and was semi-hardy. He swallowed a couple of rocks and had to go to the hospital, but he was done. They'd tried everything with her, and her mom even tore up her behind, but he wasn't having it and divorced her. \n\nMy family would talk about that A LOT when we all got together. Apparently, the bio dad was a \"going out for cigarettes\" and never came back kinda dad. The girl was young but old enough to remember him, and I don't know, maybe hoped he'd come back. And this was the 50s, so there wasn't therapy or anything, to really deal with it, maybe a lobotomy which we all know is 🫣. But I always felt bad for the mom because she was struggling before she met my uncle, and he took care of her and the girl, not rich but comfortable and safe and they had to go back to struggling and I think moving away to be with family after the divorce. \n\n\nAll I can say is I can't imagine what would happen if Rose found out you were pregnant. How miserable you'd be your entire pregnancy, a time that's supposed to be super happy, how scared you'd be to leave the baby alone around her, how badly she'd treat your child. Carrie would pitch a fit at not being the only woman who has his kid and who knows what she'd instruct Rose to do. I wouldn't want to find out. \n\n\nIt's just something to think about. Put yourself and your happiness first here because he's always going to put his kid first as he should. She needs major therapy, and he needs to focus his time on getting her help and away from her mom.",
            "I have been in a similar position, but I ran after 1,5 years because no man is worth my peace. In hindsight the best decision ever. \n\nMy current fiance has an almost 18 yo and he actually parents her. This makes all the difference. \n\nDon’t do this to yourself, you’re worth so much more. \n\nSend Alan and Carrie the bill and never speak to them again after that.",
            "As someone who has watched my sister deal with stepchildren like this for over 20 years - it never gets better. \n\nThey will continue to try and hurt you and break up your relationship forever.\n\nYou can either accept this and live with the abuse, or give them what they want and leave their father.\n\nMy sister stayed and she has never been 100% happy, because they are always in the background and their father always lets them get away with bullshit behaviour because he doesn’t want them to cut him out of their lives.",
            "When you call it off, you need to share what she did. It can’t be you guys called it quits cause you don’t love eachother. She’s old enough to know better and people can know what she did. \n\nIf it was my daughter and she did that to anyone else even if it’s someone I didn’t like - she would get every right taken away because that is disgusting behavior. And I am sensitive to how she feels because I also have divorced parents who dated others but I never thought to do something like this.",
            "Call it off and sent Rose's Dad a bill for the dress. Don't get married, Rose wins but it'll be much healthier for you in the long run.",
            "You walk away. \n\nIf after 3 years this is still at this level and getting worse, it will not change. \n\nThere is no ultimatum you can give. He is a father, and he will always choose his child like he should. The fact that he has done nothing to set hard boundaries. Therapy only works if the child is willing. Grounding doesn't do anything when mom will not back him. You can say he has tried everything but when she cut up your dress he took her phone. Nothing else. I am sorry, but he isn't going to change. Nothing will change. \n\nUnless she either has her mom cut off or he takes a harsh route, then it won't, and her mom is good enough even though she is encouraging this behavior. So she will remain in her life. He won't take a harsh route because what good is that if mom won't back him or kiddo decides she doesn't want to visit because of it. \n\nIn the end, he will always choose his child. You can suck it up and let him and yourself accept her abusing you. Letting it escalate until possibly her becoming physical. And what about if you have kids. Do you trust your child is safe growing up in this environment. Or you walk away. You can love someone, but love is not always enough, and hunny, I don't see anything changing if after years she is only getting worse. \n\nSo it's up to you to decide. Stay and your life 50 percent of the time is being abused. Or walk away and find a relationship where you are not abused by someone in their life. \n\nYes, she is a child. Yes, she is most likely being pushed to these things. Lied to that dad would be better alone. That if he is, he might get back with mom. She is being manipulated and striking out. You can feel for her while saying no, I will not put up with this. She is old enough to know she is doing wrong. She just won't stop until something drastic stops her.",
            "I would run OP. You have to acknowledge that this will be your life and won’t stop.",
            "YEP!!! \n\n**TELL ALAN IT'S OVER AND DUMP THE FUCKING LOT OF THEM**.\n\n**AND BILL THEM FOR THE DRESS**.",
            "Call it off. This is the tip of the iceberg of what she'll destroy. What if you and Alan have children? Do you trust her not to hurt the baby? Ooh, he took her cell phone. There were a million ways she could still entertain herself or turn herself into the victim and get her dad or at the very least her mom on her side.",
            "Rose is a product of her upbringing. Obviously, Carrie has likely done more than a bit of talking to Rose about treating you badly, but Alan isn't an innocent man here, either. \n\nTherapy, grounding and anything else will not work because Carrie is likely praising Rose or making promises to her about her dad coming back once you are out of the picture. And Rose has a mission: Making you \"not last\" - she said so herself. \n\nAnd why should she stop trying? Mom is praising her and likely waiving any punishment the moment Rose is with her, things like getting grounded or therapy are also not exactly the most debilitating things when to Rose, the breakup of you and Alan is a lot more important.\n\nConfiscating her phone for ruining a whole wedding dress? That's hardly a big reaction. A more fitting reaction would be that Rose isn't allowed in your house anymore. My instinct says that she should also symbolically pay with her allowance for parts of the dress for some time, but her mother will likely just give her the money when Alan isn't looking.\n\nI think the biggest punishment would be if Alan would finally set some boundaries with Carrie, mainly. Like, the punishment doesn't have to be discussed with *Carrie* first, but with *you*. *You* are supposed to be his new family, after all. Coparenting doesn't mean that every single decision has to be checked with the other parent. \n\nAs long as Alan doesn't see that Carrie is the main issue , nothing will change. She will keep indoctrinating Rose.",
            "Loving your fiancé is not enough for a lifetime of stress and disappointments from his daughter. \n\nYou can’t wait for her to change her behavior if she won’t accept you. She’s not even nice. It takes a lot of energy and effort to do that to you and she just did it effortlessly. Just leave",
            "Nope,no no NO. OP, you have to end this once and for all. You are never going to have peace with a stepdaughter and also an ex like that. \n\nWhat if you and him have kids, would you feel safe having the baby around the stepdaughter? \n\nYou've done your best and you've gotten nowhere, sometimes you have to know when to quit and I think that moment has come.",
            "It's been 3 years and Alan is still allowing Rose to be disrespectful towards you. Whether it takes therapy, better communication or whatnot, he hasn't done his part. You can't blame Rose for the crap life she's having due to both her parents' bad choices and having to split her life between 2 households.\n\nI'd walk away from this one. Alan may be a good boyfriend/husband. But he is a lousy father.",
            ">He told me on our first date he was a package deal\n\nYou should walk away.\n\n>this is the straw that is breaking the camel's back.\n\nThis isn't a straw, it's a whole boulder.\n\n>Now that my sadness has faded away, it's been replaced with a boiling anger. I'm tempted to just call off the wedding and leave Alan to deal with his brat of a daughter.\n\nYou feel how you feel, but you should also be glad to find out how much worse your marriage would have been. You dodged her teenage years.",
            "Walk away from this relationship. \n\nThis is your entire future. Please save yourself",
            "It's not worth it if I am being honest.\n\nLet's say even of you get married what are the chances that her behaviour changes specially when she become moody teenager??\nAnd worse what happens when you have your own kid her behaviour might be worst.\n\nLet's just say it is what is and call it off.\n\nYou can have sympathy or love for her dad but he has very clear priority and you're not so high on that.\nSo why even bother?",
            "Leave. Someone who would destroy your clothing would harm you",
            "You don’t even live together yet. Imagine living with a child who clearly resents you and a husband who won’t put his foot down about her behaviour, plus a mother who I suspect is busily poisoning Rose’s mind behind the scenes. I know you love this man but can you honestly imagine things improving in the future, especially once you’re all under the same roof? It’s your decision, your life, and you’re the only one who knows what you want, but you have to take off those rose-tinted glasses (no pun intended, sorry!) and look at what the situation \\*is\\*, not what you \\*want\\* it to be. I’m sorry. Good luck.",
            "Have a sit down with your partner and discuss this! Don't even think about marriage, postpone everything until this issue is resolved. Whether its a compromise or a break up. Don't know but talk first. Communicate your feelings over the years and his inability to properly address his daughter ",
            "No man is worth the hell that Rose will bring to your life.\n\nFeel bad for Allan but he knocked up the wrong woman and now has two generation of  malevolent crazy who will ruin the life of anyone who tries to marry him.\n\nMaybe you two can still date but that marriage can’t go forward.  And obvi spare yourself of ever being in contact with his crotch fruit again.\n\nMaybe in 6 years when he can send Rose off to make other people’s lives miserable you could marry him.\n\nBut please don’t do this to yourself.",
            "If she can take a scissors to your wedding dress, she can take a scissors to  YOU.,\n\nThat girl has some rage inside of her.\n\nBefore you break up with Alan, INSIST he pay for the ruined dress. Keep the ruined dress. Make sure you have a text message trail that has him mentioning Rose destroyed your dress. \n\nOnce money is in hand, end the relationship.,",
            "Her response after being caught is concerning. You deserve someone without that kind of issue tbh. She is old enough to understand what's right from wrong. I'd suggest cutting it now and if you paid for the dress let him pay you back for it.",
            "If you not 100% sure you want to be married,  then you shouldn't be married.   Although Rose is the one who did the damage, some part of you probably blames Alan for the way she is.  Do you want to feel this way forever?",
            "Take this as a blessing in disguise. Are you really ready for a decade of constant conflict while she’s still financially dependent on her dad? This girl has issues, likely her mom is encouraging the bad behaviour, it’s not really worth it. You’re young, find a guy with less baggage or at least a child that isn’t destructive",
            "I think I’m with you, let this guy go off and enjoy life with his shitty daughter",
            "Dump the fiancé. Press charges on Rose for destruction of property. Time that kid had some real consequences.",
            "She’s never going to accept you because her mother won’t allow it. Do with that what you will, but I wouldn’t be marrying this man, at least not until his child is an adult.",
            "Save yourself the trauma and move on.",
            "This family isn’t the right fit for you. \nHis daughter will always be his number 1. She’s only going to get worst.",
            "Sorry, OP. It's over.",
            "I’d probably leave.\n\n\nMaybe Alan will fall into a depression and then Rose will feel an ounce of remorse… or not. But at least that would be Alan’s problem, not yours.\n\n\nWith a daughter like that, he’s fucked in terms of relationships for good long while, I know that for sure. But you can still get out though.\n\n\nI dunno, maybe some other blended family can weigh in about the transition phase and if it gets better moving forward.\n\n\n\nBut fuck, for me, life’s too short to get stuck in shitty situations.",
            "I think it’s time to call off. None of you can be happy if you live together in a house.",
            "IMO it's a mistake to marry someone you haven't lived with full-time for at least a year.",
            "When these are written all flowery it’s hard to believe they are real. Especially when it’s rage bait and OP seems clueless. “I don’t know why this is the straw that broke the camels back”. Maybe because she cut up your wedding dress which is insane? Of course it’s your grandmas wedding dress that’s been in the family for generations. \n\n“If I had any inkling of what was about to happen I would’ve done something different”. *ominous sax music plays and screen fades to black. Cue commercial break.*",
            "OP, you'll get better advice on r/RelationshipsOver35 or something as some of them most likely were in your position",
            "[removed]",
            "Take pictures of the result of her behavior and after you call off the wedding and the questions start rolling in, show people the photos of the 12 year olds behavior.  This wasn’t a toddler that was unsupervised, walking around with a jar of paint, this was a willful decision by a young woman.",
            "[deleted]",
            "Sorry, why should Carrie not have custody of her daughter? What was the evidence about?\n\nHow did Rose cut the dress to pieces and then also apply paint?",
            "At the very least you need to postpone the wedding. In my opinion it’s unlikely that this situation will get better any time soon, if at all.  The last thing you want to do at this time is make the relationship “legal” with all the restrictions and legal complications that would be involved if you later decided to end things. You don’t have to marry him to love him and have a relationship but if you marry him now you’re effectively playing Russian Roulette never knowing when that bullet is going to fire. At least before you sign on the dotted line it would be less complicated and costly to leave if you decide you can’t live with the situation any more. So don’t make any rash decisions to either marry him or end things completely. You need time.",
            "Make sure Alan knows he’s raising a sociopath.",
            "Seriously just call it off if you have doubts now",
            "Make her PAY for the dress. Postpone the wedding.  Look into what you really want.  To be in a life long relationship with Alan and his BRAT, or find what will make you happy.  I strongly suggest pressing charges.",
            "Wow, I'm sorry. This is do sad and unfair to you.\n\nThe bill for the dress needs to come out of her savings even  education fund. She needs to see the reality of what she did and feel it for some time. If she has any big class trips planned, she should not be allowed to go. These punishments need to be set my your fiance.\n\nFinally you and your fiance need to really talk about how to handle things. Maybe he needs to give her mother more custody, as she does not respect him, you, or his lifestyle with you. \n\nIf when you talk with him, if he even so much as defends his daughter or isn't willing to make aby large scale changes or punishments, then you should at the very least postpone the wedding. His daughter's actions were violent. She's not 5, she needs real hard consequences.",
            "Alan needs to go to therapy with his daughter, and then with daughter and Carrie and clearly and finally tell both that no matter what she/they do or say he will NEVER be in a relationship with Carrie again. Even if they drive you away, he will NEVER change his mind.\nThat his and Carries relationship did not make him happy in the long run (unlike the one he has with you), despite the joy Rose gives him.  Their relationship is one of co-parents and will NEVER change.\n\nThen YOU need to decide what you want to do",
            "I suppose the questions are - is this how you want to spend your life and is Alan willing to step up?",
            "I’m sorry but the problem here is Carrie. If she’d been modelling positive or at least neutral behaviour to that brat, then she wouldn’t have grown so nasty to you, as if it’s normal. And her shrugging this behaviour off is disgusting and enabling behaviour. What a toxic pair of b*tches.",
            "If and hopefully big IF … this will become your life. She will ruin every happy moment and get grounded. Yet the actions will most likely not change. That was deliberate.",
            "Cut your losses and move on. He said earlier that they are a package deal and so he should since that it his child. But you deserve to forever tolerate this kind of animosity and hate. If he's not willing to discipline her then he's a lost cause. Don't wait for the animosity to go to your future children. Let him be miserable raising his daughter while his ex suffers no consequences",
            "And if anyone tells you she is young snd she didn’t fully understand what she was doing that is complete and utter BS!  She methodically and intentionally ruined your dress!!",
            "Don’t marry him, yet. \n\nThis child needs therapy snd she needs consequences. She needs to  pay for it. No money for her. She can sell her stuff etc. If he doesn’t take care if it like a father, don’t marry him. \n\nHe allowed her for years to treat you like shit. He allowed his ex wife to do the same.\n\nI don’t care if he has backbone problem, but don’t accept it. If he isn’t willing to raise her like a parent, this will just be the beginning.\n\nWhat if you two have a child? She might hurt the child or you when you are pregnant.",
            "> Unfortunately, the courts still granted Carrie 50/50 custody, despite the amount of evidence against her. \n\n\nI'm going to focus on this bit because I think it's representative of this whole thing. You're feeling threatened by a child, and you don't really seem care for this child all that much (I mean describing her redeeming qualities you mention her attending dance classes, FFS). You think it's a good idea to take the child from the mother because she was a bad partner. This is next-level egotistical thinking.\n\n\nAnyways. You mention wanting to give Alan an ultimatum. An ultimatum about **what**, exactly? Not only did you know about this child's existence since the very beginning. But he was very, very clear that they were a package deal.\n\n\nListen, adolescents are hard, especially those that come from a divorced household where parents can't set aside their differences to coparent like adults. For all that he likes to play the victim, he's as much to blame as she is (and just for the future, remember that an adult doesn't get to play the woe is me card when they decided to have a child with someone they consider to be unfit to be parents).\n\n\nIn that sense, it seems to me he's kinda repeating a pattern here. Not only because he chose a woman who can't exhibit the slightest regard for a teenager raised in a crazy home, but because I can't for the life of me understand what the rush to get remarried is. I would ask you, but I'm afraid the answer would be \"so we can bring more children into this crazy situation while the first one is clearly suffering greatly\".\n\n\nAbsolute self-centeredness all-around, by all parties involved.\n\n\nOne final note: when you \"take a teen to a psychologist\" your aim shouldn't be to \"fix the situation\" (the behaviour), but rather to give them a dpace where they can sort their shit out and have a chance of being something resembling happy. My partner is a child psychiatrist, and people like you and your fiancé are the bane of her existence. \n\n\nTake a step back and reconsider everything I just said, even though you don't like it. This story isn't about you, a fully-grown adult who got a material possession destroyed. It's about a preteen who seemingly has **no** reasonable adults around to worry about her.\n\n\n...do you think enrolling her into yet another sport/hobby/lesson/thing-to-get-her-out-of-everyone's-hair will solve the thing?",
            "I was the bratty step kid and I eventually came around, but it was when I was an adult….",
            "Your fiance is not kidding when he says they're a package deal. This is not a good situation for you. The daughter clearly has something to work through, and the fiance doesn't seem to have made it clear to his ex that the relationship is as dead as disco. It seems to me like the ex and daughter have planned some stupid parent trap ripoff that isn't going to end like they're hoping. Or maybe it will since #MeredithWasRight. You're just another beautiful woman that's being treated like shit by an ungrateful child that believes she knows what's best for her parents. But, regarding punishment, there isn't much your fiance can do to get the daughter on board with you being in their life. I hate to say it, but he might not be ready for a relationship yet. \n\n\n\nNTA if you stay and try. She's going to either grow out of this behavior, or she'll move out and then you'll only have to deal with awkward holidays and the occasional dinner. You're not an asshole if you leave, either. Your dress sounded so beautiful.",
            "You are too young to set up for this, you can do better",
            "Dd the daughter ever get therapy for dealing with her patient's divorce? Honestly do you want to live with this girl for the next decade? She sounds horrible. I know she's a hurt kid lashing out because she's angry and confused and sad but she's out of control and needs therapy and things are probably not going to get much better. They've been separated linger than they were together with her. She needs to get over it a little. It's not like you were the woman who split her parents up.",
            "She is a child, and her mother is, by your telling, abusive and playing her against you. The child is not the problem here. Her actions are mean and spiteful, but they are not the actions of a happy child but one who is feeling immense pressure to “avenge” her mother after being inappropriately involved in her parents’ relationship.\n\nI know you said you’ve tried therapy. Try again. Individual therapy for all three of you AND couples therapy for you and Alan AND family therapy for everyone (maybe even Carrie, although she may refuse to participate).",
            "This is a package deal that will only get worse over time.  Think about what she will do when you both live together, will you have the resolve to tell your husband she can't be over, or face the sadness and loss with your husband when she has to be over way less or resentment even?  I think you know what has and should be done, this kid will only escalate after marriage unfortunately.",
            "They're a package deal, as he told you from the start. Unfortunately half that package is a toxic monster of a kid, probably being egged on by her even worse mother, but also enabled by her father. The best thing you can do is get away.",
            "Call it off. It will tell her she can be horrible and get her way, but life is too short for this headache. If you have ANY interest in having children it will be an issue. Hell hath no fury like a preteen whose parents aren’t able to see the damage they are causing their own child.",
            "Are you willing to be tormented by a child that hates you for no reason that you can’t punish or discipline them for horrible acts of defiance for the rest of your life for a man who is willing to allow it because it’s his child ?? You’ll always be 2nd in his life you might aswell cut your losses and leave.",
            "Imagine if you have kids. If she'll do this to a dress imagine the shit she'll do to your baby. \n\n\nIt's over op, sorry but save yourself from a life time of misery.",
            "Show up to the wedding in that dress.",
            "Have he and his daughter participated in family therapy? Is the child still receiving individual therapy? she should be. She is obviously miserable. That’s a lot of rage. She doesn’t care at the moment that her father could be happier if he were married to you. She is mostly afraid of losing what she has, and that’s obviously been promoted and encouraged by the ex who was an abusive partner. She probably deals with the same crap that made your boyfriend leave, but she can’t leave. He’s got lots of parenting to do before creating a new step family with her. and that is not about grounding. He should be participating in parent training and family therapy. Trauma informed. There’s no ultimatum to give? Y’all can postpone or call off the wedding. Or marry (and maybe keep your apartment) and keep working on the relationships.",
            "Cut your losses.  This situation is not worth it.  You do not want to squander your remaining youth on this.  I pity the girl, but her character is not going to change. And her mother is a nightmare.",
            "Looks like Rose has some.big feelings that she needs to talk about and be understood. \n\nYou are allowed to love and be loved and yes this behavior is wrong but at the same time she is clearly going through it.",
            "Id leave. He didn't do shit to prove he can manage his kid, you have a crazy ex in the picture stirring drama and this spineless jellyfish man comes with a horrible stepdaughter that's going to make your life hell.\n\n\nIf you really want to stay, don't see why but whatever, just tell him you aren't interested in a relationship with his kid and that you either keep separate lives until she's gone to college, only seeing him when he's 50% free from this brat, or you are done. \n\n\nMost likely he will claim what she did wasn't that bad and you'll realize the girl won. Then you'll lose all respect for the guy who puts you last and walk away anyhow. ",
            "Children need to learn there are consequences for what they do. It's a crucial part of growing up.\n\n\n'Rose, we are taking money out of the savings account where we've been saving money for your future, in order to pay for this.'\n\n\nThere needs to be a consequence that affects her, or she won't learn anything.",
            "Please follow these steps:\n- sit down with Alan and discuss thororughly your relationship with him: do you love each other, is he ready to protect you and side with you in the future, what are the actions he want to pursue with regards to the incident with the daughter and with the ex wife... from your post, it seems he is a good guy who wants to do things properly. And love sometimes goes beyond the wedding dress. Keep in mind that he didn't do anything. His daughter did it, and he was definitely not pleased with it.\n- IF, AND ONLY IF you see in him the man you want, meaning that he loves you to pieces and he is really the loving and caring man you saw before the incident, then go buy another dress and marry him. This would be the real strong reply to the ex-wife and her manipulated daughter... and the dress is an accessory to the ceremony. It is true that it hurts, but it is just a dress.\n- once married, put down your boundaries (you and your husband) and decide the new course of act. De facto, this is an offence done by a 12 years old that refuses to see her father marrying another woman...but if your husband can demonstrate the manipulation of the ex-wife on the kid, then this is material for the court.\nIf you call off the wedding now, they will say they are right that you are not a good person. You break up with Alan because of an incompatibility with him, not with his daughter.",
            "One possible way I can think of to help the situation if you want to stay with Alan is to ask him about reporting her to the police. If she recognizes that her actions have consequences her mother cant shield her from then you may finally see some behavioral adjustments. ",
            ">What do I do now?\n\nTotally up to you.  As Alan said, and he's right, \"package deal\".  You get the person, and for better and/or worse you get all that comes with it - family, friends, enemies, baggage, past relationship and exes, all their great qualities, all their flaws and imperfections.\n\nAnd, ... she's 12 ... kids are gonna do sh\\*t.  But yeah, even/especially for 12 that was pretty egregious.  You can accept it, process it, deal with it ... whatever ... or not, or reject it or whatever.  And, yep, you break up with Alan over what Rose did, that'll be sh\\*t for both Alan, *and* Rose ... but that becomes a \"not my problem\".  Actions have consequences ... even if it's actions of a 12 year old kid - I'm sure Rose is quickly learning that, if she's not already learned it.  Anyway, not tryin' to guilt trip you.  Rose did what she did.  All up to you on deciding what to do and/or not do.  So, ball's in your court.  And yeah, \"package deal\".  And relationships are personal ... can break up at any time, for any reason, or no reason at all.  All up to you.  So ... maybe break up.  Or maybe continue with the wedding plans on schedule ... or maybe postpone the wedding 'till Rose is an adult - then if she still causes any problems for/to you, she's then adult and can face adult consequences.  So ... you're call to make.  And ... maybe don't have to rush to decision ... but that may also depend on wedding and date thereof - if that's set, and depending how soon, may not have a whole lot of time to decide.\n\nGood luck!",
            "Walk down the aisle in normal clothes and when people ask, tell the truth.\n\nI think forgiving Rose would be the powerful and correct choice. She's 12, her family blew up and here you are.\n\nI think, be the adult in this situation, let it go and don't let a child dictate the lives of adults (ie. get married anyway).\n\nBut if you can't handle it, leave now. Rose may not change, and if you hate her, you won't be a good stepparent.",
            "This is an Alan problem. If he thinks taking her phone away is the equivalent in a punishment, then you need to just run away from him. He’s a spineless shell of a man. \n\nThis girl should be feeling the effects and consequences of her actions on a permanent bases. Until rectified. \n\nBC I am eye for an eye kind of person, I would cut up her whole clothes. Photos. Dresses. There’s absolutely no way she would not feel the equivalent loss and anger and frustration. Go out with a bang.",
            "Rose is 12. Rose thinks there will be zero consequences because her mom will just give her her phone back. \n\n\nThe *only* thing that will get through is consequences that stick. No grace period. No time off for good behavior. \n\n\n1 pair of shoes. 5 pairs pants, all black. 5 golf shirts. I'm sure her school sells them. Try the high school. \n\n\nNo cell phone. Cut social activity. \n\n\nIf she comes home in normal clothes, further steps need be taken. Boarding school, perhaps. Not one of those nice ones, either.... ",
            "Raised several w no issues sorry I don’t let children abuse ppl bc I’m not spineless I hope you don’t have any bc anyone who comes in contact with you or them has to worry about being hurt or harmed",
            "The comments are shocking… she’s 12 and clearly going through a hard time accepting you. She didn’t do the right thing of course but people are expecting her to act like an adult when she’s just a kid. She’s not ready for this and honestly that should have been something your fiancé should have talked to his daughter about.\n\nYou’ve only been in her life for 3yrs and probably less cause I doubt he introduced you to his kids the first year. She still sees you as an outsider. \n\nYou shouldn’t be thinking about your “caring and compassion” as something that needs to be rewarded by her. She’s a kid.\n\nI would hold off on getting married for the sake of that poor little girl"
        ]
    }
]