[
    {
        "post_id": "uhuv15",
        "author": "None",
        "title": "How do I (28F) tell my situationship (36M) that I no longer want to fuck him because he is selfish in bed?",
        "url": "https://www.reddit.com/r/relationships/comments/uhuv15/how_do_i_28f_tell_my_situationship_36m_that_i_no/",
        "score": 2184,
        "num_comments": 310,
        "created_utc": 1651626262.0,
        "selftext": "How do I (28F) tell my situationship (36M) that I no longer want to fuck him because he is selfish in bed?\n\n\nI recently started seeing this guy who has been in the friendzone for four years. We are genuinely friends but he Actively tried to sleep with me before. Before we started seeing each other, I had concerns because he has Peter Pan syndrome and is inherently self motivated in the way he approaches women. He never wants to commit, I really don't want to date him. I just wanted a fuck buddy. We had a very long talk where I expressed my concerns and he said he would make a conscious effort if I gave him a chance. He told me has an issue with porn and that's where he learned about sex. I repeatedly mentioned that mutual pleasure and being present during sex is really important to me. I also told him that sexual compatibility is equally important  and we discussed what that meant in great detail. \n\n\nWe had sex. Well it felt more like he masturbated with my body more than anything. This man has no inherent understanding how to pleasure a woman.   He pulled my tits out of my bra the way you see in porn, never went near them except to titty fuck me. He never touched my clit, didn't really warm me up besides this very unpleasant fingering where he pried open my legs and essentially windshield wiped my vaginal walls to \"hear how wet\" I was while insisting on head. I repeatedly tried giving instructions. He pulled out of me twice to make me suck him off so he didn't have to nut in a condom. I spent more time with this man's dick in my mouth (30 min/45 min total) than he spent inside my body. Then after he came twice, he asked me how he would know if I came. Told him I don't really orgasm from penetration alone, so he pulled up his pants and said \"oh, but I finished.\" \n\nHe reached out today asking me to come over again but honestly I have no desire to do that again. How do I tell him that I don't want to sleep with him again? And if I do, do I share the concerns above? Will this end our friendship?\n\n\nEDIT; \nI don’t want anything from him. Just to go back to the friends part. Like I want to revert the fuck buddy back to just buddy. I was horny and he was available and I genuinely like spending time with him as friends. He's the biggest commitment phobe and is undatable. Just sad he is also unfuckable. I wish I didn't break the platonic boundary. However as his friend I also think he needs to know that if he is going to be a forever bachelor he should at least know how to make those women orgasm. \n\n\nTLDR; Fuck buddying with a selfish man in bed and don’t know how to tell him I don't want to anymore and ruin the friendship.",
        "permalink": "/r/relationships/comments/uhuv15/how_do_i_28f_tell_my_situationship_36m_that_i_no/",
        "comments": [
            "I will no longer fuck you because you are selfish in bed.",
            "Be straight forward, no need to worry about hurting his feelings, he clearly didn’t care about yours.",
            "shouldve stopped as soon as he didnt even do foreplay for u lol",
            "Depending on how close you are as friends and how much you care about this friendship: \n\nStraightforward Honest: \"We discussed mutual pleasure beforehand. Nevertheless, I became a Fleshlight. I don't want to teach you to fuck well, so I'm not interested in continuing this further. Good luck.\"\n\nVague: \"I think we're better as friends. Thanks, though!\" \n\nPassive Aggressive Honest: \"Lol, no.\"",
            "\"Nah, you didn't really care about me having a good time. Let me know if you want to get together as friends though!\"\n\nIf he cares about the friendship, he will offer to do friendship things. He probably doesn't, so expect this relationship to be over.",
            ">How do I (28F) tell my situationship (36M) that I no longer want to fuck him because he is selfish in bed?\n\n\"I don't want to fuck you again because you are selfish in bed.\"",
            "“Me and my clitoris are breaking up with you.”",
            "How is a guy 36 and that bad at sex and unaware of it? That’s a bummer",
            "Ladies, PLEASE stop giving oral sex to men who will not give oral to you!!!\n\nOP, just tell him the truth. There’s not point in sugar coating things.",
            "Just send him this link. Man is not very bright.",
            "He's clearly not a friend, a true friend would care about your pleasure even if you guys aren't in a relationship.\n\n\"I don't want to continue our thing bc I don't receive the same I put into it. Id rather play piano w my hand, thanks\"",
            "Hmmm- wonder how much business a Sexual Surrogate could bring in by offering a free pack of business cards printed with \n\n“No. You are a bad lover and I am not interested in having sex with you ever again.” \n\nOn one side \nand \n\n“Never want to get a card like this again? \nCall Sandra X, licensed Sexual surrogate, \nfor a free instructional booklet and list of fees & services!”\non the other.",
            "Easy \n\n\"I don't want to fuck you anymore because you are selfish in bed and I don't think you care enough to not be selfish in bed\"\n\nDone.",
            "Unfortunately I worry that more of your friendship revolved around his ability to have sex with you than I think you'd hope. I think now that Pandora's box has been opened there really is no going back.\n\nAnd honestly... could you? Like I know sex and friendship are different but there are certainly things that underpin both and you gave him the breakdown beforehand and he still proved horrifically unwilling to even try to make it work. I don't think I could ever look at someone that selfish and bad at lovemaking the same away again. \n\nBe honest about the experience but also be clear you do not wish to explore it again because rest assured: he will beg, plead, get angry and petty and vindictive about you giving him another 'chance' to 'prove' himself. Thing is, you already read him the riot act, you already did your due diligence. Just be aware it is very inevitably coming, even if you don't tell him why he will work it out.",
            "What everyone else is saying. You have no inherent obligation to perform the emotional labor of enlightening this person of his lack of reciprocity, misogyny, and probable porn addiction BUT apparently he needs informing in some capacity soooo ya.",
            "\"hey the sex was really really REALLY really bad for me. Not interested in sleeping with you again\"",
            "Literally say “you’re bad at sex”",
            "There is no friendship to ruin.  \nLet him know loud and clear.\n\nNo. I won't be doing that again.  \nand if he asks why, tell him.  \n\n\nI did not have a good experience.    \nI did not orgasm and you didn't care.  \n\n\nIt will end your friendship because he's going to have a ego meltdown over it either way.",
            "It sounds like you could’ve guessed it would go this way.\n\nYou don’t owe him anything, and if he takes it the wrong way, you didn’t need him as a friend anyways. Good luck OP",
            "Normalize telling men they don't know how to fuck. Straight up.",
            "“Hey can I come over?” \n“No thanks!”",
            "\"Brad, you were the most selfish lover I have ever been with, and I have no interest in repeating the experience.\"",
            "Just say “I don’t want to have sex with you. It was unpleasant.” Though I bet he turns around and says how crappy you were and how it was your fault.",
            "Life’s too short for a bad lay",
            "This is tough, because on one hand it would be very beneficial for him to hear he's selfish in bed. But on the other, I know many a man who would be crushed by hearing that. \n\nNot that it's your responsibility to protect his feelings. \n\nObviously the two options are you either are soft and vauge, protecting his feelings, but not really helping him in the long run. Or be blunt. Hurting him and helping him out in the long run. Possibly losing his as a friend. \n\n\n--------------\n\n\nBlunt would be something like this:\n\n\"Hey So-n-so, I'm going to decline the invitation to come over tonight, or ever again to fool around. Thanks for the invite tho.\"\n\nAnd when he replies \"did I do something wrong?\" you could just get into it.\n\n\"I felt like the sex was pretty one sided, and I'm not looking to teach a partner how to not be selfish in bed.\" \n\nIf he pushes for more info, then go hog wild with the blunt approach.\n\n\"I was pretty clear, that I'm looking for mutual pleasure in my hook ups and last night was not that. I think in the future, you need to work on being present with your partner, listening to them and their body, and focus on getting them off before yourself. Or at a minimum, getting them off after you've finished. Porn is not helping you in this area.\"",
            "He is a selfish lover. In my (limited) experience, this is not a problem you can fix without his explicit enthusiasm.\nHe doesn’t care about your pleasure. This can be an issue because if during the most intimate act between two humans he can be selfish, he’s probably selfish in other areas too",
            "If you being straight with him ruins the friendship, then he was not a real friend - he was just waiting to fuck you, sis.  Be straight with him, there’s plenty of other guys who won’t be so selfish in bed.",
            "It's not really your job to tell this 36 year old man he stinks in bed. It's your job to get out of this situation as physically, emotionally and mentally intact as you can. Women don't owe men growth over their own comfort.",
            "You can simply say the arrangement is not meeting your needs. \n\nI don’t think preserving a friendships with him really needs to be a priority right now.",
            "He's a situationship. You don't have to dance around his feelings. You're not friends, you're not dating.",
            "Tbh, up to this point, i wouldn't want anything to do with him.",
            "“No thanks.  Last time was really bad.  I’m telling you because I don’t think you’re a bad person and I hope that if you put a little effort into giving women pleasure some might want to see you again.  Good luck”.",
            "For the sake of every future woman he going to be with, I would be honest. \n\nTell him it wasn't enjoyable for you and he doesn't really seem to understand reciprocity. Tell him to read some books (written by women), stop watching porn (lesbian porn made for lesbians might be OK), and learn how to take feedback. \n\nIf you're game, you can offer him a redo session where you treat him the way he treated you so he can understand. \n\nAlso, i can't believe you put up with that bs. I would've called it way sooner and absolutely refuse to put a that in my mouth if he wasn't willing to try to please me",
            "OP, we would love an update on how he responds to the straightforward approach!",
            "Tell him exactly what you told us. He’s 36, it’s time someone tells him the truth.",
            "I’m in my early 40s and men around this age who don’t know or care about their partner’s pleasure during sex are the worst. I had a fuck buddy like that. And he was a DOCTOR. \n\nI usually just say “I’m really not interested in meeting this way anymore.” And you don’t owe him anything more than that.",
            "Say “go fuck yourself”",
            "I would say, no, you are terrible in bed, if you lost the friendship, oh well. The guy said “oh but I finished” to you. Great friend",
            "Drop him. Thank you, next!",
            "Be straightforward, because good lord girl that sounds genuinely fucking terrible.",
            "\"I don't want to fuck you because you are selfish in bed\"",
            "I just realized the majority of my sexual experiences have been similar to these. Masterbation but with the addition of your body. That hit me hard. \n\nCome to think of it the best sex I've ever had has been with myself. 🤔",
            "He’s a guy, use a sports metaphor.  \n\n“He was on the bench for years.  You finally gave him a shot.  He brought his “A game”, and it wasn’t good enough to warrant another start.”\n\nTell him, you didn’t let him have sex with you just because you thought HE’D enjoy it.",
            "What's peter pan syndrome?",
            "“No” is a complete sentence!",
            "Honestly, I wouldn't even engage in a platonic friendship anymore. What kind of friend is he when he's this selfish and exploitative.",
            "He def thought he nailed that interaction.  Millennial males got their sex education from the early internet and porn videos. Its because our boomer parents acted like sex didn't exist and it definitely shouldn't be enjoyed from a women's perspective. So we ended up with a generation of men who got their sex education from pornhub. Every last one of them think s3x starts with a blow job no matter what lol",
            "Just went through something so similar but there were other issues. Eventually I did talk to him but he kinda dismissed the issues and didn’t really answer my questions. We are still friends and he hits me up all the time now because we aren’t sleeping together. Just tell him you aren’t interested in sleeping with him anymore. He probably won’t care!",
            "\"Hey [name], I no longer want to fuck you because you are selfish in bed.\"\n\nHe had his chance. He blew it. Not much else to say, really.",
            "You just tell him you didn't enjoy the experience and you don't want to do it again.",
            "Tell him as bluntly as possible. Minimal effort on your part and honestly it’s probably the best for him.",
            "He sounds like a garbage person. Why do you want to remain friends?",
            "IMO, any guy who is not willing to listen and learn in bed does not deserve any action.",
            "I mean what did you expect? I am baffled. Just tell him he has shown you that all your boundaries will be crossed and tell him you aren't willing to sleep with him anymore because if he wants to get off he can simply get a flesh light.\n\nBut sorry from the first few sentences alone it was clear were this would go.",
            "If he's been that close of a friend you should tell the truth. If you don't, theres going to be a lot more dissatisfaction and sadness in this dudes future. Sorry he couldn't be a good game partner for you! Dude sounds like a virgin. Yikes!",
            "Be straightforward, because good lord girl that sounds genuinely fucking terrible.",
            "I would literally just send him a link to this. I would walk away from him in every way. You don’t need someone like this in your life.",
            "Give him the link to this post.",
            "Send him this post so he can get some real talk about how bad he is in bed.",
            "God this makes me cringe. How are you 36 and act so desperate to sleep with someone and then fuck it up? Like I'm 23 and in my first serious relationship of my life right now and we are crazy for each other. After each time we learn something new about the other person and its great. Like we were both basically virgins and the first time we did something we went crazy and it was all just instinct. IT'S LITERALLY BUILT IN TO YOU FROM THE FACTORY BRO! JUST LISTEN TO HER WHEN SHE TELLS YOU WHAT TO DO! It's so much better when your both invested and I can completely understand your frustration when he's just completely clueless and lazy about it.",
            "It's very telling that a 36 years old man doesn't know how to properly fuck a woman. Very sad. Just be honest with him I guess",
            "Be straightforward tell him the sex is crap it’s not going to work out and it would be better if we are just friends simple. Might wanna also tell him to lay off the porn and try to listen to the woman more so he doesn’t ruin any future FWB situations or more",
            "Honestly.. how invested are you in keeping him as a friend? Because if you’re not SUPER married to that idea… let him read this post. It’ll either hurt his ego so bad that he gives future girls some real effort OR he’ll appreciate the honest dynamic and respect you for being willing to say what needs said. Judging by literally everything you said about this man, I’m going to hardcore assume he’d quit talking to you. So if that’s NOT what you want.. then just tell him you’ve changed your mind about having a fuck buddy due to whatever benign personal thing you make up for the occasion. And tell him there’s zero chance you’ll have sex again so if he values you as a friend, to not even bother wasting any future conversations about it. Price is firm, no haggling",
            "Girl run you can do better",
            "I no longer want to fuck you because you’re selfish in bed.",
            "Tell him, no thank you, we are better off as just friends.  If he insists than tell him he doesn't do it for you sexually. If he still insists than detail it all for him. I had a similar scenario, I told this man the whole business of squishing my boobs like he's kneeding bread doesn't do it for me and sent him a p'rnhub link on how to find the g spot and pleasure women.  Good luck some men have fragile egos.",
            "Just say no.\n\nAlso, a dude being 32 and pining sexually after a 24 year old you nonstop, even as 'friends' before, doesn't sound like the type who will go back to being friends without a problem, or just reject the idea of friendship at all.\n\nWhen he asks you to come over, say 'I won't be coming'. Or better yet, \"I won't be coming, since I've never been cumming. Let's just stay friends, or part ways.\"\n\nAnd I recommend not going back. I've been with a lot of dudes in my short lifetime (and I'm 7 years younger than you) and there's a big difference between 'this guy wants to actively change and improve on sex', and 'this guy is just using me since there's no blow up dolls or other girls who would tolerate this sex that gets me so dry I could start a mini fire down there'. Him not caring about your orgasms in favor of his, ignoring your discomfort, and more are.... all red flags that could lead to a bad situation.\n\nI've been in a bad situation, and since I don't want you to have one, OP, I suggest just breaking things off and if he keeps pleading, or tries to have you over alone again, just turn him down and set boundaries for only public, daytime, or group hangouts. That'll probably be the best way to get the no sex point across.",
            "He is using you as a cumsack and you're worried about his feelings. I would not even be friends with him.",
            "he sounds like he sucks. (like, as a person, because clearly he isn't interested in reciprocating oral). I wouldn't be interested in a friendship with a person so blatantly selfish and uninterested in the needs of their intimate partner",
            "Be very honest, he's gotta wake up to reality soon enough. The guy is 36 ffs haha",
            "“I don’t enjoy sex with you and don’t wish to do it again. I have no problems with you on a personal level though, and really hope we can maintain a friendship”\n\nYou don’t have to be sensitive with his feelings. For once, this isn’t about him, and you need to make it known that your needs matter too.",
            "Future endeavor his selfish ass.\n\n\"Unfortunately due to the unforeseen circumstances of you being a lousy selfish lover I am notifying  you that I will be going another way in regards to my sex life.  Good luck on your future endeavors.\"",
            "Just tell him exactly that... if a man is selfish in bed he obviously doesn't care about your feelings, so why bother trying to spare his? Every woman he disappoints in the future will thank you.",
            "Yes, he's horrible in bed, just tell him that. \n\nOn another note, why tf would you have unprotected sex with him",
            "Wouldn't it be cool if it was safe to be honest with men about this sort of thing? Like that we wouldn't have to worry about a violent response or further harassment or stalking after breaking up with them? That would be real neat.",
            "Let me get this straight.\n\nYou don’t want to date this guy, just have sex with him. The sex is bad because he’s super selfish. \n\nJust stop having sex with him ?",
            "I actually wouldn't worry about his feelings at all, just tell him exactly how you described it to us. Maybe put in a few extra rude words. If nothing else, he should understand pure logic: if you don't come, you are not motivated to get down with him again. You gave him a chance, he blew it, end of story.",
            "I can see him going all nice guy on you. Just be prepared",
            "He sounds like a virgin whose entire experience of sex come from porn. From my own experience, this doesn't get better and you end up feeling like a blow up doll. It doesn't matter what you say or do or how much you show him, he'll do a token amount of foreplay, not enough to get you off, and then back to jabbing away.",
            "I find that a lot of men think porn is how... Being a lover isn't finding the camera",
            "Don't try and be his sex teacher, it sounds like a thankless task. You had a long conversation about what you like and he then ignored all of it. If you want to do him a favor send him the link to your post, but as you say, he sounds unfuckable.",
            "Just tell “No, I don’t want to fuck you anymore and you need to search for someone else. Bye.”\n\nDon’t overthink it, just tell your boundary and if he’s going to whine block him everywhere and let him boil in his own sadness. None of those are your problems.",
            "Send him this post.  Pretty much outlines why he’s a bad lover.",
            "I guess by telling him you don't want to fuck him because he's selfish in bed?",
            "Don't explain the full details, just tell him you've decided you aren't interested in anything sexual with him going forward. If he asks why, just say you didn't feel a sexual connection that worked for you.",
            "If porn is where he learns all of this from, show him Japanese porn. They have extra long foreplay sessions. He might learn from there. \n\nIf it still doesn't work, then all the other people's advice here seems good.",
            "You can just say he’s better off just a friend without benefits. You’d rather not have a sexual relationship with him and take a little break.",
            "\"Hey sir, I no longer want to fuck you because you are selfish in bed. \"\n\nYou are welcome.\n\nAnd dude... why did you fuck more than once a guy almost ten years older if he didn't make you cum once. That must hurt your pride",
            "Sounds like he is getting revenge for being in the friendzone. He doesn’t care if you get off because he feels that you shut him down for so long. Just a theory.",
            "Someday, there might be a woman who wants to spend the time to teach him how to please her. That woman is not you. You can be kind to him and tell him that you had no fun, or you can be mean and tell him that he is no fun in bed. The two are different, and ultimately it's up to you to decide which is appropriate.\n\nBeing told I'm not good in bed would suck, but it would tell me I needed to up my game. Again, you aren't under any obligation to tell him.",
            "36 M and still finding punanis ?? All the best to his life",
            "I really don’t think you’re genuinely friends. I think he views you as a sex object and that you need to raise your standards to where you say they are.\n\nIf you truly believed what you said you wanted it’d be amazingly easy to drop him after you explicitly told him what you wanted and he showed you he wasn’t it.",
            "[deleted]",
            "Use English.  Small simple sentences if necessary.",
            "I had a woman \"friend with benefits\". I never saw her as a friend, she never saw me as a sex buddy. Somehow, it happened and lasted 3-4 months. I did not keep friendly relationship with her, as It was something that I did not intent initially. So, I am good with that, and she moved on. Normal.\n\nMeet him for a coffee and tell him your feelings. e.g.:  \n\\-\"I'm done. You are selfish. You care about you, only, and the sex with you is no longer a pleasure. Friends with benefits period is over. If you wish to have my time, respect my feelings and keep it straight friendly level. Else, we separate ways. Enjoy your ..coffee/food.. now\".",
            "he won’t really care he already got what he came for regardless and probably for free",
            "friendship?? lol. please just be straight forward, break it off and stop with this friendship nonsense",
            "Even in porn, it teaches you how to pleasure a female...wtf has he been watching?!?",
            "A lot of times people need to be taught how to do things right I don't know if you're the teaching sort but I think maybe if you explained to him that he was not doing a good job he might want to learn how to do his job properly.  Men often like learn how to properly do a job whether it's fixing a car or building a deck etc, and if they don't know how to do it they often still give it theyre best while being clueless as to how poorly they're performing.  If he's willing to learn I say give it a shot... he probably didn't want to come off as completely incompetent so he tried his best mimic poor source material.  ... It might be kind of fun watch his skills develop and see him learn how to be emotionally present and receptive to your needs",
            "Oh wow, you’re about to lose a cool friendship because you decided to have casual sex even though you knew he is childish even at age 36? Who would have thought huh",
            "He might have just been super dumb cuz he was having sex.  I drop like 50 IQ points the first time im with a new girl.  Lay down the law before the sex and let him know he needs to listen to you and follow your instructions if the fuck buddy sutuation is gonna continue.  I'd give him one more shot, and if he can't listen, put on ur pants and leave.",
            "“Nah, I’m good. Don’t have any need to do that again.”",
            "Say, \"No thank you\" and leave it at that",
            "Your surprised laughter may be appropriate.",
            "Ghost. Situationship warrants nothing.",
            "“We are not sexually compatible, so we will not be having sex again”",
            "Could you tell him the same way you mentioned it in your caption?",
            "Just be completely honest. It sounds like a not fun experience",
            "\"I longer wish to continue having sex with you because you are selfish in that area. Examples of that are ___, ___, and ___,\"",
            "Just tell him. Why beat around the, uh, bush.",
            "This is the advice I give my friends their SO says they can change after not changing for too long...\n\nTell them:\n\n* \"I think you can change too.  \n*  I can even point you in the right direction on how to change.\n*  Our relationship has become tainted by this problem. \n*  I want you to change for the next person\n* If we're together you may return to old habits and I can't deal with that.\n* Just because we're not together doesn't mean I hate everything about you.  It means I don't want to date/be with you. \n* Good luck\n\nThen if they ask for help, honestly give them a idea of the problem and how they can improve.  Reiterate that even if they improve, the relationship as it is is over.",
            "Youre only doing him for the sex so if its bad just stop having sex with him. Dont reply to texts. If he asks whats going on, say the sex was bad and you think thats what he wants",
            "Since you want to remain friends tell him that, you realized after having sex that you are better as friends and not in a fwb type of way. If he ask any further questions then tell him the truth",
            "I would say it is probably best that you let him know you aren't interested in continuing anything beyond platonic with him. It's completely up to you on how you decide to phrase it but ultimately if he decides to discontinue the friendship over it he was never a friend to begin with.",
            "Yeah just end that. Tell him why.",
            "You sit him down and say \"I know longer what to fuck you because you're selfish in bed\"",
            "Read the title out loud for him, start from \"I no longer\" till \"bed\"",
            "Be straight, 'yeah, you can come over to hang out, but just letting you know our friends with benefits thing, is not going to be 'with benefits' again, are you good with going back to just mates'\n\nIf he asks why, or tries it on again, you can tell him that for 'friends with benefits' to work, it has to 'benefit' both of the friends, and you weren't getting any.   Depending on his personality, he may try to promise improvement, then tell him, you did try to give him direction, for what ever reason, whether skill or effort, it didn't help.",
            "\n'I didn't want anything I was just horny'. It sounds like both of you needed to masturbate. Just don't have sex with them again, say it was a one and done. Messy post this is.",
            ">However as his friend I also think he needs to know that if he is going to be a forever bachelor he should at least know how to make those women orgasm. \n\n\nThis absolutely this! But he's 36 FFS! Maybe he should stick to fucking blow-up dolls, the basic models only. He's really not fucking at any ability above this. I'm sorry the whole fuck buddy thing didn't work out, but I could never have done this with my male friend. He was like a brother to me, so just no, unfortunately he did repeatedly try & get with me, which got awkward. Thankfully those days have passed, we're happily married & my eldest is almost the age my friend was when we met, so we get to feel old thinking of that...which is not so fun....\n\n\nDo you have that one ex that was great in the sack, just not so much as a boyfriend? That's the safest & best option for a fuck buddy. Obviously, neither of you can have the slightest interest in being together again, but if your both single. It has the bonus of already knowing how to get each other off."
        ]
    },
    {
        "post_id": "5lms23",
        "author": "gawsharon",
        "title": "I (21F) set up a date between my two friends (29M/25F). Something went wrong that night and now my guy friend won't talk to me.",
        "url": "https://www.reddit.com/r/relationships/comments/5lms23/i_21f_set_up_a_date_between_my_two_friends_29m25f/",
        "score": 2187,
        "num_comments": 107,
        "created_utc": 1483382437.0,
        "selftext": "I met my friend Chuck (29M) about 1.5 years ago. We were both part of an online local group for single parents, and eventually met offline with other group parents. I have known Britt (25F) since high school. \n\nChuck's wife died of childbirth complications the day their daughter was born, more than two years ago. Britt is a few months out of a 9-year relationship. Both of them have expressed wanting to meet other people, and I thought they'd be good for each other because of common interests and we all have kids of similar ages. \n\nTwo days before Christmas, Chuck and Britt went out on their first date. I kept Chuck's daughter at my house so the two could have some more time together without him having to worry about the baby.\n\nThe plan was for her to spend the night (she's done it before and gets along great with my 3 year old girl), but Chuck knocked on my door at 11pm to get his daughter. He barely said a word to me and I could tell he had been crying, but he wouldn't tell me what was wrong. \n\nThe next day, I asked Britt what happened. She said that they had dinner and a couple drinks, things were going excellent. She said she felt like they had great chemistry and were even getting physical at his house, but he suddenly told her to stop and to leave immediately. She swears that she has no idea what she did wrong and is really hurt by the whole thing. I believe her because she is really sweet and social, I've never seen her do anything to piss anyone off. \n\nI tried to talk to Chuck at the same time to get his side of the story and see what went wrong. All he said that he \"wasn't feeling it\" and didn't want to discuss it further. I didn't push it, but when I went to wish him a merry Christmas a day later, I saw he had deleted me from his social media. I texted it to him instead and asked \"you okay?\" but no response. \n\nI am seriously hurt and don't know what to do. Chuck has become one of my closest friends, and our daughters are the best of friends too. I am really worried that this has something to do with his wife, and I want to apologize if he felt like I was pressuring him to date after her death. At the same time, I don't want to overstep boundaries and bother him when he's having a hard time. It's been over a week and I'm worried/upset. \n\n**tldr: I set my two friends up on a date. Things were apparently going well until my guy friend suddenly called off the date. He has now deleted me from his social media and will not talk to me.**\n\n**EDIT: Someone mentioned that Chuck may be in love with me, but deleted the comment. I still want to address that. He's almost a full decade older than me, and has never expressed those feelings for me at all. In fact, the week before he cut me off, he said that I was a great friend and he was happy that his daughter had some female figures in her life.**\n\n**EDIT 2: Thanks for all of your advice, everyone. I think I will give it another week before I speak with him again. If he hasn't reached out by then, I will tell him that I am still here if he needs to talk but I will continue to give him space if he needs that, too. I am almost 100% sure that this happened because of his wife's death. Another one of my friends who is still on his Facebook saw that he had changed his cover photo several times since Christmas, and all of them were from his wedding.**\n\n",
        "permalink": "/r/relationships/comments/5lms23/i_21f_set_up_a_date_between_my_two_friends_29m25f/",
        "comments": [
            "chucks daughter will be a constant reminder of his late wife. he still hasnt finished grieving and /or isnt ready to move on.\n\nGuilt about enjoying female company and getting physical contact will be huge.\n\nHe would feel he has to hide emotions from his daughter about his late wife. he has locked them away and is doing the same thing now.\n\ngive him time and let him know you are there when he is ready",
            "[deleted]",
            "Chuck is still grieving and overestimated how ready he was to date again.\n\nLet him work it out in his heart. He may just need some time to process the fresh wave of grief he just experienced. He may not have the words or the energy to talk about it yet, and is withdrawing so he doesn't have to, because of course he knows you're wondering what the fuck happened that night. He's probably embarrassed on top of everything else. \n\nJust give him space. You're a friend, not a caretaker. He'll come around when he's ready. ",
            "Thanks for all of your advice, everyone. I think I will give it another week before I speak with him again. If he hasn't reached out by then, I will tell him that I am still here if he needs to talk but I will continue to give him space if he needs that, too. I am almost 100% sure that this happened because of his wife's death. Another one of my friends who is still on his Facebook saw that he had changed his cover photo several times since Christmas, and all of them were from his wedding.\n\nI'll give an update if anything happens. I'm honestly surprised at how much attention this got. ",
            "It sounds like he's not ready to be dating, and he's displacing that guilt on you as you were the one who set it up (with completely good intentions) and now he feels you're responsible for how he feels.\n\nMy suggestion would be to wait it out, it could take some time, weeks or months. If you continue to contact him often it will only make it worse and push him away. I would let it clear, a couple weeks, and maybe once more reach out with an apology again saying your friendship and each other's daughters' friendship means a lot to you. If he cold shoulders you again, you need to move on. Unfortunately, life is a set of friendships that pass as our lives continue where they need to head.",
            "Chuck has only been a widow for two years. This is probably his first date since her death. He probably feels guilty for being with someone new. ",
            "Oof. He's still grieving. Definitely. Losing someone you love is a deep wound that never fully heals. It's not your friend, it's not you, it's a him thing, please understand that. Please tell your friend this too.\n\n\nI _heavily_ suggest grief counseling to him, especially if the kid is a look a like of his late wife. Unpacking that baggage onto an already grieving child will really hurt that child in the long run if not properly addressed",
            "He has unresolved issues with his wife. Give him space for a while. Being out with your friend probably brought up lots of memories. Not his fault. All you can do is give it time and be there for him. Let him bring it up in his own time if he wants to discuss what happened.",
            "I am about 99% sure Chuck was struck by a sudden feeling of cheating on his wife, compounded by a massive revival of grief and missing her. \n\nYou probably need to talk to Britt first, because she's the 'easy' option: What she's hurt by is a totally normal feeling of rejection and offense at not being treated very well. She's likely to become significantly less upset by it all if she is able to see the events as purely being about Chuck being sideswiped and overwhelmed by emotions relating to his wife's death, and as having nothing to do with her other than that she had the terrible luck to have gone on a date with a guy who still loves his wife.\n\nChuck is probably dealing not only with guilt and grief, but also he's no doubt aware of having hurt Britt's feelings. On top of that, I would say there is a significant chance he's also really embarrassed about losing emotional control. Probably also some misc. anxiety about dating while being sole parent of a small child.\n\nAll in all, I don't think you did anything wrong by setting them up together, but it wasn't likely to go well because going back into dating after the death of a loved spouse hardly ever does (at least, at first). Which is not something you (or either of them) would be expected to know, unless you'd seen someone else go through the same thing. \n\nI don't recommend waiting another week for Chuck to reach out to you because that is potentially a week of Chuck spending a whole lot of time inside his own head thinking unhappy thoughts. Instead I suggest a text or email (something that does not demand an immediate response) telling him what you have planned to say as per your second edit. Then a week later go actually talk to him.\n\n",
            "Someone mentioned that Chuck may be in love with me, but deleted the comment. I still want to address that. \n\nHe's almost a full decade older than me, and has never expressed those feelings for me at all. In fact, the week before he cut me off, he said that I was a great friend and he was happy that his daughter had some female figures in her life. ",
            "Give him a little time, and send him a note reminding him that you certainly aren't angry, or upset, but that you care for him deeply and hope with time he can come back into your life. \n\nMaybe say you want to understand happened, but that you don't need to know if he doesn't want to talk about it. And that neither you nor your friend will hold it against him.  \n\nHe *probably* is embarrassed, humiliated etc. But after the initial shock, he might not know how to open the door to you again after behaving badly. If you give him an opening, he might take it.  \n\nBut, he might not.  Be prepared that he might not be able to get over it. ",
            "I'm really sorry all of this happened and you lost a friend.  However, there isn't much you can do.  You've already reached out and he's made it pretty clear that he needs space.  Maybe text him again in a few weeks, but for now you should just respect his need for space.  I know it hurts because you want answers, but pushing him to talk before he's ready will only hurt the friendship more.",
            "Their date wasn't that long ago, I would give him some space and then try reaching out again in a few weeks. Hopefully he's processed some of the negative emotions and he's realized you were just trying to be a friend.",
            "This is the time of year when people especially miss deceased loved ones so he was probably feeling bad a little already and now feeling guilt about moving on.",
            "He misses his wife. Maybe his first physical intimacy since losing her.",
            "Give him a little bit of time. Let him know you're still there for him, but it sounds like he has to work on this himself. \n\nHe may have not been as ready to move on as he thought he was. ",
            "I can't imagine the pain he's going through.  The best you can do is let him know you're thinking about him and will be there if he needs to talk. ",
            "This is not really your fault, or either of your friends'. It sounds like they moved too fast and he freaked out. Probably he was not as ready as he thought he was and regretted it. I would give him some space and let him contact you again when he's cooled off.",
            "Chuck has issues, it's not your or your friend's fault.  It happens.",
            "He probably wasn't ready to date yet but tried to anyways. Just needs time and patience ",
            "Maybe your friend reminded him of his wife and he found that really hard. Losing your wife in childbirth is fucking terrible. It will take him a long time to get over it and not feel guilty about trying to move on. ",
            "It seems possible, that if he was as abrupt as your friend suggest. She probably did something that reminded him of his wife and it just set him off. He freaked out and has now kind of lashed out as a way of dealing with his grief. The deleting you could be a freak out and possibly becuase of some sort of anxiety he's feeling about it all. Give it time. Like others are saying give it a month and then text him, he'll likely come around.",
            "He wasn't ready to date but wanted to see if he could.  It didn't turn out so well and he is clearly embarrassed by it.  I don't see everything that he's done as something out of anger but out of severe embarrassment.  So unless it wasn't something else then I'm guessing he is just not ready.\n\nProbably feels he let... \n\n- you and your friend down by having it end up the way it did.\n\n- himself down by reacting the way he did.\n\n- his late wife down by going on the date in the first place.\n\nPersonally though, I think it's great that you would try to set him up with someone.  You had the best intentions it's just that he wasn't as ready as he thought he was.\n\nGive him a little bit of time or try communicating with text if you feel it's appropriate.  If anything just let him know that you're there could ease things a little.",
            "It sounds like it might have been a rush of emotions that just overwhelmed him. If things were as your friend says they were, things were going great until they weren't and now I would bet that he is super embarrassed by it, and that's why he isn't talking to you. \n\nJust my theory.",
            "Why are you hurt?  If he had an emotional episode and became overwhelmed that has nothing to do with you or anyone else.  It has only been two years.  That's not a long time honestly.  He maybe embarrassed about shutting it down and freaking out and that's why he's not wanting to talk to you.  Give it time and just wait him out but don't push him to talk to you.  That could have the opposite effect.",
            "Is it possible to write him a letter? Like you said, it really does sound like he wanted to give dating a try but found he couldn't bring himself to do it due to his wife. ",
            "\"He's almost a full decade older than me.\"\n\nI can tell you now, as a man, that being a decade older than a woman does not prevent you from being attracted to her, or even loving her, in any way shape or form. It might be less socially accepted than dating women your own age, but attraction is not logical and doesn't give any kind of crap about what's socially acceptable. ",
            "This seems a lot like a personal issue he is working through, and has nothing to do with you or your friend. While he doesn't seem to be handling it well, there isn't much you can do if he is so adamantly pushing you away. Try not to be overly offended and let him work through his grief. most likely he will be back around. ",
            "He may not be over his wife. It's still early to bother him. Let it pass and he may come back to tell you. ",
            "I definitely think Chuck feels some sort of guilt/betrayal over the date and those feelings expanded over to you but not because you set up the date or he has feelings for you.  I think maybe he started feeling guilty about your role in his life and his daughters.  He told you he's happy to have you as a positive female in his daughter's life which to me translates into you are a mom type figure for his daughter.  I think he's feeling guilty for wanting to replace his wife in her partner role with the date but also in her mom role with you.  It's not your fault and hopefully you can repair your friendship, it seems important to everyone involved. ",
            "He is feeling extra sensitive around the holidays. Perhaps the next time he is interested in meeting someone you can all be there to help take the pressure off. Hanging out, making dinner. Slow small steps. I imagine his daughter's birthday is also a very tough time for him. ",
            "This is so so sad. Make sure you talk to britt about chuck's remorse so she knows she didn't do anything wrong",
            "Sounds like a hot mess.\nHe's dealing with a lot of baggage. Feelings for the deceased, feelings of guilt of feeling good, feelings for OP and feelings for friend.   Sounds like he just can't cope with his feelings right now.  \nJust sayin'",
            "Just let him know you're there for him, if ever he wants to talk or needs a friend. Then let him come to you when he's ready.",
            "He's not ready to move on, you shouldn't be hurt.  Sometimes you don't find that out until you try.  ",
            "Im the one who mentionned he might be expecting romance with you, and I didn't deleted the comment, I got downtvoted into oblivion.\n\n\"\"EDIT: Someone mentioned that Chuck may be in love with me, but deleted the comment. I still want to address that. He's almost a full decade older than me, and has never expressed those feelings for me at all. In fact, the week before he cut me off, he said that I was a great friend and he was happy that his daughter had some female figures in her life.\"\"\n\nYou mean, like a new mum? A great friend just need a little intimacy and mutual attraction to become a SO: common interest, trust, respect are already there. READ THE SIGNS. Being a decade older never prevented men to be romantically interested in younger ladies... the fact you use it as a demonstration might indicate you don't want to see he may be into you while still mourning his wife. Thats perfectly legit but people feeling rejected might try stuff (like dating your friend) and/or cut relationship.\n\nI'd say the biggest problem with the sub is that its always one sided, and people sometime can be not fully aware of the other people signs and communication. Its still a theory. \n \n\n",
            "Maybe he felt like having her sleep over our him sleep over on the first date was too fast and it freaked him out.",
            "Maybe text him, tell him you love him and it's ok if it was too soon and you are there for him when he is ready to talk. It's probably embarrassment / profound sadness / overwhelming guilt all mixed together. Tell your girlfriend the same -- he must not have been ready, don't take it personally. I'm so sorry for all involved :(",
            "You didn't do anything wrong here, but he clearly needs some space as he is dealing with heavy stuff.  You're doing the right thing by giving him that space.  He'll get back in contact with you when he is ready.\n\nAlso, I know you've addressed this, but you should know that the 10-year age difference doesn't mean anything when it comes to having romantic feelings for someone.  My husband and I are 10 years apart, and I know many couples with that type of age difference or greater who have successful relationships.  I doubt that is playing into this situation for him right now; he may or may not have feelings for you, but right now it seems like he is dealing with grief first, then everything else second.  You may also want to consider the possibility in the future that if he finds someone he wants to date seriously, his friendship with you may not survive the new relationship (out of deference to his new girlfriend and whether or not she is comfortable with him being close friends with another woman).  It happens a lot.  It's certainly not fair, but it is a reality.",
            "Is it possible he is into you? ",
            "I don't know exactly what the deleted comment said, but from what I can figure out, it was about him being in love with you. That is the obvious answer to all this, I'd say. A decade older is nothing. He might not be good at expressing feelings, but saying he's happy his daughter has you in her life sounds to me like an expression of interest. \n\nImagine if you had a man in your life who was great with your kids and whom you often told how happy you are to have him. But you never really knew how I express your love for him. But things go well, and you think he should understand by now that you are in love with him. Then he says he has this great idea. You could date his friend!",
            "He realized you consider him a friend. He clearly expected more.",
            "He wants to bone you, and you sent your friend.  Now he realizes you see him as a grenade that someone else should lie on."
        ]
    },
    {
        "post_id": "uvwozf",
        "author": "coldconfusedannoyed",
        "title": "UPDATE I’m (23f) getting cold feet about my relationship with my partner (26m) now that he has taken an interest in planning our future together.",
        "url": "https://www.reddit.com/r/relationships/comments/uvwozf/update_im_23f_getting_cold_feet_about_my/",
        "score": 2181,
        "num_comments": 71,
        "created_utc": 1653299870.0,
        "selftext": "Original Post:\n\nhttps://www.reddit.com/r/relationships/comments/uejh2n/im_23f_getting_cold_feet_about_my_relationship/?utm_source=share&utm_medium=ios_app&utm_name=iossmf \n\nSo it’s been about a month, and I thought I should update as a talking things out with commenters really pushed me into realising that the relationship desperately needed help.\n\nI asked him to do couples therapy with me, and although hesitant at first he agreed to give it a go. I found a provider, we had a look through profiles and chose one together, and then sent in our expression of interest within an hour of my asking. She responded two days later, and we had our first session booked in for the end of the week.\n\nKnowing he was hesitant, we gave the TV show ‘Couples Therapy’ a go, accidentally starting on season 2 which I think may have been a blessing in disguise as those couples made a lot of positive progress. This ended up being a really good idea! My partner was far more open to therapy when we started and really threw himself into it, and it actually helped me to start identify to some of my problems (looking at Michal’s anxiety there, although minus the anger and aggression towards her partner).\n\nI’m not going to go into detail with the stuff that came out, but even after just two sessions we understand each other so much better. We’ve got a lot of work to do to overcome things, but just understanding where our behaviours come from goes a really long way to wiping out the resentment, and helping us connect and communicate.\n\nIt’s safe to say we’re both carrying childhood trauma, which I think I was less aware of on my side. Like I knew my family dynamic wasn’t necessarily healthy growing up, and I have a complicated relationship with my parents as an adult, but I didn’t realise how much baggage it had left me with. \n\nI feel more comfortable going into things from my side, so I guess I’ll talk a bit about that. I never really had any safe attachments growing up, and I struggle a lot with feeling safe in relationships (both romantic and platonic), and with trust. I didn’t even realise! I thought struggling with vulnerability and the way that manifests for me was completely rational and normal, but in retrospect of course it isn’t. \n\nSo some commenters suggesting that maybe I was overreacting, or that maybe it wasn’t just about the one situation, you were right! Just maybe not in the way you were expecting. It wasn’t just about the financial advisor, it was about two adults with childhood trauma trying to be better people together who needed a bit of help.\n\nI know this is very vague on things from my partners side, but that is not really for me to share. I am however incredibly proud of him for opening up in the way that he has, and I’ve learnt so much about him as a person that he’s struggled to talk about before. Therapy has reaffirmed that he is the person I want to spend my life with, and has shown me that we’re both willing to put in the work to make that happen.\n\nI’m excited about where this journey will take us, and about the future we can build together. We’re a great team and a great couple in a lot of ways, and the support we’ve been able to give each other as we’ve begun digging into our respective traumas has made me feel really positive about the relationship and where we’re going, and that the things we’re struggling with are things that we can overcome together (with a little help from our wonderful therapist of course).\n\nTl;dr We started couples therapy and it was the best idea I’ve ever had. I will recommend therapy to everyone I meet for the rest of my life. I still have not learnt to not use long, run-on sentences.",
        "permalink": "/r/relationships/comments/uvwozf/update_im_23f_getting_cold_feet_about_my/",
        "comments": [
            "Great news that things are going well! I feel like we owe so much of the success of our marriage to pre-marital counseling.  My favorite part was the analysis of our childhood upbringing and trauma and how it plays into our behavior and decisions. My husband and I both were able to overcome most of those issues once they were identified. My other two favorite parts were the approach to money and how to have a respectful and productive fight/disagreement. All the best of luck to you two!",
            "I only found your update but I read your previous post and a loooot of comments and I'm glad you engaged so much there! You come across as very insightful, thoughtful and open and I'm so happy for you that your partner is matching that with the help of your therapist! It's a fantastic step and progress and I wish you the best of luck moving forward!",
            "The comment about understanding where a partner’s behavior comes from helps reduce resentment is such a huge thing. Obviously, it’s not an excuse for destructive or hurtful behavior, nor does it ensure compatibility, but it can make something that was developing into a dealbreaker into something that’s acceptable in a long term partner.\n\nAlso, OP, individual counseling/talk therapy can improve your happiness and quality of life in general. You seem to have identified some things in the couple’s counseling, and your husband too, that could use some attention outside of couple’s therapy. My wife and I go as needed to individual counseling for our respective foibles.",
            "I've only had two loves in 50 years. They were very different people. Both died, one sudden awful surprise, the other slowly and we had chances to say goodbye and prepare. \n\nThey were quite different personality wise. You know what was defining in each of them was their quality as a partner. They were my best friend, they were great lovers. But the partnership with each was defining. How they'd tune in, even to the most difficult conversations, and give them their all. They had the courage to face right up to the hard stuff, so those issues passed quickly and we were in it together feeling made such a difference. I've had other lovers, I've had other best friends, I've only had two partners. \n\nI hope, I hope everyone, finds a great partner. If you're going to go through all that life can throw, a terrific partner along side hand in hand and heart to heart, makes all the difference in the world.",
            "Thanks for sharing your story, and specifically your side of the story without oversharing your partner’s story.  \n\nI hope things keep getting better for you two!",
            "Reading this, makes me think therapy shouod be required for everyone growing up",
            "aww I love this update! I’m so happy and proud of you two because putting the work is hard, but deciding to put in the work is a huuuugeee step that a lot of people are not brave enough to takes\n\nYou shared a few things of your partner and he reminds me so much of me. I started going to therapy, digging a lot into myself, and realized I have a fearful avoidant attachment. I would suggest taking a look at attachment theory, it really has been wonderful to learn more about myself.",
            "So...reading your other thread and some of the issues, are you sure he even wants kids? You said he would clam up when that part (among others) of the conversation came up. I saw that was one of your needs in the near future (a few years will go by lightning quick).",
            "A lot of what you wrote in your original post resonated with me, and it is for this reason that the reference to your childhood trauma in this update was not a massive surprise. When we struggle with vulnerability because we couldn’t really rely on loving support, we can adopt controlling behaviours without realising. I am glad you two are doing so well with couples therapy; you are an inspiration already at your young age! Thanks for posting and all the best!",
            "#THIS IS AWESOME!!\n\nThere are SO many stories on Reddit that end badly.  Some days after a couple of posts, I lost faith in humanity.  It’s life-affirming to hear a positive result!",
            "Happy to hear that y’all are doing well and learning about each other - i hope you keep going and continue even when things are going well",
            "I LOVE Couples Therapy! I've already informed my husband that should we ever need couples therapy, we're going straight to Orna. No questions asked.",
            "Man's just had a break up because we seemed to have incompatible bits.\n\nI think we were too early for that step.\n\n  \n\n\nBut I wanted to say how lovely it is that things worked well for you guys! It's wonderful!\n\nFills me with a bit of vague hope",
            "I would be wary still. He doesn’t listen to you, and that shows a serious lack of respect and consideration. \n\nDo you *really* want to have to push, coax, cajole, beg, repeat, drag, push, pressure, coax, etc. him about everything? It’s *exhausting* and will get much worse once you have kids. \n\nThe amount of emotional labor after having kids is way worse than what you are already having to do to get him to engage already. \n\nFind someone who actively wants to be with you! Why settle? Don’t you think you deserve better?"
        ]
    },
    {
        "post_id": "6z8pia",
        "author": "BadTungusic",
        "title": "My [25f] boyfriend [24m] got a fake number pretending to be my ex [25m] just so he could talk to his ex girlfriend [20f]",
        "url": "https://www.reddit.com/r/relationships/comments/6z8pia/my_25f_boyfriend_24m_got_a_fake_number_pretending/",
        "score": 2183,
        "num_comments": 169,
        "created_utc": 1505055977.0,
        "selftext": "Sorry if this title is confusing, I will explain best I can.\n\nMy Boyfriend - Max\nMy Ex boyfriend - James \nMax's Ex girlfriend - Brooke\n\n2 weeks ago I received a text from an unknown number, claiming they were my ex boyfriend James. I believed it was James as he did write a status on Facebook saying he had a new number. It was just casual talk \"how are things?\" \"How's your new boyfriend?\" I replied platonically and friendly as we did end on good terms. \n\nMy current boyfriend Max said if I am talking to my ex then he should be allowed to speak to his ex Brooke.\nI said that's fine, you can speak to who you want although you know I won't like that. I wasn't happy because the only reason I ever stopped him talking to Brooke is because their messages were always flirty and she still sent him nudes. So I asked him to block her, and he did. But He said he would talk to her anyway because I am speaking to James. \n\nThat was that.\n\nA few days later, Max went to make dinner, and I was up in the bedroom. I was looking for some socks from Max's drawer, and I found a cheap mobile phone that I never saw before. I looked on it and it was the texts I sent to James. I was livid. He was pretending to be my ex boyfriend?\n\nI confronted max straight away, and he admitted that he wanted to get back in touch with Brooke, and he thought if I spoke to my ex James, he could use that as an excuse to be able to talk to Brooke.\n\nI am pissed off. I am really angry that he had to do this behind my back. I asked to see his messages between Brooke and they are all flirty and just borderline inappropriate.\n\nTldr ; my boyfriend pretended to be my ex so he could speak to his ex. We live together, + own a dog. Is this salvageable? where do I go from here? \n",
        "permalink": "/r/relationships/comments/6z8pia/my_25f_boyfriend_24m_got_a_fake_number_pretending/",
        "comments": [
            "You have separate problems here:\n\n* A partner who is willing to tell really huge lies (impersonating someone else is a huge lie) and who tests you covertly.\n* A partner who bean-counts (\"what I'm allowed and what you're allowed must be exactly equal regardless of context\")\n* A partner who has flirty conversations with others.\n\nDeliberate, premeditated, planned lies, is beyond the pail.\n\nBean counting isn't going to age well. The tendency is there in most people, but this one is pretty extreme. You don't want someone who demands absolute fairness (and uses any concession as leverage later) if you are making big decisions together, because those big decisions (eg. whose job gets priority when you move) can't be made absolutely fair.\n\nThe wanting attention from others is kind of gross, but you could choose to overlook it or live with it, or given him an outlet for it (some version of opening the relationship). Up to you what you think. However, the bean counting doesn't bode well for a negotiated solution.",
            "[deleted]",
            "Wtf? That's so crazy. He's obviously super invested in getting those nudes from his ex. ",
            "Hell no. This is some next level shit. So he wants to stay in contact with an ex who sends nudes (1) then he decides to buy a burner phone, impersonate your ex (2) then use that as leverage to speak to ex, and is totally comfortable lying to your face (3). \n\nYou don't deserve this. This is a terrible thing to do to someone and I don't think a relationship could ever recover. ",
            ">he admitted that he wanted to get back in touch with Brooke...\n\nWow, I don't think there's any coming back from that, personally...",
            "How is this even a question?\n\nForget why he did it, which is psychotic. Forget that he obviously still has some sort of feelings for Brooke, and that he doesn't respect your relationship. Forget everything except the fact that he went out of his way so much to manipulate you.\n\nName one reason you'd even want to stay with him. I'll wait.",
            "[deleted]",
            "This is the type of crazy shit that would make it relationship ending. At the surface, it doesn't 'look that bad'. But this guy spun an elaborate story, using your past to manipulate you to get in contact with someone who's his ex for a reason. Do you really want to be with someone who treats you this way? Uses whatever you share to get his way? And this was 'innocent' info, no deep dark traumatic stuff. He had to order a phone, he had to figure out how to set it up, he planned specifics about what to say to you and he was prepared to use the texts against you. That's a bit more steps than just a small mistake.\n\nApparently he wants his ex back. Go let him have her. You find someone better. No sunk costs fallacy. ",
            "Wow, your boyfriend wanted to resume (presumably inappropriate) contact with this other woman so badly that he lied and manipulated this whole situation. It's bad enough on its own, but the fact that he put so much thought and effort into this stunt especially tells you what kind of person he is. Personally, I would get out and be glad I dodged that bullet.  ",
            "Time for someone to move out.  Maybe Brooke will take his crazy, manipulative ass back. ",
            "Wooooooow.\n\nIt's funny, on the face of it, it's a simple text that's actually tamer than a lot of stuff on this subreddit. But then you look deeper and realize that your bf LIED to you specifically in order to MANIPULATE you into letting him CHEAT on you without getting suspicious.\n\nThis guy is conniving and manipulative. If I were you, I would not be able to come back from this. It's too gross.",
            "Your boyfriend:\n\n* Keeps tally while rigging the game, demanding fairness in a field that sabotages you,\n\n* Has emotionally cheated and seen his ex naked in the past,\n\n* Impersonated your ex in order to circumnavigate your attempts to forgive his cheater behavior and move on in order to continue emotionally cheating/attempting to cheat,\n\n* Believes that just by merit of past intimacy his ex and your ex are the same. He's incapable of seeing that you and your ex ended on good terms and are capable of a platonic relationship probably because that's how he is, incapable of a platonic relationship. He keeps an ex who doesn't respect your relationship around because he doesn't respect your relationship.\n\nRelationships are built on trust. You're building a house on a bog, there's nothing you can do but condemn it and build elsewhere or accept that it will buckle and sink no matter what you put into it.",
            "These are not the actions of a partner who respects or values you or your relationship.",
            "Run. That's wrong on so many levels.",
            "Setting aside how shady this is and how badly this reflects on his character - if he's willing to go This Far to talk to her, she means waaaaay too much to him. You should cut him loose and run far away from this mess. And take the dog",
            "Honestly I have to ask the question: why are you still with him? All of that would have had me running in the opposite direction without even sparing a glance backwards.",
            "There's no coming back from this. Even if he wasn't the one pretending to be your ex, the fact that he uses it as an excuse to talk to his ex is just plain shitty. This man will not be faithful to you. Adding the manipulation to the situation is just beyond unforgivable. Even if you stayed with him, you will always be \"searching his sock drawer\" because that trust is gone. ",
            "I'm pissed and I'm not even dating this guy. I'm disgusted by him. I would break up with him.",
            "He's probably been talking to this chick the whole time. And the fact that he even thought up of something like this, he isn't right in the head. It's calculated, planned out and just hurtful. You deserve better. Sorry you're going through this. I would suggest breaking up. He's crazy and not over his ex and that's your closure.",
            "I'm with the others, asking, \"How is this an actual question?\" \n\"Should I stay with my boyfriend who is so hung up on his ex that he purchased another phone solely to manipulate me into letting him sext her?\"\nFTFY",
            "Absolutely not salvageable, OP.\n\nHe formulated an elaborate plan so that he can be inappropriate with his ex-girlfriend. He has shown such a blatant lack of respect towards you and the relationship. He's not desperately trying to contact his ex for friendship.\n\nAnd honestly, can you ever really trust him after he pulled this stunt? What other lies will he spew to be in contact with his ex-girlfriend? What else is he doing behind your back?\n\nAs for what you should do from here, you need to figure out an exit plan. And I suggest you do it behind is back in case he tries to find some way to screw you.\n\nIs there someone (a close, non-mutual friend, a family member) who can take you in? Start asking around to people you can trust won't pass along the message. When you find someone, begin slowly bringing a few items (things you boyfriend will likely not notice) over to their place. Important documents would be a good start.\n\nAre you on the lease? Can you afford to break the lease if you are? Go on r/legaladvice if needed so that you can get some direction on how to get through this legally. \n\nDid you guys purchase/adopt the dog together or was the dog purchased/adopted separately and/or before the relationship?  If you have any proof of vet appointments in your name or anything that strongly links you to the dog compared to him, you will be in a better position in keeping the dog. Also--and this might be controversial advice, but I have to say it--you gotta really figure out how much a relationship with this dog is worth further interactions (and possibly conflict) with your (hopefully soon-to-be ex-) boyfriend.",
            "Wow. If he's that desperate to talk to Brooke, leave him to it. And then never speak to him again. ",
            "Girl....you have got to break up with this dude. Like I can't even count all the red flags in this story. I couldn't imagine being with someone with this type of \"you did this so I should be able to do that\" mentality.",
            "This post is almost like it's hard to see all the red flags when there's a bunch of red flags in the way ",
            "Is it really even a question whether or not you can work it out? Why would you even want to? You need to muster up some self respect and walk away from this. Of course it's going to hurt, and it's not like staying together is going to make it not hurt --- HE DONE DID YOU WRONG. On a major level. How could EVER trust this person again?\n\nDo you really want to spend your life feeling like this? Don't you want a best friend? This sure as shit isn't as good as it gets.",
            "Umm, that is beyond messed up. I don't know why it's a a question, this guy is clearly still into his ex, has no respect for you and is a lying psycho. Dump him.",
            "This really isn't salvageable. This is a huge, *huge* amount of lying. \n\nalso, what it really means is that he wants to get back together with his ex. Does that sound like a guy you should stay with?",
            "Break up time\n\nHe manipulated you so he could flirt with his ex.\n\nWhy?  Because you are a placeholder girlfriend and his ex is who he really wants to be with\n\nHe wouldn't have bought a burner phone, pretended to be your ex, then manipulated you into letting him talk to his ex if she wasn't his #1 priority",
            "There's nothing I can say that won't sound like a broken record so I'll keep this simple.\n\nHe betrayed your trust, is emotionally fucking you, & flirts with his ex. \n\nBreak up. ",
            "Your boyfriend is crazy as hell... like seriously there's  something wrong with a person that would go to those lengths to be deceptive. I don't think he's a stable person Op. you should bail immediately.",
            "That's creeeeepy so creepy. Really manipulative and shitty too. Not salvageable because he's shown himself to be super horrible. I know it's easy for us to say to breakup but you gotta. You really do :(",
            "Haha, wow. Nope! Why would you want to save it? He's still so into his ex that he pulled this ridiculous trust-obliterating scam on you. \n\nAlso, you talking to your ex is in no way the same thing as him talking to his. You politely responding to those texts should not have given him grounds to get back in touch with the ex that he kept being so inappropriate with that he had to cut contact to save your current relationship. ",
            "Your boyfriend sounds crazy. He's still into his ex, break up imo. ",
            "He went to the effort of getting a second phone to gaslight/lie to you so that he could talk to his ex...like wow.  That's some next level hang up on his ex.",
            "This is not salvageable. No fucking way.",
            "Wise up sugar. Your boyfriend is a skeevy pice of shit. Why do you even care if he wants to shag Brooke. Surely you have enough self esteem and respect to kick the slimy asshole to the kerb? ",
            "That's many level of messed up. He went out of his way to do all that deceitful things just so he can continue to talk to his ex, who still sent him nudes? End it before it drags on for too long and end up being more painful.",
            "Why don't you just let him be with Brooke and find yourself a better boyfriend? I bet you'd be happier that way in the long term. I don't know how long you've been dating but don't stay together for the dog. ",
            "I'm so sorry this happened to you. What a terrible betrayal. I would feel so hurt.\n\nI think the main question you should be asking here is \"why do I think so little of myself that I feel that I don't deserve any better than this?\"\n\nImagine you are a strong, accomplished woman with high self-esteem. Would a woman with high self-esteem ever put up with this kind of treatment? Of course not. You need to be that woman. You deserve to be that woman.\n\nYour next steps should be plans to move out, or keep the place and have him make his own housing arrangements. It sucks. None of this is your fault. You didn't create this situation, he did. But unfortunately, because he did create this situation, it has to be dealt with, and not by him. You are the one that has to deal with it, by getting rid of him. I'm so sorry.",
            "what everyone else said, crazy af.\n\n**Please** tell him he can go flirt with Brooke... FOR**EVER**.  \nBecause you're history.\n\nTake the dog. (Unless the dog's especially more bonded to crazy-pants and you know he'll take good care of it .)",
            "This is one of those rare posts that makes you say 'what the hell'. What he did is downright psychotic- I hope you don't see a future with this guy. If he's willing to do something this crazy and manipulative, you know he's willing to do something worse.",
            "Wow. He obviously misses his ex and still wants to talk to her, which means he may still have feelings for her. I wouldn't continue this relationship.",
            "[deleted]",
            "Yeah... time to ditch this guy. Not even worth trying with someone like that.",
            "Nah, that's crazy. He's so desperate to talk to his nudes sending, flirting ex that he impersonated your ex to justify it. Just what kind of fuckery is this? I'd just dump him and call it a day.",
            "Goddamn..willing to trick and lie to his \"gf\" all to simply talk to his ex. He is trying hard to show you who is his priority.",
            "Your innocent messages to an ex are in no way the same as his flirty messages to an ex. All the deception and lies just to get nudes and flirt is pretty disgusting , especially from someone in a committed monogamous relationship. I'd say end it because I can pretty much guarantee this won't be the last time he does something skeevy ",
            "Run from men capable of this level of deceit. He will make you crazy. Breakup, no contact. ",
            "Oh come on. You know you should have dumped him back at flirty texts with his ex and her sending him nudes. You must know this is not a good guy by now, right?",
            "I don't think its salvageable but that's up to you. Its far past what I'd deal with. \n\n",
            "He wants to bang his ex and he doesn't care if it damages ur relationship...and ur on here asking what u should do?",
            "He probably was already back in contact with her and used this as an excuse to make himself feel better.\n\nI'd drop him faster than he could imagine.",
            "Have you no self respect? Why have you not dumped him yet? ",
            "He lied to you and manipulated you by impersonating someone in order to bargain you into letting him stay in touch with an ex who sends him nudes. \n\nWhy would you want to salvage this? Take the dog when you go.",
            "That's crazy. That would be enough for me to end the relationship. ",
            "The fact he'd go to that level to deceive you to get what he wants us disturbing. Catfishing your own girlfriend is some next level shit and seriously scary. ",
            "Unbelievable. Break up with him so fast his head spins.",
            "Not salvageable!  Respect yourself and respect his decisions by getting as far away as possible",
            "Brooke is obviously more important to him than you.",
            "If he wants to be with her THAT BAD then let him lmao you aren't missing out on anything. He doesn't care about your relationship or you. At all. ",
            "That happened and you feel the need to come to Reddit for advice? If you're staying with this dude then you really should stop wearing shirts and just get two door mats and sew them together and wear those instead.",
            "I'm confused. Why do you keep referring to a guy who lied and manipulated in order to flirt with his ex as your 'boyfriend'? I'm sure you mean to be typing 'ex'?",
            "Dump him straight up. Not only did he lie, he manipulated you. He must have put a lot of thought into how he could get your blessing to contact Brooke and completely lied and manipulated you into agreeing to it. He's not done with her, so you should be done with him. Who knows what else he's hiding. Sorry, it sucks, but he did this, not you. 😢 ",
            "Noooope!  Nope, nope, nope!  \n\n1. He wants to keep flirting and getting nudes from his ex.\n\n2.  He feels that flirting and getting nudes from his ex is the same as having civil conversation with an amicably-separated ex.\n\n3.  He was willing to *create a completely fictional situation* including impersonating another person to you, in order to get what he wanted.\n\nAny one of those would probably be a breakup-worthy offense (maybe not #2 if you could talk him out of it).  But all 3?  Doing such an elaborate set of lies in order to keep getting nudes from an ex?  Nuh-uh.  Dump the boyfriend.  Take the dog.  Eat a cannoli.",
            "Urmmm. Get out now as he clearly has feelings for his ex and is playing some sort of game with you.",
            "Too psychotic sounding for me. That is a ton of effort to talk  to another woman. You're call hun, but seriously...",
            "WOW. I think other posters have stated what you need to know (leave as he clearly holds no respect for you, and has a serious lack of communication skills), but WOW. This is extra.",
            "This is like \"breaking bad\" level stuff.. dump this guy.. he can go back to brooke.. there are lot of decent guys out there ",
            "honestly your boyfriend deserves the dumping of the century.  please do that and then update us on how it goes.  please please please please please please\n\nor maybe send nudes to jake and see how that goes?\n\nthis is beyond insane.  he KNOWS that his relationship with Brooke is way more inappropriate than your relationship with your own ex.  and honestly the fact that he went to so much trouble to get in touch with her SHOWS he prioritizes her over you and wants to get back together with her.",
            "that's super weird.  He could have used an app through his computer or cellphone or something.\n\nin all seriousness though that's a lot of trouble just to talk to an ex... :S factor that in.  There must be some reason he would go through all that, and i doubt it was a harmless reason",
            "Op this guy is a fucking loon, stop dating him. This is ridiculous, psycho behavior.",
            "I'd honestly be surprised if ANYONE here was advising that this relationship is salvageable. It's not. He's displayed multiple horrible qualities that suggest he is a bad life partner. Take these obvious reg flags, stop looking for some kind of silver lining/peg to hang your hat: there's none. \n\nIt's time for you to move on. ",
            "Holy crap! Good thing you found out so you can get out. Seriously what a loser.",
            "Dump him. He's setting you up. ",
            "Run!!! He's fucking nuts girl! Abort relationship!!! RUN",
            "I know this is quite insensitive of me, but this has made me so angry. \n\nStraight up tell him to fuck off. \n\nIn my eyes, he already cheated on you before by receiving nudes from his ex, sounds like he encouraged it. \n\nI hope whatever happens you're happy, but I feel like that lost trust will not be regained after he could be so deceptive. ",
            "He manipulated you into allowing him to flirt with his ex and look at her naked photos guilt free. This is monstrous.\n\nIf you don't break up with this man, he is exactly the type to cheat on you then gaslight you. You need out yesterday.",
            "Holy shit, you need to be done with this guy. What a pathetic douchenozzle, to stoop so low. I can't believe he is 24.",
            "If that isn't a deal-breaker for you, then idk what is. This guy seems crazy and obviously can't be trusted, is immature, and doesn't care about you. I think the only viable option is to dump him immediately. ",
            "Damn that's a lot of scheming and effort, do you think he did all that just to talk to her? If so, he's still got serious feelings for her. If not, he's planning to cheat. ",
            "So he lied to and manipulated you so he could flirt with his ex? You cannot trust this guy, either to be faithful or to be honest. \n\nHe's shown you that he will go to quite some lengths to get his way. I really wouldn't stick around to let him keep manipulating you.",
            "Why the fuck does he want to talk to his ex gf so badly?!",
            "You deserve to be with someone who isn't lying and manipulative. You are entitled to your feelings of anger right now. So dump this loser and do just about anything with your life literally anything you do is better than wasting another second on this dude. It doesn't matter how long you have dated, if he buys you flowers or gifts, if he guilt trips you, etc.... break your lease, lose half your friends group, do whatever you have to do to stop wasting time with this dude. ",
            "Ok there are so many things wrong with this. I think that at this point, you know what to do. He pretended to be your ex so that he could turn around and use it so that he could talk to his? It sounds to me like he thinks flirting with his ex is more important than respecting your boundaries. IMO, you just need to end it. That's some manipulative BS.",
            "The thing he did is so crazy!!! Omg hahaha he sounds manipulative...but what do I know? lol I just want to let you know that normal relationships aren''t like this. So you can decide to stay in this relationship if you want, but just be warned, you are going to have way more unnecessary shit you'll have to deal with compared to the rest of us. So if you really want to take that workload up do you\n\n...i would not",
            "Yeah this is crazy. Is there a reason he didn't just text her from his phone to get the nudes then delete the evidence after saving the picture? Or why didn't he just text Brooke from the burner phone? This whole pretending to be your ex to \"even the score\" so he could text his is crazy. Plus, if the ex texted you first and you merely humored it, that's a lot different than seeking out his ex. Either way OP, you should dump him because he still wants his ex. Even if he agrees to go no contact with her it doesn't mean he doesn't still want her and you will be 2nd place. Sorry OP, but I'm sure you can find a guy who makes you his #1",
            "Do yourself a favor, cut your losses and move out. He wants to talk to some other girl and did everything in his power to do just that. Including lying, impersonating someone, and buying a cheap mobile phone. If he respected you he wouldn't have gone that far. Surround yourself with people who respect and love you. Good luck. ",
            "Kick that jerk out! That is rude, disrespectful, and just plain douchebaggery. Not salvageable. Get rid of him, hon.",
            "If he wants to talk to her so badly he's willing to break your trust, throw away his own integrity and take manipulative measures then let him be single. He's not relationship focused. He doesn't strive for a happy, healthy, mutually respectful relationship with you and you deserve better than some asshat who's focus is \"how am I going to fuck my ex but make my girlfriend ok with it?\". ",
            "Only way to deal with a manipulator of this calibre is full stop. Also, tell me you don't believe him when/if he says \"I love you\". ",
            "Run. Run as far and as fast as you can. This is absolutely ridiculous and absolutely inexcusable on his part.\n\nStart making plans to move out asap. I can't even believe this is a thing he did. Like holy shit. I'm so sorry. ",
            "That's insane and completely unacceptable behaviour to me. It's deranged.",
            "Do not overthinking this. RUN.",
            "I don't know if it's salvageable. He lied. A big lie. How do you come back from that? I would move out. ",
            ">My current boyfriend Max said if I am talking to my ex then he should be allowed to speak to his ex Brooke. I said that's fine, you can speak to who you want although you know I won't like that. I wasn't happy because the only reason I ever stopped him talking to Brooke is because their messages were always flirty and she still sent him nudes.\n\nSo, clearly one of these things is not like the other. Having an ex text to chat is *completely* different than an ex who sends nudes. They are not comparable. At all. \n\n>he admitted that he wanted to get back in touch with Brooke\n\nGee, I wonder why. /s \n\nAll of this is highly unacceptable. Given his amount of deception and willingness to \"bean count\" as r/hawthornetree stated, this relationship has massive problems. If you don't want to break up, insist on couples counseling stat. But I'd lean more on kicking his ass out and moving on since he's clearly more interested in Brooke (or getting his ego fix) than his current relationship ",
            ">We live together, + own a dog. Is this salvageable?\n\nI don't know... doesn't seem like he's interested in dating you anymore. Seems like he wants to deceive and lie to you so he can be \"flirty and borderline inappropriate\" with his ex. ",
            "Break up. This lie is so elaborate it's beyond ridiculous.",
            "I think this relationship is not worth having.",
            "Wow, you have every reason to be livid. He went through a lot of trouble just to justify him being on speaking terms with an ex. Huge red flag.",
            "Whose dog is the dog? Like, who does the dog prefer?\n\nSend the dog with that person, and split, because your guy is a hater. :(\n\nETA: in case I'm not clear: BREAK UP BUT THINK OF THE DOG FIRST",
            "Whatever you decide to do, I just want to say I was also loving with a guy and we had a dog together and he lied to me and screwed me over but I didn't leave because I didn't see how I'd be able to find a new place, who'd get the dog etc. and then he kept going and crossed a line.\n\nIt's been three months since I kicked him out, me and my girl are moving back to Thailand and I'm in the best emotional and mental state I've been in in years.\n\nYou can do this.",
            "Jet him go be with brooke. She flirts wth a take man. He is a huge assholes they deserve eachother ",
            "Crazy story... just curious tho when you said got a text from a random number and you could confirm it was your ex cause he posted on fb \"got a new number\". Are you guys fb friends or you just check out his fb every now and then. Perhaps even tho your bfs communication with his ex was inappropriate maybe he wasn't feeling your friendship with your ex. ",
            "[deleted]"
        ]
    },
    {
        "post_id": "4zr7he",
        "author": "uhhhishecheating",
        "title": "Boyfriend 30M of 2.5 years, avoiding our (27F) favorite dinner spot, and not going to a movie. This also conveniently happens to be when a girl he's been chatting with on Facebook is going to dinner/movie. Am I totally crazy?",
        "url": "https://www.reddit.com/r/relationships/comments/4zr7he/boyfriend_30m_of_25_years_avoiding_our_27f/",
        "score": 2179,
        "num_comments": 317,
        "created_utc": 1472249570.0,
        "selftext": "Wow this is a doozy. Sorry the title is kind of a doozy, I'm feeling a little bit crazy and I need to be talked away from the hypothetical crazy ledge.\n\nMy boyfriend really likes Facebook. I have had no reason to not trust him 100% with it. He's definitely a like every photo/status kind of guy and just thinks that it is fun. I don't have a facebook, and my presence on his is nonexistent besides the mention of fun things we are doing here and there. I realize now that I could easily be mistaken for a friend/sister/cousin/etc. \n\nAbout 3 months ago, I got tipped off from a friend that he had been a little flirty with a girl on Facebook. I did a quick cyber stalk of her and she was gorgeous, and I noticed instead of the typical like he had been \"loving\" and \"wowing\" her pictures. I called him and told him I felt a little bit crazy, but I just wanted to make sure there wasn't any funny business. He assured me he is just being nice, and they've never met (she is a friend of a friend apparently?) and it is no different then me upvoting something on Reddit. They had messaged a few times but it was totally innocent and looks any flirtations were nonexistent. Ok, I dropped it, but my spidey senses told me to bookmark it, instead of completely discard the thought of her forever.\n\nA new movie is coming out tonight, and conveniently our favorite dive bar/dinner spot is RIGHT across from the movie theater. We just have to walk a few feet or so and there we are. We have both been stoked for his movie, and talking up our date night ALL week.\n\nI was going into a work meeting and texted him \"Hey I'll probably be tied up till after 5, so i'll see you at *name of place* at 7!\" \n\nHe texts me back (verbatim, to show how weird this was). \"Hey umm is there somewhere else?\" \n\nI don't know what it was, but after a few months of not even thinking of this mysterious facebook enigma, something shouted at me to look at her profile. Her profile is absolutely 100% open, there is no privacy. She geotagged how excited she was to see the movie and go to the bar. Hmm....Ok that is a little convenient. Did a little more digging, he's loved even more of her pictures.\n\nShortly after, he asks if we can just have a night in (which is weird, because my place is being remodeled and the only access at my house is the bathroom and bedroom, and he just had his fumigated and is staying at his moms). I'm like where da fuh are we staying in at?? I have already bought the movie tickets and I told him that I didn't want them to go to waste so to please come we can go eat at another nearby place.\n\nI just think this is all awfully convenient. Am I being a total loon in thinking he doesn't want his girlfriend and side piece running into each other at the movie/dinner?\n  \n\nUpdate!!!: first of all, you guys rock. It is nice to have an army of wonderful Internet friends. So long story short. After the movie I went to the bathroom and Facebook girl was also in there. I told her I loved her hair and then we were just girl chatting, and I was chatting with her out of the door where my boyfriend was waiting for me. He looked like he was going to faint. I was like \"babe! Meet my new friend!\" He was cheating on me with her. They had been having sex for a few months, and he said he was just in a casual relationship with me. Right a casual relationship with a house being built and joint finances???? Good hell. She told me since I have fake boobs I just wasn't enough for him and that was her justification for being ok with it, because I have fake boobs. It was weird like she knew who I was when we were chatting in the bathroom. So no damn girl power there. He didn't even seem sorry, which sucked because he really was my best friend. I don't make a lot of friends since I'm a trauma nurse and just don't get out much. I'm really sad, and feeling really stressed out and just broken. I also feel yucky, I'll get checked for STIS and all that jazz on monday. Time to fix this heartbreak. I took the weekend off of work. Ugh this sucks. Thanks guys you are all so wonderful and encouraging! \n\n\n  ---   \n  **tl;dr**: SO avoiding our date because Facebook girl is going to same spots tonight. This is weird?",
        "permalink": "/r/relationships/comments/4zr7he/boyfriend_30m_of_25_years_avoiding_our_27f/",
        "comments": [
            "If he can't give you a legitimate reason for staying in (actual sickness, family member died etc), yeah I'd be suspicious too. Sounds like he may not want her to know he has a girlfriend.\n\n",
            "Whaaaaaat? If he's been hyped for this movie, then that's definitely a 180 reversal for him to say he \"wants a night in.\" Especially considering what's going on with his and your places to stay. I don't think you're being crazy at all.\n\nThat doesn't necessarily mean he's cheating or has already cheated...maybe he just has feelings for her. Either way, something is definitely up. Call him out and tell him you want to know what's going on, IMO.",
            "Tell him you made a Facebook and sent him a relationship request. His reaction will tell you all you need to know.",
            "Ask him, straightforwardly, if it has anything to do with the fact that he was paying inappropriate amounts of attention to the girl who happens to be going there tonight too. \n\nI am surprised you offered to go to eat elsewhere. Why? \n\nAnd the lack of any presence on his public profile? Huge red flag. Huge. Especially because he is so active. I urge you to read any list of top red flags and being kept more or less a secret will be on each and every. ",
            "Trust your gut, stick to the original movie/restaurant plan, force the issue, tell him how you feel. Let us know how it goes.",
            "He doesn't want her to know he has a girlfriend. He's flirting (at least) and maybe has intentions of more..\n\nI don't trust it.",
            "He's a 30 year old guy \"wowing\" and \"loving\" another woman's pictures. This is something a single, 16 year old would do when infatuated with somebody else. \n\nHe's either cheating on you or thinking of cheating/leaving you. I don't think a 30 year old guy that stalks a woman on Facebook that isn't you is worth it.  Ask em bluntly what's up and if the answer isn't anything close to what you're thinking it should, call it quits. \n\nAlso, and maybe he doesn't help you with this, but regain confidence in yourself.  If my  wife would of been stalking and \"loving\" some other dudes photos all the time I would of called it quits. A couple here and there, but every single one?!?  Dude wouldn't have a chance with the other girl either if she was half smart to him and realized he tossed away a great girl like yourself for no reason. ",
            "Following and loving pictures of some random girl he's never met on facebook (yet could easily meet) is nothing like upvoting a post on reddit. I'm sorry, but he sounds full of shit. I'm crazy too so maybe don't listen but I'd drop her a line on fb and just ask her if she's interested in your guy.",
            "So what happened tonight?",
            "It's too obvious, and you've done some great detective work. He wants to appear available to his crush, so being seen out with you will most certainly make it known he's off the market, thus he cant have his cake and eat it too anymore. Alternatively, once she catches on to you and him out together, he might be worried that she could approach you two and mention some potentially relationship-ending things if you catch my drift. He's been emotionally cheating on you, and want's to continue the ego boost he recieves from his hot crush. ",
            "Girl get a legit Facebook and make him publicly in a relationship with you. Then see how he acts. This shit is shady as hell. ",
            "My ex found the woman he was was cheating on me with via a friend's FB friends.  He's playing you.  Open a FB account, tag him as being in a relationship with you, see what he does.  ",
            "[deleted]",
            "Yeah... if he isn't claiming your realtionship on Facebook, and mutual friends are warning you he is inappropriate with another girl through the site.... you already have your answer.",
            "He might not be cheating on you. He might just be flirting with her, enjoying the ego boost, and not wanting that to stop. But I would find the whole thing at the very least odd. To borrow a term, are you facebook official? Would this girl know you exist?",
            "You aren't crazy, thats sketchy as hell. Keep us updated and don't apologize to him, you aren't CRAZY. ",
            "Sounds to me like your suspicions are on point and he's into this girl, and doesn't want her to know that he has a girlfriend. His behavior makes that obvious, and you're not crazy for correctly reading those signs. No guy, especially one with a girlfriend, \"loves\" or \"wows\" the photos of a girl that is a friend of a friend and someone he has never met, unless he's interested in her. Hence, why he hasn't done it to anyone else's photos. \n\nI would give advice similar to that posted earlier by saying: \n\"We've been looking forward to this movie and our date night all week. We both love that dive bar and your place is being fumigated and mine remodeled, so it makes no sense for us to stay in, and that's not what you wanted to do until a few hours ago. I know that you've been really active on so and so girl's page, and find it very interesting that she is going to that bar and movie at the same time we were planning to and now you conveniently don't want to go. Something is going on that you're not telling me, and you need to be honest, right now. Come clean now, and we can work through it. Otherwise if I find out later that you've lied to me about it, things between us will be over.\"\n\nThen wait for his response. If he comes clean that he's been hanging out with this girl or anything you would deem as emotional or physical cheating, dump his cheating ass anyway and move on. I would also write to the girl on Facebook telling her that you're his girlfriend and ask her what's been going on. My guess is she doesn't know about you and she may provide some additional insight and information to help make your decision easier. You have every right to do that. It's not an invasion of his privacy at this point because you are attempting to save your relationship. ",
            "As someone that's was a cheater for much of their life, this is an obvious RED FLAG!! If he hasn't cheated yet, it really sounds like he's setting it up. If nothing else, you definitely have the right to confront him...remember, you have invested years of YOUR life in this relationship and, moreover, have already given him a second chance so u really do have the right to make certain. Stop being PC about offending his sensibilities...you already have enough reason to confront him. Go there...cuz u know it's bullshit that he wants you to go elsewhere else...it makes no sense. Go with your gut. You won't get LESS information or sense of what is happening if you do.  ",
            "Holy update! Well Jesus TAPDANCING Christ I'm glad you found out. We are here for you if you need anything!",
            "WOW. Thanks for the update. SO SORRY you had to experience this. Get legal advice on the joint finances and house being built ASAP. ",
            "as a dirty scumbag cheater i can tell you, if you feel something is not right is because it probably isnt.\n\nwhen you love someone you get to know that person really well. and you can feel when things change and are not \"right\"\n\nif you keep digging you will probably find something.\n\nof course its just my point of view.",
            "Really? Fake boobs? That's her justification? What a hoe. Sounds like they deserve each other and you deserve much much better!",
            "Sign up for a facebook account yourself and list yourself as 'in a relationship' with him. See if he accepts it or whatever you have to do to show up on your profile. ",
            "[removed]",
            "That guy is a fucking piece of shit. Seriously. I read these posts all the time but I'm left only thinking this at the end of this one. Good for you for confronting both of them. Now you can make room for someone better and more deserving of your attention. ",
            "Oh dear god, that update! OP, I'm so sorry. I guess I'm glad you found out before you wasted any more time and money on this guy, but I'm really sorry you're having to go through all of this. Hopefully you can find a good lawyer to help you with the house issue. Stay tough and don't talk or think about yourself and your thoughts as \"crazy\" or \"psycho\"! I hope one of the positive effects of this situation is that it helps you to trust your gut and not worry so much about being the \"cool girlfriend.\"  ",
            "Your \"spidey senses\" are going off for a reason. Listen to them. Your instinct is trying to tell you something, and I think it is right in doing so. \n\n\nWatch out, because I doubt she knows you are in the picture. He is clearly avoiding the place, because he doesn't want to be seen there. And I would even dare say he doesn't want to be seen there with YOU by HER. \n\nI would tell you to confront your bf... He should tell you the truth of why he really doesn't want to go to your usual bar and then to the movies. Do not accept any bs excuse.",
            "Ok OP you need to update us.",
            "Wow that update.  Those pieces of shit truly deserve each other.  ",
            "I think you're right to be suspicious. Suddenly wanting to call off plans, or move them to another venue, for no good reason, is odd.\n\nI am kind of troubled by how often you've said you don't want to sound 'crazy' over this. Is that because you often accuse your bf of cheating, with no proof of any shenanigans, or because your partner has told you you're crazy every time you've done something he didn't like? Cause if it's the latter, I'd be even more convinced he's not being totally honest with you about he nature of his relationship with this girl.",
            "Go by yourself to the bar and movie. Scope the place out and introduce yourself to her as his girlfriend, if you see her.",
            "Oh that edit, I'm so sorry OP. She's better than you cause you have fake boobs? L O L. Good fucking riddance.",
            "If he completely refuses to go to the restaurant you suggested, tell him you heard that his friend is going to be there, and now you can both meet her.  How fun!  His reaction should tell you everything you need to know.",
            "Well shit. I'm so sorry. But you deserve better than a twice baked cheater.\n\nShe deserves what she's going to get.",
            "You're not crazy. I would straight up confront him. If you need to read this post to him verbatim, then do it. ",
            "If he's not cheating, he's planning on it. Literally no other reason for his behavior. You deserve better. ",
            "Check their messages? I hate to suggest it, but, sometimes there really isn't any other way - having him tailed is kind of similar as far as invading his space from afar, and he's being fairly evasive and aloof, it sounds.\n\nIf you find something, it wouldn't justify your actions but it would justify you leaving, IF. ",
            "You are being incredibly naive. No,  messaging and loving some girls pictures on facebook is not the same as upvoting a post on reddit.  It's very clear based on the info you provided he's up to no good.",
            ">it is no different than me upvoting something on Reddit.\n\nUmmm, what? Unless you're subscribed to a sub dedicated to one person's pictures of themselves (assuming those are what he's 'loving' and 'wowing') there is no correlation. Reddit's purpose is anonymity so even if you are upvoting numerous pictures of *one* person, the likelihood of you even meeting internet stranger is FAR LESS than meeting a \"friend of a friend.\"\n\nThis is some seriously flawed logic.\n\nI agree with the probability that he is avoiding bringing you to places where he might run into her. Put your foot down or get them moving towards the door, OP. ",
            "While he most likely hasn't pursued anything with this Facebook girl, he pretty clearly doesn't want her to know about you, his girlfriend. The chances of her seeing him are higher at your usual dive bar vs. the movies where it's crowded and dark. That's why he's begging to eat someplace else. \n\nI have no idea what to tell you, girl. I feel like you're smart enough to know what to do. Ask him, pester him if you have to, just make sure he gives you a VALID reason as to why he's avoiding these places. If you can, don't mention the Facebook girl at all. Let him bring her up. \n\nHonestly, this Facebook shit is so unoriginal. Can't people think of more exciting ways to be deceitful and sketchy? What happened to buying entirely separate houses and leading two separate lives on opposite sides of the globe? Now it's all snapchat this and facebook that. What a snooooooooozefest. ",
            "She knew you guys were in a relation and she didn't care.. and your boyfriend isn't any better. You deserve so much better.. I'm sorry to hear what happened.",
            "It might sound weird but I am so happy for you that you found out the truth. Living in doubts and the intrusive thoughts in your mind is the worst thing. \nI hope you feel better. All the best!!",
            "I just read your update, holy fuck, girl! I'm so sorry! \n\nThat is an insane story, I was suspicious of his \"loving\" on all of her statuses etc and then the movie date night situation seemed so coincidental. So I'm shocked to read that they were indeed fucking all along. You really sound cool and like someone who can come back from this fairly quickly so my hopes are that you find someone else who's normal and not a cheating slime ball. Good luck!!",
            "I mean, I personally would send her a message. \"Hey! I'm X's girlfriend, Y, I can't believe we haven't met yet! Maybe the three of us could grab drinks sometime?\" Then if nothing is going on you get to actually meet her and have an encounter where it becomes clear their relationship is appropriate and everyone is kosher- or she goes 'Wait, what?' and you know you have a problem on your hands. ",
            "I'm just commenting on the crazy feeling... I'm a calm, somewhat always \"chill\", girl. I've had a situation like this, but with snapchat and texting an ex... I felt CRAZY like I had never been so tore up over a situation like that. so I understand your craziness, for some people it just feels completely strange to have paranoia or suspicion. Maybe because I'm gullible and believe people aren't as bad as you may think. \n\nHonestly wish the best for you two, good luck. ",
            "Well OP. Make a Facebook. See how that plays out. \n\nI'm a petty person sometimes ;)",
            "I think she's not aware of you; and he didn't want her to see you.\n\nOpen up a Facebook account, update your relationship status with him. Claim what's yours.",
            "You have feelings. They're not crazy and you're not crazy. Even if you end up being wrong about what's going on, you had those feelings for a reason and you have a right to without feeling or being told you're crazy. \n\nI hope all works out OP. It does feel like a pretty shady situation. ",
            "Trust your spidey senses. This happened with a guy I was seeing. When I suggested we go to our favorite bar he told asked me if we could go anywhere else, because another girl he was seeing would likely be at that bar. It was truly a transparent remark, your bf's behavior doesn't seem much different.",
            "And so? What happened with this last night?",
            "Oh man, I'm so sorry this happened to you. What a dirt bag. \n\nHey, I'm a trauma nurse too. Rock on girl. We're badass. ",
            "I'm a big fan of Occam's razor",
            "Ask him again, what's going on with girl? Why are you avoiding being in the same places she is when you're with me?",
            "Update us!! I think your spidey senses are right'",
            "Call his ass out. He's being shady.",
            "Sounds like a good reason to get a fb page set up for you and make your relationship public to see what his reaction is...",
            "Looks super suspicious like he doesn't want the girl to see you with him and know he has a girlfriend. I would ask him to give you a good reason why he wants to stay in and see his response",
            "Op, I would honestly make a Facebook account for myself and add -IN A RELATIONSHIP with insert boyfriend's name-\nWon't it show up on his timeline as well? See how he responds. You can always delete the account once you see his reaction.  ",
            "Trust your gut. No matter what he says trust your gut. It's probably not far off the mark.\n\nBest of luck to you.",
            "Sending you so much love and positive vibes right now. Use this weekend off work to focus on yourself and slob out and cry and just take care of yourself. You're worth so much more than the way those 2 horrible individuals treated you, always remember that ",
            "This unfortunate turn of events makes for an excellent post. Like a good story that while tragic because you know.. Life you sound like you got it together. Well done feels good.",
            "I think maybe he has already taken her to that particular watering hole, albeit rather foolishly, and doesn't want to go there because he's afraid either someone will mention it, or 'she' might be there. I wouldn't mention her too much, but keep sleuthing, deeper!",
            "I sincerely doubt he's physically cheated unless you have evidence otherwise, but it's clear he wants to *continue to present himself* as single in front of this girl. You have every right to feel put off by his behavior and every right to call him on it. If he doesn't admit to anything, then know it's because he's lying to himself about this girl, and not because you're wrong.\n\nYou are right to feel upset about this. The only real solution is for him to tell her he's backing off because he has a girlfriend and is committed to her. Anything less than radio silence is grounds for breakup, and you know it. It's just hard to do.\n\nI hope today has found you with a better handle on this situation.",
            "Going with the benefit of the doubt here, he's avoiding her because he has a crush and he wants it to go away. \n\nIt's not unusual to develop crushes on other people whilst in a serious relationship. \n\nHowever.\n\nI would raise an eyebrow on this happening only 2.5 (or is it 4??) years in. You also mention in another comment that he hooked up with someone else. Whether he's cheating or intending to cheat, it sounds like it doesn't take much to turn his head. You should be worth a lot more to somebody than that. ",
            "I dabbled in a bit of scumbaggery years and years ago, when I was young, and this is exactly how a guy who is trapped would behave.  Send him a relationship status and see what he does with it, if you don't want to confront him directly.  Gather some data.  Actually seeing the conversation(s) he's been having with this girl would be the most direct route, and then talking to him about it, but I think this would be a good indicator.  Regardless, keep us updated please!!",
            "Something's defitely up. As other pp's have suggested, don't directly accuse him of anything, but don't minimise it either. Lay all the weirdness out on the line and say : \"This doesn't add up. What's going on?\"",
            "Maybe I'm naive but it is possible he has a bit of a crush on her (not one he would ever act out) and doesn't wanna sit in the same bar as her? ",
            "I'd say that he has some sort of attraction to her that he is dealing with badly.  Whether he's avoiding her or even, worst case, is trying to avoid her knowing that he has a girlfriend, this needs to be dealt with.\n\nFeeling attractions to other people is totally normal but I would say that you both need to sit down and address how you're going to deal with those emotions (distancing yourself, talking to your partner honestly).\n\nAnd perhaps you should make an empty Facebook and mark him as your boyfriend.  You don't need to update it or fill out your personal information, just a photo of the two of you and a relationship status.  Nip any future problems in the bud.\n",
            "I'm so sorry! But I'm glad you were able to find out.",
            "Girlfriend - I saved this post and just checked up on it today. Your edit is good, but the situation blows!\n\nI FEEL YOU. I had something similar happen (and I'm also a trauma nurse, BTW) where I found out via FB that my ex (\"Doofus\") was cheating on me. He even told his side piece that we were casually dating (after three years!) Not only that, when I confronted her, she said that because he and I weren't living together that (in her judgment - lmao) it couldn't be serious. \n\nYou have too much going on to be tied to that loser. You have a good, solid career, a house (that's being renovated - not a project losers take on) and - obviously - a strong morality that doesn't include cheating! You've got it *going on*. He... has side chick, and he *deserves* side chick because they share a moral code!\n\nOkay, now to my advice.... You think the hard part is happening now, and it is truly difficult to break up with someone you've been intertwined with for several years (and probably had hopes of being together for much longer), but just wait. I can almost guarantee you that when side chick gets boring (and she will) he's going to try to come crawling back to you. \"We had it so good. I looooooove you!\" The hard part will be not damaging your foot as you shove it up his ass when you kick him to the curb.\n\nMY mistake was taking Doofus back. He doubled down and begged me to move in with him, which I mistakenly did, because I needed to split the bills (I was just starting nursing school). We lasted just a year longer. We tried everything, but once someone disrespects you it's hard for you to get the trust back. That's another reason not to go back to him. He wants you the way you were, but that woman *doesn't exist* for him any more, he killed that part of you for him.\n\nPlease try to focus on work when you're there. I found it incredibly difficult to focus on anything but the drama and almost failed out of school. I wish you well. ",
            "I'd go, could be interesting.  At the very least you will know how things are as far as the FB friend goes.",
            "A part of me thinks you should've gone alone and bumped into her, asked her why she seems familiar, and then say something like \"oh you're that aspiring model that my bf really likes!\"  \n\nAnd then I think that it's a really bad idea, and that communication is key to a healthy relationship.",
            "Don't confront him. Join Facebook. Let him know you joined and how excited you are. Put up a profile picture of the two of you. Then add whatsherface as your *only* other friend. Next step: change your status to \"I know!\".  ",
            "So it's very possible he hasn't cheated with her, but he wants to maintain an illusion of availableness to this girl, so that if he gets the signs from her that she wants to advance their friendship to another level, there will be no hesitation on her part... Now yeah, that sounds pretty terrible, but I honestly think most people do this when the meet really attractive people, especially if that other person seems to reciprocate interest. If you met a Ryan Gosling type guy (or whatever hot actor guy you're into), and found you had an energetic, flirty friendship with him, you'd probably be seriously interested in him if he expressed interest in you... even if you were already in a relationship at the time you met him. And if you were interested, and hoped in the back of your mind he was too, you might not want to talk too much about your boyfriend when you were around him so that he wouldn't hesitate to express his feelings to you if he had them. Is it deceptive to the hot guy? Yes. Is it a betrayal to your boyfriend? Yes. But it's completely normal, understandable, and rational. Now I'm not saying you'd absolutely do that, OP, but a lot of people would, and if you boyfriend would do it too, I don't think you should take it too seriously. Most people want to be in relationships with the most attractive people they can find that they're compatible with. For some people shared experience and longevity is more important, but you two have only been dating for a couple years, and there's no reason to think you can't build a comparable amount of shared experience with other people. Yeah, the behavior is shitty but I would just enjoy the relationship you have with him now, and if it ends, it does, and if it doesn't, it doesn't. If it does seriously bother you, then confront him, but I'd say worrying about this sort of behavior is a wasted energy until more evidence of relationship breakdown comes forward.",
            "Do you trust him. If so then ignore it. If not then try and trap him in the lie you think he is living.",
            "[removed]",
            "[deleted]",
            "You need to let him believe that he is in control, agree to his concessions and then go undercover. Go PI on her and see if you can catch him red handed. The only way you don't come off as crazy is if you have proof. If you don't have proof don't even mention it, people are good liers. ",
            "Maybe he was being honest, and he was just being nice online but now the girl is crazy and trying to meet him IRL. I would certainly be acting like that of some dude online wanted to meet me, and I knew where he'd be at.\n\nHe might just be trying not to freak you out.\n\nThink positive.",
            "Based on what you've said here, I wouldn't say you're a total loon but I also wouldn't jump to the conclusion that he has a side piece. Maybe he just doesn't want to go to that place tonight. Maybe he wants to stay in and its completely unrelated.\n\n",
            "Maybe he doesn't want you to see her cause he knows you're a paranoid over thinker and he actually doesn't have anything real to hide (???) ",
            "Op is psycho dump her dude ",
            "[removed]"
        ]
    }
]