[
    {
        "post_id": "3m0kgo",
        "author": "tattedupgirl",
        "title": "Update- My niece (18) wants me to decorate her wedding. I (33) will be out of town that weekend.",
        "url": "https://www.reddit.com/r/relationships/comments/3m0kgo/update_my_niece_18_wants_me_to_decorate_her/",
        "score": 2176,
        "num_comments": 178,
        "created_utc": 1442974048.0,
        "selftext": "Original- https://www.reddit.com/r/relationships/comments/3lo4v3/my_niece_18_wants_me_to_design_her_wedding_with_a/\n\nFirst of all, I'd like to thank everyone who commented on my original post. In my everyday life, I am the problem solver, the fixer, so I was looking at this entire situation as a problem that I needed to solve. I knew if I asked you guys what to do, you would all see it from a prospective that I was just to close to see.Thank you all for showing me that not only was any of this my problem, but also that it was NOT my responsibility to do anything at all in this situation.\n\nClearly, I have shit that need to work on and keep working on. My husband has helped me over the 11 yrs we have been together. I used to be like a field mouse and absolutely terrified to say no to people, sometimes even crying over it. Thanks to the people on here who suggested it, I'm actually going to start practicing saying, standing up for myself and letting No be a complete sentence. My husband said I can practice on him whenever I need to and we will start working g on it today.\n\nOkay so- The Update!\nSunday night I called my Mom and told her everything. I pointed out that we will be gone on the weekend Lea was wanting to get married on and said that for once, I would be putting my foot down. We WILL be going on the trip. My mom laughed and said not to worry and that Lea has lost her damn mind if she thinks any of us will pay for anything. I told her to call my Dad before my sister had a chance to lie to him. My Dad said the same thing as Mom and decided to call Lea's Dad to find out what was going on.\n\nLea's Dad said he told Lea that since he just bought her a car and his business is getting ready to shut down for winter, he could not afford a wedding for her this year. He told her to put the wedding off till around May of next year and that would be enough time. Lea lost her shit. Her Dad said after a lot of screaming, she finally yelled \"I'll pay for it myself!!\". And apparently in Lea's mind, that meant getting all of us to pay for it. My Dad said he needed to tell Lea that not a single  one of us will ever pay for her to get married, ever and if she just absolutely has to, she can do it at the courthouse.\n\nLater that night Lea's Dad called my Dad back and said he sat Lea down and demanded to know WHY she was pushing for a wedding g so soon. Turns out, her boyfriend is joining the Navy and they thought it'd be a good idea to get married. Her Dad told her that none of us are paying anything for her wedding and she would have to go to the courthouse if she had to but there will be no wedding this year. After an hour of yelling, Lea said fine and she will just move the wedding to next year but honestly, if her boyfriend is going away, I can totally see her finding a new guy while he is gone and this whole wedding thing going a way. \n\nSo thank you all so much for helping me. \n\nTL;DR; Lea's got finally got through to her that no one will be paying for her wedding and she agreed to put it off. I'm going to work on myself and have an awesome trip.",
        "permalink": "/r/relationships/comments/3m0kgo/update_my_niece_18_wants_me_to_decorate_her/",
        "comments": [
            "This is a very good update, and hopefully will be good for Lea in the long term as well. It seems like she's rather spoiled and has never been told no in her life. Hopefully in a few years she'll realize this actually saved her from a way too early marriage.",
            "Real talk, I'm thinking of throwing a party next week and I really, REALLY want you to plan it for me.",
            "> her boyfriend is joining the Navy and they thought it'd be a good idea to get married  \n  \nThis is probably one of the worst reasons to get married. I don't know if any statistics back it up, but it seems like there's a lot of stories about people who rushed to get married because one of them was joining the military and then things end badly because they were too young and hadn't known each other long enough to realize they weren't right for each other. Yeesh. I really hope they don't get married, at least not yet. ",
            "Good for you OP.\n\nBut ugh, Lea is going to have 3 kids from different dads by the time she's 24.",
            "Thanks for the update.  She sounds like the type to cheat on her boyfriend when he hasn't even been at bootcamp for a week.",
            "Glad you provided an update.  Wow! Your husband is awesome for saying you can practice saying \"no\" to him.  He's a keeper!  Have fun on your trip and take care.",
            "Wow that is one spoiled brat. I don't wish ill will on your family but I hope Lea's dad cuts her off or his business doesn't do well enough for her to support her anymore. ",
            "Wow is Lea ever the insufferable twat.",
            "Being able to say no is a beautiful thing. Definitely keep practicing it with your SO in case something like this comes up again (maybe with Lea's next prospective husband). Have a wonderful vacation!",
            "The fact that she expected to have this paid for while making no contributions herself (and a month and a half before, to boot!), throwing a temper tantrum, and getting married because it \"seemed like a good idea\" all show she's not ready to get married. Good for you all for keeping your foots down, and not caving in to this. I doubt she'll learn a lesson from this, but hopefully it gives her and her partner more time to really think about what they're getting into. ",
            "I don't think I will be the only one opposed to a second update for Lea's \"wedding.\" ",
            "What a great update!  Enjoy your trip!  And the more you get used to saying no, the easier it gets.  :)",
            "Now watch her complete her evolution into a dependopotimous",
            "Wow, Lea sucks. ",
            "She wanted a wedding not a marriage.",
            "She would have been a pretty crazy bridezilla!\n\nGood for you for learning to stand for yourself!\n\n>My husband said I can practice on him whenever I need to and we will start working g on it today.\n\n\"We should have sex today\"\n\n\"No\"\n\n\"Shit, why?\"\n\n\"No is a complete sentence hon\"\n\n\"...\"\n\nWell in my head it was funny ",
            "Good update, now have a great vacation!",
            "Well, maybe the poor fiancé still stands a chance of dodging that bullet. Good for you for not giving in, let your niece pay for her own trainwrecks-in-the-making.",
            "just decorate her next one!  she's 18, has plenty more! :)",
            "Only an hour of yelling! better than expected!",
            "I'm glad it all worked out for you in the end!\n\n>Later that night Lea's Dad called my Dad back and said he sat Lea down and demanded to know WHY she was pushing for a wedding g so soon.\n\nBut seriously, when an 18 year-old says they want to get married, this is the FIRST thing that grownups should be doing.",
            "I have trouble saying 'no' too. I'm proud of you. I so happy your husband is letting you practice on him! I hope you have a great relaxing vacation! ",
            "Holy entitlement, BatGirl! Good on you for putting your foot down, OP. If you need practice with that 'No' thing, I'm sure my wife will help you. Between the 4 kids and myself, she is a certified expert.",
            "Have fun on your vacation!",
            "You're awesome! Keep up the great work, workin on your fine self! No IS in fact a complete sentence. ",
            "Leaving for the military?  That marriage is going to be rough.  You may have done her a favor.",
            "Well... hopefully you get to have a great vacation with your mom and have a drink and a good laugh over all of this!",
            "She won't do well with him in Basic and A-School. As little contact as he'll be able to have, and being out in the world on his own....yeah, she might find out where he's getting posted, but that's it.",
            "[deleted]",
            "Lol this result is excellent.",
            "Good for you sounded like she wanted to be a tri-careitops saved the bf a lot of heartbreak and stress in the future as well as yourself. ",
            "You are actually making his current boyfriend a huge favor, otherwise, besides a break up, he would have to go through a nasty divorce once he comes back.",
            "Great update.  Enjoy your trip!",
            "You uncle save Lea's bf from a lot of headaches. Why does he want to marry her if she's cheated on him? She sounds spoiled and controlling, poor kid. The Navy is the best think for him to do, be as far away from Lea as possible.\n\nHave fun on your trip!",
            "I'm a terrible person, but I'm hoping for an update 6 months from now about how she and the navy boy are now broken up.",
            "It is unlikely they'll get married. She's 18.. they haven't been together very long.. and he will be gone. Long distance is hard on even the strongest couples. It is nearly impossible on someone who is at an age where they are going to go through so many changes.\n\nI only have two friends who are my age and divorced (both got divorced at 22).. both of them married some guy in the military that they were hardly with any substantial amount of time. Obviously, this isn't the case for all military marriages, but it certainly seems to be the case that many young people in the military marry people at an extremely young age for the benefits/because they will be apart.\n\nShe'll be glad her parents did this when she realizes she isn't a 22 year old divorcee.",
            "I \"wonder\" why he joined the Navy, couldn't be because he'd be away for 4 years now could it?",
            "I don't even know her, but I hate her already.",
            "Commented on the first post so I'm delighted to read this very good update. I'm so pleased for you and your Mom. You need to put yourself first and foremost before anything else and I wish you nothing but peace and harmony :) ",
            "Sounds like a happy ending. Good for you for standing up for yourself! And the rest of your family for sticking to their guns. That's awesome.",
            "Well, I'm glad you guys all said no and worked that out guilt free. I do think Lea sounds incredibly self centered, hopefully she grows up some and starts taking care of herself instead of using people like that.",
            "Things sound like they worked out in your favor , glad to hear it since that doesn't always happen here , keep on keeping on!",
            ">but honestly, if her boyfriend is going away, I can totally see her finding a new guy while he is gone and this whole wedding thing going a way.\n\nAin't love grand?\n\nI'm glad it all worked out for you. Your family sounds like they have it together a lot more than I feared they did when I read your first post. Good for all of them for not kowtowing to Lea's demands. Enjoy your vacation.",
            "[deleted]",
            "Her boyfriend better watch his sperm. She wants those benefits..",
            "Wow.  What an idiot.",
            "And no one told her 18 was to young to get married?",
            "Tell her you'll do it at her real wedding",
            "Okay.. you may not like what I'm going to say. I'm not a psychologist.. but.. I'm pretty sure your niece has something!!.. (in the mental department, pretty common nowadays, doesn't have to mean she's running down the street naked or in a straight jacket).. I hope for your family's sake it's something that passes or can be treated. IF it's the >worst case< scenario then I'd simply try to avoid her but still be polite.. but firm!! and CONFIDENT.. I'm not saying you're not naturally, I don't know you but you said you're a 'yes' person and I know what that's like and have obviously come across other people who ..say yes lol. There are different reasons why we say yes and also make offers to help people. If there's no agenda behind it then I'd say you need to try to set some higher standards, if somebody calls you a bitch then.. who cares really? I think when you get older you tend to care less (unless a person knows you well, is being fair and speaks some truth).. I think generally, different cultures seem to have different ways of disciplining if at all.. I think western culture from what I've noticed fails kids in a way and teaches them to feel entitled and that they can do no wrong.. not everybody but many, at least where I live in Australia.. A lot of mothers will defend their child even when the child is wrong. When me or my sibling were naughty, our mum didn't defend us.. she gave us the smack!!! and then we had to apologise to whoever we offended and my mum would apologise to the parents of the child/teacher or whatever.. We did run around looking like street kids but we were happy that way to play outside and when we received things we were grateful, we never had the surf brands or whatever was cool.. I think I received a Tamagotchi (showing my age).. once it was out of fashion.. Mind you we were lucky to have a roof over our heads.. Nowadays kids are getting neck strain from looking at their friggin tablets!! I don't have a damn tablet!! They don't play outside much anymore, it's sad.. I'm glad that Lea's parents or at least father stood up to her..  I hope there's hope for your niece and wish you all the best in keeping your new stand going!! All the best :)"
        ]
    },
    {
        "post_id": "33e48g",
        "author": "infertileoldmaid",
        "title": "Me [32F] with my husband[35M] of 10 years, he is divorcing me because I am infertile.",
        "url": "https://www.reddit.com/r/relationships/comments/33e48g/me_32f_with_my_husband35m_of_10_years_he_is/",
        "score": 2174,
        "num_comments": 1149,
        "created_utc": 1429646354.0,
        "selftext": "I'm an absolute wreck. Countless consultations, too many tests to counts, FIVE rounds of IVF, months of crying myself to sleep. And now the only source of happiness in my life is gone.\n\nThe past year has been really difficult to me. Last July, my mother passed away and it had been her dream to see me, her only daughter, ripe with children and I'm devastated that she didn't get to experience that. To add to that, in November I was laid off and now the consequences of that have been coming to a head because husband and I can no longer afford another round of IVF, we can barely afford my appointments. My husband and I had been dreaming of the good life: two kids, a dog, and a pretty little house in the country. All of that came crashing down two days ago.\n\nHe had just arrived home from work and I greeted him with a smile and came towards him with the expectation of a kiss, and he walked right past me. When I turned around and ask him what was wrong, he looked at be somberly and told me to sit down. As I sat, I could feel my heart sinking in my chest, although I didn't know why. \n\nHe placed a couple piece of paper on the table and slid them towards me and buried his head into his hands and let out what sounded like a quiet sob. I looked down, shaking, and saw that he was serving me divorce papers. Everything after that is a blur. I have memories of him telling me that he loved me and he was so sorry, but that he had been miserable and if I wasn't able to have a child, he couldn't stay with me. He told me that *he* was the monster and that he couldn't shake his \"biological imperative\" anymore. We'd both agreed early on that if we couldn't have children, we wouldn't adopt because we wanted biological children (please don't judge us). He used to hold me at night and tell me that he would never leave me, no matter what; that being childless was okay and I was worth it. I now know that is all a lie. I can't blame him though, because it was me who was hindering the relationship; I am the broken one. \n\nHis sister and best friend came over yesterday to help him pack up his things and I just laid in my bed and sobbed the entire time. He has rented an apartment on the other side of town and has agreed to pay for our home for the next 4 months until I can find another job and we can sell the house. \n\nI'm devastated. I've not left my bed since the night he left. I haven't eaten anything. I feel like I've already died. What do I do, reddit? I haven't had the courage to tell any of my friends or family yet because I am already shamed by them for being infertile. How could he do this to me? My life is over. \n\n___\n\ntl;dr - my husband of 10 years is divorcing me because I am unable to produce a child for him. All my dreams are crushed and my life feels like it's over. ",
        "permalink": "/r/relationships/comments/33e48g/me_32f_with_my_husband35m_of_10_years_he_is/",
        "comments": [
            "**This is the most important thing**\n\nDo nothing with regards to the house, the money, your job, ANYTHING without talking to a lawyer. You need a lawyer yesterday. I am not going to beat this dead horse, but there might be reasons you wouldn't want a job, shouldn't leave the house, etc. You need legal advice before you make any changes whatsoever. \n\n**On to the sensitive stuff**\n\nFirst, as cruel and hard as this is....what can I say? Would you rather he stayed only to resent you? This is one of those situations where there are no good solutions. I know people are going to bandwagon that he's a dick, and he IS a dick, but I don't know that either of you have a lot of options here. He can't stay if he's going to be miserable. I am sorry and I know that's hard to hear right now, but it serves neither of you. This is the hell you have to walk through to get to the other side. And there IS another side.\n \nLife ISN'T over, but this one is. This man, this house, this fantasy...it is over. And you are grieving and you MUST grieve. Something very precious died. And there's nothing I can say or do to make it better for you because there's no making it better. There's just a lot of crying on the kitchen floor, eating ice cream, numbing yourself with boring television and projects and work. That's what comes next. You cry and you shower and you cry and you check your email and you cry some more. You'll hate him and miss him and hate him with every fiber of your being. And you cry. And you make dinner, check the mail, throw away all your ugly clothes, read, cry, and get up the next morning. And that's what it will be. \n\nBut not forever. \n\nSomeday, this will heal. It will heal. You will continue to travel through life and meet people and have experiences and one day you won't remember the last time you had a good cry about this. Life isn't over. Life has barely started. You're in the middle of the novel, the ending is of yet unwritten. I hope desperately you have biological children, and maybe you will. But if not, there's a whole world of other options...and I am NOT talking about adoption, though that's in the mix too. I am talking about a rich, happy, fulfilling life. You are not the first person to hit a brick wall. You are not the first person to have plans A, B, and C not work out. And I will not give you that 'everything happens for a reason' bullshit because that's not true. Sometimes life just shits on you. But sometimes the bad shit puts us on the path to find people, experiences, and desires we'd have never considered. Sometimes plan Q is a winner. \n\nYou must show loyalty to the hard times. They are always going to come. What you do with them, how you let them shape you and gild you....that's what ultimately makes you who you are. They are different for everyone, they are always terrible, but they spit you out as something better and harder at the end of the day. You will be okay. It will be okay. \n\n",
            "I am so incredibly sorry to read this. I cannot even imagine the devastation you are going through. \n\nI wish there were magic words that could help you feel better. If there are, I don't know them. All I can tell you is that you are more than your ability to reproduce. And you are more than your relationship with your husband. You are still you. Sometimes the hopes and dreams we have in life don't pan out. And when that happens, it hurts. A lot. And it's ok to mourn to loss of those dreams. But it's also important not to lose sight of the fact that you are still on this rock and have a life with many other opportunities for happiness in front of you. Please remember that while this piece of your life may be coming to an end, there are still many roads ahead of you with new wonderful opportunities and people. When you are ready, don't be afraid to start traveling down them. \n\nIn the meantime, consider seeking some help from a professional psychologist or counselor to discuss your feelings and help you work through them. ",
            "I won't judge you for wanting biological children and refusing to adopt, and I won't judge your husband for it either. I'm sorry for your loss, I hope you can find happiness in something other than children.",
            "I am so sorry. I've been dealing with 6 years of fertility treatments and a strained marriage. PM me if you ever want to chat. ",
            "Was surrogacy or using donor eggs not an option at all? If his sperm is fine, there are other ways for him to have bio kids with you without necessarily needing your eggs. \n\nI feel terribly for you, but if he stayed with you in the marriage it probably would have made him resentful eventually. We all have our selfish needs in a relationship, and his was a particularly big one.",
            "Your life isn't over, but this chapter is.  The good news is you have a world of possibilities open to you now if you're willing to look for them.  Do you have an inkling of how many men are out there that do not want kids?  There are loads that don't have that \"biological imperative\".  You thought you were headed for that so-called dream life of the white picket fence and two kids, but now who knows?  You could end up traveling to a foreign country and meeting a man who wants you for you and not your reproductive ability.  You could find a career path that you can work 80 hours a week towards and find yourself at the top of your field.  You could start your own business.  There are all sorts of options open to you now that would not be realistic with that so-called dream you two shared.  \nTen years is a long time, and you probably won't be able to see any kind of bright side for at least a month.  There is a bright side though, and it's up to you to make sure you take path that makes you look back on this moment in your life and think \"Well I guess everything happens for a reason.\"  ",
            "Exis007 has the most helpful comment.  It's better that he's telling you the truth and ending this sooner than later than staying with you and being miserable while cheating or whatever else.  I'd also like to add that you should **start** talking to your friends/family.  Not telling anyone anything is making this even more hard since you're dealing w/ everything yourself and have no one to talk to.  There's nothing to be ashamed about. Shit happens to a lot of people in all walks of life.  It sucks but we need to move on, there's plenty of people that would gladly be with a woman and NOT want children, not saying that that's the other route, there's many routes, much more experiences, people to see/meet, places to travel in this life.  Don't let the past define you or the approval of one person define you.  Find as many things as possible as you enjoy in life and keep surrounding those things around you.  Best of luck and you and always message me if you need anyone else to talk to! ",
            "My ex boyfriend's  sister had this happen around age 32.  She is now 40 and has a kid with someone else and her ex had no children.  You never know where you will find happiness. ",
            "My cousin went through this.  His wife left him because he could not give her bio children.  He was looking into adopting but she didn't want that, it wasn't good enough for her.  She left, he of course was very sad but it got better and he moved on.  He is dating someone who is great and they are even moving to another state soon for her job.  \n\nYou will find someone else and you can have a family (think about adoption, there are a lot of children in this world who would love to have you as a mother).  You will lead a wonderful life. ",
            ">because it was me who was hindering the relationship; I am the broken one. \n\nDude, Fuck That. The only thing I can add here is you stop that shit RIGHT NOW.",
            "Has anyone said that you should see a therapist? This is a lot. We're good for emotional support.... and apparently some adoption-shaming, sorry about that... but you obviously need to talk to a professional.",
            "I'm in a very different situation. I'm a divorced man with two young kids. Most women in their thirties fall into one of two categories: those who are desperate to reproduce immediately, and those who wish to continue living a carefree, childless lifestyle. Once you've had some time to recover, you'll be incredibly popular among single fathers who have few other dating options. You mention that you hadn't been interested in adoption, but you might find step-parenting rewarding.",
            "First of all I am so sorry. This is one of the saddest posts that I've read in a long time. However, I strongly suggest that you call a therapist. Today. You are understandably sinking into a depression and need a professional to talk to. Your husband is absolutely heartless. You can have biological children through a surrogate, but in the long run I think you will be happy to see you did not stay with someone who couldn't love you through the most difficult time of your life. I truly wish you the best of luck OP. ",
            "I would urgently suggest that you lawyer up, ASAP. Don't do anything else until you do.!",
            "Man here. After 7 years of no kids, my wife and I decided to skip IVF and go straight to adoption. I understand it isn't for everyone. Still, if my wife hadn't agreed that we could adopt it would have been devastating. That being said...I married her for the woman she is, not as a babymaker. I hope you are able to come to the realization that he clearly isn't the man you thought he was. Also, lawyer up pronto. He abandoned you and should have to deal with the consequences of that. I've seen people go through divorces and they change...don't trust him. Don't let him stick you with the expenses he owes. Half of the rent/mortgage, utilities, etc. are his responsibilities whether he lives in the home right now or not...until the divorce is final.\n\nBest of luck, I know this feels like the worst thing that could happen.",
            "I am so very sorry. Infertility is such an ugly road at times and it strains even the most solid relationships. But what he did and how he did it was pretty shitty. You are not shamed, he is.\n \nWhat if you found out you had cancer, or a heart condition that would prevent you from ever having kids? That's technically not infertility but it's the same effect. Would he have left you then, when you're sick and need a partner the most? Probably, and it would've been just as shitty. What if roles were reversed and you left him for the same reason? That's where the shame and heartlessness should be. On the partner who couldn't match the challenge of being a supportive spouse.\n \nBut here's the thing. You can rebuild and find someone who loves you for you. Put in perspective, the way he did this, it appears he loved you for your ovaries. I don't want that comment to hurt you, I want you to see how crappy he is being. You are not old or shamed. You can find someone to share the rest of your life with and have many adventures with (even if you don't want to adopt and you decide to be childless). It's about being with someone till the end and that means weathering these kinds of hardships.  You found out now that your husband is not the man to do that with. Do not give up hope just because he turned out to be an ass.\n \nAnd I know you wanted bio kids, I'm not going to judge as everyone has their rules. But consider 1/2 bio kids (with a future, better partner). A good friend of the family married a woman almost 15 years older than him; they are still very much in love after 14 years of marriage. They tried about $100,000 worth of IVF that didn't work. So they then did IVF with his sperm and with donor eggs. It worked, they have beautiful twin girls who are now almost teenagers. They are all very happy. And you wouldn't know to look at them that the girls are not genetically related to their mom. And she is most definitely their mom.  And if she couldn't carry the pregnancy, I'm pretty sure they would've used a surrogate. They had their rules and they found a way to meet them together.  And still if it didn't work, they would've found a way to be together. You deserve that kind of love and partnership. In a way you dodged a bullet because you could've been stuck with this faithless ass for decades until he showed his true colors.",
            "I am not sure if he is being entirely truthful. It sounds to me as if you have been very depressed over the last few years and it may have become too much for him. If he was your \"only source of happiness\" as you put it, this is very telling. I would not be able to handle being someone's only source of happiness. \n\nYou lost your mother, you have been dealing with infertility issues, and you have been unemployed. You used the word \"devastated\" multiple times in your post. I have to wonder if you have been a wreck emotionally for several years and he can no longer handle it. \n\nI don't mean to dig at you. I hope you see that I am actually trying to help make you feel better by pointing out that it might not be as simple as you think, and that it could be issues you can work on for your next relationship to be successful. \n\nI have suffered from depression and anxiety my whole life and it is extremely hard for my partners to deal with me when I am in my extreme lows. It is very draining to be with someone who cannot create their own happiness and who cannot dig themselves out of those ruts. It is important to have support, but when someone is endlessly supporting another person with no resolution in sight, it is far too much. \n\nPlease consider therapy because this is a lot to deal with. \n\nEdited to add that I think your husband was an asshole to serve papers without discussing it first or trying counselling as a couple. I'm not saying he was totally right. I just meant to point out that it may be more complicated than simply kids vs. no kids. ",
            "Definitely call a lawyer.\n\nDon't give up on your future just because it won't be with him. You are still young, you can still have a joyful life and a fulfilling relationship. This one is likely never to have been happy if he always resented you regarding your childlessness. It's ok to let go and move on, when you are ready.",
            "I just have to say this, even if it gets buried....\n\nYour wife is not a brood mare. You can't just trade her in for a better, more fertile version when you discover she can't give you babies. All of these comments spouting shit about biological imperative....I just don't get it. I mean, I 100% understand the want, the *need*, to have children. I'm going through fertility treatments myself for the slim chance of giving my husband a baby. But the thing is, my deep desire to have children in no way trumps the love I have for my husband, and I know for a fact that he feels the same way. It's really funny how people get married and expect that little fantasy of a white picket fence, a couple of kids, and a dog to happen with the snap of a finger. This is what naivety gets you people. Marry your partner for who he/she is, not for this fantasy world that may or may not come to pass.",
            "39 year old male here. I always wanted kids, two in fact. We were lucky enough to have them.\n\nIf it turned out my wife couldn't conceive and we weren't going to have kids, I would be sad, she would be sad. We'd probably have a good cry about it ... the next day, I'd make her pancakes and we'd continue with our life together.\n\nYour husband is a dick to the n^th degree. He is selfish and he has no idea what \"marriage\" means. A guy like him will probably be back in a month  or two later with his tail between his legs, and you might be tempted to take him back. Don't. Find someone better, it shouldn't be hard.",
            "Maybe your dreams are crushed, but your life is not over; it's just time to start making new dreams. Your family and friends sound like assholes, and I would tell them so. Shame on them, not you. If they have shamed you, go to a doctor.  You need some medical help at the moment and hopefully you will find a doctor who is more understanding of your situation.  If you aren't getting out of bed or eating, you need medical attention, both a doctor and a therapist.   You know what? There is a man ( many men actually)  and friends who would be happy to stand by your side regardless of whether or not you can have children.  Don't let this man or anyone else let you feel like you have failed in any way, shape, or form.  You were an excellent partner and human being.  It's going to feel bad for a while, but seriously what is wrong with the people in your life?    ",
            "Hugs OP!  You are not broken.  You found out that this man's desire to have biological children was stronger than his love for you.  He lead you on and lied about the depth of his love for you.  He's left you when the going got hard.  All horrible things he did.  Marriage is supposed to not be shallow this way.  You are justified to feel so deeply and to be grieving.\n\nI'm not saying you'll ever forgive him but someday you will realize he did you a favor in showing his true selfishness before having kids with him.  When the going gets tough, he gets going...that's not a good trait for a father.\n\nThis is far from your mind now but you have the opportunity now to be a mother someday if you choose.  Either you'll someday find the cause of the infertility or else adopt.  I know quite a few wonderful friends who have made families through adoption and are very happy.  I also know women who have tackled the causes of their infertility and gone on to have kids.  \n\nMy heart goes out to you.  Please seek legal advice.  You don't have to be a jerk during the divorce but ensure that he plays fair too.\n\n",
            "In vetro kid here! My parents ended up having to use egg donor and surrogate to have me, but the funny thing is I look just like my mom! The world is strange. They were very late 40s when I finally took, after 4 years! \n\nIn vetro is fucking rough. It tears families apart and even when it succeeds it can tear them apart more. Be strong! Someday your kid may post a comment just like me, telling a woman just like you that it will all work out. It really will. ",
            "I dunno why all the comments are calling the ex a monster.. this is an unfortunate series of shitty events and a lose, lose for everyone involved. All OP can do is try to move on. ",
            ">I can't blame him though, because it was me who was hindering the relationship; I am the broken one. \n\nYou're wrong. Fuck that train of thought, just because you can't have children does not make you worth any less as a person, never mind woman. Unless you honestly believe that a woman's only purpose in this world is to have babies, then you're wrong. And, if your family and friends honestly believe that... you're better off without such closed minded, toxic people.",
            "I don't want to get into the debate here... just want to say that you're not broken, and you shouldn't feel shame for who you are.\n\nI'm a sterile adult male. There's nothing wrong either of us, we're just as unique as anyone else.",
            "This is very sad, and I'm so sorry you are going through this.  Your husband seems to be trying his best to make things as easy as possible, but nothing is going to take away the pain you are feeling.\n\nHe doesn't seem like a horrible person.  More so a person that thought he could handle things, and it turns out he couldn't.  It's hard not to think poorly of him, but it's a tough position to be in.\n\nI can't have kids, either.  I am \"lucky\" enough that I've known far earlier than most people, so I've been able to let my partners know way before the ten-year mark.\n\nI (and my boyfriend) want biological children and completely understand not wanting to adopt.  As much as it would kill me to lose him, if we get to a point where we've exhausted all our options and he is still dead set on having his own children, I'd be willing to let him go.\nIt would feel worse to stay in a relationship knowing my partner isn't fully happy, than it would be to be alone.\n\nI'm so sorry.",
            "> We'd both agreed early on that if we couldn't have children, we wouldn't adopt because we wanted biological children (please don't judge us).\n\nNo judgment here, my SO and I agreed to the same thing. Having been pregnant once before, I don't feel that I could have the same bond with a child not of myself, and it wouldn't be fair to an adopted child to experiment with that.\n\n> I can't blame him though, because it was me who was hindering the relationship; I am the broken one.\n\nHe's the one who can't handle being in a relationship based on the merits of being in the relationship. You aren't broken and you aren't hindering anything. He's just a selfish person.\n\nYour life isn't over at all. You're still plenty young enough to find someone who actually wants to build a life *with* you instead of wasting any more time on this man who clearly only looks out for *his* best interests.\n\nYou will find another job. You will move on. You will be strong. You will get through this.\n\n> I haven't had the courage to tell any of my friends or family yet because I am already shamed by them for being infertile.\n\nIf anyone actually shames you for something you can't control, then they don't deserve a place in your life. You *should* reach out to your support group: your loved ones. I would bet money on them not caring at all that you're infertile and that at least one of them would have some harsh words for your asshole ex.\n\nIf you're anywhere near SWMT, I will happily come to your house with some tea and a shoulder for you to cry on.",
            "While I didn't think I was \"infertile\", I had three miscarriages before having my daughter. It brought a lot of pain in my life. I discussed the future with my husband (SO at the time) at length because I believed that I just was never going to be able to have kids for whatever reason. The miscarriages were unexplained. During that conversation, my husband stood firm that we would not be splitting up because of this and if we couldn't have children, then that was okay because we had each other. We went through this \"infertility\" (miscarriages in my case) with each other. Your husband, for his reasons, has decided not to do that. Great. He will no longer be wasting your time and you can find a supportive partner, if you wish to do so. You're not broken. I do want to say, I would seek a second opinion for why IVF isn't working and what's going on.",
            "I can't say anything better than u/Exis007 did about how to deal with the divorce situation, but please try to remind yourself that **you are not broken.** It is *not* shameful to be infertile. It is *not* your fault that your body cannot carry offspring. You cannot control this.\n\nThe USA puts an unhealthy emphasis on women having children, especially biological ones. But, in reality, there is nothing wrong with having children, and there is equally nothing wrong with *not* having them. You are not a disappointment to sane, rational humans.\n\nI am so sorry that all of this is happening at once to you. No one deserves this kind of pain.\n\nI don't know if anyone else recommended it, but therapy helps a lot with traumatic loss (like the loss of your husband and the loss of your potential motherhood). You should definitely try it.",
            "You're not broken, just in case nobody has told you. You're just suffering a lot, but broken means you can't be healed or repaired. I believe you can be. ",
            "wtf? Is this real? I would never divorce my wife because she can't have kids.",
            "This is silly, if I was the guy I'd be like \"we'll that sucks but let's work together and if we want kids then we can look at our options.\"",
            ">He used to hold me at night and tell me that he would never leave me, no matter what; that being childless was okay and I was worth it. I now know that is all a lie.\n\nIt wasn't a lie, I'm sure he believed it back then. Now, the reality of things has set in. Life sucks. \n\nI can understand his side of things. I've bailed on years long relationships because she wouldn't have kids as a choice. There's no sense demonizing the guy.",
            "Your husband is a piece of shit. Not because he wants biological children, not even because he essentially lied to you about never leaving you. People are allowed to change their minds about whatever they want. \n\nNo, your husband is a piece of shit because he served you divorce papers out of the blue, without even talking to you about it. I am so angry on your behalf and am truly sorry for you. What a selfish, narcissistic piece of shit.  I know this is cold comfort right now, but you will be well rid of a man who didn't take your feelings into consideration, didn't prepare you for what was coming after TEN years together, and who didn't love you for who you are rather than for what you could do for him. \n\nThere are many, many other men out there who can be good partners, who will work through your fertility issues with you, who will love you. Don't give up on happiness!",
            "I'm sorry this is happening to you. Get a lawyer for the divorce and let him or her handle it. \n\nIt will get better with time, you'll find someone new and you will be happy again. I promise.\n\nThere's nothing else I can say. ",
            "You're not the one hindering anything. Always remember that. Everyone has something wrong, everyone has a skeleton. The fact that he's leaving you because of your imperfection is NOT YOUR FAULT. There is nothing wrong with you.\n\nI've been in dark times like this myself. The biggest thing I can offer to you is to always remind yourself that it's not your fault things didn't work out. There wasn't anything you could've changed. We are all imperfect, that's what makes us who we are.\n\nI hope everything works out for you. If you need or want someone to talk and vent to, message me. ",
            "This is the first time I've found myself wanting to contribute to a post, yet I have no idea what to say. I understand both OP's preference as well as her husbands need to leave. Sure it's a dick move on his part to a degree, but they had both previously mutually agreed that neither was interested in adoption, so it is what it is. Still, I can't help but feel that there's more to this. For example, could you clarify something?\n\n\"but that he had been miserable and if I wasn't able to have a child, he couldn't stay with me\"\n\nSo you're saying he was miserable *because* of the fact you couldn't become pregnant? Or was he unhappy *in addition* to that factor? \n",
            "wtf is this the middle ages?\n\ndon't feel like your life is over, plenty of people don't have children",
            "Have you thought about surrogacy? ",
            "Would you have divorce him if he was infertile? I don't know how strong your desires for biological children are but what he did was absolutely cruel and dumb.",
            "Hmmm. Well, for some perspective, there are some awesome people out there who don't want kids ever. I'm sure you're gonna be better off without this guy, even though it'll be painful at first.",
            "Talk to me. I'm here. Pm me. You don't have to be alone. ",
            ">I can't blame him though, because it was me who was hindering the relationship; I am the broken one. \n  \n**No.**  Just, no.  You are NOT \"broken.\"  You are not at fault.  \n   \nIt's okay not to blame him.  This is one of the most heartbreaking things a couple can face, and sometimes, some couples, or some individuals can't handle it. It's awful and it's sad, and it rips *my* heart it seeing it from the outside (I know more couples than I feel like I should who face this challenge), so I can only imagine how devastating this must be for you right now, and I'm so sorry that you're going through *any* of it, let alone ALL of it.\n   \nThat said, you cannot blame yourself for this.  It's not like you haven't done everything in your power to try to make it happen.  You have done nothing wrong.  Please, please do not blame yourself.  Please.  \n\nOh, I'm just so sorry this is happening.  I know it hurts.  Please just give it some time.  Things WILL sort themselves out here, for the best (even if that seems impossible right now), just hold on.\n   \nGod, I wish I knew what else to say.  I suppose I can offer to listen if you wanna message me or something.  My heart just is really going out to you right now.  : (",
            "You may find that once this is all behind you that you will find a partner who you do conceive with.\n\nOr a partner that doesn't want kids or already has kids.\n\nYou may learn that you are OK on your own and that you don't need a partner to be happy. \n\nEither way, best of luck with moving on with your life. ",
            "What makes him think his sperm is so special?  What's to say his biological child wouldn't have a developmental delay, and a child that you adopted together wouldn't grow up to cure cancer?  \n\nI really don't understand the \"he's not a dick\" comments because he IS a dick.  He IS wrong.  Life does not come with guarantees.  I'm healthy now, I could be diagnosed with cancer next month.  I hope my boyfriend wouldn't leave me because he \"only wanted a healthy girlfriend\".\n\nYou and your husband both wanted children.  That wasn't in the cards for you.  I understand that's disappointing and frustrating.  But I don't see how that means he can't love YOU.  I don't see how that means you couldn't revisit your views on adoption (whether or not you would have chosen that is of course up to you).  \n\nHe's selfish, weak, and immature and I'm so sorry, OP, that you had to find out this way, but he wouldn't have been the father that you'd have wanted for your children anyway.  What if your baby had been born with Down's Syndrome or another delay?  What if your perfect child had an accident at 10 years old and became paralyzed?  \n\nYou know now how he would have handled that.\n\nI know this hurts terribly but you're better off with out him.  I will keep you in my thoughts that someday, you will be able to have children, or will meet a wonderful man with kids, who had a POS shit wife like your husband.",
            "I guess I'm the only one who thinks this guy is a class 5 scumbag.  I'm sorry, but marriage is a commitment.  Lots of things can happen, people can gain or lose jobs, have good or bad health, and there's always the possibility that one or both of you will be infertile.  It's just my opinion, but I feel like unless there is infidelity or abuse of some kind going on, marriage is meant to last.\n\nMy husband has no sperm.  Zero. Having a biological child with him was not possible. I would never think for a second about divorcing him because of an issue that is completely beyond his control.  \n\nThe divorce is going to be incredibly painful.  Definitely contact a lawyer, they're there to protect you and make sure you're treated fairly. When the papers are signed and it's all done, then you can start the healing process.  It's going to take time, but it will happen, and one day you'll wake up and realize that you feel like yourself for the first time in a very long time.  I wish you the best!",
            "[removed]",
            "Maybe because I'm a woman who can't easily have children, and maybe because I don't want any..and I'm in a marriage..but I find it horrible that your husband who loves you, who has seen you struggle, who sees that you have tried over and over again to have a child and you cannot is leaving the love of his life to go start a life with someone who is Not you and trading you in just like that because he wants a child. It seems so incredibly vain. \n\nI'm sorry that you're going through this, but I will never understand  the obsession  of having a child let alone letting it define you. This person who vowed to stay  with you through thick and thin who saw you repeatedly try and struggle is going to just throw away a person he supposedly loves to go find someone he may not love as much as you simply so they can have HIS child. \n\nWhat's wrong with adopting? What's wrong with spending your life without a child and growing old together.\n\nIf you hadn't tried I could understand but I'm sorry and I know people won't agree with me but I find this behavior horrible. And you will meet someone who will love you more and who will not care that you can't have a child or be happy adopting. Which is a while special relationship  in itself. \n\n",
            "There is nothing broken about you. You can't have kids. So what? There are many other options besides divorce. Breaking vows like that is a sign of cowardice and a lack of ethics. He is the broken one. ",
            "I'm so sorry.  He did call it, though-- he's the monster.  He can't be the man you need-- you're not broken, you just have a very common medical disability.  Would you berate a woman whose husband couldn't deal with having a wheelchair user? Or a woman whose husband chose to leave her after she had to have a double mastectomy?  Probably not. So be gentle on yourself. Sure-- being with someone with any disability means there are some difficulties and sacrifices. That guy who dumps the breastless woman, he could talk till he's blue in the face about how important tits are to him and how he always dreamed of having tits he can share with his wife, that he needs tits in order to be sexually satisfied and sex is really important. Does it make him a nice guy or generally mean he'll be happy in life-- probably not. \nHe's put you in a shitty position and he's not treating you as you ought to be treated.  He probably would have put you in a similar shitty position if you had had a baby with a disability or you developed another disability.  He's not the man you deserve or need.\n",
            "Are you absolutely certain that another woman is not involved? I've seen this before, and the husband abruptly moved out and asked for a divorce. Shortly after, it was discovered that he'd been seeing another woman for a year.",
            "I don't want to have kids. I'd never marry or date someone that wanted kids.\n\nPoint is that your life isn't over. This is just a chapter of your life ending. There will be the next chapter, and I am sure you will find someone that doesn't want to have kids, and you can build a happy and successful life with him.\n\nMy heart breaks for you. I can only offer all my sympathies and commiserations. I really wish you all the best of luck. *hugs*\n\nTalk to a lawyer asap.",
            "I don't understand, has surrogacy never been an option? Having a biological child is not contingent of a man and a woman anymore... This makes me so sad for you... I hope you find happiness",
            "Fuck this guy. Jesus fucking Christ. As a single 32 year old dude, finding a chick worth staying with for 10 years would be amazing.  Finding someone I wanted to have kids with would be amazing. This asshole has that, but can't get over not having a biological kid? Fucking get over yourself and adopt. What woman is going to want him when they find out what he did? What if the kid he gets eventually is autistic or something? Would he cut and run?  \nCry it out. Pull yourself together. Go get a job. Find someone or don't. Adopt a kid and love the shit out of it and realize this dude was a piece of shit.",
            "You ask people not to judge you for being a couple of biological determinists, but indeed this would be a completely different story if that were not the case. ",
            "[deleted]",
            "I'll go ahead and take the downvotes, but seeing so many people hate on your ex husband I have to say it. \n\nFor some people having children and raising a family is the ULTIMATE goal in life.  Not their job, not their house and life, but raising children.  \n\nI'm sorry for you OP, but some people *NEED* children of their own, and without which their life is not complete.  ",
            "Call a lawyer. Don't wait until you stop crying, and don't let him walk all over you. Call the friend or family member you trust the most and get the ball rolling. You need someone to think of the practical things right now because you can't. He's been thinking about this for a while and he's going to try to screw you because he's 2 steps ahead. Even if you're in a no fault state, call a lawyer ASAP. ",
            "I've been where you are in terms of the failed IVFs, but my husband and I pulled together rather than pulling apart.  I think your husband is a shithead, and you need to get really, really angry and lawyer up.\n\nYou did not fail him, your body failed you.  He failed you as a partner.  End of.",
            "Look on the bright side, you will be a 32 year old woman with no kids...your are a very high commodity in the dating scene. I'm 33 m with no kids, what's up? Jk. Hope you are able to move pass him being a douche nugget.",
            "I'm so sorry for what you are going through right now. I just want you to know that you are not broken, flawed, or in anyway not \"Enough\". You are a human being, and you deserve to be with someone who makes you happy. \n\nI hope things turn around for you. \n",
            "No advice. Just wanted to say that I'm sorry for what you're going through. I can't even imagine how painful this is and I know it doesn't seem like it'll ever get better, but soon you'll begin to heal. You will be happy again.",
            "I don't want kids. Single. Let's get in touch. ",
            "> I now know that is all a lie\n\nIt wasn't at the time though. But as his urge to have a child grew, he could no longer hold on to that notion\n\nIt's been stated already, but there was no positive outcome over this. You couldn't provide him with a bio-child of his own and he really wanted one. There was no happy ending to this.\n\nHe most likely still loves you very much, but his need for a child is great. The divorce allows you to now find somebody who loves you for you, and he can find somebody that can help him fill that need for a child.\n\nIt's sad, and I feel sorry for both of you. While the actions are hurtful, he has done nothing wrong, nor should you feel any less of a person for not being able to have a child. Neither one of you is any less of a person here. I cannot express that enough.\n\nGood luck with everything. Time will heal your wounds.",
            "If I truly loved my wife I would never her. It seems like there's more than not being able to conceive is the reason he's leaving. ",
            "The fucked up thing is this is probably very common. \n\nIt's honestly pathetic that he's divorcing you over something you can't control. He didn't want to marry you, he just wanted to be married. \n\nYou still have a lot of life to live. Get counseling, get help, do whatever you can to move on. ",
            "It's really too bad that you two couldn't adopt. You'd have the children you'd always dreamed of and this divorce wouldn't be happening. No judgment here. Your husband is a coward and I'm very sorry he's decided this.",
            "> He told me that he was the monster \n\nHe's right.  \n\n>  I can't blame him though, because it was me who was hindering the relationship; I am the broken one. \n\nLet's say you did have a child.  And the child had Spina Bifida, or MS, or Lupus, or any number of other medical issues.  Would you consider that child to be \"broken\"?  Of course not... so stop thinking of yourself as broken.  You aren't.  You are no more at fault for this than your child would be if THEY had a medical issue.\n\nAnyone who is \"shaming\" you over this needs to be cut from your life, no discussion.  You have done NOTHING to feel shame for.\n\nYour husband, on the other hand?  He should be walking around for the rest of his life with his head hung low, begging for crumbs.  He doesn't deserve a wife, let alone a child.  He has plenty to feel ashamed for.",
            ":(",
            "First off, I'm sorry to read that you are getting a Divorce. Second, you're better off without him. He showed his true colours when serving you those papers. Also OP: lawyer up, he's been planning this for awhile. So he as one in his corner already. ",
            "You should not be feeling shame, your husband should. He married *you*, not a baby-making machine. ",
            "The biological imperative is a powerful force.  Millions of years of evolution have hardwired it into our lizard brains.",
            "Your husband is an asshole.  'Biological imperative' my ass, he is willing to leave the woman he loves because he loved the idea of a child more than his life with her.  Hopefully he's single until he dies of extreme old age, and regrets it every day.\n\nI am so sorry you are going through this.  Be certain though that it is NOT your fault.  ",
            "I'm surprised that I was able to scroll really far down without finding mention of this. OP, I would bet my dog that your husband is cheating on you with a younger woman. He thinks he's got another babymaker on lockdown right now and needs you out of the way so that his potential children with his new partner won't be bastards. Don't go out and get a job, **don't sell the house**. I hate giving out such typical Reddit advice but GET A LAWYER and consider getting a private investigator too. This sounds like a change in behavior that you should be keeping an eye on, and it doesn't bode well for how he's going to treat you in the divorce. He wants you blindsided and weak with grief, and he's going to absolutely fuck you.\n\nThat's just my opinion though.",
            "Alright, first of all, I am so so so sorry for what you're going through.  I can't even imagine all the pain you're experiencing here, and I can only hope you can find some peace with time.  Please know this is NOT your fault.  Those feelings you have that you are responsible for what is happening here, that you did something to deserve this?  Know this is NOT TRUE! You have every reason to feel betrayed and NO reason to feel you have done ANYTHING wrong! \n\nNow, here's why your story makes me so angry I'm almost seeing spots: your husband was a fucking coward.  I am so sorry.   \n\nServing someone divorce papers, unannounced, is what you do to someone who has wronged you beyond repair.  We see plenty of problems in this sub that might warrant this kind of treatment: abuse, infidelity, deceit.  He blindsided you with something that, if it were really the only recourse (more on that later), he should have AT LEAST discussed with you before shoving the papers in your face.  He couldn't even use his own goddamn words.  He made you read it off a legal document.\n\nYou understand his reasoning, sure, and maybe, ultimately, this is still the thing that would have ended your relationship.  But unless theres a big chunk missing from your story, your relationship came to a difficult crossroads (rethink the whole biological thing, or live childfree, or go to counseling), and instead of staying the path \"in sickness and in health\" like he promised, he took the most cowardly option, turned around, and fled.  Maybe after time you could have come to the decision together that the relationship could not go on... but he threw in the towel before the match even started.\n\nYou did nothing wrong, OP.  Nothing.  You are NOT broken.  He is.",
            "So suddenly divorce? No talk of adoption or surrogacy? \n\nNo funds to pay for another round of treatment but he can rent an apartment across town? He can afford a divorce? \n\nSomething here doesn't add up....",
            "Blah. People need to shake this silly idea that having children is a \"biological imperative\". It's not. Plenty of people don't have children, and they're ok. Another plenty adopt children and find that they love them as if they were their own. \n\nYour soon-to-be-ex-husband is incredibly selfish, and I'm sorry but yes, I do judge him. How could you turn your back on someone you love just because she can't have biological children with you? I really hope he fails at having kids, because this ridiculousness needs to be out of the gene pool.",
            "I am so sorry that you are going through this. I won't call your husband a dick, because that won't help you. You don't hate him. I disagree with his decision, but nothing anyone can say will change it. \n\nConsult a lawyer immediately, and please take great care of yourself. ",
            "Obviously this isn't what you planned and it sucks right now,  but you'll be OK,  you'll be different, but you'll move on and be happy.",
            "I'm so sorry OP\nPlease know that life isn't over.\n\nWhen you are feeling better, please consider that even if you can't get pregnant the regular way, you can still have children.",
            "I am so, so sorry. I too am dealing with fertility issues. It is the absolute worst. I can not imagine the pain this situation with your husband has caused you. Take the time you need to process this shock. You probably feel at the bottom right now but you will build yourself back up! Gosh, I wish I could give you a hug. ",
            "I'm sorry for what you're going through, stay strong you have your whole life to make new memories and new relationships, you aren't \"broken\" ",
            "Adoption is not easy, nor is it for everyone.  As someone who has been there done that x2, I am currently experiencing more stress with my now teenaged children than I did with my failed IVFs.",
            "I am really sorry for your pain. He may have meant he wouldn't leave in the moment but later realized he was not being honest with himself.\r\rYour pain is real and certainly understandable. There are great men out there who don't want children or can't themselves. Don't lose hope.",
            "I'm not sure about the costs or anything- was finding a surrogate an option? -- either way I doubt I'd want to now if I was in your situation. \n\nI'm so sorry for your pain, and don't have much insight on the subject, but please know you have people here to support you if you need it- even if we are strangers. Stay strong. Message us if you need support.",
            "First off, I am really sorry this all has happened to you- Indeed it is not fair. \nReading some of the below replies to you were so beautiful. I could relate to them on a different level. I hope you read these and try to buck up!  With some proper YOU time and healing, you will come from this a better and stronger person. We all believe in you, you CAN do it.  xxxooo OP <3 <3  You will crush this chapter in your life and you will be damn proud of yourself. This is the perfect opportunity to really focus on yourself and learn to love your new-found self.\n\nTake care OP. It is okay to cry and grieve, just don't dwell. ",
            "It's OK you are a treasure to someone who doesn't want kids. Duck his worthless ass",
            "I know a couple who couldn't have babies so they adopted and the first couple of months the mom was a wreck saying she didn't feel connected to her adopted child because of the lack of hormones and all that. Now she is COMPLETELY happy with her adopted child after bonding with her over time and the couple doesn't love her any less.\nI know you said you wouldn't adopt, and I actually can understand it to a point. But in my opinion, a kid that isn't yours by genes but IS yours by love is MUCH better than no child at all. \nI can't imagine what it must be like to not have children and I hope that eventually some day you can! The couple I know actually ended up being successful with IVF and had two twin girls as a result. \nI wish you the best!!! Your life is definitely NOT over, though I'm sure I'm not the first or last to tell you that. I believe there is a solution to everything so keep trying :) ",
            "ITT: lots of assholes who think you should stay in a relationship that makes you unhappy solely for someone elses benefit.\n\nAlso known as abuse.",
            "You are not broken. Please remember that. And there is no shame in not being able to have children. This cultural bullshit that manifests in your feelings makes me so sad. Please know that you are a wonderful person regardless of your situation. All the connotations that come with infertility are so heartbreaking and you are so strong to face it head on. Sending love from Canada!! ",
            "How are you doing?",
            "Wow, I never realized how many people would never consider adoption.  The height of selfishness right there.\n\nEdit: I'm not talking about people who would consider adoption but find it unpalatable due to cost or waiting lists, I'm talking about people for whom it's simply not an option because they *must* have their own biological children, such as OP and her wanker husband.",
            "[removed]",
            "Funny old world.  I do not want children, and am bewildered with this breeding obsession.\n\nYou will be OK, but it's not easy.  Going NC with my ex helped.  Producing kids is absurdly overvalued in our topsy-turvy society.\n\nYour husband will end up with kids, but will he be happy?  \n\nYou're going to be OK.",
            "You are not a monster.\n\nI can't understand what it's like to have a husband who leaves you like this but I can relate to the feeling of being \"broken.\"\n\nI was just diagnosed with endometriosis a few months ago. After years of awful and mysterious pain my doctors started telling me that I would never be able to have children. I'm 25 years old. I feel broken too sometimes. \n\nYour husband can leave you and maybe he will have biological children. But you know what? A 35-year-old man who can abandon his beloved wife because she is infertile may be able to be a sperm donor but I doubt he will ever be a real *father.* This is the kind of human being he is when life becomes difficult. You may or may not be able to carry your biological children. No matter what happens you can find a way to care for someone the way that a loving parent should. \n\nI hope that you will be able to conceive a child. I know it feels as if you've died and your dreams of motherhood are gone forever. They don't have to be.\n\nThere's nothing I can possibly say to make this less painful for you. But somehow you will get better. Loving people who choose to do the right thing even in the face of tragedy can always find a way to be parents. Maybe you'll be a mother to your friends, to a cause, to a project you love, to a child you adopt or to your biological child. But you'll be a mother. ",
            "So why no adoption. I mean, sorry he blindsided you but he is taking a civil route (no matter how people here judge him its his right to call it a deal breaker ) all I keep thinking is why no adoption? ",
            "Bro wants kids.  \n\nYou cant do that for him.\n\nThis sucks but its better he goes, rather than stay and hate you for ur inability to give him a family.\n\nPlus you dont have to stay with such a man. You have the opportunity to meet someone who will love you for you, and what you are capable of. Good luck OP.",
            "What about surrogacy?",
            "I DO NOT understand why people wont just adopt. Sure its really hard not to have your own child, but who cares? I mean really WHO CARES? Its still a child that needs love and a home. Why wont people just give them a chance instead of spending so much money on something that just isnt going to happen? Its like saying I want a pure breed only and NOT getting a dog even though the shelters are over flowing with really good dogs that need a chance to. And I do understand people are going to rip me a new one for saying this, but really people, it needs to be said and said more often!\n\nThat aside, your husband will have his karma in the end. My ex's aunt was served papers in her hospital bed after giving birth to their 5th daughter and he wanted a son. He got married 2 more times, had his son (poor child may he rest in peace) and that boy died at 9 years old. Karma is a serious bitch sometimes. I dont wish that on your a-hole ex, but I do hope that karma kicks his ass over something SO stupid. SO STUPID! JUST ADOPT GOD DAMN IT!!",
            "No sorry I will judge both of you for not being willing to adopt.  Unless you have bill gates level intelligence or lebron James level physical gifts your genes are NOT special.\n\nYou and your husband could have had the tens of thousands of dollars from treatment and an adopted child that would have been so happy to have a home and someone to care for them.\n\nWill never understand decisions like this.",
            "Don't get down on yourself. None of it's your fault. Your husband is a horrible person, and you are better-off in the long run without him.\n\nI knew a guy whose wife turned out to be infertile. They had done the whole routine of sex at prescribed times and fertility drugs for almost a year.\n\nShe had wanted to stop trying because it had just worn her down. But he just berated her into keeping going. It had to be his biological kid. No other options, and they had to have a kid.They had run-up $100,000 dollars in debt that he insisted on borrowing after they had drained their savings, by the time they finally found out there was no way it was going to happen.\n\nHe then convinced her to talk her sister into donating an egg, which her sister finally gave-in and did.\n\nSix months after their daughter was born he started an affair and carried it on for two years before it all blew-up in his face. Two families ruined, the woman he was cheating with dumped him and went back to her husband. (But there's no way that one's ever going to be the same.) His wife divorced him, and now he sees his daughter every other weekend.\n\nThere's no guarantees that it would have lasted. Your husband's a disingenuous liar. Even if you had never had a problem, and had kids, you still would have been married to the same guy you're seeing him to be now. He didn't change because you're infertile. He's always been this person. Even if you had had children, it would have just been a matter of time before you found out some other way.",
            "What I learned from this thread? Reddit is a poor place to go for advice. \n\nOP, please find the strength to tell one good person that is close to you. Then let them and a counselor give you the support you need to move forward. ",
            "Oh wow, I am so sorry for everything you have gone and are going through. My husband and I are both infertile and although it has added extra complications to getting pregnant it has been so much easier to grieve the process as a team. IVF is brutal and so hard on a relationship as it drains every emotional, physical and financial reserve you have. I only done 2 fresh cycles and 2 frozen but every negative (and now an early miscarriage) hurts more than the last. \n\nYou are not even close to an old maid at 32 (at least I hope not as an infertile 31  year old!). I will not tell you that you can still adopt and that will fix everything as I know how difficult adoption actually is and how much of a personal decision. I can say though that (eventually) you will get through this and that life has so many amazing things to offer. I haven't figured out what I will do if kids never become a reality but I know travel and adventure will fit in there somewhere. Most of all I will just say that this sucks, I can't imagine the pain you are going through with a divorce on top of infertility hell. Huge internet hugs and I will drink a glass of wine for you tonight.",
            "I am confused by a lot of advice in here.  Is she supposed to lawyer up so she gets money from him?  Or is this just to protect herself in case he does something?",
            "> \"He used to hold me at night and tell me that he would never leave me, no matter what; that being childless was okay and I was worth it.\"\n\nYou also mentioned in another comment that you felt anger towards him for lying about this and I'd just like to address this briefly.\n\nI do think though that, as people, we keep growing and changing our entire lives. Circumstances, situations and feelings change. Maybe he didn't understand his own feelings about it, or maybe he genuinely meant what he said at the time. His feelings on it may have changed, however. I don't believe that is his fault. Maybe he realized that having children meant more to him that he initially understood.\n\nWith this in mind, I don't think it's entirely fair to say that he lied to you. I don't think he intentionally or maliciously deceived you. But he changed, his feelings changed. So maybe the promise was a somewhat foolish and reckless one, and I also think the hurt it gave you is understandable, but I'm not sure if he's a liar.\n\nI don't know if it's a meaningless distinction, but I just wanted to mention it. The top responses in this thread echo most of my other thoughts. I'm sorry for all that you've had to go through and I wish you the very best!",
            "It seems like everything regarding the divorce has already been put very eloquently, so I'm only going to ask: I don't understand the infertility situation fully, but why was surrogacy was never an option? ",
            "Your husband is a stupid, heartless man.  In the long run, you are better off without him.  You need to find out who your true friends are and get them to rally around you, quick.  The fact that people are still shamed for infertility is a ridiculously idiotic part of our society.  \n\nI am so sorry that all of this has happened to you.  Get every bit of help you can, whether it's from a therapist, your friends, whatever family you have, anything.",
            "The person divorcing you is not allowed to serve you, OP. (At least in my state, NY, you can't). That said, *he* got a lawyer, so you definitely need one for yourself. This is the worst part of breaking up, right now (been there, it's truly awful). You don't have to feel ashamed about not having kids. You need to think of the closest person and call them and tell them exactly what happened. This, for me, is what saved my life in those early days and weeks. The people who loved me circled the wagons. A close relative who I had been estranged from made it her business to stop by every day and check on me to make sure I was up and out the door to work. Work was *my* sanctuary, so I'd suggest you get out there as soon as you're up to it and pick up a job, anywhere, just to have a routine to stick to while you get used to your new life. His reasons for going are so beyond shitty, that I can't even with this guy. May his dick never work the rest of his life (that's an old Italian curse, but my Italian is rusty, so it's in English). I have a close friend who went through round after round of IVF and she was able to get one pregnancy out of it; but she says it did a number on her body, all of that hormone injecting and such. Maybe the universe, in a strange way, is giving you a break from all of this stress and setting you up for something better. It sure showed you how Mr. I'll-Never-Leave-You was full of crap. Move your focus to your own well-being, mental and physical, OP. First, get a lawyer, find out your rights. NO - *tell your family and friends*, then call a lawyer (I got a reference by calling my state bar association-they gave me a wonderful lawyer, she was a real cracker jack). That saying \"one day at a time\" was tailor-made for anyone going through a divorce. If you think down the road too much, you will drive yourself crazy. Take care, OP and please update in the future. I'm sorry this is happening to you. (Off-topic, I'm going to guess you're a Taurus because the sun just went into your sign).",
            "As a daughter of parents who adopted me when I was a month old, this post makes me incredibly sad. My mom could not have kids. My parents tried everything, including IVF, until they found out my mom had tumors in her ovaries and losing her ovaries was the only solution to save her life. \r\rI am the same nationality as my parents and amazingly look like them, so no one ever suspects I'm adopted. Probably the only negative is having no medical history, but that is overshadowed by all the love my parents have given me as if I'm their own because I am their daughter.\r\rI am not judging you for choosing not to adopt and I'm incredibly sorry you are going through all this pain. I simply wanted to give you the perspective of a child of adopted parents who would never ask for a different life. I wish you all the best and, despite how things are now, I'm sure you *will* have a wonderful life.",
            "A lot of people seem to be calling the husband a heartless bastard, it seems heartless but he deserves to be happy just as much OP does even if it means separating which is better than dragging on an unhappy marriage. A relationship where one partner is resentful towards the other is unhealthy. If the roles were reversed I'm pretty sure this sub would be recommending a divorce. It was wrong to serve papers the way he did but even if they talked it through it wouldn't change nothing. Everybody is talking about other options but fail to realize how expensive it is, especially for a person with no job. ",
            "Coming from a guy...Your husband is the broken one, not you. You'll get over it and you'll find somebody that will love you the way you are.",
            "Your soon-to-be-ex is an effing coward.",
            "[deleted]",
            "He's a terrible person. I don't care if this gets downvoted.  He is selfish and shitty. ",
            "What a selfish prick. There are millions of kids who already exist and need a good home. Why does everyone need a kid that looks like them. You already found someone you're in love with. Do you also need to have a kid with your genetics? Make the compromise for your wife and for the poor child who dreams every night of being with a family. If he's not willing to do that for you forget him. ",
            "1. Husband is a dick, really. I couldn't even imagine doing that to someone, because of something like this. Not having children is not the end of the world. You're together with someone, because you love THEM, and not view them as potential bearers of your future children. Of course it sucks if you want children and can't, but c'mon.  \n2. Adoption (yea, I won't judge, but it's always an option + you would even be doing something good and provide a home for an unwanted child).  \n3. You're fucking 32. Your life is just starting now. Maybe you won't have kids, so? That doesn't mean your life is over. Gather some friends around you, do stuff, and slowly get back into the game. Pursue those hobbies you've never had time to. Go travelling the world. Get another job (yea that one is boring and annoying, but kinda a prerequisite for the other things).  \n  \nIt will leave a mark, but only you can let that break you.",
            "One day you will realize that it is a good thing you didn't have children with this man.  Life rarely unfolds as you planned, there will be curveballs. Spouses are supposed to stick together and work through their problems together. What if your child had been born with a severe disability or illness? Would he have walked away from you and him for not fitting his vision of the *good life*?\n\nYou are not broken. You just married an asshole who doesn't understand his marriage vows. Marriage is wasted on straight people. When they let us get married, I'll never leave my wife for not getting pregnant. ",
            "To all the people saying he is a dick...\n\nHe expected kids.  It's fair to leave someone if you can't have a family with that person.  Having a family is a main reason people get married."
        ]
    },
    {
        "post_id": "djffbx",
        "author": "mayonnaisepies",
        "title": "[UPDATE] I [30F] still can't decide if I want to end my 12 year relationship with my spouse [45M]",
        "url": "https://www.reddit.com/r/relationships/comments/djffbx/update_i_30f_still_cant_decide_if_i_want_to_end/",
        "score": 2167,
        "num_comments": 155,
        "created_utc": 1571358647.0,
        "selftext": "EDIT: getting lots of messages telling me that I’m a piece of shit/horrible woman/selfish etc. Those are all the same thoughts I had about myself and sometimes still do. But that’s not a reason to stay with someone. \n\noriginal post [here](https://ud.reddit.com/r/relationships/comments/cnfse9/i_30f_still_cant_decide_if_i_want_to_end_my_12/)\n\nSo, I did it. I left him. After really considering what everyone had to say, and talking to my therapist, friends, family, him, an extremely kind redditor who has spent many many hours listening to me and giving me advice, (even still to this day), and yes, even my crush... I just realized that I couldn't spend any more time questioning things, wondering what else was out there. I had to give myself a chance to have the life I really want.\n\n\nIt's been about 2 months now. We are still living together because we own the home, though I am only sleeping here 3 or so nights per week. We are completely civil with each other. He will be buying me out of the house, for less than I'd get if we sold it, but I don't want to go through the hassle of selling/make him have to uproot his life as well. I'm interviewing for some jobs so I can increase my income and afford to purchase a condo on my own, eventually. There's no time table for when I have to leave, I can take my time since I also own this house. I've been staying in the guest room the nights I am here.\n\n\nI have also been dating my crush, and honestly it is going so well. He's more than a crush at this point, I feel incredibly guilty saying this but I am happier then I have been in a very very long time. Being with someone my own age is really different, and being with someone who really wants to experience life in the same way that I do is blissful. He is so outgoing and social, and just everything we do together is so much fun. I have done more with him in the past 2 months than I have done in the past 10 years, in all honesty. We have gone to a wine tasting, a beer festival, some town events, a few restaurants, gone on hikes with and without my dog, watched the sunset by the river, many many bars with and without friends, bbqs, birthday parties, gone out shopping, danced together in his living room, had a fire in the backyard while drinking wine, and the list goes on. This weekend we are going out of town to visit one of my friends and her boyfriend - a double date night. He bought us tickets to a concert for one of my favorite bands in November and we are making a weekend of it. We cook together, he cooks for me, I cook for him, we go to the gym together (I had never really gone before but he is really into fitness so he's been training me)... And on top of all of that, the sex is fucking mind blowing. We want the same things for our futures, and he encourages me that I can make more of myself than what I have so far. We just have such a great time together.\n\n\nI have also been spending time reconnecting with friends of my own, and it feels amazing to have female friendships again. I literally didn't have that for over a decade. I went out of state one weekend with one friend, and we just talked the whole time about everything you could imagine. We laughed, we cried, we gave each other advice, we shared things with each other. It was just really fulfilling! I can't believe everything I have been missing out on... even just friendships like this. I was so isolated.\n\n\nI feel like an awful person still for leaving such a long relationship, especially since it took another man to open my eyes to how unhappy I really was. But looking back, I was so unhappy for so long, and I just didn't understand why. And now it's much more clear. My ex is a good person and I still don't know how I feel about the age difference, but I do know that it broke my heart to break his. It really did. I still cry about it sometimes, not because I question my choice... but because I don't. I'm excited to move out, I'm excited to get my own place and focus on my career and myself, the way I should have done years ago... And that really rips me up. Spend 12 years with someone and suddenly you just want to go. He didn't deserve this. It's very difficult for me to be around him because I just feel so terrible, even though he tells me it's ok and he has made his peace with it.\n\n\nI just thought I'd update. There's still a long road ahead in all of this, but I feel like I'm on the right path. Life is exciting and unpredictable again. For so long, every day was the same, and what I wanted was irrelevant.\n\n\nTL;DR - I left him. I am incredibly happy, and while I do feel really guilty about that, I am not wavering in my choice. Thanks to everyone who told me to put myself first for a change.",
        "permalink": "/r/relationships/comments/djffbx/update_i_30f_still_cant_decide_if_i_want_to_end/",
        "comments": [
            "I'm going to throw a word of caution out there, not as a hater, but as a realist. That crush you have and the bliss you feel right now could simply be New Relationship Energy. I'm not saying leaving your other relationship was the wrong idea, but I'm cautioning against comparing that one and this one as a predictor of how successful your new relationship will be. At this point it's simply new, and that brings with it a certain excitement and stimulation. At some point it may become routine as well and fall into a pattern, it's when that happens that you'll be able to test if it has legs. Part of that will be how YOU behave differently than in you did in your former relationship, not necessarily what your new partner does (although that's important too).\n\nI'm in my 40's dating someone who's more than a decade younger. While it's scary to think what would happen if she left me it wouldn't be the end of the world. I'm my own person, I'll survive. Hopefully your ex will find that for himself as well. We have to learn how to be whole people alone. We have to have separate interests and experiences and have our joint interests and experiences be a bonus not a requirement.",
            "I also jumped into a serious, long term relationship when I was 19 with someone 9 years older than me. Not identical to your situation, but similar. The only thing in my teenage mind was wanting to be in a serious relationship, instead of stupid, immature crushes. And I thought I got what I wanted. \n\nWhat ended up happening was the exact same thing as yourself. 8 years goes by, and you’re stuck. You have lost all sense of self, because there wasn’t much self to begin with. I was terrified to break up because I didn’t know life without him in it. But being single isn’t scary, it’s liberating! I grew more as a person in 6 months than in the 8 years we were together. I traveled, went out to various events every weekend, and reconnected with friends I thought I lost. I called it my late twenties renaissance period. \n\nI congratulate you on your enlightenment period. Enjoy your time with your new man, but remember to focus on yourself this time around. In the end, this is your life, and you should be living it the way you want to be.",
            "Happy you are happy but talking about your future with this guy so soon is tricky. Take your time. Im not saying break it up. But try to be ALONE for a while, don’t move in with him or something like that. Jumping from one relationship to another can backfire.\n\nHope u are good and everything goes well in the end.",
            "As far as your ex is concerned, 45 is not old at all. He can work on himself like you worked on yourself to find what makes you happy and be in a position to pursue those things. You shouldn't feel guilty. He's responsible for himself.",
            "[deleted]",
            "Well done! Whether it works out with the crush or not, you did something really hard that was right for you! \nAlso, you got together with the other dude when you were 18 and he was 32? And then he was saying all those manipulative things when you told him you weren’t happy after 12 years of ignoring what you want so you could be the person he wanted? You 100% made the right call by leaving.",
            "A guy in his 30s should not be going after a teenager, no wonder you feel unfulfilled.",
            "I have a thousand things to say on this, but truly, he was an incredible piece of shit for pursuing you in the first place.\nTrue love means wanting the very best for the person you love. Going after someone 15 years younger and only 18 yrs old, no less, he KNEW you deserved someone your age/your stage of life, etc., but he went after you bc it was the best scenario for HIM. Incredibly selfish, and I'm glad you got out.",
            "I just now read your original post and this one so I’m new to your situation but dangit I am so proud of you for going through with breaking up with him and putting yourself first for once. Being selfless is a good thing but sometimes you gotta think about yourself. You can’t help put out fires if you’re up in flames as well.",
            "Ignore the people telling you you are awful. Here on reddit there is a band of woman-haters that go around the relationship subs and message every woman they can find, no matter the context, telling them negative things. They are just bitter, pathetic, useless cowards. You did the right thing.",
            "So happy I got a chance to read both of your post! I’m in a VERY similar situation. I’m (30F) married to a (38M). We have 3 kids in total (1 bonus from him, 2 for he and I), married for 3 years, together for 6 1/2.. these last two years have been tough on me. After a period of finding out he cheated on me prior to marriage and I believe during and then after I reciprocated the action, we tried to make it work, but I haven’t been able to find myself back in a space where I am happy. I thrive in a continuous rolling relationship, I enjoy going out and being active, I feel boring and old when I’m cooped up. I feel like I’ve sacrificed so much of my life in my 20s I lost myself. Needless to say, I want to leave. My therapist told me I sounded miserable in the past but I had to choose between continuing school or working through a divorce. I chose to finish school at the moment.. now that’s that done and I’m back at square one, feeling complacent. \n\nI connected with someone and he’s really nice, but I won’t allow myself to get caught up in it, I’ll get frustrated. Unfortunately, connecting with someone has made me realize even more that I’m unfulfilled. My husband isn’t a horrible guy. He’s a great dad and he tries. I just have my hang ups.. he has been guilty of lying about serious things for attention and some things that require attention, he very passive about. I don’t feel the security I would like to feel from a man. I don’t feel stable and I’m always feeling like I have to get the job done. \n\nI don’t want to sacrifice my happiness anymore.",
            "I'm glad you are doing so well. Although it is often difficult, people get through divorce all the time and live to tell the tale - I am sure he will do so.\n\nFrankly I think someone in their 30s should have known the risks of pursuing an 18-year-old kid whose brain wasn't even fully developed when the relationship began. But ultimately I hope everyone in this situation ends up happy and healthy and learns from their experiences.",
            "I'm so proud of you. Welcome to your new life. You made the right choice.",
            "I did a similar thing for similar reasons and came out of it with so many of the takeaways  and feeling you have. You made the right choice, and so did I. I just want to assure you that you deserve the life that makes you most happy - and that is a standard that will change for you over time. I am proud of you for listening to yourself and trusting in your drive for happiness.",
            "[removed]",
            "I'm proud of you for having the courage to leave. There's nothing wrong with leaving someone who is a good person - sometimes, you just have to put your happiness first.",
            "I’m sorry to hear that the moral brigade seemed to jump on your last post. You’re not a bad person. You’re normal. I feel some redditors expect people to marry between the ages of 18 - 25 and remain the exact same person, compatible with their partner, for the next 60 years. That’s a fairytale. Life does not work that way. \n\nYou’re still very young and it appears you missed out on a lot of experiences people your age already have had. You still have your whole life ahead of you. You have to put yourself first. \n\nSometimes a person will come along in our lives who will change our perspective on everything we thought we knew. Like they are directing you to the correct path you should be on.",
            "Those who send you crap have never been on the receiving end of this. Go for it girl, be happy. Who gives a f about random assholes on reddit ;)",
            "That is such a good update. Unfortunate for your ex but he will bounce back. Good on you for putting yourself first. Ignore the haters, you have to do what is right for you.",
            "Holy fuck are you me?! Our story, ages, and timeline match up almost spot on. I have been having trouble putting into words my life and here and in your last post, you have. Thank you for this. You are not alone.",
            "I was in a similar position myself when I left my girlfriend of 6 years (I did not have a crush though).  My current girlfriend was in EXACTLY the same situation you described in your original post.  We started dating pretty quickly after she left her ex and honestly we haven’t looked back since- it’s been amazing.  We’re about to celebrate our two-year anniversary soon and couldn’t be happier.  \n\nThat being said, it’s important to remember that you and your boyfriend/crush will need to do a LOT of open communicating about a whole shit ton of stuff so you both can fully process how this relationship started.  People are going to judge this relationship because of how it started and you will likely get a majority of it.  Figuring out how to navigate and deal with as a couple that is important- you need to establish yourselves as a team.",
            "Good for you! It isn't easy to do what you did, but you did it anyway. I feel kind of lost myself, at the moment, so reading your story gives me hope.",
            "I'm so, so happy for you. You're not an awful person for wanting to live your life. Your spouse may not be a bad person but he was clearly very bad *for you*. You already gave him so much of your time, never feel bad for not continuing to make the same mistakes.",
            "(1)\n\nI'm really happy for you.\n\n(2)\n\nAll that stuff other people have said about being cautious with any potential beliefs about where this will go or about how things could turn out with the new guy. But your statement in a comment that, even if he'd stopped being an option early on, the contrast would have planted a seed anyway, is very encouraging. You didn't want to leave \"for\" somebody else. You wanted to leave because somebody else had broadened your awareness to some pivotal information about what you want in life.\n\n(3) \n\nKeep in mind that you're both much older and much younger, emotionally, than the majority of your same-age peers. You're older because you understand twelve years of marriage, and you spent those years experiencing a long amount of time of a sort of domesticity that is still in their future, or which they have only just begun.\n\nYou're younger because who you were at eighteen has been, in some ways, locked in for those twelve years while you had to stagnate in order to stay a suitable match for your husband. Your husband who you've now outgrown. You're young because he's all you've known, and you simply haven't collected the experiences many others have collected at your age. \n\nI don't in any way mean to be condescending, but -- from my perspective as someone who's about your age -- you write of your marriage and of your current, new relationship in a way that sounds about... 22ish. Like someone much younger. And how could you be any other way? Your marriage has been utterly dependent on you stopping yourself from outgrowing the person you were when you were with your spouse. \n\nYou are now experiencing something most people experience far younger, based on your description of how it's been so far with this man. It's an amazing feeling. I'm so glad you're getting it. And you describe it exactly the way young people describe it. Pretty fucking great, yeah? \n\nAnd then if it ends, which it probably will since statistically most relationships do, you'll learn about being a single adult. And then when you date someone else, you'll learn that you can experience that rush several times, and the loss of the person with whom you first experienced such bliss does not in any way mean you won't find that same level of bliss again. And then one day you'll date someone, and experience that bliss, and then realize the quality *lasts*. And that's the person you'll seriously commit to. And you two won't outgrow each other. You'll instead grow together.\n\nYour emotional growth is going to *explode* forward now. It's going to explode forward the way every shock-to-the-system life change spurs growth. You're going to be emotionally 30 in the relationship department soon enough. \n\nI'm really happy for you.\n\nPS: I don't inherently judge age gaps. But yeah, 18yo's who date far older people inevitably outgrow them. With a 30yo who starts dating a 45yo my main concern for them is mainly practical: how will medical stuff go, what about how their ages might affect stuff related to parenting, etc etc. 18 and 33, the concerns are about emotional matters. \n\nIf I were you, I'd also try to figure out why, at eighteen, I even wanted a 33yo. For me, at eighteen, I also wanted that. It was because I'd never really been parented, and older people provided some sense of what a loving parent might be like. For you it might have been something different. But you **need** to figure out whatever it was. Don't just read and learn about romantic relationships; also reflect on what you craved back then, what your parents were like, and whatever your childhood denied you that you were looking for in your husband. If you don't consider those things it will come back to bite you in the ass. Again.\n\nI am so happy for you, and I wish you all the best.",
            "Yeah age differences that big stifle growth because usually the younger person is subconsciously with the older person for support. Whether that is finance, emotional or codependency type of thing, so the younger person doesn’t grow to their full potential. Happy you are finding yourself!",
            "There’s such a difference in your new post. You sound like you’re flourishing wonderfully now instead of being stifled and stuck in that grey socialist dead relationship.",
            "Good for you. You did what was best for you and that's what's important. Enjoy your new life : )~!",
            "Idk why you were/are getting hate for this, you were obviously unhappy in that relationship. You didn't just decide on a whim that you were done, you'd been contemplating it for awhile and you've obviously made the right choice for yourself. And there is nothing wrong with that! Staying with someone just because is one of the most toxic things you can do for yourself imo. If you're not happy, leaving them is better than being miserable and possibly doing something you'll regret like cheating or develop resentment towards them. So, good for you OP! Go enjoy your best life.",
            "Regardless of what's right and what's wrong, the heart wants what the heart wants and nothing will change that. You went where your heart led you. There's nothing wrong with that. It'll either work out, or it won't but at least you won't regret never trying.",
            "At the end of the day the most important thing is being happy. This new relationship aside,you're already doing other things you wanted, like having friends.\n\nGood on you.",
            "I think you've made the right choice x",
            "Nice to read a happy story for once.",
            "You described EXACTLY my life right now. The only difference is we have a 2 year old together. Im 23 and he is 31. Living together for 6 years. I finally left for the exact reasons you stated and my life is going exactly like yours right now....for the most part. Its hard trying to transition to being a single mom. Im happy to made this choice for yourself",
            "This is such a heart warming story, and such a good example to young women in the same situation of how to look after yourself. Thankyou for updating, and i wish you all the best in your new found life :)",
            "the only problem I have with your story is that you start this new relationship with emotional affair. I agree you should leave your ex, but you should be alone for a while and figuring things out, not jumping another relationship with another man especially a dude whom you had emotional affair with and played a lil bit part of you leaving your ex.\n\nbut hey, look at the bright side, if someday your new man fall in love with another woman while still with you and leaving you cause of it, at least you can't complain. you know falling in love with a human while you still have a relationship with another human is much much fun, the thrills.\n\nyour ex is no saint, but you're no victim in this story.",
            "When you are in the middle of a sh*t storm, even a piss storm seems better. Take your time with this new guy.....be sure you haven't been so blinded by misery that anything seems better than where you were! Take your time with this new guy.....",
            "Well done OP.\n\nMy situation was very similar to yours. I married at 19 and felt the same opprresison.\n\nWasn't until I fell for someone else that made me be honest with myself and gain the courage to leave.\n\nPeople will judge you. But Haters gon a hate no matter what.\n\nEither way. I did what you just did at 25, dated the person I fell for. 18 months later, we are going strong.\n\nAll the best",
            "Hey, people here say that you should be wary of the new relationship, so I just wanted to provide a positive example. I, too, left my husband and dived headfirst into a new relationship. I immediately felt that it was the right person: caring and supportive, someone willing to work as a team and solve problems. I remarried four months after my divorce, we have been married for two years and are currently planning a pregnancy.\n\nMy divorce helped me realize that there are too many gray areas in life. For outsiders my sudden decision to leave my husband and move on looked shitty, and there are still some people who dislike me for it, but for me it was the best option, because even though we had no visible issues in our marriage, there were few positive moments either. I knew that if I stayed, I would be unhappy.\n\nThe pangs of guilt will go away with time, trust me. When your ex-husband moves on, you will discover that this decision was beneficial for both of you. Everything well be ok. It just takes time.\n\nDo whatever makes you happy!",
            "[removed]",
            "As someone who’s the same age and having a lot in my life hold me back, this makes me feel really good that I’m not the only one thinking it’s not too late to catch up on what we missed in our 20s. I hope that you not only learn to enjoy life, but enjoy being on your own too. Being alone/single/not totally tied down is so freeing. It’s nice to date, but don’t be in a rush to get into something serious either. Take your time and enjoy life, darling! Much luck to you",
            "Anyone else feel like she is making a mistake and she's just really high from the honeymoon period of a crush?\n\nall relationships dwindle down... you just gotta fight to keep the spark alive.",
            "I love my gf any tips to keep her happy its been 4 years dont wanna go down this path. also congrats",
            "[removed]",
            "[removed]",
            "The man is in his 40s, leaving him is completely your choice. He is clearly older and would understand what you feel. Why the hell couldn't you leave earlier? The guy is almost old as my dad. You killed him inside, he won't show that desperation now. It will all turn to shit for him when you step out of that house.\nThe reasons you specified about him too, From that perspective it just means you left him cause he's a little introverted and cause he's not a \"performer\" and the funny thing is you stayed for 12 years eventhough you knew. So what I'm saying is, when this man is almost fed up cause he's alone, maybe he'll do something to himself and maybe he'll never find happiness again.\nIf you're always happy in this new relationship maybe it's the right one for you but after some time don't you dare interfere with this guy, cause you have no right. To me this is just sad. But I can't judge.",
            "I really like the fact that you took a stand and moved on it, sounds to me like your going through a mid life crisis and I wish you the best in dealing with that but just remember that we all make choices but in the end those choices make us ,and I'm sure it's hard to leave him so good luck"
        ]
    },
    {
        "post_id": "3rmnu1",
        "author": "None",
        "title": "[Update] My family was robbed and we know who did it. How do I comfort my family and confront the robber?",
        "url": "https://www.reddit.com/r/relationships/comments/3rmnu1/update_my_family_was_robbed_and_we_know_who_did/",
        "score": 2166,
        "num_comments": 220,
        "created_utc": 1446732213.0,
        "selftext": "This is an update to my original post, found here:\nhttps://www.reddit.com/r/relationships/comments/3r3lu6/my_family_was_robbed_and_we_know_who_did_it_how/\n\nThank you /relationships for your advice. It actually helped me emotionally, and lead to catching the perpetrator! And yeah, confronting them would have been an idiotic idea (we found knives and they have gang connections, read OP) so thank you guys getting that idea out of my head.\n\n\n\nSo a few people advised I look at pawn shops and trading sites. I took the advice and set up notifications for every post in to the local Facebook trading pages. When through hundreds...but then I saw my stuff! It was just a bag and a few dresses. I logged on to my boyfriend's Facebook account and removed my family from his friends list so the thief doesn't connect him back to us. I sent the person (she used a fake profile) a message and started a conversation about the bag, pretending I was interested. Mum called the police and they turn up to our house as I still talking to the suspect. Once I knew I had her, I asked for the address. Boom. It was the house we had suspected. The police move in immediately. It was kind of exciting! I had set up a sting, thanks to you guys!\n\n\n\nWe get updated later that day that they retrieved some of our stuff from three different houses?!? Turns out there were at least 5 people who had come through our house, which is absolutely terrifying. But that does explain how they managed to wipe so much stuff. There is one adult going to court, and the girl is getting referred to a youth justice Family Group Conference.\n\n\nThey didn't have our more valuable items any more. So the TVs, bike, and a chandelier (they even took the lightbulb). I am still keeping an eye out but we are most likely going to have to replace them, which means saving up a couple thousand dollars just because some people decided to be cunts. Ugh. We can seek financial reparation but the officer said these people are of a low socio-economic status so it could just be $10 a week. Bye, Christmas travel.\n\n\n\nThank you guys so much for your support. I will update if anything else happens but I think this is the end. I am still angry and hurt, but I'm starting to accept what has happened. I've cleaned up most the mess they left and the house is feeling like home again. I feel closure.\n\n\n\n\n\n  \n   \n**tl;dr**: Got 'em.",
        "permalink": "/r/relationships/comments/3rmnu1/update_my_family_was_robbed_and_we_know_who_did/",
        "comments": [
            "Jeez what a mess. Cool police people though to help you out and not just blow you off. Congrats on helping them find the thieves!",
            "It's still amazing to me that a 9 year old has friends that know exactly what questions to ask if they are planning to rob a house ",
            "Good update!\n\nDo you have homeowner's insurance to cover the things which were not retrieved? Because that should certainly cover at least some of the loss.",
            ">We can seek financial reparation but the officer said these people are of a low socio-economic status so it could just be $10 a week. \n\nfuck it, make these shitheads pay you back for the rest of their lives, and ramp up the payments if they ever make something of themselves",
            "This is some Justice Porn if I've ever seen it\n\nSorry about this shitty situation OP, glad it worked out somewhat :) ",
            "Do you have renter's insurance? Or if you're not renting, do you have homeowner's insurance? This might be covered in that case.",
            "Those are some pretty dumb criminals.  Glad it mostly worked out for you.",
            "Home owners insurance or renters insurance?",
            "got for the reparation. leave them destitute, they deserve it. ",
            "Your sister is never going to hear the end of this one. ",
            "I don't think being of low socioeconomic status is a good enough reason for these people not to have consequences.  Even if it's only $10 a week.",
            "Steals shit, gets caught, doesn't have to pay it back? what a horrible system",
            "I am glad that noone, not even you pets were harmed. I hope your insurance pays you back for a portion of your lost items. You might want to consider installing security cameras JIC they decide to mess with you/your property now that they have been found out.\n\n\nAs for the stuff. You should take your time in replacing things like the chandelier. You can go to garage sales/estate sales and get some amazing items for cheap. My brother's in laws bought an amazing chandelier for $10. It had looked crappy when they bought it, but with a bit of varnishing it really did become a really nice looking chandelier.",
            "The feeling of talking to them and the police coming to your house was probably such a good feeling. One of those jump up and down flailing your arms like \"fuck you I got you\" feelings. Good job op.",
            "You should probably get insurance....",
            "I'd still take that 10 bucks a week, fuck them. ",
            "Do you have contents insurance? If I was robbed then within a couple weeks I'd receive a check for like $20,000 to replace my stuff. It costs me like $18 a month. Do you have anything like that? \n",
            "You're lucky you recovered some of the stuff.\n\nGirlfriend and I were travelling in a city and had our vehicle broken into and thousands of dollars of stuff stolen and the vehicle damaged (it was my parents)\n\nHad to replace a lot of it on credit which started my credit issue and repair the van on credit as well (going through insurance would have saved minimal money and fucked up my parents monthly).\n\nCops basically just said \"Yeah, your stuff is gone.\" and never got back to us again.\n\nWe were just relieved they left my girlfriends sentimental stuff when they stole her backpack.",
            "> We can seek financial reparation but the officer said these people are of a low socio-economic status so it could just be $10 a week.\n\nGet it. That's a weekly reminder for those douche bags that they got caught, that their actions have consequences. ",
            "Good update but don't you have insurance that covers the stuff in your house?",
            "They even took your lightbulb?!? That's some Grinch shit.",
            "a little late now. Get home owners or renters insurance. It will replace stolen things like this. Be sure to take pics of the items and give them a good list of all your valuables.\n\nIt won't help in this situation but going forward.\n\nAlso justice feels good! good for you.",
            "Call insurance company. If you lost thousands as you say you're deductible is most likely cheaper than buying the new items out right. My home owners insurance covers my house and the items inside of it",
            "Make them pay the $10/mo.",
            "> We can seek financial reparation but the officer said these people are of a low socio-economic status so it could just be $10 a week.\n\nI'd look them in the eye in court, and say, \"I hope I'm a financial drain on you until you *die*.\"",
            "I am dying to ask, did they recover the money they got for selling the items?\n\nI'm happy I came here to read that the assholes were caught, and you were able to get majority of your stuff back. I'm hoping as well that you can recover what you've yet to find. Hopefully with all the post/notifications you've put out someone will let you know if they come across it.   \nWith this in mind though, be careful about obtaining items from people that could possibly be associated with them. If they have a wide range (I'm assuming they do) of people as shitty as they are then I wouldn't trust that they would retaliate for them being caught. I wouldn't heavily worry about this. It's just a thought.\n\nCongrats on successful \"investigation\".",
            "I wonder if you can report the 14yo to cfys and get them removed from their family as they are being trained as a \"scout\". I might sound harsh but these people need to be rooted out of society and all they do is get paid to root by the state. ",
            "Isn't it unsafe in the first place to give a nine year old access to a house by herself? ",
            "Family Group Conference? Are you a kiwi per chance? ",
            "Time to get a tibetan mastiff!",
            "I mean I know there are a lot of crimes that are disgusting, but robbing someone, just to get a couple hundred bucks to continue your sad life...instead of just you know WORKING and achieving something on your own, living a good life...I just don't know. I mean I can understand it when it's about millions of dollars, robbing a bank? Sure, I can get behind that, but robbing a few TVs and some jewellery? It's hardly even worth the risk in my opinion. You could get killed, bitten, beaten or just end up in jail...and for what? For a few hundred bucks (despite the stuff being worth more you're hardly getting the full value out of most stolen goods)...it just speaks volumes about how low-life some people are. Not to mention the psychological trauma of having your home invaded...and possibly getting hurt or killed over nothing.",
            "I don't understand. Didn't you have property insurance? Why would they not cut you a check for everything that was stolen and unrecovered?",
            "Take the 10$ a week and just put it away somewhere. Either way if they don't pay it they get in trouble and go back to jail. It's the point that these people will pay you back and be in trouble for years after this court proceedings are finished.",
            "Homeowners insurance?",
            "Doesn't homeowners/renters insurance cover theft reimbursement? Do you not have this, OP??",
            "My coworker said if someone tried to rob him he'd beat their ass and rob them you could try that",
            "No renters or homeowners insurance? Pretty sure they should cover your items if you have that ",
            "I don't know what the laws are in New Zealand surrounding home owner's  insurance, but it might be a good idea to get it (if you don't already have it) to protect your home.",
            "Not sure how it works in New Zealand but do you guys have any renters or homeowners insurance? You could file a claim.",
            "You're my hero today.",
            "Hire an attorney. ",
            "Just curious, how old was your sister's friend who kept asking those suspicious questions?",
            "do you have insurance?",
            "I would still go after them financially.  $10/week is still $520/year.  At the very least they're being forced to be accountable.  Press charges to the full extent of the law.",
            "Hey, from NZ as well. This is such an unlikely thing to happen in our country! Really sorry that you had to experience it, glad that our justice system worked for a change.\n\nWhere about in NZ did this occur out of interest. Going to throw it out there, might be wrong, but South Auckland?",
            "Nice work!",
            "kids alone wouldn't be that thorough, there had to be adults involved, at the very least coordinating them on what to do and take. no way a bunch of 9 yr olds are that savvy.",
            "Do your parents have homeowners or renters insurance? You may be able to replace the things still missing and only have to pay the deductible.",
            "Seek financial reparation! I was burglarized a few years ago and the police handled all of it. The guy apparently went to court and out of no where i started receiving restitution checks that continued for about 2 years until all was repaid (about 7 grand)",
            "In general, when confronting a burglar a rookie mistake is to get some sort of massive hand cannon.\n\nA big gun is intimidating, but one of those massive .22 target pistols can look scary and they're really quiet.",
            "Do you not have insurance?",
            "Our cottage was robbed a few years back, few boxes of cigars in particular were taken, as well as a toy helicopter, DVDs, more. Called police, they took statement, little more. Next day, see a group of teenage boys in my neighbours yard flying a toy helicopter, all smoking cigars. So, call police, let them know, no police show up. Next day, I walk over to neighbours house, tell them I know it was them, get most of my stuff back, have the son charged (he pleads out), sue the parents for the value of the unreturned stuff, they settle & pay up. I finally take out a no- trespass order on the lot of them. Yup, cigars.",
            "I'm really glad you're feeling better about this horrible situation and now got hurt. \n\nIt's just a suggestion, but you mentioned that you have dogs - have you considered getting a guard dog? I have a slightly elderly German Shepard, who is secretly really soft - but she will bark aggressively at anyone she thinks might be an intruder. They're great guard dogs, and wonderful friends, and it sounds as though you're a dog person yourself. \n\nJust a thought. ",
            "Nice update and wish the two of you a nice fresh start as siblings. ",
            "Do you have homeowner's or renter's insurance? Some policies will cover loss as related to theft or break-ins. You would pay your deductible and then get a separate check from the insurance company to replace the missing items. You just need a copy of your police report and, if you have them, photographs which include the missing items, or (even better) serial/part numbers or receipts for their purchase. ",
            "[deleted]",
            "Insurance?",
            "[deleted]"
        ]
    },
    {
        "post_id": "52egok",
        "author": "idkwhattodo449",
        "title": "[UPDATE] My (26M) girlfriend (27F) thinks she has body dysmorphia... she's just overweight. I don't know what to do.",
        "url": "https://www.reddit.com/r/relationships/comments/52egok/update_my_26m_girlfriend_27f_thinks_she_has_body/",
        "score": 2160,
        "num_comments": 54,
        "created_utc": 1473688943.0,
        "selftext": "Original post: https://www.reddit.com/r/relationships/comments/51gpbb/my_26m_girlfriend_27f_thinks_she_has_body/\n\n------------------------------------------------------------------\n\nFirst of all, thanks to everyone who gave their opinions and advice. I really didn't expect my post to get much attention so I appreciate all the time people put in to offering me solutions to this issue.\n\nAfter reading everything everyone said, and taking a few days to sleep on it, I finally decided to talk to Stephanie about the situation. A lot of people recommended that I straight up tell her she's overweight and she's not this thin person she thinks she is, but after really thinking about it, I felt that it wouldn't be beneficial to her mental health, no matter if she has BD or not, for me to do that. I felt it would be more appropriate for me to emphasize the parts of whatever is going on with her mental health that are negatively impacting our relationship and continue to push her to get help.\n\nSo that's what I did. I sat down with her Friday night and I told her that the issues she's struggling with mentally have become a barrier in our relationship. I explained to her that I felt that she sometimes stood behind her mental health problems as an excuse to not be a good partner, or to justify bad behavior that hurt me and our relationship. She wouldn't really acknowledge this at first but she eventually conceded that it's not fair to blame her behavior on any mental health issues and that she knows she uses it as a crutch because she gets embarrassed of the way she behaves. \n\nThen I talked to her about the BD. I explained to her that it feels to me like she is letting it define her as a person, and she lets her life revolve around it, and I don't feel that it's empowering her or helping her and I want her to get help. She told me that she feels her forum and personal research is help but I told her that this has been going on to some degree for our entire relationship and that just because she feels that she has discovered what is \"wrong\" with her doesn't mean she has fixed it. I told her that if she seriously feels that there is something wrong within her that is keeping her from being the person she wants to be, she needs to get help. \n\nNow, a lot of commenters felt that she didn't have BD (I'm still undecided) and that I needed to tell her she is just overweight. I was definitely not comfortable doing that. I don't think I am qualified to make a diagnosis and regardless of whether it is BD or it isn't, there is something wrong here and I am not capable of fixing it myself. \n\nSo anyway. I told her all of that and we both cried. She told me she feels horrible for the way she has acted at times and she knows that it's not her, and this is why she brings up the BD in fights, because she doesn't want me to feel that the person she can be when we fight is who she truly is. I told her I know she isn't that person, but that since she isn't able to control herself when she gets that upset, she needs to talk to someone who can give her coping mechanisms.\n\nWe ended up looking into our county health resources for indigent people with no healthcare (her income qualifies her as indigent) and found two potential places in the area that offer low-cost mental health services to qualifying people. Stephanie texted me this morning (I'm at work) and told me she left a message for one of the facilities and she scheduled an intake appointment at another one of the facilities. The intake is free and then they discuss cost, payment plans, etc. when they make their \"treatment plan\". This suggestion from a commenter really saved our relationship, so thank you so much to everyone who suggested it.\n\nI feel like a huge weight has been lifted off my shoulders. I feel horrible that I came across in my post that there was nothing good about Stephanie or that I didn't respect or love her - I love her tremendously, and she is a great person who struggles with mental health issues, as many of us have in our lives. I believe she is committed to making a change, and I guess at the end of the day, whether or not she has BD isn't the biggest issue here, and making my post made me realize that. The biggest issue is that something is unwell with her mentally and she needs the proper treatment to feel better, and in turn be a better partner.\n\nTL;DR We had a long talk and Stephanie agreed to get help. She made an appointment this morning for an intake appointment with a county resource for low-income people with no healthcare, and is going to pursue treatment. ",
        "permalink": "/r/relationships/comments/52egok/update_my_26m_girlfriend_27f_thinks_she_has_body/",
        "comments": [
            "Honestly..a lot of people would have taken the hurtful or blunt route to this because of how frustrating she was for you and it would make things a lot more messier.. The way you handled this was really kind and it show's how supportive you are. Great job :)",
            "You are a wonderful and supportive partner, she is very lucky to have someone who loves her as much as you do, I wish you both luck on this journey! Keep us updated please! \n\n",
            "Slam dunk, dude. Relationshipping at its finest. It's rare that I see an update containing this much finesse. There are a thousand ways this conversation could have gone *very* wrong. Seriously...well done. Best of luck to you both.",
            "I hope you stick around this sub to offer advice to others facing tough conversations, because you handled that like a fucking champ.\n\nEdit: I tend to leave out words",
            "I think that went as well as it possibly could have. You handled that with a lot of grace and understanding. Wish you both the best of luck. ",
            "God damn OP, you are one hell of a partner. I think very few people would've handled it as well as you did. ",
            "Dude, I don't want to date you, but I would like to have you in my life just to break any kind of not so great news to me. And I'm only about 45% joking. ",
            ">I explained to her that I felt that she sometimes stood behind her mental health problems as an excuse to not be a good partner, or to justify bad behavior that hurt me and our relationship.\n\nWell said, OP!",
            "Thanks for being a loving and supportive partner! She's going to need a good support system to get better, as long as she continues treatment and puts her effort into getting better you'll be a better team. Don't be afraid to be apart of her treatment and hopefully she allows that. ",
            "Halfway through this post I was not expecting a good outcome, I am happy I was wrong :) I have an extremely low tolerance for people who blame everything wrong with their lives on imaginary problems and what not; this post made me think that some may be using it to deal with deeper problems, and that sometimes one should think twice before saying something.\n\n",
            "As someone with mental health issues myself, you've handled this like a champ. You're a great partner and it sounds like you have a mature relationship and a great girl (who just needs a bit of help!)",
            "I admire you doing the more mature and compassionate thing. ",
            "This is a really healthy way of handling a bad situation. I hope that everything works out and that this post gets attention. You did really good. I hope that your girlfriend is able to commit and get the help she needs.",
            "You're amazing.  I hope you do get a breather and that this is a turning point for her. \n\nBe sure to contact her doctor with specific concerns. S/he can't discuss her with you but they can listen.  You could even write or email.  ",
            "I'm so happy you talked about this to her in a respectful way, and that it seems like she's really taking steps to improve the situation. I agree with you that just telling her she's overweight would never have done anything other than hurt her to no productive end, and that neither you nor anyone here is qualified to determine whether or not she has BD or an eating disorder.\n\nGood luck to both of you in the future!",
            "Glad to hear this good update. Let us know how the treatment goes.",
            "You've handled this with great sense and sensitivity. Wishing you both the best. ",
            "What a lovely update-- you approached this with so much wisdom and compassion.",
            "Hey, well done. It's great to see a compassionate and supportive partner on this sub!!",
            "She is incredibly lucky to have such a caring and loving partner. Great update!",
            "You sound like a great guy and I don't think you could have handled the situation better. Bravo. ",
            "Wow, did you ever handle that brilliantly! So, *so* well done.",
            "You did the right thing.\n\n>She told me that she feels her forum and personal research is help\n\nIt's not help, it's positive reinforcement. She needs help from someone impartial. That's definitely the right thing for her.",
            "This is a truly great outcome - as a fat woman, I was cringing at the thought of you blatantly saying 'you don't have BD, you're just overweight', and I think realising that sort of diagnosis is above your pay grade and supporting her with getting help was the best solution, both for her mental health and the health of your relationship. Well done!",
            "Awesome.\n\nGood for both of you OP. What a great partner you are. I'm glad she's seeking treatment. \nThis is great to hear. \n",
            "Well done! You're a great BF.",
            "You are a saint. I'm proud of the way you handled this (and I don't even know you!) she is lucky to have you. ",
            "Good job! You handled this super well. You were totally right to not bluntly assert your opinion on her health status: that really should be handled by a doctor.\n\nI'm very happy this has ended with her seeking professional help. It's always good to be familiar with your local health care options and feel comfortable using them. ",
            "She suffers from food addiction more than 'mental health problems that make her behave like an asshole'. Hiding wrappers in the car is like an alcoholic hiding bottles in the toilet cistern. Total addict behaviour. \n\nI hope it all works out for you but she obviously isn't enjoying being obese (markering out her clothing sizes) and both her mental and physical health would improve if she lost the weight. /r/loseit will have some moral support for her if you ever feel ready to bring it up. ",
            "Please make sure that she actually goes through with treatment and doesn't just say that she's going to \"pursue\" or \"look into\" it.",
            ">she doesn't want me to feel that the person she can be when we fight is who she truly is. I told her I know she isn't that person\n\nYes it is. If she got upset and beat you would it be ok because that's \"not who she really is\"? People are multifaceted, all of their actions are part of who they are.",
            "Think about if you ever have kids? what happens if you want to start a family some day and she ends up dying of weight related issues when your children are still toddlers. You need to get her to lose weight or leave her. Its not healthy and she will die from it. Do you want to be apart of that?",
            "Congratulations on communicating! Also your last post you didn't need to out right say you love her, you care so much about her you were seeking help from strangers! That shows so much how you love and care for her. \n\nGood luck going forward! It won't be easy but it will be rewarding in the end. ",
            "That's awesome. You sound like a real good dude, and it sounds like she's hurting, but will get the help she needs, thanks to YOU. A lot of people would have let it slide or just left, but whatever happens for you two, know that you've really changed her life for the better. ",
            "[deleted]"
        ]
    }
]