[
    {
        "post_id": "3zsrw5",
        "author": "redcarpedblues",
        "title": "[UPDATE] Me [34M] with my wife [32F] of five years. I know she's cheating on me, I can't bring myself to confront her.",
        "url": "https://www.reddit.com/r/relationships/comments/3zsrw5/update_me_34m_with_my_wife_32f_of_five_years_i/",
        "score": 2139,
        "num_comments": 239,
        "created_utc": 1452126248.0,
        "selftext": "Original here: https://www.reddit.com/r/relationships/comments/3zh4m2/me_34m_with_my_wife_32f_of_five_years_i_know_shes/\n\nSo, lots to tell. First off, however, a few things. Before I wrote this, I didn't know what a \"red pill\" was. Now I do. I kind of wish I didn't, but a few dozen messages kind of made that happen. You know those \"debt solution\" letters you get when you're known to the county to owe money? That's how those things came in, fast and furious. Some others assumed that my throwaway having the word \"red\" in it meant that I was a sockpuppet for them. I am not. I don't think they've got a solution that isn't worse than the problem it pretends to fix.\n\nWell, what happened? I left the house that evening for a walk (she wasn't home) and called around for lawyers. It was pretty late already and I got a lot of voice mail, but one picked up. She asked me to get mt financial statements and a lot of other things together and see her the next morning. I then decided to confront my wife that evening. \n\nThat didn't happen. She came home very late and disappeared to take a bath almost right away. I snuck into her office and took her phone out from her purse. It had a fingerprint scanner, but her PIN was the same as she uses for the garage and our safe which she set up, so that was easy. There was nothing on the phone that I could find, pictures in Apple Photos and Google Photos were all from things we'd done together and some for her job. No messages or so, either. Just as I wanted to put the phone back, her bag buzzed. She has another phone! That one is an Android and had a pattern, so I couldn't log in. But on the screen was a message, phone number only, no name, with a \"<3\" on it.\n\nPut that back. Decided to postpone confrontation until after lawyer, but took a photo of the message.\n\nNext morning I talked to the lawyer and she spent about half an hour to just go over possible outcomes and what I can expect next, then another 45 minutes talking about finances and so. We don't have kids and she's the big earner, so I stand to either be just out of the relationship or be out and owed some money. It'll be months, maybe even more than a year, until all this is dealt with. Takes five minutes to marry, a year to unmarry, it seems.\n\nI'd walked by my work and told boss and I was sick. I look like shit, from not sleeping and some crying, so that was pretty convincing. We work in food, being sick is a bad idea at that job. Went home and unplugged the Apple TV and took it to a friend who runs a small computer store. He confirmed what you'd told me, the pictures on the screen saver are from her Apple Photos. He's also the first I told and he immediately offered me to stay at his place with his wife and kids if I had to leave for a while. Then he called the number the text on my wife's other phone came from and told me a guy named \"Rob\" had answered it.\n\nWalked home and texted her if she'd be home for dinner. She texted back, that she'd have to do some \"extra work\" and it could be late, so I told her to please make an exception and come home, I had important news. We'd been looking for a house for a while, I figured she'd think I finally found one. \n\nWell, dinner came and went, and she didn't show. She came home around 10, smelling of cigarettes. She was all happy and asked me what I wanted to talk about, so I asked her to sit down. I'm 99% to making something up about a house and avoid the confrontation, but then, I guess for the first time, I felt a little anger. So I told her.\n\nI said \"I know you've been cheating for a while, now. I've been working with an attorney and we'll have to talk about these things at some point, so now is as bad a time for that as ever.\"\n\nShe didn't blow up and deny it. She just... deflated and started to shake. A lot of your PMs, my attorney, and my friend, all told me not to press for details, and not put that on me as well. But I really wanted to know, so I said \"tell me about Rob.\" She told me they'd met through Ann (the friend on the couch with her) and Ann wanted to have sex with him while he had a crush on my wife, so they hatched this threesome plan. That was ... 14 months ago. Apparently they've since included Rob's wife (that's the mysterious fourth person who took the pictures) who is \"polyamorous\" with that Rob guy. \n\nThe picture thing was solved, too. She'd handed the wife her phone to take a few pictures and didn't remember the whole screen blanker thing. When she was at work, she'd uploaded them and deleted them from the phone. By then, by chance, I'd seen them. She had the second phone for precisely the reasons I thought, as one that isn't on our shared contract where I couldn't see the incoming and outgoing calls in my statement.\n\nShe also had short affairs with other women and a few men, and a most of her \"weekend work things\" were actually her and Rob going on short trips together. Through all this, it felt like she was giving me as much detail as she could in an effort to hurt me, and it worked but I think I kept a pretty good poker face.\n\nI told her that I would leave the house, that I had photographed and cataloged everything and was hoping for an amicable separation. She simply declined, told me she'd leave and take a hotel for the time being, and put her keys on the table. She packed a few things and left. That was it. As this one guy /u/jluster says, it was like the dentist, it hurt less than I thought it would but still hurt damn much.\n\nToday I have about 15 missed calls from her and 150+ messages, all asking me for forgiveness and if we could make it work again. I agreed to meet her next week, but only to divide our possessions. As far as I am concerned, this is over. Except for my one friend no one knows, yet, and I want to wait with making it public knowledge while I sort my stuff here and decide how I go from here. Might actually be hitting the gym, no intentions for a rebound relationship, and the rest we'll see.\n\n---\n\n**TL;DR**: Confronted wife, she admits to cheating, rest is in the hands of my attorney. I'm broken but I'll get better.",
        "permalink": "/r/relationships/comments/3zsrw5/update_me_34m_with_my_wife_32f_of_five_years_i/",
        "comments": [
            "Hey, I'm sorry. This crap hurts no matter who you are. I hope you all the best. Remember to talk to your friends and explain that you guys are getting a divorce. Tell them as much or as little as you want to, but build a support network for yourself. You may not feel that you need it now, but one day reality will hit and it will hurt bad. It's always good to have that one friend you know will pick up at 2 am and just listen. \n\n<internet hugs> It will get better. You will find someone one day who will blow your ex out of the water and make you wonder why you spent so much time with someone who couldn't make you a priority. ",
            "Glad you took the step, man. And thanks for the shoutout. Now a) get tested for STD. Urgently. Then, b) get your ass in a gym, it's good for the happy hormones, and then c) send me a box of your chocolates, because reasons.",
            "Fuck dude. As shitty of a situation that you were put in, you really handled it the best anybody could.\n\nYou'll make it though this. There will be a time in your future where you'll be able to take a deep breath of fresh air and feel free from this crushing weight. And it'll be worth it.",
            "[deleted]",
            "Bet the texts and phone calls came when she tried to go to one of her paramours to stay/be with romantically, and they turned her down.",
            ">Today I have about 15 missed calls from her and 150+ messages, all asking me for forgiveness and if we could make it work again. I agreed to meet her next week, \n\nohgoddammit no...\n\n>but only to divide our possessions. As far as I am concerned, this is over. \n\n\nPhew!  Good man.  \n\nAs lightweight as internet compliments are, I'm rooting for you, man.  No matter how bad it looks, you've got the difficult part(s) behind you and the rest will just happen as long as you keep at it. You will live a better, happier life putting her behind you.",
            "[removed]",
            "I've been looking for your update. While your situation is horrible, you must feel so empowered that you stood up for yourself. You are in control of what happens now.  Be good to yourself and know you are the priority right now. ",
            "> We work in food\n\nYOU WORK IN CHOCOLATE. Don't shortsell it by saying \"food.\" lol.\n\nSounds like your wife knows she fucked up and feels bad about it but... don't give in. She clearly didn't feel bad about it when she was having sex with all those people. Good on you for standing up for yourself and doing what you had to. May you emotionally recover swiftly and your next relationship be excellent.",
            "\"I have about 15 missed calls from her and 150+ messages, all asking me for forgiveness and if we could make it work again.\"\n\nGod knows why she wants to make it work. She's screwed around *so* much that it seems she'd just be happier being single for the rest of her life. Either that or she loves the drama of sneaking around.",
            "[deleted]",
            "Follow exactly everything your lawyer says, do not do anything until you consult your lawyer, go get std tested, and for the love of god do not take that woman back!!!",
            "I was so sad reading your post the other day. Sorry this happened OP but you deserve someone better. Good luck with everything :)",
            "Fucking Rob is just sitting there basking in light of god. ",
            "As down on yourself as you seem to be sometimes, it sounds like you have some awesome friends (especially in contrast to how shitty your wife's are), and that alone says a lot about you. Sorry to hear you're going through something so terrible, but at least now you can begin the long journey to recovery, it's all uphill from here, in both senses.",
            "Good luck dude",
            "50 bucks says that when she left, she went to Rob's house\n\nOP...The only reason she is so remorseful now is that she knows her shitty ways are about to be public knowledge and she can't handle that.  She's been exploring her sexuality outside the confines of her marriage and she knows that in all likelihood, that when this gets out, her reputation will be beyond repair...or at the very least, she will have to deal with a lot of embarrassment and shame that she is not prepared to deal with.  Fucking around with so many different people while being married...well not many people look favorably on that, no matter if you are a man or a woman\n\nSo...I say make her a deal in the divorce.  You'll keep your mouth shut if she agrees to give you everything you want and makes the divorce as quick and painless as possible.  Then move on with your life and don't look back",
            "> Today I have about 15 missed calls from her and 150+ messages, all asking me for forgiveness and if we could make it work again.\n\nRemember that she carried on an affair for *14 months*. That's 14 months of lies, deceit, sneaking around to fuck a married man and his wife behind your back and potentially exposing you to STD's. \n\nShe's not remorseful that she cheated, just that she got caught. She's afraid of losing her comfort, and will do/say anything to get you to stay. Divorce this horrible person and don't look back.",
            "Off topic, but pattern based passwords are easy to crack. Just hold the phone at an angle to a light source an you can see the smudge of the pattern.  You only have to detrimine the starting point and ending point which is usually a 50/50 ",
            "My heart goes out to you Man. So, so, so, so much. I was with someone like this and had not only a similar dynamic but also a similar breakup. PLEASE, don't be me. Please be strong. Please tell yourself over and over and over and over again that it is over, she is over, that life is gone, over and over and over and over until you believe it. There is nothing she can offer right now but false hope and more pain. This road is long and can be made much longer and harder if you fall back on wishful thinking, like I did.\n\nBest of luck buddy. I am so sorry again.",
            "Nicely handled. I think you've done as well as anyone could under the circumstances. I hope that things get better for you soon.",
            ">Some others assumed that my throwaway having the word \"red\" in it meant that I was a sockpuppet for them. I am not. I don't think they've got a solution that isn't worse than the problem it pretends to fix.\n\nCongrats OP, you're not a garbage human being! The fact that you're didn't fall for their shit even in the situation you are in right now speaks (positive) volumes about your character.",
            "woof. what a rough night, day, and week you've had. So sorry you are going through this. if you are in NH, i'll buy yah a beer!",
            "You should consider telling Rob. He may honestly think you were ok with it, if he really is poly and by any chance responsible. Maybe not, but it's a thought. ",
            "[deleted]",
            "You're awesome. You did a better than great job at this. You not reacting hostilely or defeatedely really hit the mark. Gave her no ammo whatsoever. All the guilt and shame now squarely falls on her shoulders. Stay strong. You'll come out of this splendidly. ",
            ">all asking me for forgiveness \n\n\"Please forgive me for being caught, I didn't realise you'd leave over this otherwise I'd have been more careful\"\n\nThat kind of asking?",
            "That sucks.\n\nTell all of your friends right now. That will make it more real for you, and help you avoid getting back together.",
            "You've heard it before but I'll say it again. Get tested.",
            "I'm polyamorous. What your wife and her pals engaged in wasn't polyamory; it was assholery. They were wrong. A fancy word doesn't mean they were right. Polyamory that isn't shitty requires respect and honesty all around.\n\nJust have to make that clear, since nobody should ever be able to use polyamory as an excuse for being a jerk. \n\nI'm sorry you're going through this.",
            "I'm sorry you're going through such a terrible time. For the record, she was a terrible spouse to you and I can't imagine any way to salvage a relationship that had *multiple* incidents of cheating. You did the right thing in pulling the plug on that zombie relationship so quickly.\n\nGood luck in healing in the future.",
            "You're doing great by keeping cool, parekoy. And hit the gym simply because sweating ia good for you. I work out when I'm stresed or pissed and it does wonders for me. And eat chocolate too! Hahaha. But really, after this hurdle you'd get your life back in line and probably gonna be better then ever! [internet bro fist]\n\nIgnore those damned messages, it's like watching Salo and being disgusted- you don't want to watch it again. Ever. Don't watch it.",
            "You really will get better.\n\nYou're incredibly brave, you've got this.",
            "I understand you feel terrible, but you've taken all the right steps and I must honestly say, it makes my laugh my ass off that someone can ask for \"forgiveness\" after 14 months of that bullshit.",
            ">I don't think they've got a solution that isn't worse than the problem it pretends to fix.\n\nI felt this was stated so well it deserved calling out. No advice; you seem to have your head screwed on well even in the most trying of times, and I respect that. Your future is brighter than you know.",
            "Proud of you, dude. What you are going through absolutely fucking sucks but you are handling it the right way. Do not take her back under any circumstances. She chose to hurt and betray you for over a year, and went as far as getting a fake phone to keep her affair going. That isn't the kind of person worth giving a second chance to. Gl man.",
            "Good for you man! I am glad you made a decision to confront your fucking waste of a wife. Your original post made me soo mad and I didn't want to comment on it at all for fear of what I was going to say.\n\nPlease stay strong brother and keep things civil.",
            "OP, I'm really happy you actually are taking cake of yourself. You are so incredibly mature and brave. I really hope you update us in 6 months when your world is a little calmer and you find your happiness. You  deserve peace after all this crap. \n\nRemember to save all the crazy messages and miss calls to give to your lawyer. Be safe and don't be afraid to talk to you friends when your ready. Good Luck. ",
            "You handled this well.\n\nYou have a chance to heal and recover, and you'll be happier down the road.  ",
            "Man Op I'm sorry to hear, but I feel like you need to know this. She isn't sorry for sleeping with another guy, she's sorry she got caught. Don't get caught up in her lies. ",
            "Your post hit a deep chord with me. Found my girlfriend of 6 years cheating on me. I'm so sorry dude. Some people are just shitty and weak and its not fucking fair that you get to suffer the consequences for their ineptitudes as reasonable human beings. Time heals all wounds and it will get better. ",
            "Haha she wants forgiveness and to work it out? She's only sorry because she got caught.",
            "Today I broke up with my girlfriend so obviously feeling like crap but after reading that OP confronted his wife, was strong during doing it and in the end came out  his head held high, idk why that made me feel somewhat better and I like\" YES!!!! WAY TO GO,MY MAN!!!!\"",
            "\"Can we make it work again\" \n\nCheaterspeak for: \"I make all the money and he's going to take me to the cleaners\"\n\nTake her to the cleaners.  She deserves it.",
            "ATTA BOY!! \n\nHandled that like a champ!\n\nI am so happy to seem someone on this subreddit really take the advice given to them and apply it. \n\nCongratulations on that front and I am truly sorry this entire ordeal has happened to you, but if you haven't noticed already, you are a stronger person. \n\nBest of luck. ",
            "I'm so, so sorry to hear that.",
            "You did well friend. You kept your cool and got what you needed to across.\n\nIf you're looking for something to respond to her about forgiveness and making it work, I'd throw out something like this, \"how do you expect to 'make it work'? You don't respect me and the guilt only set in once I confronted you. You've slept with several people while I've been here, loving and respecting you. I deserve better than that.\"\n\nGranted saying something along those lines may add fuel to the fire, but in my experience it was really helpful to make the woman who cheated on me actually think about me and how I felt because of her actions. She's still not thinking about you, or how you feel. \n\nBest of luck to you. I was in your position almost 2 years ago now. I've lost 35 pounds, have a few dating prospects, and have done things I never would have imagined I could do while married. Keep your head up and your feet moving.",
            "Good to see that you've got a good lawyer. Spare no expense on legal defense, she's going to be the type who takes the offensive once she can't get you back. \n\nTry to find people in real life who will help you see the objective reality of the situation in case you get weak. We are good, real life friends who will tell you how it is are invaluable during a time like this. \n\nIn the future, it's best to handle things directly. Always remember that your time is limited, and you should not waste it. Not on jobs you hate, not on friends who are never there for you, and not on SOs who do not treat you as you treat them.\n\nI might be the odd one out here, but I do think that if your partner doesn't try their best to sexually fulfill you and vice versa, it's not a worthwhile relationship. It's 2016, if your SO says she doesn't do blowjobs or a guy is unwilling to dive, and it's something the other partner wants, and there's no hygiene issues... that's a red flag. Sex is important and if a woman has a bunch of reasons for why she \"doesn't do\" X or Y when she can tell it really turns you on.. it's a bad sign. No different than if I was unwilling to try going down on my GF because \"real men don't do that\" or whatever. \n\n",
            "Get yourself tested for everything. She was also a human petri dish.",
            "Take her for every red cent you can when it comes to possessions. Alimony. And send me a box of chocolates.",
            "Polyamory is a relationship wrecker.\nHope life gets better, the only way is up now!",
            "Hugs, man. Stay strong. ",
            "I know it sounds a little cheesy and maybe meaningless for you, but it's really impressive how you seem to be handling things. I know internally you're probably a mess, but a lot of people in your situation would be screaming for blood, and nobody would really blame you for that either.\n\nEven though I know little of you, you sound like a good dude that deserves to have someone that is as devoted to you as you can be to them. I hope you keep that in mind.",
            ">Today I have about 15 missed calls from her and 150+ messages, all asking me for forgiveness and if we could make it work again.\n\nThis is because when she called and told Rob everything he probably shut her down telling her that he's ok with the polyamorous relationship and won't ever be monogamous with her down the road.  She enjoyed the comfort of returning to someone monogamously while being able to mess around... now that she doesn't have anyone to fall back on she's freaking out!  Stick to your guns... her regrets aren't genuine.",
            "This hurts man, but it's good that you didn't leave the house. No reason for you to leave. ",
            "Sorry man.  About the only thing you can say about this situations is the kind of person your wife turned out to be is the kind of person who isn't worth very much in the long run.  \n\nAnyway who would treat a person they say they love the way she treated you is garbage.  It's just best to throw it way.  You don't have kids and you are 34 so you have a long life ahead of you.  \n\nReally it's suck to say but her kind of love is basically worthless.  ",
            "Godd for you, man. Keep following the advice of the top rated comments on your two threads. ",
            "proud of you OP, congrats on your new beginnings",
            "What a horrible situation. Make sure you tell some one on her side of the family if this continues. She seems to have lost it. \n\n\nDon't be surprised if she also becomes spiteful. \n\n\n",
            "You deserve better. ",
            "I'm sorry too. I am glad that you stood up for yourself and that it seems like it will work out. I'll be following here for updates. Good luck!",
            "For a guy who does not like confrontation, you handled this like a champion. DO NOT let her worm her way into your life again and make sure the meeting is in a public place, if she is the breadwinner you may even come out with a bit of cash to start your new life.",
            "What a shitty way to find out. I'm sorry OP but at least you found out before you had a house and kids. Whatever you do don't go back either. A person like her always thinks what she was doing at the time is sexy and exciting running around like that. About now or soon she will be getting hit with the harsh reality that it was exciting because it was done in secret and it was new. She will realize that finding a good guy isn't the easiest thing in the world to do and will come running back. Good luck ",
            "Well, you have a long, hard road. Best of luck.",
            "good on you man, never be a doormat. have backbone taky your losses and keep moving forward. im sorry for all the hurt.",
            "New year new start aye?       \nMove on to better people who will treat you as you deserve",
            "You handled this in the best, most adult way possible. I know it doesn't mean much from a stranger but I'm proud of you man. Here's hoping for a fair and amicable divorce, so you can get on with your life. ",
            "Personally I would cross post this to the relationships forum. I've also heard it can be very bad to leave your house during a divorce to stay somewhere but I'm not sure why, or if it applies here.",
            "Sorry to hear man, hope you can get past it, best of luck. As shitty as it feels to lose a person you loved, you have to remind yourself that since they did this, that person was gone a long time ago, and likely never existed in the first place. You handled it like a champ, kudos, seriously, a lot of people could not keep the cool head you did. Tears are normal, long lonely nights will be too, but you made the best move.",
            "It's all fun and games till you need to explain to people why your relationship broke down and you're a divorcee.\n\nNot surprised she is desperate to try to fix it.\n\nMove on, OP!",
            "That hurt my insides just reading this... I've been cheated on too. I've never been married but I shared a place with this girl who betrayed me. Things are going to get better as time allows them to. Its so important to keep your mind occupied and stay away from things that bring back the discontent of a broken marriage. I wish you the best of luck. ",
            "I'm slightly tearing up about how awesome you are and how well you're handling it. In your first post you seemed really scared about what would happen, but in the way you write and what words you choose it seems you're doing much better than I (and you?) expected.\n\nYay, you're awesome and are going to be fine! :D",
            "> Except for my one friend no one knows, yet, and I want to wait with making it public knowledge while I sort my stuff here and decide how I go from here.\n\nDon't wait for too long. Hiding her shitty behaviour will only harm you and benefit her.",
            "I'm so freaking happy for you, man! specially when i read \"no rebound\" relationships, and the gym part...YES! it helps, a lot! ",
            "I'm so so sorry. It's utter shite. I can't even begin to think what you'd be going through. But I'll be thinking of you all day and sending positives vibes. This could be the beginning to the best part of your life. \n",
            "Sorry for your loss. I mean your life.  \n\nNow it's time to heal yourself. I advice you to go to therapy.\n",
            "Sorry, but she sounds like the kind of person who would say that she will feed your dog while you are on vacation, but you come home and there is poop everywhere and your dog hasn't been fed in a couple of days. Or the kind of person that if she had kids would tell them that she PROMISES to come to their sporting event, but never shows because she's going to a different game to see her best friend's kid play. \n\nJust reading about her makes me feel icky.",
            "Dude, GOOD FOR YOU for sticking to your guns. I don't think you need to hear this, but just in case - don't take her back!!! Your trust will NEVER be the same.\n\nWith that said, I know it hurts now, but I think with some time you will start to feel relief, and even happiness, over the decision. No more wife who you can't trust, no more unhappy marriage, no more feeling gutted that she cheated on you. She's behind you now and it only goes up from here, my friend.\n\nDO NOT CONTACT HER anymore. Do any conversing solely through your attorneys. Have a 3rd party, like your friend, present when you divide your possessions (just in case). \n\nGood luck. You will be just fine. This too shall pass.",
            "The way that you handled this makes me smile op!  I received a text that i wasnt supposed to get last year from my now ex wife. After 14 years of marriage i can attest that it absolutely gets better!!   Please believe me!",
            "stay strong buddy.. similar situation with a friend of mine.. wife got a second job in a factory.. turns out she was just using that as an excuse to meet up with a few dudes/girls to bang.  none of the dudes knew about each other and none of the girls knew she was straight.  they had separate bank accounts and she was using credit to \"supplement\" her \"new income\".  He left her and was broken for a little while but he got better. ",
            "Way to stay strong, brother. The idea that she thinks it could ever work again after systematically lying and cheating on you not just one time with one person, but with scores of people for well over a year, is just mind boggling. No one could engage in the kind of behavior she did and say that they loved the person they were doing that to.",
            "This will probably get buried but please also make sure to get tested for STD's, if she's been sleeping with all of these people she might have caught something and passed that along to you.",
            "It sounds so anticlimactic.  no yelling, breaking things.. just like you said-- the air got let out of the balloon, you're both exhausted, and can start repairing things now.   ",
            "It makes me really angry that Rob and his wife are polyamorous. Polyamory is meant to be all about being open and honest with all parties involved. How they justified being with someone who was actively cheating is completely beyond me. It goes against every philosophy polyamory is based on. ",
            "Good for you :)",
            "**Takes five minutes to marry, a year to unmarry, it seems.**\n\nHow true this is.",
            "Sorry man. There's hope for a future. \n\nI need this top reading this sub. My wife is returning to the workforce later this year (as a paramedic) and it's starting to  jade me against it. But...I can't control her. It's all her decision. \n\nYour wife is the one that made the choice to leave your marriage 14 months ago. You just made it official. \n\nSuccess to you in the future. ",
            "So sorry this has happened to you,  but as you said at the end you'll pick yourself up and be a better person for it. ",
            "The one thing I don't get about people is how they will do anything sexually when cheating but a blow job is off limits with your own spouse?   How does one even tell themselves that is OK?",
            "I've read a lot of these. And for some reason, I really hurt for you. I wish we lived near each other (I don't even know where you live) so I could ask you to go get drinks! Ha!\n\nGood for you man. You're doing it right and you're being strong!",
            "Good for you, sir. You'll heal in time.",
            "I'm sorry I know no matter what your head says your heart hurts for her.  It will get better and you can definitely do better.  If you need someone to talk to I'm a stranger with an ear.",
            "I'm probably too late to the party, but OP as someone who has been where you are before, never take them back.  \nMy wife cheated on me while I was deployed, once I returned home she wanted to try and make it work, and begged forgiveness. Against my better judgement I gave it another shot. Six months later she was knocked up with another mans child. Not to mention I spent all six of those months completely unable to trust her and always worrying and jealous. It's just not worth it my friend. \n\nStay strong, once you are done with all this, you will barely remember it. Promise friend.",
            "Hey man, for what it's worth, I'm really proud on how you're handling this! If I were to end up in a situation like this, I hope I can handle it like you did.\n\nFeel like shit, you will. But keep your head up, clear skies ahead. :)",
            "Good job bro. You guys were simply not compatible, you seem like a great guy that can be compatible with almost anyone, she liked a lot of things of you but went elsewhere to get what other things.\n\nHitting the gym is great but don't feel obligated to change yourself because this girl \"wasn't satisfied\". Not everyone is made for everyone and best leave it at that, you'll find a better match down the road and maybe she will too.",
            "I'm so sorry you're going through this. Please go to a doctor and get tested for STDs, and during the financial proceedings do see if alimony is an option. If she has been the primary breadwinner and you her support, then it is certainly your due.",
            "sorry to hear bro. its tough. hope you make it to the gym and make insane sweat puddles!\n",
            "Damn man. Sorry to hear but you are most definitely better off without her. Several affairs, not even just one? Things would never work back out. Focus on yourself and do things to make you happy. It's ok to grieve for a bit but the worst thing you can do is sit at home and ponder about this. Know that it wasn't your fault and you're better without her. Good luck and keep strong",
            "Forgiveness, wtf.  She has cheated on you for years and with multiple people.  That is something that is impossible to forgive because she doesn't even seem to feel guilty about it.  She has no respect or love for you she just doesn't want her life and emotional tampon to go away.",
            "I can't imagine being so steady while my wife said all of those things. You deserve a man of the year award for that alone. \n\nI'm sorry you're going through this, it's isn't easy and it will be a difficult road, but it will be worth it. You sound like you have your head on straight. Keep your chin up. You got this OP. ",
            "That really sucks. Hopefully she doesn't get half of yours in court.",
            "Thanks for the post and I hope everythings work out for you, In my opinion you handled this situation amazingly. Best of luck OP",
            "My gut hurts for you, man.  You got a good head on you.",
            "> Today I have about 15 missed calls from her and 150+ messages, all asking me for forgiveness and if we could make it work again\n\nThat's just her trying to find a way to feel better about herself. She has zero interest in fixing anything but needs you to be a bit madder or a bit firmer, maybe even say something nasty to her,  so she can become the victim.",
            "I highly advise hitting up the gym or extending your walks. Exercise is a great tool to destress and this is fucking stressful. Very sorry about everything that happened, but hopeful for your future. You sound like a good egg.",
            "Damn i feel distraught from just reading that; hang in there buddy",
            "Stay strong man.",
            "The great thing is that statistically speaking, if you want to be in another relationship, you will be. She may be the one who ends up single. \nIf I were you, in addition to hitting the gym and hiring a lawyer, I'd find your way to a good therapist or counsellor because you want to be in the best psychological and emotional health you can be when you start dating again. It's all too easy to think that she was \"the One\" or that this happened because she was \"Out of your league\" and you'll never find someone better. You're half way there already with your descriptions of yourself and of her. The truth is, those things are false perceptions. You're a successful guy in your 30s, who is willing to share the financial and domestic responsibilities with his partner. You are also a loyal and honest partner. In short, you're a commodity in short supply. The only thing that will interfere with your rosy future is lingering bitterness, distrust and injured self-esteem. Do you for a while and do it with the help of your friends and a few professionals - then look out world!\n",
            "That was painful to read.\n\nGood luck OP - you sound like a good guy and there's plenty of women out there looking for that! \n\nChin up through the divorce, you'll make it!",
            "> As far as I am concerned, this is over\n\nBest decision ever dude. Cheaters never change... she disrespected you.",
            "I'd try to get her to blow me if I were you.",
            "That sucks OP, hope you can get over this quickly! ",
            "Good for you, OP. You showed great courage and resolve in keeping your cool and standing up for yourself. Best wishes on finding happiness on the other side of this.",
            "Given the number of partners she's had, you really need to get tested.",
            "Usually I'm very apprehensive about reading cheating wife experiences but this one ended up quite well. I wish for you the best. Good luck!",
            "You already lawyered up and now are hitting the gym. I'm really proud you are following the retiquette.",
            "K I L L  H E R\n\nI\n\nL\n\nL\n\n\n\nH\n\nE\n\nR",
            "[removed]",
            "wish i had a way out",
            "Not that it excuses anything, but your wife sounds like a sex addict. I'm really sorry! Ignore her and move on.",
            ">Apparently they've since included Rob's wife (that's the mysterious fourth person who took the pictures) who is \"polyamorous\" with that Rob guy. \n\nFucking shit. Polyamory is \"ETHICAL/RESPONSIBLE/CONSENSUAL non-monogamy\". You're correct when you say she is **\"**polyamorous**\"**. She's not.",
            "You're wife is a sex addict! Holy shit!",
            "This is going to be an extremely unpopular opinion... But here goes. What she did is gross and disgusting. It's damn near unforgivable. But... Is there even the slightest, remotest chance that marriage counseling could fix this? It doesn't sound like she had an emotional affair which is much harder to overcome. She broke your trust in a terrible way, but the vows we take are supposed to be sacred. If you love her as much as you claimed to, is it possible that counseling could save that love? Or is it gone forever? It's completely understandable if it is. But if you're the slightest bit unsure... It might be worth finding out. "
        ]
    },
    {
        "post_id": "yrf8ts",
        "author": "International-Low138",
        "title": "I want to call my stepmom ‘mom’",
        "url": "https://www.reddit.com/r/relationships/comments/yrf8ts/i_want_to_call_my_stepmom_mom/",
        "score": 2135,
        "num_comments": 253,
        "created_utc": 1668087527.0,
        "selftext": "Hello! This is my first post so sorry of it’s formatted weird.\n\n\nI’m (14m) and my real mom died 5 years ago. My dad (44m) married Kendra (46f) 3 years ago. Kendra has always treated me with so much love and kindness. At her and my dad’s wedding she recited vows to me that she wasn’t trying to replace my mom but to try and be a great stepmom to me.\n\n\nKendra has always called me her son and I like it. It makes me feel like I’m loved by another mom. Kendra has also been someone that I turn to when I need help. Like when I have had homework she helps me with it or when I was being bullied in school for my stutter she was the one that I turned to and she talked to my school about it.\n\n\nI love Kendra a lot and I want to start calling her mom but I don’t know how. I also kind of feel though like it would be a betrayal and disrespectful to my real mom to call Kendra mom. Does anyone have advice on what to do because I’m torn right now.\n\n\nTLDR: I want to start calling my stepmom Kendra ‘mom’ but don’t know how to.",
        "permalink": "/r/relationships/comments/yrf8ts/i_want_to_call_my_stepmom_mom/",
        "comments": [
            "OP, my mom died years ago and I never thought I would ever call another woman “mom.” But I’ve grown to love my mother in law so much and she has been so patient with me and there for me during many painful moments of my life. Your mom loved you so much and she would be happy that you have someone in your life you love enough to call “mom.” The only reason you know the gravity of the title is because of her. She taught you how to love and be loved by other people and that is a beautiful thing.",
            "I'm a mom and if I passed away, I'd feel better knowing that there is someone loving and taking care of my child. \n\nIt isn't an insult to your mom's memory. You're surrounded by love, and nothing would make your mom happier.",
            "As a stepdad, just do it.  She'll be over the moon about it.  She will probably cry tears of happiness.  Go on.",
            "Calling Kendra “mom” is not a betrayal. If anything, I believe your biological mother would be grateful and at peace to know that you have a bonus mom in your life that is looking out for you and isn’t trying to replace her, but love you and protect you, like a mother. Calling her “mom” wouldn’t change anything and doesn’t replace your mother. I’m so glad you have Kendra❤️",
            "About 2 years ago we had a scare where we thought I was going to die, leaving my 2 kids with their dad. We had a very similar conversation. Luckily it turned out to be a mix up but here's what I recorded to have played to my kids when they were old enough.\n\n\"If dad remarries a lovely person who treats you well and as their own, you do not give me and my feelings a second thought. I'm not there to feel them, I'm just so happy you're safe and happy. If that means you call her mum go for it. As long as you're happy and safe I will always be happy no matter what. Just never forget that I love you too.\"\n\nI can guarantee your mum would have said the same if she could. It's not a betrayal in the slightest. Love Kendra with all your heart my friend x",
            "It’s probably the best thing you could ever give her and your birth mom would be happy that you have someone who cares for you the way Kendra does.",
            "It’s okay to call her mom. \n\nI’ll tell you a short story. \nMy two children doesn’t have their father in their life. It was just me raising them. One day I met a man who I fell in love with. One day my kids started calling him dad. It was okay, we didn’t mind. We are glad the children feels happy and encouraged and call someone in their life dad. ☺️❤️",
            "You can do it by simply saying, \"I love you, Mom\".",
            "[deleted]",
            "I say to talk to her about it. Maybe try a card or a note to express it fully.",
            "As a mum, if I were to pass away I would want nothing more than for my daughter to have a new mother figure in her life who she feels is her mum so I don’t think this is a betrayal at all. I think your mum will rest in peace knowing you are loved and cared for. \n\nIf it were me, I’d try and slide it in there, “hey here’s your dinner” “thanks mum”\n\nWhat a difficult thing you have been through, sending lots of love and best wishes to you",
            "I wouldn't consider that a betrayal to your mother. I truely belive your mom would find happiness and comfort knowing a wonderful person is in your life. \n\nI know you may be nervous, but speak with your dad in private. Ask him if its okay for you to do so. I'm sure he will say yes. Then, standing next to your dad, you ask Kendra if you can call her mom. \n\nI'm pretty sure she will shed a few tears. Be ready for a big hug, cause I see it coming. \n\nBest of luck to you.\n\nGive us an update!",
            "Maybe talk to her about it. I think you know deep down your mum will always be your mum, and there's no disrespect in you acknowledging another person as your mum. Choosing to call Kendra mum is a privilege in itself, and if she's as caring and loving as you believe she is, she'll hopefully live up to the name in honor of her relationship with you, and in honor of your mum. Otherwise shoot your shot, call her mum one day, and see how it feels",
            "Honestly, hearing this makes me happy! I am about to become a stepmom and I have told my fiancé his son doesn't have to call me mom or stepmom if he doesn't want to. I would be very honored if I were Kendra! That is so sweet 😭",
            "Oh my gosh, what a lovely young person you are. Your post brought tears to my eyes.  Children who are adopted have a 'tummy mummy' and adopted mum. Children with lesbian parents have 2 mums. Don't think of it as a betrayal. You are so fortunate to have a stepmother you love and have a lovely bond with and she is  the luckiest woman in the world to have the privilege of co parenting you.",
            "You aren't betraying your real mum... I imagine she be proud of how grown up you are.. I (30F) think you should ask your step mum if it's ok if you call her \"mum\". Honesty is always the best.\n\nIf you don't ask you don't get..worst thing you can get is  no. \n\nIf you feel like you can't say the words..write it in words or speak to your dad.",
            "I’m sure she will be thrilled!  Maybe just ask her? “Hey Kendra, would it be okay if I called you Mom?”",
            "Just start calling her mom. The first time you do look at her. I'm willing to bet you see her eyes tear up. You love her and see her as a mom. She sees you as a son and when you reward her by calling her mom and showing her how much she means to you, you're bond will get even stronger.",
            "You have 2 real moms. Moms are primary care providers that love you.",
            "No one mentioned the dad in their advice...\nI'd talk to dad and see how he feels.",
            "I have a son just a year older than you. If something happens to me, would LOVE it if he eventually felt so secure and loved by another parental figure, he wanted to call her mom. That’s exactly what should happen, sweetheart. \n\nWe moms want you to be safe, happy, confident and loved. The more, the better. \n\nWhen you feel the time is right for you, you can simply ask Kendra if it’s okay with her if you call her Mom. She’ll say yes.",
            "Finding someone to look up to like that, to give that piece of your heart to after its been lost... It's a difficult thing to do. Honestly, I'd drop it in conversation with your dad around and enjoy the reactions before explaining why I said it.\nTLDR: Just say it, THEN explain yourself",
            "This  is easy: listen to your heart ❤️ \n\nYour birth mother  loved you. I am a mom and I  can think of nothing that would  give me more peace than knowing my child was loved.\n\nIf you are worried about asking,  maybe you could write her a note.\n\nMy bet? She will cry with joy.",
            "I love this, if you want to then do it. I'm sure your mom would be so glad that she treats you like a son and loves you. Or at least I know if I left too soon, I would be very thankful someone was a mom when I couldn't be there.",
            "Maybe if you called your mom “mom” you could call Kendra “Mum” or “Ma”",
            "I was in the same boat more or less, I was just 5-6 years old tho. Talk with her, the same thing you wrote here, talk  with her.",
            " I got chills, man just go for it. This is not betrayal at all. Just be ready for tears ❤️",
            "Hi, honey. I'm so glad you have such a wonderful stepmom, she sounds like she cares about you a lot. I think it wouldn't be weird at all if you tell her you want to call her \"mom\". On the contrary: I think it will make both of you really happy.\n\nI truly think your mother would be okay with this. I think that if she could see you now, she would feel very proud of you and really happy that you have someone in you life as Kendra. You will never replace her, your heart just has enough love for both of them. Good luck, OP :)",
            "I would ask to sit down with her and your dad.  Tell her your thoughts and concerns but what you would like to do and why.\n\nYour bio mom will always be your mom too.  That will never change but you have obviously established a similar relationship with your step mom.  There is no disrespect but including you dad in the conversation will be helpful.",
            "She would probably love it if you called her mom. It shows her that you appreciate her so much that she has become your mom (even though she's your step mum). If you want to call her that, it's super cool. Nothing to feel bad about. Take care boss man.",
            "I don’t have any bonus kids, but my bonus grandkids call me Mimi and I love it. If she calls you her son, it’s a sign she’s probably secretly dreaming of the day you call her “Mom.” If calling her “Mom” feels like a betrayal, you could always use a different form, like “Mama.”\n\nEdited for punctuation and to say “Mum” is really cool",
            "It's that easy, just say \"mom\"- You could also talk about that topic with her, after all you even said yourself  \"Kendra has also been someone that I turn to when I need help\"",
            "What a touching post! I wish you would show this post to her, I’m sure she would be so touched and moved.",
            "I’m so glad you and your dad had someone like Kendra come into your lives. What a wonderful thing that she has made you feel safe and loved enough that you want to call her mom. I’m sure your mom would be so happy that you get to have a mother in your life still. \n\nYou can ask her if she would be okay with you calling her mom- I imagine she’ll be very happy.",
            "Your mom would be so happy :)",
            "Your mother would be happy that you've found someone to take care of you the way she would if she were still here\nMy father passed when I was a baby. My mum met my stapled when I was 10 and it took me a few years but now I just call him my dad",
            "Not going to reiterate everything here already stated but I agree with the majority here.\nIt's not disrespectful by any means and it's amazing you have someone you feel that way about. Here's an idea!\n\nMaybe writing in a thank you card for her. \nWrite about all the things you admire about her as a motherly figure to you. Acknowledge you know it's not an easy situation to come into and you respect her for treating you like her own child. Then finish with something like \"thanks for everything you do for me, you're an amazing mom.\" Love, \"your name\" Heck maybe even write on the envelope \"Mom\"\nAnd start referring to her as mom or bonus mom. 💜 goodluck!",
            "THAT IS SUCH A BEAUTIFUL THING!!!! \n\nWords just can't express how beautiful I think that is. \n\nIf I had a stepson and he called me mom. I would just faint. That would be the best thing in the world. \n\nMore importantly, I'm so sorry you lost your mom. She will forever be with you. Nothing will change that. She is within your DNA and within your heart. Always. \n\n\n\nMaybe you can start by telling your stepmom that you care about her and you are thankful she is in your life. Tell her she is like a bonus mom to you. You can wait her response and then go from there with the question.",
            "As a mom myself, if my husband and I ever divorced or I passed away, I have always told my husband that I want him to find someone that treats my kids as her own. If your stepmother treats you like her own flesh and blood, and shows you the love of a mom, then call her mom (if that's what you want) I would never feel disrespected if my kids called another woman mom, as long as it wasn't forced and she showed them how much she loves them.",
            "Label her Christmas gift \"Mom\" and hand it to her personally! \n    \nObviously just an idea that popped into my head. I sometimes find it hard to express things vocally, so I might've personally done something like that to ease into it.",
            "Your mom would be sooo happy for you, as well as your stepmom. Literally nothing bad would come out of this ❤️ Go for it!",
            "It would not be a betrayal at all, I think your mom would be overjoyed that another woman has shown you so much care and love.",
            "don’t worry it’s not a betrayal if anything it’s an honor! i bet ur mom watching over u and ur father is so incredibly happy that u two have blessed with a kind hearted woman to take of u two now. maybe bring it up to kendra and ur father about how it feels natural to start calling her mom, expect lots of happy tears! feel no shame at all and best of luck!",
            "Knowing someone has taken up the baton to finish race is a comfort. I'm sure she would love to hear it. \n\nIf you feel like you want to talk to her that is always an option. She sounds like a very wonderful woman and having a convo about it, and what it means for both of you is a great idea.  I'm so glad you have someone who loves you.",
            "I don’t think your mom would feel disrespected at all. I think she loved you so much that she specifically sent your father a woman who would love you and him just as much as she did.",
            "Hi friend- calling Kendra \"mom\" does not in any way betray or take away from the relationship you shared with your biological mom. Honestly, I'm sure your mom would be happy to know that you are loved and have a great bond with Kendra. \n\nI started calling my stepmom \"mom\" around your age. I didn't know how to start and was scared to seem awkward, so I started small. I said \"thanks, mom\" when she handed me something and she smiled and said, \"you're welcome, daughter.\" \n\nBeen calling her mom ever since. <3",
            "Oh sweetheart, just start calling her Mom. She will be so happy! Your mom will also be happy, that you have someone in your corner, loving and protecting you!",
            "I'm weeping. I pray so hard that if/when something happens to me, that my kids are lucky enough to be able to call someone mom again. Just do it. Your mom in heaven would be so so happy for you. What a blessing you both have.",
            "I absolutely understand your reasoning behind wanting to call her \"mom.\". There are three major reasons I support your decision ..\n\n* Your mom didn't want you to hold people that love you unconditionally at arm's length.  She's probably so happy there is a woman there that loves you as she would; as a treasured son.  \n\n* The fact you are even second-guessing calling her mom shows that the word holds a GREAT deal of value to you and I'm sure you know in your heart Kendra is worth that honor.  \n\n* My 6-year old daughter calls my boyfriend \"dad,\" even though he's only been in our lives for a little over a year.  He treats her as if she was his very own and it was HER decision to call him dad, not coached by me at all.  That shows me this little girl knows what a dad should be and that my bf loves her as his daughter.  \n\nFollow your heart in this sense.  Kendra will love you, regardless.  ❤️",
            "Honey, I am a mom and I would feel beyond happy and grateful id my child felt that much love towards another mom if I ever came to pass. I’m sure your mom feels the same, wherever she is right now. \n\nAs for how to start, you can just do it casually, but since it looks like its a very emotional thing for both of you, why don’t you ask Kendra? Tell her you love her very much and that you would like to call her “mom”. Ask what she thinks about it. \n\nI would be bursting with joy and happiness if I were her. You seem like a great kid.",
            "OP, I’m a mom and I can tell you that nothing would make me happier than to have someone like Kendra take over my role of “mom” if anything we’re to happen to me. Your mom’s memory will not be betrayed if you called Kendra mom. Btw Kendra is lucky to have you as a kid, too.",
            "Family is not just about blood. If this woman has treated you like a son and she fills that role, she absolutely can be called \"mom\". Your bio-mother's memory is not insulted in the slightest. I can tell you have a wonderful heart and precious relationship with Kendra and I see absolutely no reason why you cannot call her mom. I am so happy you have such a loving relationship!",
            "Just call her Mom, bro. \n\nAsk her permission if you want the reassurance but from what you’ve written here, sounds like she’d be perfectly happy with it. \n\nThe thing is….you’re not betraying your mom or her memory. You’re simply making room for another mom. And I bet your mom would be delighted to no end to know that Kendra’s stepped up and taken care of you so well\n\nIf that’s what Kendra’s been to you, then that’s what she is. \n\n\nMy mother is still alive but when my dad and stepmom got married, my mom insisted that my siblings and I call my stepmom “mom” because she had fulfilled that role as a mom should’ve.",
            "This is sweet and wholesome!! Talk to Kendra about it and see what she thinks. Maybe you two and your dad can come up with a name that is different from your biological mother, but still is endearing to Kendra.\n\nI'm sure she'd really appreciate that.",
            "\nTo answer your question, I would ask your dad how he feels about that and how he thinks Kendra would think of it, and then ask Kendra if she would mind if you called her \"mom.\" I'm sure it won't be an issue, but you never know if you don't ask!",
            "Maaaaaate if she is already calling you her son then call her mum. Go to her right now, give her a big lip smack on her cheek and say love you mum. She is gonna cry. Heck you are gonna cry too but that will make her week, month and year. Dont stress it at all :)",
            "You can have more than one mom. It’s not a disrespect to your mother. I called my mother in law mom after a few years of dating her son. Even after we separated, when she calls, I call her mom.",
            "My daughter gave my husband, her stepdad, a gift certificate on Father's Day asking to call him Daddy.  He blubbered with joy.  You're a sweetheart.",
            "She can be \"mom\" to you if you want. In your mind, she'll always be \"2nd mom\" but you're shortening it to \"mom\" for brevity. :)",
            "Honey, just have a conversation with her. Tell her how you feel, and ask if it's okay. She will absolutely love it! She might want to respect your mom, and maybe the two of you can come up with a different name for her. Either way, this is so healthy for you!\n\nI have two friends whose mom's died when they were young. Both are adults, and their dads remarried a few years after the passing of their wives. \n\nBoth of these friends claim they grew up without a mom, even though they had a stepmom who loved and nurtured them. They are extremely unhealthy, mentally, because they refuse to \"disrespect\" their birth mom by acknowledging that their stepmom nurtured them. They constantly disrespect their father's choice of a new wife, and they disrespect the woman who stepped in and took care of them, when they had a choice not to. \n\nThey would both be much better off mentally if they were like you, and see the good, instead of wanting everyone to pity them because their mom died. They both have this image of their mom being the only perfect person in the world, when in fact, they have no idea what their mom might be like today, if she hadn't died when they were 8 & 9 years old. \n\nYou're doing great. Call her mom. Live a happy life. That's what your real mom would want for you.",
            "Every few days there is the exact same post on here... very odd",
            "There was a post awhile ago that sounds a lot like this, but from the perspective of the step-mom. They were considering adopting their step-son.\n\nEdit: Yeah I’ve seen multiple VERY similar stories, with only minor details changed (the most obvious detail that remains the same is the vows thing). Pretty sure these are fake.",
            "What did you call your bio-mother?  Call Kendra a different term.  There are a lot to choose from - mom, momma, ma, mum, mother.  Maybe you could call her Mama-K or something like that?  Maybe the word for mother in a different language if there’s any ethnic association - Mutter, Madre, Mam, Mami, Nuna, Ima.  \n\nKendra would most likely love any kind of special endearment that you come up with.  \n\nGood luck!  Please !UpdateMe about how it goes.",
            "Just do it? Why post on the internet about it??",
            "Talk to her. You can have multiple moms. Your mom is no longer in the position to provide that to you, but she'll never be replaced. Kendra is someone else, she can also be your mom but she does things in her own way. It sounds like your dad made a good choice, finding someone who isn't scared of the space your mom will continue to occupy in your life. \n\nMaybe you could make it special: get a nice card and write your request. You can probably make a lunch for you all. Perhaps see if you involve dad, add flowers. She'll appreciate you seeing her efforts.",
            "If you are comfortable with it, then talk to her about it to see how she feels about it. Tell her this is how you feel, you appreciate all that she is to you and you would like to call her that and hear what she says. There is no disrespect to your birth mom, because she was and always will be your Mom. It is okay to have 2 moms.",
            "I don't think it's a betrayal, OP. Like most are saying, it's lovely you've found another mother figure that loves you so deeply and supports you! She most certainly loves you as her own, too. \n\nHave a conversation with her and let her know that you want to start doing this. It's a lovely thing to do!",
            "Talk to her and ask her how she feels about it, but I don't think you need to worry. She sounds like someone who would be honored and humbled to be \"Mom\" to you. As for your biological mom, it's not a betrayal. Your mother would be glad that you had someone in your life that you could turn to to *such* an extent that she becomes a second mother.",
            "Just do it.  So matter of factly.. like next time she gives you something.. makes dinner.. etc.. just say \"thanks mom, love you\".. like it's an everyday occurrence. She will love it.",
            "Your mom would be so glad to know that you have someone who loves you and is taking care of you. You aren't replacing your mom, you now just have a second mom and that's okay. You'll probably make your step mom cry the first time you call her mom so don't be surprised and don't worry, it's not going to be a bad thing.",
            "Oh dear. It's not a betrayal at all. She's a good step mom and it's okay to call her mom in my opinion. She takes care of you and love you with all she's got. She by all means is your mom. She may not have given birth to you but she still loves you like you are her flesh and blood. If you are concerned, try sitting your parents down and talk to them about it. Express your feelings and it'll all work out.",
            "Mum's are basically love personified. \n\nYour mum would want you to have that love, especially in her absence. I think you should call her mum (or mom).",
            "Honestly, mention something to your dad to see his reaction first. Your mother would be very excited to know you have someone that not only isn’t trying to replace her but is stepping up to fulfill her role as a mother. My dad passed when I was very young, my mother remarried when I was 11 and at 15 I felt my bond with my stepfather had reached a point to which we were real family. I talked to my mom about it first, to more so make sure that it wouldn’t make her feel as if I had forgotten my father and was trying to replace him. It’s not so much of an offense to the step parent most of the time, as it is to the biological parent. I hope this helps you.",
            "Your Mom would want you to love and be loved. There isn't anything disrespectful about it, and you aren't replacing her.\n\nLove is not a finite resource - the more, the better.",
            "This is so beautiful",
            "She would be touched. I have been a stepmom for 20 years now and both girls call me mom ,I absolutely love it.   They know that I never wanted to replace their mom, just hope I made her  happy that I love her girls.",
            "My mom isn’t dead but my parents are divorced and both remarried. Both my step mom and my step dad have been wonderful in raising me and over the years I’ve come to call them both mom and dad while still calling my biological mom and dad the same. It’s not about replacing someone if they’ve become that figure for you!❤️",
            "As for how to start calling her that, just say it.   If you're uncomfortable with saying mom then use Ma.   Love is love.   You can love different people without taking love away from anyone.",
            "So if you want to make it special, wait til Christmas or another holiday, or maybe her birthday, and write her a heartfelt handwritten note that acknowledges all of this. Start with \"Mom, ...\"\n\nAnd it will absolutely make her day.\n\nYou can call her mom, and I think it wouldn't disrespect your biological mom. Mothers come from all areas in life, and there is always room for more than one mom in your life.",
            "Just start doing it.  Say she gets you something nice, makes dinner, helps you with homework, whatever...just be like oh, that was really sweet of you.  Thanks, Mom!  I can almost guarantee that she will start tearing up.  She's probably been hoping you would be comfortable enough with it one day, but didn't want to push the issue.",
            "I’ve had a step dad since I was 5 and I never knew my real dad. I went through a lot of angst when I was younger and only ever called him by his name. Now I’m 26 and just started calling him dad a year or so ago and he feels so much joy to hear it. And I feel proud to say it and almost silly for waiting so long. \n\nEven if it feels weird at first, just do it and watch the way her face lights up at your words. She’ll love it and feel so genuinely loved and appreciated, the way I’m sure you want her to feel judging from what you have said here. There is no betrayal, and in all honesty I’m sure your mom would be so happy that you feel genuinely loved, nurtured, and cared for in her absence.",
            "calling her mom should feel natural, i myself have called my stepmom my mother for the best part of my life i am 40 now. my biological mom still lives and wants nothing to do with me. my stepmom doesn't refer to me as her son and never has but it is out of respect for her helping my dad bring me up that i call her mom.  \n\n\nit is entirely your choice to do it. if you do and it feels natural then it is the right choice, if not then don't force yourself to continue. i'm sure she will understand.",
            "Just go for it!!.\n\nYour real mum would be glad you are happy now. To know your making good connections and growing up healthy and happy.\n\nI mean you can always call her mumma or ma or mum if you wanted to keep mom for your bio mum but it’s 100% all what you want!\n\nSo proud of you, if I became a step parent I’d be a sobbing mess if someone called me mum",
            "You could call her by a different but equally dear name, Mama or Mother or Mumz or KenMom or something like that, while still making it clear that you are grateful for her love and support and she feels like a second mother to you.",
            "You and Kendra would both love the bond you have developed. You are fortunate to have such a compassionate and caring person in your life.",
            "I've Technically had 4 grandfathers. My paternal biological grandfather passed away before I was born but had three living ones growing up due to my parental grandmother remarrying and my maternal grandparents splitting up and finding new relationships. Each one was my grandfather and I loved them and they loved me. \n\nAnd then recently I've been blessed to have my mother-in-law come into my life and I feel blessed to have two women in my life that treat me as a son and I love them both like a mother.\n\nOne thing I think has helped me is that since my wife and I are from different cultures, my mother and mother in law are called different names. So if you feel a little uneasy using \"mom\" right now, you can try to ease in with another motherly name like mama, ma, mum, etc, until \"mom\" feels right, unless it already does and then just go for it.",
            "Hey we are life experience mates.  My mom died at 9 and dad remarried right after I turned 12.  I asked my step mom if she would prefer if I called her mom instead of her first name and it made her very happy.  It is now 45 years and I still call her mom.  When I was 15 she gave birth to my little brother - who was the best man at my wedding.  It isn’t always easy, there are what ifs, and no one will ever replace your mom-mom, but it sounds like she is doing her best by you and calling her mom would be a beautiful thing you can do in return.",
            "Just want to be a voice going against the virtue signallers and tell you that if your actual mom treated you well, calling another woman \"mom\" is a betrayal.",
            "Just go for it. If you are nervous, talk to your bad about. Ask him if he'd mind talking to her, that way she can broach the topic with you versus you having to work up the courage to say something. \n\nBut that being said I think you should treat this like a band aid and just rip it off. While she's helping you, say \"thanks mom\" don't make a big deal about. Act natural and gage her reaction. I bet she'll be very happy.",
            "Your mama is no doubt smiling down and so happy to see that someone has taken on a mothering role for you and treated you so well and like her own son. She won't be hurt by it. \nI know it's awkward but ask Kendra if you can call her mom. She will be touched and will say yes happily. Then the awkward part is over and you can stop using clunky explanations for your mom figure and just call her mon ❤",
            "Do it, watch her burst into tears (of joy) then it will be a thing.\n\nNot sure you understand how hard it is to get a teen to accept you as a step parent but it will be a powerful thing",
            "I suggest call her something similar to mom. Like for my dad (stepdad) I started calling him pops and now sometimes I call him apa. Or papa in spanich.",
            "Agree with all these comments. Honor your relationship with your stepmom by calling her mom. Your mother would be so happy that you have a mother figure in your life who loves and cares for you as she would have liked to. Nothing can take away the memory of your mother. She will always always be watching over you.",
            "You could always go for the option mother or mama.",
            "I am happy for you that you find another mom that loves you and cares for you. There's nothing wrong with calling Kendra mom. I am sure your mom in heaven is happy for you too.",
            "You can have a bonus Mom. She's another mom, not replacing mom. Hopefully someday you can have a mother in law you can can love enough to call Mom, too. It's a special place in your life, but having a bonus Mom doesn't replace your birth Mom. She will always be your Mom. A friend of mine lost her mom and Dad when she was in her thirties, she has a couple she met at her church that have become her mom and Dad to this day 15 Years later.",
            "\nI think you’re a wonderful son and kid to have so much kindness in your heart. I don’t think you’re insulting your bio mom at all. My kids legit just slipped in dad instead of calling their step dad by his name. When someone asked about it they said well he’s our dad he does everything a dad does so he deserves to be called a dad. \n\nYou can either sit both of them down and let them know or just drop the mom word and surprise her. She may like it.\n\nLet us know what you decide and give us an update!! Best wishes.",
            "As a mom who loves my little one more than anything in the world: I would consider myself so lucky and grateful if something happened to me, and my child found someone who loved them as much as your step mother loves you. It's okay to love her like a mom. It's okay to consider her a mom. It's okay to let her be your mom. You will never forget your mom. She isn't replacing anything. People always seem to think your heart only has so much room in it. There's room to love them both. So let that love in and show it however you feel comfortable showing it. I think she will be thrilled to be called mom by you.",
            "My parents divorced and remarried, my stepdad and mom have been together for 15 years and just within those first few years he earned the title of father from me. He doesn’t like being called dad because he doesn’t want my bio dad to feel like he’s taking his place(bio dad doesn’t feel any type of way about it), but still when I refer to him I always call him dad to anyone outside my family circle. He refers to me as his daughter as well and everyone knows he’s as much my father as my bio dad, and my bio dad is more than happy that I have someone like my stepdad as a father figure along with him. \n\nMy advice, talk to your stepmom about it, tell her how you feel about seeing her as a mother figure and if she’d feel okay with you calling her mom or maybe something that she’d like, maybe a nickname if she doesn’t want to be called mom out of respect for your mother, I call my stepdad Billy.",
            "My greatest fear was one day leaving my children behind without a mother. If they found someone they truly loved like a mother, that would be the best thing that could ever happen. Good mothers only want what’s best for their children and having someone to call mom is the absolute best thing that could ever happen. Your mother is at peace knowing you and your dad are being loved by a wonderful woman. You’re not replacing your mom; it’s just a show of how much you love her. You’re a lucky guy!",
            "If something happened to me, I would LOVE if my child felt this way about someone who took care of him.\n\nI would not feel any betrayal. I'm so glad you have someone you feel this way about. Such a wonderful situation.",
            "your mom is happy/would be happy to know such a wonderful women cares for, and is taking care of her son. thats all a mother could ever want. i promise you that. \n\nas for how to tell her, i like to the think the two main options are:\n\nA: just casually use it when you feel ready, she’ll notice when it happens. she might be surprised but i can ensure you she will be overjoyed. \n\nB: you can make it more formal and ask her if you want to talk. then tell her you’ve been thinking about it for a while and you’ve decided you want to call her mom. you can ask her if she’s ok with that, but im pretty darn sure she already is/will be lol. \n\nim happy for you op, this is a beautiful moment and i appreciate you sharing it with us.",
            "As a Stepdad, my stepson does not call me Dad. His Dad is still around (sort of) so I understand but my world would light up if he did.\n\nSay, \"Can I just call you Mom?\"",
            "As a mom, if I passed, I'd be thrilled if my child had a stepmom they loved and wanted to call Mom.",
            "I say just go for it! Just call her mom and see how she reacts. Or you can just ask if its ok. But judging by the way she treats you, I bet she'll be overjoyed. As far as your bio mom, I'm sure she's smiling down on you guys. What loving mother wouldn't appreciate someone taking great care of their child when they're unable to? There's no betrayal here. You know who your bio mom is. You're replacing or erasing her. I'm so happy for you and your family. The world is full of stories with the opposite outcome. Also, shame on you for making me cry at work lol",
            "Just start one day, she will love it. She already seems to view you as her son and would probably be very happy. In no way does this negate your bio mom, you can have two moms, or more who knows in 2022. But if you’re unsure just ask her if you can call her mom",
            "She is “Mom v2.0” not better then v1.0, still operates at the same quality but had a visual branding update. \n\nOr make a special nick name: mums, mommers, mumsies, mo-mo(pronounced moh-moh)",
            "You can start off by just saying something simple like “Bye Mom” when you leave for school, or “Thanks Mom” the next time she hands you a snack or something. I’m sure she will be so happy, and your other mom will be so thankful that you have someone loving you as she would want.",
            "I would think your mom would be happy you found another mom to love you just as much as she would.\n\nEdit\n\nI’m happy for you",
            "Just randomly call her mom when you ask or talk about something.\n\nI'm sorry for your loss. But also glad to hear you have a loving step mom",
            "A mother is more than just DNA.\n\nMy Birth Mother is refereed to by her first name since she lost the right to be my mum. Same with my birth father but to a smaller extent. My best friends mum and dad have become Mummy T and Daddy T. I'm 30 and did this in my early 20's. My parents cant be offended since they aren't here to be offended.\n\nYour mother, rest in peace, only wanted love in your life however that presents. Do you think she would be offended your Dad found a new \"wife\"? No I think she would be overjoyed. Talk to Kendra and see what she thinks.   \n\n\nMaybe call her MumK or KMum or some other special thing (Mum in another language?)",
            "Calling her Mom isn't betrayal 🥰\n\nShe loves you just as much as your mom did and she would be so happy to know that there's a women who loves her son just as much.\n\nSit down with your dad and have a talk with him about it. Bet he would be surprised but also happy and he will probably give you an idea on how you can talk to your stepmom about it too. I bet she would really love it...\n\nYou've been so blessed to not only have been given a chance to be loved by one mom but now you have been blessed with another.",
            "Karma farmingggg.\n\nDoes anyone else realise this is a rip off of a post from last week lmao",
            "This is so sweet OP. It’s wonderful to hear that she’s been so supportive of you, and that you appreciate her and love her right back. Your post is so touching it made me tear up. Im so sorry you lost your mum but I’m so glad you have Kendra. As others have said, your mum would probably be overjoyed to know that you are so loved and protected and I doubt she’d feel that calling Kendra mom would be anything less than beautiful. I also wanted to point out that there are plenty of people with two mothers in the world, and them calling one mother mom and the other mama or something else is very common. It doesn’t mean one parent is any less than the other! Whatever the circumstances, you can absolutely have two mothers and call them whatever feels right in your heart. Wishing you nothing but more love and happiness in your future!",
            "Dude please call her mom there’s no shame or negative. It’s sweet and makes sense.",
            "You innately want to call her \"mother\".. Because that's what she's been doing..\n\nYou are young.. This world is a harsh and unforgiving place..\nYou can't imagine how scared your mother was for you.. Or the relief she would feel in knowing that another good lady is taking care of her family.\n\nIt isn't a betrayal. It's you saying that you accept her care.\nTalk to your dad about it though.. And see what happens.",
            "Your step moms actions show that she WANTS to be a stand-in mom. If she didn’t want you to feel\nThat way she would keep her distance",
            "You say \"hey can I call you mom, because your are a good parent and I want to respect that.\"",
            "OP I have a 14yr old son and if I knew I was going to pass away soon the most heartbreaking thing for me would be knowing my kids don’t have a mother to cherish them. \nMy dearest wish would be for my husband to find someone to love him and our kids and make the family whole again. I know I wouldn’t be replaced, you never forget or stop loving people when they die. \nMaybe chat to your Dad? I’m sure they will be very honoured for you to call her mom.",
            "Honey if you feel comfortable calling her mom that’s great. You’re not betraying your mother or trying to replace her. You just now have another mother figure in your life and that’s great and I’m sure your mother would want you feel that bond",
            "As a Mom I know I can never be replaced. But if I passed away and another Mom did all the work I could no longer do and took good care of my babies, I would be thrilled. I think you can just ask her if it’s okay. She loves you dearly. No one can be your OG Mom, but it sounds like this lovely woman has stepped into the role beautifully.",
            "Buddy, she is your mom. I have a dad, he is not a very good dad. I have a step dad, he is dad for me. It's not a betrayal, it's a recognition of what she has been for you from the beggining. Mother and father may be genetically inherited titles, but they mean very little if you don't Live up to them. Give her the recognition she deserves. Also, your mom would never be angry, she can't be here for you, but i'm sure she would be thrilled you got someone who can inherit her will. That is how you should see it, your mom left a torch for someone Who was worthy, well,  she is here.",
            "I’m a step parent and my step daughter wanted to call me Mom, but I felt uncomfortable with it, and we agreed she’d call me by my name. I love her like a daughter.. but it still felt like I was stealing something from her Mom… I probably wasn’t, I just felt uncomfortable.\n\nMaybe have a chat with your step mom and find out what you guys would both be comfortable with.",
            "Friend of mine married into a ready made family. He was over the moon when the little girl started calling him dad. He told me she said \"every little girl should have a dad and he was hers\".\n\nGo for it. She will be very pleased. There is no insult to you bio moms memory here.",
            "As others have said, a mothers love is unlike any love you can experience. I would imagine that your real mom would’ve wanted nothing more to see you loved and cared for as she would: with a mothers love. \n\nCall your step-mom “mom”…. Because she is one, and cherish the absolute hell out of her. Step-parents can be a mixed bag, but it sounds like you lucked into an incredible one.",
            "Call her whatever you want, just don't call late for dinner",
            "You may have started to understand this little nugget already but there are 2 types of family. Your blood family and your chosen family. Each one has the potential to transform your life in beautiful ways. Sounds like Kendra is your chosen family. That is just lovely.\n\nIf you're looking for words, maybe something like this?: \"Kendra, I love you. You are my chosen family. I would really like to call you mom from now on. Would you be comfortable with that?\"",
            "Speaking as a step mum I'd love my step son to call me mum even once (his mum is still alive but she's very much absent from his life)",
            "My stepdaughter asked if she could call me mom when she was 7. So casual too lol middle of the day in the bathtub. Her mom is in her life too, we’ve just always had primary custody. Came out of nowhere and it’s a moment I’ll cherish forever. Maybe it doesn’t have to be a big thing. When it feels right, “Kendra, is it okay if I call you mom?” will be an honor no matter how you present it. Maybe just not in the bathtub 😂",
            "If you called your biological mother mom, maybe it would be easier if you called your step mother something a little different, like Mother or Mama or something? Momma Kendra? Whatever you decide on, I’m sure she will be so happy.",
            "when I was younger I wanted to call my \"stepdad\" dad. my bio dad wasn't in my life but I felt scared that my stepdad wouldn't want it. I asked my mom if she thought he would and she said to just give it a shot. and that was the best advice honestly! maybe speak to your dad to see what he thinks but I'm sure she would love being called mom. you won't be replacing your mom at all, if anything I'm sure your mom's looking down glad somebody loves her baby the way she did.",
            "As a mom. If something happened to me and there was a woman who loved them like her own, and they wanted to call her mom, that would be just amazing. It doesn't take away from the fact I'm their mom, just means they added another one. Families come in all sorts.",
            "From a mom and a stepmom: If I were to leave now, I would be so happy if my kids found someone who loves them SO MUCH that they wanted to call her mom. My stepdaughter calls me mom and I feel so blessed that she loves me enough to honor me like that.\n\nAsk her if you feel uncomfortable with just starting to call her mom. I'd bet anything that she says yes! She sounds like a lovely woman.",
            "In terms of how to do it, I think just let it come out naturally.  \"Thank you, mom\"",
            "My dad died in 2009. My mom remarried in 2016. I love my dad (stepdad) and feel like he is my dad. I’m 31. It sounds like your step mom really loves you. Just ask her to have a conversation with you and bring it up. Rip it off like a bandaid. I am so certain she will be happy to have that conversation with you.",
            "Talk to your dad about it",
            "I like too think of \"Mom\" as more of a tittle then a name, it helps me to both see my own mom as a whole person and not just \"my mom\" and to also not feel bad about my personal habit of calling all of my friends' mom's \"mom\" too. I know for a fact that my mom was not bothered by it.",
            "This is so sweet. I would just tell your stepmom you want to talk to her and ask her if it’s okay if you start calling her mom. I guarantee she will be so touched and honored.",
            "I am the youngest of all of my siblings, and the only one who belongs to both of my parents, but that never made a difference to either me or my parents. My oldest brother, who I was very close to, died of cancer in his early 30s. In the years leading up to that, before any of us even knew, he asked my mom to be his “real” mom.\n\nMy parents have been married since he was about 5, and I when he lived with us as a teenager I distinctly remember him telling his friends that he couldn’t go out with them because his “evil stepmother” wouldn’t let him. Still, she was always calm, patient, kind, and always had time for him. He didn’t see it when he was 16, but he sure did later.\n\nI don’t think his birth mother even knew it to consider it a slight, but I also am not sure that she would’ve. Love isn’t a finite thing—we always have enough for everyone who we need it for.",
            "You call her whatever makes you and her comfortable. Your mom would be very happy that you found someone that cares and loves you as much as she did.",
            "Can't wait for the update. Kendra is going to be thrilled 💗",
            "Hey. You’re lovely. Can you call her Mum? Does that feel natural? It’s a nice title\nThat means mom but isn’t mom. Might help. Sending love.",
            "This is so sweet. Call Kendra \"mom.\" It is not a betrayal, it is an acknowledgment of the power of love, both your mother's and Kendra's. Your mother would be overjoyed that someone is there to do what she would be doing if she were still alive, and Kendra will be overjoyed that you feel so much love for her. \n\nSaying your love for people out loud is a very powerful thing. Don't keep it to yourself, it is the best part of life.",
            "This is so sweet OP. Say it when you are ready, or as someone else suggested show her this post. Your mom would be so happy to know you are loved and cared for by such a wonderful person-you are not betraying her at all",
            "If I passed away and my daughter found another person to be her mum, I would want her to be able to express that and have all the lovely emotions that go along with that without feeling any guilt. It’s not a betrayal, your mom would absolutely want you to have a mom. Please talk to Kendra about all of this, including the guilt part, it sounds like she’ll help you navigate it!",
            "Your mom would like you to have a loving mother figure in your life\n\n\nESPECIALLY if she treats you with the respect that you say.\n\nYou dont need to have a conversation about it.\n\nWhen you are leaving the house just say \"Bye mom\" and close the door.  She may need a few.minutes, and will probably be emotional.  But that is ok.  \nWhen you get back, ask her if that was ok.  And that will be enough.",
            "OP, that’s lovely. You could show this to Kendra. Your conflict is natural and understandable, but your mom wouldn’t have seen it as a betrayal ❤️ She would be relieved and glad that you and your father have been able to fill your lives again, and the idea that you now have someone who is so good to you that you want to call her something that holds such importance would be such a comfort to your mom!",
            "I’m sure your mom would want you to be happy, and would be pleased that you found someone to fill this role that her passing prevented her from. If you want to call her that I imagine it would be best to have a talk about it with your dad and mom first though.",
            "Ask her if it ok to call her mom. She will be thrilled.",
            "You sound like a kind soul. It is not betrayal and I'm sure your mom would be proud.",
            "What did you call your mom? Maybe if you called your real mom “mom” then you could call Kendra “mama” or something similar along those lines? Your story is so sweet, your mother would just be so happy that you have someone to take care of you like she wants you taken care of, I promise. ❤️",
            "The fact that your stepmom is so loving and kind, makes my heart warm!! If you guys have a certain time when you're together and relaxed, in my opinion that would be a great time to bring it up. \"Traumatic\" is too intense of a word, but it will perk their ears up. So make the enviroment relaxing and open for all of you. It may be uncomfortable because its a very vulnurabe situation for everyone. On the other hand its an important bonding moment!\n\n&#x200B;\n\nSpiritually speaking, your mom is at peace, and always with you. I have faith that she would want you to be your happiest and most free self! The feelings of guilt and betrayal are just symptoms of -kind of- a form of survivor's guilt. You got this ! Hope this helps:)",
            "I think that what you have written here is a nice way to go. \nAnd if you want to make it somewhat special, maybe get her a photo of the 2 of you framed or maybe a simple bracelet or necklace with the word Mom written on it!",
            "I'm sure your mom will be happy to know somebody else can take care of you, enough so you can call her \"mom\", she might regret she is not there anymore, but that is the best thing that can happen with current situation. I'm sure Kendra's happiness will be out of this world the moment you'll call her \"mom\", and your dad will also have a better time, knowing he found somebody to help him grow their beloved child. If it also makes you feel good, then go for it, it might sound weird at first until you get accustomed, but then it will be natural, wish you luck, and I'm sorry for the fate of your biological mother.",
            "Your late mother would have been proud of seeing the person you are today. The decisions you take with a great deal of thought and empathy and love and kindness - are ALL decisions she would have stood by 100% and would have been proud at the level of maturity and thoughtfulness shown by you. And yes, that includes calling your step-mom as \"mom\". You can have two moms in your life and they don't need to compete with each other.",
            "We currently are going through this with my 5 year old stepdaughter. Her mom is still alive. My daughter started calling me mom, sometimes, about a year ago. Her mom had a huge fit and still does to this day. My  fiance reminds his daughter that she can call me whatever she feels like. Our daughter though, has begun actively calling me mom to her classmates and teachers, etc. It's not about replacing but expanding the love in your life.\n\nCall her whatever you want. You have so much love in your life and your mom is happy in heaven to know you are so loved and respectedby Kendra. If you feel like it might be weird to start, you can call a family meeting with your dad and Kendra to announce you want to make this change but that you want to take baby steps or jump all in, get their opinion. \n\nAs a stepmother, my heart bursts each time I get called mom and it makes me so happy she decided to start calling me mom. It's been a long wait.",
            "I apologize if earlier posters have suggested this already....\n\nConsider giving her her own name, like K-mom or if she's of a distinct ethnic heritage,  the 'mom' name in that culture.  It's personal,  thoughtful, and heartfelt. \n\nOr if that's not your style,  consider it as a Christmas gift.  Make her a card asking if she'll be your Mom.  Maybe include a plaque or sign or mug or tshirt that has 'Mom' printed on it.\n\nNo matter what you decide to do, OP, you're a fantastic person for thinking of this. 💞",
            "Call her \"ma' to break the ice",
            "I promise your mom would want nothing more than to see you happy and loved (I’m a mom).  You aren’t replacing her, and you can hold her in a special part of your heart, and still have room for another mom.  \n\nDon’t stress about it, just ask Kendra if you can call her mom (or show her this post).  There’s no doubt she’ll be touched and honoured by this new title.",
            ">I also kind of feel though like it would be a betrayal and disrespectful to my real mom to call Kendra mom.\n\nI can assure you that your mum would be so so happy to know you have someone in your life who loves you this much and whom you love too. It's not a betrayal, because it doesn't mean you love her any less. It just means your heart is big enough to love both of them, and that's beautiful. \n\nAs for how to go about calling Kendra mum... approach her about it. Tell her that you see and appreciate the things she does for you and the motherly love she gives you. Let her know that you love her like a mother and ask if it is okay with her to honour her role in your life by calling her mum.",
            "You are you, and you deserve to feel exactly as you do. \n\nYour parents sound like good people, so no, I don't think they'd mind. Loving someone as a mother is definitely not a betrayal and I believe your first mom would've been happy.\n\nIf you don't know how your dad would feel about it -- ask him. If you're not comfortable with words just put what you wrote here in a letter and give it to him. I bet he'll cry happy tears.\n\nAs to how to do it -- the skys the limit depending on what you like. Just a shout \"bye mom!\" when you leave? A letter? An \"I love you mom\" in the dinner table or as you go to sleep? Adoption papers for christmas? Your call, and none of those would be wrong.",
            "Ask her to talk and say that you’d like to start calling her mom, I’m sure she’ll be very proud and happy and you can just start calling her mom from there on",
            "I'm sorry you lost your mom, buddy.\nYou're a very lucky young man to get another.\nI think you can either talk to her about it, or just go ahead and do it. \nEither way, I think she'll be thrilled- she loves you, boyo, you're her son.",
            "As a mother myself… the worst thing I can imagine is something happening to me and having to leave my son motherless. But if a stepmom (or any other mother figure) came into his life that loved him and was special enough that he wanted to call her  “mom”, I would be absolutely overjoyed (and extremely grateful for her too).",
            "I truly believe your mom would be so happy to know that someone came into your life that loves you so much and makes you feel secure and so loved that you want to call her mom.",
            "Dem ninjas cutting onions again... Call her mom son, she deserves it, and it will mean the world to her! Your biological mother would be proud that such an amazing woman cares about you.",
            "I think your mom would be extremely happy that she loves you. I don’t think your mom would want you suffering or feeling bad in anyway if you want to call your stepmom..mom. Maybe ask her if it would be ok or just say it one day, it might make her entire year. Your mom would want love for you and she would be happy that Kendra is treating you like her own. Embrace it.",
            "Oh my gosh I’m not crying you are.",
            "Just start doing it, don't make a big deal of it. She might pause, might cry, it could be a moment. Or, shell just roll with it. I doubt anything negative could come of it. If it feels right, go for it.",
            "Good kinds of tears over here reading this thread",
            "Trust me she will feel so happy and loved!! You can just tell her what you told us and say \"would you mind if i call you mon\" (just to ask it for your own peace of mind) because i am 10000% sure she will find it super sweet. Also your real mom would 1000000% want nothing more than happiness and love for you and i think she would be so happy to know someone can take care of you too and make you feel loved.",
            "Oh sweetie you should talk to her and let her know your feelings.  I’m positive she’s be honored to have you call her mom.  I myself recently became a stepmom and I love these boys like crazy!  They are older, youngest is 22 but he lives with us.  His mom has a lot of mental problems and put him thru hell.  It’s been about a year now and every now and then he calls me mom and I just tear up every time.  Your bio mom would be so happy to know you are getting a mothers love daily.",
            "Your Mom probably sent Kendra to you and your Father so call her Mom if you want to.",
            "I think if you want to call Kendra mom, it would be very well-received. There’s no reason why you can’t use that term.  My son calls both me and his stepmom mom.  I really don’t mind because he has two moms in my opinion.  Im not mad that someone loves my kid that much, and I’m sure your mom wouldn’t be either.  She would want someone like Kendra to step in.",
            "It’s not abnormal. I call my stepmom mom though that was overall handled pretty poorly by her and my dad. I’m sure that if she views you as a son then she would be thrilled for you to call her mom",
            "Hey. I am in a similar position. I don't actually have parents, so I've never had anyone to call mom and dad. But then I met my spouse and his parents are wonderful. It's his father, and his father's wife (so technically my husband's stepmom).\n\nAt mother's day, my husband and I sent the stepmom flowers and a card that was addressed to her as \"mom\". She cried. She never had children herself, so it was the first time she got called \"mom\". She was so proud that she paraded the flowers and the cards at her office!\n\nI kindly asked at a meal if I could call his dad  \"dad\", and it was a very tender moment. He told me how proud he was to have me as his daughter. It was at his birthday.\n\nIn this way, I gained a dad and a mom, when I thought I'd never have one. And Stepmom got called \"mom\" for the first time in her life.\n\nWe were in our 20s and 30s when all of this happened. So don't feel like you are too old to call her mom. we all need moms, and it's very meaningful to a parent-figure to receive the honor.\n\nSo if you really don't know how to do it, why not at mother's day? or if this is too far into the future, then maybe for Christmas or at her birthday, you address the card to her as \"mom\" and see how she reacts? It would be a nice surprise.",
            "What are you waiting for????\n\nIt’s that easy….just start calling her mom.",
            "As a stepmom with a young son who calls me mom, I want to tell you that while it’s purely your choice you definitely shouldn’t be worried about your stepmom’s reaction. My son’s mother died before he was even a year old and I met my husband and him when he was around 3, we got married when he was 6 and he asked to call me mom hours before my wedding. It really made it one of the best days of my life. I’m currently pregnant (first pregnancy) and he is my biggest supporter (my pregnancy has been extremely difficult and complicated; hypermesis gravidarum, among other things). I’ve felt some of the guilt your feeling right now, but I suppose it was inverted. However I’ve realized that his mom would be happy that he has a mother who loves him and takes care of him the way she physically can’t. I’m assuming your situation is more complex as you knew your mother much longer than my son did so I won’t pretend to understand, but I’ve offered you good advice to the best of my knowledge (i hope so lol), now it’s just up to you 😌.",
            "Simply ask if she's OK with you calling her \"mom\".  I think she will be touched and honored by your request. She must be pretty special if you feel this way. And if she's amazing enough for you to want to address her as mom, I'm sure she'll welcome it with open arms! 😊",
            "This is sweet. I am sure she would feel honored to be called mom. However, you should have a sit down with your dad and stepmom and just let them know your feelings. I am sure your real mom is glad someone is there that could be a great placeholder.",
            "It would probably make her feel so good and you're obviously keen on saying it, so sounds kosher. nothing wrong with having two moms 😊"
        ]
    },
    {
        "post_id": "92qtys",
        "author": "GlitterSchnitzel",
        "title": "I (30f) have pneumonia and my fiance (28m) is refusing to help.",
        "url": "https://www.reddit.com/r/relationships/comments/92qtys/i_30f_have_pneumonia_and_my_fiance_28m_is/",
        "score": 2137,
        "num_comments": 230,
        "created_utc": 1532823890.0,
        "selftext": "We've been together for four years. \n\nI'd like to start off by saying that this is embarrassing. It's embarrassing that I can't feed myself. The most I can do is stumble to the bathroom. I feel so useless. My kids are helping me with bare necessities, like water or crackers. But that's about as much as they can do, as they're little. \n\nYesterday I had to pick up my kids, drive to the doctor, and pick up my prescriptions. By the time I got back I was shaking and almost didn't make it up the stairs. I had asked my fiance to at least pick up my kids. He responded \"I'm not picking up your fucking kids!\"\n\nI asked him to pick me something up from the store again, and I was met with the same response.\n\nMaybe I'm being emotional. I don't know. I've never been this sick in my life. It's actually quite terrifying not being able to breathe. I just wish he would be a little more understanding, instead he just sighs, scoffs, and cusses at me. And on top of everything, I'm getting kind of scared that I'm going to waste away into nothing because I don't have the energy to get out of bed for more than a minute.\n\nTLDR - Fiance is refusing to help me with even basic care when I'm sick with pneumonia. I don't know what to do. Or even if I have a right to be upset.\n\nEdit: Thank you everyone for your comments. I just want to let you know that I am not going to marry this man! I do, however, have to get a bit healthier before I kick his ass to the curb. ",
        "permalink": "/r/relationships/comments/92qtys/i_30f_have_pneumonia_and_my_fiance_28m_is/",
        "comments": [
            "Call up parents/girlfriends and pawn your kids off for two days to recover.   Ask them to pick up a couple of quarts of chicken noodle or won ton soup at the local Chinese place (if you add some hot mustard it will help with the congestion).  Do nothing but rest for the next two days.   When you are recovered, end this useless relationship.  Frankly, I wouldn't even talk to him anymore.  Get a help chain going that doesn't include him and then get rid of his selfish ass.",
            "[deleted]",
            "Christ even my flatmates and I take better care of each other for much less than serious illnesses than this. \n\nHot lemon drinks, chicken noodle soup and a comfy blanket in front of the tv is what you need. The subs rules prevent me from saying what your ex needs. ",
            ">I had asked my fiance to at least pick up my kids. He responded \"I'm not picking up your fucking kids!\"\n\nWhy in the name of *god* is this asshole still bearing the title of \"fiance\"? Is this how he speaks to you normally? Why do you put up with that? Why do you put up with letting your kids see someone treat you like this? ",
            "DON'T MARRY THIS MAN - YOU WILL REGRET IT",
            "I had pneumonia once and I went to work for one day after a week of rest and them had to be out for two more weeks. I am amazed you can run errands. \n\nHe is a huge asshole. What is wrong with him? Do you have a friend you can ask for help picking up the kids? Just straight up be like \"my fiance is useless and I need help\" now is not the time to mince words. Also, you clearly cannot count on him to be a co-parent or a good partner in times of struggle. ",
            "My back went out and I couldn’t move. My bf of 2 years cared for me and my 3 kids as well as his own kid. He took me to er and went to the pharmacy and got my meds, set them up for me at my bedside with a water bottle, he called out for pizza and fed the kids, did the dishes and cleaned up the kitchen. That’s what a good man does.  Drop your fiancé and have some self respect. ",
            "He's showing you who he is... someone you can't rely on.",
            "You're about to marry an abusive man.",
            "I think the pneumonia is affecting you more than you think. You're calling your abusive ex your fiance.\n\nIn all seriousness I hope you get better soon. Already the great people in your life (like your kids). Dump the fiance. You deserve better.",
            ">  He responded \"I'm not picking up your fucking kids!\"\n\nUh... is this how he normally responds to things? This is a far larger issue than just not helping when you're sick.",
            "So, you know that your condition can worsen very quickly without proper care and become pleurisy right? Which means a long stay in hospital.\n\nHave you got a parent or a relative anywhere near you? I’m actually terrified for your health. As well as the health of your children.\n\nYou need to find someone who can assist you and find them now. I’m going to ignore the so called significant other you have in your home because he is not even worth my concern right now. I’m only worried about you.\n\nYou’re not being emotional. You’re very, very ill and you need help ASAP.",
            "Of course you have the right to be upset. You shouldn't even be leaving the house, let alone be running errands and getting scoffed at. \n\nHow does he usually act when you're sick or need him to do something? Is it possible that he's scared of the fact that you're quite sick and is trying to push that away? I think you need to have a serious conversation about why he's treating you like this at a time when you need him the most.",
            "[deleted]",
            "He sounds like a jerk. You are in a lot of need and he is swearing at you. Is this someone you want to marry? ",
            "Fuck that guy. I had pneumonia when I was about 20. I couldn't walk like 20meters without being exhausted and needing to sit - let alone look after kids.\nTell him Cudoxtamus said he can go smoke a chubby.",
            "My wife had Pneumonia last year, nearly took her life. She was in intensive care for 2 weeks on life support, then another week learning to breath and eat again in the hospital.\n\nI stayed with her every day and every night and gave her water with a swab on a stick and helped her with physical therapy for a month after. We nearly lost everything because of bills and lost time from working.\n\n*And I would do it over in a heartbeat.* When you love someone, their health is your health. Their comfort is your comfort. You want to give them the best life possible, even when they're miserable, you will do what you can to make sure they know you will be there for them.\n\nThis person you're describing needs to be kicked out of your goddamn life. I can't believe you would question if you have a right to be upset, you should be livid. Call your family or friends to help get you better. Don't be ashamed for someone else's failings as a basic, decent human being.",
            "Why the heck are you wanting to partner up with someone who doesn’t want to be an actual partner? ",
            "So I assume he acts like this and refuses to help when you are not sick too? It’s just that you can physically do things yourself so it’s ok?\n\nThis is not acceptable behavior. A fiancée is supposed to be a partner and contribute. Especially when a partner is unwell. Why do you want to marry this guy?",
            "**In sickness and in health.**\n\nMotherfucker ain't even married yet and he's already failing to uphold vows. \n\n",
            "This is not *even close* to being acceptable behavior, and I'm really sad for you that you somehow think it's a problem with *you* that you're upset.   Apart from being astonishingly callous toward you, it's completely unrealistic to expect to marry someone with small kids and have nothing to do with caring for them.\n\nIn the short run, is there anyone else who you can call?  A friend, coworker, someone who can bring you a big vat of chicken soup?  Failing that, delivery is your friend, if you can get out of bed long enough to answer the door.\n\nIn the long run, I think you need to have a serious think about the future.  A marriage is supposed to be for decades, decades in which you WILL have some other kind of personal emergency that requires support.  When you get married, you are literally promising to provide that kind of support.  Plus, do you really want to marry someone who thinks so little of your kids that he won't even get them at school?  This guy is showing you that he won't even do the bare minimum of caring for you.",
            "He is not someone you should marry. He is not treating you with care.",
            "Literally, not rhetorically, is wrong with your self-image and self-esteem that you’re not even sure if you’re “allowed” to be upset?\n\n“I’m not picking up your fucking kids” ????",
            "First of all he should no longer be your finance. Dump him asap. Do you have friends or family or even coworkers you could reach out to for some help? ",
            "You need to get yourself and \"your fucking kids\" out of this toxic environment as soon as you're able to. Nobody deserves to suffer like thus. ",
            "Get better first, with whatever support system you have. Then please contemplate why you’re considering giving your kids a step-parent who thinks of them as “your fucking kids”.  You sound like a loving parent, and I’m sure you’d be furious at anyone else referring to them like that because they deserve better. ",
            "Are you still planning to marry this character?  What’s he going to say instead of “in sickness and in health”?  “In health, but if you get sick, I won’t lift a finger to help you”?  \n\nTake care of yourself, get friends/family to help you, and break it off with him the moment you’re well enough.  ",
            "My roommate treated me better than your finance and I wasn’t as sick as you.... please consider how mean he would be if your kids got sick. :(. ",
            "Why do you feel like the best you deserve is a relationship in which your partner does nothing and you do everything?\n\nWhy is this kind of treatment even \\*remotely\\* okay for you? \n\nThis isn't what love is. And it sure as hell is no grounds for a healthy marriage. Please, please, don't expose your kids to this toxic POS. Ask other people for help and get out of your relationship with this guy as soon as you are physically well again. Jesus....",
            "The fact that you consider him your fiance is unbelievable.  THIS is the kind of man you want around your children?  In YOUR life?  Are you fucking kidding?",
            "My boyfriend is taking off work this week to take me to a doctor's appointment because I think I MIGHT be sick and he can see how worried and anxious I am about it, and I don't even have a diagnosis! Your fiancé is a shit partner to you (and it sounds like a shit potential stepfather as well) and you deserve someone who takes you seriously! I hope you have friends you can lean on in this trying time! If I were you, I would seriously reconsider this relationship. It's not irrational at all. This behavior is unacceptable ",
            "Is this what you think love looks like?",
            "I’m commenting late, so not sure if you’ll see this... but be thankful you did not get married yet. As a nurse I’m honestly appalled. I take care of sick people all the time and I would never dream to treat anyone that way... not to mention someone I’m supposed to be in love with. He is supposed to love you in health AND in sickness. It honestly sounds like your children are taking better care if you, time to let him go the second you feel better. ",
            "Im so very sorry that you have lost your sense of self.\n\nYou need to kick your horrid fiance to the curb and get into therapy.\n\nPlease dont continue to subject yourself or your children to such a nasty person.\n\nCall a friend or family member, tell them everything and escape this relationship. If you dont have someone to call call a womens shelter.",
            "Get healthy and get out of that relationship. ",
            "I notice that you plan to dump him.\n\nHe may be full of sweet words and promises when you do it to win you back. Do not believe them. Do not listen to his lies.",
            "I wouldn’t speak to my worst enemy the way your fiancé speaks to you.",
            "You just found out that your fiance is not on your side and does not have your back. This is what you have to look forward to for the rest of your marriage - someone who won't help you when you need help.\n\nDon't marry this asshole. You deserve a partner, not this kind of terrible treatment. And your kids deserve a parent, not 'mom's husband who doesn't like us'.",
            "\"in sickness and in health\" is not is this guy's vocabulary. Bullet dodged!",
            "Call your mom - a friend - a neighbor - anyone who can watch your kids and help take care of you. You are dangerously sick. A sane, reasonable human being will recognize that and help take care of you.\n\nAnd as soon as you’re capable of taking care of yourself again, dump this piece of shit man and never, ever look back. You deserve better.",
            "Dude, my husband took care of me and my DD after I had her even though he had a back injury. Refusing to help you is not the kind of thing someone who loves you does. Find help with the kids and tell him to never speak to you again. What a jerk.",
            "If you marry this dude, he will become your kids stepdad. Do you really want your kids to have a stepdad that doesn't support their mother when she  is sick? Sounds like he doesn't want to take on the role of being a dad. \n\nYou also deserve better for yourself. Someone who loves you would be helping you. ",
            "Omg, good people would run errands for a stranger if they were ill for goodness sake. Your ex is not part of the good people crowd. ",
            "When someone shows you who they are, believe them.\n\nPneumonia is a pretty serious illness and your fiance, someone who would be your partner in everything, can't be bothered to look after you (red flag 1), look after your kids (red flag 2), doesn't drive you to the doctor (red flag 3), doesn't make sure you have a week of food in the house in your condition (red flag 4)\n\nAnd on top of that he gives you a bad response back.\n\nSo yeah get better first, then break the engagement. This is not someone that is with you for better or worse.\n\nCan you reach out to anyone in your area to help you for a few days? Take your illness seriously. Even a neighbour might be willing to help you out given your circumstances. ",
            "I'm sorry OP see if you can find some family to babysit. Keep us updated when you get better. ",
            "A sign of things to come if you allow him to stay in your life. ",
            "You have EVERY RIGHT to be upset by this. This is actually bullshit if you ask me. \n\nI hate t when I come to reddit for advice and am met with negativity and people assuming things about my relationship because they e heard my side alone and think my relationship is doomed. So I’m not going to say anything like that to you. \n\nHowever I will say this, “are you fucking kidding me?” This man has proposed marriage to you. One of the biggest commitments a person can make to another person. It’s a proclamation of love that’s meant to last a lifetime. I’m struggling to understand how a man who claims to love you and wants to spend the rest of his life with you can be so completely cold and selfish. \n\nYou’ll be sick many more times throughout your marriage. You’ll also have a multitude of other emotional and physical distresses. It alarms me quite a bit that he doesn’t seem to care enough about your well being to help you with even the smallest needs. \n\nThe comment about your children is equally alarming. Does he realize that your children will become like his own upon marriage? Does he think they will still be “your kids” after your nuptials. \n\nI really think it’s important that you address these concerns with him. Are you prepared to deal with his attitude every time you aren’t feeling well? I’m so sorry you’re not feeling well and now you have to deal with this emotional stuff too. \n\nHe’s being incredibly unfair to you but he’ll never know you think so if you don’t say something as soon as possible. This could set the tone of his future behavior in every situation in which you need help. Set the record straight now before you’re in too deep. \n\nBest of luck!",
            "I'm sorry, he's your fiancé? Did I read that right? Because I too have a fiancé, and we've been together for 4 years as well. He is a tough man, and takes no bullshit. That being said, I was recently diagnosed with stage 3 ulcerative colitis, an absolutly horrible disease. I need a picc line, and get a nutrition bag every day. I can't get up to get ice or water. And guess who my personal nurse is? Him! \n\nIt's incredibly stressful for both of us, but he has truly stepped up, and has proven to be the MAN I thought he always was. He doesn't complain, because he sees me suffering. He loves me unconditionally, and that shows. \n\nI'm so sorry you are going through this, but YOU deserve way better. This is not a man, and not a person worthy to be called your fiancé. I'm so mad for you.",
            "Please don’t marry him. ",
            "Also If if gets worse, please go to the ER. Not meaning to scare you but my step dad died from pneumonia and my mother was a nurse. It crept up and got worse overnight. Please take care of yourself and dump your “fiancé”. He’s going to try and minimize this once you feel better. Please don’t believe whatever crap comes out of his mouth just bc you feel better and don’t want to “rock the boat.” You and your children deserve better. Hope you feel better soon and please drop us an update in a few weeks. <3",
            "As terrible as you may be feeling right now, be thankful for this moment. Especially for the timing of it. Before you got married to this person, you got a really good view into the window of their soul. You now know that this person will NOT take care of you when you need him to. ",
            "I had pneumonia at my college's geological field camp. It lasted a month, and in the time that I was unable to care for myself - random classmates that I didn't know very well helped me do basic tasks, brought me food, helped me into the shower. Random people who haven't said they wanted to be in my life forever we kinder to me than your fiance has been to you. I don't think I would be able to stay with a man like this after this. I really, really, really hope you have a friend or family member in your life who can step up for a few days or weeks, and I really, really hope you have a good take away place for soup! I hope you feel better, ASAP!",
            "He does not like or care about you, let alone love you. \nCall or text a friend or family member and let them know you desperately need help right now. Get rid of this horrible person.",
            "Ok, I've had pneumonia for 6 months while in college, and single, so my advice:\n\n1) try and get someone to take the kids, and see a doctor. The best treatment might require hospitalization, and can cut short the misery of pneumonia, or prevent it from becoming worse. Energy is going to be nonexistent, and do not push yourself, that will weaken the immune system, prolong being sick and make it easier to pick up other viruses (I had the flu while balancing 19 credit hours). Sleep will be a friend, as well as warm liquids (tea/coffee, a friend and her girlfriend always had warm cider while we studied), warm showers, and easy comforting meals to keep up strength. As for help around the house, either a relative or a good friend shouldn't have an issue pitching in. \n\n2) kick his ass curbside, he's clearly demonstrated his lack of worth as a man, along with his selfish nature that will only prove either physically, emotionally, and/or verbally abusive. I wouldn't be surprised if he's a closet narcissist also. He clearly doesn't care for your kids, picking them up is hardly a trying task, and he clearly doesn't seem to care about you. Even though I wasn't in a relationship, my friends still did what they could to help, because they're good people, and because a serious illness does require help. He is NOT deserving of the title of \"fiance\". ",
            "Very happy to hear your update, OP. I once went on a date with a guy to a concert. He ended up getting dehydrated and mentioned the next day that he wasn't feeling well. I offered to bring him food & gatorade, because that's what you do. You just gotta find someone who doesn't see basic stuff like this as a chore. It's just what you do.",
            "I would take care of a stranger more than he is taking care of you, this dude is garbage. Your children are watching and imitating you both, more importantly they are learning how love operates by observing you two. Would you want your kids future SO to treat them this way? No because they deserve better and so do you. ",
            "Does he not realise that pneumonia can be lethal? What an ass. Good luck with getting rid of him and with getting better. ",
            "Can you call friends/family?\n\nPlease focus on getting healthy first pneumonia is no joke.\n\nOnce you’ve started getting some support dump this ass. How dare he. Don’t marry someone who can’t be bothered to look after you when you are struggling to breathe. Wow, you’d be better off single ",
            "Why on earth would you marry someone who clearly does not care at all about you or your children? \n\n",
            ">Yesterday I had to pick up my kids, drive to the doctor, and pick up my prescriptions. By the time I got back I was shaking and almost didn't make it up the stairs. I had asked my fiance to at least pick up my kids. He responded \"I'm not picking up your fucking kids!\"\n\n...and he's still your fiance!! You would be 10X a fool to marry this man, OMG\n\n>I don't know what to do. Or even if I have a right to be upset.\n\nReally, you don't know? Imagine if this was happening to one of your kids if they were grown up. What would you tell them? Would you question if your child had a right to be upset?\n\nYou could DIE of pneumonia. This is a serious, serious, serious illness. You need rest and you need help. Please call someone to help with your kids. A friend, a family member, even just a neighbor you trust. And then once you know they are safe and being cared for, REST. Take care of yourself and pull through because you've got these little ones to be here for, they need you. Do not marry this man and put them in what is bound to be a deeply unhappy household with a stepfather who does not love them or want to care for them and who treats their mother poorly. If you don't care about yourself that's your right to accept mistreatment I guess but its not fair or right to put your kids through that.",
            ">He responded \"I'm not picking up your fucking kids!\"\n\nPlease don't marry a man who has no empathy for you, and seems to really dislike and resent your children. ",
            "This made me really sad to read, because I've lived this. Hoping for support and getting absolutely nothing in return is the worst. Now my current partner and I are very much there for each other in our times of need. I hope you find true support!",
            "Take ten deep breaths (slow and deep) every commercial break. You feel like you need to rest more than anything, but your lungs need to move like they’ve never moved before. I’m not saying get up and do it, you can do it sitting up in your bed. But don’t forget how crucial that is.\n\nAs for your family, your fiancé is not a compassionate partner. You are diagnosed with a severe and sometimes fatal illness and he won’t lift a finger. ",
            "> He responded \"I'm not picking up your fucking kids!\"\n\nWhy is he still your fiance and not your shitty ex? ",
            "Great advice here, OP if you go ahead and marry this man, you got only yourself to blame. He sounds like a real piece of work.",
            "Honestly if my neighbor whom I barely know had pneumonia, I would fucking pick up her kids for her and take care of her. That’s what humans do. \n\nYour fiancé is not a human. ",
            "Good god - this guy is an asshat.  Time to dump his ass.  Pneumonia is no joke - I had it a few years ago and you can barely do ANYTHING when you have it.  I hope you feel better soon and I hope you drop the dead weight, because this man is not someone to spend your life with.",
            "And why are you with anyone who would call your children \"your fucking kids\"?",
            "You need to dump this asshole asap. The way he talks to you and treats you is appaulling. Does he talk like that in front of your children? Fucking right you should be upset. Like, dump him hard, upset. He's a nasty, cruel, selfish man. Good luck. I hope you get better soon. ",
            "This is a great way of realizing this man isn’t fit for life long partnership. ",
            "Get out. This is abusive, your kids are being exposed. \n\nHe is your fiancé. He chose to create a relationship with someone with kids and that means taking on some parental responsibility. \n\nHe is despicable and you need to get him out. Family or friends can grab the kids, you care for yourself and the second you can, you tell him things are done. This is not sustainable. He is not a kind man. ",
            "Meanwhile...gather some energy and dip his toothbrush in toilet bowl!!! ",
            "Why is he still your fiancé? Do you live in his house? Does he financially support you? If not. Save yourself more heartache and politely ask him to make room for someone who actually cares about you. ",
            "He can't even make it through the \"sickness\" part before marriage, I think he proved he isn't even worth it. \n\nGet well soon my friend. ",
            "Glad to see the edit. I wouldn't go on a camping trip with a person like you've described, let alone marry them. \n\nMy husband is a good man and a good partner. If I were in your position, and I have been, he'd first tell me to go to bed and that he'd handle everything. Then he would proceed to handle everything--taking care of our kids, making meals, getting and administering meds for me. He would be kind, gracious, and thoughtful. He'd take off work if he needed.\n\nYour fiance sounds absolutely awful.",
            "Oh my God I saw your edited paragraph at the end. Thank God!!! \n\n\nMy SO and I have only been together a few months, and a few weeks ago I had a convulsive seizure, bit the hell out of my tongue and fell onto my hip; I was vomiting all night and sore. He was at work, but I texted him what happened and he immediately offered to take me to the doctors, come over my place and help me eat/take care of my dog.  I honestly was okay, and I told him I needed sleep, but I appreciate so much how helpful he was trying to be and how thoughtful he was to check in on me via text every hour later that night. Health is important, you're not bitching about a stubbed toe, so he needs to stop acting like one. \n\n",
            "You should be in the hospital. Pneumonia csn get very serious.",
            "He can't possibly be acting like this for no reason",
            "YouTube. similar happened to me and she told me to suck it up because I'm a man and shouldn't be so pathetic.  My daughter was 4 months old at the time so I drove both of us down to my parents who watched the kid for 3 days while I recovered. ",
            "You will overcome this and walk away a stronger person who has learned a valuable lesson. If someone isn’t there for the bad times, they have no place in the good ones! Everything in life happens for a reason. Feel better :) ",
            "It sounds like you’ve seen his true colours in a crisis! Sweetheart is there anyone else who could help you out while you recover? And another extra person to help pack his  bags? That man is NO good, you deserve better and I hope you will see it clearly when you feeling better. I hope you recover soon, pneumonia is no joke. ",
            "First of all, hope you get well soon. You need rest and tonnes of it.. Secondly, that guy has no business being your fiancé! ",
            "My mum had it in 2013 and it nearly killed her she spent a month in hospital, while she was in hospital and got out all she had to do was rest. I took over and paid all the bills and did the shopping, how to take my dad to work the 2 days he went, they come home and get her lunch a cup of tea or coffee, all she did was sit on the couch and rest or sleep. My dad had to help her shower, we did get someone to help when he was working I just can’t do that part. You are suppose to marry this man and take the vows of in sickness and in health and he is showing you that he does not care about you or your kids at all. He won’t be there for you at all. You should not be taking your kids to school he should be stepping up to the plate and letting you rest, this does kill people. Break up with him and find a real man",
            "When you recover you need to leave this relationship.",
            "Yeah, don't marry him. He's not taking your current illness seriously or he knows you need help but refuses. Yeah, they aren't his kids, but they are your kids and they are part of your package deal. You're not asking him to give your kid his kidney, you're asking him with basic child care now that you're ill. He's refusing. End this relationship. He will continue to let you and your kids down.",
            "If you’re not going to drop him out of selfrespect do it to protect your kids. Not just talking cancel the wedding, cancel the entire relationship. How dare he speak about your kids that way? You have not one single damn thing to lose if he’s only content when he doesn’t have to lift a finger. ",
            "I had pna last winter and it was awful. The fact that he treats you this way while you have it is insane. I don't have kids or many responsibilities and barely made it, so kudos to you so far. Good luck and drop this loser.",
            "Get friends and family to help out, see if the kids can stay with family for a few days until you're better. Ask a friend to help out with food etc.\n\nWhen you are better, kick your \"fiance\" to the curb. You deserve better than this.\n\nThe main thing is to get yourself better. I had pneumonia 2 years ago and it did not go well for me. Focus on yourself once your kids are sorted.",
            "I’m guessing there’s more abusive behaviour you may not have mentioned. Keep in mind that if you try to leave this could escalate to aggressive behaviour. Tread carefully - call a domestic violence crisis line and chat to them about risk assessment and a safety plan when leaving, just in case. ",
            "Your partner is supposed to help carry the load. Sometimes it means you take up their half, sometimes it means they take yours, but you're both pulling together. It's more than a half effort to make life easier for both of you.\n\nHe doesn't sound like he's making your life better in a significant way. Get better, call in other friends and family, and then get him gone. ",
            "I tend to not outright tell people on these types of threads what to do in their relationships... but not here. You need to end it with that piece of shit. I took damn good care of my stepson, like he was my own and even more than his dad did. Now that his mom and I are no longer together after 10 years, I still maintain a relationship with him. \n\nAnd this walking pile of excrement refuses to help you or pick up the kids???  he can be like that on his own and you'll be better off...",
            "I am sure that your fiancé is a nice person with good qualities.   You wouldn’t be planning to marry him if he wasn’t.  I’m sure that you love him very much.\n\nThe thing is, that alone is not enough to base a marriage on.   It’s not a simple “do I love him does he love me” equation.  There is a reason that one of the traditional vows is “in sickness and in health”.\n\nYou are going to have periods in your life when you are vulnerable and in need of help.   The older you get, the more frequent they will be.  Pneumonia is awful, and awkward, and debilitating.   Having it once increases your chances of getting it again.  As you get older, you’re going to have periods of time when you’re ill, or injured, or emotionally hurting - it’s the cost of not dying young.  It’s literally the human condition.\n\nWhat your fiancé is showing you now, you must expect will never change.   Refusing to pick up a bit of the load when you’re down is a major red flag in a relationship.   Please understand what it means - you are alone in caring for yourself and your children.   You don’t have to break up with him, but if you don’t you must find your peace with him never, ever being willing to put himself out for you.   That means that if you become ill, he will not care for you.   It means that if you become infirm in old age, you will be put in a nursing home instead of cared for by your husband.  It means that you will be left to face and carry the weight of the biggest challenges you will face in your life.  Your child is 16 and on the verge of being expelled for fighting?   Your problem, not shared.   You have a worrying test result and it might be cancer?  Your problem, not shared.  Your parent has died and you need to travel to the other side of the country and somehow sort out their affairs?  Your problem, not shared.  \n\nOf course, it is possible that he will prove me wrong.   What I’m saying is, don’t marry him expecting him to change for the better.   Count this as the price of admission for a relationship with this man.   Is it worth it to you?  ",
            "Leave him now.  Go to parents.",
            "Do you live near family? Near your parents? You need to take your kids and go to a family member/friend’s house whenever possible.\n\nYou need to rest and you need people around who will help you and care for you and your kids. Pneumonia is no joke and you can’t keep putting stress on yourself like you did while your recover.\n\nYou need to recover and rest like now. It’s not unheard of that people die from pneumonia. You need to rest and heal. Please. Feel better. ",
            "He sounds like an abusive jerk and if I were you I'd be calling off your wedding. Do you really want to be married to someone who can't be arsed to help you when you are obviously very ill? A real partner is supportive and will help you. This guy is trash, so throw him away.",
            "I know how scary it is when you've never been this sick before, OP, so you need to take care of yourself and focus on resting and getting better.  You need to have someone else take care of your kids - you need someone you can count on to do errands and all that needed stuff. And go to the hospital if anything gets worse-- this is no joke!  And don't marry this dude...",
            "I’m sure you know, but people can die from pneumonia. My wife had it and after only a two days of feeling bad needed to be hospitalized. This guy sounds awful, but focus on healing first. Your lungs are filled with fluid and you need to help yourself get better first. A",
            "Drop him. Throw him right out. If my partner was this ill, I would probably be fretting more than she would be. The fact you're not even sure if you should be feeling bad about this just shows how much he's done a number on you. You've got the kind of sick that's temporary - he's got the kind of sick that is just not going to go away in your marriage. ",
            "Why would you want a person like this for a partner? He is no partner. And it will be worse once you're married.\n\nIf you have family or friends, reach out for help.",
            "You need to leave this individual as soon as you are well and able. If anyone ever referred to my kids that way they would be long gone. If I needed them for financial support fuck it I’d figure it out. I did it once with their own father, it’s possible. \n\nI don’t have much advice about him not helping :( I hope you find a solution to your difficulties while your sick and that you get better very quickly. Tell your fiancé bye for me please. ",
            "I also think you should dump him. Relationship is about helping each other especially in time of need. Your fiance is big asshole. You should be home in bed and not running errands.",
            "OP, even most strangers would be nicer and more caring for you in this situation. Let that sink in. Now get some sleep and kick that asshat out when you are feeling better.",
            "Please do not marry this person. They do not love you and don't even care about you. ",
            "OP, I want you to imagine that some casual friend, say another mom whose kids attend the same school, called you up out of the blue and said “I have a horrible pneumonia and no one else to call- could you please give my kids a ride home from school today?” Would your reply to her be as rude as your fiancé’s? \n\nDon’t accept this type of treatment from someone who claims to love you, if you would be kinder than that to someone you barely know. ",
            ">\t My kids are helping me with bare necessities, like water or crackers. \n\nMaybe he can learn something from the little tykes. J/k, dump this asshole. ",
            "He’s missing the “for better or worse” part of being a partner. Done. ",
            "When will your mom get there, OP? Do you have a place near you that delivers food? Order a few soups for yourself & enough for the kids for the day. \n\nHope the meds start to kick in soon & you can get some rest. This is very serious, don’t feel badly about needing help. Everyone knows how debilitating it can be & will want to help you. Don’t waste an ounce of strength or energy thinking about him. He’s not worth it. ",
            "Pneumonia can kill you and will if you do not take care of yourself.  Get someone to look after the kids and you until you are recovered.  If you are dead, you can't do much for your kids.  Once recovered, go to therapy and stay in therapy until you are well enough emotionally to have the relationship you deserve, not the one you have.  Be glad that you are not married to this asshole, but get some help.",
            "I would do more to help someone I knew for 5 minutes then your fiancee of 4 years is doing for you. ",
            "My pushy overly religious roommate got a cold and I still came home with soups and jello and crackers and juice because of empathy. That thing that makes you feel bad for other people in pain. She moved out with other asshole roommate and I haven't talked to either since then and I am still, 15 years later, happy I did it and wish I could have done more. ",
            "Wow, what a lovely preview of his idea of the \"in sickness or in health\" vow. ",
            "Call around to friends and family members to get a schedule for baby sitting and helping you and clean. If nothing else, post an ad for temporary baby sitting and cooking.\n\nI've had pneumonia twice and without someone to help out, I would have to go to an ad or a service online.\n\nWhen you are healthy, get rid of your fiance. ",
            "Hope you recover soon! Much love to you from a stranger. Being sick can really make you absolutely miserable. Not having the support you need meanwhile can be heartbreaking. Stay strong❤",
            "Leave him. \n\nI wouldn’t treat someone I dislike that way.  I have picked up things at the store for neighbors I barely know when they were sick. Why your fiancé would snap at you while your ill, let alone not help you, is beyond me. ",
            "I had pneumonia as a teenager. My dad, who is usually very against going to the doctor, waited on me hand and foot and was constantly asking my mom if she thought I should go to the hospital. I remember how terrifying it was. I woke up several times because I couldn't breath, and several more times because my dad was checking that I was breathing. Typically when one of us kids got sick, he was uninvolved in nursing us back to health. He'd let my mom handle us when we were sick and he'd do yard work or something outside, away from the germs. But my pneumonia was so terrifying to him that he stayed by my side almost constantly. I've never seen him so nervous before or after.\n\nYour fiance ignoring such a serious illness is a massive red flag. You need to dump him. I saw the updates that your mom is coming and you plan on dumping him so good job! You can do it and fund someone who actually cares about you.",
            "You don't deserve his attitude.  When you care about someone you help them when they need it. It's abusive how he talks about your children. He needs to be kicked to the curb!",
            "What the heck? I'm really glad to see that you're breaking up with this guy! Absent any other context (like...I'm not even sure, but it would have to be a doozy to justify swearing at you when you ask him to help you because you're ill!) this is...very odd. I very much doubt this is the first and only time this guy has acted like this. \n\nCaring, loving, giving, good people (not just 'nice'. Nice is not kind. There is a difference. I could write a book on how opening the door for you is not the same as making sacrifices for you because he loves you. But I digress) don't do stuff like this. Sometimes under stress people snap things and then apologize. They don't double down and act like this is a burden.\n\nYou do have a right to be upset. ",
            "I would help out a stranger in your situation and you fiance can't be bothered, if you stay with him you deserve **everything** you and your children get.",
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]"
        ]
    },
    {
        "post_id": "36i2g0",
        "author": "throwawayyay_3914092",
        "title": "UPDATE: My (18F) mom (49F) is choosing her boyfriend (55M) over me and my siblings (14F and 11M)",
        "url": "https://www.reddit.com/r/relationships/comments/36i2g0/update_my_18f_mom_49f_is_choosing_her_boyfriend/",
        "score": 2134,
        "num_comments": 330,
        "created_utc": 1432049194.0,
        "selftext": "Original post: \nhttp://www.reddit.com/r/relationships/comments/367kvj/my_18f_mom_49f_is_choosing_her_boyfriend_55m_over/\n\nWell, on Sunday I called my dad and told him about everything that happened. He was really angry I didn't tell him right away but I get it, I would be too. Mostly though he was very concerned for all of us and wanted to kill my mom's bf. He called her for her side of the story, but when he began asking about her boyfriend's behavior she cursed him out and hung up on him.\n\nThat made her find out I told him and she barged into my room screaming that I was a liar and a little cunt (yeah she called me the c-word). She accused me of wearing slutty clothes to try to steal him (the fuck?) and of loving my dad and stepmom more than her. When I denied this she slapped my face, hard, and told me she was kicking me out. She hovered over me as I threw some clothes and important stuff into a bag and then followed me still verbally abusing me into I got into my car, saying that she'd never wanted me in the first place and that she should have aborted me. I'm hurt, but whatever, she's delusional.  I'm at my dad's now and probably will be living here for the time being, my dad and stepmom have told me I'm totally welcome. \n\nMy dad went to the house yesterday to talk to her in person about her boyfriend. He was there too and apparently the three of them got into a screaming match. He asked my siblings if they wanted to go with him and they said yes, so now they're here too. My mom tried to stop them but couldn't, and she sent my sister a long rambling text about how the three of us are dead to her and ungrateful pieces of shit. \n\nSince she won't talk with him to come to a solution my dad sees he has no other choice but to go to the courts to get full custody of my siblings (especially with how verbally abusive she's being). So that's good.\n   \n**tl;dr**: Told my dad, and he rescued my siblings and is seeking full custody due to my mom's refusal to cooperate/instability. However I got kicked out of my house and my relationship with my mom is in the shitter. ",
        "permalink": "/r/relationships/comments/36i2g0/update_my_18f_mom_49f_is_choosing_her_boyfriend/",
        "comments": [
            "Make sure you save those texts and give them to your dad and his lawyer. ",
            "OP, you should file a police report for her slapping you and the boyfriend threatening you. Even if it doesn't amount to anything right away, that can be helpful in a custody hearing. ",
            "> She accused me of wearing slutty clothes to try to steal him (the fuck?)\n\nYou were in so much danger at that house. She knew that her bf perving on you and didn't care so long as he was with her.",
            "At least you're all in a safe place now. Make sure that you save all the mean text messages/voicemails/emails that your mother sends you so that your dad can use them in court if necessary. Also, consider filing a police report about the physical abuse, even if it doesn't go anywhere this time it's something your dad can bring up in court and it establishes a record in case your mother ever does something like this again.\n\nYou brother and sister are still young, it would probably be a good idea for the 3 of you to do counseling together.\n\nGood luck to your family!",
            "I know it doesn't seem like it right now, but this is the best possible outcome for the original situation. \n\nYou *absolutely* did the right thing by calling your dad and getting yourself out of there - and even better, your siblings all wanted to go with your dad, too. You're letting your dad do his job as a parent, which is great. I'm not sure if you were able to get important documents out of your mom's house as you left (Social Security Card, birth certificate, passport, etc.), but if not, maybe your dad can go, with police escort if need be. These are documents you'll need as you go to apply for jobs and school, and it's going to be better for you to keep your distance from your mom until she gets help.\n\nTake this time to talk this over with your siblings about how you feel about the situation. Maybe talk to your dad about getting in to see a therapist (or talk to your school counselor about everything - that's why they're there). This is not at all an easy thing to go through, but there are people who can help you process the emotions you're feeling. You don't deserve to be treated like your mother and her boyfriend treated you, and those people don't deserve to know you. You will get through this and come out the other side even stronger and better than before.\n\nBest wishes, and keep us posted on how the custody situation goes.",
            "[removed]",
            "your mom is sick honey, this is not your fault at all! You all need to get some help and therapy to get though this, but it sounds like your dad has stepped up and I only hope the best for you all! \n\n(((hugs)))",
            "Your mom sounds like a real peach",
            "[deleted]",
            "(((hugs)))\n\nI'm proud of you!  \n\nIt's difficult I know.  I will recommend some counseling so you and your siblings can figure emotionally - that her behavior has nothing to do with you.  That her screaming epithets at you does not mean that any of them are true.  That her behavior is a reflection of her low-self-esteem and none of you need to duplicate her behavior in your lives.\n\nTake care of yourself! ",
            "First off, if you have a driver's license with your address on it or can prove that you live at your home (mail with your name on it), your mother cannot just kick you out. As an adult living in her house you are her tenant and she has to give you a formal notice of eviction (if you're in the states, all states have at least a minimum of 30 days notice, some have more). So you can at least fight to live in your house for a bit while you figure out your next move, if you want. It's up to you to know if this is a fight that is worth it. To me, it seems that you're already in a safe place, so the fight isn't worth it. I'm just informing you so you know that you have tenant rights in the future. \n\nAlso, your mother seems like a narcissistic bitch and not worth the effort. Surround yourself with people who actually care about you OP. Just because she is your mom doesn't mean that you're obligated to have a relationship with her if she is a shitty person. ",
            "Your mom made her choice, and she will have to live with it. Her boyfriend is bad news, but from the sound of your mom's behavior, so is she. ",
            "[removed]",
            "I am so sorry this happened to you. It was very brave of you to tell your father- it is all too easy to think that you should put up with bad behaviour for fear of rocking the boat.\n\nUnderstand that the blame in this situation lies 100% with your mother. She failed in her parental duties towards you and your siblings, which is not your fault **whatsoever**. Yeah divorcing sucks but at some point you become responsible for your own mental health (especially as a parent) and she refused to address her problems.\n\nKeep any texts/emails your mum sends to you or your siblings and pass them onto your dad so he can give them to his lawyer for the custody fight. Otherwise, just don't talk to her- spare yourself that pain, for the near future at least.\n\nI hope things settle down for you soon and that you can go back to having a normal life. ",
            "I couldn't be happier that your dad actually take charge of everything. Even your stepmom has more common sense than your mom. Your mom, let her and her delusional dreamland be for now. This is not a person you want to be near with your family and loved ones.\r\rUpdate us about the custody and your plan from now on.",
            "OP, you did right by your siblings. You looked out for those that needed looking out for. You were the mother in this situation. It sucks that you had to do it, but you did the right thing. I'm proud of you. I don't have any advice or wise words about the path you have chosen, just know that you were right.",
            "Hold on to that text message from your mom.  Also you should report her hitting you to police.  BF is going to hurt one of you at some point and this paper trail will strenghten your case.",
            "I have a feeling your mom's mental health issues are not all resolved. That said, the only thing you can really do is support your siblings and keep them the hell away from her until the custody issues are sorted out.",
            "Document everything, save those texts. If a custody battle ensues, these will become very very important. \n\nAnd I'm so sorry you had to go through this. I know it's impossible to say \"don't be hurt\" but remember that this reflects entirely on her and not on you. *You did nothing wrong* -she did. What's good to know is your father is there for you and you have a safe and welcoming place to be, and your siblings are also there and safe from your mother's terrible behavior. Sometimes adults flip out like this and upend everyone and everything in their lives to get something new, like this boyfriend from the sounds of it. That's her path to walk, her mistake to make. You just focus on you and be there for the younger siblings as this may be even tougher on them because they're too young to really understand and can easily feel guilt or shame when that mantle belongs squarely on your mother's shoulders. Take a little strength and a hug from an internet stranger who wants more than anything for you all to heal and do well from here on out. It will get better, in time, and the more you and your father and siblings can be a family and support one another, the sooner it will improve. Be well and be strong. Better days are ahead now that you're out of the darkness.",
            "Just one thing to keep in mind amongst all this is to really be extra appreciative towards your step mum. It's a big deal to have you guys permanently now. She'll of course say it's fine and mean it, but it will put some extra burdens on her so she'll really benefit from some kind words and actions now and again. ",
            "You didn't put your relationship in the shitter, your mother did. You understand?\n\nSHE did this, not you. \n\nProud of you.",
            "Think of this as a fresh start for you, your dad, and your stepmom. They did right by you this time around. ",
            "First of all: Great to hear you guys are safe and away from that lunatic.\n\nSecond: Your mother may be mentally unstable. Though getting her to go to a doctor is probably impossible.\n\nThird: As others in this thread have pointed out, filing a police report for your mother slapping you, and her and her boyfriend verbally abusing you is a good idea - it will make the custody case easier for your dad.\n\nFourth: Sorry your mother is behaving this way. Hitting you, screaming at you, letting her boyfriend scream at you, accusing you of wanting to 'steal' her boyfriend (yeah, right) - all that points to her having some serious mental health issues.\n\nBe safe, OP. I hope you and your siblings have a good time at your Dad's from now on :)",
            "I wish I had the balls you had when I was a teenager. My mom has been in a shitty abusive relationship for 25 years and I would do anything to go back and time and at least tried to have stopped it when it was first starting. I'm proud of you, internet stranger. ",
            "I get the feeling that your mom is a narcissist with an abandonment complex. She sounds incredibly selfish, immature and insecure. I'm no psychologist of course so take this with a grain of salt, but my own mother behaves very similarly. I can't help but wonder if she has learned to manipulate her therapist into being 'on her side' with her mental issues. \n\nWhile I certainly understand your bitterness toward your stepmom, I think it's worth it to give her a chance. You don't have to agree with the way things happened between her and your father to respect her for being there for you guys in a time of need. I have issues with my stepmom too but when it comes down to it, I know she will always be there for me if I need her and that's a hell of a lot more than I can say for my own mother. \n\nI'm so glad you guys are safe away from the craziness and abuse. ",
            "Be sure to treat your step-Mom right (or however you refer to her), it has to be incredibly difficult taking in three children that are not your own. And having ones that are difficult, don't listen and overall are just rude, it will make it even harder.\n\nIt will be a tough transition for everyone, but if the three of you work together, you can probably make it much smoother.",
            "> \"Give me the money or I'll fuck your shit up\".\n\nWhen someone does that you hand them the money and then call the police for robbery.",
            "Sit down right now and write out everything you remember.  Your Dad will need that information.  Keep every email or letter from your Mom and her boyfriend.  \n\nEven if you have a perfect memory, the written word is always relied on more. \n\nYour Mom has entered a cycle of abuse that will only get worse, her abuser has seen a trait in her that lends itself to abuse and will play it for all it is worth.  The deeper she goes the more she will delude herself and defend him. ",
            "Are you fucking serious? I am so sorry OP. You don't deserve this, your title is correct, she's choosing him over you. Don't forget this. People who are selfish like this towards their own children will likely continue this behavior. If he's already shown signs of abuse to you three, you mother isn't too far away. That may hurt to hear, but it's not your place. This may be crass, but your mother has made her choice. Don't forget this or the awful things she's said to you. One day she's going to leave him or vice versa and going to try to come begging for forgiveness. Just remember selfish people rarely grow out of that behavior.",
            "You mother's emotional stability and sense of self-worth seem to be directly linked to whether she has a man in her life. I am quite sure your father was on the receiving end of some not-so-nice emotional guilt trips and manipulations by his ex-wife.\n\nThat she is defending a man who obviously has control/abuse issues over protecting her children is more than a red flag. \n\nAt some point I suspect you'll be required to divulge this behavior to a judge or Child Protective Services personnel. Do not try to protect your mother. Your two little siblings are at risk.",
            " check our /r/raisedbynarcissists your mum sounds just like one ",
            "I just wanted to say that you did the right thing. You may doubt yourself at some point, but I want you to remember that you did the right thing. \n\nPeople get divorced, spouses cheat, and marriages fall apart - shutting down, then sacrificing you and your siblings safety for her happiness is not an okay response. I'm glad she's found some happiness, but her first responsibility is being a parent. \n\nYou're well on your way to becoming an awesome adult. Good luck with graduation, and college. I hope everything works out for the best. ",
            "File a report with the cops if you want the best chance of your dad getting full custody. ",
            "I'm glad you and your siblings are with your father and are safe and happy. Good move.\n\nYour mother is on a downward spiral here :(\n\nEven though she has fallen out with you guys, keep an eye out for her! She may need somebody to talk to, especially now that she is all alone with an abusive man.\n\n",
            "SAVE THOSE TEXTS. They will be a gold mine when your dad goes to court.",
            "Good for you. Sounds like you have a good father.",
            "**File a police report about the slap!!!!**  It is crucially important.",
            "Glad you kids are safe with your dad. Your mother and her boyfriend are sick, sick people.",
            "Maybe we know why your dad left her.\n\nHe did the right thing.  He knew what a messy confrontation he was going to have before he went to your mother's house, but he went anyway.  That shows his love for his kids.",
            "My God, thank goodness you're out of there.  Your mother is delusional and is sacrificing her relationship with her kids for this abusive asshole.",
            "Wow, that sucks!  Good for you for telling your dad, glad you're safe and out of that house.  Best wishes for the future.",
            "Ya, I'd call the cops and file a report. ",
            "OP, I'm glad you're in a safer place now. One thing I wanted to ask: how was your mom before the marital issues with your dad? Was she always like this (perhaps contributing to why your dad left), or did this type of behavior emerge as a result of the split?",
            "I don't have any advise... just to say good on your dad. he's a true father.",
            "Sounds like a huge improvement, even if you don't neccesarily get along with your dad and stepmom. At least you guys are safe!",
            "Yeah, you guys are better at your dads. Don't surround yourself with your mom.\n\nMother or not, she's a piece of shit. ",
            "OP how are you feeling about being at your dad's? I know you were concerned before about your stepmom using you as a babysitting service and whatnot but are you feeling at ease/welcome there?",
            "Please file a police report agains both of them and call CPS. I'm sorry your mom is so terrible. ",
            "FORGET YOUR MOM!! She made her choice & I wouldn't look back. ",
            "Make sure any texts she sends are kept for evidence",
            "If anything, try contacting your grandma about this situation. Maybe she can convince your mom to seek therapy again and help her snap out of it. \n",
            "OMG I am so glad you and your siblings are out of that house. Your Mom has gone off the deep end and I feel so bad that you had to go through that. I hope she gets the help she needs.",
            "It honestly scares me that a mother could treat her child this way. I'm so freaking glad you're all with your father - make sure you and your siblings do all you can to stay away from that psychotic woman forever.",
            "I'm so sorry that you have to deal with this! I empathize and sympathize with you for having a bad parent. It's not your fault. Highly recommend seeing a therapist- even though you have a good head on your shoulders, that kind of abuse has a way of scarring. \n\nHugs and wishing you peace at your father's.",
            "Wow! So good your dad has you and your sibling with him. You 3 are old enough to tell the courts who you want to live with. Good luck!",
            "OP, this is almost the same story of my own leaving the house at age sixteen: my dad punched me in the face and slammed me through the drywall in my room because I answered the phone after his arbitrary phone curfew had passed. \n\nLeaving that ugly, abusive, emotional, soul-killing situation with a narcissist father and an emotional punching bag mother was the best thing I ever did for myself, for quite a long time. (The best thing these days was quitting my career to go back to school.) \n\nI'm so glad you have a supportive dad and stepmom. Please try and help your younger siblings understand that none of their mother's erratic behavior is in any way THEIR fault. My heart goes out to all of you. ",
            "I'm sorry you're mom is such a shitty mother and overall a horrible human being.  I just hope she because your anti-rolemodel and influences you and your siblings in a way that you never want to become anything like her.",
            "I was in a similar situation. Luckily my dad came to his senses and snapped out of it. Took him long enough to realize that she was a crazy bitch. I hope she does too. But this extent makes it unlikely. I wish you and your siblings the best. You deserve better, and your moms bf deserves to be hit by a buss full of bricks.",
            "You did the right thing. I know its hard but you did the right thing. Let's hope the adults can try to behave like adults now and stop bringing this all on you and your siblings.",
            "As crazy as this sounds, you're lucky to have her blatantly come out and say she hates you and doesn't want you,  and finally you have the chance to get the hell out of a miserable relationship.\n\nI'm not so lucky. Trust me, there's nothing worse than having a lazy, mean, abusive mother who constantly insists all she cares about is you, and puts on a pretty face in public, but is an absolute nightmare when no one else is looking. It's just that much more frustrating knowing this person is single handedly ruining your life/childhood, yet insists they are wonderful and that you are ungrateful. \n\nI WISH my mother would straight up do something over the top like that. I know it seems weird to aspire to be hit, but at least then you would have the grounds to end your relationship with her. My parents too are separated, and I cannot wait to get out of this fucking place. ",
            "OP, good on you for getting out of there. Everyone else in this thread has given good advice for making sure that you and your siblings are kept out of harms way. So I won't.\n\nI want to prelude this response by saying that the following isn't necessarily something that you can deal with right now, and, most importantly, **is not and never should be considered your responsibility**. So please, feel free to not read or think much about this; get your own affairs in order first. But, with that in mind:\n\nOne thing that hasn't really been brought up in this thread, is the relationship of your mother with her boyfriend. I'm not a psychologist, but your description in your first post (depressed until she met him, on anti-depressants now, madly in love with him, didn't get crazy till recently) sounds very much like some kind of dependancy. Which is unhealthy, especially given that he's verbally abusive.\n\nDoes she have someone close to her (siblings, friends etc) that can talk to her about this? If you want to repair your relationship with your mother at some point in the future, it sounds like this needs to happen first.",
            "Good to hear you and your siblings are safe! Happy that your dad did the right thing. As there have said, keep the texts. Wish the best of luck to you all.",
            "She should be subjected to a drug screen before she is allowed to contact any of the children again. The boyfriend has to have her hooked on something. My ex is currently part-time shacking with her drunk ass wife beating second husband because \"we just don't get their connection\". She is under the mistaken impression that I don't know where this love nest is and there are both a no-contact order from his release conditions and a condition of his probation that he have no-contact with her and refrain from alcohol use and fraternizing with females. The last one seems weird but it's there in black and white. All I have to do is dump a folder of pictures, credit card receipts, and witness statements in his P.O.'s lap and he goes to prison for 18 months. Just waiting for her to pull an asshole move like your mom has, and her special snowflake becomes some Aryan Brotherhood mook's bride",
            "You mom's boyfriend is a scumbag - it's good that you and your siblings are away from that situation. \n\nBut that said, your mom needs help. I'm not excusing her behaviour, but I get where she's coming from. She was severely depressed, terrible self-esteem, etc. It's a very bad place to be and very difficult to work yourself out of. You said she was better with medication and treatment, that's good - but now that she's found a new \"man\", she probably feels that she has to do everything she can to hold on to him because she feels that's all she'll ever get and if she loses him, that's it. So now, in her mind, it's *everything* to keep him \"happy\", to the point of irrationality. Even to the point of treating you and your siblings like this - it's terrible. She needs to get help with her self-esteem and to get out of that relationship, because it (the relationship) is not going to get any better.   \n\nAgain, this is not at all to excuse her, and you're 100% in the right to get yourself and your siblings out of that situation - it's just to make you aware because if she's able to get past this and is sincerely remorseful then there's a chance to mend some of the relationship.   \n\nYou and your siblings would also do well to sit down and talk to someone about all this, you sound like you've got a good perspective on this, but who knows where your brother and sister are. And even if you're \"alright\", it's still good to talk to someone anonymously.  \n",
            "What is the potential that your mother could be on drugs and her bf is facilitating their use? If she is using then that is definitely something I hope you have a way to document for the potential legal battle ahead. ",
            "My brother and I went through the same type of situation with our mother when we were 10 and 11. It was horrible and has definitely affected me as I've gotten older. Little did we know she was a drug addict and alcoholic, although she looked like a model instead of the stereotype. I didn't talk to her for years until she got herself into AA and now we have a relationship. I wouldn't call it mother-daughter connection but more of a friendship. It sucks and growing up without a mom was horrible but hopefully she'll get her head on her shoulders one day. As soon as my mom got rid of her boyfriend she finally came to terms with what she became. ",
            "Be calm, leave and if you feel like reestablishing a relationship later, do it with the guidance of an adult (that's not anyone on your mom's side). ",
            ">He asked my siblings if they wanted to go with him and they said yes, so now they're here too. \n\nOh thank god. Bout to have a heart attack when you left without them. ",
            "Good thing your dad is going to take them, that's nice.",
            "She'll die a lonely, lonely, woman. Your dad sounds awesome, and do does your step-mum. I hope the gravity of the situation dawns on your mum. What horrific, disgusting behavior....from a supposed adult.",
            "Your mom and her boyfriend are on meth. Get everything you value out of that house.",
            "I hope when the time comes you don't go back to your mother, ever. I'm sure one day (when the BF dumps her) she will try and get back in contact with you. If it were me I would say fuck her and never talk to her again. I know she's your \"mom\" but no mother should ever speak to their child like that let alone get physical.\n\nYour dad doesn't seem like a saint but God bless him for stepping up the way that he did. I hope you and your siblings will enjoy your time there. Good luck. ",
            "Op, in case your mom's boyfriend shows up at your work all crazy, tell your manager maybe and ask to switch your shift times or something. (sorry if this sounds stupid, I don't know how the shifts work in the restaurant business)\n\nEdit: Just re-read a part of the first one and realized he asked for it after you came home. If in any case he knows about where you work/what hours, I would probably still talk to your manager.",
            "This reminds me of the situation I was in 8 months ago, except for the fact that my little sister is still living with my mother.\n\nIt sucks",
            "Oh thank goodness your dad stepped in. I'm so glad you told him. And being used as a babysitter sounds more pleasent than being abused so it's the lesser of the two evils. Try to give a little to show appreciation that he's in your corner,  but also learn the word 'no' well from the outset so they don't just expect it. \n\n\n\n\nBest of luck to all of you, I hope things well and truly turn around for you guys now you're all somewhere safe. ",
            "wow! Glad you spoke up and really glad your dad came through for you-his wife too!",
            "It's unfortunate all around. I hope that you can reconcile things with your mom. Although what your dad did to your mom was horrible, she needs to get passed it for herself. The sooner she can do that, the sooner she'll be able to get a proper perspective of reality. Until then, everything she does is designed to protect her fragile sense of self. Maybe the best thing to do is just tell her that despite what has happened you still love her. But for the sake of everyone's health it's better to change these living arrangements. It looks like she sees the fact of her kids staying with her as a sort of emotional leverage over her humiliation of the past. With her kids leaving, it is almost like a revival of that humiliation. She's living in the past. By maintaining a narrative that reinforces the past the neurological imprints created by those traumatic experiences are maintained. By changing the narrative, those neurological imprints will go away and be replaced by other experiences, ideally positive ones.",
            "Holy shit, OP, first your mom's boyfriend says that by dressing \"slutty\" (btw, tank tops are slutty? them porn shoulders be tempting), you're asking for sex and then your mom accuses you of dressing slutty to try and steal him? He's creepin' on you and your sister, OP, and I'm super glad that you are out of there. If anything were to happen, the two of them would blame you and your sister for being such harlots.",
            "I'm sorry OP.",
            "Your mother is a disgusting example of how a human being should act.\n\nThis should unfortunately teach you the true nature of the \"woman\" who birthed you. She's a child. \n\nShe literally accused you of trying to steal her boyfriend. That should tell you all you need to know about her, she's not worth the breath in your lungs. Do. Not. Ever. Let her back into your life unless it is on your terms, girl.\n\nI'm proud of you.",
            "I am so happy for you OP. So so happy. Remember, you are not safe at your mother's. Stay with your father no matter what, unless it becomes dangerous there as well. ",
            "More or less the same thing happened to me during my senior year of High School. Didn't have anywhere to go. Luckily some of my good friends let me couch surf till graduation. Some people are just bad people family or not. The quicker you put her behind you the faster you can get on with your life.",
            "[deleted]"
        ]
    },
    {
        "post_id": "bkke4d",
        "author": "sadandfrustrated2789",
        "title": "[UPDATE] Is he (m31) irational or am I (f27) not empathetic enough?",
        "url": "https://www.reddit.com/r/relationships/comments/bkke4d/update_is_he_m31_irational_or_am_i_f27_not/",
        "score": 2132,
        "num_comments": 68,
        "created_utc": 1556970959.0,
        "selftext": "[Original post](https://ud.reddit.com/r/relationships/comments/9ovs9s/is_he_m31_irational_or_am_i_f27_not_empathetic/)\n\nSorry for long wall of text. I guess I just need to put it out there...\n\nWe didn't broke up right after I made my post. We had a long conversation, made effort to listen to each other and decided to stay together. We right then planned to move in back together around New Years if everything's ok between us. And everything was good for a month, really good. At the end of November I finally relaxed, we started getting really close to each other again. One night he was extremely affectionate, we fooled around a bit for the first time after three months and later I mentioned moving in. After I told him how I think it's natural next step for us, I asked what are his thoughts. In a really cold manner he held 10 min long monologue how he's good where he is and there's no real reason to move back. I was sad but calm and just accepted what he was saying despite knowing that wasn't what we agreed on. He didn't really understand why am I sad but he let it go after I pleaded him. In short, he promised he will think about it.\n\n\nThen there was a week long string of his shitty behavior where all of a sudden I was guilty for every little thing. In short, the biggest thing was: I asked him, though nervously, if I can give him my house keys in the town center so I can spend morning with family that arrived for a day instead of waiting him at home til he arrives with his stuff in the early afternoon (he lost his keys to my place); he agreed moths ago that he will there with me, on that date, when my cousins arrive. He could have come over day earlier but first he said he had to work, then when he didn't he said he would rather spend the day at his place and town. It really pissed him off when I asked that... He was irritable whole week after that, acting cold and distant and refused to come to my place as agreed on multiple occasions.\n\n\nFinally we agreed he will come on Friday (a week after our last talk about moving in). He called me Friday morning, I couldn't really talk so we just exchanged few words (have a nice day etc.). Few minutes later I got text how I am cold and he feels unwelcome every time he needs to come over, how I ruin everything. I responded that if he doesn't want to come or be with me, it's okay, but I am not the problem and I don't want to fight. He is welcome to come if he solves his anger. He called me again and said he had enough and said he will just come over to gather his things. I was really pissed off because this was happening all over again and after 10 of his break up threats during our conversation - I told him I am fine with it. It ended up with him calling me a 100 times that day, I guess he was in disbelief that I (!) decided to break up after a whole month together where everything was good between us. I answered every call hoping he would say the right things but he was angry because his apologies weren't enough, mocking me and saying how he has no problem finding other women, how he was willing to forgive me all my wrongs and how I should do the same for his. At this point apologies meant nothing to me and I was annoyed how easily he would like to let all (his) drama go. Every few days he continued contacting me proclaiming his love etc., claiming he would do everything for me and us and how he changed, how he will always wait for me. He calmed down after a month, I was drawn to it so began calling once a week to see how he is. In February, after 2 or 3 conversations of that type, when I asked why is he willing to wait for me but not willing to actually do something to prove his change, he coldly said if what he already did isn't enough, it can't be helped. He was playing with me all over again and it was a final confirmation for me. He still tried to contact me after, confused how I stopped reaching out but I am not calling, not texting, not answering him for two months now. I truly loved him once but was miserable with him. I am now much happier and much much calmer, filled my life with hobbies, friends and happy thoughts! I am really proud that he didn't manage to convince me to lower my standards even more and destroyed my self esteem. I am tired of drama but I have never been in better state, both emotionally and physically!\n\ntldr He was playing with me again, hot'n cold, I broke up with him, disappointed how he really turned up to be, feeling pretty good.\n\nEdit: \nDear Redditors,\n\nthank you all for your support, it means the world to me in these moments! It feels good not to be alone.\n\n\nLots of you are guessing what was it with him: for months I was trying to figure why was he doing some things and, as some of you suggested, I noticed certain things were present form the beginning of our relationship – I was communicating back then I wasn't comfortable with it but he created a mental fog (great term!) about it,  I was more naive or understanding or just in love and accepted that change is a process that will take time. \nThose examples I provided you with are just the end of our relationship: yes, I was dismissive because I was sick of the pattern. Maybe I am not the best communicator, I see that now but I was really trying to listen. He did start dating me because I was empathic, he claimed it's my biggest quality. Later he claimed I disappointed him and that he expected more. His psychologist said he has just one problem: accepting things as they are when he excepted way more. He never had any problems he would talk to me about – except those where I was the problem. When I would approach him with my problems or how my day went, he would be smothered by it saying I must get used to people being unprofessional and not to be bothered by it (though not always); later he would point out how he always listens to me and expected me to be grateful he put up with it. \n\n\nAlso, when I broke up with him – he moved to the city where I live in a matter of 10 days claiming that it was his wish to move there all along and how life in his hometown is hopeless – and how it could have been with me if I haven't broke up with him (that was just 15 days after our moving in talk). He also mentioned it was part of the plan he made with his parents long time ago – when I asked how I wasn't aware of it he responded, confused, that I have nothing to do with it and his and their living arrangement. While we were living together he would attack my choice of words for his birth home – if I asked how was it at „house“ (in my language used the same as home), he would say how dare I use house instead of home – when I would defend saying I didn't mean to hurt him and that I am not that conscious about my wording, he would be convinced I am doing it on purpose just to provoke him, emphasizing that his birth house will always be his home – and he wouldn't let go easily. Usually it would last for 3 hours - 3 hours of reasoning and convincing. Some months I was just numb sitting waiting for him to stop, not even trying anymore, my mind couldn't process it.\n\n\nI think he was very insecure, out of his comfort zone and trying to find a way to move away from me, he became suspicious about everything I did or said, looking for a reason to argue. I figured he didn't want to be with me. We were incompatible in many ways and in the end I just didn't want to be closed in his box together with him anymore. I want to live. Freely.\n\n\n\nWhat did help me? I learned that not everyone will react to my statements / words like I am hurting them. Now I still sometimes expect the worst and I can be really anxious about what I said (even though objectively it's not a big deal) but then the other person reacts positively, acknowledging me and my thoughts – and it's magnificent!\n\n\nThank you one more time - I can't describe what it means to me.",
        "permalink": "/r/relationships/comments/bkke4d/update_is_he_m31_irational_or_am_i_f27_not/",
        "comments": [
            "I’m so glad you chose yourself over this douchebag.\n\nI was in a relationship like that once and he turned out to be an abuser putting me into a mental fog so I couldn’t recognize it\n\nYou escaped girl let that trash take itself out\n\nYou won’t believe how good a real healthy relationship feels when you find one someday (if you have good relationships with parents or friends now use that as a comparison) \n\nJust cause you love how you feel about someone doesn’t make it worth going through pain to be near them",
            "He just exudes emotional manipulation. Good on you, OP, for moving on.",
            "I'm 27F, my ex was 31M too. Yesterday I 'broke up' with him despite him being the one who ended our relationship in December. He clung to me still and couldnt accept his choices and i had to make the final push. \n\nIt fucking sucked and felt a little backwards considering he was the one who 'needs to fuck other people' and i was the one who was ready to build a life together. But it does feel so relieving to not live with his bullshit anymore. Oh. My. God.  I feel so much better about myself, i cant believe how high of a pedestal i put him on. \n\nLife is about me again, it's amazing and i've already noticed so many positive changes in myself. I wish you all the best moving forward and if you want someone to chat to feel free to pm! \n\nCheers to new beginnings.",
            "This guy lights more gas than BP. You dodged a huge bullet; don’t look back.",
            "He sounds like a dramaboi. Always needs to be emotionally heightened. Fighting, being cold because pissy, declaring love. \n\nYou dont need a dramaboi.",
            "NTA- He seems like a textbook gaslighter. Every negative feeling he has is your fault.  All the positive ones are never enough.  And when you’ve had enough of his shit he “love bombs” you to get you back. \n\nPlease read up on gaslighting and narcissists.  Make yourself aware of the abuse he’s put you through.  And honestly, he was likely doing a small version of this your entire relationship and you didn’t realize it until he had a breakdown and ramped up his shitty behavior.",
            "Well bloody done! You took control, good for you!",
            "If his absence brings you peace, you didn’t truly lose him. You don’t have to deal with all the annoying communication things and the way he treated you. It’ll still hurt because you loved him, but I think it needed to happen. He didn’t treat you right.",
            "Truly the best closure out there, isn't it? When you realize they're simply a bad person.",
            "Wow, you had one really messed up boyfriend. It sounds a lot like my ex-girlfriend and I totally can relate to you. You did the right thing breaking up with him.",
            "I cried happy tears, you GO OP YOU GET IT GIRL!! <3",
            "I once dated a guy that turned every little thing into drama like that. It's exhausting! I recommend listening to Amanda Palmer's \"Grown Man Cry.\" I found it really relatable.",
            "You did the right thing. Threatening to break up with you and acting shocked that you went through with it, that tells me he was using it as a control mechanism over you. And you put a stop to it. \n\nThe right person wouldn't do things like that to you. Not ever.",
            "If you feel a sense of relief and all around a happier person after ending your relationship with someone. That right there is enough confirmation that you made the right choice. No matter who was in the wrong.",
            "Ugh reading that was exhausting, I couldn't imagine dating this character.",
            "I'm so proud of you for getting out! Remember all those red flags do you'll never fall for that nonsense ever again!!! You're stronger than you know!",
            "I was once in a \"relationship\" like this (he had a girlfriend but was constantly proclaiming his love/telling me he was gonna break it off etc). After over a year of this I asked him point blank with tears in my eyes \"Do you enjoy torturing me?\"\n\nAnd he said \"Yeah, it turns me on.\"\n\n\nIt was such a strange moment of truth. I told him we were done and he tried to get into the gate to my building. I slammed the door in his face. I've seen him a few times around town, but that was the end. \n\nI remember waiting up all night just to get a text from him despite being a fully grown woman. There are a lot of important things I put on the back burner to care for him and to give him the attention he desperately needed. He enjoyed my anxiety and depression and suicidal thoughts and promoted them thinking that he could somehow pull a Superman. \n\n\nYour man wasn't 18/19. He's 31 years old and you're better off without him.",
            "This guy sounds fucking miserable, you did the right thing OP!",
            "Ugh, what an immature idiot. Sounds like you are much better off now.\n\nI hope you feel better about it now, OP. Good luck.",
            "Beyond empathetic. \n\nNot only is he irrational, but most likely has serious mental health issues, as most men do.  Calling 100 times is abusive, indicative of a lack of boundaries, self-centered, amd threatening.  Men are responsible for over 90% of all violence - meaning, there is a serious crisis that is psychotic men not being addressed and psychotropically medicated.\n\nFrom what your story says, concisely, the facts are: he used you for gratification, is entitled, controlling, and indecisive.  \"It can't be helped\" is right (*it* being him).  I can't imagine the emotional numbing you probably do automatically as a result of his incessant histrionic/borderline projections.  I'd consider changing your phone number and filing a restraining order.",
            "As a guy, I am getting a sense of a lot of hidden secrets and agendas from this guy. \n\nAt this point it’s not worth the worry to find out.  \n\nBut you should test yourself for std’s.",
            "You are being gaslighted out the a**. \n\nHere's a tip, hot and cold. Hot=manipulation\nCold=true feelings/controlling",
            "Good on you.  All of this smacks of a person stringing another along until they find a more preferable option.",
            ">I am not calling, not texting, not answering him for two months now.\n\nYou go girl! Keep it up! In case you ever get tempted, just read your post again.",
            "I’m exhausted and lost self esteem just reading this story.\nNever go back",
            "Reading this and the original was giving me flashbacks to my younger sister. This is exactly what she's like. If you have any opinion or do anything that she doesn't agree with or isn't exactly like how she wants it, it's a betrayal and a slight against her. On top of it, she won't tell you and just ice you out and call you horrible names.\n\nBest thing to do with people like this? Leave them. They are nuts enough to have fights with themselves and their crazy circular self absorbed manipulative arguments, they don't need a partner, they need someone to just fight with.\n\nSeriously, glad to read that you finally broke it off with him. Let the trash take itself out. I don't talk to my sister anymore, and my life is a million times better without her in it.\n\nGood grief.",
            "Possibly. But people who aren’t gaslighters don’t typically know the behavior to lie about it.  But I guess it could be possible.",
            "So glad you did what you did! You are so much more important and rational than this guy who sounds like he was emotionally manipulative. I feel bad for the next girl he dates. But, well done to you 💖💖",
            "Basically he's not irrational and you're as empathetic as you need to be,  hes just nowhere near as strong as you and no where near as interesting and doesn't want the things you do because they're just too much hard work for him. You deserve better. You know it and now he knows it. 😀",
            "What does (m31) and (f27) mean",
            "I'm glad you dumped this dumb person. literally sounds like a nightmare and I'm telling you it's so refreshing to be in a relationship with someone who does not make drama out of things that there is no drama about",
            "My ex was like that too. He would ignore me for days at a time when he got mad at me. Finally, after four days of refusing to speak to me he asked me “so what are we?” And i said “done”. He harassed me for the next four months.",
            "Please read some books on codependence and/or boundaries so that you can recognize these traits in the future.",
            "Hes manipulative and when you dont give him what he want he projects his problems as being yours. I had a guy like that. Kicked him to the curb real quick. It sucks though. Take time and just spend your time doing things you enjoy and with good friends who value your opinion. You dont have to walk on eggshells nor do you deserve to.",
            "Idk, when you start taking your unhappiness out on your spouse, when they aren’t the source, but treat them like they are, is textbook manipulative behavior. \n\nIf your GF is doing this, you might want to have a talk with her.  I can see being waspish at times, but if this is a constant thing, it could be a problem.\n\nIf you feel like you have to walk on eggshells, or any mistake is going to be a blow up... it’s a problem.",
            "So I read this and the original post. It sounds like you weren't a good match, and I'm not surprised the relationship didn't work out.\n\nThat said, I'm surprised nobody's pointed out that he did have a point - you are not empathetic. Every time he tells you he's hurt about something, you shove it away and tell him it's not a big deal. That's actually a really shitty thing to do to people, especially someone you're in a relationship with. It says that you don't value their feelings, you don't trust them to be honest about their feelings, and you think you're the only decider of what's important in a relationship. You need to practice your empathy and validation skills. I bet a lot of situations earlier in the relationship could have been avoided if you had just said \"yes, I see that you are hurting\" and given him a hug.\n\nHe is passive aggressive, and neither of you are good communicators, but this is something you need to work on or it will come up again in future relationships.",
            "After all I've read, I'm still asking myself who's the bad guy here. If you look at it logically, it's not easy to tell, because this post is only one side. Maybe there was no bad guy. Maybe it just shouldn't have been, maybe you two are too different in how you communicate. Maybe you're too cold and he's too emotional. All possibilities, nothing's certain.\n\nI'm glad for you though, that you're happy the way it is now. Might be better for both of you.\n\nEdit: I find it frustrating and not especially fair, how many of you not even try to look at things from not her, but his perspective. The dislikes on my comment show, how few of you want to even only consider that her ex is a human being with reasons, flaws and so on while glorifying OP. Y'all might have had some similar problems with someone else, but please don't let your judgement get clouded because of that."
        ]
    }
]