[
    {
        "post_id": "sj8yv9",
        "author": "wheresthecoffeebro",
        "title": "Update to previous post: I (28F) feel like I'm ready to leave my marriage to my husband (42M)",
        "url": "https://www.reddit.com/r/relationships/comments/sj8yv9/update_to_previous_post_i_28f_feel_like_im_ready/",
        "score": 2133,
        "num_comments": 144,
        "created_utc": 1643859908.0,
        "selftext": "Link to original post: [https://www.reddit.com/r/relationships/comments/rwcpxl/i\\_28f\\_feel\\_like\\_im\\_ready\\_to\\_leave\\_my\\_marriage\\_to/?utm\\_source=share&utm\\_medium=web2x&context=3](https://www.reddit.com/r/relationships/comments/rwcpxl/i_28f_feel_like_im_ready_to_leave_my_marriage_to/?utm_source=share&utm_medium=web2x&context=3)\n\n Here is a little update to those of you who wanted one. First of all, I would like to say thank you for all the kind words and genuine advice, though it was all things I had heard before, it made a massive difference hearing it from strangers who don't even know me. All of that and my friends giving me some tough but much needed love, I finally got the courage to talk to my husband.  \n\nNot long after I posted my original post my husband called me to tell me he had ended up *LOSING* the job he abandoned me for. He doesn't have a good track record with work (Just in general has been seen as \"lazy\" ect.) so this wasn't shocking but was a *COMPLETE* slap in the face. Maybe I'm being harsh, but I felt let down *again*. As soon as he lost the job, he immediately started talking about how he was going to move in with me, I became sick to my stomach because *I DID NOT* want him here. I felt and still feel like a fall-back option. I wasn't his priority in the first place but now that he is down on his luck, it's just \"easier\" for him to move here and start over with my help. I told him to not look at jobs here right away and look where he is, and he somewhat agreed.\n\n After about a week of us not talking he messaged me out of nowhere telling me that he had found a job in my area that \"Was a great opportunity\", he used the same wording he had used with the job he had just lost. I was talking with a friend when he sent the message, she told me point blank 'Talk to him now, or he is going to show up on your doorstep and you are going to be stuck in this situation for another few years, and you promised yourself you would talk to him this week.\" She was 100% right, so I went and talked to him. \n\nI told him everything, how I felt, how I am feeling, how heartbroken I am, how his issues and his treatment of me have pushed me over the edge. He realized that a lot of what I said was things I had already brought up, he did own up to somethings, yet not everything. I had given him a million chances during the conversation to tell me the things I should improve on because I am well aware I am not blameless. I should have talked to him more etc. The only thing he could think of was the fact that I don't incite/participate in sex with him. I brought up my issues with sex and my insecurities, he said he understood but I don't think he understood how much it affected me (from my past trauma and other bad experiences), and how he never made me feel better. I then brought up how I hate how much porn he watches (side note: I don't hate porn, I just think excessive use can be bad), and how it gave him an unrealistic expectation of sex, he said, \"I feel like I have to watch it to get turned on to have sex with you\", that comment made my stomach drop, and my already low self-confidence deep dive even lower. Also, I knew this was a complete lie, as he NEVER initiated sex after watching porn- not once. I knew right then I was ***done***. How could I even consider repairing this when he feels like he needs to watch other people to get turned on enough to have sex with me?! Mind you, he would casually watch porn without jerking off or anything, this man always had porn open like a Spotify playlist. \n\nHe is trying *DESPERATELY* to keep me, messaging me constantly how much he loves me, making YouTube playlists of songs, sending me flowers etc. but it's all too little, too late in my eyes. He's also downplaying the situation to his closest friends and family, just chalking it up to me being upset with him. All of this just makes me more upset, anxious, on edge, and quite frankly mad.\n\n I already started filling out paperwork to file for divorce when I am 100% ready and will be asking him to stop texting me as much (particularly all the lovey dovey out of character stuff) and sending me things this week.  This whole thing has been a lot, but I am grateful for everyone who took the time to send me words of encouragement. I have realized, and am continuing to realize, my self-worth and I know I am worth so much more than a man who never tried in our whole 8 years of a relationship up until now. There's more I could get into, but I think I'll leave it here. Thank you all again for all your kind words and advice. Feel free to comment on the original post if you’d like to say anything, or would like to give words of wisdom or advice.\n\nTL:DR: I finally talked to my husband about everything and will be leaving him soon. Thank you to everyone who commented on my last post!",
        "permalink": "/r/relationships/comments/sj8yv9/update_to_previous_post_i_28f_feel_like_im_ready/",
        "comments": [
            "Well done you! Onwards and upwards",
            "Good on you mate. You are doing the hard stuff now and it can be confusing when you’re right in the middle of everything but you’ll be good once you’ve got a little space to think. \n\nYou did the right thing for you.",
            "Jesus you should be so proud of yourself! It really is too little too late. He tried to put you down and keep putting you down, hoping you’ll never leave him. Now that you did the lovey stuff is what he things will lure you back in. You did great!",
            "What your husband is doing is called love-bombing, don't fall for it.",
            "The only reason he said that lie is to knock your self-esteem down more. He probably thought (like most emotional abusers) if you believed no one else would want you, you would stay. \nPlease believe me that you are desirable and you will find someone who adores every curve and imaginary fault you see. \n\nI'm glad you've started on the paperwork to set yourself free. You can also ask he only contacts you through your soliciter and block him. You don't want to give him anymore opportunities to hurt you. \n\nGive yourself time to grieve to loss of who you thought he was, who you wanted him to be.  His failures are not yours (hugs) you got this 😊",
            "You can absolutely do better than a 42 (!!) year old man who's making Youtube playlists to try to save the marriage that he irreparably damaged. Good on you!",
            "Im rooting for you! Cut that baggage out if your life. You are worth so much more than the way this man is treating you",
            "You will meet someone better, he doesn't sound hard to beat.",
            "I am SO proud of you, OP! Way to fucking go! You are still *so* young and have so much life left to live, and you didn’t dump him a moment too late. Keep those friends who rallied you close through this process, and don’t let him worm his way back into mooching off of you and abusing you. It might be scary at times, you might feel sad and like you want him back sometimes, but you can get through this out to the other, *far* better side.\n\nAlso, I just wanted to say - take a good amount of time, like at least a year or so IMO, to kind of detox from this relationship. Don’t seek out a serious relationship or serious dates; prioritize spending time both by yourself and dating yourself, *and* with people who make you feel good about yourself, who you admire, like your friends. You will feel so much better for doing so, and your love for yourself will grow a thousand times over. 💜 Saying this especially as a fat woman who had an ex many years ago who was incredibly fatphobic and abusive!",
            "1 year from now you will look back and think how did I stay in this so long you will enjoy your new freedoms .",
            "i have a friend who used to be plus sized. she lost a lot of weight, and now tells me that she can’t believe the way she let people treat her because of her own insecurities and internalized self hatred. she internalized this idea that because she was a bigger woman, she should be happy with what she could get and can’t complain because the guys she dated already had to “put up” with her being bigger. despite all the body positivity in recent years, there’s still significant stigmas associated with being bigger and effects social media/society creeps into your psyche like no other. \n\ni only met her after she lost weight and it broke my heart to hear her talk about herself like that. weight or not, she’s one of the most genuinely kind, caring, talented, hardworking, smart, and unique individuals i’ve ever met. she’s overcome so much in her life with humility and grace. she often tells me how she can’t believe she let something like her weight make her forget that. i’m not saying that that’s what’s happening here, but worth mentioning. \n\nalso, if you can afford it, you should look into getting a therapist. much love and stay strong, i know how hard it must be.",
            "Maybe I’m naive but I have literally never heard of just casually watching porn like a twitch stream or a music playlist…. Wtf",
            "I'm so happy to hear that you're realising your self-worth! Brighter future ahead.",
            "Congrats! Keep going and ignore him. The insults that he throws at you are saying everything about him and nothing about you. He's insecure and he's trying to bring you down, so you don't leave him.   \nRemember that you are not alone, you have your doggo and your friends that love you and want you to be happy. You could also consider getting a therapist to help you heal your trauma and navigate the divorce in a healthy way.   \nI wish you the best of luck! You deserve better!",
            "Biggest red flag if I ever saw one is that he feels the need to watch porn to have sex with you, don’t make the same mistake I did 💔 my ex couldn’t perform unless watching porn and then it progressed into actively seeking it out instead of having intimate relations with me. He put more effort into trying to keep porn in his life than trying to have an actual sex life with me. I tried so hard to keep attractive, dressing sexy, make up, playing out fantasies, etc. then I realized he wasn’t putting any effort on his side. Selfish. And the fact that he abandoned you for this job- another huge red flag now he wants back. I would almost think another woman was a reason instead of a job but I don’t know that’s just my thought. And when it didn’t work out he wants to come back to you without you knowing. I wouldn’t give him anymore chances 💔 I’m so sorry you went through that.",
            "Yay!! Kudos to you! Enjoy your new life !",
            "OP, will you update us in a couple months? I LOVE knowing you’re out there, making moves and trying your best to treat yourself the way you deserve! You’re worthy of love and you deserve joy!",
            "Hey moderators, would it be possible to have a bookmark page or something with the links to success stories like this one for relationships with extreme age differences? We see so many posts where it is clear that grooming / power imbalances were and continue to be a huge factor in these relationships, and it would be nice to refer those who are the victims of these relationships to those posts, so they can see how many people are and have been in similar situations and are now better off that they've escaped.",
            "Woot! Happy for you. You are still so young!! When I was your age I was still in my second abusive relationship without any realization…wish I had reddits help back then.",
            "Girl. You are so strong. I am so happy for you to sticking to your guns and dropping this useless anchor from around your neck. You deserve someone who wants to be with you. Stay awesome!",
            "Please get a lawyer and do this right. It won't be easy.",
            "Who were you talking to when he contacted you, OP? YOUR FRIEND!\n\nYou are a nice person, who moved four hours and made friends. YOU are a nice person. You deserve all of this friendship and love and support. You DO.\n\nYou deserve anyone better than that lazy, lying ass who either lovebombs or negs you (ie I have to watch porn to get it up for you).\n\nYou are wonderful, you are loved, and you are brave!",
            "I'm rooting for you! Lose that emotional parasite!",
            "You deserve to be happy and sounds like you’re making the correct steps towards that.",
            "Good for you. You can do so much better than this guy - as you've seen, even being alone us preferable to being married to a guy who treats you like this. I'm really happy for you.",
            "You would be well served to go no contact. You’ll be surprised how much better you feel right away.",
            "Him: *Negs you about your weight and says he needs porn to have sex with you*\n\nYou: 'I don't want sex'\n\nHim: *shocked pikachu face*\n\nWell done OP, so proud of you, there's plenty of men out there who would worship you.",
            "Wisest thing I read was someone asked their aunt how they felt after a divorce and she said: I thought I had an anxiety disorder but it was just your uncle.\n\n\nThat seems to be the situation here.",
            "Well done. Please don't leave it here. This could be the start of something good, if you work on yourself.",
            "Happy to read this resolution! If you waver, call one of those supportive friends! Cheers!!!!",
            "I'm happy for you, well done! Cheers to a better happy life stranger :)",
            "· Firstly, congratulations, you've handled this like a champ. And the best part is you've already moved on really, you live in your own place! I know you mentioned you are deathly afraid of being alone but..be honest here. Isn't it nice being by yourself too? Not always wondering how your weight looks around him, trying to brush off him always watching porn etc? \n\nPlus You've got friends, good ones by the looks of it, lean on them for support and to comfort the occasional loneliness. \n\n\n· Don't just start the paperwork. Talk to a lawyer, *yesterday*. But also today. You've abandoned your marital home which could hurt you. And your husband has lost his job. Both these can be bad for you in a divorce. It's only going to get worse once he realizes you are serious and decides to get his own lawyer. \nLet him think you're not serious if that's what he believes and use that time to assemble your defense and your assets. Do not relish in his denial and dawdle, it will not help you in the long run.",
            ">(particularly all the lovey dovey out of character stuff)\n\nLove bombing. Nice.",
            "> He is trying DESPERATELY to keep me, messaging me constantly how much he loves me, making YouTube playlists of songs, sending me flowers etc. but it's all too little, too late in my eyes.\n\nHe's not trying at all.\n\nTrying would be getting a job, respecting your boundaries, and being polite to you.",
            "Sending lots of love your way. This was painful and difficult, but you deserve to be happy and this wasn't the way.",
            "I started dating my gf about 8 months ago. She was not skinny. She does have the most perfect, cute butt, ever. In the last 8 months, she's been stressed to hell and back about her new job. Her stress-eating is starting to interfere with her quality of life. When we started dating, she was about 120-ish. At a little over 5 foot, she was height-weight proportional. She has a scale and popped her 200lb mark about a month ago. \n\nI don't care. I love her laugh. I love her look, the one she gives when I'm massaging her legs, feet, etc., like I'm doing just the right thing. I love the way we go out: she is on my arm, I'm overprotective and giving her all my attention.  She is the one for me. Her body is incredible, for all the extra 80 pounds gained since we started dating. \n\nWhy tell an internet stranger this?  You deserve to be loved for who you are. I know plenty of chubby chasers who would worship the ground you walk on. But you don't want that. Maybe for your rebound, but not long term. You need an equal partner. You currently have a rat of a klingon, sucking your life out of you. \n\nFind your Romeo, and the guy needs be romantic with you, not just when you're around.",
            "\\>I wasn't his priority in the first place but now that he is down on hisluck, it's just \"easier\" for him to move here and start over with myhelp.\n\n\\>trying DESPERATELY to keep me, messaging me constantly how much he loves me, making YouTubeplaylists of songs, sending me flowers etc. but it's all too little, toolate in my eyes.\n\nHe only cares now because it's hurting *him.*  You are not and never were his priority. In his world, you exist to be used. You are absolutely making the right decision!",
            "Good for you. He sounds like a toxic loser who will never admit when he is in the wrong. You should spend more time with your friends because they really had your back in this instance and helped ground your when he came crawling back. Before jumping into another relationship I suggest taking a breather to just reiterate what makes you feel happy and accomplished.",
            "if you are in an apartment or rental property make it clear that you have left your abusive husband and he is in NO WAY ALLOWED ACCESS to your residence.  you don't want to come home from work and find that someone let him into your new place...keep yourself (and your dog) safe.  the sooner you file for divorce, the better since credit card debt is marital debt in some states (friend's ex roasted her credit rating)",
            "Good on you!  You are on the road to freedom!  Take time to learn to enjoy single hood.  One thing I’ll say as a fellow plus size woman, there are men out there who find you attractive and will love the heck out of you.  Never accept less than a man who makes you feel beautiful and wonderful.",
            "wow, good for you! you're still so young and you might have just saved your own future by getting out now. you should be really proud of yourself.",
            "Love bombing is a term you should familiarize yourself with. Good for you for taking control of your power.",
            "Good for you girl my DMs are open if you need to talk through things, I've been through divorce too and it can be a whole thing. \n\nWay to put yourself first. I'm happy for you",
            "there is nothing than makes me more happy than a  woman finally realising her worth.",
            "I'm  so happy for you OP and very proud of you valuing yourself you deserve to be loved and respected,  but don't let him bother you anymore,  block him and when it's  ready serve him the divorce papers or he will keep tormenting you",
            "You are SO young with so much ahead of you!! I am glad you’re getting out when you are!",
            "You go girl. You should be proud of yourself. You will be way better off once he is out of your life.",
            "Girl, fuck YES. You are 28, successful, and have a huge heart. You are so much better off and I am so happy that this was the outcome of the update!",
            "Well done on standing your ground! You won’t regret this.",
            "I am proud of you.  You are worthy, and I'm glad you are finally seeing that.  Best of luck to you.",
            "I didn’t read your previous post but I guessed from the title that he has problems with porn. Those men aren’t worth it- take it from newly single me! You don’t need him.",
            "*Internet hugs and external validation*\n\n>he said, \"I feel like I have to watch it to get turned on to have sex with you\"\n\nI actually gasped out loud at that. That is utterly horrible, there's no way to spin it. That he was lying about the having sex part shows he is negging you, being negative and making you feel 'less than'. It's a JustNoTactic used to make the victim feel like they are lucky to have the POS and need to prove that the POS is wrong about them. They suck. I am so sorry.",
            "Stay strong, you are nearly there.   His problems aren't yours anymore, and thank goodness.",
            "Just came here to say well done!! And you DID lose weight. A tonne of it!! You’re one man down, good for you 👏👏👏",
            "You should be proud of what you’ve done so far. \n\nYou should also stop putting off your decisions until “next week.” You’ve already made your decision. Now take the necessary actions. It’s painful, but you won’t be able to heal and move on until you do.",
            "Good for you for staying strong! You definitely deserve better and you’re still young. You have plenty of time to focus on yourself and better your own life and potentially find a new partner down the line. Good luck OP!",
            "Many well wishes to you and your future. Don't ever be afraid of being alone, from the looks of it, he's already shown you that you'd be completely fine without him anyway. Plus it sounds like you have a good friend for support.",
            "Yessss, it shouldn't take the threat of leaving for your partner to show they care. If they cared it wouldn't have come to this and if it's only under duress it isn't genuine.",
            "Stick with it. Your conversation read WAY too similar to what my memories with my ex were, and that was the best decision I ever made for anyone - I think, even including him.",
            "Thank god you’re free of this dumb asshole!",
            "Girl we are proud of you. You deserve better. So much better. You deserve to be happy.",
            "You mention not loving your weight, and fair enough, we all have things we don't love but you listed a ton of amazing qualities that I hope you're giving yourself credit for: \n\n1) High achiever, you were asked to apply for a great job and got it.\n2) You were willing to try not only a new, presumably more challenging job but have a go of it alone in a new city.\n3) You owned that your current situation wasn't working for you, reached out for feedback, took it, and made a huge change!\n\nMotivated, gutsy, honest with yourself - these are awesome qualities, know that other people see these in you.",
            "Well he's a real piece of work!  Op, idk how you stayed with him for so long, but I'm glad you're breaking free! Love yourself and continue to enjoy your own company! The rest will fall into place before you know it! Be your own peace. WHOA! I just read the ages! You are still in your prime honey. ENJOY!",
            "Wow!  This reminds me of my friends. One was the husband who, whilst possessing good intentions, refused to grow up and support his wife (my other friend). Years of no support and impossible situations pushed her to a place where the relationship was irretrievably broken. She tried to engage through the years and he refused. Once it went too far for too long, it died. He woke up to this fact at the end and desperately tried to reconcile, to fix, to nurture, to save. But it was too late. He waited too long. I suspect  he’ll always regret it and he subsequently fell into a downward spiral. She, on the other hand, became stronger once the cancer was removed from her soul. \nYou sound like a fair and loving person. This sounds like it’s gone too far to repair. If so, hold your head high and be proud that you literally did everything you could to make it work even when it was killing you inside. Nobody can fault you, tell you you gave up or didn’t care or didn’t try. People like you make me think that maybe, just maybe, this world might be salvageable.",
            "Given that you have been separated for so long, I wonder if you can get an annulment?  I’m not a lawyer/etc, but if so, might make this easier.",
            "Congratulations on leaving a relationship that was hurting you! I know it's hard, but you're doing great and I'm happy for you!\n\nWhat you said about being worried about being alone resonates with me, and I have some advice to offer that has helped me. For me a lot of it came down to not enjoying my own company, comparing whatever I was doing with the idea of the great things I'd be doing if I was with someone else. I needed to develop a relationship with myself where I did things that I enjoyed so that being alone was a positive baseline, and I wouldn't overextend myself for company that wasn't worth it.\n\nTo start, I prioritized spending time with myself. Then it wasn't a fallback, it was a choice. \n\nSecond, I made a list of simple things that I enjoy or always wanted to try, especially from when I was a child. If I wasn't sure what to do with myself I would do something from the list.\n\nThird, I thought of developing a friendship with myself in some ways as parenting my lost inner child or a feral animal. That was helpful to me, your mileage may vary, but viewing the parts of me that were skittish and hurt in that way would bypass all the internalized judgment. \n\nGood luck, may you have many happy days ahead of you.",
            "You sound like a talented, smart, and lovely person who is already successful at work and surrounded by friends who love her.  Get rid of that man who treats you badly and is too stupid to appreciate the amazing woman he married! \n\nShine on, you star! ☺️",
            "I’m very happy you decided to end things. He doesn’t deserve you in his life. I have a feeling once the divorce is finalized, that’s when you’ll really start to get living. Im so excited for you! Make sure to a class, snd do something you enjoy ❤️",
            "❤❤❤❤\n\nI  just came here from Mark Narration's video about your story. \n\nSo happy to see you're out of there. I can't believe he would say he had to watch porn to be able to have sex with you?? Even if he did initiate after that's fucking awful. Even weirder that is what he thought to say but clearly wasn't true? No one deserves to hear something like that. What a POS. I hope you're able to get some counseling or therapy because you seem like a kind person and I'm sure you have a great deal to offer a future partner and yourself. \n\nKeep it up OP!",
            "Speaking from what I’ve seen, you can’t change selfish people, even if they weren’t always that way it’s not on you to change them. Also if he gotta focus on porn instead of you to get by that’s a bit of a concerning situation.",
            "A relationship requires more than just love. It’s gotta actually work. When it doesn’t, love will never make up for it, and that’s hard, but it is what it is. Take care of you’re self.",
            "What’s wrong with young women marrying to then turn around and be like we need a divorce. My twin sister is going on 27 and divorced twice it’s like so they just wave enough money in your face or something ? Now moneys gone so you’re onto the next? Cmon girls stop fucking yourselves over !",
            "[removed]",
            "It sounds like the relationship he was having with his side piece ended as well, so now he wants you back.",
            "I don't blame u he's ten times your age mayb next time find someone way closer to your age it does matter sometimes"
        ]
    },
    {
        "post_id": "egqwcp",
        "author": "nciscokid",
        "title": "UPDATE: I [31F] am having trouble trying to decide whether I should feel guilty about not wanting to take vacation time for my mother [62F]",
        "url": "https://www.reddit.com/r/relationships/comments/egqwcp/update_i_31f_am_having_trouble_trying_to_decide/",
        "score": 2133,
        "num_comments": 76,
        "created_utc": 1577540718.0,
        "selftext": "[Original Post](https://www.reddit.com/r/relationships/comments/e966ad/i_31f_am_having_trouble_trying_to_decide_whether/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf)\n\nEdit: thank you to everyone for your responses - the good, bad, and in between. I didn’t expect this post to receive much attention at all, so I’m blown away. As we go into 2020, I wish you all the best in navigating and relationships in your life that need a little bit of TLC. I can’t promise responses to all, but will do my best. \n\nTL;DR: I devoted my entire therapy session last weekend to discussing my mom. Trying to set healthy boundaries. She got engaged on Christmas and hasn’t told me yet. Guess it really is a one way street. I don’t feel guilty about not wanting to spend time with her.  \n\nAlthough there wasn’t a clamor for an update, I wanted to let those that commented know I did indeed discuss with my therapist on the 21st, and it was a doozy of a session. She told me it sounded like a one-way street in terms of my mom never being the one to contact me, I’ve always been her emotional support, and I cared so much but wasn’t getting anything in return. \n\nIn fact, she recommended I start defining healthy boundaries immediately, but I decided that Christmas would be the worst time to start testing those waters. So I compromised with myself and sent her a Merry Christmas text, which she reciprocated but didn’t attempt to continue the conversation. \n\nWhatever, right? I just let it go and thought that was that. \n\nNot exactly. I don’t get onto Facebook but keep a profile so she can still tag me in inane memes and status updates. She knows this, but I always have to remind her when she sullenly asks me why I didn’t like her last post. “But I’m your mooooommmmmm!”\n\nI find out at 9pm on Christmas night that she’s engaged. But she didn’t tell me - nope, my stepmom texted me to ask about it, and I was floored. It sort of opened the floodgates and I went from “I don’t care about her contact” to “how could she care so little about me?” in seconds flat. \n\nIt’s 3 days later and she still has yet to reach out to me about her engagement, but I did creep on her Facebook and she made a post about “being so happy her kids (my siblings) were there to see it”. To her knowledge, I’m still in the dark. Now, she DID send me a FB message/video about 2 hours ago, but I’m ignoring it and won’t be contacting her at all until she decides to text or call me about her life update. \n\nBasically, I no longer feel obligated to feel guilty for not going to see her. I clearly don’t rank high on her list of important people, and I’m not going to try to make that happen so she feels like a better mother. I’m looking forward to taking all of my PTO for myself and no one else.",
        "permalink": "/r/relationships/comments/egqwcp/update_i_31f_am_having_trouble_trying_to_decide/",
        "comments": [
            "I'm very proud of you for being able to let go of your guilt. You deserve a life free of feeling guilty about things that are not your fault. \n\nOnwards and upwards :)",
            "[deleted]",
            "Wow. My dad got engaged and posted a video of it on Facebook. I found out on the toilet, after all our extended family had already liked and commented, despite the fact that *I lived with him* at the time of the proposal. Didn't see him for 3 days, he and his new fiancée opted not to return any phone calls or texts from his children during that time.\n\nThe fact that your siblings were involved makes it suck even more. I'm so sorry you're dealing with this.",
            "If you ever do go visit her, get a hotel room or airbnb so that you can choose when to see her and when you get to see your friends. That way she won't be able to hold you hostage like when you stayed with her.\n\nAlthough, if this was me I'd give her a good few years to miss me and I'd delete my facebook if the only reason you have it is for her. I'd also put her on an information diet and quit contacting her first completely. Only answer her if she texts first and only if you actually WANT to answer. Treat her like an annoying acquaintance, which she basically is at this point.",
            "Delete the video.  She wants to suck more emotion out of you.  It is likely the proposal.",
            "I mean.... Was she trying to get you to visit over Xmas so you could be there for the announcement?  And you refused?  So she is understandably pissed and not going out of her way to reach out after being rebuffed?   \n   \nI know there's decades of other stuff going on here, but you can't choose the moment you cut her out of your life to become pissed that she isn't making you a priority on her big day.  Being angry at her for not including you brings you down to her level.   If you really wanted a more distant relationship you'd say \"great\" that she sent you a Facebook video of the announcement.",
            "You are doing great by looking after yourself. Take care of yourself x",
            "I'm sorry-I'm sure that was a hurtful moment of clarity for doubt also-congratulations-you now have that clarity and can live your life accordingly-go have a ball on your two trips! Where are you going?",
            ">I find out at 9pm on Christmas night that she’s engaged. But she didn’t tell me - nope, my stepmom texted me to ask about it, and I was floored. It sort of opened the floodgates and I went from “I don’t care about her contact” to “how could she care so little about me?” in seconds flat.\n\nIt takes time for therapy to work. It takes time for you to change your thoughts. You can't expect in 4 days to have changed your mind completely. You'll get there one day.",
            "this must be heartbreaking and eyeopening at the same time. it's good you are out of the FOG. do you keep a diary? it might be good to write down how you feel. that way you can vent and you can reread it if you ever feel guilty again. it's a big thing to ask from your daughter, to travel a 1000 miles every year. luckily you live this far away so you can go low contact very easily. every time you contacted her let her be the one who initiates the next contact. also if you go over there it might be a good idea to stay at a hotel instead of in her home, this way you only have to see her a limited time and you can visit other friends and family. if she whines about it let her whine but don't stay to listen or react. I'm glad you have therapy and won't have to do it alone.",
            "My mother did that about 10-15 years ago. Technically she still hasn’t told me, hid the whole thing (easier then with less social media and she was overseas) and we haven’t spoken since shortly after that. Sometimes people aren’t going to be who you need or want them to be, even if you keep your standards low.",
            "Am I the only one who considered she wanted to tell you in person she's engaged? Maybe even meet the future husband?",
            "Reading your original post reminded me so much of a huge fight my own mom and I had just a few years ago. You and I are around the same age as well.\n\nI live on the East Coast, and at the time my parents were out west. I had planned a vacation to visit my best friend, who had also moved to the West coast, and in short, my mom was pissed that I didn't include her on the trip. The worst part was that I had tried to and even offered to pay for her transportation from CA to the PNW to spend a few days with me. I had also already made two trips to see her and my dad in recent years, but they didn't return the favor. At the last second, as I was on the phone trying to coordinate flights, she told me she needed to cancel. Then later, once I was on the trip and enjoying time with my friends I started receiving passive-aggressive phone calls and texts about how much fun it looked like I was having, which ultimately devolved into a huge fight wherein she told me what a terrible, selfish daughter I was for not including her. Mind you, I was 26 at the time of this argument and had worked really hard to make this trip happen, not to mention my parents were the ones who chose to move 3,000 miles away when I was 20.\n\nMy parents recently moved back to town (like 2 months ago) after nearly a decade away. Like you, I had abnormal boundaries with them growing up, and these days the bulk of my sessions with my own therapist center around my mommy issues. I'm now relearning how to navigate my relationship with my parents with this strange dynamic of me being on my own all these years and them suddenly being back in my day-to-day life.\n\nIf you ever want to talk, feel free to message me. It seems we have very similar stories as well as issues with our mothers. I wish you the best of luck as you work to establish some much needed boundaries. All the best.",
            "Let me tell you about my mom.  She was very abusive to me when I was growing up.  Once grown she only contacted me when she needed something.  She has had very little to do with my children.  Oddly she acts very different around her grandchildren than she did around me when I was their age.  \n\nA few years ago I found myself calling her every day it every other day checking on her and seeing if she needed anything.  She never answered my calls.  She would wait sometimes weeks to call me back.  When she did call me it was only to get me to do something for her. She never asked about me or my family.  I finally decided that I was giving her too much power in my life.  I quit calling and quit giving her any effort to maintain our relationship.  It took a month before she was asking why I wasn't calling her more often. I was truthful.  I told her that having to leave a voicemail everyday and never getting a call back told me that she didn't want a phone call so I'd not be calling and checking on her anymore.  \n\nMy life is much better with less contact.  The only time she calls is when she needs something so that hasn't changed.  Now I just don't worry or fret over her not calling me back.",
            "A Merry Christmas text does not exactly scream communication. A simple phone call along with what is new in your life to her might get her to open up. And a different therapist might provide better insight as to what is happening with different options to resolve it. Your mother does not matter in the long run, your mental health does. Part of good mental health is being able to say that you tried your best and she did not respond. Enjoy your PTO time.",
            "My husband's relationship with his father is the same. We found out on Thanksgiving that he hosted a bunch of people and did not invite my husband or our family.  Ok.  It always stings, but my husband knows where he stands and that there is nothing there now, so he has stopped looking for it.",
            "I really appreciate this update! I'm glad your therapist gave you some good advice and perspective, and I'm so sorry your mom is like this.",
            "This is my family. I was raised with this \"family first\" mentality but when it came down to it my parents nor my sibling put me first. It was always their lives and then me, which is honestly healthier. I should be able to make my own choices without being made to feel guilty for not thinking of family first. They do so why can't I?\n\nI changed this narrative for my daughter though. I told them so long as they aren't using us and trying to bring harm to our family, their lives are their own and I'm not going to be hurt if they choose to move or not be at home for the holidays. The only time it's not their lives is of it directly impacts ours negatively. That's where I draw the line.",
            "I feel like you would benefit from reading about the Grey Rock approach via google. I feel like you're doing things that are accidentally feeding into her drama. IMO the lowest drama way of dealing with this would have just been to called her when you found out or send her a congrats text. Right now it seems like you are building up for a blow up and she probably wants that to happen.",
            "[removed]",
            "Book recommendation: “Adult Children of Emotionally Immature Parents.”",
            "My heart breaks for you. I know what it's like to constantly give in a relationship with a parent only for them to completely drop the ball in return. Whether she's a selfish shit or not, she's still your mom, and it hurts so much to realize that you are not a priority to her. I'm really proud of you for putting yourself first and dropping the rope with your mom, but I know it isn't easy. If you ever need anyrhing, feel free to PM me.",
            "In my experience, you’re at the age where people start to examine their parental relationships as an adult. You’ve likely already determined which of your siblings you want to keep close or “less” close. But the parental bond is stronger and in the absence of serious abuse issues it takes a few more years to define the boundaries of your adult relationship with parents. Guilt shouldn’t be an issue with your parents anymore. They’re not worried about what’s on you mind or trying to make you happy anymore. They’re busy building a future based on doing what makes them happy and saving for retirement. You should make decisions based on what’s best for you, you don’t owe them anything. The beauty of being an adult is you can stop doing things you don’t enjoy, unless you have children. Lastly, FB, texting, snap or whatever are great for brief exchanges of information. But when it’s important/emotional convo’s do that in person ideally or on the phone. You can never be sure a message you convey through text or email will be understood by the recipient the way you intended.",
            "Good for you. You're the only one that can protect yourself from this Narcissism, and you deserve better.",
            "Hell yeah! Good for you. Sorry your mom kind of sucks.",
            "My mom sounds very much like yours. Self absorbed, unconcerned, even unloving. I literally only go see her (mind you its only like two hours round trip) when I absolutely have to. Basically when my sister doesn't want to go alone. I didn't even wish her a happy christmas. I couldn't be happier. \n\nWhat I'm trying to get at is that 'family' isn't everything. If you don't feel like this is a healthy relationship for you, and she isn't willing to work to improve it, there is no law saying you have to be a part of her life. \n\nI'm proud of you for setting boundaries and sticking to them. It's hard, especially with parents. But you got this. I believe in you.",
            "You don't even need an awful example of her behavior to validate your dislike for time with your mom - some people are just at a negative lovely place in their lives and that's not your burden. \nYou made the right call regardless of  whether she shared her engagement update or not; now you just have an extra data point to keep in mind about how she prioritizes you in her life so you can better prioritize her in your own life. You need to come before her and that's healthy, and also a pattern it sounds like you're trying to learn.\nThis story is almost identical to mine up until my relationship with my mom imploded over my unwillingness to break my boundaries. I remember wasted PTO, feeling trapped and needing a vacation from this\"vacation\" of carrying her emotions and putting up with her filthy home and animals for the few days between the annoying airports and uncomfortable, but somehow incredibly expensive airline tickets. \nIt's weird but the further I get away, the healthier I'm becoming. Still in therapy since I want to yell at her for being the worst. Someday I'll love her through it all but I'm not there yet.\nGood luck.",
            "This post fills me with hope for my own relationship with my mom. Thank you for the update. Also always be ready to feel waves of independence and residual guilt. It sounds like you've got this on lockdown, nice!!",
            "Sounds exactly like my dad. Going as little contact as possible is a good choice, I can say from experience. Good luck! :)",
            "So you see your ~unpleasant mom once or twice every few years, she invited you for Christmas / her engagement, you said no, and you're taking it personally that you didn't get outside notice?  \n\nYou skipped her getting engaged because you didn't want to be there.  She's presumably holding that against you, and now you're holding her response against her.  That's a negative cycle that's never going to improve.  \n\nIf you don't like her, good riddance, I guess.",
            "Bless you\n\nBe patient and loving with yourself.  This is a big emotional step to take and even thought it's the right choice, and you know it's the right choice, you will likely feel weird about it and maybe even question your decision at times.  If you find yourself in turmoil, be kind and loving with yourself and talk it out with your therapist.  It isn't easy doing what you are doing.  We're all in your corner.  Hugs.",
            "\"The blood of the covenant is thicker than the water of the womb\"\n\nJust because she's your mom and birthed you does not make you obligated to care for her or about her life. She clearly doesn't care about yours. Good for you. Stop feeling bad.",
            "My mom had a tumultuous relationship with her mom (my grandmother) and often feels guilt about not being there for her, esp by other family who don’t know the full story, but really, she had to do what was healthy for herself. I feel like this is what you are doing now and it’s tough but ultimately it will be better for you. \n\nSide note, I’ve had both of my divorced parents get engaged/married without telling me so that’s also a whole thing... I’ve mostly moved past it now but it really did bother me when it first happened. Parents acting like kids...",
            "I’m so sorry you’re dealing with this. Unfortunately your mom has made it clear that it’s not about you and never will be. It sounds like she doesn’t have the ability to care for your feelings... not an excuse but is a change in expectations. \n\nHave you considered deleting your Facebook? You said you only keep it for your mother. Why are you making concessions for her feelings or convenience when she’s not doing it for you? I would strongly consider closing that path down and starting with that boundary.",
            "If not going to see her is causing this much anxiety then go see her for a day or two and then leave. Spend the rest of your time doing what YOU want to do. If she asks why you have to leave so early, make up a training seminar or something you have to attend.",
            "I am learning that this whole thing about family relationships are the most important relationships you will have is complete and utter bullshit. Just because someone is physically capable to produce children doesn't make them a good parent..... In my experience don't feel bad for putting your health (mental and ultimately physical) first. We don't owe anyone anything.\n\nMy Christmas example (apologies for the length):\n\nThis is the 3rd or 4th year I haven't been home directly over the holidays due to various reasons (work, personal life/health, money \\[costs at least double the usual $600 return trip per person\\]). I called Christmas day just before dinner time (when my baby brother messaged me that they had gotten there) and because I was out walking my dog it took me 10 minutes to call so when I finally did they were just about to sit down to eat dinner so I told them give me a call when they were done and I started making dinner for me and my hubby (we had a quiet day in just the two of us).\n\nSo they call bout 10 minutes before our dinner was ready so I let them know but chatted with them anyways.... During this call (precious minutes to any normal person) all my family (my mom, dad, older brother, younger brother and his wife) got into an argument for 3 minutes about whose pop was sitting on the coffee table and all of them forgot I was on the phone..... Finally my Dad piped up and reminded everyone I was on the phone..... \n\nThis isn't just a one time thing.... Unless I am talking one on one with my parents (over the phone) this is common and reoccurring....",
            "[removed]"
        ]
    },
    {
        "post_id": "glwmns",
        "author": "AfraidEast7",
        "title": "I accidentally exposed my friend for wearing wigs and have put her in the position of either lying or outing herself",
        "url": "https://www.reddit.com/r/relationships/comments/glwmns/i_accidentally_exposed_my_friend_for_wearing_wigs/",
        "score": 2132,
        "num_comments": 232,
        "created_utc": 1589785685.0,
        "selftext": "Background: My best friend of 9 yrs, we'll call her Lola, (20F) and I (20F) are quarantining at our apartment together. .She's trans and has had trouble growing her hair out, so she wears wigs. She has some really cute ones in other colors that she wears for fun and stuff, but she has a standard everyday wig she wears most of the time. \n\nLola never got the traditional girly childhood, so we've been making one for her in quarantine. We built a fort in the living room, have been making friendship bracelets, playing summercamp-style games. It's a lot of fun!! Last week, Lola mentioned to me that she wanted to start a quarantine diary so that she could document her experiences for future generations. I actually thought it was really cool, and then we got on the topic of journaling and I told her about my first diary - one of those flismy lock diaries that every girl had as a kid.\n\nWe bought matching ones as part of our \"give Lola her childhood back\" crusade. They took a little while coming in, but we got them on Friday. Saturday night, some of our friends from college decided to do an impromptu girl's night in. Lola was in the shower, so I answered the Zoom without her. \n\nSide note: Lola is NOT out to anybody at our college and I respect that. This is her fresh start and she has a right to decide when she wants to come out to these people, if at all. I know I wouldn't 100% trust some of the people at our school with something as personal as this.\n\nWe were talking about what we've been doing in quarantine and I mentioned that we had gotten the diaries. I said it was for the nostalgia and they wanted to see the diaries. We left the box in Lola's room, so I went in to show them. Lola and I go into each other's rooms all the time - we're basically sisters to one another, and it's just about second nature. When we were younger, we had keys to each other's houses. I didn't think anything of it.\n\nI flipped the camera to show the diaries and didn't flip it back. I got distracted by a cute choker on her dresser and forgot that the camera was flipped/there was anything to hide. They knew Lola has worn wigs out to parties/the club/etc. but her everyday wig was right out in plain view, and one of our nosier friends asked what the \"new wig\" was. I completely bluescreened and someone else realized that it was Lola's hair. I genuinely had nothing to say. They were asking why Lola wore a wig and I had no explanation. I didn't want to out her.\n\nSomeone else came to the conclusion that Lola must have cancer or alopecia or some other horrible thing that causes hair loss. They've decided that she was just too embarrassed to say, and they all started going on about \"poor Lola\" etc. I just didn't know what to say and I said it wasn't my place to confirm/deny. I hung up and immediately told Lola. I apologized profusely, and I know how badly I fucked up. I feel so guilty about it. But, understandably, she's upset.\n\nNow, she's being forced to decide whether or not to out herself. Lola, understandably, doesn't want to lie about having some serious disease and people are already trying to \"show support.\" At the same time, though, she doesn't want to have to come out. I don't know wha tto do. I want to support her, but she doesn't want to even see me right now.\n\nTL;DR: I exposed my friend's wigs and have put her in a tough spot. What are good ways to help and support her? Should I try to do damage control and tell people to just butt out? What good can I do in this situation?",
        "permalink": "/r/relationships/comments/glwmns/i_accidentally_exposed_my_friend_for_wearing_wigs/",
        "comments": [
            "Honestly just say what you did here - she wants to have long hair but struggles to grow it out. That's the truth and she doesn't have to deeper than that",
            "One of my friends has a pixie cut deliberately so it's easier to put on all her fun wigs! She has dozens. She can just say to your friends \"oh it's a pain braiding my hair up under it so I keep it really short and just wear my wigs.\"\n\n\nThat's if she wants to explain herself at all, she has no obligation to. \n\nYou're a good friend, OP. Remember to force the \"obsessed with one particular animal\" phase into your childhood recreation. Every girl goes through that phase. My best friend had dolphins, and I think everything I owned had a tiger on it for about two years straight! She's gotta pick an animal and obsess over it for a bit. I don't make the rules.",
            "I agree with other comments saying Lola should be honest that she wants long hair but struggles growing it out. I want to add that the key part of this delivery is to be totally nonchalant about it. If Lola is just like \"oh ya those are my wigs, my damn hair is so thin, what did you guys have for lunch?\" It'll hopefully be glossed over versus making a thing of it. And you can always be honest and say you froze up because you weren't sure what Lola would want you to say. I appreciate so much that you're giving Lola the childhood she never had and I'm sure she does too.",
            "Wearing wigs is quite popular with models. How do you think they go from a dramatic short bob to long healthy hair. Kylie Jenner has an entire wadrobe of wigs\n\nLola doesn't have to say anything other than she likes long hair and is currently grown a short cut out",
            "Honestly I'd just say she has trouble growing her hair long and likes long hair so a wig is easier than extensions. You messed up sure but it was an accident, you seem like a really good friend so don't beat yourself up too much about it!",
            "A pretty good explanation would be or say 1. She can’t grow her hair out well and 2. She doesn’t want to damage anything with hair dye. Just likes to switch things up and have fun with different hair types.  that puts her in the spot to own it as a stylistic choice",
            ">we'll call her Lola\n\nEither you're really cheeky or I'm really old.",
            "First of all, you sound like a great friend to her, and I love hearing how much support and positivity she gets for you and her friends. It’s amazing \n\nAs for the hair, if you explain to her how it was an accident, and how sorry you were hopefully she will understand. From there, help her to figure out how she would like to tell them about this topic. Ask her if she would like you to clear it up, or if she wants to do it on her own. \n\nOther than that, continue being your supportive self.",
            "She definitely doesn't have to out herself, I understand you're both panicking but that's kind of a wild conclusion to jump to. As others have pointed out, plenty of cis women wear wigs for the exact same reason Lola does. And frankly, Lola doesn't have to tell anyone about why she wears the wigs. If anyone has the gall to ask \"So do you have cancer?\" then obviously she should put the record straight, but frankly Lola's reasons for wearing wigs is none of anyone else's business, so let them assume what they want. Your friends will forget about it soon enough.",
            "There's a third option: Tell them she doesn't like her natural hair and wigs make her feel more confident without having to dye and process her natural hair. Tell them that her hair is thin, brittle, damaged, hard to grow, whatever you want, and that the wigs make her feel pretty, but she doesn't want to talk about it because it's a sore spot. Hell, she can even tell them \"because I like to\" and if they ask for more information she just can say \"it saves me so much time\" or \"you know that feeling when you take your bra off after a long day? I get that with my wig too\" or \"because I think it's cool.\" I've had tones of friends do \"weird\" things that when asked, just say something along the lines \"I like to, it's cool\" and that's that. She doesn't HAVE to tell people the truth, and she might feel better being reminded it's not just trans girls and cancer patients that wear wigs anymore. Look up Glam & Gore. A completely normal girl who in pretty much all of her videos wears wigs. Most celebrities wear wigs too: most of the Kardashian-Jenners, Rihanna, Cardi B.... I'm sure there's dozens more, but that's who I can think of off hand.",
            "You sound like a really great friend and I'm glad she has somebody so supportive as you.\n\nAs far as giving your friends a reason as to why she wears a wig she can always just say something like \"I just like to wear them.\" She doesn't need to have some reason other than the basic truth. She doesn't have to go on with a further explanation on why she likes to wear wigs. She can keep it as vague and nonchalant as she wants to. Also your friend group aren't exactly entitled to an explanation, they should respect her privacy even if she never addresses it.",
            "Wigs are SUPER common. Trust me. And honestly I wish I had the funds for a few good ones. It's no big deal, and your friend should really consider just saying, \"I'm fine, I just like to play with different styles since my hair doesnt grow as easily as I'd like.\"\n\nMany women and men use wigs to do just that, and to experiment with colors. Heck, I had a friend in high school that had several wigs of different colors because her hair couldn't handle changing as often as she would like.",
            "Want to start with you sound like a lovely friend.\n\nI get that you both panicked, but what’s wrong with keeping the answer simple and honest? She’s had trouble in the past growing long hair and prefers to use wigs? You might have already raised suspicions by acting frazzled and making it a bigger deal than it is, but that’s what I would go with.",
            "You are a lovely friend. Dont know what to tell you about the wig thing, but I wanted to make sure you knew that.",
            "Bad haircut?  Shaved it?  Shaved it because of bad haircut?  Shaved it because of stress/trauma/breakdown?  Bad dye job?  Shaved because of bad dye job?  Shaved because of damage from bad dye job?  \n\nKeeps it cut short because of easier maintenance?  Likes the low maintenance of wigs over real hair?  Likes the switch ability of wig life?  \n\nBecause none of your business other than I’m healthy, thanks?  \n\nI hope you and Lola can patch things up!",
            "I mean - without outing her as trans and not telling a lie like she has cancer or something, she could simply tell the truth; she's tried to grow out her hair multiple times, but it's too thin and it looks odd when it's grown longer than a certain lenght.",
            "I didn’t realize we needed reasons to wear everyday wigs. Seems like a weird question to ask someone.",
            "Women wear wigs all the time. Have you met black women? You don't have to have cancer to wear a wig, it's a normal fashion thing.",
            "I'm just going to parrot what /u/somechild commented earlier and tell you to delete this post if you don't want to inadvertently out her. This post got a lot of traction, someone is bound to find it. It's specific enough that it'll be instantly recognizable. What you described here is an honest mistake, but actually outing her when one of your friends finds this post is going to turn this into a nightmare for Lola.\n\nThere's some stellar advice in this thread! Probably more than you'll ever need to deal with this. Best of luck, and you seem like an awesome friend by the way!",
            "also, people can wear wigs just because they like to wear wigs. She owes them no explanation. That is an answer in itself",
            "People wear wigs just to wear wigs. No one owes any of your friends an explanation.",
            "Why should she justify anything? Just say that this is the look she wants to have and she wears wigs because she likes it.",
            "Yeah the explanation you gave isn’t gender specific. Many cis women try and struggle to grow out their hair. Just say exactly what you told us.",
            "I don’t really know what the problem is. Just say she wears wigs because she wants to. A lot of women wear weave and wigs, it’s really not a big deal.",
            "All the other answers are so good! She can just say she prefers wigs to her natural hair bc her natural hair is brittle or thin or something and she spent so much on products trying to fix it that she just bought a wig. Or that she just prefers wigs or can’t grow her hair out. The growing out thing is also perfect bc that implies that once she grows it out, she’ll stop, so when she suddenly has different hair when she stops wearing the wig they won’t be like wtf. \n\nOr, really, I think if she were to lie and say she has like female baldness or something, I don’t think that’s so horrible. OR she could say she shaved it to support a friend with cancer and ended up being really insecure about it? Idk. These are still all lies haha, I just wouldn’t blame you for wanting to lie. Lola’s peace of mind is so important and I definitely don’t think she needs to come out over this if she doesn’t 100% want to.\n\nAlso I second that you’re an amazing friend for being so supportive and honest with her!! Truly a treasure, I’m so glad y’all are friends :-)",
            "I know a couple who only wear wigs or hats, no one has ever seen their actual hair and no one knows why they do this, but it's no ones business so generally people don't ask about it.  \n\n\nI'd suggest saying what you told us, Lola has a hard time growing her hair out, so she prefers to wear a wig. It's the truth and Lola doesn't have to out herself.",
            "My grandmother, a cis woman with no applicable skin conditions, wore a wig for much of her teaching career until she got older because she's always had very fine hair that wouldn't even grow to her shoulders and she liked having long curly hair. I'd encourage Lola to tell the surface truth that she enjoys having long hair but struggles to grow it out so she wears a wig instead, just like somebody who has wavy hair may use a flat iron daily to achieve straight hair.",
            "my cousin is a cis woman and wears wigs because she has very thin hair. thats all she has to say to your friends",
            "You could say she buzzed her hair but missed the length so she's wearing a wig until it grows out. Or you could say she's trying out different styles. I knew a cis girl who would just throw on different wigs because she wanted a new look without the full investment of actually dying/cutting her hair. Doesn't have to be anything 'out' related.",
            "I mean, she doesn't have to mention being trans whatsoever. Having trouble growing long hair doesn't have anything to do with gender, so she can just honestly say that she loves long hair but is struggling to grow hers out so she wears wigs in the meantime. \n\nSide note, does she have curly hair? I know people with curls often have a harder time growing theirs out because it can be delicate and break more easily. If so...r/curlyhair plug to help her grow it out :)",
            "It's really not that deep. She is growing out her hair and wants it long so she's wearing a wig. Cis women do it all the time.",
            "Dude, she could have had a bad haircut that she hated. \n\n&#x200B;\n\nThe use of wigs is not that telling.",
            "Or just go with this: she bleached her own hair a while ago and it fell out. She started wearing wigs then and got hooked on them. Or her hair is still fried. But then I’d ask for everyone to please stop discussing it because it is very personal.",
            "Trust me, this is a small slip up more than you think. It is not as bad as it seems. She doesn’t need to put herself! Any gender can struggle to grow her. That sounds more like a genetics thing and it certainly isn’t alopecia. Some people tend to grow hair faster than others. All that needs to be said to nip it in the bud is that she prefers to wear wigs and that she prefers them because her hair isn’t as long as she desires. Chalk it up to a bad haircut if you need to. There are a lot more reasons than you’d think. Also, it shouldn’t be that surprising since she wears wigs often and they are aware of that. \n\nTo add, I knew quite a bit of people that wear wigs themselves. Sometimes, I’ve never seen someone’s natural hair. It’s just their thing and I like that they have options on hairstyle lol. \n\nDon’t worry. You and Lola will be okay :)",
            "Depending on race, she doesn't have to out herself, \"I just find it easier to get the style I want this way. My natural hair is super curly / poker straight and wispy fine... no one can cut it or they charge a fortune... so I just crop my natural hair and wear wigs!\" \n\nI mean, if she feels comfortable with them later it can be an update, but I would go for a natural hair that is unmanageable - she can say no one else in her family has it so she never got styling tips then just change the subject if they want to offer tips etc she can deflect with \"But I was thinking of buying a new pink one, what do you think...?\"",
            "Why does she need to out herself as trans? Sounds like you've outed her wig-wearing-ness, but that's nothing to do with being trans. Most trans people don't wear wigs. I'm not sure how the two are forcibly related.",
            "7/8 years ago I had a wig due to losing all my hair to chemo, we did start a picture with miranda (that was the wigs name ) on her travels,  we took pictures of her on anything and everywhere , never be ashamed of a syrup,  she should stand up look fabulous and own and style that wig life !!",
            "It sounds like Lola was really invested in hiding her wigs, and maybe you were a little careless to show them, but it was an honest mistake. \n\nThese friends don't seem like they are negatively judging her for wearing a wig! It sounds like they are saying \"poor Lola\" because they think she must be seriously ill if she \"doesn't have hair\"\n\nI don't think she has to lie or out herself at all.  She can just say to the friends \"I'm not sick, my hair doesn't grow quickly so I wear a wig\"",
            "I wear wigs and I have 2 foot long hair! I used to wear wigs to have longer hair or different colors. Now I sometimes wear shorter ones to have shorter hair for a moment. \n\nI would make sure Lola knows there are many woman who wear wigs of all types for many many reasons. I think if she/you just said that she got a shorter haircut a bit ago and she just really wants her long hair back but it's taking forever to grow out, people would understand. If they don't that is their problem. I have worn a wig to get my \"old long hair\" back before.",
            "Issues that impact hair don’t have to be life threatening at all. I have a hormonal issue that causes very thin hair and don’t wear a wig daily, but do have a ‘topper’ to help fill in what I don’t have sometimes.",
            "She can just say she doesn’t have any disease or diagnosis, she just has really thin hair.",
            "I know a couple people that have multiple wigs just for fun because they like to have different styles daily. Some are colorful and different and others just look like standard hairstyles.\n\nI agree with other posters. Chock it up to it being something she enjoys and that's that. She can mention she has struggled growing out long hair too, because that's the truth. But I don't think she needs to feel obligated out herself because of this.",
            "A lot of ppl have bad hair for other reasons. U can make up a case of trichomania from childhood",
            "No need to explain anything - just brush it off like she likes to switch it up or something.",
            "When I was younger (6 or 7) I used to wear wigs because my parents had my hair cut into a bowl cut and I absolutely hated it. Once it grew out I didn’t let anyone touch it. It grew down to my butt. \n\nAs far as Lola’s hair goes, it’s not their business anyways, but if she’s worried about it, just simply tell them she’s self conscious about her hair and she’s having a hard time growing it out and leave it at that. She doesn’t have to out herself until she’s ready to come out.",
            "It’s hard to keep someone else’s secrets. Her decision to stay in the closet can have these accidental consequences, that are no ones fault. You handled yourself beautifully with love and honesty. It was an accident, but an accident that demonstrates that some things are inevitable, like the truth coming out. It’s not even that people are nosey, we’re just observant. I wonder if your friend has thought about the position you are in by having to keep her secrets. I think it would be a good idea to address this with her moving forward. Like if your other friends ask, or if people in general start asking, what one sentence answer should you give them? That way you’re not responsible for her secrets, and you’re not risking outing her. I have a feeling as time passes these situations will continue to arise.",
            "She could just say that she wants longer her but has trouble growing it out. A lot of women have that problem. I don't see what the big deal is with wigs anyway since so many women are wearing hair extensions",
            "Used to work with a cis gal that wore wigs for some personal reason I never fully knew. (I did know that she was cis because she told me, we talked about trans issues often.) She told me about it just on her own, but another group of friends found out after they went swimming together and her wig fell off.\n\nShe was super embarrassed but like . . . no one judged her or, to my knowledge, asked her about it much. I would generally expect that people aren't going to bother her much. If they do, they're weird and should be told to fuck off.\n\nAs for your relationship to Lola, give her a little space. You've already apologized. You might want to do so again when/if she starts talking again and you're getting a signal that she wants one. But if you overdo it, it'll just serve as a way to keep bringing it up and may seem like an attempt to shift focus to comforting your guilt. Once she's accepted the apology, move on--if you need help assuaging your guilt, don't try to get it from her, she's busy healing from betrayal, find it from another source. But *do* do other things to reinforce that you're her friend and want to support her (without drawing attention back to what happened).",
            "It’s kind of a lifesaver here that you kept it “no comment” and moved on. Hopefully your friends wouldn’t be so ready to make any concrete presumptions about Lola’s health let alone spread any news to others (I think [i hope] it’s a universally understood common courtesy that you don’t walk around telling people that someone has a disease)\n\nAs far as explaining that to Lola, it wouldn’t be very helpful even if the above is true and it ends up being not that big of a deal. It was an honest mistake that has now nudged her into the high- pressure decision making process of now figuring out what she wants to do. This may emotionally have been a dose of reality for her that’s now putting her in a pivotal place. However, you’ve apologized and that’s all you can do (not saying that that’s a bad thing), the best thing to do now is support her through her decision making if she needs you.\n\nEdit: yes, damage control would be a good thing to offer up right now. if you’re friends are “showing support”, tell them they need to be mindful of Lola’s privacy and that she will let them know if she needs their advocacy",
            "You could say she’s cosplaying as a character.",
            "For one.... Plenty of people in the world wear wigs. A good chunk of black ladies have \"fake hair\" in one way or another.\n\nMy sister, 20f white girl, has wigs and loves them. Her natural hair is thick, grows in good, nothing wrong. She likes having shorter hair to wash/dry, and wears a wig when she wants to. None of us question it. She even has a couple that look wayyyyy natural, her color just long long hair. \n\nAnd as so many folks have said.... \"I have trouble growing my hair to the way I want, so I wear wigs\" is a completely legitimate response. Anyone who doesn't accept that needs to go fuck off.",
            "Dude she can simply say she likes wearing wigs. I used to wear wigs all the time, lots of women do. There doesn't have to be some big mysterious reason.",
            "You can make hair grow faster by adding Rosemary essential oil to shampoo & massaging it into the head to stimulate the hair folicles.  To make it thicker, add coconut oil to hair & brush it through.  It takes 4-5 washes to get the coconut oil out properly.  Apologise & offer to buy the Rosemary essential oil & shampoo her hair for her.  That will be nice & make her feel like she's at a proper hairdressers, which she might not have experienced before.  Tell the friends she is growing her hair out.  That's it.  They don't need to know anything else other than the fact that she is not sick.",
            "Dear god why is this not deleted yet? You are going to FULLY out your friend.",
            "Maybe she should say \"I don't want to talk about it\" or \"it's difficult for me to talk about it at this time in my life\" something to this manner so that they keep a respectful distance around the topic and she doesn't have to answer any questions. At the same time I was thinking maybe some excuse from you like \"that was MY wig for Halloween, just kept it there\", or \"my sister and I play dress up sometimes\", idk sth like that could have worked or might work now if they're not certain it's Lola's?",
            "All she has to say is \"I don't want to talk about it\".  Or she has a hard time growing out her hair.  I was born as and identify as female and I can't grow my hair out well passed my shoulders, maybe I'll try a wig!",
            "i personally don't think she needs to worry about \"outing herself\" as trans. the truth is, the vast majority of transgender women do not really pass that well in real life. easier to pass on Instagram and the like but, studies have shown that humans are incredibly good at telling genetic males and females apart from eachother. like very good. there are a number of cues that you and I would never even consciously think of, but our subconscious mind is hawkish on. So chances are, its no big secret she is trans. she just needs to love herself and be comfortable with who she is.",
            "Moot point once a friend sees this post. Anonymous posting doesn't do much for such specific scenarios",
            "Some people do thoughtless things because they don't care enough or are too self absorbed to think about the consequences their actions might have. You on the other hand clearly care a tremendous amount and literally did just have a momentary lapse of thought. I do also understand Lola's pain and upset as she's obviously worked hard to keep the wig as her own private business and at the moment she's hurting because you let it slip so easily but once she is over the initial hurt and distress this will have caused her I'm sure that she will reflect on your friendship and support as a whole and will realised that not only was it a momentary lapse on you part but also how upset you are and how much you value her friendship and regret any upset this has caused. You sound like you have a strong friendship and I think you'll work through this together.",
            "One thing you should know is that you are an amazing and trustworthy friend and sister to her.  The only thing to do in this situation is to be there for her during this dilemma.  Try to help her decide what to do and how she will do it.  \nAs I saw with some other comments here, the easiest thing to do would be to just say it’s hard to grow out the hair because it’s naturally thin or something to that effect.  \nHope all goes well :)",
            "[removed]",
            "First things first; I would absolutely delete this post. PLEASE. As another trans person that would dread being outed if Im stealth, please delete it.\n\nI'm not certain if any of the other girls use reddit, but even if they dont I would delete this because of the chance you could out \"Lola\" even further. Even if you have changed her name, this situation is WAY too specific to not out her as trans if someone from this group or even your school who hears about this to not put two and two together.\n\nAside from that, I do want to thank you for being what sounds like an amazing friend and supporter to her. Shes going to be a little upset but in the end it comes down to something as simple as her hair is short and she misses having long hair. They will forget about it and move on.",
            "My wife recently shaved her head because she was tired of having damaged hair from all the times she would bleach/redye it. She now owns two wigs and its not a big deal. She doesn't have to out herself over something like a wig. Cis, trans, anyone can wear a wig if they want to. I'm sorry shes going through this, and I hope you'll be more conscious in the future. It was a slip and it sometimes happens. Just keep being a good friend.",
            "As someone who wears wigs only but has a ton of hair, if she isn't ready to come out she can just say that her own hair is too thick to handle or style every day, or that she got a bad cut once and it's difficult to grow out.",
            "Just wanted to say, you sound like an amazing friend. This was obviously an accident and it seems like you guys have been having a lot of fun reliving your childhood memories and helping Lola make her own!!",
            "It's no one's business why exactly she wears wigs, so as others have said, any explanation she wants to give is good enough. The truth is, she just prefers them over her real hair, and the deeper reasons behind that don't matter. Her friends really shouldn't make up theories just to satisfy their curiosity.",
            "Just say the truth. She wants long hair but she has trouble getting it to grow out",
            "All you or her has to say is that Lola finds it easier to manage a wig than growing out her hair, which totally makes sense. If someone told me that, I'd just be like ok wow smart, so you can just take it off when you don't want it getting in your way? Honestly to me as a guy if that's the reason I got from someone I would not have a second thought about it because it makes total sense.",
            "No need to address anything. It’s none of their business. \n\nYours was an innocent mistake and it’s great to see you two have this great friendship.",
            "‘I thought I would look great with a shaved head, so I shaved it. I was wrong.’",
            "She doesn’t have to explain anything. People wear wigs.",
            "I hope people come to view wigs as a much common and normal thing. A lot of cis women, who also have no issues growing hair, wear wigs just because it's easier and fun to change up you hair frequently without the damage or time and money.",
            "I've worn wigs and I have a full head of hair and I'm biologically a girl, she can just say she likes switching up her hairstyle while her natural hair grows out. I shaved my head once because I got a perm on top of dye which killed my hair, that shit takes time to grow too like I'm talking 8 years to get past my collar bones. She doesn't have to out herself or address rumours around whatever she could just never talk about it and they'll forget or not bring it up, or she could lie and say something like I wrote above which is my real reason for wearing wigs for awhile.",
            "Enough advice has been given so I'd only like to suggest some things I really enjoyed when I was a little girl: putting on cheap and chemically-smelling makeup for kids in all the wrong colours, watching Barbie movies, and all the kinds of crafting projects there are (bonus points for glitters)!!!",
            "One of the casual staff where my wife works likes to wear a wig. I've seen her without it, she has long red hair, and I've seen her in everything from blonde ringlets to brunette pigtails. She just... Likes to wear them. \n\nYou and your friend are seeing this as a make or break huge secret only because of how close you are to it. Take a step back and you'll see that \n\n1. It's nobody's business why she wears a wig at all, and; \n\n2. If anybody gets a reason, it can be any reason at all. Including \"because I like wearing whatever hair I like at a whim.\"",
            "Why don’t you just say you guys were so bored and you were trying on those bald masks actors use in movies?",
            "When I was 4 I outted my sister who has ectodermal dysplasia. I told one of her friends it was a wig because I was 4 and didn’t know it was out of the ordinary. You didn’t do anything wrong just like I didn’t. It was a mistake and if you are genuine in your apology and keep being a great friend, she will see that you are sorry.",
            "What? People wear wigs for all sorts of reasons. I have a collection of wigs and I am bald. Most people don't know because they either see me with a head wrap or a wig on which are all different. Some people have seen me with my bald head and a asked when I shaved my head. It's  nobody's business that she has a wig on.",
            "Im not trans and I wear a wig. Why? Because I want to. The end. No further explanation needed.",
            "I buzzed my hair off and I might just buy a wig until it grows back which a totally valid answer for her to give",
            "The good advice has already been left here so I just wanted to say recreating a girly childhood for her is the nicest thing and if I had a friend like you, I’d be so happy.",
            "Growing up, my next door neighbors had scarlatina fever. All of them had trouble growing hair...As others posters recommend that you say: \"she has trouble growing long hair.\" And you're too polite to ask why or if there is an underlying cause to that difficulty.",
            "What remedy would your *roommate* like?",
            "It’s normal to wear wigs these days",
            "Lots of women wear wigs for the same reason she's doing it - it's not possible or too hard to grow it out / you can't get the variety or quality of hair that you can with wigs. This does suck a little but hopefully she'll see that you didn't mean to do anything wrong and it's not a big deal in any case. <3",
            "She has a hard time growing out her hair. What’s wrong with saying that?",
            "I don't particularly see a problem? Even people with long hair still wear wigs. \n\nIt's her choice to where a wig and that's the long and short of it. There's no shame in something like that.",
            "I think just play it off and back her up like she wears wigs because she wants to and she looks fabulous doing it. She don't need your pity party -- she on fireeeee!!",
            "I agree with everyone saying just tell the truth: that she has short hair but likes to wear wigs until it can grow out. A female coworker of mine occasionally wears a cool wig just to change it up and everyone accepts it. \n\nIf you need to address with the friends why you didn't say that originally, you can just say that you weren't sure about her reasoning and didn't want to jump to any conclusions!",
            "You don’t need a reason to wear wigs other than. I don’t like my hair.  That’s it.  She should just say that. Easy peasy. More common than you would think.",
            "Just have her tell them she wears wigs because she got a bad haircut. One day she'll be able to grow her hair out.",
            "Just tell them that she likes wigs! Plenty of cis women play around with wigs too it's fairly normal.",
            "Literally SOOOOO many reasons for women to wear a wig other than being trans or having cancer. This was a shitty close call. You didn’t mean to hurt Lola and I hope she sees that.",
            "[deleted]",
            "Just say it's alopecia. Alopecia is not some horrible disease. It's just medical slang for baldness. It's literally a synonym for the word baldness which I would say is close enough to the truth that it's not actually a lie. Besides that some people here are saying to just say that she has trouble growing her hair out. That may be even better because it's even more vague. Don't feel obligated to give them details. The vaguer the better. Just to reiterate, saying somebody has alopecia is already very vague. It just means they're bald. Nothing more specific.\n\nAlso, she's probably upset because she would never make that mistake. Keeping this a secret must be second nature to her so even showing her room to people must be a big thing to her. Just show her that you care and want to make an effort too (which you've probably already been doing).",
            "Have you not seen any teen YouTubers lately? They’re all ordering wigs from Amazon to try and be an e-girl or some shit like that. You could just tell them you’re doing the same for fun or home video or whatever.",
            "[removed]",
            "As a trans person, I agree with most of the things said here. \nShe is feeling very vulnerable and on the edge of being outed, so the most important thing is to express that you are there for her through it all. Do not give advice unless she asks for it or you ask if she would like to talk with you about what she should do.\nShe is probably feeling a little betrayed, but I don't think you did anything wrong. It was an accident, and she will come to understand that. It was a great thing that you did not give an answer to the college friends, because then she has the choice to come out for herself if she wants to. \n\nAgain, the most important thing is that you explain to her that you are there for her through thick and thin. I recommend r/asktransgender if you or her are still struggling.\n\nDMs are open if you need to talk :)",
            "I agree with what everyone has said about telling as much of the truth as they need and moving on.\n\nBut, for the fun childhood recreations: You also need magazine \"posters\" on your walls of NSYNC/BSB/Britney Spears...or whatever their equivalents are these days. One Direction? Is that too old? Ok, it's clearly been awhile since my childhood, but that was a big part of my childhood. And stuffed animals. That all have names. And all have to sleep in your bed.",
            "One of my friends uses wigs, just because she likes to change things up and likes the feel of a shaved head. She can rock it all though. She could also say she was experimenting with different styles in quarantine and using the wig to help.",
            "Meh. I have some sensory issues and one of the things is that I'm limited in hair styles because when I sleep it drives me crazy to have my hair ends rubbing against my neck or face. So I always have my hair at a length that's just long enough so I can put it up in a scrunchy and the ends don't touch me. If I wanted a fancy hair style I'd be rocking the wigs. And I'd have to fess up about not liking to sleep with hair. \n\nOther reasons to wear a wig? Not liking to style hair in the mornings before work. It's nice to shower, towel dry, not have to use a hair dryer, curler, flattener, hair dye if you're going gray, all that shit.",
            "She doesn’t have to put herself if she isn’t ready to. She’s not happy with her hair growth, so she wears a wig until it grows out. It’s a fairly simple and straightforward explanation that your friends should take at face value",
            "I mean Lola or you could just say that she has short hair and is growing it out. That's the reason she is wearing wigs.\n\n&#x200B;\n\nI think you're adding her being trans for a reason that she needs to \"come clean\" for not only her wearing wigs (which you didnt quite innocently \"slip\" imo, but for her to come out as trans to a group who doesnt know she is . \n\n&#x200B;\n\nLola being trans and wearing wigs have no correlation.",
            "I don’t understand why she would have to out herself being trans over this. Does being trans affect hair growth? She can easily just say that her hair takes forever to grow and that she loves long hair and that she thinks wigs look better than clip ins. Not growing hair shouldn’t make someone suspect she’s trans.",
            "OP you are a good human. And your friend? Nah she does not have to explain anything to anyone because it is no one business. My best friend is a trans and I had no idea, so when she told me, I really didn’t care because I love her for who she is, and as far as I am concerned, she did not even need to tell me about that, as it is her personal life choice, I just appreciated the courage and the trust. BTW Wigs are a helluvalot of fun, and everyone should try one at least once in a lifetime!",
            "NTA, and I think you’re a really good friend."
        ]
    },
    {
        "post_id": "4nyugt",
        "author": "Hugbnkoplh",
        "title": "I [38M] am a sober addict. After years of not welcome me back, my family wants me back - I suspect they want money.",
        "url": "https://www.reddit.com/r/relationships/comments/4nyugt/i_38m_am_a_sober_addict_after_years_of_not/",
        "score": 2130,
        "num_comments": 323,
        "created_utc": 1465865380.0,
        "selftext": "I started using drugs when I was 17. I was mostly into meth but I tried various drugs. My parents decided to help me but like most addicts I struggled and made their lives difficult. There were times that I embarrassed them in front of people, I stole from them and from the rest of the extended family. I did a lot of wrong.\n\nWhen I was 23 they decided that they've wasted enough time and money on me so they cut me loose. It took me until I was 26 to get my act together and become clean. I went back to them when I was clean when they told me that they can't just take me back and forget about everything that I've done. They were right. I had to try to make things right.\n\nSo I stayed around but kept my distance from them. I started paying them back the money that I had stolen from them, and I paid that in full with interest within three years. That's everything that I stole from my parents and my sisters. I know it doesn't make it right but it's all that I could do. I kept sending them birthday cards and gifts, New Years cards, etc even though I wasn't with them at any of those events. Again, just trying to atone for the wrong I've done to them.\n\nYears passed, nothing changed. My sisters married and didn't invite me to their weddings. I still sent them gifts. When my niece and nephew were born I also sent them gifts. When I married my wife they didn't come to my wedding even though I invited them. When my son was born they didn't come to see him or to his birthdays after that.\n\nTwo years ago my father had cancer. I reached out and asked if he wanted to see me and offered my support. They all declined. It took them until my father was really sick to reach out. He wanted to finally see me. I went to see him in the hospital with my son. He was very sick and was more or less ready to go. He told me then that he regrets keeping me away and wishes that he'd accepted me back sooner. We spent a whole day together. We were full of regrets but we made our peace in the end. He died a week later.\n\nMy mother and sister told me not to come to his funeral. That I didn't deserve to be there. It was hurtful since my father and I had made our peace but I respected their wishes. The funeral is for those who remain and they had the right to not want me around. I went but remained in far distance and only paid my respects when everyone else was gone. That moment was a big deal for me. I stopped trying to have my mother and sisters back. I stopped sending them gifts or cards or anything. I had tried for 10 years and I decided that it's time to move on.\n\nWe remained no contact for two years until this last weekend. My mother called me and asked if I can visit them alone. I went there and my mother and sisters were there. We talked a little. They told me that they're willing to put the past behind us and look towards the future, that's all we have is each other, things like that.\n\nThe thing is, I got the feeling that they need money and help. They kept mentioning how difficult things are for them, how my sisters are both divorced and single mothers without \"great\" careers and how they struggle to take care of their children. My mother said similar things. They kept mentioning how great I'm doing and how amazing is it that I was able to turn my life around. I totally felt like I was being manipulated. For years I would have done anything for them to accept me back and now they were tapping into those feelings. They never explicitly asked for money but their requests were implicit. They said things like \"family should take care of each other\".\n\nSo I need some advice. I'm hurt that the reason they want me back is for money. I loved them and tried for 10 years and received no forgiveness when they didn't need me but now that they need me, I'm loved and great? What should I do?\n  \n**tl;dr**: During my times of drug use I put my family through a lot and they eventually stopped helping me. When I became clean I tried for 10 years to atone for my mistakes and they didn't accept me. They didn't allow me to attend my father's funeral. Now they tell me that they want me back and are implicitly asking for my help. What should I do? ",
        "permalink": "/r/relationships/comments/4nyugt/i_38m_am_a_sober_addict_after_years_of_not/",
        "comments": [
            "What you should do is... Not give them money.\n\nYes, you caused them harm but you repaid those damages years ago.  They refused to allow you to be part of your father's funeral even after you made peace with him.  It would have cost them nothing to permit you to be a part of that.\n\nI agree that they want money.  It's especially telling that they insisted that you meet them without your wife.  They still don't want to be involved in your life.  They don't want to meet your wife or child.\n\nDon't give them money.  Next time you're having a gathering (holiday BBQ this summer?), invite your mother, sisters, and their children.  My guess is they won't come.  They don't want to be your family, just your pensioners.  If I'm wrong, and they want a real relationship, keep money out of the equation (don't give them any).",
            "If they end up asking for money, say no. Their reaction to that should tell you a lot.",
            "Take it slow. Learn what they're after. If it's money, don't do it. Not allowing you at the funeral is a major major deal though.",
            "They made their beds man. It sucks, because i am sure that this is hurtful for you because you love them. That is evident. But seriously- look at the things you did, on your own, that were ignored for years. And then the deal with your dad- that was an awful thing to do, and im glad that you went anyway. He was your father too. That shit about \"family should take care of each other\"? You are part of that family. You always have been, and they have completely cut you out for years. No. They dont get to invite you back with open arms and empty wallets. That makes them seem like terrible people, and you have every right to be disgusted by them. I think you should write them a letter and lay it all out. Say you would love to be a member of the family again, but that you can not and will not offer financial assistance in order for that to happen. You paid back the money you stole, with interest. You spent years turning your life around and you did it on your own. You owe them nothing. ",
            "Addiction is hard. It is hard to beat, it is hard to deal with, and it is hard to survive. It is abusive to the person addicted and those around them. Addiction doesn't just stay within a small circle of harm, usually. It can destroy lives. \n\nGood for you. I am glad you are doing well for yourself. \n\nIt is time to let go of the guilt you felt. Everyone acted badly in the whole situation. So I would go forward like you would with strangers. They are new people and they do not instantly get to have your help just because they ask.\n\nYes, you love them, but have they honored your love? \n\nI get that you hurt them 10+ years ago, but they cannot keep blaming you while expecting you to just do nice things for them. That is not how it works. They should want a relationship with you, not your wallet. ",
            "Tread carefully and do not provide any financial assistance. You spent years trying to prove yourself to them to no avail until now. You're right to have your suspicions.",
            "I am a recovering addict with much less sober time than yourself. For a time, my parents and family had cut me off just like yours did. While I never stole from them, I was a constant drain on their resources - my parents bought me multiple cars (despite me totaling one after another), paid for my lawyers whenever I got caught with drugs by police, and then there were the numerous times they paid my rent or bills while I was in rehab or the hospital (I always went to facilities covered by my insurance, so they weren't paying for that at least).\n\nYou know what happened after I finally got out of jail and had found sobriety inside? My father picked me up and took me straight home for a family dinner. \n\nYour mother and sisters actions are horrendous. Even when I was still using and my parents were barely speaking to me they let me come to my Grandfathers funeral. Hell, even when I got married (high as a kite) to my junkie girlfriend, my parents came to the wedding. \n\nIf they were truly family they would have forgiven you years ago. ",
            "I had my Dad ready your post as he is a 25 year sober alcoholic. His words, \"Son I really feel for your situation and I want to let you know that even though you've done wrong in the past you have done a whole lot of right for the past decade. Your family was and is wrong to have cut you out when you were in a real hard spot. I advise you to not let them back in your life, the way they have treated you is inexcusable and it honestly sounds like they just want your money. ",
            "[deleted]",
            ">They told me that they're willing to put the past behind us and look towards the future, that's all we have is each other, things like that.\n\nThis seems extremely disingenuous to me. Like a cop out. \"We ignored you and ostracized you from the family for years even though you were working on yourself and proving you wanted to get better, but now that you've finally ignored us and moved on with your life we're maybe thinking it's time we forgive you.\" \n\nIf you ask me it's up to you to forgive them for the bullshit they did to you. they wouldn't let you go to your dads funeral, ignored your efforts to reach out, took your money and gifts without so much as a thank you or attempt to get together. They didn't even come to your wedding. I mean how much more of a \"fuck you\" could they have given you? \n\nI'd watch your back around them, they sound like shitty people who shouldn't be trusted. If it was me I'd just say they had their chance for 10 years and you've decided to move on. Focus on the people in your life that actually give a shit about you. ",
            ">They said things like \"family should take care of each other\"\n\nPft hypocrites. So did they only decide this when it became convenient for them?\n\nI would stay in (low) contact however I would make it clear that they won't be getting any financial help, since it feels like the reason they are willing to mend fences is because they only want to use you for money. If you give them anything, it would have to be a loan (signed contract included) and not to exceed $500 until the previous loan is paid off with interest. This is what they did to you, essentially.\n\nMy suspicion is that they also kept you out of the funeral because they were afraid you might try to claim something from your father's will (if he had one) and any further interactions around his death would increase the chances/likelihood of you inquiring about his will and seeking a share of the pie. I know it sounds dumb but greedy people do think this way when it comes to end-of-life and inheritances - a \"don't let them feel any more invested in the deceased or they'll ask about inheritances\" thing.",
            "Just say, \"you truly want *me* back, not money, right? Because I don't have any\". then see their reaction.",
            "> They never explicitly asked for money but their requests were implicit.\n\nSo play stupid.  Pretend that you don't have a clue what they're asking for.  At the very least, if they're going to ask you for money, make them do the heavy lifting; don't do it for them.",
            "Reconnecting doesn't have to mean all open access immediately, keep yourself guarded. It's a shame that when the reunion happens, that this is you first impression. Proceed with caution. Slowly. And now might be a good time to solidify your position on lending money or giving money, just so you know where you stand should you be approached.",
            "This is a heartbreaking story. I understand cutting a kid off until they are sober and turned around, but to hold you responsible so many years later for youthful follies, is by far, in my opinion, worse than what you did. As a parent my heart hurts for you. Let me know if you want to be adopted;  I don't need money.",
            "If you decide to reunite with them, I would be very very careful. They sound very cold and unforgiving. Your instincts about their motives are probably correct, so if you start seeing them they might hurt you again by trying to use you. \n\n>What should I do?\n\nYou could tell them that you agree that \"family should take care of each other\" but by cutting you off for 10 years you don't feel cared for. You would be willing to meet with them a few times and see how it goes, but you are saving your money for your wife and your son and you cannot help them financially. Then hold the line, and if they stay close and loving then you can perhaps start to trust them again and be family.",
            "Seems like some great advice in here. All I can say is good on you. You don't hear of people getting out of meth very often. You sound like you did it, did it right, and even went above and beyond what many people would have expected. \n\nGood fucking job. ",
            "I am tired of family treating each other as ATM. My mom is like that to me and I feel sick. I don't mind sending her money but I don't like it when she acts like it is my duty. I have been sending her money each month more than 20 years. \n\nDon't send them money anymore. Family is more than money. Now it is their time to prove their sincerity. ",
            "You do have a family you take of. YOUR OWN! You mom doesn't sound like a very good mom. I would maybe keep my distance. Maybe just holidays. I wouldnt bring my kids around a woman like that though. If she does ask for money and you don't give it she will probably go NC again.",
            "If they ask for money dont give it to them and see their reaction then go from there\n\nYou and your dad made peace,a late peace but a peace regardless\n\nYou and your mother and sister have not yet,if you want to do the same with them is your choice",
            "Don't meet them again without your wife. One of a spouse's functions is to be there to call bullshit at times like this.",
            "Level with them. Explain that this sudden change of heart after so many years of cruelty causes suspicion. Tell them you want to make sure you're not being used for money and that you don't have any to give anyways but you won't be spending money on them. If they're really legit about putting the past behind them then this isn't a big deal. If they're just biding their time until they hit you up for money, they'll be pissed. ",
            "Hey I've done a bunch of rehab. You know what my (reformed) addict counselor said should be the length of time should be before you start seeing improvements (not complete repair) in significant relationships? 3 months. After that, it's their issues, not yours. They get to be hurt, but they don't get to completely ostracize you from every important family occasion for 10 years and then expect anything except polite civility from you. Put it like this: they've pushed you out longer than you were in addiction. You owe them nothing.",
            ">\"family should take care of each other\".\n\nJust going to point out that you were family too. I think it's time for you to worry about your own child and family and be there for them. Maybe start up writing emails once a week. The second they ask for money I'd bail. ",
            "No matter what you decide, definitely discuss this with your wife, so the two of you can have a plan of action and work as a team, because if they are trying for money and they don't get it with their first approach, they may try to insinuate themselves into your life by \"befriending\" your wife or manipulating your kids. People desperate for money will do a lot of shitty things, you know this yourself.",
            "'No' is a complete sentence. If you feel like you are being manipulated, it's probably because you are. It's telling that they told you to come alone, I assume without your wife to help you cut through their bullshit and give you another opinion. You have a family: your wife and son. ",
            "proud of your sobriety buddy. good job despite the circumstances. now obviously forgiveness is not owed to anyone, and your family has the right to reject your apology. however, them flipping the script all of a sudden and coming at you with lines like \"family should take care of each other\" seems super suspect and i would approach with caution. \n\n\nbest case scenario is that they truly saw the light and want to mend fences and apologize for their treatment of you and your family. if thats the case then its up to you if you want to forgive them and accept them into the fold. again, no one is owed forgiveness so you are more than free to say im sorry but its too late, good luck. \n\nworst case scenario is that they are playing on your good will and need for family to get financial assistance out of you. and if this is the truth then that sucks so much, cause wow what a shitty family and how dare they try to manipulate and use you like that, possibly knowing that it could trigger you and affect your sobriety. \n\n\ni dont know how you can figure out their true intentions but i think one thing is painfully clear. **DO NOT INVOLVE ANY MONEY BETWEEN YOU AND THEM** if you want them back in, invite them to BBQ's, pool parties, parks whatever and see if they show up/invite you out on their own iniciatives. \nif they want you to pay for anything REFUSE. good manipulators always start small; with a dinner here, a movie there, help me with an overdraft, pick up my cell phone bill its not like you cant afford it, hey my rent is due..... \n\n\n\n\nif you want to spend time with them do it. if not, dont. but regardless, keep your money to yourself. ",
            "Be there for them, but don't give them money. If they ask for it directly, just tell them you don't have any to spare",
            "They still haven't forgiven you.  They want your $$$$.\n\nSay No.\n\n",
            "You spent many years building yourself into a better person and a better life, doesn't mean they did.\n\nThink about what you want from them and what your boundaries are. Be clear in your mind and precede in accordance with that. Don't set yourself up for heartache. \n\nIt's very likely even though you were messed up, they are also very flawed people. Their years of resentment and coldness seem quite an extreme reaction considering you went quite far to make amends. ",
            "You fixed your mistakes. Kudos and awesome all rolled into one.\n\n>how my sisters are both divorced and single mothers without \"great\" careers and how they struggle to take care of their children\n\nO yes.. they want your money/financial support.\n\n\n>They never explicitly asked for money but their requests were implicit.\n\nSupport them, but if they ask for money then you know.\n\n>My mother and sister told me not to come to his funeral\n\nThey all can suck the fat one...",
            "Your family \"took care of you\" by shunning you away for over a decade. It's only fair if you choose to give them the same love and respect in return.",
            "If they really cared about you then they would have made an effort to get to know your wife, your son and the new you long before this happened. Also it is pretty heartless to cut you out of your own fathers funeral. \n\nId say if anything to let them know you want them to be a part of your family but make sure to not ever ever give them money. ",
            "I have never used caps like this on the internet...but DO NOT GIVE THEM MONEY OP. PLEASE. In all seriousness, we've gone through similar stuff as a family. We fell for it and gave in, got chumped and thrown away again once they got it. It's not worth the money that you could send your kids to college with. ",
            "I'm sorry you've been through all this. As someone who learned first hand the destruction an addict family member can cause, I can relate to their actions in refusing to enable you when you were using. However, as someone who still learned this first hand, I *can not* relate to their actions after you became sober (unless there's some giant, unforgivable indiscretion you're excluding, which I won't assume to be the case at all). \n\nThis is your family, you've done everything you can to make amends *and more*. You've been consistent in showing your willingness to be apart of the family and they've been consistent in shutting you down. They should be ashamed. A recovering addict manages to stay sober is truly someone who has accomplished something non addicts will never be able to understand. And the fact your family has snubbed you after all these years of sobriety and genuine attempts to reconnect is disheartening. \n\nI too would be surprised and a bit suspicious if they decided to take you back now, especially will all the \"family needs to be supportive\" bullshit they're spewing. Ultimately, you have to make this decision for yourself. It's your family, but if you choose to move forward, I'd tread carefully. Sounds like you could be in a real position to be taken advantage of.",
            "As everyone else is pointing out: If all they want is to have you back in their lives, great, then it's a happy ending. But that's the line, and as soon as any hidden agenda appears, you have every right to say \"No\". If they reject you again, then there wasn't any point in reconnecting in the first place.\n\nPeople often mistake short-lived affection for endearment, and it always brings more harm than good. It would be unwise to invite that into your family's life, after having come so far now from whence you were.\n\nKeep us posted. ",
            "you should help them.\n\nemotionally.\n\nnot financially. ",
            "They cut you from their lives for over a decade, refused to let you attend your own father's funeral, and only started trying to reestablish contact when their lives got \"difficult.\"\n\nThey are 100% trying to manipulate you.  Your financial obligations are to the family you made, and no one else if that's your choice.  Personally, I'd tell them to kiss my alabaster ass and never see or speak to them again.",
            "I generally hate how quick people are to say \"cut them out\" when it comes to family. But you spent 10 years after you were sober and got your life together, literally paying them back, and sending gifts at all the events. You made peace with your father and they still wanted to freeze you out, and didn't want you at the funeral. They already cut you out of their life, and if you chose to cut them out now, I'm not even gonna tell you to try and stay. Cuz they don't deserve it. Everyone can earn their chance at redemption, and it really seems like you did that (unless you're leaving out something big that would make them cut you out).\n\nBut since you want to get back together, don't give them money. In the same way that you pulled your life together after they cut you loose and stopped enabling you, do the same for them. Don't enable them. If you don't want to feel like you're being manipulated, then don't let them do it. If they really want to be a family again then they won't try to hold their love behind a paywall, and they won't mind getting to know you're wife and kids.",
            "I'm sorry to hear about your family and your dad.\n\nBut this is obviously all about the money, otherwise you'd be accepted a long time ago.\n\nPeople reach an age where they make automatic peace, and yet, this isn't the case. Leave it be, you are being milked.. as sad as it sounds.",
            "My suggestion is to match their efforts. If they invite you to something, you invite them to something. If they call you, you call them. If they give you a gift, you give them a gift. See how you feel doing this.\n\nI doubt they will be giving you money, so don't give them any.",
            "First congrats on over coming addiction. It's not easy and paying them back was very noble of you. Second don't give them any more money it's not you they want in their lives just cash. Talk with your wife tell her how the meeting went. You shouldn't be responsible for how their lives are turning out",
            "> I totally felt like I was being manipulated\n\nBecause most probably you were.\n\n>I loved them and tried for 10 years and received no forgiveness\n\nDid you ask for forgiveness? Did they finally forgive you? If so, did you feel it was genuine forgiveness? This is very important.\n\n\n> \"family should take care of each other\"\n\nHow exactly they take care of you now? What exactly do they do or planning to do? They cannot play \"we did take care of you when you was young\" card anymore after you paying your debt with interest, all your attempts to re-connect and their ignoring you completely.\n\n\n>What should I do?\n\nBaby steps. \n\nPhone calls, social networks... start sharing your life with them. See what they share with you. Plan some re-union or, say July 4th celebration, etc.\n\nIf all they share with you is how they are in trouble and how their life is difficult, - that would be a red flag. Listen to you guts.\n\nIf you want to help them with money - do it, but make sure it's for very specific thing, not just a handout and you control how it's spent (for example, if they have a broken car - you find a mechanic or two, you talk to them and make sure proper diagnostics performed before they come up with an estimate - and then you pay directly to this mechanic). See how they react, see how you feel about the whole thing. See how quick they ask to help them with something else. Don't commit to give them any money in future. Every case is special and every time you need to think. See their reaction if you decline to give them money or help where you think it's not very much needed.\n\nThe fact that your sisters are divorced is a factor: they may or may not care about you as a person, but they need to live off of somebody who can make their life less difficult. Hard to say how much it weights, you will judge it by their reaction on photos of your son, your phone calls, events in your life and what they share with you.\n\nGood luck, man!\n\n\n\n\n\n\n",
            "From what you've wrote, I noticed one thing about your mom. She seems very manipulative, please don't give her any money. You worked hard for what you have and you should be proud of that. Don't help with money..",
            "Unfortunately, your family are shitty people. (which may have had something to do with your original addiction problems; emotional isolation and trauma are big triggers for addiction.)\n\nIf you want to have a relationship with them, you have to decide what are your boundaries. Do you want to give them money? Do you not want to give them money? Would you be willing to help with your nieces and nephews educations, but not give money to your mom/sisters? etc. These are things you  need to figure out. \n\nIf I were you, I would not offer them money, and I would ignore their hints. If they want money from you, they should come out and ask for it. \n\nI'm really sorry you are experiencing this. I also have a family who only contact me when they want something. It sucks. They are so selfish. ",
            "Good job turning everything around. General advice in this situation are all things that you've done (ie, pay them back, respect their wishes of staying away, etc). It sounds to me like you did what you could, it doesn't forgive what you did when you were younger, but it's a great step. Essentially you put the ball in their court for over 10 years.\n\nThey are right, you know, family should take care of each other. So you be there for them, if sisters need someone to watch over their kids for an afternoon, if your mom needs a ride somewhere, etc. \n\nMoney? No.",
            "This story hurts my heart, OP. You fucked up-welcome to the human race. You made amends. You have made a life for yourself. As a parent myself, let me at least offer how proud of you I am, and send my parental, if only anonymous and inadequate, love and support for all that you have accomplished. Please be sweet to yourself and your beautiful son. Do not give these people money. They are sick people, to be pitied, perhaps, but not indulged. ",
            "You can be physically there for your family, your financial obligations are to your wife and children. Any financial plans should be with their well being in mind.\n\nI'd bring this up to a sponsor and grandsponser. \n\nIt sounds like your mother knows how to use emotional leverage to manipulate. I'd be wearying, and would not meet them again without your wife.\n\nEdit: Great work on sobriety. It sounds like you have turned a turd sandwich into a delicious Rueben.",
            "I think the gifts are nice. Like especially for their kid's birthday's and such. However you sir are in the good position here. There is no direct reason you have to do anything in changing you money behaviors. If you suspect they want your cash then force their hand and simply doing nothing. \n\nIf they are desperate as you suspect then they will at some point likely ask directly. Then is when you can say what you feel, if you feel they deserve to hear that. ",
            "The two things to jump out at me are the funeral and the your kid. They showed no interest in their grandchild/nephew? Wether or not after many years they believed in you it's pretty crappy to not want anything to do with your child. And to tell you that you didn't deserve to be at your father's funeral? I don't know if I'd bother with them. You've got a tough choice but whatever you do make sure finances/money are not involved.",
            "It's not your problem they are single mothers or not doing well in their lives. They all cut you out even though you have always tried to make it right by sending cards and such. This implies you were thinking about them through all those shitty years and times. \n\nNOW all of a sudden they want to get back into your life.. Doesn't work that way.",
            "They are the ones that owe you a heartfelt apology and have a lot to make up for. You did everything you could for a very long time, making up for any wrongdoing and more. Don't give them money and let them use you like that when they couldn't even find it in their heart to forgive you after all of your repentance. They have been in the wrong far longer than you ever were. ",
            "No. No, no, no. You nearly killed yourself trying to get back in their graces. They made it crystal clear that they wanted nothing to do with you. That means your money, too. Fuck them. They made their bed. Let them lie in it. ",
            "I think you are seeing them for exactly what they are and what they're doing.\n\nI'm glad you and your dad made your peace. I'd have nothing to do with the rest of them, in your shoes. I can't see them adding anything positive to your life.\n\nThey did do you one huge blessing: they kicked you out at 23. You more than made up for that blessing. Too bad they couldn't open their hearts.",
            "This doesn't seem like a difficult decision. You tried for many years and they turned their back on you, and for seemingly good reasons. However it's very interesting that those reasons are no longer relevant the moment they need something from you... \n\nI would honestly move on and keep living as if they didn't exist, they made it pretty clear that they aren't actually interested in having a relationship with you. Wanting money and wanting a relationship are two different things. You had your meeting, you won't have any regrets about not going or not at least trying. However they showed exactly what they want so it's time to continue to move on and don't look back. Do not give them money, it's that simple. ",
            "They have ten years to make up to you. Let them get started. ",
            "hey op - what does your wife think you should do ?",
            "> They said things like \"family should take care of each other\".\n\nThey are right, OP. You should take care of your family. And I mean your wife and your children.\n\nBecause these women are NOT your family and they spent big amounts of time to make the point.",
            "They are taking advantage of you, leave them out.",
            "I just wanted to say that I really respect you for your accountability to the problems you created. It seems to me you really stepped up to make amends and did your part. I'm really sorry that your family could not find a way to forgive you. But, I also think you have the right attitude about moving on permanently.",
            "Yeah, they do not want you around, but they will gladly take your cash.  ",
            "Yeah they are straight up manipulating you.  When they do eventually ask for money tell them you're willing to be a part of a family again but if all they want from you is your money then they should just forget about you.  You tried for years to get them to come around only to be told no. You have your own family now that you need to take care of and you need to take care of them first. \n\nBtw congratulations on staying sober OP. I know how hard it is for someone to turn it all around and continue to keep fighting against the cravings.  My mother was an addict she relapsed countless times until it took her life.  Im proud of you for not giving in and being a loving parent and husband.  ",
            "Congrats on turning your life around from one sober person to yourself. Keep your head up. And try to remember to breathe. ",
            "Show them the finger. \n\nTHe one that COULD MAYBE have some decency (your dad) is gone.\n\nForget about them. THey will use your love & attachement to them to abuse you.",
            "If they truly wanted to be a part of your life, then they would have made the effort sooner. It sounds like they are fishing for a handout now that the train of gifts etc has stopped from you trying to atone for your past wrongs. \"Family should take care of each other\" huh? Well what about all those years ago when they cut you loose (I know it was the catalyst to get you back on track which I might add i applaud you for getting yourself straightened up and back on your feet), what about when your father was initially sick, surely family would have mattered then? Or being invited to your sisters weddings/to meet your niece and nephew, or coming to your wedding and meeting your son? If family mattered so much to them they would have made the effort before now. Ten years of you atoning for any wrongs you committed is a long time, and they could have made an effort at any point. Except, now your dad is gone, and after two years with no gifts etc from you, suddenly they want to know you? Adding to the hints etc about struggling etc, it really sounds like they are struggling with things, and see your desire to be accepted back in to the family as something to manipulate you in to handing over money and possibly items too. As for what to do? Completely ignore any and all hints, subtle requests and outright demands for any financial assistance. Except perhaps to point them in the direction of any state aid schemes, benefits they may be entitled to, or charities that might assist them. And if they get pushy, walk away. Foe twelve years they did not want to know you despite your efforts. They can reap the rewards of that.",
            "OP, they're definitely trying to manipulate you. They're using two of the big three manipulative emotions: obligation and guilt. (The third is fear.) It's now going to be your obligation to help them financially and they will use your past to cause you guilt.\n\nDon't play their game. It seems you've come to peace with your past. Hold onto that, because then they can't make you feel guilty. When they indicate that it is your obligation, question their lack of obligation when you were recovered and sober.",
            "Don't give them money. Not a dime. If they're really interested in repairing the relationship, it won't bother them.",
            "So, \"family should take care of each other\"....  Was there an apology at this meeting to counteract the last 10 years of shunning you?  Or are they implying that the past is the past to cover your and their actions?",
            "You don't really know for certain that they want money, so hang around for now, but don't give them any money. ",
            "honestly? if my family came crawling back after essentially rejecting my wife and son i'd tell them to go fuck themselves. but that's just me.",
            "This is probably gonna sound harsh but, fuck them.  They kept you away for years, had no interest in you or their nephew/grandson, going so far as to tell you not to attend your own father's funeral and now they want you around because things are \"difficult\"?  Ask yourself - if you didn't have money would they still want to reconcile?  They made their bed, let them lie in it.",
            "They got use to you giving them money and now that it has stopped they want it back. \n\nYou did some wrong, but you have made up for it. You tried and tried and they shut you down. You made up for what you did to them more than a decade ago but now is the time to be selfish again. They cannot have you in their life merely because it's convenient. They should want you because it's the right thing to do. \n\nAnd they will think they're doing the right thing and they will think that asking you for money is their right. And this will get very difficult and may severe ties forever. But you must make a decision. How long will you be a walking may for them to atone for what teenager you did so long ago? ",
            "There's no fault with either decision you make. There's nothing wrong with refusing to have a relationship with them, and there's nothing wrong with forgiving them and helping them financially. There's nothing wrong with forgiving them and not giving them money, and nothing wrong with not forgiving them and helping them financially anyway. It comes down to what you decide is best for you. How important is a relationship with immediate family to you? What does forgiveness mean to you? You saw that even though you made amends, they still chose not forgive you. You in turn have the same option, to forgive or not forgive, independent from them. \n\nTheir actions were completely hurtful in my opinion, and I don't think they should have taken mistakes YOU made that YOU had/have to live with, to punish you. With that being said, there's a reason (valid to you or not) that they chose not to forgive you. Do you know what that reason is? I'd suggest having a conversation, alone, with your mother first. Discover the extent to which you hurt her, and share the extent to which she hurt you. From there I think you'll know what you need to do. Don't feel obligated to act in any way, the only obligation you have is to yourself. ",
            "You can help by offering up moral support at any hour of the day.  You paid them back with interest.  Sent them gifts and cards on holidays and birthdays.  You celebrated with them from afar for the birth of their children they didn't want you to meet.  I'm sure you made excuses to your own child about why his grandparents and aunts were never around.  At this point, they owe YOU more than you owe them.  Love them.  Provide them a shoulder to cry on and an ear to talk to, but under no circumstances, should you GIVE them money.  A tank of gas here and there would be as far as I stretch it, only to make sure they can get to work or take the kids to appointments.  MAYBE a bag of groceries if things REALLY get rough, but do NOT pay their bills.  Do NOT feed their lifestyle.  Do NOT allow them to play on the past and manipulate you into revisiting your guilt.  You turned your life around FOR them and they turned their backs.  Now you succeed IN SPITE of them, they should not benefit from your recovery because they refused to celebrate it with you when it didn't suit them.",
            "So 9 years as an active user and now 12 years as a sober addict tells me you are on the right path, and I congratulate you. \n\nI have a brother who has been an active drug addict for 18 years (15 - 33[present]) using heroin and whatever else. If he turned things around like you did I would be ecstatic and supportive despite the way he treated the family in the past and I wouldn't be asking for money from him. \n\nThen again, they didn't ask for money from you directly. If you want to try and help them with money it wouldn't be the worst thing in the world so long as it is on your terms. \n",
            "I feel like your question has been answered adequately. Don't give them money. However, I'd just like to congratulate you on your journey. You did what many couldn't. You're strong and have a willpower greater than most. You know what the right thing to do is, and that is evident by your past. If you feel like the right thing is to help them financially, do it. If you don't feel it is right, contribute those finances to the family that you started that loves you now for who you are.\n\nJust, congratulations man. You are everything that is good in the world. ",
            "Hey man. I don't have advice for you but I just wanted to say how amazing it is that you turned your life around after such a rough start. Truly inspiring :)",
            "First of all, so glad to hear your success story. \n\nRe your family: I agree that \"family should take care of each other,\" and you can certainly do that with moral support. Re-invite them into your life too. Just don't provide financial assistance.\n\nI understand your concerns, but don't fear the worst until you have more obvious reasoning to do so.",
            "As a former addict I can tell you this.  You know exactly what they want and you know exactly what you SHOULD do.  It is the former addict and good person inside you that is asking this question, not the new, sober, well put together you.    Be honest, you know they only want one thing and are willing to do whatever they can to get what they want.  As you know it is no small coincidence they have kept you further than arms length this whole time (the funeral was especially telling) and now...they want something and you are the easiest target.  You may have been the addict but if you went through any 12 step program worth its salt you should already realize they were enablers and I am fairly certain they do not care if you are using or not, as long as you can give them what they want (money, whatever).  I would also prepare for them to turn to brow beating or some type of blackmail when you shut them down.  I would not be surprised at all if they bring up how your past could hurt your current work and/or personal relationships.\n\nGood luck.  Stay sober.",
            "I would accept them back into your life but do not financially support them. Remember, you did your best to make them whole from your wrongdoings and did everything they would let you to feel like a part of their lives... If they only just now want you back and it's for money think of how messed up that is. Don't let them use you when for years all you wanted was their company and they refused it.",
            "You have tried to atone many times. They didn't accept it, that's sometimes the way it is. I would proceed with caution here. Take it slow, become part of their lives, but keep anything financial off the table. \n\nOn a side note it is heartwarming to see a former addict stand up, and take responsibility for their lives. You may be an inspiration for others. ",
            "You've done everything in your power to make amends. I'd say you've been beyond thorough. Good for you. \nHow will helping or NOT helping affect your sobriety? That's the big question as far as I can see. \nI'd suggest this - make them say it. Whatever it is that you think they want from you. Let them state their case then decide how far you want this reconciliation to go. \nPerhaps the best way to help them is to give them instruction on financial management. That right there will tell you a lot about their state of mind!",
            "You tried for ten years. They are definitely asking for money, it's obvious. From just reading the text I would definitely not give them money nor take them back. Go live your life and start your own family. Fuck 'em. ",
            "A drug addict is incredibly hard to deal with no doubt, but your family are being dicks. You don't deserve to be cast out after all the progress you made. As a member of society, thank you. Good luck op",
            "I believe that one chooses their family.  The concept that shared DNA creates an intrinsic bond between two people is archaic and hearkens to concepts of breeding and tribalism and classism.  \n\nMy parents worked hard to help me out growing up.  My sister's and I have a lot of shared experience and outlook.  Most importantly they are all kind to me and accept my kindnesses.  For this reason I consider them to be my family.  \n\nThe question comes down to whether or not you choose for yourself to be family with these individuals.  Can you forgive a bit of selfishness on their part?  Will your relationship be limited to the financial benefit, or will a real true relationship develop out of these petty manipulations?  What does your wife (who you have *chosen* to be family) think?  How will this affect those you love?  \n\nYou are getting a lot of responses here telling you to categorically not help them financially.  These responses might very well be telling you the right thing, but they are over-reaching to claim to know that.  Because the bottom line is that there are no wrong answers here, as long as you make the decision on your own terms.  \n\nMy sister can be an insufferable brat, sometimes.  I love her because I have chosen to put up with her flaws.  My MIL is passive aggressive and I pretend not to notice because I want her to be happy and I want my wife to be at ease.  \n\nYou have every right to cut them off.  But you have every right to choose to look past their obvious flaws and decide for yourself that they are your family.  \n\nWhatever decision you make is the right one as long as you feel comfortable and are making the most healthy decision for *you*.\n\nLet your wife and loved ones inform your decision.  Protect your children.  Love as much as you choose to, which sometimes means giving without receiving.  But only if you choose.  \n\nGood luck and congratulations on your life changes!",
            "This pained me to read, the actions of your \"family\" is horrible.  You sound like you have made peace with your father at least.  Its sad that even after the death of your father the remaining family members still treated you as a pariah.  I admire you so much for turning your life around and doing what is right in amending the damage you possibly caused to your other family members.\n\nJust know that you did your part and beyond.  You reached out, sent gifts and acknowledged their marriages, and the birth of their children.  Did they acknowledge you?  No.   Your family is your wife and your child.  They love you and value you.  They are what matters.  I am sure life was great when you went NC with them anyway.  Just know that you did what you could and to focus your energy on things and people that matter and value you and the huge positive changes you have made in your life.",
            "You don't have any money to give them anyway. That's YOUR FAMILY's money. You may not give it out. Think of it that way if they ask. (I'm in a similar situation, and that's how my wife put it to me)",
            "Can't help regarding relationship, just wanting to congratulate on your sobering ! Such success stories are vital to the community",
            "You have gone above and beyond in terms of making amends and repairing damages. The fact that you were so, so young when you were making bad choices is a very relevant thing, and it is incredibly cruel that your family chose to treat you the way that they did.\n\n\nDo not give them money, at all, under any circumstances. ",
            "If you are close enough to offer other types of assistance like help picking up kids and things like that would be OK as a starting ground. But the minute they ask for money I would go no contact.",
            "First I would like to say kudos to you for turning your life around.  \n\nI find your \"family\" highly suspicious.  Being that after all these years and so many opportunities to make amends that suddenly they have had a \"change of heart\".  Invites you over...but ONLY alone and provides no inkling or disclosure as to why the invitation was extended in the first place.  Make no mention of your wife or child and how they would like to cultivate a relationship with them.  Gave no acknowledgement of your years of sobriety nor their role in ignoring you, your wife and child all these years.\n\nThese people are not your family.  Complete strangers on the street would give your better respect.  Heck I am an internet stranger and I respect you so much more than these people who call themselves \"family\".\n\nI would go no contact.  You don't need these people to drain you.",
            "You could give them the benefit of the doubt and slowly start seeing them again. Start with going out for lunch with your Mom. If they start talking money tell them that you don't have it and they're making you feel like that's the only reason they want you back. Time will tell if they still want you back in their life after they realize you're not giving them shit.  Your Mom might need some support since your father is gone but hopefully she genuinely wants her son back in her life too.  ",
            "Late reply, but I've been on the side your family is on and wanted to share.  \n  \nMy mother was a major drug addict (and still is). She started when I was a child, about 6-7 or so. We lost our home, she stole my money that I would save as a kid, etc., etc.   \n \nLong story short: She would continue to do the same things she would apologize for. I'd forgive her. She would promise she wouldn't pawn my jewelry (or whatever) again. And she would do it again.   \n  \nI mention this because it's totally unrelated to what you have done. You made some mistakes, BUT you've paid for them, figuratively and with actual money. You have given them enough. You've proven that you are not like that anymore. 10 years is a long damn time, and not to mention that they wouldn't let you go to your fathers funeral? That's absurd.   \n  \nStop giving them money, for your sake. Good luck.",
            ">They kept mentioning how difficult things are for them...\n\nYou know what else is difficult? Having your family turn their back on you for a decade and tell you not to come to your father's funeral. You've got a family that loves you in your wife and children, focus on them.",
            "I see a lot of posts on here where family member A does something \"horrible\" and family member B goes NC until A turns their life around. Then B needs money and can \"suddenly\" forgive A.  This makes me so mad!\n\nI am NC with my older sister, as is all of my immediate family. What she did is so horrendous I can never forgive her. We are talking, *I wouldn't spit on her if she was on fire level of I cannot forgive her.* To me, this is the only reason you should ever be NC with your family. There is nothing that would ever prompt me to forgive her. I don't care if I was homeless and she was a millionaire or if I needed a kidney and she was the *only* person on Earth that would/could give me one. \n\nFrom what you've written, you did what \"normal\" addicts do to fuel their addiction. I can understand your family would cut you out *until* you got your act together. But you did over a decade ago and tried to make amends. You tried again after your father made amends. They still refused.\n\nThey only want you back because they need something. So either:\nA) What you did wasn't so heinous that they should have cut you out of their lives for 15 years and your family are dicks \nor \nB) What you did was pretty heinous and they can't forgive you for it, but are trying to take advantage of your guilt and your income. Which still makes them dicks because you are no longer the person you were 15 years ago and don't deserve to be punished.\n\nI'm just saying, I will never forgive my older sister, but if by some miracle she turns her life around and becomes a decent human being, I would never try to do this to her. I would still be NC with her, but I would never try to take advantage of her. **Because that's what decent human beings do.**",
            "Congrats on the sobriety. Good luck with this, I don't have any good advice, but I just wanted to say that.",
            "First of all, congrats on your sobriety and successes!! Addiction is a hard thing to overcome and I think  it takes a very strong person to not only overcome it, but to put so much effort into repairing the damage you've done due to it, as you have. I don't know you, but I'm proud and happy to know that there are people like you out there. I really hope the best for you I'm all endevors. \n\n I'm not sure that there is a 'right' or 'wrong' way to handle this, though.  Forgiveness on the individuals part is subjective to themselves. Your family obviously doesn't handle forgiveness well and I agree that the way, and timing, with how they are  attempting to come back into your life is troubling. Money aside, I would have to wonder if letting their particular brand of toxicity back into your life wouldn't be detrimental, not just to you but your wife and children as well. Could they be sincere and familial ties be reestablished? Possibly, but it seems to me that you would have little to no control over making it happen/true at this point. \n\nI don't have an answer for what you should do, OP, but I definitely think that they are the ones who should be atoning now.",
            "I would keep no contact tbh. What you did sucks but them telling you to stay away from your fathers funeral is cruel and they did it just to be malicious. They are bad people and you should keep your family away from them.",
            "Don't fall for any sob stories and give them money. Emotional support only.",
            "[deleted]",
            "[removed]",
            "Congratulations to you, first of all. I have a lot less clean time than you and had I been in your position I don't think I would have handled it nearly as maturely or with such grace and dignity and kindness. That being said, you know inside what's best for you. At this point, just because they are family, doesn't mean you owe them anything. You know if you're being used. Don't let them do that to you. They say that sometimes after all of this shit, you have to find new family. Loving family members do not use manipulation tactics or purposefully exploit you to get what they want, even if they truly think they deserve it. And just to be clear, they don't. You've done more than enough. Best of luck to you, OP!",
            "Keep in contact with them if that's what you want to do. But remember you are worthy of your own boundaries. Keep them as close or as distant as you want. You are worthy and you don't owe them anything. ",
            "The alternative is to say \"yes\" to giving them money. This gives you power over them, which you can wield to your heart's desire (e.g., \"do x or I cut off the money\").",
            "First of all congrats on getting clean and taking charge of your life. My mom has struggled with alcoholism and my dad died from drug use. Addiction is a horrible thing. My older cousin pretty much went through the exact same thing as you. Stole, lied, everything. We never gave up on him though no matter how hard it was. Family sticks together in hard times. You've paid your debts and I don't think your family deserves you in their lives, but hey, we all make mistakes. Do what you think is right. If you are financially able to help them, without jeopardizing your own life, then help them. Explain to them how you feel hurt if the only reason they are finally reaching out is for financial help. But either way, try to repair those relationships. Learn from your dad's last moments with you before it's too late. Best of luck with your decision.",
            "You have done fine without them for this time; you have a life, and your own family to invest in.\n\nHowever, family is family, and breaking away from that is hard.\n\nGauge their actions towards your family while they discuss their own needs.  A healthy/healing family unit will want to get to know your wife/kids, and attempt to eliminate the separation.\n\nUltimately, no amount of advice should provide you with a decision, it can only guide you through the path to YOUR decision.\n\nI would advise before you do anything; that you discuss things with your wife and lay out:\n\n-  What you would expect from this re-integration\n-  What you will and will not do\n-  Immediate \"Fouls\"\n-  Financial limits\n\netc, etc...  Lay all that out, then if you're not getting what you want/need, you know it immediately.\n\n",
            "Please do not give them money OP.\n\nYou can try having a relationship with them and it will become apparent enough what they really want. It already doesn't look good that they talked to you alone though.",
            "I've seen a lot of people thankfully reinforce the idea that you should keep money out of it. But something possibly important occurs to me:\n\nSubstance abusers don't *usually* spring out of nowhere: they often come from dysfunctional families. Not to say that you shouldn't feel responsible for your own life and your actions: you have to be. But life is a cycle and it takes a village and all that: the environment and your upbringing play a role. \n\nWhatever they case, their reaction to your recovery certainly has been dysfunctional. I'm curious: \n\n* What stress did your addiction put on the family?\n\n* What were each of your family members reaction to your addiction over time?\n\n* Was there any relationship with a particular family member that could have contributed to the development of an addiction?\n\n* Did anything happen in your childhood which could be considered traumatic?\n\n* Anyone else in your family have addictive or escapist type behavioral issues? Video games, drugs, alcohol?",
            "Ok, basically you repaid and repaired the financial relationship with them. You don't owe them money UNLESS you really want to help.\n\nNow it is the time to repair the emotional relationship. Talk to your mother alone and to each of your sisters alone. Tell them exactly that - that you feel like you're done with the financial repayment and now it's time for emotional repair, that you understand that they need to learn to know and to trust you. And that it will be building a relationship from the beginning. \n\nThey need to know that you will see through a manipulation, but you are willing to have them as you family.",
            "When I read the title my initial thought was that you did some fucked up things to your family due to drugs and after being a clean a few years they still didn't forgive you. I would let have either. \n\nThen, as I read, it appears you actually got your shit together for quite a long time. Seems your mother and sisters just did not care anymore and cut ties. Their choice of course and rightfully so. You hurt them. \n\nNow they want you back after your father has passed. Also their choice. It is also your choice to keep ties cut with them. Disregarding the fact that they seem to be asking for help/money, I personally would tell them to fuck off. It would sound more along the lines of I've had my life together for X amount of years, I invited you to my wedding, you kept me from my fathers funeral, I've tried to make amends. You didn't want anything to do with me then and you want get it now. \n\nBut hey, that's up to you. You can always keep a decent distance, go slow, and absolutely do not give them money or anything you don't feel they deserve. ",
            "This story completely breaks my heart. The fact that you turned your life around and your family refused to forgive you just gets me right in the gut. I'm so sorry, OP. I think that you should follow your instincts. If you want I have a relationship with your family, then you should take this opportunity, but don't give them any more money. If that's all they want then they're taking advantage of you and they'll be gone again soon when you don't give them money. However, if they're being genuine, they will keep you in their lives, money or not. Just feel out the situation and keep your own heart guarded. It's important that they don't get the opportunity to hurt you again. Good luck OP!",
            "I think you've more than made amends. \n\nMy step dad stole so much from his family. But his mom always took him back. Bc she's his mother. \nYou've gotten your shit together. Not only did they finish you, but they punished your family. \n\nMost people, after a few years of consistent apologies and staying sober want their lives ones back. They might ease into it. But if they loved you, they would find a way to love you, even during the times you didn't love yourself. \n\nThey have no interest in being your family. They just want to use you. I personally would cut ties and walk away. You made peace with your dad. That shoukd have been an eye opener for them. Not to wait until their death bed to make up. ",
            "This goes against most of the comments I've read so far, saying \"be careful, let them get involved in your life, but don't offer money\"... I don't think you should even do that much. I believe that you should cut them out of your life entirely, like they did to you for close 2 decades. They made their choice long ago, and made some pretty irreversible decisions based on that choice. Now it's up to you to stick to their choice.",
            "Ask them, straight up! i agree they want money.\n\n\n Congrats, I'm proud of you!",
            ">  They told me that they're willing to put the past behind us and look towards the future,\n\nThat's nice. Did they apologize to you for their actions for the last decade?\n\nI understand their frustration, 15 years ago, with their addicted son. But they not only rejected your attempts to return when you initially got sober, but continued that rejection when you married, when you had a family and when your father passed. And they did that for longer than they had to deal with your adddiction.\n\nIf you want a relationship with them then you should pursue it, but on your terms. And in your place I'd insist that one of those terms is showing some kind of remorse. ",
            "I always try to give people the benefit of the doubt, so here's what I would do:\n\nGo meet with your mom. See how willing she is to mend bridges and truly welcome you back into the family. If it seems genuine, go for it - it sounds like at least part of you really misses them. On the other hand, if it seems like all they want is financial assistance, remind them that while you would love to be a part of their lives, you're not a bank or a lottery ticket.",
            "Man I'm really sorry. I don't have much to say but tell you that you've done an amazing thing with your life. Take care man and wish you and your family the best in life.. ",
            "Don't give them a damn cent.",
            "When I sense people are about to ask me for money, I start mentioning how broke I am. Even if I'm not. That way I can say no.",
            "I think you already know the answer. They want money from you. They don't care about your family, your wife, your son. They wanted you to come alone so they could put the pressure on and try to guilt you into it.\n\nI sincerely hope you cut all ties with your family; you may have screwed up as a kid, but there are bad people in this situation, and you are not one of them.",
            "If you dont feel the love between you and them, that genuine bond like it was when you were kid, then, im afraid they've lost you",
            "Tell them no. If they ask why, just ask them, 'where were you for these past 10 years?' and leave it at that. They turned their back on you twice. It's time for you to say no and turn your back on them. ",
            "Im so sorry they did all those things to you :( so sorry theyve treated you that way. I dont think you should give them a penny. Get separate checks if they wanna eat out, etc. You could spend time with them or whatever but take it with a grain of salt and dont let it hurt you too bad if they have alternative motives. ",
            "They turned their back on you. You owe them nothing. ",
            "Don't even allow yourself back. They only want you for money. They don't care about you and your family. \n",
            "Why are your sisters both single divorced mothers? ",
            "I know this isn't the right answer,but fuck those people.",
            "People are finicky, and think more with their pride than they do with their heads.  They may not have wanted you to be at the funeral because they were hurting and could not handle both your father dying, and another object of pain that they had not fully healed from (they stayed away from you instead of actually working through the pain).\n\nThe way you describe the meeting it may be monetary, or it could also be having someone handy around.  In stereotypical family makeups, they lost their only \"handyman\", and their pillar of strength.  My mother is one of the strongest \"i can do it if a male can\" types out there, but when she lost her father she was very much taken back on what she could do.  If she failed, who could she call for help?\n\nYou harmed them, and they've harmed you.  If they're asking to reconcile, don't squander the opportunity.  I am by no means saying that you should become their financial pillar.  You could still help them out with taking their kids on play dates, or sanding and finishing a deck (if they purchase the materials).  Give them advice that they may be looking for, and be available for them if they're still grieving.\n\nWhat ever you do, don't hold their slights towards your earlier reconciliation.  They weren't ready for it even though you were. Also make it clear that they cannot hold your previous misgivings against you either.  This is the clean slate, and make it so.  If they're not able to, then just walk away knowing that you at least tried.",
            "I have struggled with a family member's addiction. I have gone no-contact/low-contact before with a specific person and now that member of my family is my best friend. We have our ups and downs but not once have they ever asked me for money. I have even offered my help when I thought they needed it and they adamantly refused. \n\nThey have, however, asked that I help with certain jobs around their house and I have helped and even been compensated for that work.",
            "Honestly it takes pretty awful people to disown a child like that. I'm sure you were a piece of shit, but once you came clean they still wouldn't speak to you? Reeks of scapegoating... ",
            "You're happy and got your life on track, why potentially disrupt it.\n\nWhat value will they bring to it, vs the cost of just staying NC.",
            "They are right. Family should take care of each other. They made it clear that you are not part of their family. You fucked up big as a kid but if everything you said is true then you tried everything to get back in the family. If the only reason they want to be family now is for money they don't deserve you. Point blank just tell them you would love to be a family again but that you will not be providing any money to them. See how they respond and then make a decision. ",
            ">\"family should take care of each other\".\n\n\"You know, unless we don't feel like it and want to hold it over your head even though you made far better amends than most would do!\"\n\n",
            "Tell them you lost your job.",
            "Everyone here has already said what I think of the situation, however, I wanted to give you a big ol' CONGRATULATIONS on beating your addiction and being sober for so long.  You beat meth!  THE meth, that has a 97% failure rate.  Fuckin' awesome, man.",
            "Damn that fucking sucks man. Not sure what to do but you seem like you have a level head on your shoulders now, so good for you",
            "They are scum OP. Cut them out of your life for good and make sure that you and your wife are better parents to your kids",
            "Maybe tell them you lost your job and need help? ",
            "You took from them when it was convenient for you to do so. When you were in trouble, when you needed their money, their stuff so you could keep your drug addiction. They didn't get to choose when they got stolen from.  \nYou don't get to choose when you get the opportunity to make things right. Repaying them when they didn't need it wasn't enough for the emotional damage you put them through. After your addiction you did everything right, but sometimes it takes something more to bring people back together.\n\nThis is it. This is your change to make things right. They got it rough and they turned to you. There might be a possibility that they are only interested in your money. But the only way to know that is to help them and hope for the best.",
            "I think you should investigate how you would feel about helping them.  Would you be spiteful, or would you feel good no matter if they are taking advantage of you or not?\n\nI like walking away from a situation knowing I did all I could to improve it. That is just how I think. I can't improve everything, but I can do all I can. Sometimes, I make it worse, and when that happens, I step away.\n\nIf you are going to do this, it has more to do with you and less to do with them. You cannot control the behaviors, feelings, or intentions of other people, but if you go into it knowing you will be helping them--and set specific limits you can be content with (a conversation with your wife)-- then it might be alright. Just know they can push you away once they have had their fill, and you have to be okay with that before you give one dime.\n\ndisclaimer: I am not a family therapist, drug user, or well-off, so take this with grain of salt. ",
            "You could probably help your nephew and niece provided you want to do it. They're just kids and have nothing to do with actions of their parents while having a relationship with the cousins could be great for your son.",
            "Send your mom a bit of money. Deserving or undeserving,  she is your mom and she took care of you and raised you up. You don't have to have contact with her or your sisters. Send your mom a lump sum and ask her and your sibling to never contact you. It is clear they don't want to have you in their life. It is very insulting, manipulative and downright wrong that they want to talk to you only for the sake of money. You owe a bit to your mom whether or not she likes you. She is still your mother. Take care of mom a bit, despite everything. As for your sisters, you owe them NOTHING, not a penny. Do right by your mom but focus on your life.",
            "[deleted]",
            "You put them through hell. You only paid back the money you stole, not all the suffering and trauma that you caused. Have you considered how much that may have cost them in well-being, therapy, feelings?\n\nYou say you want to atone for your sins. Here's your chance. Don't think of it as you doing them a favor. You are paying them back for what you took from them. You are correcting your own mistakes. Your debts to your family are not paid, probably never will.",
            "Help your family.  You can never pay them back for the harm you caused them.  The sleepless nights.  The years of worrying about if you would make it home alive.  ",
            "At the end of the day, whether you like them or not. Family is still family. No matter how many times you verbally declare that you (or they) disown them, the same blood runs in their veins as it does in yours. At the end of the day, even your dad saw that before he died - albeit it took a set of extreme circumstances.\n\nPersonally, I would give them a hand (whether financially or not). But know yourself where to draw the line. Know where you feel if what they ask for may be too much. ",
            "You are the head of this family, now. You are the more capable and reasonable person. You don't go to them- they must come to you and ask you for help if they need it.\r\rThey are coming under you like they were under your father. This isn't meant to be chauvinism; for all I know you are a woman and it would be no different. If they want help they need to accept that you are giving it under your terms and guidance and if each individual had a problem with that it is their own, individual issue.",
            "I think you should talk to them about it and be completely honest and see what happens. If you're going to go forward in your life and build up some pride, then turn around and look what you have done and be proud of it. You have earned the right to be honest with people. So be honest with them. Maybe they'll be honest with you in return. Maybe you'll find out that they actually do all need money. Maybe you can even give them some money and go above and beyond what you actually owe them. Maybe they'll be thankful. Is that such a crazy idea?"
        ]
    },
    {
        "post_id": "elfi2g",
        "author": "vivid_dreamer3",
        "title": "UPDATE: Apparently I (F31) married a Narcissist (M35) Original post: My (F31) husband (M34) of 5 years takes me for granted",
        "url": "https://www.reddit.com/r/relationships/comments/elfi2g/update_apparently_i_f31_married_a_narcissist_m35/",
        "score": 2122,
        "num_comments": 274,
        "created_utc": 1578421858.0,
        "selftext": "Thank you to everyone for your comments on my [original post](https://www.reddit.com/r/relationships/comments/d5my92/my_f31_husband_m34_of_5_years_together_for_9/)(3 months ago). I actually was quite surprised by the resounding gong of how terrible he is and needed a lot of time to digest the responses. My first reaction was that I exaggerated or only put one side into the story and that he isn't really that bad. \n\nThe switch flipped for me after a few series of events in the last 2 months. First I wanted to sign up our oldest child up for a weeknight evening activity. And my husband was not fond of the idea, but when I kept pushing he said if I did signup it was all on me and that I was not \"allowed\" to get frazzled or stressed out on the day of the activity. I realized he doesn't want to signup because he doesn’t want to change his quality of life. \n\nShortly after that, he was travelling for work and I was lying in bed alone and I realized I hadn't gotten my period in a while. Open my app to check when its due, I'M ON DAY 52 OF MY CYCLE! And we had sex immediately before my fertility window. I cannot be pregnant. I panicked. And I didn't even want to tell him. I feared telling him. I still haven't told him 2 months later. (I thankfully just skipped a cycle.)\n\nI started fantasizing what it would look like to split time with our kids. Casually looking for work to see what is out there if/when we break up. And totally talking about it with my girlfriends. \n\nThen one lunch (in front of the kids) out of nowhere we had a colossal fight (for us). Surprisingly (and quite out of character) I was totally calm. And when he would go at me with \"is this what the next 35 years of our lives will be like?\" I would just say \"I hope not.\"  And when he said something about divorce, I just said \"that doesn’t scare me.\" I was solidly expecting to be fighting all Christmas because I really thought the best thing would be to separate. And he now knew that was something I was considering.\n\nA couple hours later he was SUPER sweet. Telling me he'll never stop fighting for us, and that I am the best at everything I do (which is true 😉 ).  And that he just wanted us to be better. That he would be better.  \n\nIn the couple days that followed, he said a couple of things to our kids that make me cringe. I'm sure some people parent with shame intentionally but I am NOT okay with it. And I immediately called him on it and told him that was one of the things I did not like. He seems to have taken note and has not done it since. He is taking an interest in an entrepreneurial project of mine, which is a complete 180 from before. It is just an interest when I want to talk about a new idea or spin on something (related to my project) he is mostly dismissive, but will tolerate me talking about it. \n\nOur 6th anniversary came and went over the holiday break - he remembered a couple days before but did not plan anything. The day of was forgettable. He did however, buy me grocery store flowers and write a nice note in a card.\n\nI still feel skeptical. I’m hesitant and I don’t know if this is genuine. We are attending a work conference in a month for his company and I am concerned that his change in attitude is to “keep me in line” so we present well and I don’t embarrass him. I feel like he is trying to check the boxes that he thinks will make me happy without actually put in real effort. I also feel like he is trying and I should give him a chance. I don’t know what to do. \n\nTLDR: An update to an [old post](https://www.reddit.com/r/relationships/comments/d5my92/my_f31_husband_m34_of_5_years_together_for_9/). Comments made me think that I had exaggerated, until a series of things triggered me to plan to leave (as 90% of comments told me to). When I told him I wasn't scared of divorce and that it had crossed my mind he freaked out, and in 2 hours came back to me that he was going to fight for us, and that we can be better. He has been better, but I  can't seem to shake my hesitation.",
        "permalink": "/r/relationships/comments/elfi2g/update_apparently_i_f31_married_a_narcissist_m35/",
        "comments": [
            "This is unfortunately really common in unhealthy relationships. Check the cycle of abuse or narcissistic behaviour pattern, and they all have a \"honeymoon stage\" they hit just after they think they've pushed things too far and want to reel you back in. How long it'll take to finish and roll around to the bad stage again will depend on how badly you scared him. If very thoroughly, he will wait until something changes which will make it harder for you to leave. There is a reason most people who have experienced abuse say the first time it became overt was just after they'd moved in together/got engaged/shared a financial commitment/similar.\n\nAre you on birth control? Make sure it is one he can't tamper with. \n\nOr, if he thinks you're bluffing, tensions will slowly start to rise until he has an outburst again.\n\nDo you really want to spend the rest of your life with someone where unless they think you're on the verge of leaving treats you and the kids like shit?",
            "OP, You mentioned the \"grass is not greener on the other side\"; however, you also don't need to just divorce and get married again. This guy is a schmuck and you know it. \n\nThe grass COULD be greener if you shared responsibility and time with the kids and he was forced to through court and provide child support and you got some sense of freedom and life back instead of being a 1950s housewife. \n\nThe comments here have a pretty good sense of what's going on. Your hesitation and skepticism is warranted. Divorce doesn't need to be a bad thing but rather could be something to celebrate. Get some freedom and spontaneity into your life. Kids will be fine as well, you're obviously a very capable mother. Do you girl.",
            "I think you should Google the term \"love bombing\". It sounds like he has realized that he's pushed you too far, so he's trying to win you back by being extra \"good\". Eventually he will start to feel complacent and will likely go back to his old ways.\n\nNormally I would recommend marriage counseling, however if you truly believe he is a narcissist then it probably wouldn't be a good idea. He will just use therapy to manipulate you in new ways.",
            "Whether you decide to leave or stay, it won't do any harm to be financially independent and informed of your options. Better to be prepared and not use the information than to leave in a panic.\n\nAlso, it sounds like you two haven't really started to talk about the big issues, which should perhaps be done in couples councilling. Him making changes is good, but like your gut says - you're not convinced they're genuine changes.",
            "Love bombing or not, is his current level of trying enough for you? Like, is celebrating anniversaries with last-minute cards and flowers, listening to your ideas sometimes, and other behavior what you want for 30 years? \n\nOnly you can answer that for yourself.",
            "I really hate to tell you this, but his sweetness will last for a week or two.\n\n&#x200B;\n\nI have a narcissist mother, and after a huge fight she would swear everything will be better and we should treat eachother nicer. It always lasted a day or two weeks.\n\n&#x200B;\n\nHe's not going to change. I'm so sorry.",
            "The thing about love bombing, is that it can only last for so long.  It reminds me of any big lifestyle change such as working out.  The reason why people tend to do really well for a short while and then fall off over time is because motivation itself isn't good enough to keep the behavior going.  That is why you see people crowding gyms in January to only see the gyms empty by March. \n\nYour husband right now is worried that you might leave him because you are on to him, so he is giving you this entire new act so that you don't want to leave.  He has a pretty sweet deal having you to care for him and your kids, so he doesn't want to mess this up. Understandably so. You make his life easy. But just like any other drastic change in life, his motivation will eventually die out, and he will return back to normal.  \n\nSo I wouldn't get your hopes up.  Stay skeptical.  If he isn't doing the work it takes to repair a marriage in a genuine way (not just being nice to you), then this doesn't seem to be sincere.  And if he reverts back to his old ways, you will know that this was just a temporary act.  \n\nI wish you the best of luck, OP.",
            "I remember seeing the \"we are not breaking up\" statement. Made me uneasy to realize you are willing to put up with being treated like a maid for the rest of your life because you're too proud or whatever to call it quits. It resonated because I was in a similar situation, fortunately it was early in my life, and the experience taught me to stand up for myself and not treat relationships breaking like my personal failures. I see in your words what my life could have been like if I didn't break out of that mindset.",
            "> I also feel like he is trying and I should give him a chance. \n\nWhat is he actually trying? Is he trying by asking you whether you are happy in the marriage? By asking how he can be a better husband? By suggesting counseling? By actually booking appointments with a counselor?\n\nIt's been two months. Anyone can be on their best behaviour for two months. Token efforts and saying nice words aren't indicative of permanent change.",
            "Like a lot of other comments, this stinks of 'love bombing'. He could be genuinely trying to get back on your good side for wholesome reasons, but... I wouldn't bet on it. Being a good and loving and thoughtful partner is something he should be doing ON THE REGULAR, not just when he thinks he's going to lose his easy way of life. \n\nWhich is exactly what he's afraid of. He might just now be realizing how cushy it is having someone raise his kids and clean his house and cook his food. \n\nThat's not to say that there's no hope, but far far far too many men consider their wives an appliance that just needs a little routine upkeep every few months.",
            "OP, please find a good therapist for you. JUST for you, at least initially. It will help you work through your feelings and give you tools and scripts to deal with him. I think, like others are saying, his changes are temporary because you asserted yourself and he senses you slipping away from him. But your therapist can help you figure this all out.\n\nYou deserve you time to determine your next step. The grass may not be greener on the other side. But it might be less full of dog shit... and you can grow your own grass. ❤️",
            "I went through this in a 9 year relationship. I finally stopped taking so much shit and he also half assed changed in order to try to keep me around. His true self was still there underneath and I finally got out. I had no idea healthy relationships existed bc all of my previous ones were terrible too. It turns out, when you start loving yourself and recognizing that you deserve better - better shows up in your life. I hope you see this as what it is and walk away now. Your gut is telling you exactly what the right move is. Be free.",
            "What he's doing is called love bombing.  It's intended to stop you from leaving.  \n\nIt isn't a permanent change and things will slide again.  It's a cycle. \n\nWhat I'd advice Op is that you start quiet preparations to leave.  Find a job,  figure out how and where to leave.  Get important paperwork into a go back and put it somewhere outside the house that he'll never find (IE your parents home,  a bank - not the car). \n\nWhen he eventually goes back to the way he was before,  enact these plans.  Don't start your cycle of thinking about what to do again.",
            "He's trying to lull you into complacency, but do not underestimate how diabolical he could be. He could be already talking to a lawyer and scheming how to leave you with nothing",
            "Don't shake off your hesitation, after 5 years of taking you for granted you have every right to be skeptical about this \"change\". This may be real but this may also be his of way of just calming you down and waiting to start it all over again. I suggest maybe if you don't mind waiting it out a bit, best case scenario it's real, worst it's not but you have to have a talk with yourself before that. If it's not real and he was just trying to lure you into complacency until he can start again then what ? Are you breaking it off ? Counselling ? Or are you giving him another free chance ( I really don't think that's a good idea ). Please come up with a plan.\n\n If you do mind waiting him out then don't wait for him to do something, don't waste the time you could be using getting you things sorted out and you and your kids getting over him/this situation. Thinking this way or more like having to think this way about the person that is supposed to be your significant other is not healthy.",
            "I did this back a forth thing wit my ex too long. He would be just nice enough I felt bad for not appreciating his  effort.  What I didn't see or understand was how he just bit by bit chipped away at me. Divorce was threatened several times and I always caved and came crawling back apologizing.  When the final time came and I didn't back down I think he was actually in such shock (still is) that he hasn't even processed it yet.",
            "I’m so happy to hear an update from you. Your first post broke my heart. Anyway, what he’s doing, is classic love bombing. His total personality switch isn’t genuine. \n\nIf I were you, I would keep standing my ground like the amazing strong spined Wonder Woman you have been lately. And slowly and quietly, keep looking for a good job, save some money back in another account at a different bank, and only do online statements.  Go talk to a divorce lawyer,  (they do free consultations most of the time.) And when the time is right, and he inevitably  starts being abusive again,  give him his well-earned walking papers.  \n\nYou’re stronger without him. Your kids will grow up happier without being caught in the middle of his rage and poor examples of how to control his emotions and treat those who you’re supposed to love above all others. You can do this.",
            "It's not genuine. It's called love bombing. He will slip back into his old ways.",
            "A narcissist will never change. Other replies in this thread have mentioned things like love bombing and how they fit into a cycle of abuse. I am sure that this is not the first time you've been caught in a cycle of your husband wooing you back into his good graces, only to slide back into his rotten, nasty behavior. The only advice I can really offer here is to find a way out, because there's no winning with a narcissist. Your self-worth will continue to suffer in this relationship, and it's going to traumatize the heck out of your kids, more than it probably already has. \n\nI'd suggest looking up someone like Dr. Ramani Durvasala on YouTube for resources on narcissism and how these relationships play out for more information. I'd also suggest seeking out a therapist, if you don't have one already, ASAP, as recovering from a narcissistic relationship is going to take a lot of time, unpacking, and processing. Good luck, we're all rooting for you.",
            "It isn't genuine. Stop lying to yourself. You have kids depending on you here to provide them a non-dysfunctional household.",
            ">Our 6th anniversary came and went over the holiday break - he remembered a couple days before but did not plan anything. The day of was forgettable. He did however, buy me grocery store flowers and write a nice note in a card.  \n>  \n>I still feel skeptical. I’m hesitant and I don’t know if this is genuine.\n\nThis is sad. A sad handful of carnations and him backing down a few times because you don't take the bait is enough to qualify as an improvement? Either way, I'm glad you are beginning to imagine what leaving looks like in your mind. \n\nIf you are not going to leave, without intense counseling and a counselor's input, this sounds to me like a sideways parallel, not an upward trajectory towards a better marriage.",
            "Wait and see how it goes. It is still on the fence, and could land on either side. \n\nPerhaps keep your goals for the relationship written down somewhere on your phone, and revisit them whenever you are doubting yourself. You should be closer towards a happy relationship, not stagnant or further away.",
            "Listen girl. YOU CAN DO IT. This situation sounds all too familiar to me. My ex husband did the same, seeming to not think much of me ever, me always not being enough, until suddenly he started changing his tune when I wanted to leave. I swooned any time I got that bit of attention, until finally I realized none of it was genuine. It was all manipulative bullshit. And it only became clearer when I got out.\n\nYou can do it. You can do it. Keep supportive friends with you, sending all my love. If it’s anything like my experience, you’ll feel a bit more like yourself as soon as you walk out that door. It’s rough losing yourself to somebody. Can’t wait for you to be on the other side.",
            "Trust your instict to hesitate.",
            "My dad was what your husband is so I just felt like I should say what I noticed from my experience. \n\n1. Narcs love partners who are codependent, if that’s not already something you know about or have researched it’s extremely important that you do. I’m not saying you are codependent, but it’s a very consistent pattern with narcs. This is also why most people who divorce narcs, remarry to another narc. \n\n2. If he is truly a narc, no matter what he does that appears to be for his family is absolutely for himself.  My dad tended to need to look good for whom ever he deemed important. When his family stopped making him look good, he was out.  This is also a consistent pattern with narcs.\n\nThe best of luck to you, love yourself, stay strong and listen to that internal voice that reminds what you normal looks like.",
            "What he's doing is not love bombing. The defintion is clear and he is not doing that, an apology and supermarket flowers are not love bmbing. He IS trying, he's still a jerk but he's trying to make an effort. Regarding the anniversary, what did you do for him?",
            ">I'm sure some people parent with shame intentionally but I am NOT okay with it.\n\nNo, no one should be. We've basically come to the scientific conclusion this is abuse and a major root cause of adult issues. Children internalize shame, not being developed enough to really manage it in a healthy manner, and get all kinds of fucked up issues later on in life. Granted, you can't prevent all shaming and some will happen, but it shouldn't be happening at the hands of parents. \n\n\nGo you girl for grey rocking the shit out of your husband! It's a good tatic to try to keep sane. \n\n>I still feel skeptical. I’m hesitant and I don’t know if this is genuine. We are attending a work conference in a month for his company and I am concerned that his change in attitude is to “keep me in line” so we present well and I don’t embarrass him. \n\nPlease consider learning more about the cycle of abuse and how it relates to narcissism. If he is, and he sounds like he might have some tendencies of narcissism, they're all basically the same and follow the same routine. His actions will speak for him. A good rule of thumb is forget what people say, what do they do?",
            "I’m just reading a book called ‘if he’s so great, why do I feel so bad’, you should read it! It explains all the subtle ways they abuse us without us realising. Also google the ‘grey rock’ technique as it might come in handy for you dealing with him in the future! It’s great now you’ve started recognising signs! Do lots of research about it so you can heal and not end up with another one!",
            "I was waiting for the part where his behavior improved and he suddenly looks like he's trying. I didn't find it.    \n\nJust start your exit plan. This isn't going to improve. You don't want this for your entire life, and you don't want this to be what your kids believe is normal.",
            "[removed]",
            "He’s lovebombing.\n\nHe will *not* change long term.\n\nFor the love of fuck, please please leave and do not look back. For your own and your kids sake",
            "Unless he's in therapy and making an actual concerted effort to do better, be prepared for this to be him just buttering you up so you don't leave. I'd have a backup plan in place. Your gut is telling you to be wary for a reason.",
            "Taking back authority and equalizing the balance of power in the relationship is very important, which relates to finding yourself work and changing the duties of care in the house and of children.\n\nIf you want a shot and see how he takes this longer term, keep moving forward. Get a job, get a hobby, sign up kiddo for that thing but he has to share, etc. \n\nThen see how it goes. At least you'll feel more empowered and may be better set up to have a separation if you decide that's best. \n\nBut yes, it sounds like he's placating you and testing to see how long and how much he has to be attentive to keep you satisfied. Don't buy it, push through and rebalance the power!",
            "There is no use in living with a narcissist or trying to live with one. Get out, get therapy and get your kids the same thing. He really is shitty at the love bombing.",
            "Jesus lady, this guy sounds like a waste dump. Every amount of effort you throw at him is inevitably lost and wasted. Have some self respect and divorce him already",
            "To be honest you sounded a bit like a doormat in your first post - harsh, I know.  It takes an asshole to take advantage of someone in that position, but as another commenter mentioned you and you alone are responsible for your own well-being.\n\nIt sounds like you’ve started to advocate for yourself more and he has taken notice. The only way to know if this is a sustained change and not part of some abuse cycle is to keep it up, keep demanding his respect and asserting your boundaries, and keep prioritizing your own happiness. If he truly is changing, it may not be as hard to get him into counseling as you think once he has learned to treat you with respect and take you seriously.",
            "Just keep working on being the strong independent woman you are, and dont let your guard down.\n\nTime will give you the insight you need.",
            "My advice: be sure to not fall into a cycle.  \n   \nThe other comments have already pointed out that if he is a narcissist, he will go back to his old ways and when you are again carefully thinking about leaving, he will love bomb you again.  \n   \nWhen you fall into the cycle, it will be much harder for you to leave. It won't be as \"easy\" as it was in these last 2 months.  \n\n\nEither way, it's always good to have a plan in case, not just because he is selfish and self-centered, but also cheating, debilitating accidents, sickness death, etc. Don't be too dependent on him even if everything is ok.",
            "See if this new behavior sticks or fades away.",
            "I havent read every comment here but I hope you take the time you need to think about your relationship and your future. I'm a pretty young guy (M20), but even i have my fair share of narcissistic people. They get manipulative and careful about how they act so just be careful and find happiness.",
            "Oh girl, I know you think the grass isn't greener, but the grass you have now is like, a big patch of dry dirt with a single sad dandelion in the middle. Free yourself from the dirt patch. You sound like a serious badass; I know you can find a luscious lawn that respects and appreciates you.",
            "My ex was sweet when he knew I would walk away.  Tried to give him the benefit of doubt, but after 5 days of not hearing from him during which time I had a medical emergency, I realised he wasn't going to change and I walked away.  Your husband might be putting in genuine effort, or he might not be.  If you really want to give things a sincere try, then consider therapy for the two of you.  Let him prove with his actions, not his words, that he wants to change.",
            "Don't have any advice, but I do have a question.  What does he think you might do to embarrass him at a company function?",
            "How old are your children? If they are not under 10...sometimes even 8 years. Then they can stay away from you a few hours and not be neglected. What I mean is look into part time work. Maybe on the weekends where he can watch the children and you can gain some confidence and some financial independence.",
            "Nothing changed, this is the cycle. Break the cycle.",
            "You dont respect yourself at all. What would you comment on this post if someone else had written it? Or if a friend told you about their miserable relationship? \n\nHe KNOWS that you aren't gonna leave, once you take away this capacity then he can pretty much treat you however he likes with no consequences. \n\nLike other people said, you are not only destroying your own life (by reducing it to working around the house and running after kids whilst being manipulated in to doing all the housework etc) but that of your kids. Cos they are gonna grow up to think this kind of relationship is 'normal' and will subsequently end up in toxic relationships as well. \n\nWhy are you staying with this guy? If it's for the kids, then you are actually wrong cos it wont benefit them to have parents in an abusive relationship. They would be better off if you guys got divorced and they rarely seen their Dad. .\n\nOther than that, there is very little reason to stay with him. \n\nLet me put this very simply; why would you VOLUNTARILY remain in a relationship where the person treats you like crap and doesnt respect you?",
            "I'm late to reply to this but as someone who just ended a marriage to a man with clinically diagnosed NPD I had to weigh in. \n\nTrust your intuition. To quote Gavin Debecker- Author of \"The Gift of Fear\", the book I truly believe saved my life-\"Intuition is always right in at least two important ways;It is always in response to something. It always has your best interest in mind\"\n\nYOU are in the best position to determine who this person you married truly is. I can't say based on anything you wrote if he is a narcissist or he isn't- but if you suspect it, and you identify with what you read about narcissistic abuse, I think you have your answer.\n\nMy advice for anyone who has so much as an inkling they are with a narc is RUN. It's not worth sticking around to find out one way or another. Even if you married them, even if you share children, as crazy as that may sound. \n\nI knew. I knew EARLY. Before we lived together, before we got married, hell before we even met in person. I started researching narcissim and narcissistic abuse, felt the hair stand up on the back of my neck as I kept reading thinking holy shit, this is spot on.\n\nI called it off. He love bombed me, I started to second guess myself- *Maybe I'm just afraid of intimacy? What if I'm just subconsciously trying to sabatoge my own happiness? Maybe I'M the narcissist and I'm just projecting!* \n\nI moved halfway across the country with my daughter to be with him. I forgot all about narcissim and forgot I even went down that rabbit hole in the first place- it was totally off my radar. \n\nThen he started being abusive in ways I couldn't ignore. Emotional and ambient abuse became verbal and unmistakable.\n\n Then he started shoving me, tripping me, getting in my face and screaming. \n\nThen he backhanded me. Hard enough to make my nose bleed. \n\nThen he punched me, and kept punching me- in the face, my skull, my arm that I used to shield my head while I somehow managed to use my other hand to send my friend the Facebook message that probably saved my life \n\nHe was choking me to the point my vision was going black when the cops showed up. My jaw was dislocated, my tooth chipped, filling shattered, lacerated scalp. We had been married less than a year.\n\nI came up with every possible explanation- a brain tumor, his epilepsy, his drinking, a medication reaction, mental illness, split personality....I swore it came out of nowhere! \n\nAnd then 3 years later- July of this year- it finally clicked. I suddenly remembered that whole narcissist rabbit hole I went down way in the beginning. Re-activated my Facebook and saw I joined a group called \"survivors of narcissistic ex husbands\" in 2014...before we met. Got curious and snooped in his medical records (not my proudest moment) and sure nuff- NPD with APD features. \n\nBeing with a narc is soul crushing. It's lonliness and emptiness every day of your life. Even if it doesn't get to that extreme- it will chip away every last piece of your identity, your self esteem, and your humanity. I wouldn't wish it on my first enemy- not even him. \n\nI would give anything to be able to go back in time, and run for the hills the moment I had that first realization.\n\nTrust your intuition.",
            "He knows you're on the verge of leaving and his idea of making an effort was grocery store flowers.\n\n&#x200B;\n\nConsider that him on his best behavior, knowing he is on the verge of losing the woman he supposedly loves, is fobbing you off with a bit of flattery and a cheap bunch of flowers.",
            "\"You're the best at cleaning the house\". That shit is not romance or love, cmon. Google the \"cycle of abuse\", this is textbook stuff",
            "SEems like he is playing the good guy to get you on his side again. Be careful. It won't sustain very long and he'll go back to narcissistic behavior. I would start looking into your options \"in case\" (for sure) he does go back to being an ass again. He probably will and when/if he does, you'll be ready and have your ducks in a row to take care of yourself.",
            "Keep in mind that it’s very common for many people to slack off (not just in relationships but in friendships, work, hobbies, etc) and take the situation for granted, only to panic and overcompensate when the situation looks to be threatened. Sometimes they develop a better appreciation of their relationship/job/friendship and work harder to be in it, but often they just slip back into old habits once the ‘danger’ has passed.",
            "He may change, he may not. Have an exit plan ready just in case.",
            "[deleted]",
            "OR (if he’s not a full on narcissist): Your friends told him you had second thoughts in your marriage and he now sees the errors of his ways.",
            "This is the hard part about hurt feelings.  Even though it seems like he is trying, your feelings are too hurt from past experiences to trust that he is being sincere so you assume he has bad intentions.  While this may be true, if you are at a point where you can't believe your partner even has good intentions, it is best to just call it and move on.  There is no point for him to try to do better if you still end up believing the worst about him.  He might as well just be a bad guy if you still believe he is bad even when he tries to do good.  I understand that some past hurt is too much to forgive so I'm not trying to pass judgement on you here.  I'm just saying that you being suspicious and assuming the worst about someone has a way of being a self fulfilling prophecy.  Both partners in a relationship have to believe in the possibility of change and both have to be heavily invested in making that change a reality for it it ever happen.  It sounds like you may be too hurt for that.",
            "wait and see. This costs you nothing. People are like teabags. you want to see whats inside them? put them in hot water. Give it time to see what brews. This doesnt mean punish him, it means you've poured the glass, wait and see.",
            "I tried...\n\nBut if you married a person and it took you you 5 years to realize that he's not perfect... And the worst thing you can say about him is that he's a narcissist... then you have some pretty unrealistic expectations of life.\n\nI'd have more sympathy for you if you buckled down and dealt with your problem like the adult you technically are. Instead, you're here on Reddit doing your best to be a Kardashian.\n\nWho's the real narcissist?\n\nDeal with your problem. You know what needs to be done.",
            "[deleted]",
            "Love Bombing - being sweet and nice and loving out of character when they are aware the relationship is faltering. Meant to pull you back into their grasp so you don't follow through and leave. Good luck.",
            "If he is trying and all you have is doubt it kinda says where you are in the relationship doesn't it\n\nIN this case you are saying he has made more attempts at considering you then ever based on your old post but you feel like it's still somehow about him and not about your guys future, I think that says alot.",
            "Love bombing is part of the trauma bonding. Please, listen to your gut, and talk to someone trained to help  you <3",
            "Listen to your instincts (in the last paragraph). Get a lawyer before he does.\n\nYou know you don't want the next 35 years to look like the last few weeks or the years before that. If you don't do something, it is guaranteed it will.\n\nFor your kids sake, get constant counseling (for everyone in your family) to combat his narcissism or get out. Otherwise, the kids will learn everything you don't want them to learn from him.\n\nI'm sorry to say this, but it is the cold truth of it. Everyday of inaction brings you more future regret.",
            "If he ends up just doing this to \"keep you in line\" like you said then at least you'll have your answer. Worst case scenario you follow through on what you already intended to do. Best case: he's actually trying.",
            "I sure hope for you he isn't a narcissist and just needed a wake up call. If you're still ready to give him a chance, do so but watch his behavior closely.",
            "Have you ever read any books about dating narcissists?  Because it sounds like he is love bombing you.",
            "Yeah... the unicorn farts and bunny kisses won't last. It's just to reel you back in. If he's truly a narcissist, he's not going to develop emotional empathy at 35 and become the thoughtful and caring person to you and your kids that you need, respecting you as individuals. If you won't leave for your own sake, consider what living with him and his cycle of emotional neglect, fights, and love-bombing does to your kids, psychologically.",
            "oh wow i remember your last post. i’m not at all convinced he doesn’t just want to keep his screwable housemaid in service.",
            "If you are going to take the watch and see method I would definitely consider couples counseling and even your own separate therapist who will have only your interest at heart.",
            "Mmmm well you can suspiciously go along with it and see if his behaviour reverts after the thing that's important to him as long as you dont let your guard down. But if he gives any indication at all that the change isnt permanent you know what to do",
            "You deserve a relationship where you can be you free of shame and where you feel empowered to make your own choices.\n\nI also want to say that divorce can be a good thing, something to celebrate and the start of a new chapter. It can be a good thing too. \n\nWith him.. without him ... I hope you are able to find that.",
            "Him being scared is temporary. And it's a tactic Narcissistic people use to hook you in into believing they are going to change for good: THEY WON'T.  GET OUT NOW and give your kids the quality of life your husband is trying to sabotage.",
            "Love bombing. My nmom does this shit, don't fall for it!!!",
            "Hope for the best, but plan for the worst.  Maybe somehow, miraculously, he has pulled his head out of his ass and is doing better.  If so - good for you!  But just in case it's a facade or he relapses later, please consult a lawyer and proceed as if you have to lock everything down to protect yourself and your kids.  \n\nI hope you (and your kids) will be safe and happy.",
            "It's possible that this was a moment of clarity for him to realize he can definitely lose you, and it's getting him to get his act together, but like you, I'm skeptical if it will last.",
            "My ex is a narcissist, he said the same thing, I had to throw all my belongings in the back of a van while he was at work one day. Apparently, fighting for us meant unlawful imprisonment of me. When you try to break it off that's when shit hits the fan, but don't stop, don't expose yourself and your child to this bs any longer. If you think they don't see, they don't feel it, you're wrong.\n\nIf he's a narc, (likely) then he will not keep his promise. Unfortunately, its people who love a narc that end up being the one to diagnose them. It's the one of the few disorders that ever get a clinical diagnoses, could you imagine if a narc was able to see they were flawed?\n\nIt's rare, but some do, and unfortunately they get worse when they have therapy. Cognitive behavioural therapy only gives a narc a bigger advantage and isn't often clinically recommended.",
            "[removed]",
            "Hysterical bonding. If he's serious do couples counseling. Counseling isn't passive activity. If he's not engaged in the process call it out. Then get a lawyer. Life's too short.",
            "Please be aware that situations like this are the exception, the minority. It's the same with women who have done heinious things to their husbands.\n\nJust don't forget that the majority of us men (and women!) are totally decent and don't let bad experiences tarnish your whole opinion of the opposite sex, I have not.\n\nEnd of the day, a lot of us invite drama into our life without realising it and it sucks, but don't tarnish all men with the same brush, generally people are prettty decent.\n\nThat's just my two cents, Destan.",
            "This isn’t healthy. You deserve better. Far too young to waste the rest of your life being skeptical and on edge with this guy.",
            "Sounds like my relationship. I mean my husband definitely seems like a narcissist. Everything is about him. He is the type that will never, and never has asked about my dreams. And only encourages me to do things that he idealized and felt worked for him. When we were younger and I wanted to pursue a nursing career - he literally said “gross no. I would never date you if you were a nurse. It grosses me out!” Of course he backpedaled a bit and tried to put a positive spin on things and encouraging in my current design career. Because it suited his ideal - whatever that was. But had I understood what that interaction was, what it revealed to me, I would certainly have saved myself years of heartbreak. We have two beautiful kids and that’s the only thing worth taking from this relationship.\n\nYou sound like you probably have some determination and drive left in you to live your life. If any part of you doubts what the truth of your relationship, then you know what you should do. Don’t let him charm you back into wasting anymore years. You’ve got one life!",
            "Just in case: \n\nI hope that you have the financial means to be independent if needed. \n\nHave you kept your workplace skills up to date if you don't?",
            "[removed]",
            "Get Counselling. People throw Marriages for less than this and I think this marriage has potential to still work out well 😊",
            "Jesus christ the marriages people get themselves into. Like you had kids with this guy? Who marries for a second time at 22. Like even if you have nothing and no one and no education how is renting a room while working min wage worse and harder than marrying and breeding with a narcissist. Girl leave. Like. Im glad your smartening up... its at glacial pace but at least its happening. Plus dont you get like alimony and child support? How is being alone worse than being with this guy. You need to learn serious boundaries and self worth. Leave and then take great care about who you let in your life. You attracted a narcissist once unless you work on yourself you'll attract another. Good luck. The parenting via shaming nip that in the bud aggressively. Being an adult with shame problems is the gateway to a life riddled with mental illness. Also tell your kid that when dad does that its cause hes deranged and fucked and to not listen to him at all. Parents who parent with shame are emotional black holes with no other tools in their parenting tool box. Careful your most sensitive one will get the brunt of it. Make sure they know they're not a POS.",
            "If you’re not following the JustNo subs, I think you should. Specifically r/justnoso but r/justnomil is busier and gives insight into badly behaved spouses as well as their mothers. \n\nI’m the daughter of a narcissist father who’s mother was always too afraid to leave. They’re in their 60’s now and I’ve had to move back with them due to my health. It’s mums biggest regret in life, staying. \n\nThe physical abuse was directed at me growing up. So maybe consider that aspect when you’re weighing up your options, you will not always be his only victim and they tailor their abuse to each person.",
            "[removed]",
            "Please look at things objectively,  I find it strange how people lighthearteldy comment \"leave him, leave him, leave him\"  on someone's relationship that they know probably 0.1% of. I also find it frightening  how seriously people take this advice on board. Who are those commenters ?  Maybe they are barely 17 and dont know a thing about adult  long term relationships? Maybe they are people who themselves are serial losers and have multiple unresolved psychological  issues ? \n\nYou are hurting, you feel taken for granted,  you feel that your happiness depends on your husbands appreciation. In the past he filled your empty cracks and you , as a person, felt complete. The trick is that YOU  is in charge of your own happiness, you have to complete yourself,  you fulfill yourself firstly and then you share.\n\nIt's a little bit immature to ask your husband to be responsible for your personal growth and completeness. You are an adult now.",
            "Work on your marriage, you have kids. He is not perfect but he is not abusive and your life is not in danger. If he loves you, these problems can be fixed; counseling is a great place to begin. \n\nCommunicate with him (not through arguing) where you have issues in the relationship and what you want; where he is failing and how he’ll need to compromise to find a middle ground.",
            "[deleted]",
            "Okay let's think logically for a second. Literally everyone is speaking negatively of your husband based on only two posts. But in reality, none of us know him at all like you do. If he's genuinely trying and changing, that's at least a step in the right direction. I say wait it out and see if this continues or if he continues to treat you the way you deserve to be treated. But if he doesn't, and he does revert back to his old ways I would consider divorce. The only reason I'm saying that you should wait this out and keep giving it a chance is for your children.",
            "We're only seeing this over the internet and so none of us can say for sure that he is something as extreme as an actual narcissist or that he is lovebombing you as others have suggested. But if he wants to really make long term changes, you guys should really do some couples counseling and he needs to step up to the plate and do some counseling on his own. Even if it's not as severe as narcissism, these kinds of changes in behavior don't happen overnight and there are times when it will falter.",
            "Don't jump the gun, have you guys tried counseling? Also does he only work and provide financially, or do you both work and split the rent?",
            "I'm sorry but I honestly think that it doesn't matter what advice anybody gives you because no matter what you're going to stay and you're going to put up with this Behavior because in a couple weeks maybe a month or two he's going to go back to being the same old person the way I see it think to yourself about you being 50 years old and waking up one day are you going to be happy with your life or are you going to regret it?",
            "I understand you have two kids and it will be a messy long road ahead of you filing for a divorce. What about sticking it out with your husband while following a strict code rules of an affair. Just food for thought. Please just check out this subreddit r/adultery. Just go in with an open mind. I know plenty of users will see my comment as taboo but some people are happily in an affair while still keeping keeping their family together. I hope you will find your happiness. I highly recommend this book (Stop Caretaking the Borderline or Narcissist by Margalis Fjelstad)",
            "Again people are being way too hypervigilent on situations that are completely normal and very common. Your husband may take you for granted but that doesn’t make him an narcissist. I’ve dated a narcissist and using labels like this just devalues real abuse victims. \n\nThis situation is just what happens sometimes when you’re in a relationship for 9 years and complacency sets in.  Counseling is needed for this one because expectations have to be reset to get things back on track.",
            "You have a division of labor where you’re a team and you work inside the home and he works outside.  He doesn’t thank you for all you do. But do you thank him?  I don’t understand why he has to repay you. He’s flawed.  Maybe deeply flawed.  Aren’t we all.  But I think he’s trying. I would look for happiness outside of him appreciating and being grateful for all you do. Spend less time doing housework perfectly and planning elaborate dinner parties for his mom and dad and pick up a fulfilling and interesting hobby. Don’t let your happiness depend on this man.",
            "I always recommend couples therapy and doing EVERYTHING possible to save the family before making any decisions on the divorce. Even if you end up taking the divorce route - it will be easier because you both will know that you truly tried your best to save the family. And then there's also a chance you find a way to reconnect and you both will learn to appreciate each other. Family is worth fighting for and divorce is extra hard on the kids  (speaking from personal experience as a single mom of 2 for the past 4 years)",
            "Wow. I'm not going to propose to know whats actually going on in your relationship. Maybe he's a shit and you should leave him. But I can tell you I don't see you taking any ownership over issues that might be between you and your partner. My honest perception is that your not actually engaging with him and instead cultivating a position for yourself of how you have been wronged based on things you think he \"should know\" to do. It's also obvious to me that you don't actually see him as an equal and rather someone that should be managed to fit the way you want him to. I also think you're creating a dishonest, destructive game by not having more thorough communication with him. I think deep down your actually trying to make things worse (without knowing it) in order to validate what you think is going to make it better. And I think you are setting yourself up for both you and he to lose in the short and long run. \n\nBut fuck me, it's your show. I don't really care, I'm just not going to deny what may be a truer true or sugar coat it for you. I could be 100% wrong and he could be a shit. And you could be hiding the reality of it through reddit in a thousand ways. Good luck.",
            "i'd refrain from letting your girlfriends swaying you to break up (they didn't go through everything and are not sleeping with you s.o. everyday). if you need space, give yourself space. then come back to the relationship. but let that be your own decision",
            "Love isn't real. And I mean romantic in love. All the kids shows showed me was fabricated \"love\". They made believe falling in love was milestone I was going to reach, they me feel like I knew what love would feel like.\n\nWe are all just lying to ourselves. We are just infatuated, or in love of the idea of love. Wou cannot rationalize how come some can get married, and commit their life to someone, and then get divorced later on in life. How can someone. Feel so sure, so strongly about someone, only to leave them.",
            "[deleted]",
            "[removed]",
            "Buy some new lingerie and get a bottle of wine and ice cream with the hard shell chocolate syrup and whipped cream"
        ]
    }
]