[
    {
        "post_id": "4a1qub",
        "author": "Throwaway839313",
        "title": "UPDATE: How can I[23F] get my husband[33M] of three years to fall in love with me?",
        "url": "https://www.reddit.com/r/relationships/comments/4a1qub/update_how_can_i23f_get_my_husband33m_of_three/",
        "score": 2109,
        "num_comments": 105,
        "created_utc": 1457745146.0,
        "selftext": "https://rr.reddit.com/r/relationships/comments/49vwh6/how_can_i23f_get_my_husband33m_of_3_years_to_fall/\n\nI talked to him about how I feel today. After I told him he started laughing and said that he'd never heard something so ridiculous in his life of course he loves me and that he treats me like a friend because I am his best friend. \n\nHe also told me that anytime he says anything that hurts or offends me that I need to tell him so he can apologize. And apparently his brothers have a nickname for me \"the upgrade\". \n\n\n\n   \n**tl;dr**: He loves me after all.",
        "permalink": "/r/relationships/comments/4a1qub/update_how_can_i23f_get_my_husband33m_of_three/",
        "comments": [
            ">And apparently his brothers have a nickname for me \"the upgrade\". \n\nThat's ridiculously sweet. ",
            "That's great!\n\nMoving forward, make sure he understands that he needs to express his love and make you feel loved; knowing it logically is one thing, but you need your emotions fed too.",
            "You guys should look into the Five Love Languages. It's a system for types of affection, everyone prefers a different kind of affection, so if you do the online quiz together you can find out what affection you prefer and which he prefers, and make each other feel loved.",
            "The Upgrade - I love that :)\n\n*Nana internet hug*",
            "lol you dork",
            "I love happy updates! I think most people have a highly unrealistic expectation of what romantic love/marriage should be. The best and most loving marriages I have witnessed (and my own goal for my marriage) have been between best friends. They communicate well, have common goals(often confused with common interests, but it's where you are going more than where you are or have been), mutual respect and a protective instinct. ",
            "This is one of the best and sweetest updates ever. ",
            "Aw, this is so sweet :) :)\n\nI hope you get to internalize the idea that you're not \"ugly\" because you're \"tall and dark.\" that makes me so sad. Not because my culture values those attributes (I'm 6'2\" and pasty and I get what it feels like to not be what you've been told you should be). Not because your husband loves you (though it was so sweet and heart warming to read your update! Yay!) But because you are complex and interesting and kind and open-hearted and whatever else you are (I don't know you that well ;) and that's the kind of thing that will last :) you are a great partner and you deserve the same.\n\n(although if you find a way to get shorter, PM me ok? ;)",
            "FWIW, I tell my boyfriend of 4.5 years he is in the middle of the ven diagram between \"cool people I like to hang out with\" and \"hot people I'd like to +++.\" Friendship is the essential part of any good relationship and it is so often dismissed or not looked at as seriously as \"romantic love\" even though it is stronger, more long-lasting, consistent and the best basis for any thing more serious. \n\nMy boyfriend is unquestionably one of my best friends. I tell him absolutely everything (within reason) and he knows he can do the same with me. We constantly screw off and joke around and fist bump each other. There is a time and place for mushiness, but constant displays of \"romantic love\" are often forced or phony. But the mutual respect, interest, trust, and support of friendship isn't. ",
            "That is WONDERFUL !!!!!!\nMy husband was my best friend before we both told each other of our feelings. Mine wasn't under the best circumstance - drunk in Thailand (yes we holidayed together (like a couple, and lived together) with him holding my hair back while I was vomiting (Tequila shots in Thailand was about 40 cents Australian). I said it - the L- word) a few times that night, once he cleaned my up and showered me and cuddled me to sleep). In the morning I remembered but I kinda didn't mention it and neither did he. It was our last day, so we packed and off to the airport for an evening flight, arriving home at midnight and a few vodkas he asked if I remembered the Tequila night and I confessed and we went to bed (same bed as we always had since we moved in together 3 months after we met. ) \n\n\nThe next morning we were taking our pooch to the beach across the road from home, he said that he thinks he loves me too. Everything was normal as it had been before, accept some hand holding and way more kissing and sex than before).\n\nWe were in Sydney on a business trip (yes we worked together as well-I was his boss), and went up to an old observatory tower and just took in the views of the harbour bridge and Opera House, and we had the 'talk' . When we met he had just come out of a toxic engagement and came to my country to study (we met at uni, and talked online/texted constantly as soon as we met and had a very strong physical desire and personality qualities that complemented each other). I had also just left an abusive husband for good (this time!)\n\n\nDuring the 'talk' he admitted he was scared, that all the issues that he had would again surface once we were a 'couple' . He thought it would mean his quirky things (that I love about him - like drinking a beer in the shower after garden work), would put me off and he didn't want anything to change once we were a couple and even married. I told him the same,that weird things about me (like a sandwich has to be made properly - like cheese first, cheese always touches the bread, then protein and salads with lettuce at the top then condiments like relish can go between the bread and cheese, other condiments, like dressing/mayo go on top of salad then bread.... and yes I will deconstruct a pre-maid brought salad or sub and put it together the way a want it), might make him cringe. \n\nBut we both agreed we had seen the best of us and the worst of us, thus we are comfortable and already in a real relationship. We were engaged about 6 months later and,married the next year. Ten years ago but it still feels like yesterday!\n\nAll the best for your future :-)",
            "Awwwwwwwwwwwwwww\n\nThank you for the update. Warms the heart!\n\nCongratulations on being in a loving relationship with your husband and best friend",
            "Yay - happy ending! Yay for communication!",
            "This is super cute and you both sound super cute. I can't take it.",
            "This is great news but you need to work on your self-esteem.",
            "I'm saddened that being \"too dark\" was even in this problem. ",
            "Thank you for sharing your story. I an American and i am very ignorant about arranged marriages. We are taught to be biased against them. This was short but uplifting story about a perspective i know little about. You have helped me open my mind a bit more today. Your husband is a very lucky man to have a wife who cares so deeply.",
            "You guys are both super cute \n",
            "Happy hour shall commence ❤️",
            "Wow I think your tl;dr: update is great, and everyone on this update is clearly happy for you.  I am too. But, you need to now go back now and reflect on all your knee-jerk reactions to your initial comments and figure out a game plan for how not to react with so little self-confidence again, --  and for not trusting your best friend who loves you and for doubting your own trust of and love for him. You need to develop a clear plan for trust and love and more importantly, communicating that from here on out.  Keeping silent instead of speaking out initially, festers the communication process and no good comes from that.  Make a point of communicating daily.  Sometimes having a 15 minute recap of the past 24 hours is easier than trying to voice new things out of the blue.\nI just want to end this diatribe with a response to your initial post comment, \"But I don't think he loves me. He's ex wife was pretty and I'm not, I'm too tall and too dark\".  Everyone on this is Earth describes themselves as \"too\".  Stop it. And Stop it Now.  Even if you perceive yourself as  \"too\" tall and \"too\" dark.  So what?  I am \"too\" small and \"too\" white.  It doesn't matter!  Love sees through our exteriors and into the hearts of our interior selves and loves us.  Your SO loves you, don't second guess it.  Be honest and straight-forward in all things.  ",
            "See? Not as bad as you thought. Still consider working on your own self worth. You sound like an amazing and very charming lady and apparently your husband and his family think so too. Your mother probably did mean well and culturally, what she did is pretty normal but nonetheless, she was still wrong. I wish I was tall lol. And there's nothing wrong with not having light skin, either. ",
            "I'm very glad he loves you back. :)",
            "ahh see its all in communication. i relationship is based off trust and communication. if you cant communicate your thoughts then what is a marriage?",
            "Some people show their love in different ways. Your husband values you as his wife and best friend, and now you know how he views you because you communicated. You are an upgrade, you're intelligent and you communicate. That's big. For example, it's possible that his ex wife cheated because she schedule at communicating with him and as a result felt she was missing something, that's just a possible example. But you had a problem. And you went to him. You guys are and will be great. ",
            "Ha! Love the nickname.\n\nMy husband's brother called me his \"Outlaw Sister\" until I got married, because I wasn't an \"in-law\" yet. :P",
            "Aww! So nice and heart warming to read thank you, it made my day. It also shows that the best way to find out how things really are is to really communicate with each other. \n\nAnd I bet you're actually prettier than you think you are. You are certainly pretty to him why would he tell you otherwise about \"the upgrade\". So sweet and it is to help you see your beauty. ",
            "In would just talk to him about ways to make you feel loved, and what makes him feel loved. For me and my partner we buy each other treats when we see something for each other, the other day he had a long day at work so I bought him the new/old Pokemon game, a case for his travel card be some Pokemon cards.\n\nIt's just about how to make each other feel loved.",
            "Communication, the key to any successful relationship!",
            "Where are you from?(if you dont mind me asking) im arab so arranged marriage is normal but never discussed on reddit",
            "So happy this turned out!  Communication is key in relationships, you guys are going to be fine.  I read about a hashtag recently- #unfairandlovely that you should check out (Google articles and images).  It was started by two smokin dark south Asian women to celebrate dark skin.  You'll find some gorgeous and confident dark women with this hashtag, go check it out!  Embrace your dark skin!\n\nAlso, my husband and I don't cuddle before bed either, it's just not some peoples thing.  Neither of us can fall asleep if we are cuddling, so we only do it on the couch or if we are having sexytimes.  ",
            "It sounds like you've ended up with a really nice partner. Make sure to work on your communication to keep the relationship healthy; not only tell him when you're feeling hurt or confused, but make sure to express your own feelings of affection as well; you say he wasn't at the top of anyone's list - is that still how you feel about him?\n\nSince your self-confidence is so very low, you should work on that too. I'm sure your partner doesn't think of you as \"not attractive,\" an undesirable wife, \"too tall,\" or \"too dark.\" Consider seeing a therapist for support in this. You don't want to risk your very nice-sounding relationship to turn sour due to co-dependency.\n\nSince your self-confidence is so very low, try to find the courage to tell your partner this. And make sure not to let it turn into fishing for compliments. Ultimately you need to be happy with how you see yourself, and not how you think others view you.",
            "Eeee that made me happy. \n\nAnd be the big spoon, or the jetpack! You snuggle him, no foot in balls. Me and hubby do that as he's a hot water bottle and I'm cold as, so I can snuggle, get warm, then move away. Even though I'm pregnant I still love him snuggling through the pillow and stroking whatever part he can touch :) ",
            "I suggest couples counseling if your communication is that bad. ",
            "Why did you get married if you weren't in love?",
            "[deleted]"
        ]
    },
    {
        "post_id": "3np7rh",
        "author": "justjusticeice",
        "title": "Me [36 M] with my wife [36 F] (married a year, been together 6 years): She wants to have a gay guy friend come over and sleep in our bed and cuddle with her while I'm out of town. I got weird about it. Am I being unreasonable?",
        "url": "https://www.reddit.com/r/relationships/comments/3np7rh/me_36_m_with_my_wife_36_f_married_a_year_been/",
        "score": 2104,
        "num_comments": 539,
        "created_utc": 1444135093.0,
        "selftext": "I know and met the guy. He's a nice guy.  You would never guess him to be gay in any way. He and my wife clicked right away.\n\nAnyway, we don't know him *that* well. We've hung out maybe 4 times. My wife asked me right out if I would care if he came over when I was out of town and slept with her.  Said there was nothing wrong with cuddling with a gay man. Actually went on to say that she could have a full-on emotional relationship with someone without it being sexual (which geez kinda sounds like an emotional affair to me).\n\nSo I got weird about it.  Not sure why exactly, but I'm not comfortable with another guy in my bed with my wife when I'm not there. Gay or straight.  Perhaps it's worth mentioning that he was straight most of his life. Perhaps it isn't.\n\nThe thing that bothers me most is that she didn't say \"Ok, thank you for sharing your boundary with me. I wont push the issue.\"  -- She *did* push the issue. Argued as to why I was wrong about it. Brought up past relationships of mine when I was with \"more alternative people\" and called me \"vanilla.\"  The whole exchange left me seething for  a myriad of reasons beyond the original discussion. I began to feel as if my feelings (even if they WERE old school or unreasonable) were Invalid. Never a good feel.\n\nWhat's your take?  Am I being unreasonable about the whole thing? Would you let a gay man sleep and cuddle in your bed with your wife while you weren't there? Why or why not? What if the tables were turned? For the ladies out there, would you let your husband sleep and cuddle with a gay woman while you were out of town? Thank you in advance.\n\n**tl;dr**: Wife wants to have a gay guy friend come over and sleep in our bed with her while I'm out of town. I got weird about it. Am I being unreasonable?",
        "permalink": "/r/relationships/comments/3np7rh/me_36_m_with_my_wife_36_f_married_a_year_been/",
        "comments": [
            ">She did push the issue. Argued as to why I was wrong about it. Brought up past relationships of mine when I was with \"more alternative people\" and called me \"vanilla.\"\n\nHonestly, at that point I would have stopped the conversation and asked \"What is really going on here?\"\n\nThis sounds much deeper than \"you won't let my gay friend cuddle with me.\" It sounds like she has some issues with the relationship that she's refused to communicate (or tried to communicate and was blown off), and now they're bubbling to the surface as smaller things.\n\n>Am I being unreasonable about the whole thing?\n\nNot remotely. But considering you stating your discomfort led to a myriad of other issues coming to the surface, it sounds like there's a lot more of a problem than her wanting gay guy cuddle time.",
            "Hell no you're not.  She is.  That is an utterly ridiculous request.",
            "Cuddling with my husband is my job and my job only.  I would flip out if he wanted to have a lesbian friend over for snuggles.  I don't think you're being unreasonable.  Cuddling and snuggling are very emotionally intimate. ",
            "Gay or straight it doesn't matter. You are having a third party enter your private marital space and sharing intimacy with your wife, male or female, gay or straight its something you as a couple should only share with one another. \n\nThe fact that she invalidated your feelings is a big red flag. It would also cause me pause in that I get the feeling that she would do it anyway even without your permission. If that is the case then you have bigger problems in your marriage than this.",
            "I'm mostly hung up on the fact that she's a grown-ass woman approaching forty and apparently can't stay overnight by herself without having someone come over to \"cuddle\" her. I know a lot of people don't sleep as well without their SO but sometimes our partners do go out of town, grow the fuck up and deal. I don't have any problem believing the dude is gay or think anything sexual is going on but the whole \"I could have a full-on emotional relationship with someone else with no sex\" would be kind of worrisome to me. You certainly *could*, but...you shouldn't really? Because you're married and aren't supposed to glom on to whoever's closest for emotional fulfillment just because your partner's not right in front of you? Eh. ",
            ">Wife wants to have a gay guy friend come over and sleep in our bed with her while I'm out of town. **I got weird about it.** Am I being unreasonable?\n\nNo, you got normal about it.",
            "No\n\n/thread :)",
            "Are you sure he's gay? Or did she just say he was to make you feel at ease?\n\nRegardless, grown women shouldn't be cuddling and sleeping in a bed with men (gay or straight) who aren't their partners unless the partner specifically consents. She's being ridiculous",
            "She is gaslighting you now to try and get you to compromise. What she is talking about would be inappropriate regardless of sexual preference and sounds like she may already be in some kind of emotional affair with this guy. Be clear and direct with your boundaries, you are not being unreasonable. You should have a conversation with her about their friendship and about why she feels she needs that kind of intimate contact with someone other than you. ",
            "If she's not capable of sleeping in a bed alone for a few nights, she needs to be in therapy. \n\nOtherwise, this is a big red infidelity flag and you should be in marriage counseling. ",
            "Thanks for the responses everyone.  This morning she has done a 180, apologized for disrespecting my boundaries and assured me this will never happen.\n\nI brought up many of your points to her this morning.  Opened the conversation about whether or not she felt there was intimacy missing in our own marriage. She emphatically said no to this.  I told her how disrespected and belittled and \"shaken\" I was over the whole thing.  She said she felt badly and apologized again.\n\nShe *was* drinking last night. I will say her demeanor changes quite a lot with alcohol.  I wouldn't call her an alcoholic, but we do drink many nights a week. Socially like most people do.\n\nAs far as moving forward, I'll continue to be open and honest with her about my feelings.  I will continue to call her out when I feel as though she's disrespecting my feelings.  And yes, I'll be watching the situation closely.\n\nThank you all again for the advice. And for the validation. Good to know I'm not alone and not irrational.  At the end of the day my needs are pretty simple.",
            "[deleted]",
            "I think you've missed a rather more basic question here: would *I* feel any need to have a slumber party with a gay man - or anyone, for that matter - while my husband was away?  No.  No, I would not.  The request is so ridiculous, I'm having trouble believing you're not trolling.  If you're not, then your wife knows damn well she's out of line, and you've got some serious questions to ask both yourself and her about this whole setup.  Starting with her claim this guy actually is gay.",
            "No, it's not unreasonable to not want your wife to cuddle with some other dude...gay or not. ",
            "Woman here, with lots of gay friends, one of them a very close friend for almost 20 years, way longer than I know my husband. \n\nIf my husband went away for a weekend, I would never, I repeat: NEVER even think about inviting him into our bed, because it's a strictly platonic friendship. I wouldn't want to cuddle with my girl friends, either, all that stuff is reserved for husband only. \n\nI also think that my gay friend would find such a request equally weird. \n\nYou are not being unreasonable at all, and it is very unfair of your wife to blackmail you into being alright with it by calling you \"vanilla\". She even told you outright that she wants to have an emotional affair with someone else. Did she actually ask him already? What did he say? If he's actually gay and doesn't secretly fancy her he'll probably think her request is crazy, too. ",
            "Nope.  Not unreasonable at all.  My husband's ex-wife left him for her \"gay\" best friend.  My poor, naive husband never suspected a thing, and his wife at the time told him he was paranoid for being bothered by their relationship & them going on vacation together (he was bothered by the fact that he was ALWAYS around, not that she was cheating on him).\n\nThe \"gay\" best friend was living with a man, and had only been with men as far as my husband knew.  One day his ex-wife came home and told him she wanted a divorce, things weren't working out.  \n\nShe moved her \"gay\" best friend in the next week, and they got married about 7 months later.  They are now in the middle of a divorce, because he finally decided he likes men more than woman, but it didn't prevent him from breaking up a marriage first.\n\nTL;DR: my husband's ex wife married her \"platonic\" gay best friend.  Sometimes you are paranoid for the right reasons.",
            "The words out of your mouth should be, \"Sure you can have another man in bed with you, but I do not wish to be in a marriage with someone who does. I have a boundry and I do not think it unreasonable. Your even arguing this is you overstepping the boundry a normal marriage entails and one I wish to have. Any further arguing will show the complete lack of respect for me and our marriage and maybe we should go our seperate ways.\"",
            "How does someone make such a request with a serious face?  I would assume she's joking.  If she seriously continued to request such an obviously marriage-ending affair, I'd ask her to be evaluated mentally.  She's verging on divorce territory here.  WTF.\n\n> So I got weird about it. Not sure why exactly, but I'm not comfortable with another guy in my bed with my wife when I'm not there. \n\nWell no shit.  The fact that you need to ask if your response is unreasonable is troubling in itself.",
            "His sexual orientation is not the issue here. It doesn't matter if he is gay, straight or even asexual. You're not comfortable with it. She should respect your boundaries. ",
            "That is an outrageously stupid request from your wife. I would do four things:\n\n1. Get her one of those maternity pillows that wrap around your whole body for snuggles. \n\n2. Tell her you aren't comfortable at all with the guy coming over, even for a hangout in the evening. \n\n3. Hide a nanny cam in bedroom/living room. \n\n4. Kick her out of the house if she brings the guy over after you say not to. ",
            "This is college nonsense and not the behavior of a 36-year-old married adult. ",
            "Gay guys do (rarely) have sex with women from time to time, sometimes to see what it's like and other times because they are very slightly bi and met a woman who struck their fancy. They're adults with sexual urges (urges that do almost exclusively point towards other men, but which don't *have* to) not eunuchs. And that's assuming he actually is gay and that that's not just a lie she's telling you to get away with having her boyfriend stay over.\n\nSo... Not only has she told you that she's down for an emotional affair, she also has ridiculed your very valid concerns about her doing this and doesn't seem to respect you as her partner. This doesn't sound good at all.\n\nHow long are you going to be away for, anyway?? What kind of weirdo can't spend a few nights sleeping by themselves? She sounds ridiculous.\n\nI suggest you consult a lawyer now in order to minimize your losses in the case of a future divorce because it sounds like she will eventually cheat on you in some fashion (if she isn't already doing so) and you won't want to also suffer financial ruin over this.\n\nIt could be that she's just suffering from the idea that having a gay best friend who comes over to watch Drag Race is what sassy women have to do to be cool, but that doesn't generally include sleepovers or emotional affairs so I'm skeptical of that.\n\nBy the way, most gay men aren't out there hoping to have sleepovers with women. What is with this guy that he'd agree to this? The most physical attention an average gay man is going to want to give a woman is a curiosity squeeze on her boob because he doesn't normally touch them, or a friendly hug when they first meet up at the wine bar to catch up on their friendship chatter. \n\nYou'd have to be a pretty hopeless gay man to choose regularly cuddling with a married woman over finding some hot guy to spend the night with. So I think the whole thing stinks and you should be wary.",
            "[deleted]",
            "The main issue I see here is the fact that she invalidated your feelings and that she thinks it's ok to basically emotionally cheat on you. \n\nYou need to sit down with her and have a serious talk with her about this. And my answer is no, gay or straight I would never feel comfortable with my SO sleeping in our bed with the opposite sex and CUDDLE (seriously wtf).\n\nIt makes me feel like there is some underlying issue here because of the fact that she is arguing with you about why this is ok. I guarantee if you told her you were having your \"lesbian\" friend over to sleep and \"cuddle\" she would not be ok with this. \n\n",
            "It would be a complete deal breaker for anyone, other than maybe her *one* best friend (straight female fwiw) that we're both super cool around, to cuddle with my SO while I'm away.\n\n> Actually went on to say that she could have a full-on emotional relationship with someone without it being sexual  \nBrought up past relationships of mine when I was with \"more alternative people\" and called me \"vanilla.\" \n\nYou're right about that sentiment sounding like something that could lead to an emotional affair. Although, just because there isn't sex doesn't mean that multiple cuddle sessions aren't infringing on your physical intimacy with your wife.\n\nIt honestly sounds like she *might* be testing the waters for poly-amory (starting with a full, sexless relationship, and then who knows?), but that could very well be me reading into the small amount of information available.\n\nIt does sound like this is something you'll need to revisit with cooler heads to get to more of a reason *why* she needed to ask for such a huge new step in (or outside of) your dynamic.\n\nBut, either way, you are not being unreasonable by any means.",
            "This ridiculous proposal of hers and accompanying entitled attitude about it screams of an incredible lack of respect for you, your marriage, your home...never mind for herself and her \"gay\" friend and their relationship.\n\n\n\n",
            "No, that's not unreasonable. \n\nI love cuddling with my husband at night and miss it when we're not together. But it's not that he's just some random warm body easily replaced by someone else. If it's not him, I don't want it. \n\nAnd that she pushed the issue? Weird. ",
            "There's nothing to spot him from being gay or strait except himself. Especially if he was straight most of his life. Regardless it is inappropriate for your wife to cuddle with him. I personally feel your wife is acting like someone half her age on this. If she is that insistent than I suggest you hope for the best and plan for the worst. Get a nanny cam and set it up in your bedroom while your gone. Although you might not like what you find out, at least you'll know the truth.  ",
            "Wow, she insulted your opinions while backhandedly thanking you for \"sharing your boundaries\"? Holy shit dude. She demeaned and belittled you for not wanting her to sleep in bed with another man? Oh and let's not even delve into how she admitted she could have a full blown emotional relationship with this guy.\n\nYou guys need counseling, this is one ROCKY start.",
            "First of all, gender or orientation do not matter here.\n\n> Would you let a gay man sleep and cuddle in your bed with your wife while you weren't there?\n\nHow about:\n\nWould you let [another adult person] sleep and cuddle in your bed with your wife while you weren't there?\n\nNo. You already said no. Just no. ",
            "Jesus fuck she just needs to get a cat or a dog or something if she needs to cuddle something while you're gone.",
            "Doesnt matter if he is gay. She might be sexualy attracted to him, so... \n",
            "Not only should this not happen, but that \"friendship\" needs to end.",
            "Hell no!!!!   I would flip if my guy wanted to cuddle sleep with anyone but me.  We are monigomous and that crosses every line for me.  She is not respecting your boundaries.",
            "> would you let your husband sleep and cuddle with a gay woman while you were out of town?\n\nHELL NO! NO F$§%ING WAY. \n\nWtf. Your wife must be delusional. Or she thinks that you are really, really dumb.",
            "only if you can hire an escort to cuddle you.  its not sexual and she's just doing her job after all.",
            "THe fact she called you vanilla implies she is into polyamory and into kink. Watch yourself if that is not your cup of tea",
            "She is asking to cheat.  It may not end up the PIV kind of cheating but it is still cheating. ",
            "WHAT?? Your wife needs therapy.  She can't self-soothe while you're gone to the point where she needs a relative stranger to snuggle with? That's legitimately insane.",
            "Sometimes I sleep with a teddy bear my SO gave me to feel closer to him when we are apart. Your wife is acting crazy.",
            "So why does your wife need to have people come to your home and cuddle in your bed when you leave town?\n\n",
            "Your wife is being selfish and unreasonable. That request is ridiculous. Show her this thread.",
            "\"Sure honey! I found a lesbian to cuddle with in [place I'm going] you okay with me cuddling with her?\"\n\nLet's see how that makes her feel.",
            "My husband is gone 31 days and back for 25. I'm a 27 year old female with a newborn, a 9 year old and a 6 year old. I should mention I live in the middle of butt fuck no where, in a big house. My neighbourhood has had several break ins over the last three months. But do I ask my husband if I can have a cuddle buddy over? Fuck no. I lock every door, set the alarm I had him install last time he was back and bring my two boxadors upstairs and go to bed. Don't let her make you a doormat. Wifey needs help if she can't function alone a few nights with out you. \n",
            "Well, this is the most ridiculous thing I've seen today. ",
            "\"gay\" \n\n\n... Seems legit...   lol",
            "Doesn't matter if other people say it's reasonable or not. Some people do this. Others don't. It's what you want, and your relationship.\n\nDefine your boundaries and express them. People who don't respect them are not your friend. Period.\n\nSounds like there are deeper issues at play than a guy in her bed.",
            "Buy her a teddy bear if she has an issue sleeping alone.\n\nI wouldn't let a gay man sleep in my bed while my husband was gone. I wouldn't let ANYONE of any gender, or orientation sleep in my bed while he was gone. That's our bed, and ours only.\n\nYou're not being unreasonable.",
            "Woman here. Her request is weird and out of line. I would never **dream** of asking my boyfriend this.",
            "Guy \"used to be straight\" but is now \"gay\".\n\nNah.  More like guy is probably just bi.",
            "She wants to fuck him.\n\nsource: I'm a gay guy and have had female friends who were in relationships want to \"innocently cuddle\" before, litterally everyone of them tried to fuck me.  I'm super gay and want nothing to do with that so nothing ever happened, but she wants to fuck him, seriously, she does, she found a new guy who she likes and gives her attention and she wants to fuck him.\n\nedit: Did I mention that she definetly wants to fuck him?",
            "i don't care about the gender or the sexual orientation of the person *who my SO wants to share intimate moments with*. it doesn't matter if sex is never in the frame of thought, you hit the nail on the head, it's an emotional affair. \n\nmy standard for cheating is doing anything intimate with someone else that you either wouldn't want your SO to see you doing or would cause them suffering to know happened/is happening. penis in vagina (or variation of) is only a very small part of the concern. intimacy is my concern, sharing yourself with someone else in ways that you aren't sharing with the person you are in a relationship with.\n\npersonally, a sexual affair is something that i can accept more easily than an emotional one. especially if when i voice my concern and its met with derision. the bottom line take-away for me, it's not that she wants to *have sex* with someone else, she wants to share her vulnerability with someone else while in our bed. you want to have coffee with this person every tuesday and talk about those same vulnerabilities, ok, that's possibly even good and healthy. but you aren't doing it in our space, im not talking about *the house* im talking about *our bedroom*, that's our space. \n\nidk, in a way, id be more forgiving if she said she wanted to fuck him, not have a separate emotional relationship superimposed on top of your own.\n\nthe fact that she is *so* demanding that this happen makes me fear she could do it even if you say no. hell, you've already said no and she is still continuing to amuse the idea anyway.",
            ">Brought up past relationships of mine when I was with \"more alternative people\" and called me \"vanilla.\"\n\nManipulative as fuck.",
            "Yeah, I don't think he's gay. ",
            "She's out of her fucking mind man! I would never let that happen. And yes that does sound exactly like an emotional affair.",
            "She could've also asked about the same thing with a woman, gay or straight. How about you with another woman or man, of any orientation? Those would all have been the same, she asks you to give up part of the intimate relationship you have for her to be comfortable or whatever when you're not around. No. Not at all, are you unreasonable.",
            "Lmao. Uhh. Ok sure, as long as you get to cuddle in bed with a lesbian while you're away on the trip. She's got herself a deal!",
            "\"Gay\" and \"Straight\" are just points on a spectrum.   Who knows if this guy (or anyone) is 100% gay or not.  It would be the same if it were a girl.  Even if you had 100% proof they werent romantically interested...isnt sleeping in your bed with your wife simply too much intimacy in and of itself?\n\nMaybe dont focus on the \"guy\" part and stick to \"another person\", and avoid \"you might cheat\" in favour of \"thats something that only we should be doing together\"  \n\nAnd note \"I'm allowed to have boundaries. I dont have to justify my emotions.\"\n\nPersonally I'm not even ok with my sister in law sleeping with my wife in my bed when I'm not there. Its MY bed.\n",
            "Cuddling is something that's supposed to be shared in an intimate manner between a couple. It don't matter what the sexual orientation is of the 2 individuals involved in the cuddle, it's an intimate act between two people. In this case I would call that cheating. She is attempting to share herself intimately with someone else. And if you're not ok with that (of course you're not but I want to cover those who may be in an open relationship as well) then it shouldn't be happening. A relationship is built on teamwork and working together, the second one person tries to change that, then the relationship will fall apart.",
            "Why the hell does she want to cuddle with another men in your bed ? whether hes gay or not is irrelevant especially if shes pointing out that you're too \"vanilla\" when discussing this issue, then she sees this as something more than a friendly sleep over and more a sexual excitement. \n\nYou need to make it clear to her what all of this means and then decide whether you want to be with someone who's fantasizing about being with gay guys  ",
            "\"gay guy\"",
            "The other person being gay is irrelevant. Your wife is not. She is attracted to men, and she proposes have a male body that isn't yours in bed with her for close touching and intimacy. His homosexuality doesn't change the fact that your wife could well be requesting this because she is sexually attracted to him. Straight people can be sexually attracted to gay people, and vice versa. \n\nIt is clear she is invested in having a man in her bed that isn't you. The idea that he's 'safe' simply because he's gay doesn't negate the question of why she needs this so badly she's willing to hurt you, her partner. ",
            "How did she meet this guy? My initial thought when I read this was that he's not actually gay and your wife either wants to have an affair with him or already is and is trying to get your blessing on it by guise of saying he's gay when he's not. Something isn't adding up here. Maybe set up a nanny cam while you're gone? :-/",
            "> You would never guess him to be gay in any way\n\nRED FLAG. holy shit red flag...",
            "he's not gay.\n ",
            "WOW. What kind of mental gymnastics do people have to go through to even consider this? No offense man, women can be pretty persuasive making us think we are over-reacting but come onnnn.",
            "My best friend of 14 years is gay, I have never, and will never cuddle with him. This is bullshit. She's getting defensive for a reason. Straight most of his life and is now magically gay? I understand needing to experiment and discover your passions, but you don't just go from only loving women, to only loving men. Either he was gay before and didn't realize, and didn't have fulfillment being with a woman, or he's been straight this whole time, and he's using the \"lol I'm gay\" bit to throw you off his scent.",
            "\"gay friend\"\n\nYeah, okay, you believe that shit if you want to lol",
            "I agree with all the top comment but know one has mentioned how you guys don't know this man that well. It takes years to truly know some one. Man or woman. And to wana sleep with them is a huge red flag to me. ",
            "Not unreasonable at all.\n\nLook, I can see exceptions to the cuddling-overstepping-a-boundary thing. If this guy had been a friend since childhood, really was like a de-facto brother, they'd shared a bed chastely in their pyjamas watching TV as little kids, that sort of thing. You'd still be within your rights to say no, but her wanting to would be understandable. And if you were secure enough with both her and him to be comfortable, you might also reasonably say yes.\n\nBut this isn't a pre-existing brother figure. This is a new acquaintance and she wants to encourage physical closeness that oversteps the line and intrudes on intimacy that's meant to be just with you. That's way out of line.\n\nHonestly, I think she's hoping to start something emotional and/or physical with this guy, regardless of him identifying (apparently only recently) as gay. But even if she is just hopelessly naive and thinks him identifying as gay means he's \"safe\" and will never get a boner for a lady again, she clearly doesn't view exclusivity as holistically as you and most monogamous people do. Not only would I say no, I would also want some serious discussions about what exclusivity means to her anyway.",
            "This is unacceptable. She's compromising your relationship and exploiting his sexuality for her own gain. She's still emotionally benefiting from the situation, even if she does not sexually. There's nothing \"alternative\" about using someone and saying that their sexuality makes it not mean anything. She's including him in an area where it should just be the people in the relationship. You're not being weird, you're being normal. He's still a person, and it's not okay. ",
            "mmmmm no. You have every right to set this boundary and she has to respect it. If she can't handle that limit then she needs to file for divorce.",
            "I swear. The way my ex did it last week. 'Rob, I'm going out on dinner with a gay dude called Greg, let's meet tomorrow.' By the end of the day, they were 'Netflix and chilling'. Don't fall for it. Don't. Run. ",
            "I'm a woman in a committed long term relationship. My best friend is a married gay man. We live in separate states and meet up about once a year, and have done many trips and long weekends, just the two of us. When we travel, we often share a bed to cut down on hotel costs. However:\n\n1) I always make sure it's ok with my boyfriend, and if it made him uncomfortable we would immediately spring for a second bed. The fact that your wife is pushing this shows she doesn't care you're uncomfortable with it.\n\n2) we don't cuddle. We are friends. I don't cuddle with female or male friends because it is a physically intimate activity, and I reserve all physical intimacy for my partner. \n\n3) my friend is married and I have known he was gay from day 1, he has never made a romantic pass at me and he has no reason to. It's troubling that you say your wife's friend used to be straight--that's not how homosexuality works, it's not a choice, you don't roll out of bed one day and say \"I'm sick of the ladies, So starting today, I am gay.\"\n\n4) I have known my friend for more than 10 years. We share a bed on vacation because we consider each other family and it's often cheaper to get a single king bed v. two doubles. Your wife has met this guy 4 times? It is truly bizarre she would find it appropriate to invite him into her bed at all, but it's even stranger that she barely knows this guy.\n\n5) my friend and I share a bed to save money. Your wife wants to share a bed with her friend for emotional intimacy. This is a huge difference.\n\nHonestly, from the point of view of someone who does sometimes share a bed with my gay friend, it seems pretty clear she is planning to cheat on you with this guy. She's hiding in plain side by making you aware he will be in your bed. You need to revisit this, put your foot down, and tell her you need to set up boundaries for emotional intimacy with other people. If she wants you in her life, she must respect those boundaries. \n\nLast thing--she is clearly in the wrong here, but you may want to explore WHY she feels the need to get intimacy elsewhere. She sounds like she requires a lot of affection, which is ok. When you talk to her, ask her if there's anything you can do to better meet her needs for intimacy. Do you guys cuddle, even when sex doesn't come before or after? I'm not trying to justify her actions, but it does sound like her emotional needs are not being met. Maybe this crazy idea is a passive aggressive move on her part to show you she's not getting her emotional needs met by you. Good luck, don't give in to this highly inappropriate request.\n",
            "Not that it makes a difference but how long are you even going to be gone?",
            "> Would you let a gay man sleep and cuddle in your bed with your wife while you weren't there?\n\nI wouldn't let anyone who isn't either an animal or a child cuddle - in my bed!! - with my partner. \n\n> Brought up past relationships of mine when I was with \"more alternative people\" and called me \"vanilla.\"\n\nThere's nothing wrong about being vanilla. To use it as an insult is a very obnoxious thing to do. \n\nThe past relationships aren't relevant in any way, since it's your *current* relationship this is taking place in. (And to bring them up at all is very childish of her, and does nothing but shut down communication.) Not wanting her to have that kind of level of intimacy with someone who isn't you - you know, her *husband* - is not unreasonable, it is not vanilla, and I'd wager it's a pretty darn common sentiment shared by people in a monogamous relationship. \n\nUnfortunately, there's not a lot you can actually do if she refuses to see your side of it. ",
            "[deleted]",
            "unless your wife is a lesbian, she should know how inappropriate this it. Tell your wife yeah he's gay but you're not so why do you want to hug him",
            "Negative ghost rider.",
            "This is such a bad idea I literally can't even. \n\nAssuming he is actually \"gay\" and this isn't just some cover for your wife having a physical affair, it's some sort of intentionally-limited emotional affair. Either way, bad news. ",
            "You're totally in the right, here. This is really weird. You should have a very bad feeling about this.Your wife does not see your bed/bedroom/home as an important space for the two of you. She does not view physical intimacy as something exclusive to the two of you. She can't spend a few nights without you on her own? These aren't red flags- they're The Red Army coming over the horizon in full attack mode!",
            ">Actually went on to say that she could have a full-on emotional relationship with someone without it being sexual (which geez kinda sounds like an emotional affair to me).\n\nThat's a red flag right there.  Affairs aren't always physical.  They're a result of one of the partners going outside of the marriage/relationship for fulfillment of physical and/or emotional needs without communicating to their partner and working out a conclusion beforehand.",
            "\"Am I being unreasonable?\"\n\nNo",
            "Hell no. That sounds like emotional cheating. If she wants something to cuddle while you are gone, get a body pillow. She is turning to someone beyond you to meet here emotional needs at the very least, if he is gay.",
            "Just because he's gay ( which I have to say I have some doubt on ) doesn't mean it's cool if she, a woman that is attracted to men, cuddles with him. \n\nThere are extenuating circumstances for sure, but planning ahead to have him sleep in your bed with her? That's odd. Not wrong per se, but definitely enough that I would be suspicious/concerned. \n\nI suggest you say that you want to cuddle with one of your lesbian friends sometime and see how that goes down. If she is less than thrilled, point out her double standard. \n\nI have two gay roommates and I'm a straight girl. One of them fell asleep in my bed once when he was kind of drunk. I stayed there for about thirty minutes until I just felt too odd about it. Even though cuddling is nice, my boyfriend was away for the weekend, and he was asleep it just felt off to cuddle like that with someone not my SO. \n\n\nIf your SO is more concerned with cuddling some other person than they are about your feelings, that's probably not that good. ",
            "All wrongness about her reasoning aside, you mentioned that he was \"straight for most of his life\" but is now gay. He's probably bisexual, which means he could very well be interested in your wife. \n\nAll in all, her request is ridiculous, insulting, and frankly, laughable. ",
            "I would be very upset if my fiancée suggested this. I don't care at all about her being alone with any male friend much less a gay one. But no one is gonna cuddle her in a bed or even cuddle her the way I do ever in any situation. That's my job. Get her a body pillow. ",
            "I'd freak out. I don't care, guy, girl, straight, gay. Its an extremely intimate thing",
            "Uhhh no.\n\nJust because someone is gay does not mean they won't have sex with someone of the opposite sex.\n\nA girl my boyfriend used to hook up with for YEARS (before we dated) was a lesbian.\n\nNow I wouldn't say \"YOU MIGHT HAVE SEX WITH HIM!!!\" as that'll probably piss her off. But just say that you aren't comfortable with that and ask how she'd feel the other way and if she's not okay with that then she isn't respecting you.",
            "Bruh. Bruh.",
            "If the situation were reversed (I'm female) and my bf wanted to cuddle a non-apparent lesbian while I was away, I'd be concerned. Who's to say the person isn't bisexual, really? Feel weird about it my friend. ",
            "Honestly I would leave his sexuality out of it. She wants another man to sleep in your bed with her and snuggle with her which is a pretty intimate act well you are not there. She's either stupid or thinks you're stupid  my husband is out of town all the time currently he's gone for about two weeks I would never ever consider asking something like this loneliness is just a part of our marriage and our dynamic I make the best of it when he's gone. ",
            "He's so gay you can barely tell he's gay, was straight most of his life and wants to sleep with your wife.",
            "In her other words \"my affair scheme hasnt panned out, time to go stealth mode.\"",
            "What proof do you have that he's actually gay?\n",
            "Yes, no matter his preference in sexuality. That is your wife. Only you should be allowed that privilege. The same thing could be said if she wanted to have sex with her gay friend. But it's ok cause he is into guys. Not much rationality in that. ",
            "I don't think he's gay...",
            "Your wife wants to have a relationship with men other than yourself.\n\nShe wants to do that and admitted to you directly and then got angry at you for disagreeing to it.\n\nThis is not a minor issue.  \n\nBecause she's obviously going to do it without your permission in the future.",
            "Holy shit that is inappropriate. What an insulting request. ",
            "Wait so you're saying that not everyone does the 5 year anniversary gift of a gay guy to cuddle with. \n\nI feel bad for you buddy. No matter what you do or say she doesn’t really respect you. I expect most sane people with any shred of common sense wouldn't ask such a thing.",
            "My old roommate's boyfriend was like this super flamboyant gay dude but I think he was really a hyper sexual bi that just found it easier to get dudes. He'd always get really excited whenever I brought a girl around and try to steer the conversation towards something sexual as much as possible. I'm not saying all gay dudes are like him but they are out there. I'd be weird about it too.",
            "I'd let HIM know you aren't okay with it as well. She may just try it anyhow while you're gone, and has probably already said something to him about it.",
            "In my opinion, you're not being unreasonable. Being gay doesn't give you're wife a free pass to do something that makes you uncomfortable. On the same note, I don't believe being a gay man should give you the right to act any different around women than straight men can or do. Maybe when gay men can start using women's restrooms, we'll have to change our minds. ",
            "Absolutely not! You know what else girls do with their gay friends? They make out, be naked, let them grope them among many other totally inappropriate things for someone in a relationship. I'm sure your wife wouldn't let that fly if the roles were reversed",
            "Nope. There are things shared between a couple other than sex. Sharing those intimacies with another is cheating the same as sharing the intimacy of sex. ",
            "I think if my SO even asked that question of me, I'd probably pack my shit and leave. ",
            "If this is all true, and it were me with my SO (whom I've been with for only 4 years), I would probably have left her simply for suggesting something so ridiculous. I would have FOR FUCKING SURE left her if she started gaslighting me and insisting I'm wrong about this.\n\nIt's an absurd request plain and simple. From what I read, I wouldn't be surprised if he wasn't gay.",
            ">You would never guess him to be gay in any way.\n\nEnough said\n\n> Perhaps it's worth mentioning that he was straight most of his life. Perhaps it isn't.\n\nIf she keeps pushing for it drop her like a bad habit ",
            "\nYour wife sounds like a moron. ",
            "I'd bet money he isn't actually gay. ",
            "I am guessing he is not gay and your wife and him are already sleeping together or she would like to start.  I would shut this down and ask to look at her phone/social media accounts, as there is a line that has been crossed.  People who push really hard to do things that are uncomfortable for their partners have little to no respect for them, which leads me to the cheating part.  I think there is a much larger problem here, and you need to start to look into it.  Sorry you have to deal with this. ",
            "Have you presented it in the inverse to her - how would she feel if you had a gay female friend come over and cuddle you in bed whilst she was out of town? Her reaction to that scenario should be pretty telling. And hell no you're not being unreasonable. ",
            "you should ask her if you can cuddle with some strippers and an escort on your trip. ",
            "I'm sorry to hear this,but no one and I mean no one goes from straight to Gay , and the fact that she acted something like this makes me wonder if she's either cheating or is thinking of cheating and just wants your approval to go sleep with the guy , you even said theat he wouldn't tell his Gay , not saying that he isn't but the fact that she's insisting on this subject when she knows you are not comfortable with that , red flags  I would check her phone to see the conversation they having just to double check I know it's wrong but in this case it's just to weird for a women to ask her husband for her husband permission to her \"gay friend\" to sleep in the same bed not even on the guest room , in the bed you only meant to share with your loved one and to cuddle and have an emotional relationship with the it's so stupid,and believe she's going to do it wether u like it or not so I would be very careful if I were you.",
            "What!? This is just crazy, your wife has zero respect for you and your marriage.",
            "> You would never guess him to be gay in any way\n\nI see.\n\n>He and my wife clicked right away.\n\nOh.\n\n>Anyway, [I] don't know him that well.\n\n[cue uncomfortable laughter]\n\n>My wife asked me right out if I would care if ... he slept with her.\n\nWait.\n\n> Perhaps it's worth mentioning that he was straight most of his life. \n\nWhat?!\n\nYour wife is cheating on you or is planning to do so. You cannot possibly be this dumb. \n\nOr, y'know, refer to my username.",
            "She is going to do it anyway, regardless is you say no. ",
            "Can i ask, who's assurance do you have that he's gay? only hers and his?/ Because this could just be their excuse for an affair (don't assume that, it just seems suspicious). \nEspecially with how much she pushed the issue. \n\nYou're not being weird. This is completley normal, but i think the issue goes far beyond this, you might need to have some long talks with your wife. ",
            "This is just weird. In no way would I ever be okay with this. You have every right to be upset, OP. And the fact that she doesn't respect your boundaries? Red flags all over. ",
            "Yeah I wouldn't. Just because he's gay doesn't mean she won't potentially develop feelings for him.",
            "Nope. That isn't normal. Tell her to get a body pillow. Dogs, your kids, or her sister would be normal. But not another man. ",
            "You have got to be kidding me... How did she even come to the conclusion that this is an okay thing to ask?",
            "No fucking way, as someone else posted ask if you can sleep with a lesbian friend of yours. that loves sleeping naked with her knees in the air.",
            "I would not feel comfortable about it. I disapprove, op.",
            "Tell her you're going to hire a couple of lesbians to cuddle for your own emotional satisfaction. See her opinion.",
            "Why don't you ask if it is okay that you cuddle with your lesbian friend while you are out of town? ",
            "Your wife is being ridiculous. That's a bazaar request and I wonder if him being gay is just a front so they can mess around right in front of you. I'm very cynical though so I could be wrong but seriously that's not cool either way. ",
            "WTF???\n\nI have a very very close friend who is very easily identifiable as gay and yet I would never make that kind of weird ass request to my husband. Like....she cant just hang out with him? She cant just sleep alone until you come back? This is very weird. You are right to question this.",
            "Not cool!\nI'm gay and I feel weird just thinking about cuddling with either of my (girl💁)friends.\nI know for sure I wouldn't be okay with my SO cuddling/asking to cuddle with someone, whether it was a he, a she, straight, gay, bi, etc.\nJust her asking that makes me wonder what else she think is perfectly okay to do with her friend :/",
            "I have a feeling that this guy and your wife has some sort of emotional relationship. How gay is this guy really? Cause no gay friend of mine would ever want to do this or even need to plan to do it. ",
            "Unless explicitly stated otherwise straight from the start, cuddling and shit like that is for sure emotional infidelity by default, so yeah. That shits cheating. Tell her you're not okay with that and if she does it the relationship is done. You obviously aren't comfortable with this shit, so that's how it's gotta be. It's not appropriate to have a emotionally close relationship with someone that isn't your spouse or some kind of family relation that even comes close to the same level of intensity, and to me it's basically cheating.",
            "Ask can you have a lesbian cuddle with you at the hotel",
            "'fag hag' \n\nVery weird. you should say No and tell her she's being weird.",
            "No, your wife has some issues to work out. Maybe she wasn't ready for marriage if she needs a replacement for you.",
            "The reason you had to ask is the same reason your wife thinks she can ask to go to bed with another man. \n\nTrust your own opinion. You don't need Reddit or anyone else to affirm your feelings.\n\nGo get some ideas from /r/bondage. Your wife already said she isn't into vanilla, and you can make it clear to her that you want a possessive relationship. \n\nShould also help with your confidence issue.   ",
            "If it were me, I would tell her that she was welcome to cuddle with anyone she wishes or have emotional affairs to her heart's content, but that we were through. \n\nShe has already left the relationship, and she has no respect for you. That's all you need to know. \n\n",
            "Just the fact that she wants to cuddle another guy and has the audacity to float it past you means the marriage is over. \n\nWow...that's fucked up.",
            "Fuck no you are not unreasonable. There is no way I would want another man sleeping in my bed or touching my wife gay or straight.  There is no reason for this.  ",
            "The \"gay\" guy is playing a long con. He's smart. Most guys would NOT pretend to be gay to cuck somebody's wife. I give him props for that.",
            "I would rather be cuckolded by a hurly burly construction worker than know that my wife is cuddling with a gay man while I'm out of town. But that's just me.",
            "2. Protect your own heart\nJust as you committed to being the protector of her heart, you must guard your own with the same vigilance. Love yourself fully, love the world openly, but there is a special place in your heart where no one must enter except for your wife.\n\nKeep that space always ready to receive her and invite her in, and refuse to let anyone or anything else enter there.\n\nthis is from an article on jamesrussel called beautiful advice from a divorced man. I wish this could just be a pinned tab on reddit relationships but as of now your wife is inviting someone else into her space, into that special place that is only meant for you two. She may view it as innocent and whatever because the guy is gay but if it isn't okay to you it shouldn't be okay for her. She needs to realize cuddling is a form of intimacy saved only for your SO/spouse and it isn't to be just shared with whomever. This guy is probably pretending to be gay tbh and your wife probably has a crush on him I don't know it seems so weird to fight this issue otherwise...",
            "Ok, now when folks come on here saying that their drunk girlfriend passed out next to their long time dude friend, I'm  like \"who cares, no biggie\"...but this is weird.  I feel like she has a silly fairy tale idea of this \"girl's best gay friend\" deal that some straight women love so much. She essentially wants a fun gay boyfriend and a straight sex boyfriend. Unless you singed up for a poly-amorous relationship she is way over the line. Plus, if I'm reading this correctly they don't even know each other all that well? She is being uncool, in my opinion. ",
            "Just tell her when you're out you're going to cuddle with a gay guy too.",
            "If you are in a monogamous relationship then no, your concerns are not unreasonable at all.\n\nThere aren't many people who are 100% gay or straight.\n\nI mean, it is possible their relationships is strictly platonic and non-sexual...but lets be real they're probably already fucking.",
            "Ask her if she would be happy with you sharing a bed with a lesbian. If so then go for it. Win. ",
            "Wifey is being weird, not you.",
            "Weird request, buy a dog",
            "I don't think you're being weird about it. I had a similar thing come up in my last relationship. My best friend is the sort of person that likes cuddling up and sharing a bed with someone. To her it's not sexual or romantic, just nice. \n\nSo, she used to stay in my SOs bed with him if she had come over to hang out. I wasn't completely comfortable with that, even through I trusted them both completely. \n\nSo I talked to him about it and said that it wasn't that I didn't trust him, but it felt weird to me, especially as his brother would crash on the couch if he stayed over. Both of them were happy to accept what I'd said and take my boundaries on board. \n\nI'd say the idea that your wife isn't willing to take your feelings into account is definitely a red flag here. She clearly has different boundaries to you, but that doesn't make it okay to ignore yours because they're different. ",
            "> You would never guess him to be gay in any way\n\nBecause he's not gay. He's straight.",
            "No one, gay, straight, multipanwhatever, is allowed to cuddle with my wife but me, our dog, or our baby. The end. ",
            "No. I would not be having that at all.",
            "Damn, dude. That sucks.\n\nBut I have to say...some (many? most?) of the people who come here to post seem like prisoners in their marriage. My wife would never ask me about this, because she could predict the shitshow that would ensue. I would lose my shit and I would leave. She knows this. There's no ambiguity on the subject.\n\nSo, one of a few things is happening. She thinks you're a chickenshit who won't stand up for yourself, she's done with the marriage anyway, or she's too stupid to see this won't work out for her.\n\nIf one or three is the answer, then why are you married to someone that mean or stupid? If she's done with you, preempt that shit and walk. \n\nI'd walk any way, but monogamy is important in my marriage. Is it in yours? The situation is already here, so stop acting like you can walk this thing back, bud. Good luck.",
            "this is crazy talk.  ",
            "Offer to get a dog for her to cuddle with. Letting her do this with any person would undermine your trust in her and make the relationship unpleasant for everyone.",
            "OP be strong. That is a serious emotional line to be crossing. You need to draw that line with your wife clearly; and she needs to understand why. It isn't fair on you and if it were me, I would not be happy with that as a suggestion at all. ",
            "You don't get weird about it. You got normal about it. She is being very weird by insisting that you let her cheat on you rather than feel lonely while you are out of town",
            "I'd have no problem with the request, but I'd have a huge problem in her not being able to respect my wishes and comforts. If she didn't want to hear your opinion then why did she bother asking? You have a right to feel how you feel.",
            "Could you approach the gay friend with your concern? If he is a reasonable guy, and has been in straight relationships, I'm sure he will see your POV. \n\nThe 'emotional relationship' comment by your wife concerns me. That would be a kick to the guts for me. How can she put so little thought into that statement!? Role reversal and perspective is what is needed. ",
            "Is this friend actually a gay man? Or is that just something to tell you to get your permission for this to happen?",
            "she is basically telling you she wants to have an emotional affair. ",
            "My husband and I are extremely close. We have spent only 8 nights apart in the 20 years we have been together. 5 of them happened recently when he went out of town for work. I would never ask him if someone could jump in bed with me to cuddle. I don't even know what the hell she's thinking asking this of you. I also think she is being extremely cruel to say that she could have an emotional affair with someone and not see how that would make you feel. ",
            "You are VERY far in the right.",
            "$20 he isn't gay. ",
            "You need to make sure she knows that if she goes through with her idea. There will be serious repercussions and will put the relationship in danger",
            ">So I got weird about it.\n\nNo you didn't you got upset in a perfectly understandable way. An affair is an affair, regardless of genitals or sexual preference. ",
            "This chick sounds like a giant pain in the ass.",
            "> Actually went on to say that she could have a full-on emotional relationship with someone without it being sexual \n\nThat's completely fucked up. The actual penetration is NOT the worst part of being cheated on. Her putting her own selfish needs ahead of your commitment. The emotional side of it! The intimacy!\n\nDude I'd be fucking terrified if she can rationalize something this screwed up being ok. Those kind of mental gymnastics don't end well. NOT a good sign. Then calling you \"vanilla\" for telling her your feelings? I'd be looking bigger picture than this one incident... I think this is just the symptom you finally picked up on; you are *not* compatible with this person and something is seriously wrong. People change.",
            "she's telling you how you should feel about another guy in your own bed. that's not cool. Also, i keep hearing \"I wish i was gay so i could get chicks\" in my head",
            "She wants to cuddle get a dog.",
            "Your wife is fucking nuts if she thinks thats okay when you are clearly not okay with it. \n\nOn top of that, you sure this guys gay?",
            "By that logic, its okay if you snuggle with a girl who was straight for most of her life, then randomly admitted she was a lesbian. \n\nlol. next thing you know \"its okay if i suck his dick. he's gay\".\nnope nope nope nope nope nope",
            "going out of town for a few days.. she needs to grow up. leaving for week or two, still needs to grow up. Asking your S/O to sleep or cuddle with another lol that relationship is strong. Say no, you wouldnt feel right about that,set up hidden cam.. find out if she still does",
            "Say bye bye to yer wifey",
            "Has any brought up the fact that this could all be a huge farce? This guy might not even actually be gay and OP's wife might be trying to have an actual affair? ",
            "Is she out of her mind?\nIm not buying this....something is up here...\nWho met him first? You or her?",
            "Fuck that noise. Even if you were being unreasonable, she should have respected your boundary and (if she wasn't satisfied with you answer), tabled it until you were calm.",
            ">You would never guess him to be gay in any way\n\n>he was straight most of his life\n\nTwist: He isn't even gay!",
            "That's weird.  You are right to say no. ",
            "This sounds like something I would have pulled when I was in college and still \"experimenting\" with what I wanted (read: could get away with) in relationships. Cuddling wasn't a big deal in my circle of friends and I'd often share a bed and a cuddle with a friend. But it was rarely innocent and one of us always wanted more from the encounter than we got. \n\nI was a jerk back then. Your wife is being a jerk now. Getting what you want at the expense of someone else, especially someone you care about, is not ever a component to a good or lasting marriage. She's gotta clean up her act. ",
            "I wouldn't be okay with this either.\n\nI know most of us think of sex when we think of intimacy, but there are many other actions which are incredibly intimate. Is he going to brush her hair off her face, put his hand on her lower back, or give her hand a quick squeeze while holding it? These actions are usually reserved for a significant other or spouse. Your feelings are valid if you're worried that she wants to share these moments with someone else. His sexual orientation doesn't change that.",
            "I would put all my money in vegas that shes fucking or is planning to fuck him or his friend or he could be bi or MAYBE THAT THOUGHT SHOULDNT HAVE CROSSED HER MIND. If I was you Id run away as fast as possible just speaking honestly....",
            "As a future wife...I would NEVER even consider this!  Our bed is our special place, and cuddling is also special to us.  I think you are very reasonable on having a problem with this.  I also agree with your statement about emotional cheating...cheating can still exist without the sex piece.\n\nGood luck figuring out what is really going on here!",
            "I consider myself to be very liberal. I am open to almost all view points, and this is one that I wouldn't be open to. If my SO asked this of me, I would of told her that I am absolutely not comfortable with this. I think you're being very reasonable. ",
            "i would NOT like if my partner cuddled someone else in my bed. man or woman. \n\nedit: i forgot the word NOT. ",
            "Um no that is just weird",
            "NEEEEEEVERRRRRRR",
            "And in a couple of months he is suddenly bi or no longer gay right ? \n\nOh come on.",
            "\"you would never guess him to be gay....we don't know him THAT well.\"\n\nSomething tells me he might not be gay.",
            "That is such a bizarre request. I would NEVER ask my husband that. I don't understand the logic whatsoever. I would dig deeper into this, OP. Something is up.",
            "As her if she'd be comfortable the next time she's out of town if you cuddled with your lesbian friend in your bed. \n\nSee how far she gets with that one. ",
            "> I'm not comfortable with another guy in my bed with my wife when I'm not there\n\nI think you speak for almost 100% of married men. Or women. ",
            "Using vanilla as a term for you is kink community language. She's going to fuck this guy if she isn't already. I'd snoop.",
            "He's not gay.",
            "> You would never guess him to be gay in any way.\n\nBecause he's not.",
            "What take? There's no take. Just a big NO! Good luck. You'll need it if you decide to continue being married with an idiot...",
            "He isn't gay, and there is a lot more going on between them than just friends.\n\nNot knowing this guy well throws up an enormous red flag. I saw hide a few cameras in the house and make it clear you don't want him around while you're gone. My bet is that she still has him there and ends up in bed with him. \n\nIt wouldn't be fun to find out your wife is a cheater, but at that point, at least you'd have evidence for a divorce. \n\nBest of luck.",
            "What the fuck. Seriously. Ask your wife WTF. LOL. Gay or not. I find you in bed with my wife I'm stomping your ass and tossing my wife's side of the closet out the 2nd story window.",
            "I am a woman and very physically affectionate with people I consider family. My best friend is a gay man. We cuddle. We've slept together in the literal sense a couple dozen times. (Not very well, because he hogs the blankets and I kick in my sleep, but whatever.) Mind, not only is he gay, but so am I... so there's no chance whatsoever of either one of us developing an attraction to the other. But it is a very close relationship, both emotionally and physically--I view him as my brother just as much as I view my blood siblings as such. (And yes, I cuddle them too.)\n\nHowever.\n\nIf I were married, and my spouse didn't want him sleeping over in our bed with me and snuggling, I would respect that. As much as I love him, as important as he is to me, I would still understand how my SO might feel weird about it... and so would my friend.\n\nAs someone who has a platonic relationship that close and who expresses affection physically, I wouldn't have too much of an issue with this in your stead. But that's me. I understand why you're on edge here and no one should be trying to tell you what you are and are not comfortable with.\n\nBeing unreasonable would be ordering her to cut off all friendships with men, or all friendships with people she wants to hug, or... hell, even just this friendship specifically if nothing untoward has happened yet. It's not like you don't want her to be friends with the guy, you just don't want them sleeping together no matter if it's literal or not. That's totally fine.",
            "You're not being unreasonable! \n\nMy girlfriend works at a day care and works with several lesbians. She once expressed to me in the past that if it was the right girl, she would be open to having a lesbian relationship. Now I don't get jealous when she's around guys, talks to guys whatever. But I'll be damned if I didn't floor it home one day when she texted \"don't need a ride ____ the lesbian is giving me a ride home from work!\". ",
            "You should get a nanny cam for those nights you're away. She's already disrespected you enough, it doesn't seem like it would be such a leap to \"what he doesn't know won't hurt him\". ",
            "hahahahah. no",
            "Ask her if you can invite a lesbian over to cuddle with you while you're out of town.",
            "I'd just set up surveillance or a recorder because trying to argue or discuss something that both parties are completely dead set on is pointless. You'll know for sure just how gay he is when you watch it (I'd suggest fast forward.) You'll also have undeniable proof of whatever does/doesn't happen. Best part is if something DOES happen and you confront her you'll be at fault cause you invaded her privacy. It's really magical.         \n        \nAnd yes I know how ridiculous this sounds but how else can you really know anything that goes on without one of them coming forward. Which isn't going to happen with them talking about it casually in front of you. Whatever is going to happen is something only they know. She's just trying to cheat on you with vague permission.",
            "What the fuck? \n\n\nNo.\n\nYour \"wife\" shouldn't have these so called \"emotional\" relationships with anyone else but you. Her request is ridiculous and you should talk to her about it.\n\n\nMaybe it's because there hasn't been much of an emotional connection at home? Communicate and figure it out. \n",
            "Has this gay friend made this offer to her already, or is she planning on propositioning him?  Most gay people don't care for being treated like an accessory or a handbag (and it's amazing how many straight people try to get away with it), since they are, you know, human beings.  This guy is a person, not some sort of eunuch body pillow. ",
            "Hey, man, She keeps pushing it and the way it looks like, she'll do it anyway once your gone.",
            "She wants to bone this dude and then use you're agreeing to let him spend the night as an excuse for it happening.  It's a trap!",
            "I can guarantee without reading or any context this is not ok and you are not being unreasonable....Ill edit after I read it though. Dont fail me future me.\n\n\nEDIT: She insulted you for saying no you aren't comfortable with this? The fuck is wrong with her? I don't care if its another guy/girl gay/straight no one is to sleep with my SO. There are exceptions. babies, nieces nephews ect. She seems to have little to no respect of your boundaries.",
            "Um. Hell no. I wouldn't even want her cuddling in our bed with one of her FEMALE friends. It's weird.  \n  \n",
            "Just tell that while you're out of town you're going to hire a hooker to cuddle with you in bed, but it's totally non-sexual. It will only be cuddling. ",
            "what the fuck. \nI would be 100% not ok with this. ",
            "Forget that it's a guy for a minute. She wants to invite a stranger to sleep in your bed. That's not even safe. Y'all really don't even know this man! ",
            "Sounds doubtful he is actually gay. Sounds like she is trying to hide an affair in plain sight. ",
            "You Need a Hidden Camera:\n\nOnly because she is pressing the issue, you better invest in a nice hidden camera for your bedroom because it sounds like she is going to go do it anyway since it is completely justified in her mind already so she will feel guilt-free and just not tell you about it.\n\nThink of it like you watching porn and not telling her about it. You know it's okay to do but your wife may irrationally be against it, she may even call it \"cheating\", so she just doesn't need to know about it. That will be her mind-set while you are away.",
            "During my relationship of 5 years, I've had other guys sleep next to me in bed while the bf was away. Old, dear friends. The difference is that the bed-sharing wasn't the event - they slept over because they were drunk or too tired to get home. If there was cuddling, it was of the most platonic and desultory kind - an arm resting over the other person's shoulder, etc. - and only briefly as we both succumbed to extreme fatigue.\n\nMy point is, if your wife is having someone sleep in the bed with her 'to cuddle', there's something more going on there than mere hangouts and companionability. I'm not saying she wants a sexual relationship with this person, but I am saying that it bodes unwell for her feeling of fulfillment in the relationship. \n\nThe dangerous issue here is that even if you say no, the underlying problem will still remain, and another problem will have been developed - the fact that she can construe your answer as a jealous or possessive one. \n\nNo sir, I don't like it. Good luck my friend.",
            "This is weird af",
            "Fucking Jenny",
            "I would be more okay with my SO having sex and then leaving or kicking that person out of the bed than I would with them snuggling up together and spending the night. ",
            "Do you have any lesbian friends?",
            "Option 1: gay, cuddles, and innocuous fun.\n\nOption 2: gay, sex with your wife.\n\nOption 3: not gay, your wife lied, time to bail.\n\nHow do you know he's gay?\n\nLots of gay guys I know have been with women. And bragged to me about how they rocked that woman's world.\n\nIf you think its option 1: tell the gay dude directly that you don't want him coming over for cuddles, and that you've told your wife you consider her doing so unreasonable, and if necessary that your wife told you that he's gay.\n\nIf you think its option 2/3: Hire a private investigator to document the gay dudes visit to bang your wife, with cameras, and stuff.",
            "Sounds fair, as long as you can go to backpage and find someone to cuddle with you while you're out of town.  Oh, what's that?  Is that stepping over a line?  Weird...",
            "You aren't being inappropriate. It's completely reasonable to reserve that kind of intimacy for your relationship/marriage. ",
            "Is she out of her fucking mind?  It sounds like she wants to cheat on you if she hasn't already.  Maybe setting you up for the \"oh you must have gotten his STD from sleeping in the same spot\" bull shit or \"it's not cheating because it was only anal\".  You should probably get tested...  Even if he is only cuddling with her, it shouldn't matter, if it isn't you then it is cheating.  If she needs to cuddle, get a cat or a dog.  Her pushing the issue makes it seem like it has already happened and she needs you to say it was okay.",
            "doesn't matter about a person's sexuality, this is wrong\n",
            "I would not be even a little ok with this. Especially if he \"was straight\" in the past.\nSomething smells fishy, bubs.",
            "You fucking kidding me dude? You gotta call your wife out on that shit and tell her to pack up her shit if she ever brought it up again. ",
            "All I have to say, is good luck man...",
            "I know I'll get downvoted for saying this but in my early 20's I had a bad habit of fucking women that were in relationships, married included. 90% of the women, when questioned about me by their husbands or boyfriends, said I was gay. I played along because I was getting laid. What I'm getting at is, do you know for sure that he's gay? Have you seen him with another guy or is their any evidence on social media? I've actually been in a similar situation. She didn't tell him we were going to sleep in the same bed only that I was going to come over for \"girls night\" because she didn't want be in the house alone. I'm not trying to make you think that she's cheating just giving you my POV after reading \"You would never guess him to be gay in any way.\".",
            "Good thing he's gay. That way, if they ended up having sex, it would be totally okay /s",
            "WTF... Wife needs a good kick in the arse. Who does she think she is and how does she think of you? By suggesting this, your Wife has zero respect for you and the marriage.\n\nMy answer would be, no way and if you don't like that, you know where the door is. \n\nBullshit my friend. ",
            "Your wife has the biggest nerve I've ever seen with this request and her attitude. She crossed a line man. What she asked is not cool, even worse how she dismissed your answer. \n\nI would totally understand if she wanted company and the guy slept in another room or on the couch. Not in bed with her!! \nHe may be gay, but she isn't. She could get aroused by this guy sleeping so closely together! ",
            "I don't know what you're next actions would be, but if I'm building an intimate, monogamous relationship with someone I love, there's three pieces of attraction I need to have with that person:\n\n-Emotional Attraction - trust, confiding myself in them, stability\n\n-Physical Attraction - health, physical beauty in my eyes\n\n-Chemical Attraction - instinctual reaction of being drawn to them\n\nThese are the legs to my relationship stool.  Without one, it falls.  And all of them need to be at 100% attraction, otherwise the stool creates a slant which makes it easier to fall, and makes it easier to rock the relationship.\n\nShe sounds like she's invested herself in a mental/emotional attraction to this man, and regardless of his sexuality (or anyone's), she is sharing intimacy with which she shares only with you now with another.  AND, because it involves an intimate spot and activity (bed & cuddling), that makes anything physically attractive amplified.  At some level, I can only think she has been drawn to the man due to some chemistry she thinks may be there, which will only make the other two traits that much easier to take advantage of.\n\nThe only advice I can give is if she doesn't connect with you if you tell her how you feel, maybe tell her to talk to someone that she & you trust (parents, most likely).  If she won't talk to them, it seems like she doesn't want to listen to logic because her emotions have overtaken the logical side of herself, and if that happens, you may have to cut ties.  I don't like to tell people that, but if you say \"yes\" to her on this, you'll grow to regret her and distrust her opinions, and that's what a relationship is - and that's what that relationship won't have.  Good luck, Atlas.",
            "Inappropes! ",
            "\"gay\"\n\n;)",
            "Heh my take is that your marriage is on the way out the door.\n\nYour wife is either a complete fucking idiot, or she *thinks you* are a complete fucking idiot.\n\nEither way, cuddling my ass. There's a real problem that she would suggest something so silly, whatever the problem is... it's gonna fester, and it'll grow... and she's gonna bang the shit out of someone if you two don't figure out what is going on.\n\nJust my opinion but, seems fairly obvious.",
            "I think you have much deeper problems in your relationship than this one issue and you should definitely seek couple counseling as your feelings and concerns are not being heard and if she's seeking emotional support and attachments with ANY one else of any orientation, that's a problem to me.",
            "Is she stupid? Mate, get her a stuffed animal and tell her to deal with it. ",
            "One of the reddest flags I've ever read.  Something has either happened, or will in the near future OP.",
            "As someone who would be totally fine with my wife cuddling with a gay friend, I'd like to say that your wife is way out of line. She wants something that's apparently not that big of a deal to her, but makes you very uncomfortable, and you have communicated that fact.\n\nThat should be sufficient to end the discussion, unless she can communicate why it's more important to her to have a cuddle-buddy than it is for you to feel safe and comfortable in the relationship. Maybe she's afraid of murderers or aliens coming for her in the night (this is why my wife might need a friend to sleep with). If she can't explain her reasons in such a way that you understand why you should put her needs above your own comfort, though, she shouldn't expect you to do so on faith.\n\nThat's not how to bring her around, though. My advice for the conversation with her is to be self deprecating. Tell her that this makes you intensely uncomfortable, and that it might be silly to feel that way but you do, and you really need her to not do this. \n\nA lot of commentators seem to be framing this as \"if she does this, she doesn't care about you or your relationship\" and advising you to discuss it under those terms. That's not how people work, and it's not how relationships work. Say the thing that will get you what you want, not what will make you feel right.",
            "The fact that she is pushing this issue raises a red flag for me. \n\nYou said you don't really know the guy and you'd never guess he was gay. Do you think he's actually gay? Or is you wife trying to get some on the side.",
            "Sorry dude, but I think your wife might be looking for a chance to cheat on you. \n\nCalmly tell her how you feel. Tell her this is non-negotiable for you. If she persists in the \"but hes gay. he wont do anything\" argument, then ask her how she'll feel when you cuddle up with a lesbian while you're out of town. \n\nAnd whether or not she agrees not not invite her \"gay\" friend over I would suggest you strongly consider setting up a few nanny-cams in your bedroom while youre away. I am very confident that she is, or soon will be, cheating on you.",
            "It doesn't matter whether you're unreasonable, (you're not), your wife does not consider your feelings and lacks any trace of respect for you. She seems to get away with a lot, and at some point, this has to stop. You have tried reason. You have tried pleading. You have tried analogies. It didn't get you anywhere and she keeps pushing the issue. If I were you, I would lawyer up, get tested and hit the gym immediately. And that's because it doesn't look like you have a loving wife anymore. Not at all. Don't tell us this comes out of the blue. There has to be a long pattern, a parade of red flags leading up to this. Take a good long look in the mirror, that's what I'm saying.",
            "Why the hell does she want him over to sleep with her while you are gone so badly anyway? \n\nLike I can't imagine why this is worth fighting for so hard after just meeting him that makes me think there is something else going on. \n\nWorried the \"gay\" friend isn't gay, and she's known him longer than you think... I hope not man. ",
            "It's all fine and good as long as she doesn't mind you inviting that cute lesbian woman over to cuddle with you, while you are out of town.\n\nAnd failing that, you let her know that no, you are not okay with that, and if she does that she will be single very quickly.",
            "You've already updated below here, but if she wants cuddles inside a monogamous relationship, I'd tell her to look into group cuddling. I don't know if they're available in every area, nor how much they would charge, but it can give you a feeling of closeness without the private setting.",
            "Beyond weird. I've got a fair number of gay male friends that I've know for years and I can't think of one that I would ask to cuddle with me in my bed...it's just odd and definitely inappropriate in this case!",
            "Anybody who tries to shame their partner for being uncomfortable is being massively disrespectful, and demonstrating they don't really *care* how their partner feels.  They just want to do it and have there be no consequences.",
            "Are you sure this guy is gay if you've only met him a few times? Sounds like to me your wife and he know each other better than you know him. Saying she's going to hang out with her \"gay\" friend is the oldest and most overused trick in the book. If you don't know this guy well and haven't met his significant other, or heard from very reliable sources that he is for sure gay you might want to start snooping.",
            "You are absolutely right. No man gay or not should be in that bed cuddling with her but you. That is so wrong on so many levels. There are just certain things you do not do that should just be part of the bro code. ",
            "Show her this thread, let her see how ridiculous she's being.",
            "Man. I really thought there would be at least one post like, \"I don't see what the big deal is. I'm 17 and cuddle with my gay cuddlebuddy all the time. My bf doesn't own me.\" I'm rather disappointed.",
            "I'm going to be as moderate as I can be here. It is possible to want to cuddle with a *friend*. Or even a stranger! It's also possible to have an *emotionally intimate* relationship with someone other than one's significant other. My wife has an \"emotionally intimate\" relationship with her best friend, and I wouldn't care if they wanted to cuddle. It's nice, she provides emotional support and enjoyment that I don't. I take it on faith that they aren't looking to have sex with each other. But I know both of them very well and have a lot of experience to understand where their boundaries are.\n\nBut what your wife is suggesting sounds completely different because, it sounds like, she doesn't think of this as a completely different thing than what she gets from your relationship. It sounds like she's asking to have a polyamorous relationship, using words like \"vanilla\" and \"alternative\" in this context, talking about different modes of relationships. It sounds like you're not cool with that, and you don't have to be. So have a conversation with her about what the intimacy you two share means to you, and in what way the exclusivity of that arrangement is important to you. Tell her how different scenarios feel to you! Tell her your fears! Then listen to her needs and hopes and work it from there.",
            "My best friend of five years is gay and when he stays over or I do we share beds. We do NOT cuddle. That's weird as hell. You have to feel some sort of attraction to someone to want to cuddle with them. And if you do, obviously something's wrong. ",
            "Her \"gay\" friend who definitely doesn't swing both ways.\n\n\nHonestly she sounds horrible.  ",
            "Divorce her ass.  \n  \nYou're not weird.  \n  ",
            "Thus is completely bizarre, your wife is way off track here.  ",
            "He gonna fuck yo wife. Long dick style.",
            "got kids? nope? lawyer up.",
            "I would definitely show her this thread. She is absolutely out of line on this. Stay strong man.",
            "What really worked for me in my previous relationship was a mutual understanding that you don't have to be open to everything. It's okay to not be comfortable with something. There's a fine line between distrust and lack of understanding, and legitimately not feeling comfortable with certain things. Especially if those particular issues are intimate.\n\nAnd the more intimate a particular subject is, the more important it is to understand that you *don't* have to force or change things you're uncomfortable with.",
            "Why in the world is wrong with people? I know I'm not helping here but go get a hooker and pay her some money to pretend that she is gay, and cuddle with her in front of your wife.",
            "I wouldn't want anyone cuddling with my partner.  Gay, straight, asexual, castrated- doesn't matter.  That is seriously odd.  I don't mind the whole \"this is my best friend forever and we cuddle on the couch while watching a movie\", but cuddling in your bed while your gone would not be cool with me.  To be honest, this sounds off.  I hate to say someone that identifies as a gay isn't actually gay, but in this instance something seems odd.",
            "He's bi and she wants him to stoop her.",
            "No. I don't cuddle with anyone besides my husband. This is super weird and out of line.",
            "Yea NO! I would not even buy into that. I'm a woman and that's your bed and your wife... The thought of another man in your bed should make you cringe gay or not.",
            "please be troll, surely she is not that stupid",
            "You seem to have some misconceptions about how being gay works. If he was \"straight most of his life\" then he was either deeply closeted or he is bi. Under the circumstances, I'm guessing the latter.",
            "You are not being unreasonable.  Physical intimacy isn't just about sex.  Cuddling in bed with someone is pretty damn physically intimate - there is a huge level of trust in falling asleep around someone in your own bed.\n\nShe can bring up your \"vanilla-ness\" all she wants - which has no bearing on this argument by the way - it is an intrusion on the intimacy that is at the core of your marriage.  She's inviting a third party into it, and expecting you to be happy about that.  You have a right to NOT be happy about it.  It doesn't make you lame - it means you aren't into a relationship that involves more than two people.\n\nAnd if she's throwing up business travel as the reason?  Please.  My husband and his former colleagues all had intense travel schedules.  Not a single one of the wives considered inviting a gay man into our bed to cuddle while they were gone.  It's not really SOP.",
            "Why does your wife want to sleep with another man while you're out of town?",
            "Your wife is weird and she needs to know that.\nIt's not normal for her to request this.\n\nAlso I highly doubt that he is fully gay, is he claiming that he has absolutely no attraction to women?\n\nAnd if so, he went his whole life being straight and just out of the blue decided women were gross?",
            "The first comparison that jumped to my mind would be asking her if it would be OK for you to hire a prostitute to cuddle with. I mean, she wouldn't develop feelings, and it would just be about the physical comfort. When you marry someone, you are their physical, mental and emotional partner. You don't just pick and choose and say only one of those matters. at least that is my opinion. ",
            "She's feeding on your pain. ",
            "In the town where I live there was a bit of a scandal when the local optometrist's wife had an affair with a gay man. For some reason he decided he felt like \"a bit of vaj\" (his words) for a bit. So just because one is gay doesn't mean he's not gonna poke the bear. Therefore yes your feelings are totally valid.\n\nTo be fair, even if it was a man with no dick or whatever your feelings would still be valid. Cuddling and sleeping together can be even more intimate than sex. I would suggest marital counselling cos from your post it sounds like wifey is a bit bored. Sorry man :("
        ]
    },
    {
        "post_id": "4ik8qp",
        "author": "ignoranceischris",
        "title": "[Update post] Girlfriend [22F] coming to visit and stay with my [20M] family. She said some really insensitive and hurtful things towards my sister [22F], although she now feels terrible and very sorry. My sister is still extremely upset however. I don't know how to handle the situation.",
        "url": "https://www.reddit.com/r/relationships/comments/4ik8qp/update_post_girlfriend_22f_coming_to_visit_and/",
        "score": 2101,
        "num_comments": 144,
        "created_utc": 1462810002.0,
        "selftext": "Link to original post: https://www.reddit.com/r/relationships/comments/4ieass/girlfriend_22f_coming_to_visit_and_stay_with_my/\n\nThanks for all the advice I got from you yesterday.  You'll be happy to know that my girlfriend is now my ex-girlfriend, she's gone, its over, I sent her home. I won't be seeing her again. \n\nFirst thing I did was apologise to my sister and tell her how sorry I was for having been a shit and useless brother. I should have been there for her but I failed her by giving my girlfriend more chances even after how cruel she had been.  I told her how ashamed I felt and how I had failed her as a brother, and I promised her I would never do that again. I swore to her that I'd never let put her in a situation where someone can do that to her again, I made a promise and I really do mean it this time.\n\nShe forgave me and told me how glad she had honestly really been hoping that I break up with her and send her home, but she didn't want to push me about it, and she reassured me that I am in fact a good brother, and I shouldn't be too hard on myself and call myself a shit brother.  I told her it is honestly what I am because I failed her when I should have been there for her.\n\nI explained the entire situation to my parents and told them everything that had happened and how my girlfriend was no longer my girlfriend because of what she had done, we are now through.  I explained to them that the remaining two weeks we can all spend together as a family and I am really looking forward to that.  Both my parents supported me and told me I'd made the right decision, I told them I should have made it earlier and I failed my sister by waiting too long, but they forgave me thankfully and were understanding.\n\nAlso, some people had mentioned the shorts I had bought. You are right, I was totally sending her the wrong message by getting her something she can wear that will cover up the scars.  I told her those shorts I bought are just if she wanted to use them, but I don't think she needed them, and I don't think she should use them. I told her in my opinion she had nothing to be ashamed of from those scars, I think those scars are very beautiful and I think she is beautiful with them, she should be very proud of herself because she struggled through an immensely difficult period and overcame many hurdles throughout her life and she ended up on top of it all as a winner. I told her in my opinion she is a hero and she will always be my hero, the strongest and bravest person I've ever known.  She was really happy to hear that and so were my parents,  she said she's not feeling as bad about those scars as she was the previous days and she's ready to go to the beach again.\n   \n**tl;dr**: Broke up with my girlfriend, she's gone, apologised to my sister and family for having been a shit brother, they forgave me and now I look forward to spending the remaining two weeks with them.",
        "permalink": "/r/relationships/comments/4ik8qp/update_post_girlfriend_22f_coming_to_visit_and/",
        "comments": [
            "[removed]",
            "Good for you, it took you a little while, but you got there in the end.  Doing the right thing isn't always immediately clear when you're in the thick of things, and emotion can cloud you.  \n\nEven in your last post, you sound like a pretty good brother.  Your sister trusts you, she leaned on you when she was hurting, and you've admitted your mistakes and seem sincere in your promises not to repeat them.  I wish you and your family all the best moving forward.  ",
            "Good fucking riddance. Your ex was a horrible person. You're a good brother. Keep it up!\n",
            "Can I say how amazing your sister is? She loves you so much that even though your girlfriend tore her self-esteem apart, your sister still didn't pressure you to break up with her. She wanted to see you happy, even if it meant putting up with your horrible ex. You're a lucky guy to have family like that in your life. ",
            "Your sister is going to remember that you made the right choice in the end. And you did: you asked for advice in a situation where you were heavily emotionally invested, you took the advice, AND you owned up to the fact you should have done it sooner.\n\nYou seem like a good brother and a good person, and it's awesome news that you and your sister are still a team.",
            "I'm glad things are good with you and your sister.\n\nGood riddance to the crappy girlfriend.",
            ">she should be very proud of herself because she struggled through an immensely difficult period and overcame many hurdles throughout her life\n\nYou are a wonderful brother.  ",
            "Your last post had my jaw on the floor as to how clueless you seemed to be. Really glad you came around though. You seem like a good guy, you don't deserve someone as cruel and heartless as your ex. Good job sticking up for your sister. This Internet stranger is proud of you.",
            "I didn't comment yesterday because everyone else (rightfully) tore you a new one, but I'm proud of you for making the right decision for both your sister AND yourself. You're a good brother. I'm glad to hear your sister's doing better. \n\nI can't believe how little empathy your ex had; I wouldn't dream of saying the things she said to my worst enemy, and her reasons were petty at best. Your sister's brave and her scars are absolutely nothing to be ashamed of. They're battle scars. I have some too. All they are is proof of how strong she is that she came out on top. \n\nIt sounds like you guys are gonna be fine. Good on you, OP. ",
            "I love it when toxic voices are immediately silenced!  I really do believe the \"hear no evil see no evil...\" saying goes a long way.  It's amazing how many little comments can add up and really alter a person's life course. You just took a bat and knocked them all away out of the park and fixed what damage was done.   A part of me becoming semi mute was from one kids comments being the straw that broke the camels back and I wonder so much how different life would be without him (DRAMATICALLY INSANELY better, because he did way more damage afterwards because I put up with him since he ended up being the best friend of my bf, who I had to move in with to escape my abusive mother)   It makes me happy imagining the way things could be if I didn't cut someone out, and then imagining how it will be now that I have.  ",
            "Thank you!\n\nYou took some heat from us but I'm so glad you finally did the right thing by kicking that toxic ex to the curb. Be careful that she isn't so vindictive to send messages to your sister over text/social media to try and rip her down.",
            ">Also, some people had mentioned the shorts I had bought. You are right, I was totally sending her the wrong message by getting her something she can wear that will cover up the scars. I told her those shorts I bought are just if she wanted to use them, but I don't think she needed them, and I don't think she should use them. \n\nOP -- While I understand the point those people were making, I think they judged you a little too harshly about the shorts. And before I get downvoted straight to hell, I want to point out that I used to self-harm regularly (cutting, burning, etc) and I still have prominent scars on certain parts of my body. So this is something I understand via experience.\n\nAll that being said, I think OP should get a pass for the shorts. OP was not the one who said \"You shouldn't go to the beach,\" or \"you should really cover those scars up.\"  Those thoughts and comments came from the sister's own mind. When a person has given up self harm, they can feel *very* self-conscious about the scars of their past . There are tons of judgmental people out there. And since the scars are actually representations of deep (emotional) pain, and one's difficulty in dealing with that pain, she might even feel that they're a sign of weakness and shame, being worn on her skin, impossible to remove. \n\nWith most people, you can't see any of the pain and misery of their past. With a serious self-harmer, their emotional pain is written on their skin, for everyone to see.  \n\n*She* was the one who suggested she was uncomfortable with ever going to the beach again. OP buying the shorts was merely a kind-hearted instinctive reaction to prevent that. He had no intent to send any kind of message -- he just wanted his sis to stop being sad, and wanted her to be able to enjoy herself. \n\n\n\n",
            "Thank god. Well done. Hope her next boyfriend doesn't have a sister.",
            "[deleted]",
            "Good for you OP. Hope you find a nice sweet girl ",
            "You did the right thing. ",
            "I'm proud of you. I'd say you could do better and you have. You are a good brother and a good man. Make sure to block your ex in social media, that your sister does the same, and make sure all your accounts have good, strong passwords.",
            "Good for you!  Remember that even assholes are okay 95% of the time.   It's that 5% that's too much asshole",
            "never forget how fucking toxic and extremely mean your exes comments were, and how rude she was in general \n\nYou live and learn but dont forget about why you broke up with her",
            "That's really good, I'm glad you talked about the shorts as well. I know a gal who I still stay in contact with who self harmed in high school, she didn't just do it for the attention and feels a lot of embarrassment about the scars now. They're just a part of her growing and getting past depression or lifes hurdles, I don't think anyone needs to hide them. Glad you're such a good brother and got the crappy girlfriend sorted out.",
            "So pleased that you gave that nasty thing the heave-ho. You sound like a great brother, and I'm glad you took your sister's side.",
            "Kudos!! Congrats to you on your newly found freedom. Decision well made.",
            "[removed]",
            "You are a good brother and you absolutely did the right thing. Kudos to you!",
            "Yay!\nHappy update! I'm glad you realized it was best to get rid of the toxic person in your life.\n\nWhen you get back in 2 weeks I highly recommend being no contact with the ex. I can picture her trying to weasel her way back in once you are back.\n\nThis leaves you with an opportunity to meet someone new who isn't...how can I put this nicely?\n\nAn over-possessive lunatic...\n\nGood job, OP! :)",
            "What I wouldn't do for a brother like you. Your family is lucky to have you as a part of it. ",
            "Aww, this is such a heartwarming story. Don't feel bad about taking so long;  if I was your sister I would feel sooo touched that you broke up with her at all for my sake. She now really knows how much you care about her. I hope you find a girl who appreciates what a connected, loving family you have. It's a rare and precious thing. For most sane, non-jealous people, it's a huge perk if their bf/gf has an awesome family.",
            "You are so lucky to have such a close loving relationship with your sister. I grew up an only child and would have loved to have had a sister to bond with like this.",
            "You sound like a very thoughtful and supportive person. You've shown a lot of empathy and maturity for being 20 years old. Way to go :)",
            "Your ex had some serious Jeykll-Hyde going on. I'm not sure she's even mature enough to be dating in the first place. Getting that jealous of a sister? Whaaaa...?",
            "How did your ex handle the breakup, I bet she went full cray cray on you. ",
            "I used to self harm and all I can say is thank you. Seriously, thank you. Thank you for getting that toxic behavior away from your sister. I've had some really really shitty things said to me, and it hurts more than the scars themselves sometimes. Those comments your ex gf said stung just reading them. I hope your sister recovers from that quickly. You're a good person, OP. Thanks for being so supportive for your sister. She's lucky to have you as a brother.",
            "Still deeply curious how your girlfriend of nearly a year suddenly showed her true colors in this way.  In hindsight do you recall any other red flags? ",
            "Glad you got rid of that human piece of shit OP. What a fucking terrible human being! I am still baffled by the things she said.\n\nGetting jealous of YOUR SISTER. YOUR SISTER. WHAT THE FUCK!!!!!\n\nYour ex-girlfriend needs to be put in a mental ward. She has major issues she needs to resolve.",
            "i wish i had a brother who would realize and apologize for his mistakes.for the sake of those with shitty brothers, please keep that up and continue supporting your sister",
            "You are a wonderful brother. I also have scars covering the tops of my thighs and just came back from a beach vacation. I was super nervous the whole time and zero people said anything about it. I was incredibly grateful. Your previous post felt like multiple punches to the gut to me (like every single part was my worst nightmare of how a person can react to your body and past) and I'm SO glad you made the choice to drop a callous person like that in favor of your wonderful sister. You didn't fail her. Well done sir. *golf clap",
            "This is amazing ",
            "*high-five*\n\nI am sorry for being overly critical in your first post but I really wanted to make sure you got the message.\n\nYou absolutely did the right thing.  Not only did you cut that cancerous wench out of your life but you went to your sister and fully apologized.  You're a good brother.",
            "Well done! Your sister now knows that you have her back. ",
            "Go you! But don't be so hard on yourself - you were stuck between two pretty important people, and it sounds like it wasn't an easy situation to navigate. What matters is you rectified it in the end. \n\nThat doesn't make you a \"shit and useless brother\" - it makes you human - and an honest one at that.",
            "Your family sounds really lovely. I'm sure you'll find someone who fits in harmoniously.",
            "good on ya, man. you'll do alright. ",
            "You did the right thing. Good job. ",
            "Happy to hear about your sister's feeling better! A close friend of mine used to cut and really didn't like her scars (forearm). She decided to get a tattoo that covers them up and she feels much better about wearing short sleeves now. Her close friends know what's under it, but most people just see a very nice tattoo.\n\nThat might be something your sister could be intersted in if she really doesn't like the world to see them.\n\nBest of luck to you both!",
            "Yay! Good job, OP. You can and will find someone better. :)",
            "I love that this whole post is protective of your sister, and barely mentions your girlfriend.",
            "Great update. Love wins. ❤️❤️❤️",
            "It sounds like your family forgives you, I think you should ease up some on yourself too. You sound like you have a good head on your shoulders, and you have learned from the situation. ",
            "I just read your first post and I hate your ex-girlfriend. What an evil witch. And I'm talking Disney-evil- stepmother-villain grade witch.",
            "Congratulations on breaking up with the worst person in the world. \n\nI have to say, OP, you also need to be congratulated on this singular Achievement: unifying reddit! I've never seen a thread where everyone had the same opinion.\n\n\nFrankly, I think you should have printed the thread and given it to her as a going away present. ",
            "Huzzah!\n\nI generally try to find a positive but when I read the original thread i had to shut the laptop down as I was far too angry to leave a comment. very pleased to open reddit today and see she's gone.\n\nI'd be curious to hear from OP if the ex-girlfriend really understood what she had done wrong or if she made any further promises to be 'better'",
            "You are a very sweet and sensitive, caring person. Trying to keep everyone's feelings up, and putting everybody before yourself! Cheers to you mate! You will make a proud boyfriend when you find the perfect lady! A lady who would only see your family the way you do and love you blindly as you love your loved ones! Go get em tiger! ",
            "[deleted]",
            "I'm saying this as someone who used to self harm just like your sister, scars like that are not at all beautiful. Scars like that are ugly, because they represent an ugly time in our lives. Don't glorify self harm. ",
            "You screwed up but you are making *real mends and steps to correct this.* Unlike some people you recently knew (like your ex gf, hey good job!) \n\nEnjoy your two weeks but be wary that crazy ass might come back.",
            "Great job OP. You made the clear right choice for you *and* your family. :D",
            "This is the update I was hoping to see! Good on you OP! You're a good brother and an even better person. ",
            "You're amazing! :) Your sister is very lucky to have such a caring and loving brother.",
            "Super proud of you, congrats and good luck with your future.",
            "Great update! Enjoy the rest of your family vacation! :)",
            "Thanks for sending your girlfriend away! I have self harm scars covering my thighs and I know how hurtful it is when people say mean things about them or even ask about them. I think it's pretty obvious, why even ask? And it's definitely not for attention, especially if they are on her thighs where no one can see them like mine are. I wish I had the courage your sister does to wear a bikini bottom without shorts!! Good for her :) ",
            "This was a good thing in the long run OP. You dodged a bullet. Glad she showed her true colors before it got more serious!",
            "I'm so happy you broke up with her. I feel so relieved. Please don't ever allow anyone to treat your sister like that!",
            "Good.  I second the recommendation to block your ex on social media.",
            "Took you long enough, sat there and watched this girl tease your own blood about killing herself and your first move was to forgive her and run to reddit to ask if it was ok to get mad?\n\nEveryone else can tell you you're a good brother, I think you sucked it up.",
            "I just have to commend OP for being incredibly mature and grounded throughout all this. The emotional intelligence exhibited by OP reminds me of an experienced couples therapist or mediator, not a 20 yo bro. \n\nOP, you're a great guy, and I seriously look up to you and hope to be as strong as you soon. Keep doing you brother.",
            "It wouldn't be a shitty explanation. From someone who has be severely depressed and lost someone close from it it not something you take lightly. The way she was is very wrong but it messed with her in a bad way. It's like she judged your sister and took it personal. I'm a psychologist so there has to be some underlining issues. But if it's pure resentment because you guys got along that's kind of crazy and id make sure she doesn't try anything else. ",
            "I'm going to play devils advocate here. Do you know if someone close to your ex has committed suicided? That's the only thing k can think of for someone to act this way. "
        ]
    },
    {
        "post_id": "9zrlyb",
        "author": "ZealousidealMonth",
        "title": "The mental health hotline that I (25F) volunteer for just hired a girl (25F) who bullied me in high school.",
        "url": "https://www.reddit.com/r/relationships/comments/9zrlyb/the_mental_health_hotline_that_i_25f_volunteer/",
        "score": 2102,
        "num_comments": 161,
        "created_utc": 1543003893.0,
        "selftext": "For the past five years, I've volunteered for a mental health hotline. I'm deeply passionate about the hotline's work, and I've devoted huge amounts of time and energy to answering calls, training new volunteers, and fundraising. I've become close friends with many of the people I volunteer with, and I get a lot of joy out of helping people who don't have a lot of other support in their lives. I love this organization; I can't imagine my life without it.\n\nToday, the head of the organization sent out an e-mail announcing that they've hired a new volunteer coordinator: the girl who relentlessly bullied me in high school and made my life a living hell.\n\nI was completely blindsided. I moved across the continent after graduating from high school, and I have no idea how or when this girl moved to my city. I doubt she applied for this job to deliberately antagonize me, since we've had no contact since graduation and all volunteers are anonymous. So it's just a terrible coincidence, but it still means I'm going to have to be working with a person who was unbelievably cruel to me.\n\nI really don't know what to do. Obviously, all of this was a long time ago, and it's possible she's cleaned up her act since high school, but I still hate the idea of even being in the same room as this girl. I've had her blocked on every platform for, wow, over a decade now. It looks like my only options are to, a) tough it out and deal with this person coming back into my life, or b) quit the hotline after five years of service.\n\nTL;DR I've volunteered at a mental health hotline for the past five years, and they just hired a girl who bullied me in high school as the new volunteer coordinator. I definitely don't want this person in my life in any capacity, but I also don't want to quit the hotline. What can I do?\n\n**Update (Friday, 7:43 PM EST):** Shortly after making this post, I went for my regularly scheduled afternoon shift at the hotline, and the girl just happened to be there for some kind of orientation. I wasn't expecting her to be there, so I initially just kept my head down and ignored her. A little while into the shift, she came over to introduce herself, and genuinely didn't seem to recognize me. (I've cut my hair and gotten glasses since high school, so that could have been it.) It was a very brief interaction, and I didn't say anything to her in return, just nodded and smiled. \n\nAfter she left, I asked my shift supervisor if I could speak with her privately. I followed some of the advice here - just letting her know that I have a history with this person and I'm not comfortable working with her directly. The shift supervisor was very understanding and said that she could arrange for me to only serve shifts when the girl isn't supervising. She also offered to let me schedule my shifts through her instead of through the girl, which I appreciated. Unfortunately, it seems like there will be an unavoidable level of casual interaction, given that the girl is working in the facility on a full-time, 9 to 5 basis. I think I'll be able to stick it out for now, but we'll see. The shift supervisor did ask me what I wanted to tell the girl, vis a vis an excuse for my not wanting to be on shift with her, but I couldn't think of anything to say, so I left it up to her.\n\nThanks for the kind words and the good advice, everyone. Much appreciated.",
        "permalink": "/r/relationships/comments/9zrlyb/the_mental_health_hotline_that_i_25f_volunteer/",
        "comments": [
            "Don't ruin your mental health for a volunteer position. Maybe there are other mental health hotlines in your vicinity you can volunteer for?",
            "So, the first thing is probably to identify a different hotline you could volunteer with, and then speak privately to your contacts at your current hotline and ask if they are willing to serve as references etc. Get that set up so that you have a way to continue giving back--obviously this is important to you, so you need to find a way to continue doing that work.\n\nThen I'd talk to whoever your usual manager is (unless it's this woman), and say that you need to resign as a volunteer, you have the utmost respect for the organization and you have really loved your time there, but that the new volunteer coordinator is the woman who bullied you in HS, and even if she's changed as a person, you can't work under someone who used to bully you.\n\nYou are not bluffing when you say this, btw. Your plan is to leave. They will not fire an employee because of a volunteer's unwillingness to work with her. You have to look out for yourself here. She may well have changed for the better, but that doesn't mean you need to be around her at all. I'm so sorry, but I think the best possible thing for your own mental health is to find a new organization to dedicate your time and energy to.",
            "You could privately talk to your manager about what you went through and how bad it was.  Maybe they could make sure that you're always working different shifts?  I wouldn't quit without trying to talk to someone about it. ",
            ">it's possible she's cleaned up her act since high school\n\nI was going to say this because people can change a lot from high school to their mid-twenties. Honestly, I think there is a third option other than the one you laid out which is try to use this as an opportunity to improve your own mental wellness by seeing if you can't get some closure. Forgiveness is incredibly tough, so I wouldn't blame you for saying \"Fuck that\" but it could be such a healing moment if you were able to let her know how much she hurt you and seek to forgive her if she is willing to apologize and show remorse. ",
            "Have seen her or just received the email announcing the hire?  Could it just be someone with the same name?",
            "I don’t like the idea of continuing to run from a bully as an adult without attempting to work through it.  If it compromises OPs mental health than, I understand.  But there is something to be said for learning to work through these types of issues, before leaving.  ",
            "You could explain the situation to management and discuss options.  Not sure anything will come of it but at least it's an attempt.",
            "[deleted]",
            "If she volunteers at mental health hotline, then perhaps she's changed; is it an option to talk to her about when you were younger and see what her feelings are?\n\nI think it'd be ill-advised to leave for fear of something bad happening before it happens. Wait, meet her, and see how it is. She could be full of regret, she could still be horrible, she could be someone else completely different with the same name as this person... Either way, it's a lot to throw away for the sake of uncertainty.",
            "There are too many unknowns. You have changed, she has changed, the environment has changed. For now stay until you have your first interactions with her - they will tell you a lot abt how things will be going forward and you can decide then.",
            "I think you should stay at the hotline if it means as much to you as you are saying it does!\n\nI'm sorry that a person you thought you were done with is back in your life. I would just keep it short and polite with her, and keep doing what you are doing. ",
            "I don’t mean to sound harsh. But this is an opportunity to face something. She’s a big part of your past. Giving her more power mentally (in your head, not her herself) to let the pain of the past hurt you. \n\nI’m not saying she’s changed. Or that some level of distance isn’t needed. But you need to learn how to be around this and not let it disgruntle you. You can learn confidence and a lot from this experience. I wish you the best of luck ",
            "I ended up working very closely with a guy who used to bully me relentlessly in school. He would spread horrible rumours about me, follow me around shouting sectarian abuse at me, and once he saw me walking back from my friend's house and actually went and bought tomatoes and eggs to throw at me and chased me for about a mile with them. He was a big part of the reason that after my exams I went to a school where I didn't know anyone away from all of my friends.\n\n\nWhen I saw him enter my workplace that Monday morning I felt so angry. Before I had a chance to say anything he was paired up with me so I could show him the ropes. I could tell that he was very uncomfortable with this, and we just spoke about the job very formally for about 20 minutes. \n\n\nThere was a bit of silence when I was showing him something on a computer and he said 'Do you remember me? From school?' I said I did. He asked me what I had been up to since school and if I still saw anyone from school. I answered politely and asked him the same. It turned out he had been through a lot since school and he'd had a hard time. He had very few of the same friends. His whole manner shocked me because he was being very polite and professional.\n\n\nIt took me a while to realise that he wasn't a teenager with his gang of assholes who had his back anymore, and that I was a woman who knew everyone in a place where he was a stranger. We were two adults who had grown and lived a bit of life and developed emotionally and mentally. \n\n\nWe became friendly with eachother. We weren't best friends but we could chat to eachother at break time and added eachother on social media and that sort of thing. We knew a lot of the same people so we could catch up with eachother on what they were doing, and even though we hated eachother in school we were there for a lot of the same things so we had shared memories and funny stories. \n\n\nI wouldn't have ever asked him as an adult for an apology because he wasn't the same person he was and the time for an apology had passed. I just took him for who he had became rather than who he was when he was less intelligent and didn't have the same empathy skills. I did a lot of things when I was younger that I'm not proud of now, but at the end of the day I was a child. ",
            "It’s possible that she’s changed. The social environment in high school is tough, and once people get out of it (and the brain matures) some people change. I don’t know if I was a bully, but I was a head of a little clique in HS for awhile and kind of kicked a girl out of our group. It was mean and I’ve regretted it a lot as an adult. I saw her after college and apologized to her. I’m sure it didn’t mean anything to her, but I tried to make amends and if I were to work with her I’d probably make it one of my missions to be as kind as possible. I wish we could’ve been friends, but I moved out of state so we’re just Facebook friends now. I learned from that situation and think I’m a pretty nice person now. High school wasn’t a picnic for me either. While I was being snobby to her, a whole host of other people were being horrible to me, I was in an abusive relationship, had a toxic family environment, and I was trying to stay afloat as well. I wasn’t even mean to her because I didn’t like her. Someone told me that she had a bad reputation and was ruining our group (I was new to the school and didn’t know anyone), and that’s why I stopped talking to her in HS. Which is SO dumb, haha. I actually really liked her, but my desire to not be outcasted overruled me at the time. Anyways, sorry for my long drama...if she doesn’t apologize to you, or show with her actions that she wants to be friendly and make it up to you, then I’d wonder if she’s still the same person. She could just be really rotten to the core still, so be careful. But, you never know.... I’m sorry you have to deal with this, OP! ",
            "Whatever you decide to do is an absolutely valid decision, there are no wrong moves here. Whatever makes you the happiest and most comfortable is the right thing for you. You are under no obligation to forgive her\n\nI just wanna point out that volunteering for a mental health hotline is a really big thing, most normal people don't think about that. Someone that bullied you relentlessly probably had severe mental health problems and probably worked them out, in part, because of you. It's not right or fair but it's entirely possible that the guilt they feel when they think about it now is what has compelled them to move in this direction\n\nYou don't have to like them or even forgive them, but if you did, it might help you with your own mental health issues. Personally, forgiveness has helped me come a long way. That said, those people are still cut out of my life, but I have a great deal of acceptance and understanding, if nothing else. I don't feel hurt and angry and upset when I think about it anymore. Forgiveness for me it like the emotionally vscant feeling of \"it is what it is\", wouldn't it be nice to get to a place where your day isn't ruined every time you are reminded of the fucked up shit you went through? This is what they mean when they say that forgiveness isn't for them, it's for you. When you've reached that point where you even feel sad for them for being what they are, that they can't be better.\n\nForgiving someone and refusing to share space with them are not two incompatible actions, it's possible to do both.\n\nGood luck, OP",
            "Highschool was almost 10 years ago. Why do you think she's incapable of change?",
            "Idk seems like a good time to handle your mental health. Things change and your staying in the past. How can you ever move past the bullying if you don’t confront your bully? Time to grow, learn and forgive and let go. That to me shows real maturity. Running away shows nothing. ",
            "I'm with others in this thread to consider option #3: this girl has changed since a decade ago, and may actually be volunteering to ty to undo what she did in the past.\n\nShe has no way to get in touch with you (since you've blocked her everywhere) and she didn't seem to recognize you. What if she is deeply sorry for what she did, is doing this work as her form of amends, and has no idea how to get in touch with you to apologize?",
            "That’s horrible and I’m sorry you have to go through this. I wonder though if your bully has some kind of child abuse type past which motivated her to work for a mental health hotline, it isn’t really your typical job. Sometimes bullies lash out because of problems at home.",
            "Could you not confront her and hear what she has to say about your shared history?",
            "Speak to your manager about the situation. If this girl is still a bully to any degree, they shouldn't want her managing hotlines for mentally ill people. You would be doing them a service by informing them of what she has done to you. If you had to go so far as block her on every platform she's likely got behaviour that goes straight up the stalker list as well. ",
            "I don't think any option is wrong here, I think you literally can pick any of them!  I would volunteer with another organization and not give her another thought.  It would annoy me too much giving her a daily thought as I walk in the building.   I'd rather take my kindness elsewhere.  But no choice is a bad choice her so you can feel her out if you want. \n\nPS, it was not \"a long time ago.\"  You are completely justified in feeling weary, apprehensive, and doubtful of any changes she's made to herself.",
            "Put your big girl pants on and deal with life.   You can't avoid something because it makes you uncomfortable. ",
            "That's the sad thing about bully situations.\n\nThe person who was bullied, remembers the bully for the rest of his or her life.  The bully, on the other hand, probably barely registers all the people he or she bullied, and could have moved on without even remembering.\n\nEither that or like you said, she was not expecting to meet you, so even a person with the same name but different look, she could not expect it is the same person.\n\nBut I hope you will be able to work through this. \n\nIt is very possible she began this field of work to atone for her past mistakes in judgement.\n\n",
            "Has she started work yet? If I were you I wouldn’t do anything yet, just see how she reacts when she sees you. Act normal, do your thing, it sounds like your well established at the organisation. Give it some time to see how your both interact with each other knowing you have this past. If she volunteering for a mental health hotline, it must be something that is important to her so maybe she’s had some issues in her past. Hold your head up high, this bullying was back in high school, it sounds like your doing really well. Just see how it goes, if she hasn’t changed and starts to show some of her old behaviours, go to your boss with your concerns, but you never know she might be completely different. ",
            "I didn't develop theory of mind until I was 18, so high-school and mid-20's me were quite different from each other.",
            "People can change but I totally understand your worry. Since you used the phrase ‘relentlessly’ about the bullying, this has clearly impacted your life in a big way at some point. And maybe it has also contributed to why you are working for the mental health helpline because you want to help others going through that! It’s just a suggestion and it might be unlikely, but maybe she did see the error of her ways and maybe that’s why she is also working for the hotline now too. \n\nShe will eventually recognise you or see your name and     realise who you are, there’s no avoiding that and it’s up to her if she wants to apologise for her behaviour. I hope she does, regardless of whether you accept an apology it would be nice to hear at least. I’m sorry you were bullied, I absolutely despise bullies and hate to hear the impact it has on the victims of it. \n\nYou sound like a lovely person, and volunteering at the Hotline is a wonderful thing to do. I hope whatever happens next is positive, and at the very least you will be able to avoid her if that’s what you want to do. It’s nice that you have an understanding manager too! Will you update us and let us know how things go? \n\nGood luck OP :)",
            "Honestly, I would have told her who I was, and asked what made her decide to work there. If she apologized, I would accept, but be wary, and offer to talk about it and her deciding to pursue that line of work. If she is truly remorseful, I wouldn't hold it against her, as long as she did apologize and understood what all I went through because of her. After this was sorted out, I would just speak casually to her. You never know, maybe she's completely turned around and is a very kind hearted person now. ",
            "Sometimes people change a lot between high school and adulthood. Maybe she realized bullying was wrong. Has matured. You state that she politely introduced herself. Maybe her days of acting like an a##hole bully are over. \n\nI had an arch enemy i went to school with from 4th-9th grade. He tried to bully me and i fought back. I got kicked out of school once for trying to stab him with scissors. . . fast forward 25 years. He looked me up on FB, contacted me. He was going to be in town on business, would i like to meet up. I figured \"why not?\" So we met, had a blast, got along fabulously as adults. We tried to figure out WHY we hated each other so much as kids. Neither of us could figure out a particular reason. He lives on the west coast, i live on the east coast but we chat periodically. I'm actually very grateful he contacted me after 20something years and are now friends. ",
            "I was bullied heavily in elementary school.  By a large group of people none the less.  In highschool, I stopped taking any shit from people like that - full stop.\n\nDuring my 20's I would encounter those people from elementary school in the wild.  The *single best thing* I ever did was stay strong, and not let them impede or alter the course of my life because they happened to be around me.  \n\nYou know what happened?  Every single one of them apologized and asked for forgiveness.  The hardest thing I ever did was be the bigger person and give them that forgiveness.  \n\nMy advice to you is to let this person know exactly who you are, and remind them that they absolutely do know you.  You don't need to be friends with that person, but knowing you were on the receiving end of them being a shitty person (While they are trying to be a good person) - will likely cause a moral conflict with them that'll result in an attempt for them to clear the air with you.\n\nDon't back down.  Demand respect.  Be the bigger person.  It's possible this person is volunteering because they *know* they were a shitty person in the past.  People try to make amends for past behavior all the time.",
            "Can I say something as someone who was a bully. I was a horrible child/teen I was relentlessly cruel to several people. I've also completely changed. I would never expect forgiveness for what I did... I was a complete ass. However I would love to have the opportunity to explain to those people they were never the issue... I was very ugly on the inside and I'm truly sorry for what I put them through.",
            "You’ll be fine.... stop overreacting ",
            "Are you 100% sure it's her? People have the same name all over the place. I know you said you met with her, but are you still sure it is her?\n\nI hope you keep working there. If it really is her, she might figure out it is you in time and will apologize. ",
            "> I'm deeply passionate about the hotline's work, and I've devoted huge amounts of time and energy to answering calls, training new volunteers, and fundraising.\n\nIf that is the case, I would let the director know that due to your terrible experience with this person, you won't be able to work with the hotline anymore due to how badly she effected *your* mental health. What they do with that information is up to them. \n\nPeople really don't change that much unless they have reason to. If she was that systematically cruel to you in high school, she likely still acts in similar ways to those who have less power than she does. ",
            "Do you think that maybe, somehow, it might be possible, that somewhere between being a teenage girl going to high school who bullied people, and a 25 year old woman who volunteers at a mental health hotline, she might have grown as a person?",
            "You need therapy.\n\nI was bullied in High School quite a bit.\n\nHere is the thing. Chances are that as an adult she is not like that any more. I mean that she might be, but as a successful adult she can't get away with that sort of thing.\n\nThis bully still has power over you, because you are giving it to her. Therapy can help you get past that. You should not fear her after all this time. You should have no problems standing up to her. Clearly you do, which is natural, but it is time to stop accepting that in your life.\n\nWhat I ask of you is not trivial, but you can do it.\n\nIn the meantime, you have gotten plenty of decent advice on how to deal with the present, but view that as a temporary patch. You need to look at the long game and get past all of this.",
            "Would it be terrible to confront the situation and possibly get some closure? I mean you’ve been out of HS a while now maybe you two could even be friends. Clearly, you two have some common interests or you wouldn’t have ended up working/volunteering at the same place of business. ",
            "U can't let your past ruin your future can only move forward in life",
            "Just forgive her and move on. Only forgiveness will give a closure to your bullied past. I have been bullied and I don't have any hatred or discomfort being with my bullies. I just don't have grudges for then nor do I have any bad feelings. I forgive them and life my life happily. ",
            "Sorry if this is patronising, but are you completely sure that it's her and not just someone with the same name? Given that you've moved so far away, it does seem a staggering coincidence that she would end up in the same place and same job as you. \n\nI think that as you've said that you can't imagine your life without this organisation it's worth at least trying to find some way to make it work. I imagine that you must have a line manager of some sort. Can you speak to them and let them know the situation. Maybe they can find some way for this to work out for you? ",
            "I say clear the air and let her know how her treatment affected you.  This isn’t high school anymore and sometimes having a few hard knocks as an adult can make you much more self aware.  \n\nDon’t give up everything you’ve worked for the last several years before she’s even started.",
            "Remember, you are doing this because YOU want to. You don't owe this person any social interaction. Keep interactions brief and about work only.\n\nI'm really sorry you have to deal with this. I've had to deal with people who have bullied me years later. Luckily I've never had to work with them, just casual encounters where they know someone I know. I just refrain from talking to them and don't make eye contact. They don't seem to recognize me, or if they do, they don't care.\n\nIf you really feel you can't work with her, then  I would find another place you could volunteer at. It's really unfortunate this has happened. But I don't blame you OP, I wouldn't feel comfortable in this situation either.\n\n&#x200B;",
            "You ask what you can do. I think your best options are these:\n\nOPTION 1. Speak to this woman. Tell her you feel uncomfortable working with her because, although she may not realise it, she made your life hell in a way that still affects you to this day. But also say that you appreciate time has passed and you are willing to stay and give it a try if she can apologise for her past behaviour and be civil with you. \n\nThere is a very good chance that she has grown up and become a better person. But you won’t know that, and (more importantly) you’ll never get closure if you don’t speak to her.\n\nOPTION 2. Leave.\n\nOf course, the most sensible solution might be to try number 1, whilst keeping number 2 as your next-step option.\n\n",
            "There are many places would be glad to have you.",
            "This seems like one of those fateful situations where there might be opportunities for mending old wounds. \n\nWhen she finally remembers who you are, I think the puzzle pieces will fall into place and she will want to apologize. \n\nBullies are usually bullied at home and in a lot of mental pain. I wonder what her story is. Did she try to kill herself? Did she drive someone else to do that? Is that why she works at that job now? \n\nDo not let her bother you, you do not have to shuffle your life around for that woman anymore. I’m sure that no more bullying will ensue.  But there might be some opportunities for you to ask her why she did those things to you. Give you some very basic healing that you might need. even some closure. ",
            "Maybe she recognizes what she did is wrong and this is her way of dealing with it, by helping others after all that she did wrong. ",
            "I say give her a chance to see if shes changed. I am 31, and look back and didnt realize how much of a jerk I might have been to some people. \n\nAnd if shes still a bad person, well, its a professional setting now, and she has to be respectful or theyll ask her to leave",
            "Read your update. Pretty weak sauce reaction from managaent. Sounds like they didn't even ask for details about her history which is something they should want to know since they just hired her. Find a new place to volunteer.",
            "Personally I would quit volunteering there and if anyone asks you can just say that you don't want to work with someone who has a history of bullying you in the past.",
            "The practice of forgiveness can be good for your mental health. ",
            "So you work for a hotline to help ppl, where apparently the advice is to just ignore your problems? Sounds like you've probably helped many ppl. <--- that is heavy sarcasm btw",
            "she probably will never remember bullying you.\n\nin fact she was probably a bully to cover her own insecurity and doesn't even KNOW she was a bully.\n\nI would be mortified to know someone was still holding on to hurt feelings from High School-I was a very insecure sarcastic jerk!\n\n&#x200B;",
            "People are bullies usually because they themselves are being abused or are growing up in a highly oppressive household. If she is volunteering now it is most likely because she realizes what an ass she was and wants to volunteer to help others. I suggest you clear the air with her when she joins so you can put it behind you and see if she has cleaned up. If after a few weeks you see she has not, then you can bring it up to superiors.",
            "I would just tell the truth. “I remember you from high school and I am not interested in getting to know you as an adult because of how you acted as a child.”",
            "I would recommend talking to her to reconcile the past ",
            "[deleted]",
            "If I ever had to call a hotline I would want to talk to someone without a history of abusing others. I don't see how she could have changed. ",
            "Did you tell your boss why you're not comfortable working with her? Some bullies grow out of it, but never really learn that it was bad. She might still have some traits that will come or when dealing with subordinates. Telling your boss might make her look more carefully at the new girl and she might stop her from doing it again.\n\nShe also might not be the best person to work at this kind of job.",
            "I thought the title said fired and I was going to be really happy for you. ",
            "[deleted]",
            "[deleted]",
            "Talk to her and ask for an apology. It is entirely possible she was herself bullied by someone else and genuinely wants to be involved in the organization. Communication here is key, but feel free to walk away if you are uncomfortable. ",
            "You should confront her ",
            "You need to flip the script on her, make her life a living hell, get a lot of drama started about her, steal her boyfriend/ husband. Put some thought into it and really get into her head. Pay back is a sweet feeling!!",
            "Remember, YOU have nothing to feel bad about or to make excuses about. \n\nBecause of the context (people aware of mental health issues) I would address it directly. I would ask to sit down with her and your supervisor and explain to her who you are, what long term affects her behavior has had on your life, and how traumatic it would be to continue to see her around the office. \n\nThen decide if it's going to be a \"her or me\" situation. You are a volunteer and she is a full time employee, so the organization will probably go with her. But you can make it clear that you are not comfortable working with her, and even if she apologizes it won't make it easier to be there. \n\nBut you still have some stuff to figure out: \n\nHow she will react when she realizes who you are (she might be really nasty, which will make things clearer for you) \n\nYou don't know how you'll feel once everything is out on the table. It may turn out that you really can't handle being around her. Or it may be she falls apart and apologizes sincerely, and you feel better. \n\n\nIf you leave over this, that isn't her winning and you losing. Her boss will know that her behavior was so bad that they lost a good volunteer over it, and will probably have a close eye on her for any more red flags. "
        ]
    },
    {
        "post_id": "43y5hm",
        "author": "Scarredofgirl",
        "title": "[update] I (21m) was the guy who's girlfriend (21f) threatened to \"smash your face in\" with a shovel and then beat me up in a grocery store. Things are good...wanted to say thank you.",
        "url": "https://www.reddit.com/r/relationships/comments/43y5hm/update_i_21m_was_the_guy_whos_girlfriend_21f/",
        "score": 2100,
        "num_comments": 143,
        "created_utc": 1454472906.0,
        "selftext": "Sorry quick edit becauuse I feel bad for leaving something out...\n\nSo I had interactions with two police forces...\n\nThe campus police who were terrible and didn't want to even let me talk during the big altercation where the neighbors reported us. They were terrible...\n\nBut the city police have been awesome and supportive and listened to me and got the ball rolling on this. I just want people to realize that there were some great police in this, not just the bad ones I had my first interaction with. \n\nHere's the original (a little out of order due to edits): \n\nhttps://www.reddit.com/r/relationships/comments/42u3w5/my_girlfriend_me_21m_her_21f_together_15_yrs/\n\nSo I went to my appointment with the family law attorney who really helped me out a lot. She was able to get the security footage from the grocery store to the police who had enough evidence to book and arraign my ex on assault and battery charges. It's currently in the hands of a junior DA to see how they are going to proceed. I have a victims advocate working with me to keep me informed along the way. Also a restraining order is in place...she is not allowed to contact me in anyway or Come near me. The security footage is really bad--it shows her beating the crap out of me and me trying to get away. I don't even it remember the incident being as bad as it looked on the video. It totally shuts down her accusations of me abusing or hitting her. \n\nI haven't spoked to ex even once. I assume the judge spoke to her at the arraignment because apparently (im 100% no contact with her) took all the desparsging stuff about me off of her social media. I believe it's part of the restraining order that I'm not to be mentioned, tagged, etc... On social media. I don't believe she had a retraction of what she said Rather just deleted it. \n\nAttorney also helped me with breaking my lease with campus housing without losing any money so I'm living at my friends place which is cool but I now have to commute to school which kind of kills my schedule but I'm dealing.\n\nI can't add much detail on the campus counselor but just say it's being dealt with by the appropriate people.\n\nAnyways I just wanted to give an update because everyone is super cool and I don't think I would have had the guts to leave had I not made that original post. \n\n\n   \n**tl;dr**: Left an abusive relationship with my ex-GF thanks to r/relationships ",
        "permalink": "/r/relationships/comments/43y5hm/update_i_21m_was_the_guy_whos_girlfriend_21f/",
        "comments": [
            "Good for you for standing up for yourself, and doing all that you can to improve a horrific situation!\n\nThanks for the update, and continued good wishes to you.",
            "Once it was evident you got away from your ex-girlfriend, I was waiting to see if the counsellor is being dealt with. I am so glad to hear that it is.\n\nThere's a saying that there are two kinds of evil people - people who do evil things, and people who watch evil being done. Your ex-girlfriend did evil things in her assault of you, but your counsellor sat back and didn't give you the help you needed when you were *asking for help*. They are either woefully undertrained, or too wrapped up in their own biases. \n\nI'm so glad to hear that both people are being dealt with. I am so glad you're out.  ",
            "Nice job, dude. Glad the system is working the way that it should for you. Keep your chin up!",
            "Dude. We are a bunch of people eating junk food and yelling at our computer screens.\n\nYOU did it. It was all you. \n\nOK maybe a little us. I do have an ego. ",
            "I'm so glad it worked out and you got away from her. People so often don't take DV against men seriously, it's great you got what you needed.",
            "I was thinking about you-- I am SO SO SO glad things are going well for you and you got away from that awful woman. \n\nStay safe and keep on being awesome. Best of luck with everything <3",
            "I'm so relieved for you.\n\nHow are YOU doing in the aftermath? ",
            "I'm so glad that you're out of this situation but from your previous post\n\n> The counselor then basically parroted that my \"weakness\" might be a setting off point for my GF and that I needed to work to change that.\n\nThis just really boils my blood. \"Just stop doing whatever it is that sets off your girlfriend and if that's being yourself well...have you tried not doing that? Maybe she won't hurt you then. You being 'weak' makes her angry so...just don't and everything will be okay!\" from a fucking counselor?! I wanna say unfuckingbelievable but people say all kinds of heinous shit to DV victims/survivors so :/\n\nAnyway my point is that I think it's worth reporting to...I don't know who oversees that counselor but that person needs to know, at least to have a record in case they have any other kind of advice along these lines for others in need of actual help\n\nedit nvm it is being dealt with I guess. Yay!",
            "So proud of you for getting out and not just dealing with it or considering it an 'okay' thing since she's a girl. Nobody should ever be abused. \n\nKeep your grades up and put this behind you as much as you can, maybe rekindle a love with a hobby you had that she stifled, something to keep your mind busy between school assignments. It's what I would do, at least.",
            "She was pretty brazen to do all this in public, esp after already being caught by the police while abusing you in private. Very happy for you to have gotten yourself away from her and on to a safer and happier life!\n\nBy the way, if you are up to it (and if your attorney ok's it), you may consider speaking to the person who oversees the campus counselor you saw. It sounds like she really mishandled the meeting and further endangered you, even if that wasn't her intent. You could really help others by making sure this is addressed before she validates another abuser's behavior. \n\nBest of luck and many peaceful days ahead! ",
            "Great job! Remember to take care of yourself. The frequent advice of hitting the gym works great. There is something about excercise that makes you feel better. \n\nCongratulations on successfully deaing with this! ",
            "I'm really glad you had the strength and wits to get out of this awful situation, and that you found people to back you up. \n\nWhen the dust settles and the adrenaline dies down, I hope you can find an actually competent counselor to help you process what she put you through. It sounds like there were a lot of bad things happening to you for a while. \n\nI hope you have a much better time at college from this point forward and that at some point you meet a great woman who really loves and respects you. ",
            "I'm so glad everything's working out for you, OP. \n\nThat bloody idiot who told you your 'weakness' was setting her off is an active danger, jesus christ. ",
            "You're a strong person for being able to get out of a horrific, abusive relationship. Please don't ever forget that, even if you ever end up feeling ashamed for being a male victim of a female abuser.",
            "Woo hoo dude.  Congratulations.  ",
            ">apparently she (im 100% no contact with her) took all the desparsging stuff about me off of her social media. I believe it's part of the restraining order that I'm not to be mentioned, tagged, etc..\n\nOr it could be part of an attempt of hers to delete evidence that could be used against her. Not to worry, next time you meet someone from the legal system involved in your case, just let them know. If necessary they can get the posts back from Mr Zuckerberg.\n\nShe can't delete the video though, tough luck girl.",
            "[deleted]",
            "Hoping for a \"she's in prison\" update down the line, but regrettably I doubt she'll get more than a metaphorical slap on the wrist.",
            "My justice boner is raging right now. Good for you OP!",
            "Second positive update following a really sad post. Today might actually be a good day! :)\n\nGlad it's all working out for you dude!",
            "good job, OP",
            "[removed]",
            "Justice! I was so angry when she threatened with the \"paper thin\" walls and then the cops gave you shit. Fuck her and keep your head up buddy!",
            "Glad you took the advice of the councillor and \"manned up\" by pressing charges on that abusive ex of yours and reporting that sexist councillor. :)",
            "I'm so sorry that you're going through this, but it seems as though you're handling it well. I've been thinking about you since your original post and I'm glad that you're safe and that the law is dealing with her now. I wish you all the best.",
            "Knowing someone got out of a bad situation and got the help they needed to move on is why I read this sub. You go, you got this. Best of luck with everything ",
            "I'm glad you got out that horrible environment. That kind of violence isn't normally believed because why would any man let a woman hit him, right ? Men are taught from an early age to never touch  woman in a negative manner, so they don't fight back for fear of being accused of abuse by a psycho bitch. You went through all the right channels to prove your innocence against that bag of insanity. Keep doing what you've been doing and hopefully you'll find a woman who isn't triple dipped in crazy.",
            "I'm so sorry you have to went through all of that but you should be proud of yourself for pursuing the support you needed. Take care of yourself.",
            "geeze, she really went off the deep end. i'm so happy that she won't be getting away with assaulting you. stay strong!",
            "Great update! Glad you're getting the counsellor the \"attention\" they clearly deserve too.",
            "Favorite update this week. Great job OP. ",
            "In my experience, with two restraining orders (no contact) and the words of two judges, ANY mention of your name on social media is considered contact and is a violation of the order.\nCriminally, they won't do jack shit for that as a violation, but civilly the judge may care, so if she does that you can file for a violation of the order.  Your best bet if you choose to file for the violation would be in civil court instead of criminal court.",
            "Your post was heartbreaking.  It's nice to see it getting about as good of an update as it can. ",
            "Did you report the counselor who's advice for a DV victim was to \"toughen up\"?\n\nEdit: saw your comment that you did. Good job and good luck.",
            "Give us an update when you find out what happened to that shit bag counselor",
            "I'm so glad things turned out well for you.  I'm doubly glad that counselor is getting \"dealt with.\" ",
            "Really glad you got out of this.  I was abused by my ex-wife.  When we got married (in 1997) there was very low awareness of female-on-male violence and the \"toughen up\" mentality was virtually universal.  It feels like things have come a long way and for that I'm glad.",
            "Yay, you and yay, City Police!  It's really good that the City Police now know that the Campus Police are worthless (that's really too bad, if you ever have the energy, you should send an email to someone higher up in your college - like the President and one of the Vice Presidents, about this experience - you can even wait until you graduate or do it anonymously). \n\nI'm so glad you had such a constructive experience with the restraining order, etc.  And I don't particularly care that much what happens to your exGF, I do think that if anything is going to make her think about who she is and how she needs to change, you taking this to the courts may be that trigger.  You did all you could to keep yourself safe - but also future people she will interact with may be safer too.\n\n",
            "Christ!!!! I'm so glad that you're out of there, man.\n\nI hate that domestic violence against men isn't taken seriously. Nobody should feel unsafe in their relationships, gay or straight, male or female. I'm so glad you've managed to get some legal intervention, too, because I had this distinct feeling that she wouldn't have left you alone otherwise. Nutter.",
            "You absolutely should stay a million miles away from her and never look back.\n\nHaving said that. Given her age and the blissful year they did have. Is anybody else entertaining the thought that it's possible she's schizophrenic?\n\nThat consideration led me to wonder: OP, have your parents told you why they never liked her?",
            "i'm so glad to hear that you got out of that horrible situation!",
            "Good on you dude!!",
            "> I haven't spoked to ex even once.\n\n👍",
            "This is one of the best updates I've ever seen. I hope it all goes well for you. ",
            "I hate that counselor so much.",
            "You left an abusive relationship because of YOU - you don't deserve to be treated that way. This is such good news. ",
            "Anyone, regardless of their gender, can be abusive. Any report of assault should be taken seriously. I'm glad this worked out, but it looks like there were signs right from the beginning. Never resign yourself to a abusive situation. I hope you grow from this! ",
            "Oh my gosh. I'm so glad you got out of there, are safe away from her, and the police are able to do something. Domestic violence is no joke. \n\nI had a friend who's girlfriend beat him up (even though he was bigger & stronger than her), and it was so terrible. \n\nSo glad you have the support of your family, video evidence, and the police are taking action. Hugs!",
            "I'm so glad you're safe and away from her now. :)",
            "I know I'm just an Internet stranger, but as a fellow survivor of domestic assault, I'm proud of you. ",
            "I'm glad this is getting sorted, and so happy there is video evidence. I hope she gets all that she deserves. And while not every person or group involved has been supportive, I am glad a few have (city police, judge, your friends and parents, etc). \n\nRegarding this: \n > but I now have to commute to school which kind of kills my schedule but I'm dealing\n\nJust to give you a \"glass half full\" perspective, I commuted pretty far my last 2 years of college, and believe it or not, it actually helped me with my grades. I no longer could justify going back to my apartment in the middle of the day for naps, TV, etc., so I actually ended up spending a lot more time on campus studying in the library and computer labs, and my grades subsequently improved a lot. I also spent a lot more time with classmates and made friends I probably wouldn't have otherwise. While quite a bit of time was lost in traffic, I was much better at managing my time, and when I was home, I could relax a lot more since all of my work had already been taken care of on campus. Hopefully you can turn some of this bad situation into something better. Good luck and best wishes to you in the future!  ",
            "Did you file a complaint about the counselor? I worry about other abuse victims being not taken seriously. Edit: nvm you said it's being handled. Whoops didn't see that!\n\nI'm so sorry you're going through this. :/ Abuse is despicable and you never, ever deserve it. This was not a matter of \"two sides to every story\" this was abuse. Period. \n\nI'm glad you were able to get help from the police. \n\nYou should sue your asshole ex for libel. Did you get screenshots?",
            "Congrats on being so brave. Many men would have wrongly tried to stick it out thinking that was what was expected of them. I'm so glad to hear you stood up for yourself and got out of that situation.",
            "If there's some action that could be taken against campus police that'd be great as well. I mean if your girlfriend abused you, she was overheard abusing you, and they blamed you for that? That's messed.",
            "Proud of you, but what about that counselor. It's so beyond unacceptable that a school official would react like that.",
            "It's really good to hear that you're out of that situation. You should consider some more intensive counseling than the campus counselor; you're bound to have PTSD from being in a relationship like that.",
            "A subpoena for the grocery video, a police investigation, arrest, arraignment, and a restraining order, all inside of a week?",
            "Very glad to hear you got out of this situation and it's being taken seriously.  ",
            "Great job. Well done. 👏Glad you're out of that relationship.",
            "(((hugs)))\n\nStay strong!  It never feels as bad as it really is.  because your feelings get in the way.\n\nCheck out a different  counseling service.  A counselor can help you learn the lesson you need to learn from this relationship.  And there is more than one.  A counselor can help you identify the red flags that show up on the first few dates to so you can exit fast next time.\n\nI'm proud of you!! ",
            "So glad things are rolling in the right direction and that you're safely out of that situation. ",
            "I'm so happy it worked out on your favor! Good luck OP!",
            "I am glad that you had the courage to get out and that you have people both in your personal life and in the system who are supporting you.\n\nJust as a note (I'm a fellow abuse survivor), couple's counselors/anyone like that are NOTORIOUSLY bad for couples in which one is the abuser. Abusers are awesome manipulators and usually get the counselor on their side from the get go. It really sucks that you had to see that in action.\n\nYou are awesome for standing up for yourself! I hope you know that.",
            "Hugs!! Hope everything works out 😄",
            "What happened to you was awful. I am sorry. I also want to ask you to get into therapy and reevaluate who you date, you might be picking girls who show abusive tendencies or so on. And please take a break from dating for a while.\n\nHugs. \n\nBe better",
            "How are you today?\n\nJust checking in... seeing how you are feeling.. \n\nI hope that things are looking up and that the changes you have had to make are not making daily life too difficult.",
            "Pisses me off when women abuse the laws meant to protect them.",
            "[removed]"
        ]
    }
]