[
    {
        "post_id": "3welh5",
        "author": "Myboyfriendagain",
        "title": "My(22f) fiance(26m)'s best friend (26f) is kind of his ex.",
        "url": "https://www.reddit.com/r/relationships/comments/3welh5/my22f_fiance26ms_best_friend_26f_is_kind_of_his_ex/",
        "score": 2096,
        "num_comments": 163,
        "created_utc": 1449857010.0,
        "selftext": "[Original](https://www.reddit.com/r/relationships/comments/3w4kwu/my22f_fiance26ms_best_friend26f_is_actually_kind/)\n\nSo i'm single. I didn't even bother with the utltimatum. After making the post and seeing the answers i realized just how blind i had been. I just used all the anger that got out to finally be brave enough to leave.\n\nWhen he got home from work i sat him down and told him i was breaking up with him. I gave him back the ring. I had already started packing my things since i knew he would make everything difficult as to who would keep the apartment. He just stared at me when i was speaking and when i was finished he got *angry* because in his words i was trying to control him by threatening to leave. I made sure he knew it was not a threat and that i was leaving regardless of what he would do or say. I tried to cut the conversation there but he just kept arguing with me. He accused me of letting my jealousy destroy our relationship. Told me i was behaving like a child. I told him he should be glad he won't have to deal with the child again. \n\nHe just kept following me around when i was getting my things to leave for the night. He went from accusing me to begging me to stay. He even said he would cut Jessica, apologized but i don't trust him anymore. I won't fall for his damage control again.\n\nAnd so i'm living with my friend now. I'll contact him for the apartment later and i guess that's all.\n\n\n\n   \n**tl;dr**: Broke up with fiance. I feel angry and numb and sorry for myself for dealing with this all those years. I'll leave him in 2015 and move on.",
        "permalink": "/r/relationships/comments/3welh5/my22f_fiance26ms_best_friend_26f_is_kind_of_his_ex/",
        "comments": [
            "Good for you. It is nice to see someone realize the situation they are in and act on it.",
            "Dude was a piece of shit for lying the entire time. \"Trying to control him\" clearly means \"I don't like it that you're standing up for yourself and not being a pushover like I'm used to\"....ass. Good for you OP.",
            "Wow. You're such a confident, decisive person! You've saved yourself years of unhappiness. ",
            "It's inspiring how well you handled that. He pulled every trick out of his bag and you just went on packing.\n\nStarting the new year off on the right foot. :)",
            "I await the update with Jessica doing stupid shit. Good job OP!",
            "Go you!  I know how hard it must have been, and that you're hurting in spite of all the nonsense.  But you spared yourself a very unhappy marriage, and you did it by keeping yourself cool and collected and not letting his manipulative tactics faze you for a minute.  Here's to a *way* better 2016 - and all the other years to come - without him and Jessica.",
            "Nailed it.",
            "Good for you OP. Glad to see that you needed to do something and did it. Great job.",
            "Bullet dodged. A good partner is someone that is proactive when their SO has a valid concern, not someone that is reactive and only decides to fix things after they've seen that you're serious. It's great to see that you didn't get suckered in by his last ditch effort to 'fix' things.",
            "Congratulations on being so strong and confident - it's something to be proud of.\n\nIt will still be difficult to manage your feelings about the breakup even though you're clearly in the driver's seat.  I would expect to hear from him and/or Jessica, and I'm sure you'll be ready to deal with it with the same measured, sensible reasoning you've demonstrated here.  Think about blocking him from your phone, facebook, what'sapp, etc. \n\nThe type of dishonesty that allows someone to cheat and manipulate those who they think they love also allows them to be extremely dishonest with themselves.  Rest assured that he'll be telling himself in the days and weeks to come that you were jealous, insecure, possessive, and all the rest.  And if you start worrying about what he's thinking: fuck that.  You have given him enough of your time and energy and he doesn't deserve any more after how he has treated you.  No rational person will hear your story and believe you made the wrong move or that you treated him unfairly. \n\nVery cool that you did this at the end of the year so that you can see 2016 as a Renaissance for you.  Nice work.  ",
            "This is the best, he needs to learn to be honest and to prioritize his SO and set clear boundaries with Jessica.",
            "Hey OP, it's your favourite redditor again. \n\nWay to go on the decision. I think it is pretty clear that this was the correct decision given the serious breech of trust and the lack of a suitable answer / follow through with you on your ex's part. \n\nObviously, I am also going to provide a bit of my opinion for you whether you choose to take my advice or not. \n\nMy advice for you is simple; do things that make you happy. Conversely, avoid things that make you unhappy. I know this seems straight forward, and maybe even condescending given the simplicity but many people do not understand that in relationships (and outside too) you SHOULD NEVER be afraid to say NO and you should never be afraid to walk away. \n\nNow, knowing when to walk away is difficult as relationships seep into all parts of your life. The important thing going forward is KNOWING what you want and KNOWING what you do not want. \n\nWrite out a list of goals or desires or things you want to accomplish. Remember these goals. Re-read them. Study them. Dream them. Let them be part of WHO YOU ARE. \n\nThen, when a situation arises that takes you away from these goals, you will know to say NO and you will have the confidence to say NO as you have internalized your dreams and desires and understand that they do not align. \n\nIf your goal is to have a trusting, loving, fulfilling romantic relationship, and you have internalized this, moving on will be easier and I believe understanding how to maneuver in the dating world will become more clear. \n\nUnderstand your goals. Write them out. Internalize them. Understand the obstacles to those goals. Prepare yourself for them. \n\nLife isn't linear. Things don't go \"A, B, C, D...\" Life is unfair. Life punishes the weak and rewards those who put the effort into having a great life. \n\nIt is not easy. People will tell you that you are wrong ALL THE TIME. That's because the majority of people are not destined to be great. The majority of people are destined to be average. And they will be scared or skeptical of your focus on your goal as most people cannot internalize goals and dreams as the outside world is distracting. \n\nYou got this OP. ",
            "Yes!  You're a fucking rock star.",
            "Good for you! Apologies and promises mean nothing from someone who has lied to you and put you second for so long. You've proven to yourself that you deserve better.",
            ">He went from accusing me to begging me to stay. He even said he would cut Jessica, apologized but i don't trust him anymore. **I won't fall for his damage control again.**\n\nNice!",
            "> I told him he should be glad he won't  have to deal with the child again.\n\nPerfect shutdown OP. Best of luck.",
            "I'm really glad to see this. Even if he promised to chamge, there is still all the damage he did to you for years that can't be taken back. Sometimes it's too late and he shouldn't have done it anyway and he knew it.",
            "Ugh. Right choice, I think. But sad and exhausting, none the less. I hope you have a nice, relaxing weekend. \n\nAnd, honestly, you handled this like a boss. No conversation, really, you knew what was good for you. No debate. No bargaining. Just done based on past behavior, as opposed to listening to his lip service about the future. ",
            "You rock! You are so awesome for staying calm in the face of his anger and staying strong when he resorted to manipulation tactics and insulting you. \n\nLove yourself and pamper yourself. Have a great holiday season! ",
            "Ugh, good for you OP. That must have been hard as hell, but you had the high ground, and everything you laid out here was the RIGHT thing to do.\n\nThe best case scenario with your ex is that he's devastated by this, and learns not to hide SERIOUS SHIT from people he's close to again. In which case, you've done the world a favor, starting with yourself. Good luck!",
            "Honey, I'm so sorry. We're here for you, though. And you really did the right thing. It was a good, bold move on your part, and that's the best thing in the world. Congrats! ",
            "And now you'll never have to deal with the child again.",
            "Good for you! I'm sure you will find someone who YOU will be their soulmate. Best of luck :)",
            "> Told me i was behaving like a child. I told him he should be glad he won't have to deal with the child again.\n\nAwesome comeback. You go girl.",
            "Way to go!\n\nWanted to say, you probably don't even need to talk to him about the apartment.  Just call the leasing office and ask them to take you off the lease.  You might have to sign a form or something.",
            "Bravo, OP! You made the right choice. Feel proud of yourself, leaving can be hard to do! :)",
            "I am so proud of you! This was a really brave move and you can start 2016 fresh. ",
            "He knew he was wrong and tried turning it around on you to deflect from the fact he screwed up and in case you were bluffing. As soon as he realized you weren't, he started apologizing and crap. Good for you to be self confident enough to still walk away. Good luck",
            "> I told him he should be glad not to have to deal with the child again\n\nBoom! You handled him and this situation so well!",
            "I'm sorry he had you living his lie, but good for you for being confident in yourself. Let him go to his equally deceitful \"soulmate\" and you find someone who thinks you hung the moon.\n",
            "I'm really REALLY proud of you. I know it must have been hard, but you made a decision that absolutely serves your own best interest. You deserve someone who actually wants you for you, not for an \"in-between\" break from sex with his fuck buddy.\n\nKudos OP. Stay strong.",
            "*Slow clap*............clap.............clap.........clap....clap...clap..clap clap clap clap clap",
            "I'm so relieved for you, usually people are slow to realize the truth of it all. Good for you! ",
            "Wow, good for you. As time goes on, you'll be more and more glad that you made this decision.",
            "Good, please stay strong and don't go back!",
            "Proud of you ,OP! ",
            "Bravo!  So proud of you, OP.  ",
            "Yay! Awesome",
            "Bravo to sticking to your guns and being so confident about the break up. Your fiance was a day late, and a dollar short in fixing things. Wishing you happiness in your future.",
            "I am inspired by this. ",
            "This was the only way.  Sounds like he's in love with her and she loves that he is, but he isn't good enough for her or something.  She loves the attention and gifts and uses him as a crutch when she needs validation or is single again and can't bear to be alone.  He was always settling with you since she won't have him.",
            "WOOOO! Good for you, OP. Definitely a step in the right direction :)",
            "Good for you. You deserve so much better. I'm sorry you're going through this.",
            "YES!  I know it feels absolutely, disgustingly, gut-wrenchingly horrible right now, but you did the right thing and you will feel better.  I left my fiance 2 months before our wedding (he got abusive) and it was terrible terrible.  But 2.5 years down the road I have never once regretted my decision or looked back.  Stand tall, you have principals, morals and a spine!  You will come out on top!",
            "Going through something like this sucks at the time, but it is actually a great thing, because in the long run, you will end up in a *much* better relationship with a *much* better partner. \n\n You have learned a lot about relationships, what you should have in a partner, and even about yourself. The future's looking bright!  Congratulations!",
            "I'm sorry. This was probably really hard to deal with. I think it's hard enough when your SO shares a connection like that with someone else without there having been a sexual history.",
            "Nice job! I don't see why those two just date since they are clearly in love. People are fricken weird. ",
            "You're very brave, OP. Don't ever doubt that you made the wrong decision. Someone out there is reading this post and finding the strength to do the same for themselves. \n\nI wish you the best, good luck!",
            "YOU GO GIRL!  I seriously want to high five you through this computer screen.  I don't know you, but I'm SO proud you stood up for yourself.\n\nYou deserve the best.  You deserve to be first.  NO ONE PUTS BABY IN A CORNER!",
            "It's so unfortunate when I see people (mostly guys) fuck up relationships like this. Typically the woman gives so many chances to rectify and fix whatever issue but they just downplay it, ignore it until the woman runs out of chances and gets to a \"point of no return\" zone. Then they are like \"wtf have I done\".\n\nThat was totally me last year. In hindsight, I wasnt really into my girlfriend at the time and it was just the fact that she broke up with me suddenly that my instant reaction was damage control. After getting over the initial hell, I realised it was good for both of us.\n\nYou (and my ex) deserve someone who will listen and treat shit like this seriously.\n\n",
            "OP kicks ass. Way to go! ",
            "You are awesome and i love you",
            "Good for you! ",
            "I'm so glad to read this post! You've made the right decision. New journey in 2016. ",
            "Thank you for doing that! You are showing every young person on this thread that this is inappropriate behavior for a partner. Go you for asking for advice, and then actually following it. Best of luck in your future, your young & obviously smart, you'll do great:)",
            "I read this post thinking \"oh no, irrational jealous decision up ahead,\" but boy was I wrong. After reading the original post, your (ex)fiancé had it coming. Sounds like you've saved yourself from what would have been a really unhappy marriage.",
            "Good for you girl. I'm proud of you! And you're so young, you'll find someone way, wayyyyyy better. You dodged a bullet, really. I know you must be missing him and there is a part of you that still loves him, and you'll have times in the future when you question / others make you start questioning if you've made the right choice today, but trust me, it was the right choice. Imagine the lifetime of resentment and distrust and jealousy you'd have signed up for if you stuck to the engagement!",
            "Couple weeks to the new year. Moving on moving free! ",
            "Stay strong OP.",
            "we have the similar situation, my boyfriend keeps being friends with those girls he had sex with before, his exes, friends with benefits....and so on. He talks a lot to them, but never meet them(since we're together, 1 year). I really don't like his relations with those girls, He is close to his two exes, they even use the same nickname as they used before. Anyway, I feel bad about it, but he always thinks it's nothing ,just friends, I don't know if I'm overreacted or not, what do you think?\n\n",
            "You're a strong, brave woman and I'm glad you're not settling for this asshat's manipulative tactics to make you stay in a shitty relationship where you're second to his \"bestie\" and \"soul mate.\" Your no-bullshit stance will no doubt find you a much better and more loving partner someday!",
            "Thank you.  You may be the inspiration  I needed in my own muddled world.\n\nGood luck in 2016 and beyond.",
            "[deleted]",
            "Congrats!",
            "I commend you OP. As someone as emotional as myself, I don't know if I'd ever be able to have that much courage. ",
            "Thank goodness you didn't marry him! ",
            "You got this op. So proud of you and I wish I had been that strong when I was that young. Chin up and best of luck to ya girl, I think you're only gonna be happier from here in out !\n",
            "Sounds like you made the right choice. You shouldn't have to feel like second best in your relationship.",
            "I hope this was the right decision for you.",
            "Woot woot! You go!",
            "No I don't actually think he would cheat on me with them. To be honest, sometimes I feel sorry for those girls because he wasn't serious with them when those girls were. But I just can't understand why they talk a lot, I mean it's just meaningless. There is another thing bothers me a lot, he wanted to fly to a new city to hang out with his ex, he went there before, and he knew I wasn't happy about his relation with her, and I think she still likes him, don't u think it's too much to do that? They were sleeping in the same bed when he met her last time (they were both single ), I just think normal girl wouldn't do that, am I wrong?\n\nAlso I feel bad about that because I think he doesn't care how I feel, he knew that I don't like her, but he still wanted to go there. \nWhat do you think ?\n\n",
            "Good for you. It is nice to see someone realize the situation they are in and act on it. \n\nPlus, you sound way too smart to be dealing with that nonsense, and so it seems, you are! :)",
            "^5",
            "So who gets the apartment?",
            "You are a badass OP!!!",
            "Good for you! You are my hero!!!",
            "bye, felicia. gg",
            "Yaaas!! You go girl! Women empowerment at it's finest!",
            "Wow. \n\nThis sub is really a toxic place. Everyone's initial response to every issue is 'you're so young just break up and find someone else'. While most the time this may be adequate advice to give this never considers the nuances between two unique individuals and the love they feel between each other. I definitely do not condone staying in an unhappy relationship, but it sounds as though in this particular case this was only one issue. \n\nOP don't be a fool. You agreed to marry this guy, don't walk away if this is your only problem. Don't be a push over, assert yourself but give him the oppurtunity to fix the qualms you have.\n\nTruly great couples overcome problems. I honestly think the only situation you will be in where you do not have any issues in your relationship is when you either do not care about the other person a great deal or you are not invested enough to be yourself. Every human being is unique and these charactersitcs inevitably lead to disagreements.\n\nGood luck OP, either way, I hope it works out the best for you both. ",
            "[deleted]",
            "[deleted]",
            "Still though. Shout out to guy and girl best friends out there that have to always deal with jealous SO's. I don't know if I would call this guy a pos for for sticking up for a friend. Not OP just some people are a little harsh on this seemingly pretty nice guy. ",
            "Hey OP, I'm single :)",
            "As a guy who's still very good friends with an \"ex\", (we've been friends for close to 8 years). My two best friends are girls I met in college. If any girl told me I needed to lose any of them I would say no. If I was accused of cheating I would have reacted the same way. This was better for everyone involved. "
        ]
    },
    {
        "post_id": "3mumn5",
        "author": "girlfriendhomeless",
        "title": "Update: I [24m] found my ex-girlfriend [23f] living homeless. I'm not sure what to do, I feel a flurry of emotions.",
        "url": "https://www.reddit.com/r/relationships/comments/3mumn5/update_i_24m_found_my_exgirlfriend_23f_living/",
        "score": 2101,
        "num_comments": 113,
        "created_utc": 1443544189.0,
        "selftext": "Old post: https://www.reddit.com/r/relationships/comments/3mlemw/i_24m_found_my_exgirlfriend_23f_living_homeless/\n\nSo I went online and found out a bunch of info on local homeless shelters and charities, printed it out.  I also bought some food, stuff that does not require refrigeration, to give to her and some of the other homeless people that were there.\n\nI went to the same place she was last time, around the same time, but she wasn't there. I waited for a while, she didn't show up.\n\nThere were some other homeless guys there, I asked them if there had been anyone else around that had left recently, they said no.  Since I was gonna give all that food away anyway, I gave it to the homeless guys that were there as well as the printed out sheets of info for local charities and shelters.  They thanked me and I went off on my way.  \n\nI'm guessing she's either moved to a different area or is in a homeless shelter. Either way I have no way I can contact her.  Not much I can do.  At least I ended up helping someone a bit., a person is a person, even if I have no idea who they are.\n   \n**tl;dr**: Bought a bunch of food to give to her, as well as printing off online information about local shelters.  I couldn't find her around that area however, so I gave all the food and stuff to some other homeless guys that were there.",
        "permalink": "/r/relationships/comments/3mumn5/update_i_24m_found_my_exgirlfriend_23f_living/",
        "comments": [
            "At least you were able to help someone. ",
            "What resources did you use for your homeless information sheet? \n\nI helped build a few printable info pages for homeless people, abused women and children's shelters. \n\nMy info was mainly for where I've lived throughout the sf bay area from Marin to Sonoma, the East Bay, And the city. \n\nI've been homeless and hopeless a couple times and it sucks. I used to volunteer more, with homeless, at cancer wards etc... Now I have a baby and a degree and need a job.\n\nIf you're in the bay area I can send you the printable files, they're one page each.",
            "I was shocked reading your last post. I hope that girl gets back on her feet quickly. I wouldn't be able to sleep for days knowing she was still out there. Hopefully you see her again and can do something to help and not lie again. ",
            "Damn this is pretty depressing to read. I don't know how close you and your ex were but if I saw one of my (few) exes I could never have walked away like that. Especially since you made it sound like the main reason you broke up is because you were lazy and entitled.\n\nYour parents are buying you apartments and you can't give a ride or at least some money to your ex... Jesus.\n\nNot trying to preach as I know it would be a very difficult situation for anyone to handle. Hindsight is 20/20 of course.",
            "[removed]",
            "I wouldn't be surprised if you made this up just so you didn't seem like such a heartless loser. I would at least take in my ex for a week if I found them on the streets. I mean you were together for 2 YEARS. It's not like she was a stranger. And you don't even pay for your own apartment so it's not like it would inconvenience you that much financially. Bring on the downvotes, hope this girl found a shelter and is doing okay.",
            "If it was me I'd let her sleep on my couch for a week or so to clean up and try to find a job. There's no way I could just leave someone I was once close to on the street. No freakin way. Now if she didn't at least TRY to do something for her self then she's on her own.",
            "She likely found a shelter. They give priority to young females if they actually want help and rarely will turn them down. Unfortunately they have to be more selective with males. Yes I know it is not fair or right but it is how they operate. ",
            "Good for you for trying to find a way to help and following through. It's hard to know what to do in situations like that. ",
            "You're a dick op, no matter how bitter the break up was I would never be able to turn down a call for help from someone I once cared about, especially when at most it's a minor inconvenience (awkward conversation with dates)\nHer criticisms and the break up was probably what pushed you to get off your lazy ass to stop playing video games and get your life back together, in a way she helped you and now she's in a much worst situation and you can't be bothered to help because it'll be hard to get dates. ",
            "Guess you should have helped her out when you had the chance :/",
            "[deleted]",
            "[deleted]",
            "find her you monster.",
            "Try to contact her on social media. She might still have a cell phone or connection to the internet, I know plenty of homeless people today do. Just do the right thing and put a roof over her head, even if it's for a night, just to give her a little dignity. \n\nedit:\n\nHow DARE I try and help another human being, right? OP didn't put her in that situation, but damn, I wouldn't even want my worst enemy living on the streets. Do any of you have any idea how degrading that is? What's wrong with you people?",
            "Fuck you op. \n\nEven if one of my ex's cheated on me with ten different guys, got pregnant, did drugs and had a drinking problem, I would still take her back to my place to clean her up and get her back on her feet if I found her homeless on the streets and she brought herself to ask me for help. Call me naive or whatever but if I shared a past that I treasured with her, I would still take her in for old time's sake. Nobody's asking you to sleep with her or get back with her but if this person is someone you once loved profusely, you'd do something about it instead of coming to reddit and asking for help after you fed her a petty lie to keep her away. Others might be willing to give you the compassion, pity and justification you probably came here looking for but not me.\n\nDo you know what kind of state she must have been to bring herself to ask you, her ex, for help? After being discovered in such a shameful situation? On top of that, she was hanging onto her joyful self despite everything against her and to reconnect with you. It's no wonder you two broke up in the first place.\n\nBut don't you worry though; with her kind of attitude, she'll get far eventually but for you, who the fuck knows.",
            "Good for you, man.",
            "Or maybe she's dead or grabbed off the street or trafficked? Who'd look for some nameless homeless person, after all?\n\nWay to go OP.",
            "I'd have to go shelter to shelter and homeless hangout to hangout looking for her just to see if she was ok and get more of the story. Not saying you should but there is more to do. ",
            "[removed]"
        ]
    },
    {
        "post_id": "35u79a",
        "author": "None",
        "title": "[UPDATE] Me [29 F] and my landlords' [late 30s M & F] child [9 F]. Child screams to purposely wake up the tenants. What do?",
        "url": "https://www.reddit.com/r/relationships/comments/35u79a/update_me_29_f_and_my_landlords_late_30s_m_f/",
        "score": 2100,
        "num_comments": 118,
        "created_utc": 1431530782.0,
        "selftext": "This is an update to [my original post](http://www.reddit.com/r/relationships/comments/2zsyq4/me_29_f_and_my_landlords_late_30s_m_f_child_9_f/) about my landlord's kid screaming at the top of her lungs at 6am and waking up the entire building.\n\nI borrowed the advice of making the conversation not about myself or them, and instead discussing the possibility of soundproofing. I also decided to do it right around 6am when it was starting so I could sort of catch it in the act.\n\nI went down to my landlord's floor and simply said, \"Hey guys, just FYI, I can hear that in my apartment as though it's happening right outside my door. I guess the walls are thin and the door is right here by the stairs. You may want to consider some kind of soundproofing for the benefit of future tenants.\" (My lease runs out in a month and I'm not renewing, so didn't bother to ask for it for myself.)\n\nI was surprised when my landlords said they had no idea I could hear it. Apparently the other building residents (both of whom have lived in my unit) didn't hear it or did but didn't say anything about it. My landlords were also very apologetic and said they were really sorry.\n\nThe next thing that happened was awesome. The 9 year old was in the room, sitting facing away and now totally silent. The mother said, \"See? Your behavior has consequences and you've disturbed our neighbors. I think you need to turn around and apologize to porkburp for waking her up.\" She did not turn around (I wasn't really expecting it - she's shy around the tenants) and her body language really seemed to communicate that she was embarrassed/ashamed.\n\nWhen I came home from work, I had a handwritten letter from the girl where she apologized for disturbing everyone and will try harder next time not to behave like that. (I believe every tenant got one of these.) I kind of wish her parents had made her apologize to me on the spot, but I'm okay with the letter.\n\nThis happened a couple weeks ago and so far there's been no further 6am tantrums - at least that I can hear, anyway. So I think confronting the family was a success.\n\nThanks to Reddit for your advice in the original thread. I also really enjoyed some of the shitposts people feel compelled to leave - they make me laugh.\n   \n**TL;DR: Confronted my landlord's family mid-tantrum and kindly asked for soundproofing. They made the child apologize and we haven't had any problems since. Thanks Reddit!**\n\n**Edit** Got a few more things to say in response to these great comments:\n\n* Thanks for the Reddit Gold, stranger!\n* Some people have pointed out that a 9 year old apologizing through a letter as opposed to on the spot isn't so bad considering she's 9; in fact it might be an even bigger punishment because she would have to sit and really think about each letter. That's something I didn't consider and when it's framed that way, I agree that that's sufficient.\n* Some people also think my OP was about asking *whether or not* to discuss the issue with my landlord, but it was actually about *how to bring it up in the most non-offensive way possible*. As some people here have mentioned, some parents can be really sensitive to anything that seems like criticism. I wanted to minimize the possibility of them turning around and trying to make this about me vs. them, since that's not what it was at all.",
        "permalink": "/r/relationships/comments/35u79a/update_me_29_f_and_my_landlords_late_30s_m_f/",
        "comments": [
            ">The next thing that happened was awesome. The 9 year old was in the room, sitting facing away and now totally silent. The mother said, \"See? Your behavior has consequences and you've disturbed our neighbors. I think you need to turn around and apologize to porkburp for waking her up.\" She did not turn around (I wasn't really expecting it - she's shy around the tenants) and her body language really seemed to communicate that she was embarrassed/ashamed. When I came home from work, I had a handwritten letter from the girl where she apologized for disturbing everyone and will try harder next time not to behave like that. (I believe every tenant got one of these.) I kind of wish her parents had made her apologize to me on the spot, but I'm okay with the letter.\n\nI didn't read the original, so I may be wrong, but that seems like solid parenting. ",
            ">  I kind of wish her parents had made her apologize to me on the spot, but I'm okay with the letter.\n\nWhen you're a parent, you pick your battles. I think they did a good job.",
            "> I think you need to turn around and apologize to **porkburp** for waking her up.\n\nThat was my favorite part.  lol... \n\nGlad it worked out, and future tenants would sure be grateful if they knew.",
            "[removed]",
            "A landlord actually cared?  Dang.  I think your landlords belong in some sort of Reddit Hall of Fame.",
            "APOLOGIZE TO PORKBURP",
            "Time for a note thanking the kid",
            "29 years old and you're \"OK\" with getting a letter of apology from a 9 year old as opposed to a face to face apology? How much more embarrassed did you want this kid to be? ",
            "Do you really wish her parents forced an insincere apology on the spot? ",
            "Kudos to that mom. Happy it worked out OP!",
            "I'm so glad you took a rational approach instead of the passive aggressive bullshit that reddit advocates. ",
            "Dat parenting. ",
            "Always great to hear when an issue worked out peacefully, with bonus points for reading your username in the narrative like it was actually said.",
            "A MATURE SOLUTION IN /R/RELATIONSHIPS?!\n\nBLASPHEMY!!!!!!",
            "Pay attention people. Did you see that?\n\n**99% of conflict resolution is finding a way to point out a problem to people that doesn't make them immediately defensive**.",
            "What? You expected a nine year old to apologize to you on the spot? Yet she probably had to hand-write a bunch of apology letters to tenants?\n\nTreat the kid like a kid. Give credit where it is due. She is behaving now; it's not like an empty apology. She actually followed through on her shit. I commend her for that.",
            "Aw that's nice.\n\nI'm actually in almost the same situation, but with a dog and not a kid.  My dog will make the most fucking awful sound if she wants to be let out of the dog room where she sleeps at night and I have no choice but to cave because my tenants can hear it.  We tried training her by not responding, but we got a text from a tenant about it :(\n\nBut of course caving just reinforces the behavior, so it's a really shitty situation.",
            "I love happy endings :)",
            "I'm so glad you have reasonable tenants.  Some of them get offended and put the blame on everything except for their precious child.  This was resolved peacefully!",
            "I'm sure your landlords are a lot happier too now! After all, they didn't even have a wall between them and their daughter...",
            "[deleted]",
            "We have had this at our house for the last four months, but it's a three-year-old (F) and a four year old (M), we're the landlords, and both tots scream in the mornings, the little girl screams in the afternoon resisting her naps, and she creams at night because she never wants to go to bed. Her mom (single F) knows, and says it's hopeless, she rather just lets the children get their way than listen to the tantrums. At least the child has quit kicking the walls.\n\nThey really should have been gone a long time ago, but they're family and they would be homeless without us taking them in. It doesn't help we're under lots of pressure from Dad to keep them under our roof because we're the only family with the extra space.\n\nStill, they are officially leaving by the 22nd-ish. Then we will at last have peace.",
            "Wow, that's fucking awesome. I had neighbors that owned a really terribly trained dog that barked at everything, even nothing at all. When anything would walk by, he'd snarl and try to bite them/attack them through the window. I tried talking to the tenants about it but they just got really bitchy and said he was abused and a rescue and couldn't help himself. I lived between that and an neighboring apartment that smelled like a dumpster. I was so happy to move out of there.",
            "I don't know if you'll see this but, it sounds like they handled the situation really well. It it were me I'd pop back over just to say thanks, it's been really great recently and I appreciate you fixing the situation. Or something like that!",
            "Might be a good idea to write a thank-you note for the kid/landlord so the child gets some positive reinforcement as well. ",
            "Wow, they are damn good parents for doing that. Most parents wouldn't even bother.",
            "This is a great outcome and I am so happy your situation has improved.\n\nBut it brings up a point that has been bugging me. Why do parents think their children can treat their own parents this way? They thought her tantrums were only something they had to endure. When it was brought to their attention that the entire building is also listening to this, then enough was enough. Which is great! But her parents deserve more consideration than anyone. Why did they think they had to put up with that?\n\nWe went out for lunch on Mother's Day last week and a family was seated next to our table shortly after we arrived. They had a toddler (2 or 3 years old) who immediately started whining and was quickly working herself up to a more dramatic state. Her mother said \n\n\"YOU WILL NOT ACT LIKE THIS RIGHT NOW. (points to our table). YOU WILL NOT RUIN THEIR LUNCH.\"\n\nI **very much** wanted to turn around and say \"Thank you for your consideration. But she shouldn't be allowed to ruin your lunch either, right? You are the ones who take care of her day in and out. Who am I to her??\"\n\nIt was just such a backwards way to deal with a child? It's like saying \"I am going to put a roof over your head and feed you everyday and make sure you have everything you need. But you need to treat total strangers with more respect than you treat me.\"\n\n??? Very confusing....\n\n",
            "This ended really successfully! Your tenants at least seem like good people and didn't make a bigger issue when you brought it up so Congrats!!!",
            "I hate children so much!",
            "Reinforce the parents positive message. Send an \"apology accepted\" gift. Maybe movie tickets or candy. Check with the landlord for acceptable gifts.",
            "Too bad they hadn't given her consequences before.  While this worked, it's sad they couldn't parent her before shaming became an option.  A kid screaming this way has been allowed to have the power in the house.  She's screaming because it works which means the parents hadn't given her effective consequences before.  Regardless, good job on the confrontation and I hope it remains peaceful."
        ]
    },
    {
        "post_id": "v9ht08",
        "author": "None",
        "title": "UPDATE: I (25F) and starting to think my partner (25M) will never want to get married.",
        "url": "https://www.reddit.com/r/relationships/comments/v9ht08/update_i_25f_and_starting_to_think_my_partner_25m/",
        "score": 2095,
        "num_comments": 38,
        "created_utc": 1654895733.0,
        "selftext": "Original Post [https://www.reddit.com/r/relationships/comments/tf2gg8/i\\_25f\\_and\\_starting\\_to\\_think\\_my\\_partner\\_25m\\_will/](https://www.reddit.com/r/relationships/comments/tf2gg8/i_25f_and_starting_to_think_my_partner_25m_will/)\n\nTLDR: Focusing less on myself and opening up to compromise has paid off big time!\n\nThe vast majority of commenters on my original post said that either there was a specific reason he didn't want to get married, or that we were fundamentally incompatible because we had different views on marriage. Fortunately, it's the former! When I brought it up again, I decided to approach the subject differently- rather than focusing on what I wanted, I focused on what he wanted from the future, and how that might fit with my vision of my own life. \n\nThe first thing I learned from this new approach is that my dear, introverted partner loathes the idea of turning our relationship into a giant showy party, and being vulnerable/romantic in front of our messy, chaotic families. Love should be private, and he hates weddings.  We talked this over and I made it clear that 1) I do not care what our wedding looks like  2) I am happy to wait until he is comfortable with the idea and 3) While I don't care about weddings, marriage is an important part of a lifetime partnership for me. He told me he would think about that, and that it made him feel better to know that I didn't mind forgoing the stuff he sees as \"superficial.\" \n\nLast night, we were discussing our long-term career goals, and he told me that he now does see marriage as part of those plans, because he wants to plan our lives in tandem, and agrees that the benefits and the commitment of marriage are a part of the vision he has of our partnership. He realized that my willingness to forgo the kind of wedding I originally wanted to preserve his comfort made him want to compromise too and he's ready to start incorporating traditional romantic gestures into our lives- including \"the whole song and dance\" of proposals (this is big for him because he is NOT a romantic). We talked it over and agreed that marriage within a year of my finishing law school was the right timeline. This gives him plenty of time to work on his issues with weddings and think about what ours should look like. Knowing that we have the same vision for our lives and a solid timeline in mind completely assuages my worries. \n\nAnd lord the way I blushed when he said he planned to have a ring on my finger before I graduate... I must have glowed.",
        "permalink": "/r/relationships/comments/v9ht08/update_i_25f_and_starting_to_think_my_partner_25m/",
        "comments": [
            "I'm glad you two worked it out! I will say too, there's nothing wrong with a courtroom wedding. My parents got married that way and their 37th anniversary is coming up this fall. (though it sounds like you two are going to find ways to compromise, and \"small wedding\" might work for you two too.)",
            "[deleted]",
            "Awww what a positive Update!",
            "you guys sound like a great couple, very understanding and open with one another. congratulations :-)",
            "I never understand why people who see marriage as just a piece of paper and say it doesn't mean anything won't just get married to please the person who does find meaning in it.\nIt's like saying you don't care what kind of flavor of ice cream your spouse gets at the store as long as it's your favorite flavor.",
            "Sounds like you two should elope of have a very small private ceremony.",
            "As a suggestion would you consider an elopement? I married my first SO with just the two of us in a park at a beautiful destination spot. We got dressed up, met the officiant then went out for a fancy brunch. It’s common in that location so the bed and breakfasts offer packages with a park reservation, officiant, photographer, rooms and cake for 2-8 people",
            "As usual communication is the core foundation on which all healthy relationships live. Happy for the both of you that you worked things out!!!",
            "One possible compromise, you may be able to have is a small wedding with a bigger reception.  That way the vows can be more private, but you also get to celebrate with a wider amount of people.",
            "This sounds great.  However, I am hoping it is not an excuse to just delay longer and when the time Comes, Is there any more excuses?  Deal with it then.",
            "What a happy update! I'm super extroverted and I love big parties, but I do not enjoy being the center of attention in that setting. I also can't wrap my head around spending so much money on one day. My husband and I had a very small group of family join us at the courthouse and it was lovely.",
            "Love this update! My partner and I went through a very similar situation. His reservations came from his parents’ very ugly divorce from when he was a kid that left him with a lot of fear. We addressed it from a place of ‘what are you afraid of and what can we do to help you feel more secure’. Even just seeing that that was my intention instead of blowing up emotionally at him was a huge gesture. Turns out he really didn’t need all that much, and simply being heard and validated and seeing genuine intent on my part made most of the difference.\n\nVery happy for you both! Maybe look into elopement or something like Wandering Weddings where you could turn it into an adventure.",
            "Oh my gosh, what a lovely update! I'm so glad you communicated well.",
            "Glad this worked out and he is wanting to marry you, it really seemed like the thing was on a knife's edge with you to begin with.  You two seem to really have your stuff together and then this herring...\n\n&#x200B;\n\nI only wish the rules of this subreddit weren't the way they were so I could post.  To me it seems like the mods just don't want people posting here.  \n\n&#x200B;\n\nThe rules are such that even if you the add the information you saw requested you're denied because of something trivial like the spacing or punctuation and then when look at more posts many don't adhere to any of the rules.  What's the deal?  I'm going to post elsewhere, but I'm glad somebody's getting something out of this.",
            "i’m so happy that you didn’t give up on the relationship like so many commenters told you to!\n\ni was in your exact situation at your age with my now husband (started dated him when i was 21, we’d been dating 7 years before he proposed). \n\nwhen we got together we weren’t looking for anything serious, but as we got older and our relationship got more serious, i started to worry he would never want marriage. \n\nwe went through a few years of couples therapy and had tons of conversations like the one you had with your partner, and eventually realized that we had been thinking about marriage in a fundamentally different way. \n\ni hope you and your partner work towards the kind of life that makes you both happy!\n\nmy one piece of advice is to not turn to reddit for advice on this issue. i almost drove myself crazy looking for posts from people in my position, only to see commenters saying to cut and run, he will never ever commit. while that may be true for some couples, i am so glad i didn’t follow that advice because i wouldn’t be happily married now ❤️\n\nonly you can know your relationship and if your partner is serious about your future. keep being open and having honest conversations, and it’ll all work out!",
            "I really do wish you well.\n\nBut why couldn't he he express those feelings and thoughts before you posted here?\n\nWill he always make YOU responsible for HIS emotions?\n\nI don't know if I should say Get Out, \n\nbut I will say:  I'm a happliy single 50 yo woman.  Who still has relationships but only with men who KNOW THEMSELF.",
            "\"hates weddings\" red flag.  Who hates weddings?  You mean food dancing and booze?  Yikes.",
            "I don’t understand why people need a piece of paper to define their relationship",
            "Why you think marriage  so important. To a guy it not important",
            "Your partner sounds like a wise man.",
            "I had a private ceremony on a beach in Florida with 4 people. Amazing experience.",
            "If my settlement wasn't stolen out of Denver post office I would have got two Chinese girls arranged marriage, they called I had no idea they spoke mandarin just haters in my life now I have to try online hope those 300milkion people rioo them off"
        ]
    },
    {
        "post_id": "37hcyu",
        "author": "overworkedandannoyed",
        "title": "Me [32F] who is childfree with my department [20s-50sFs] coworkers who have actually SAID they think I should do more work than them and take on more after-hours responsibilities for them because I don't have kids. Worked at school for 8 years.",
        "url": "https://www.reddit.com/r/relationships/comments/37hcyu/me_32f_who_is_childfree_with_my_department/",
        "score": 2091,
        "num_comments": 521,
        "created_utc": 1432747192.0,
        "selftext": "I am a HS math teacher, and we were creating a schedule for next year and divvying up work loads. I noticed I'd got almost 50% of the test creation and had 2 plannings missing from my schedule next year for every 1 for the other (6) women in my department. (There are 8 of us; my department head assigned herself nothing as she is \"managing\" and needs every prep. But that's another quibble.) I am not the newest and in fact have seniority some of these women, but I'm also not the most experienced (so it's not like \"these are struggling new teachers who need help\"). So, I asked why it was divided this way. I was told, \"Well, Ms. Millie is pregnant and the rest of us have families. If you have to stay late, it's no big deal.\" \n\nI can go to my Principal and deal with it that way; what they've done actually breaks the union contract. But I really was offended by this. I tried to explain my offense, and they literally stared at me gobsmacked. I thought I was being punked. \n\nI thought about posting this on r/childfree, but this isn't just a rant. I actually want to know how to discuss this with them; these are all women who I have previously gotten along with and liked. When the last one (Ms. Millie) got pregnant this year, there have been some conflicts (she is in my grade level, and they made me take on some of her work basically because she had some complications - this I did but I think PLANNING for me to do more is very different than an emergent health issue) as well as some uncomfortable situations for me (having to participate and buy stuff for her baby shower, when I'm not really into those things - but I did so to not cause waves). \n\nAny ideas on how to talk to them to make them see my side? Are they serious with this or just lazy? I can't even imagine this mind set. (I mean, I didn't have kids because I wanted more free time! Not to work more!) \n\nEdit: If it matters, I am married, with pets (3 dogs) but childfree by choice. Also, I want to point out that \"childfree\" doesn't mean I dislike children. It means I don't want to have any (some people have PMed me asking why I teach if I hate kids). \n\n**Edit #2 A lot of people have advised go to the union, go to the Principal, and I absolutely will if necessary. I want to be clear I'm not worried at all that I'll be \"forced\" to work this schedule, but these are my colleagues, many have been working with me 5+ years, and we have lots of meetings and times together, where it's helpful to get along, so I DO try to get along (like the baby shower thing) and be a good \"work friend\" and colleague. I just want a better way to communicate myself than I had today. I was entirely shocked and VERY indignant and just found myself unable to express myself well and I was hoping for ways to approach that someone with their attitude might understand because I can't empathize with it at all, myself (and viewing the other side is how I always try to look at problem-solving).**\n\nTL;DR - My previously reasonable co-workers seem to have gone off the deep end, wanting me to do the majority of the work for the whole department because I am childless and thus have more free time. I have heard of this in theory but never thought seemingly reasonable people would not only do this but COME OUT AND ADMIT IT!",
        "permalink": "/r/relationships/comments/37hcyu/me_32f_who_is_childfree_with_my_department/",
        "comments": [
            "They will not see your side. It's not your job to change their (admittedly short sighted) viewpoint. You go to your department head and tell her that you are being singled out for more work because of your child status, and anything in your personal life is your business and your business alone. If she has any problem with that, you'd be happy to have a joint meeting with the principal. \n\nAsk her if someone with 3 kids should take on less work than someone with one. If someone who's a single mother should have less work than a mother who is married. If someone who has a special needs child should have less work than someone with a healthy child. After all, their available free time is different, right? Unless they plan to compensate you for extra time or job responsibilities, working more because you have more free time is not a valid plan of attack. Feel free to let them know you're more than happy to get the union legal team involved, too. ",
            "Go to the principal and union. You shouldn't be given more work just because you don't have kids and they do. It doesn't matter if you're married with pets, you have children at boarding school, or what. You're not compensated to do additional work, having kids doesn't give them the right to do less work.",
            "Yeah, absolutely not. I am also child-free and co-workers of mine always mention the opportunity for overtime. My department director also brought this up a few times to me. Every time I explained I was not interested in over time, outside of an emergency coming up that I would need to handle once every blue moon. They have pointed to my child-free life as a reason I should welcome the over time. I have told them repeatedly that I am child-free in part because I value my free time and don't want to NEED over time in order to make ends meet. The job is the job, and the job gets standard working hour (which are already over 40 a week at my company). \n\nGo to your principal. Go to your union. The job is the job. Your personal life doesn't change that. ",
            "You do not discuss this with them. You go right to your union rep. This is one of the reasons you have a union. ",
            "Principal here. Go to your principal. Make him or her aware of the situation. You can ask for the situation to be handled confidentially in that you don't want your colleagues to know that you are going to the administrator. As a principal I would handle this as if I were reviewing the departmental responsibilities for each person in the department. I would then question the department head as to why there is an imbalance of responsibility between you and your colleagues. \n\nYou can also make a stand and state to your colleagues that you do not accept the additional work. Having children is a personal decision and does not entitle one to less responsibility at work. Even if your administrator was unreasonable enough to back the decision of your colleagues, it obviously violates your union contract if I am understanding you correctly. In addition, you can file a grievance against your administrator as a result.\n\nAt the end of it all, your colleagues error in judgement probably has more to do with end of the year stress. Teachers are receiving more and more responsibilities, but that doesn't give your colleagues the right to make you more accountable because of your life choices (or their own).\n\nPersonally, I wouldn't stand for it and I'd stand up to my colleagues and inform them that they need to distribute the work and prep evenly.\n\nGood luck. :)",
            "I immediately thought of the union.  They're not going to let that happen.",
            "Go to the principal and the union. \n\nIf they actually cared about a fair split, then they'd have asked you about your committments, divided things up depending on whom has more children/age of children/martial status. Instead they've divided the team into mom's vs. non-moms. Their behavior isn't appropriate and they need to hear this from the administration.  ",
            "There is only one way to handle this without creating resentment on their part and that's to keep your mouth shut and let them walk all over you. Go to the principal and let the administration know that they have a potential contract violation brewing. Your time is every bit as important as theirs.",
            "All the top comments I am reading here completely ignore your desire to save the relationships you have with your coworkers.\n\nLet me address your request directly.  If you have already raised concerns with your department head about the disparity in work distribution, she is aware that you are unhappy about it.  She is also likely aware that it is against the union contract, and that your principal is very passionate about fairness.  Though, you've stated here that you did not do a very good job communicating your objection.  I would give her the benefit of the doubt and guess that she has not connected all of those dots in her head.  \n\n Breach the subject up by telling her you did not express yourself very well the other day.  Tell her that you value your time just the same as your colleagues value theirs.  Tell her that the current distribution of work should be equal regardless of family status.  Be direct and concise.  Do not mention the principal or union, yet.  Let her respond.\n\nIs she argumentative?  If so, reword and restate your position.  Pause again.  If she is still argumentative, then you can mention the principals feelings towards fairness, or the union contract.  These are your aces in the hole.  \n\nIf at either pause she relents, you've done it!  She did the right thing! If not, then go to the Principal.  \n\nIf she speaks over you, calmly ask her not to speak over you, repeat until she stops, and continue your point from where she interrupted.  Make sure you remain calm, and use a friendly and upbeat tone, but speak with resolve.  \n\nMost people are good, and want to do the right thing.  Often times we fail to identify the right thing, so a friendly nudge is required.\n\n\nI hope this advise is not as scattered as my brains.  I will say that this is the continuum that I follow when confronting issues like these, and it has been very useful in resolving disputes.  Most times people will have already realized their mistake and will correct it just as soon as you breach the subject.  \n\n\n\n ",
            ">I can go to my Principal and deal with it that way; what they've done actually breaks the union contract.\n\nDon't bother trying to explain your feelings to your coworkers. They are not your friends, don't waste your time on them. Go straight to a higher-up and have them deal with getting your duties fairly distributed and leave it at that. Work is stressful enough, don't get sucked into co-worker drama.",
            "> Any ideas on how to talk to them to make them see my side? Are they serious with this or just lazy? I can't even imagine this mind set. (I mean, I didn't have kids because I wanted more free time! Not to work more!)\n\nThey're serious. They're making you pay \"the child tax\" since you're not married. It's a real thing and fortunately, it's illegal. You should stand for your rights. Do you have any friends who are laywers? Or who work in HR that can advise you?\n\nCross post with /r/legaladvice\n\n> Edit: If it matters, I am married, with pets (3 dogs) but childfree by choice. \n\nIt doesn't matter. It's unfair and it's discrimination to assign you more work because you don't have children!\n\nYou're right to go to the principal on this. Go above her/his head if the principal doesn't resolve this.",
            "No, they're serious. For whatever reason people think having kids makes them special and above other people.  Case in point.  Whatever you you're doing after work isn't as *important* as what they're doing, obviously /s",
            "Go straight to your union. Seriously, these women know exactly what they're doing. ",
            "This isn't fair, at all. \n\nIf a person chooses to start a family and continue working, they are responsible for managing the same work load. If they are unable to manage the same workload as a child free person, it is also their responsibility to decide to either go part time, or look for help with child care.\n\nTalk to your department head privately about how you feel, and reason with her how unfair this is on you. If she does not agree? Then take this to your principal. \n\nYou **should not** be doing more work to cover the slack for others, not if you are all being treated (compensation and job security wise) on the same level as employees. ",
            "You definitely don't want to piss off these women since they will be like a high school clique if you do. \n\nI think you need to sit down with them at the meeting and say something to the effect of: \"I truly understand that all of you have very active lives outside of school and have many obligations; however, these are outside of work. I feel like we are all paid to do the same job and I would hate to feel taken advantage of because of choices that I make outside of work. I want to split our workloads so that our outside lives do not compromise our work ethic here. Thank you so much for understanding where I am coming from.\"",
            ">actually breaks the union contract\n\nTell this to them first. If they are going to throw one of their own under the bus then you probably need to go to your union rep, but I think going to the Principal first would be the step before that, so they actually have a chance to address and administrate the schedule.\n\nTalk to the teachers first though. You won't make friends in this situation, but you'll make far less if you don't try to reason with them on it. You have to work with these people so you need to try to resolve it with them.",
            "Having a child does not give anyone the right to spend other people's free time.  \n\nThat's about as succinctly as I can think of putting it. That's essentially what they're doing unless you volunteer your time and/or are compensated in some way.",
            "I find it inexcusable for those with children to use them as an excuse to work less.  If you have children, and don't want to work as much, then quit, or find a job that would allow you more time at home.  I would refuse the extra work on principle.  They are basically discriminating against you for not having kids.  ",
            "You should go to the principal and remind him it's against the union contract, and you won't stand for it.  Assert your position of seniority.   But it is HIS responsibility to go to the department head and make changes.  Give him the gun, but he has to shoot it.  \"He doesn't want to raise the ire of the union, etc.\"\n\nNow you know that these delusional women are not your friends, proceed accordingly.  They are just crazy, lazy bitches who resent your freedom and will take advantage of you given the opportunity.",
            "This kind of thing is exactly why at my next job I'm going to bring a framed photo of my cousin's two young children and put it on my desk. \n\nIf I as a child free woman had to tally up the number of times I was REQUIRED to do more work because I \"don't have kids to go pick up from school/pick up from daycare/stay home with for illness/take to doctors and dentist and orthodontist appointments etc...\" the number of occurrences would be insane. I have had jobs where I've basically been working 60 hours to every parent's 25-30 hours. However they still get paid full salary while I made nothing extra for picking up their slack. \n\nSo for my next job, I'm going to borrow my cousins kids and make sure that I take off early \"to get the kids\" or come in late \"cause I had to drop them off\" or leave in the middle of the day because \"johnny's school called and he's sick\" or call in altogether because \"Cindy has a stomachache\" etc. \n\nIt's absolutely ridiculous the way parents are treated vs. non parents in the professional world. I'm tired as hell of picking up the slack just because some coworker decided to pop out a few fuck trophies. ",
            "Whatever you do, do not get into what you actually do or don't do in your \"free\" time. That is irrelevant, but would be an easy place for someone to focus their \"attack.\" You could get into hypotheticals such as \"Maybe I baby sit, maybe I take classes, or maybe I just sleep... it doesn't matter.\"\n\nWhenever and however this gets worked out, either \"naturally\" or with union force, your best bet for future relationships at the school is not to take it personally and live past it. These people are momentarily idiotic and insensitive, but not necessarily evil or mean. ",
            "It seems like you haven't gotten any responses on what to actually say. I'd start with something like this: \"Hi everyone, I need to bring up an issue with next year's schedule. As you all know, I have been assigned fewer planning periods and more courses than anyone else. This is not fair to me and I need us to change it. We are all supposed to share the workload equally unless emergent circumstances arise, and I am not willing to do more than my fair share of work. I suggest we change the schedule by (blah blah). Please let me know if we need to meet to discuss this further. Best, name.\"\n\nSend it as a group email. If they refuse to equalize the workload, then contact the principal.",
            "I am a single father of 3 kids (4,4,1, mother in another country) who works full time and cares for the kids full time when they're not in daycare, and I'd just like to say that those coworkers are horrible, selfish people. The fact that they chose/are choosing to have kids does NOT mean you should have to do more work. I could go on and on, but this is the general gist of how I feel.",
            "I would point out  being married = having a family.  And  that your family time shouldn't be compromised for others people's choices to have children  :p ",
            "\"We are all on the same level and thus are entitled to an equal amount of free time. Just because you choose to commit your free time to child rearing, does not entitle you to more free time at the expense of mine\"\n\nIf they need or want more time to spend with their family, then they need to find a job that allows for that.",
            "I'd say some or all of the following:\n\n\"You are my friends and colleagues, and I appreciate your difficult situation in being a working parent. I will help out during emergencies, but to ask me to take on more work simply because I have no children is insulting.\"\n\n\"My private life is just that: private. My home life does not and should not have any bearing on my work schedule. We are a team, and as one we need to be fair with the work load. Everyone gets the same amount of work.\"\n\n\"Using your children as an excuse not to share the work load equally is appalling. Your children are not an 'illness' or a 'handicap' and shouldn't be cited as a reason not to take on work.\" \n\n\"You made a choice to have children. I made the choice not to. This fact shouldn't be held over me to make me feel like a second class citizen.\" \n\nFrom tBrownThunder: \"[Should] someone with 3 kids should take on less work than someone with one? [Should] someone who's a single mother should have less work than a mother who is married? [Should] someone who has a special needs child should have less work than someone with a healthy child?\"",
            "There is no way to talk to them. They are unreasonable. Talk to your union rep and the principal and deal with this in an official capacity. ",
            "They *chose* to take this responsibility when they took on the job.  They also *chose* to have children.\n\nIf they can't handle the workload they put on their plate perhaps they need to seek different employment.\n\nReport them.  You can *not* reason with that type of ridiculousness.",
            "> Edit: If it matters, I am married, with pets (3 dogs) but childfree by choice. Also, I want to point out that \"childfree\" doesn't mean I dislike children. It means I don't want to have any (some people have PMed me asking why I teach if I hate kids).\n\nIt doesn't matter. And those people who pm'd you are incredibly narrow minded. But that's why they pm'd you instead of commenting here because they'd get told that by multiple people while getting downvoted.",
            "I feel for you man. I just had my first kid @ 32 after years of planning on not having kids at all. My experience with most new parents so far:\n\n- self-centered, entitled behavior (as if nobody has ever had kids before)\n\n- find it unfair that they have to work, because nobody has ever been a working parent apparently\n\n-offer unsolicited advice... and act offended that you didn't take it\n\n-expect free childcare from family parent. I will concede that many grandparents insist on taking care of the child, which is nice- but please make sure to give the grandparents money so they can go out with the kid during the day. so they dont have to spend a dime caring for your kids. \n\n-Lastly, the obvious resentment that their sleep and free time has been greatly reduced. SO they take it out on coworkers without kids. Sometimes it is subconscious, other times it is blatant.\n\n\ndo yourself a favor, don't compromise on anything. remind them that your time and energy is just as valuable as their time. Eventually they will get the point, if not call them out on it. Sorry this probably isnt a ton of help, i guess i just had to vent. ",
            "Hey OP can we have an update when this is over? I'd really like to hear about their reactions and how it turns out. Sorry you have to be in this position but I wish the very best for you! ",
            "Go ahead and let them know that work duties are completely seperate from personal life and that you want it treated the same. They are paying you for the amount of work that you do, not the amount of hassle it places on your personal life. I'd start with that at your union, if you make it about your choice of whether or not to have children, you may run the risk of your union feeling similar.\n\nMake it about equally distribution of workload among teachers and the issue can easily be addressed by the union.",
            "I wish I could have used the kids defense when I worked every holiday for 3 years. Tell those entitled turds that your time is no less valuable just because you don't have kids. I would think they would want extra hours anyways for extra money considering they have more mouths to feed.",
            "Just what the fuck? These are teachers? If I had a school I wouldn't want any of these cunts anywhere NEAR me.  \n\nHow in the hell do they get to decide how YOU spend YOUR free time? It's not like anyone forced them to raise kids. It also reeks of childish behavior. I hope you get this sorted out.",
            "Instead of saying no, \"I don't want the extra work\" you can say, \"I'll do extra work but I want a raise and a title\". \n\nWhen you phrase it like that the principal, school board, other teachers will be more inclined to agree with you. If you do extra work you deserve extra reward. If you make it a you vs them issue it becomes an issue and your work friends will be against you because, let's face it people like to be lazy sometimes. If you say \"I'll gladly do the work if I get more money. Then say why isn't doing this extra work worth more money?\" Your co-workers won't be against you. \n\nThe results will probably be that you don't have to do the extra work since most schools don't like to pay out extra money to teachers.",
            "I hate comments like these. I had a coworker yawn and say he was tired one time and another coworker said \"why is he tired? He doesn't have any kids\". Because only people who have kids are allowed to be tired!",
            "Speak to your union's shop steward/representative. They should know what to do.",
            "I'm a mother of two and I find their behavior inappropriate on so many levels. They're only trying to get away with this by assuming you'll just go with it (Hey you're single, what else are you gonna do?!) So get the principal to shut it down immediately! And tell them how their actions made you feel and that you will not be their doormat.",
            "This doesn;t happen to me as directly. But as a young man working as a builder, I get annoyed when my co workers can use their kids as a scapegoat to take off work or come in late. \n\nWhen I do it, I get an \"Oh yeah, you weren't feeling good huh? Must have been hung over.\" Which IS sometimes true, but no more than it is for them! They can just say little Jimmy has a fever and they're home free. \n\nBut then I tell them about my weekend... karmic retribution. \n\n",
            "These teachers are under the assumption that your lifestyle/home-life should dictate your workload. This is unreasonable and more than a bit unfair for them to assume their time with family is more valuable than yours. We both know that's unfair, but they are likely unable to see a different perspective. Have you ever read the blog askamanager.org? I would definitely ask your question there, or see if something similar has been addressed in the archives. There has to be a kinder way to approach it than going to the principal... Whether he is your pal or not!",
            "I have a similar coworker. Every time she has mentioned that she has kids and shouldn't do as much work I simply tell her \"That's your personal life. This is our job not mine.\" She doesn't see it the same way and everyone else with kids never will. Everyone's personal life is different and shouldn't affect your work life or anyone else's. ",
            "This is one of those things that, if it seems reasonable to them when they suggest it, you won't be able to explain to them why it's batshit crazy.\n\nTo them, having children elevates them to a different status than you. They *need* their time for their children, you do not.\n\nDon't waste the time. Explain to them that their worldview isn't how life works. When they disagree, go to the Principal. Be firm and don't overly-engage with them. This is one of those things where brevity is better: \"you're wrong, this won't happen your way, here's the Principal to explain that to you.\"\n\nThey won't 'get' it on their own.",
            "Don't bother convincing them, they don't care about you. Your time is worth less to them than their own. And all over whether or not you have a kid! That's insane!\n\nIf it's a violation and you don't like being pushed around and having work piled on you because of unprofessional reasons, immediately talk to your union rep and your boss/principal. I wouldn't stand for this shit at all. My time is just as valuable as theirs, it's not my fault they decided to have kids.",
            "Do they know you're childfree and plan to stay that way? What they did here was shitty either way but part of me wonders if they would honestly pull this kind of stunt if they thought you MIGHT become pregnant or something. Ugh. So disrespectful. After 8 years having coworkers feel it was okay to do something like that would definitely have me reevaluating my interest in being on that particular team (although I realise that is easier said than done in a lot of cases) and start looking into other math departments in the district if possible. Respect in the workplace is so important and that would make me lose a huge amount of respect for all of them.",
            "I get it, you work with these lades, it's already weird enough that you are the only one who is child free and you don't want to make your workplace feel hostile because you reported them. Before going to your higher ups and reporting discrimination I would pick one lady who is either in a position of higher authority or is just someone who gets you a little bit more and sit them down. If I'm not mistaken, as a teacher you will not get paid more for doing your co-workers work and that's a heavy point. I would say to her that you cannot do extra work without extra pay. So you simply have to insist on equal work for everyone. If your colleague is having too much trouble with her pregnancy she needs to take a leave of absence, so someone capable can fill in. Tell her families are at home, you do not want to discuss home life you only want to discuss equal work responsibility. Tell her that the last thing you want to do is report them all to your union but you will when there is no other choice.  As you are 7 against one, I think trying to talk to one person rationally will be best as everyone can't gang up on you that way.\n\nYou deserve your life and you deserve the job you signed up for. I too am voluntarily child free and I also don't give a fuck about my coworkers kids! Good luck!",
            "I'm a single male teacher and I know what is like to get a bs schedule and to deal with the politics involved. You gave to see these people every day and be civil. The two options I see are to be either completely forward.... That is say something like \"we all have out own work life balance issues and I don't know what it's like to have the responsibility of being a parent, but I made my life decisions and won't conceded to working worse duties as a result of your decision to start a family. I would like to rework the schedule together or I'll go sort this out with the principal.\" be polite but firm and allow them to rebut but don't give in.  Or u can go straight to the principal and let him deal with these women. . Either way be firm and professional.... I know how shitty these things can be. ",
            "They're trying to bully you into doing more work",
            "Welp, I'm in /r/childfree and I thought this was posted there already for a moment, just now realized it's in /r/relationships.",
            "Parents like that piss off parents like me. How dare they treat you that way. If they can't juggle their family and pull their own weight at work they should find a more suitable job. Definitely go to your supervisors and call your union rep if necessary. Im sorry you were treated that way.",
            "Tell the chair you refuse this schedule.  That's not reasonable in any way.",
            "Everyone is pointing to going to the principal or the union and it's a good idea but I understand your hesitation with causing waves among workmates.  \n\nTry and reverse the situation maybe? Use their logic against them. Tell them you've decided to adopt 5 children and can't do ANY after-hours work and then point to the person with the least children since they will have the most 'free time', suddenly that person might be on your side, or be able to see your point of view.\n\nYou have already been a great workmate by picking up the extra work for the new mother and the baby shower stuff but you definitely have to stand your ground here or the behavior will continue and they will start to assume you will always pick up the extra work since you are childfree.",
            "They're using you as a crutch/work dump. If you weren't there, they'd have to divide the work among themselves anyway. ",
            "That's bullying and discrimination. Those girls should be ashamed since they are setting bad examples for their kids. I don't have kids and my coworker has kids. We are friends so I don't mind helping her out. She appreciates my help. It would be different if she takes it for granted. I would throw a fit.",
            "You've already got a bunch of opinions, but here's a posible way of explaining the issue to your coworkers.\n\n\"I don't have children to take care of, but I still have many obligations, personal relationships, and interests I'm involved in outside of work hours. I'm willing to pitch in when it comes to emergencies, but a schedule like that makes me feel like you are treating my time as less valuable. Just because I'm not taking care of children doesn't mean than I'm available to work more hours.\"",
            "I'm sorry... But fuck you. You decided to have kids. I didn't. So fuck you. \n\nAt least that's what I'd think... Idk if I'd say it in those exact words... Lol",
            "I'm guessing that, if a promotion came up, they would all stand aside and let you take it since, being childfree, you're more able to take on the extra responsibility?\n\nNo? It doesn't work that way? Then make clear it doesn't work their way either.",
            "Talk to the principle, BUT don't make it about you being offended. Make the discussion purely related to the work distribution issue. ",
            "Honey, these people are not your friends. I know you're trying to be polite and not cause a fuss, but these people are taking advantage of you. \n\nI would email the department head and CC whomever is involved and explain that this is not only unjust, but illegal and you expect changes to be made immediately because you would rather not have to go to the principal or union. This way, you have proof you made an attempt to remedy the situation before it reached the higher-ups. And go from there. ",
            "I'll just participate in the echo chamber. Go to your union. Your personal choice to not have children should in no way impact your work load. You all took on the same job with the same responsibilities and guidelines. The personal choice to have children, or not, shouldn't tip the scales in the work environment.",
            ">Any ideas on how to talk to them to make them see my side? Are they serious with this or just lazy? I can't even imagine this mind set. (I mean, I didn't have kids because I wanted more free time! Not to work more!)\n\nThe only thing you can do is basically tell them this and that they chose to have kids, and you chose not to because you want more times for other things that are important to you right now. Their children are important to them, but you have things that are important to you as well that you need time for.\n\nThey probably won't understand, so just go to the principal and work it out so everyone's schedules are pretty much even.",
            "\"It is unfair that you are discriminating against me because I do not have children. This goes against the union contract, and I expect it to be rectified immediately.\"\n\nSend this to the scheduler, and cc the principal. \n\nI agree, planning for you to do more is very different from an emergency situation.  As a pregnant person, I am very cautious about asking anyone to cover for me, and I am bending over backwards to make sure I'm doing everything I can to get coverage in a fair manner.  Your coworkers cannot expect you to pick up their slack because of their life choices. ",
            "I can see why you want to address this yourself - you're already the odd-one-out and you don't want to risk ostracising/scapegoating yourself more.\n\nSaying that, you have to be tough. These women are not your friends and they all conspired to shaft you. They see your time, and hence you, as less valuable than theirs. Do not be afraid of standing up to them. If you want to try by yourself, say to them that their proposed schedule discriminates against you based on your reproductive choices and that you'd like to remind them that you, the principal and union won't stand for it. Say there needs to be a new, fair schedule or you'll have to involve the principle and union. ",
            "That's insane, but it's also why the union has rules prohibiting this, because it happens all the time.\n\nEscalate. This is not something you can explain to them, and it's not your job to explain it anyway.",
            "So I think the best way you can handle it is to give them the option of dividing it up in a way that is equal and doesn't break the union contract. By letting them know/reminding them of your rights, they may back down. However, if they do choose to move forward, abso-fucking-lately take it to the principal and union. That's some bulllllshit. They're actively and openly discriminating against you because you made a choice different from theirs.\n\nI'm happily not childfree and that was a choice I made. That means my life is more complicated, but that doesn't mean it's someone else's job to take on part of the workload that I, again, chose just so my life could be a little easier. ",
            "Sadly I don't think you will get across to them. I've literally had explosive arguments over these issues. In the end the only way I could get the point across was with physical loss. When flu season hit and all the \"available\" people got sick, none of the parents would offer to help beyond 9am-2pm; our management suddenly realised you can't whip a dead horse! ",
            "If it weren't for the union thing I would say that if you are taking on added responsibilities you require more pay. But since this is a union thing you need to go to them, I mean that's kind of the point of working in a union, dealing with this shit instead of you having to, that's why you pay them, to take care of this bullshit",
            "Or lie and say that you can't have kids, and that this arrangement is unfair...if you decide to have a child later, just say \"a miracle baby!\"\n\n\nBut seriously, talking to a union rep is probably they best way to go...are you at least making more because of this?",
            "Tell you department head that what she is proposing is discriminatory, illegal and against the union contract. Don't blame or shame her; give her the benefit of the doubt, even if you suspect she knows what she's doing.\n\nDon't discuss feelings, stick to facts. For that matter, don't invite your coworkers to this conversation.  This is about you and how you are treated, not them.\n\nGive your department head an opportunity to fix the problem with a clear expectation of when. If she doesn't, then go to the principal or union rep.",
            "Just because they decided to assign you the extra work, that does not mean that you need to accept the extra work.  Just take your pick of the better assignments (whichever ones you like to do / like the time of / etc. least) in the amount of your fair share and then send the message to the right people (hopefully including the principal) or bring it up in the right forum that you'll be accepting those and that they could divvy up the rest.  If all works well, they'll either whine, quickly grab the best of what is left, or decide as a group that the other items don't actually need doing.  Most likely a bit of the first, but will quickly devolve to the last if you stand your ground.\n",
            "I would approach them and let them know that you *do* have a family, and any comments saying otherwise are not only insulting, but insensitive.  Does your husband not matter?  What about parents, siblings, and close friends?  Just because you did not birth them, or take on the responsibility as their full time caregiver, does not mean you \"don't have a family\".  I would be very direct and let them know that medical emergencies are much different than planning for you to do so much more.  Let them know in a firm and friendly tone that not only is this against union rules, but is also really insensitive.  What someone chooses to dedicate their life to outside of work, whether it be being a parent or even collecting stamps, should not give anyone special privileges or (in your case) an extra work load.  This is discrimination based on family status.  If they don't comply, talk to the principal, school board, and your union rep to be sure that everyone is made aware or the steps you've taken and so that nothing can be misconstrued.  Talking to your union rep first and foremost may be the best option though.  You can have the incident documented, discuss the proper way to address it, and then make your move.  If they continue, or try to turn things around, when you do approach your bosses and bring the rep in, you'll have a legitimate paper trail to back you up.",
            "I think for the most part you should be able to say, \"Just because I don't have children doesn't mean I don't have family obligations. I'm sorry, but everyone's time is equally important to each person. I'm going to have to insist that the work load is divided more equally. I'm willing to help out here and there, but please don't assume that I can or should automatically take on more work just because I don't have a child.\"\n\nBe polite but firm, and don't leave out how you're feeling. A job is a job, once you start changing the rules and deciding whose time is more important, what's the limit to that?",
            "I SO hear you! \n\nI'm the one with a lot of kids.  My co workers are child-free because their kids are grown.\n\nBut I got the shit jobs because their \"free time\" was so precious to them because of age, they claimed they \"earned\" it.\n\nSo, let's not make this a kid vs no kid debate.  What this is is majority vs you.  \n\nCall their bull crud to their face while also saying that you are prepared to make a case to the union.  \n\nScrew them.  They are not your colleagues nor your friends.  They are selfish bullies.\n",
            "\"Ladies, as you're aware I'm always happy to help you out in emergencies, however this does not extend to carrying you through your daily routines. I am not going to sacrifice my own responsibilities, health and marriage to ease your parenting duties. If you cannot manage typical childcare responsibilities then I suggest that you request help from your own families, or acquire assistance from a suitable childcare provider.\"\n\n...then when they still throw a fuss, take it up the chain.",
            "\"Unless you guys are willing to give me a percentage of your pay I don't see why I should do more work than you. This would not be acceptable in any working environment, and personal circumstances can come into it on occasion but shouldn't be cause for being singled out. I feel that I'm being discriminated against because I decided to be childfree, and this makes me uncomfortable for many reasons, including a worry that this is the attitude that's being passed onto the children.\"\n\nIdk I'm sure you can put a nicer spin on it, but as you said, you're childfree because you wanted more free time, not because you wanted to work more for free.",
            "Believe it or not they are not just lazy but probably are serious.  This happened to me when I worked in an adolescent group home.  We were dividing up holiday hours and one guy said that anyone who had kids should get thanksgiving, Christmas Eve, and Christmas day off.  Luckily I was fast on my feet that day and said that just because I don't have children does not mean I don't have a life.\n\nMy suggestion is to go inot work and tell them \"we need to revisit the division of the work load next year.  I do not think I was treated fairly\"  When they stare at you say \"While it's true I don't have children, I do have a life outside of work that is important to me too.\"  If they give you a hard time after, that you can tell them without threatening that \"according to the union contract\"... This will let them know you are serious enough to  go that far without actually saying it.  then whip out the notes from the last meeting and say, \"let's problem solve\"  Good luck",
            "I hate that people feel that their choices outweigh another person's in matters such as these.  It's not your fault they chose to have children.  You are choosing not to have children (yet or at all, doesn't matter), and the benefits from that is the extra free time.  They gave up free time to raise children.  Their choice, it has consequences.  What would they do if you COULDN'T have children?  Then they would be punishing someone who already (more than likely) felt punished.  Would they have a crisis on conscience and NOT assign you the extra work?  They can't have it both ways here, it's either ok or it isn't.  I chose to have my child.  I chose to give up all the benefits of being child free because I felt that **for me**, there were benefits to it and that those benefits were more important to me.  I would never expect that anybody else would need to pick up extra slack so I could spend extra time raising my family, outside of taking PTO, but ANYBODY can take PTO, it's not directly related to having kids.  That's part of being a parent is MAKING time to be with your family, inconveniencing other people in the process seems to be a horrible message to send to my son.  \"See son, if I screw these people over for the decisions they make, it benefits me greatly and that is the way everyone should do it.\"  What a great bunch of people.",
            "A great phrase from Miss Manners comes to mind: \"I'm sorry, but I'm afraid that isn't going to work for me.\" Say it with a sad little smile. Don't go into details. It's just impossible, so sorry, guess we'll need to divide things evenly. If they press say, \"It's a private matter but thank you for your concern.\"\n\nOr you can do what I did last time someone said, \"You don't have children so you have more free time to do this\" which was to say \"Yes, my personal time is really one of the things I value most about being child free. That and the buckets more money. DINKS for the win, amirite?! [goes for hi five]\" It was funny (to me) but I don't recommend it.",
            "My apologies if someone has said something similar already, but I think you're right in wanting to talk with them first.\n\nI think that, rather than giving them time to talk about their obligations, set boundaries. \n\n'we shouldn't be mixing our professional responsibilities with our personal choices on how we spend our time outside work. We all signed up for this job with certain expectations of what the work would be, and I think with expectations that work would be divided fairly and evenly. You know I'm happy to help out when things come up, and I know you'd do the same for me. I appreciate having a good working relationship with my co-workers, but it seems like dividing work up this way isn't fair. I respect the decisions you've made regarding your personal life, but dividing up work in a way that values some personal choices over others seems unfair to me, and is penalizing me for the choices I've made, instead of respecting them.'\n\nI might be rambling a little, but I think it covers the three main areas: I like and respect you all, but I think we came into this expecting equal treatment, and this seems unequal and makes me feel\n like my choices aren't respected.\n\nGood luck, that's a rough situation to be in",
            "Oh how I hate this. I am a childless single male in my late thirties in finance. It is not even discussed in my workplace. The work just falls on me and the more children and ovaries a person has, the less they are expected to do, and it is accepted and encouraged by HR and senior management. \"Work life balance\". Female quotas. It all works for people other than me, and then \"the team\" still has to achieve our goals . I have sorted out an understanding with my direct management though. When there is bonus or raise money, I get it. But I had to put my foot down strongly to get this. \n\nDo not discuss this with these women. It is instilled into their very beings that it is completely fair for them to do less because of the sacred importance of their children. You are a lesser being to them as soon as their children are in a discussion. Take this directly to management. Have it told to them. Do not argue with them. They will never see it your way and will just hate you. Is your principal male/older?",
            "\"Cool so you guys are going to give up ur wages to satisfy my extra overtime right?\n\n\"a what..?\"\n\n\"Well im doing ur share of the work; by my counts im doing twice the work as you and then some, so you guys are going to pool together and ask that ur wages be cut so you can satisfy doubling my pay and then applying time and a half right?\"\n\neven if u don't qualify for overtime, u can choose to be just as politely stubborn a they are. Solution: middle ground, everyone does the same thing",
            "Maybe it's a young person thing, I'm 23, but anytime someone would pull a child card to get out of a shift or change a shift i would lose my mind. I would get pretty nasty and say things like \"your child is old enough can they not figure out their problem on their own?\" \"You want to hang out with your kids that day? Sorry I've made plans with my friends already\" Or just straight up \"NO\". Don't be afraid to put your foot down.",
            "While I don't disagree in principle with the majority opinion here that you should go to the principal or the union, that kind of escalation is going to cause serious resentment with your co-workers and regardless of the outcome, you are going to have a lot of anger directed at you.\n\nI'd go to your department head again before you escalate this and  firmly state that the distribution of work is unfair and is required by the contract to be done without regard to your family status.  Try and be subtle with the implied threat of a contract violation, but make sure she understands you can escalate this if it isn't resolved.\n\nIf she still blows you off, take it to the principal and let them reap what they sow.",
            "In all things where you're having to discuss something write it down. Plan what you want to say, sleep on it for a few days, read it again and try to pick out anything that may sound attacking or harsh and re-word it so it sounds better.\n\nHaving done an assertiveness course at work, we're told we should discuss our needs and be honest about our feelings, but look for ways to fix the problem that works for everyone. So for example \"I'd like to tackle this problem this way. How does that affect you?\"  \n\nI would start by pointing out that you're unhappy with the way the workload has been split, you don't feel that it's fair that your life choices and home life are being used to pile more work on you, especially without consulting you. Explain that you have a life outside of work and commitments, even if those aren't children. However, try to also consider things from their point of view. They probably have less flexibility in the times when they can work late. Maybe approach it that you're happy to be flexible to assist the team, especially when it's hard for colleagues to arrange around their children. However, in return for that you expect they should give you some flexibility back?",
            "All of this is bullshit and they know it. It is truly unfair and unrealistic for them to expect you to work more due to not having children. ",
            "Wtf! \"I chose not to have children so I could have more time to enjoy myself and what life has to offer in my free time. I should not have to give up my free time or have less time to enjoy life because you've chosen to add more responsibility which takes away from your own.\"",
            "I really think, \"I chose to not have kids so that I would have more free time, not so I could do more work.\" is a really simple and logical way to approach it.  It's a very eloquent and concise summation of the situation.  It really drives home the point that they decided to have kids, so their lack of \"free time to work\" is on them.",
            "Yes, go over their heads and complain in this way. \"These people with no children *have no idea what I have to deal with in my private time. They think they know me, but they have no idea what happens when I leave here and to assume that their time is more precious than mine because they have kids to take care-that THEY brought into this world of their own volition-is seriously screwed up*. I will NOT be doing all of this extra work and this schedule WILL be adjusted to an equal level of work *for all*\". You do NOT have to explain your private life to anyone, even if it consists of going home, putting your feet up and having a cold one, it's none of their G D business. Then go back to work and be as nice as pie to all. If anyone dares bring the issue up to you again (which I doubt), just plainly say \"we are all equal in here, NO ONE's spare time is more important than *any one else's*. SUBJECT CLOSED.",
            "GO TO THE UNION These women will not understand your point of view. They are in a way harassing you because of your life choices. They chose to be mothers and have their children occupy their free time. What you do with your free time is your business. This is likely in violation of your Union bargaining agreement. Stand up for your rights and call a steward if you need help.\nSincerely,\nMother of 3 and Union Steward",
            "I don't know if you'll see this at this point, and I am not concerned with a response.\n\nMy sister in law is a middle school teacher. She does it for the kids, and she absolutely loves her job.\n\nI have heard some of the most insane, selfish, narcissistic things some of these co-workers of her have done, and it blows my mind. The community seems so small, because you don't necessarily associate outside of your district with other professionals in your field is my thinking, that there is almost no checks and balance. I totally get that you can talk to your supervisor and your union, but you shouldn't HAVE to do that. Crazy how some people's minds work.",
            "I think it helps to lead off these kinds of conversations with \"I feel...\" statements. These remind the people you're talking to that you 1) have feelings and 2) they have affected your feelings which they were probably not thinking about when they planned out the schedule. \n\nI would then start by saying that while you understand that things come up and you might be asked to fill in (and would be happy/fine with doing so) it is hurtful that they think your time outside of work is less valuable than theirs. \n\nThey probably didn't think that that's what they were saying by their actions. \n\nLast, I would tell them that you hope there's no hard feelings that you've spoken to the principal and that they understand that you don't want to cause any drama in an otherwise cohesive work environment, that you just wanted to be treated fairly. \n\nChances are they'll groan and be snippy for a while and then get over it. I hope this doesn't affect your working relationships in the long run. Good luck!",
            "As a professor who is dating a professor, and who has several family members who are teachers, I just gotta say that the people sending you this:\n\n> some people have PMed me asking why I teach if I hate kids\n\nclearly don't know a thing about teaching. You don't get in to teaching because you \"like kids\"; you'd only being screwing yourself because teaching is likely to make you hate people in general. I have a decent time of it because I mostly teach young adults, but I have no idea how my friends and family who teach K-12 do it 5 days a week and *still* want families. Children are often ungrateful little twats.\n\nYou can try explaining your views to your coworkers (ie, \"Just because I don't want or have children doesn't mean I don't have other responsibilities that take up my time\"), but in my experience, many people like this assume that anything that isn't kids--aka *their* choice--isn't equivalent or important. I agree with /u/tBrownThunder: you may have to speak to the head of your department.",
            "\"I will not be able to take on any extra work.  I have commitments outside of work that I do not wish to cancel or move.\"  \n\nIf they ask you what you are doing, you can answer them or not.  But if you do, just know that they will try to talk you out of how important they are.  To many (not all, but many) people with kids, nothing you are doing is as important as raising kids.  They really do not value your time the same way they value theirs.  So they are always going to assume that whatever you are doing can be postponed or dropped, but they could not possibly do the same because CHILDREN!  \n\nIf they start to negotiate or flat-out tell you that your time outside of work is not as valuable as theirs, then you pull out the \"polite but firm\" response.  \n\n\"I chose not to have children for the express purpose of spending my time outside of work in whatever way I see fit.  You chose to have children.  It is not my responsibility to help raise your kids by doing more of your work at work.  Just like it would not be your responsibility to subsidize my out-of-work activities by picking up more of *my* work.  I understand how busy you are but it is not appropriate to give me more work because of it.  We need to fix the schedule so that all of us are getting a fair share of the work.\"  Full stop.  \n\nThis might shame them in to re-doing the schedule.  They may still silently judge you and your child-free lifestyle, but when you stand up for yourself, you are making it uncomfortable for them to express that shit out loud.  I would still go to your principal and let them know what went down, but this might fix the immediate problem and allow you to keep a good relationship with them because you didn't \"rat them out.\"  \n\nIf they argue and gripe and insult you, and do not immediately offer to change the schedule, then you bring out the big guns.  \"I'm sorry you feel that way, but it's in our union contract that we get so many breaks/prep periods/etc.  If we can't resolve this, I will have to go to the principal.\"  Calm, apologetic, but completely and utterly firm. \n\n",
            "I don't have any advice, OP, but wanted to let you know that you're not alone. I'm in the Army and frequently single Soldiers/geographic bachelors are given the worst schedules \"because it's not like you have a family to go home to.\" Well, gee, with a schedule like this I never will! \n\nSeveral others have posted wonderful recommendations and I agree. Going to your department head with the objective facts is likely the best option. ",
            "Why do people choose the career of \"teacher\" if they won't do the work it involves?\n\nIt's not your fault they have children, nor is it your fault they chose to become a teacher.\n\nThis blows ",
            "> I was told, \"Well, Ms. Millie is pregnant and the rest of us have families. If you have to stay late, it's no big deal.\"\n\nI just *love* how husbands aren't considered \"family\" anymore. ",
            "Amazing. I'm 35(m) and also childless and if anyone of my colleagues with kids would have told me something like that, I'd tell them to go fuck themselves in open text.",
            "Wow.  I can't believe that attitude!  As a parent myself I can't even imagine penalizing my co-workers who aren't parents.\n\nThese people are nuts and there won't be any reasoning with them, they are \"entitled parents\".  A new and incredibly annoying breed of humans (even to those of us who aren't child free).",
            "Uh, fuck them.  Your lifestyle is your right.  Work obligations should not be assigned to those who have some arbitrarily defined \"little to lose\".",
            "I worked with a woman who was newly married and pregnant who told me I should have less hours then her because she had a \"family\". The woman who would call off work for every ailment her and her husband had. (This was before the birth)\n\nSorry I was more reliable. (in the end our hrs were cut by a viscious new supervisor. I moved on to a new job and she had to quit)",
            "[deleted]",
            "As a teacher, I advise you to tread lightly. You are not going to get a bunch of mothers to get your POV. Explaining that you are more than happy to help out during emergencies, but are not okay with having a formal schedule where it's planned for you to do more work than others. That is unreasonable. I would not go to the principal or the union, at least not yet. I would go to whoever made the schedule, the department chair(?) and ask her to change it so it is more fairly balanced. Think about it though, couldn't it be worse? I'd actually prefer my duties to be heavier on the test prep side, because I can do that alone. It's hard to understand from your description how it's unfair, since I don't know all the duties that are shared. If you only have 5% more work than the others, then I'd let it go. If it's over 10% more work, then I'd do something. I think the best you can get is a more equitable division of time. Your private life is none of their business, and if you try to get them to understand you, you will just be disappointed. Good luck!",
            "Nah, you're basically fucked.  You're in the right, but it will be a miracle if anyone backs you on this.  You know, because of The Childrens.",
            "Do the work that you're paid for. Your coworkers don't dictate your workload. Even if you got a raise equivalent to all of their paycuts for you taking on their work, the only person that tells you what your job responsibilities are is your supervisor.\n\nIf all else fails, it's time to work somewhere else.",
            "This is, unfortunately, a side effect of not having any or enough maternity/paternity leave. Yes, it is incredibly unfair to those parents, **but it's not your responsibility to bail them all out like that**. \n\nThis kind of singling-out in the workplace would be mostly accepted in a non-union workplace. But this is union. *Go straight to your Union contact.* \n\nIf you talk to the principal or other higher-ups as you suggested, they might get ahead of you and spin the details against you. Being childfree you are likely outnumbered by all staff, not just your department.\n\nTake ownership of this. Everyone else needs to share the added workload too.",
            "They're mad because they hate their lives. \n\nYou not falling for the trap of having kids makes them pissed. \n\nTell them to sell their kids if they can't keep up, the next time they give you shit.\n",
            "Yeh discussing with them will do little to nothing. Handle it through the principal or whatever authority necessary. I probably would have a hard time being professional about it myself but it's absolutely not okay for them to put extra work on you simply because they chose to pop out kids. ",
            "You absolutely need to talk to your union and your Principal.\n\nYou won't be able to make your co-workers see your point of view, but if they give you shit about the schedule, ask them why they think your time isn't valuable or, alternately, how they would feel if they were getting paid less since they had to leave work early for their families.",
            "I would say something along these lines:\n\n\"I understand that having families comes with certain responsibilities, and that there are occasionally special circumstances were I am willing to pitch in extra, just as you would if I had a temporary emergency show up. However constantly putting the extra workload on me feels hurtful. We are all payed by the same union determined rules, and by assigning me to do this extra work, I feel you are valuing my time less then yours. Which makes me feel like you don't value me or my at-home responsibilities, like [list a few].  \n\nI think it is up to us to all manage our responsibilities, and I trust we can split the workload fairly and still have everyone manage just fine.\"\n\nThe key is to not make it about kids, and your lack there of. But about how you also have responsibilities that are important to you, and that they have hurt you by not placing value on your time. Use a lot of \"I\" statements, as in \"I feel hurt by\" and \"It makes by feel undervalued when\". \n\nI also think things will be smoother is you show some appreciation of the responsibilities they take on by becoming parents. The goal her is peaceful and happy resolution and by showing you don't hate their kids and think less of them for having them(I trust you have never done anything to indicate that, but it is best to head these things off before they get the idea in their heads), you can stop it from them all thinking you resent their kids and all the negativity that would come from that.",
            "As a fellow teacher, union rules are union rules!!!! I would tell them that too. \"Sorry guys this doesn't jive with the union contract\". Also I understand wanting to be a good \"work friend\", but they are not being work friends to you either. Try to talk to them first. If they don't budge, go to the principal. If no dice, then get a Union rep involved. \n\nWe all have lives, and just because you don't have the same life they do doesn't mean you deserve more work. It's completely unfair. Please Stand up for yourself!",
            "Tell them to and I quote \"fuck off\"",
            "If you get any more pushback or are forced in any way to take on more work, talk to a lawyer.  This has civil rights violations written all over it.",
            "Not at all surprised...I deal with it in the corporate world as well. Particularly the mothers.",
            "Wow, I would be so offended if I were you! I am so sorry. That is really sucky and selfish of your colleagues. I wanted to reply to your post as soon as I saw it. I know that non-teachers often have a really difficult time understanding the work politics of a school. It is so different from an office! (I am a teacher and often find myself with nobody or very few people to talk to who understand my work issues.) \n\nDo you have a good principal? Can you be open and honest with him or her? If so, I recommend asking your principal for input. He or she knows the politics of your office and the teachers involved. I know not all people are lucky to have a supportive principal, so that may not be an option for you. If you do choose this route, I would make sure to talk like it is more of a problem - solving conference than a bitch session. Talk about how collaboration with your colleagues is important to you and that you need your relationships to be healthy for that reason. I love my principals, so I would definitely trust that I could talk to them, but yours could be difficult to deal with. You know this better than I do. \n\nIf you don't talk to your principal, I'd still suggest at least talking to your union rep and setting clear boundaries. I think less is more in this situation. Maybe say something like, \"Hi, buddies. I have been thinking about our conversations about me taking on more planning, and it really bothers me that you would imply my time and life is not important because I don't have a big family. It isn't right to value my time as less valuable, and I will not take on extra work because of your view. We need to follow our contract.\" Just something short and sweet. If you want to continue a friendship, you can go more into it with them. Union reps can also be good for improving work relationships depending on in which state you're in. They can be great resources! \n\nHope this helps! Please update. This is whack!!!",
            "Remind them that you don't live in a communist country, what they're asking of you isn't fair.",
            "This is bullshit, man.  Fight this shit to the death. Fuckin parents at my job try to do this to me all the time and I always fight them on this! Our personal time is precious and this is why we don't have kids! So we can enjoy our time off! Best of luck to you. ",
            "Maybe go talk to each one separately\n\n\"Something happened a the last meeting that really bothered me and I wanted to discuss it with each one of you.  It seems like there is a expectation among the parents in the group that bc I have chosen not to have children I am obligated to assume additional duties at work.  Im sure that you can understand how unfair such an expectation is and how offended I was.  I don't want to make a huge deal about this bc I believe it was just thoughtless rather than intentional, but I felt it was worth bringing up so that everyone would think it through a little more and adjust their expectations.\"",
            "Just tell them that if you are going to take on some of their work, you also take on some of their paycheck, easy.  time = money, right?",
            "I don't have a constructive suggestion. I would, however, state plainly why I would not do more than my share of work, just because I did not have children. I do hope that you post an update. It would be interesting to see how this situation resolves itself.\n",
            "Its discriminating your at-home personal choices which should not reflect in your professional. You need someone on your side who can then spread the idea.",
            "This is a difficult subject.  I have a number of coworkers with families who often need additional flexibility in their work schedules which normally isn't a problem I'm generally able to be accommodating and it isn't a stretch for me to arrange things to cover for them during the normal 9-5 business hours and allow them to make up the work outside normal hours.  It becomes an issue when it goes from simply being agreeable to cover for someone during an emergency or family event to actually being expected to work more because you don't have kids. The approach I ended up taking was to explain my feelings on the matter like this.\n\n \" We are all team mates, all equals, all peers we are all expected to contribute equally to get things done and the idea is that we will all devote roughly 33%(*8 hours roughly*) of our day to making sure we are meeting the needs of the business (*kids or school in your case I guess*). You're asking me to devote 41% (*roughly 10 hours*)  of my day so that all of you can contribute 29%(*roughly 7 hours*) \n\nI understand life isn't always easy to plan for and I'm generally willing to help out in cases of emergency.  I value all of you as peers. I believe that we are a good team and that any of you would do the same if I were facing a crisis, however I know you are all intelligent adults. I don't believe that any of you can possibly think that its fair or just to expect one person to work harder so that everyone else can have more time away from work. \"\n\nI try to avoid using phrases like \"free time\" or \"time off\" since these tend to conjure images of just relaxing doing nothing. I try to stick to describing it as time on the job and off the job since that's the issue at hand. Time with family can be an emotional subject for people so for me at least framing it in terms of numbers was the best way to try and show exactly how unfair this was",
            "If I were you I'd end up making up a story that my dog had diabetes and needed shots 2 times a day.  \nThey will never see your point. \nBut - this seems like it is about workload- not hours. Dont talk about childfree, etc.  Just be like \"geez, this work doesnt seem to be distributed evenly. Can we fix that?\"",
            "Well, you could tell them that you use your free time working for a 2cd amendment rights organization.",
            "I keep trying to explain the same thing to a sibling that it's not up to her to take their workload just because she doesn't have kids. Just because you made a different personal life choice doesn't mean your workload should be slanted.",
            "First off, I just want to give you a hug and say this situation sucks and there may not be an easy way out.\n\nMy advice how to talk to them. Do not make a logical argument or appeal to general ideals, people do not make decisions based on logic, they make decisions based on emotion. What this means is, if you want to change their minds about this, appeal to them on a personal and emotional level. Tell them a personal story about a time you worked late and you felt bad. Ask them about their experience with too much work. Basically, make them feel why this sucks for you. That's the way you will make them understand.\n\nThat being said, they may not. If they don't, then definitely follow the advice of the top commenters. Good luck",
            "Next time they say you can take on more due to your child free status cry and say some shit about how it's not your choice and the lord had other plans for you or elude that it's not your fault that you can't have kids or whatever so every extra job they give you reminds you that you're a \"failure as a woman\".  Then cry more.   \n\nI bet you might even get less work from them for this move. ",
            "Instead of going up to your boss and ranting about how unfair this is, think of a way to approach her (I am assuming the principal is a she for now) in a way that a boss can understand/care. What do most bosses care? Quality of work. You are a human being, not a robot. If you body and brain is fried after working x hours and working a lion share beyond that x hours affects the quality of your work, she will pay attention. If you use an angle that the other person cares about and offer reasonable solution, the conversation may be more fruitful. It might also be helpful to use past metrics as your calculation (ie. Amount of work to in to yield certain results) to back up your discussion. Bosses love metrics. Be respectful and pragmatic. ",
            "Read your update. Sounds like you handled this as well as any human could have. Well done sir.",
            "\"You, coworker X-- would you say your kids are worth the extra work that they require of you?\"\n\n\n(Coworker X affirms)\n\n\n\"And you believe this extra work your kids require means you have less time for your union-contract obligations?\"\n\n\n(Coworker X probably affirms)\n\n\n\"You work harder to care for your children-- but you are rewarded by the good things you feel for having them.  I don't have that. If I pick up the slack for you at work, I still won't have that.  I have made a sacrifice in not having children so that I can have more free time-- and the good things I feel about my free time are as important to me as your children are to you. I will not waste that sacrifice by wasting my free time. (Or: It is not fair for you to force me to give up my free time to you).\"\n\n\n(If coworker x didn't affirm question 2...)\n\n\n\"I think you understand then why this schedule doesn't work. Let's try and fulfill our work obligations equally. \"",
            "Yes, please go to your supervisor. They will NOT care what you have to say. I... As a 34 year old childfree married woman, this made me see red. You could tell them until you're blue in the face that you have a family, too, but they wouldn't care. I hope this is resolved easily. I wish you luck.",
            "Go into work next week and put framed pics of some kids and a lady on your desk.  Show your coworkers your new family. Problem solved.",
            "Tell them that you would but you need time to spend all your extra money.  Maybe they will get the point they don't control you and are not superior due to responsibilities. ",
            "It blows my mind that someone would think this is a rational idea.",
            "You need to go to the headteacher and/or union.  This is utterly out of line unless they are willing to pay you more for those extra hours.",
            "You've already talked to them. Go over their heads to the principal or the union rep. This isn't fair to you.",
            "I think there is a big difference between telling you that you have the duties and politely asking you. And if they are asking you, they should offer you something in return. Will you work late on Wednesdays and I will take your Thursdays? The sad part is what if you wanted to have kids and couldn't conceive? (I know this is not your case, but it could be) They don't know the whole story so they shouldn't be making statements like this,",
            "Lets discriminate against the childless employees, cool ! high five ! Why we never thought of this before ?  \n\nAssholes !!!",
            "I suffer this at work and I'm a teenager, (same argument \"we have kids and you should work more despite being a student) talk to your manager or head or school.or even the government of that school",
            "Do they want you to ride in the back of the bus on field trips too?  Jesus Christ.",
            "Do you get overtime by staying late? ",
            "Tell them you've adopted on short notice and therefore you shouldn't have to do this.",
            "As far as they're concerned, you don't need to be home at a specific time. You don't have dinner to make, kids to feed, diapers to change and laundry to do. As far as they're concerned,  your job ends when you get home and theirs does not. They have 'more responsibilities' and cannot stay late, whereas you have 'no responsibilities' and therefore when push comes to shove, you don't have to be home on time. \n\n\nTelling them that you think this is unfair implies to them that your 'free time' is more important than their 'responsibilities'. You do not see it this way, but they do, and it will be very difficult to convince them otherwise.  \n\n\nTeaching involves a lot of politics with other teachers and I agree that you should try to fix this socially before you go above their heads.  Try to make them see that, just because you don't have kids, doesn't mean you dont have a family. Convincing them that your time with your husband is as important as their time with their husbands and kids will be almost impossible, but you need to at least try. \n\n\n\nBefore you go above their heads to the union/etc, talk to them and let them know.  \"I'm sorry,  but I can't take on 50% of the work load when I should only have 20% (or whatever amount based on the group size). My time is just as important as yours, and if we don't agree to something more reasonable, I will bring this up with (whoever). This workload is excessive and well outside the union limits. Now, let's work something else out.\"\n\n\n\nRemember, there is no doubt in their mind that your free time is less important than theirs.  It's about being willing to bend and compromise, but also letting them know that you *will not* take on the whole workload.",
            "They are absolute correct you don't have kids so you should be be to take on a bigger work load. But, only if that is sanctioned by the powers to be, includes more pay/benefits. Do you HAVE TO?  Nope!  And if they believe that having a kid is a ticket to a lazy shit then go above them. Hit up your union rep. Inform the principle. And flat out refuse to do anything above and beyond what's in your job description. ",
            "Child-less HS teacher here too.\nBeing child-free doesn't mean you have more free time, less responsibilities, not enough work to do, or that you are any more capable of running your life without children than they are.\n\nConsidering you have a good relationship with these women and that they ALL decided collectively to add more to your workload, they might have wrongly assumed that their good relationship with you backed up their decision.\n\nTry to speak with each of them individually (casually, because teacher mamas/pregnant are scary fierce) to hear the what and why in person. It might diffuse some of the myths of being child-less and would be better than public shaming. If that doesn't work, discuss it with a higher up, probably the principal before union rep, that way they are informed and if they can offer some guidance on how to deal with your colleagues. If it escalates, take it to the union rep.\n\nEDIT: accidentally deleted a sentence and re-added it.",
            "If you do more work you should get a portion of their pay. Children would never be a responsible excuse for not getting your shit done where I work.",
            "If they didn't want to work huge amounts per week they shouldn't have become teachers.",
            "What they are doing is illegal.  You have full valid rights to go to HR or your Union.  However I've been in education before and let me tell you 2 things first:\n\n- It's likely that in your field at this school it's an expectation that childless teachers cover the after hours things more often.  This is likely to be considered part of good team work and that if you had a kid some day then you'd receive the same consideration. Their point of view is that it's not their fault that you don't plan to have kids.  It doesn't at all mean they are right but I'm explaining why they don't understand your concerns.\n\n- When you go complain to your Union, no matter how carefully the union handles it, you will be perceived by the staff as a non-team player.  You'll be excluded and shunned.  You'll be examined under a microscope so heaven help you if you ever make a mistake at work.  \n\nYou sound a little clueless about the realities of the work environment.  You are right - it's unfair but be prepared to look for a new job when you report this.  They can't legally fire you but they can legally make you an outcast, gossip about you and make your job really unpleasant for you.  Life isn't fair.\n\nSo sorry and best wishes!  Maybe it will turn out better for you than my predictions but be prepared for the worst case scenario as it's pretty common.\n\n\n\n",
            "But they don't respect you.",
            "These people sound lazy and entitled. I'm a parent, and this sort of parent vs. childfree work division would never even cross my mind. Everyone needs to pull their own weight, and as long as everyone is doing an equal share, it leaves absolutely no room for argument.",
            "Free time isn't really \"free\" -- it's YOUR time. Of your coworkers chose to fill their time with thier kid it is their choice, but they have no right to assume your time is any less valuable. Stand your ground, and keep a strong boundary.  They have shown they will keep pushing this issue, you should not give in.",
            "[deleted]",
            "Women, moms more so, feel so entitled. To the point that they can't even comprehend where you're coming from. I suggest to go straight to your superior and deal with it that way. You tried talking to them about it and it led you nowhere. If anything it all did was make them talk shit behind your back.  ",
            "Here's what you should try to determine: is it YOUR MANAGER who is the problem here? Or the other women?\n\nWhat I have noticed as a woman with children is that opportunities and work have been on occasion taken away from me without my consent because my managers just assumed I wouldn't want/be able to do the work. I have talked to many other working mothers who have had similar experiences. I wasn't asked to go on a work trip to the FRENCH RIVIERA last year because I have a 4 year old and people assumed I wouldn't want to leave him for 5 days. Hey, I'd miss him, but I really would have liked the option to say yes or no without this paternalistic assumption that mommies can't do work trips. (And HELL YES I would have gone!) \n\nAnyway - Just make sure you understand who is at fault here before you start to shoot it up the ladder. It sounds to me like most of this is on your boss's shoulders, not the other women you work with. ",
            "Only read title---\n\nWhat you have described is called discrimination. Do not be afraid to use this word. Good luck. ",
            "I wonder if your co-workers realize their attitude is hurting gender equalitity. It's nonsence like this that keeps the wage-gap in place.",
            "How good of an actor are you?  Call them all together and explain to them that you desperately want children but you're biologically unable, and that when they tried to schedule you for more work they just reminded you that you'll always be a lonely childless woman who's got nothing to make her happy but her job.  Blah blah blah, fake some tears, boom, you'll be able to do whatever you want at work for the next few years without them saying a word.  Try to throw in some shit about fulfilling your purpose as a woman to really sell it.",
            "As long as you're getting paid more.",
            "[deleted]",
            "Hey, I used to teach hs math! What subjects? I might have some of my old material on a flash drive. I taught honors geometry and on level, same for algebra 2. I might have some old algebra stuff. Definitely saved calc ab material    \n\nOnly one thing to do- tell them which equally divided subjects you will do, and which will have to be don by someone else. Hell, pick your favorites of the list and dump the rest. No one gets into teaching expecting to spend a ton of time with their families. Just keep refusing to work with this unfair plan over and over. Let THEM escalate it and explain their reasoning. Just e sure to get it explicitly referenced in an email ahead of time. \n\nAlso, your working relationship with these women is likely over. You are probably going to have to join a new team. Expect next year to be heavy on geometry or algebra 1.  That, or a new school for you. \n\nUnless your dept head is doing a ton of work with documenting failing standards and that crap this year, she has no justification for contributing nothing to the list. ",
            "Tell them you have obligations that don't allow you to work extra hours. Like taking care of a sick relative or living your life.",
            "I'm not suggesting you wuss out and not do anything, but know that this is going to seriously affect your career at this school. They're already crazy/shortsighted enough to think you owe them more time since you have no family at home. What do you think their reaction will be when you \"run\" to the principal and/or the union?",
            "Take em' to the cleaners. They are promoting patriarchy and inequality in the workplace. Sue their asses. ",
            "That title is so fucking confusing",
            "[removed]",
            "What's your point. Life's not fair. If you have less responsibilities outside of work and your co-workers know, they are going to expect you to take on more work responsibilities. It's just like how the 30 y.o. single mother recent college grad is paid more than the 22 y.o. childless college grad. Or how the incompetent 50 y.o. with 4 kids is paid more than the 35 y.o. doing all the work. Don't you live in the real world? Why do you think you are entitled to \"fairness\" when nobody else is?\n\nedit: fixed typo",
            "[removed]",
            "[removed]",
            "It doesn't matter that you're childfree that's not all that special, no more than simply not having a child in terms of how this plays out here at your workplace. Do keep that in mind.  It's becoming like people who have to tell you about smoking weed.",
            "I get this is a touchy subject but why bring this matter up as \"child free?\" Instead of getting solid job advice which is what you need.  I would repost this under ask HR and take out any child free reference.  This way you will get unbiased advice."
        ]
    }
]