[
    {
        "post_id": "59lvdu",
        "author": "yellowwallpapered",
        "title": "UPDATE: Me (F27) with my fiancé (M31) (7years). We are getting married this fall, and the closer it gets, the more I am considering cancelling the wedding.",
        "url": "https://www.reddit.com/r/relationships/comments/59lvdu/update_me_f27_with_my_fiancé_m31_7years_we_are/",
        "score": 2091,
        "num_comments": 133,
        "created_utc": 1477538183.0,
        "selftext": "Link to original: https://www.reddit.com/r/relationships/comments/4jn78l/me_f27_with_my_fianc%C3%A9_m31_7_years_we_are_getting/\n\nTo recap my previous post, I was considering cancelling my wedding because of my dislike of attention, and my insecurities about my personal appearance. I loved the crafty aspect of wedding planning, and the idea of celebrating with family and friends, but my self esteem is very, very bad and I was convinced that I would look terrible and embarrass myself and my fiancé with my appearance.\n\nFirstly, I'd like to report that I'm no longer engaged...because I went through with the wedding and got married this past weekend! It was easily the happiest day of my life and I have no regrets about having the wedding. My husband (!) was really supportive through the planning process and was very reassuring and helped me calm down when needed. \n\nI did hit a few snags (I DIY'd everything from the table runners, to the centrepieces to the flowers and although I pulled it off, omg was it ever stressful), but once the day got underway, I relaxed and had an amazing time.\n\nThis may go kind of against the typical r/relationships advice, but the best thing that I did was to just suck it up, and make myself do it. Basically I used the 'fake it till you make it' approach. I got an amazing dress, and got ready and had my hair and makeup done with my bridesmaids the day of. I was nervous but having them there with me (and a few glasses of champagne) really helped calm my nerves.\n\nOnce I started down the aisle and saw my husband, nothing else mattered. He thought I looked amazing and I felt amazing and it was a perfect day with our family and friends. Did I look perfect? No. Did it matter? No. I had a blast, and if I hadn't gone through with the wedding, I would have always regretted it. I know that weddings aren't for everyone, and that's ok, but I knew deep down that it was what I wanted. I'm so, so happy that I didn't let my insecurities prevent me from having an amazing day and marrying the love of my life with those I love present.\n\nTL;DR: I swallowed my insecurities, went through with the wedding, had the best day of my life, and married my best friend :)\n\n",
        "permalink": "/r/relationships/comments/59lvdu/update_me_f27_with_my_fiancé_m31_7years_we_are/",
        "comments": [
            "I am a huge fan of fake it till you make it, I carry it with me everyday. Congratulations Mrs, all the best to you and your DH for the future.",
            "Hey, I remember your post! Congratulations, I'm happy for you that you overcame your doubts and enjoyed yourself, because I personally think \"perfection\" at weddings is way overrated, it's a time to celebrate and have fun. And you know, nothing makes a person look better than happyness!",
            "Okay, I lurked you and found your post with the picture of you from your wedding. You are sooo beautiful! All your worries about looking like a giant monster are completely in your head. You are so feminine, you have lovely curves and luscious hair and an adorable smile. You sound like a catch to me! I am saying this as a hetero women not someone being creepy. I genuinely think you are gorgeous. Im telling you this because I too have struggled with depression, anxiety and feeling ugly and self worthless. You're not alone and by far are not any of the things you called yourself. I'm so happy you were able to push through and enjoy your day. You rock! ",
            "Congratulations to you and your new husband. Wishing you both joy in your new life together.  \n  \nWell done on overcoming your fears. I felt similar leading up to my own wedding but as you said, once you see your husband to be, nothing else matters. :)",
            "Golly let me vent for a second....when you type \n\n>I am no longer engaged \n\nMy heart fucking dropped. I was like HOW!!\n\nDon't do that you evil lady.......\n\nWish you the best though:)",
            "> Firstly, I'd like to report that I'm no longer engaged...because I went through with the wedding and got married this past weekend!\n\nI didn't even see your original post, but this line still just about gutted me! Congrats on your successful wedding, and the wonderful new husband!",
            "This is a fantastic update! Were you able to find a therapist that worked fir you as well? ",
            "Oh wow, I went the DIY route for my wedding too and let me applaud you because I love crafts and make stuff everyday but my wedding was *insane*. I did everything from invitations to placemats and whew, girl you are awesome! Congratulations!",
            "[deleted]",
            "Just wanted to let you know that you're a beautiful woman and you looked lovely on your wedding day (I snooped the post history lol). Also, that dress was gorgeous! Work it, girl!\n\nI'm happy that you could fake it, you definitely made it. And I'm also happy for you that you were strong enough to follow your dreams. Best of luck to you and your hubby!",
            "Congratulations! Wonderful news that you went ahead and got married, and also that you were able to stay on top of your insecurities in the end.\n\nIf you haven't already, you should still consider finding a therapist. Insecurity can raise its head from time to time and it will still help to talk it through with a professional. It will also help to talk through your victory with them in order to investigate and reinforce whatever handling mechanism was working for you.\n\nBut right now, enjoy being married and being loved by the man of your dreams! Glad to hear things have gone so well for you! :)",
            "Congratulations, hope you will look back at this with pride and joy  in 25 years and are still happily married!",
            "Congratulations! This made me so happy!",
            "This update is truly awesome. Biggest Congratulations on all counts. Overcoming the obstacle of damning anxiety has hopefully given you that major boost in confidence in yourself and your beauty that you really needed to feel.\nAll the best, OP. Stay happy, and keep glowing.",
            "That's great to hear. We did a very DIY wedding ourselves, so I totally know how crazy things get (I didn't even get time to shave before the ceremony), but damn is the payoff worth it.  \nI found that after all the madness of the wedding was over, I had a bit of a comedown, so maybe plan some things for both of you to do together in the coming months.",
            "I can't tell you how happy I am to read this update - your first post really resonated with me and made me feel so sad, not least because I've had similar thoughts (to varying degrees) about myself - but it was such a shame to see someone else wrestling with that negativity. Your 'no longer engaged' made me catch my breath (damn you!) but I was delighted to read the rest of your post. Thank you for updating, and I'm ever so pleased for you!",
            "Wow, I teared up just a little bit reading this update. I'm so proud of you, OP! It's so easy for people with anxiety to sabotage their own happiness, but you exhibited great personal strength and didn't let that happen.",
            "What a wonderful update! Also, I peeked at your submissions and you are beautiful! Gorgeous dress too!!!",
            "Congrats OP!! All the best to you and your hubby! \n\nIt's amazing what the right outfit, makeup and hair do for one's confidence. Stick with the makeup thing. It's a lot of fun if you like DIY stuff. ",
            "Awww..... I love a happy update.  Thanks for sharing. Congrats!",
            "I creeped on your posts and found your wedding picture. You're so cute! Of course your husband thinks you're beautiful, there's no reason why he shouldn't.",
            "Congratulations!  I remember reading your original post and hoping you'd see it through :)",
            "Awesome!! I'm so happy to see a wedding go on and go well! It's easy to get jaded in this world and this sub in particular. Cheers!\n\n\n\n",
            "I remember your post, thank you for the update ! And such a lovely one too. I'm so happy to hear you're married and that it was a great day you'll remember happily ! Your husband sounds pretty cool too.\n\n\nIn terms of your insecurities and bad self-image, I don't know how you feel about that now and what steps you've taken or are taking to get better on that front, but hopefully remembering how well this day went will help you face your fears in the future. It's pretty good evidence that your appearance and how you feel about your appearance aren't inevitable laws of the universe, but are very context-driven and other people don't necessarily see you as negatively as you see yourself.\n\n\nEnjoy married life !",
            "I love this.  Congrats!",
            "Awwww this post made me tear up. I guarantee you looked beautiful and your now husband thought so as well. I'm so happy for you OP, keep up the self love! You deserve it as much as anyone else. Congratulations! ❤️",
            "I spend half of my life faking it. Good for you on conquering that!!  Major props.  \n\n",
            "Congratulations! I hope you and your husband have many happy years together.",
            "Congratulations!  I am so happy for you and also, strangely proud. I remember reading your first post and remember wishing I could just give you a great big hug. I also suffer from Depression and Anxiety and although I mostly have both conditions  under control, I remember those feelings of worthlessness and it sucks. Good for you OP! I wish you all the best and hope you and your new Husband have a very happy future together  \n\nEdit: Also thanks for coming back and updating us!",
            "So happy you went through with it! As I was reading the \"I'm no longer engaged\" part I was like .... aww.. :( and then it turned int AWWWW! :D\n\n>This may go kind of against the typical r/relationships advice, but the best thing that I did was to just suck it up, and make myself do it. Basically I used the 'fake it till you make it' approach. \n\nJust wanted to say that I have to admit, this usually helps me when I'm dealing with my own depression anxiety. Sometimes it's literally the best thing I can do to get through it because when I just suck it up and force myself through something, I end up having a great time that I would've *hated* to miss out on! (obviously the context of what I'm \"faking it\" through is quite relevant but if it's all down to me just being worried about feeling uncomfortable/self-conscious/etc., I usually just suck it up and tell myself that it's all in my head!...and it usually is! hah) \n\n> (and a few glasses of champagne)\n\nBubbles can usually get you through anything I find! haha\n\nCongrats on your marriage! Wish you and your husband many happy years together ahead :) ",
            "I remember you, congratulations! Also, I had to make a comment to say that I absolutely love your username! Good luck in your future life, I hope all works out for you :) ",
            "Awesome. I'm proud of you.",
            "I was rooting for you OP! Congratulations ",
            "This made me tear up.  I'm so glad everything worked out - it sounds like it was perfect!",
            "> Once I started down the aisle and saw my husband, nothing else mattered.\n\nThis is exactly what I would have advised you. Be the bride, and you *will be* beautiful. If not to everyone, at least to everyone who matters.\n\nI'm glad that all went well for you.",
            "Congratulations!! Fake it til you make it is an essential part of a successful marriage. ",
            "Good on you! I did not see your original post until I just read it and I hope this experience gives you good reason to doubt all those voices in your head that are so mean to you.\n\nHere's what I do when I get down on myself and thoughts broken record thoughts of how I'm ugly, fat etc start playing: I stop myself and say: would I say what I'm saying to myself  to a friend? If the answer is no, then I stop. And try to find something nice to say to myself.\n\nBottom line is you are creating these insecurities when the truth is, I'm sure everyone at the event loves you for you and that is really all that matters. You should love you for you too. Sounds like you landed a pretty awesome guy and he thinks you rock. So you must rock!\n\nGlad your day was awesome!",
            "Bless you and congratulations! I nearly cried reading your original post because you were so down on yourself. No one should ever feel like that. I wish you all the best in your future! ",
            "Hey, congratulations!\n\nMay you have a happy and blessed life with husband.\n\nTrue Love and true grit, for the win!",
            "You did the right thing for yourself (sacking up) and for your husband. Weddings are about way more than the fancy fanfare and decor. You're saying to your family and friends... This is my person. To your husband..  You are my only person. See you had fun didn't you? These are awesome memories and you'll have the photos to show possible future children. ",
            "Wonderful! Congratulations! \n\nI had a therapist when I was 16 who taught me \"fake it 'til you make it\". It's a lifesaver.",
            "I remember your post - I'm so glad your wedding went well. Congrats to you and your husband!",
            "I just LOVE you! I just creeped on your wedding dress and bridesmaids gifts and then I read your original post. Now I'm choked up because you are so hard on yourself. You are so lovely and your partner is lucky to have you! Xo congrats.",
            "Not to make you uncomfortable, but I looked through your post history to see if you posted a photo from your wedding day. I'm happy to see that you did! \n\nAnd I honestly don't know what you're talking about when you say you're \"not an attractive person.\" You looked beautiful in that photo!\n\nYou are a beautiful person and you were a beautiful bride. I'm SO glad your wedding day was enjoyable. ",
            "I remember your post!  I am SO GLAD you went through with it and had a great time.  Congrats!  ",
            "That...was a very different update than I was expecting to read.\n\nIn a very good way! Congratulations OP!",
            "Congratulations! I just read your previous post and I just want to say that you have no idea how many girls would LOVE to be as tall as you. Embrace it! ",
            "So happy you did it!! Congratulations!!",
            "OP, this brought tears to my eyes. I bet you looked incredible on the day, and every day, and I'm so happy that the day went well and that you had a great wedding!!",
            "This right here, this is a good update."
        ]
    },
    {
        "post_id": "8tnqo8",
        "author": "StanBurgerMan",
        "title": "My [41M] family [71F, 42F, 40F] are trying to shame me into giving them money, after years of alienation",
        "url": "https://www.reddit.com/r/relationships/comments/8tnqo8/my_41m_family_71f_42f_40f_are_trying_to_shame_me/",
        "score": 2092,
        "num_comments": 658,
        "created_utc": 1529901262.0,
        "selftext": "Thanks up front Reddit users for reading my long-winded background.\n\nI've always been kind of the goat with my family, and by that I don't mean \"greatest of all time.\" I mean my family always kind of looked down on me and held me to unreasonable expectations. I think it's because other than my dad, I was the only male in the house. I didn't get any special consideration for being the youngest (not that I'd want any), and anyway that was rendered irrelevant once my youngest sister was born. She was sort of the golden child throughout our childhoods, but my oldest sister also had special pride of place for being the oldest kid. I was the middle kid and even though I'm male I got hand-me-downs from my sister as long as the clothes weren't too effemimate. As an adult I can see how that's practical and moneysaving, but as a child it was embarrassing and also hurtful to see your sisters constantly get new clothes and new bikes, while I had to wear girls' clothes and ride hand-me-down girl bikes. Interestingly my younger sister never had to wear hand-me-downs from my older sister.\n\nMy mom and sisters pretty much had an easy life while my dad was alive because they just rode him all day long and henpecked him until he died fifteen years ago from a heart attack. He was only 58. Growing up sometimes my dad tried to do special guy things with me but my mom shamed him into stopping it.\n\nI just don't get it, why my mom was always so cynical and negative toward me. My hair was always too long or ugly, I was too skinny, then when I started working out in high school suddenly I was too muscular, then I was too tanned, then too pale, my grades weren't good enough, then once I got into a good school for college, it wasn't \"that good.\" When I earned my degree in business, I was a \"wannabe businessman fast food employee,\" when I got into graduate school for an MBA, it was a \"stupid idea,\" (not like I asked anyone to help me pay for it), etc. Why do you dress like that? You look dumb. Why don't you own a house? Your car is old. No one will respect you.\n\nYou know how that goes.\n\nI worked and earned my own pocket money starting at age fifteen with a job at a fast food restaurant, so that's why they all picked on me for working fast food. Eventually I became assistant manager of the restaurant at age twenty one, when I was almost done with college.\n\nMy sisters would often mock me for working in fast food, and my mom would too. It wasn't gentle ribbing or teasing, in a loving way. No. It was spiteful insults, trying to hurt my feelings and make me feel small. Speaking of feel small, I'm really tall (6'5\") and they also made fun of me for never trying out or being good at basketball or caring about any other sports.\n\nWhen my dad died he left everything to my mom, which is to be expected, including the house. He left me and each of my siblings ten thousand dollars just as some extra money, on the assumption that my mom would leave the kids everything equally upon her own death many years later. I already knew back then that my mom wouldn't leave me much, if anything, compared to my sisters. My sisters continued to live at home, but once I graduated college I moved across town to my own apartment. They weren't sad to see me go. I've been living on my own ever since. It's been going on almost twenty years now.\n\nI grew up in a rather large house (this was Kansas, where it was possible for a normal dude like my father to own a big home), so when my sisters got married, their husbands moved in, too. Their husbands are both college educated guys but I could tell they enjoyed the idea of not having to pay for their own house or any rent. My dad had built a small guest house behind the home which he always told me would be mine when I grew up, but after he died I could tell my mom had the place earmarked for her daughter and future son in law. My older sister and husband stayed in my former room in the big house.\n\nWell, whatever, right. I had my own thing going. These days I'm regional manager of a mid-sized restaurant chain (not fast food, but close haha) and although I'm not rich, I live quite comfortably. I could afford to put a downpayment on a house but I like the easy freedom of having an apartment. At thirty, I married my long-time girlfriend, who my mother and sisters always hated because she was Jewish and also eight years older than me. \"Your girlfriend is too old! She will never have a baby!\"\n\nWell, none of them came to my wedding even though they were invited. We actually conceived a baby but my wife miscarried. My mom and sisters found out about it and rather than express any condolences at a woman who just lost a child, my mom and sisters treated me to unsolicted \"I told you so\" and didn't send my wife so much as a card.\n\nI love my wife, and since we don't have kids, we have French bulldogs. We live in a big bungalow apartment with a yard for them, so whatever. My family mocks me for that, too. Like I'm not a man, because I don't have kids.\n\nIt's not like I accuse my sisters' husbands of not being men because they live in their mother in law's house. Everyone does their own thing.\n\nMy wife's family is somewhat successful in the furniture business and they're a lot nicer to me than my own family. My mother and father in law offered to buy me a new car (I drive a 2000 Honda Accord which is still in mint shape) just this year but I said no thanks, and they seemed to be impressed that I didn't accept gifts.\n\nWell, after all that background, finally my point.\n\nIt seems my sisters and their husbands have had all sorts of business schemes and tried to open their own yoga studio, because I guess my sisters are into that stuff. Sort of the whole \"Gee, I like coming to yoga class, so naturally I understand business economics and should open my own yoga studio!\"\n\nPersonally I thought that the kind of boutique, expensive yoga studio they had in mind was more of a Manhattan or Beverly Hills thing and not a small town thing, but whatever it was none of my business, they never asked my advice, so I never said anything. Plus my sisters' husbands both fancied themselves business savvy (one of them sells insurance, the other works as a new accounts person at a bank) so it's not like my counsel was ever needed.\n\nOf course they failed, and spectacularly so, and my mom foolishly put her house up as collatoral for the business. I'll admit that in a petty way I felt a bit of schadenfreude but overall I was upset especially because both of my sisters have small children (there are nine people living in my old house now).\n\nNow the bank is threatening to take over their house if they don't come up with a certain sum of money.\n\nIt's a lot of money, but money that I happen to have, and they know it.\n\nThey all approached me with appeals (by phone message and TEXT--they've always known where I live but have NEVER once come to visit me) to how I should be a good brother and son and how \"this is what my father would have wanted\" and all that. Neither of my sisters' husbands have said a word to me about it and I doubt I'll see one penny of my money back if I \"loaned\" it to them.\n\nMy mom especially has been laying it on thick about how she's an old woman and will be cast out of her \"familial home\" and all that. She's even gone so far as to hint that my \"rich Jewish wife's family\" can pony up the dough.\n\nI haven't yet returned any of their calls or texts yet.\n\nI'm still thinking about how they all always have a big Christmas party every year and never invite me or my wife, partly because they don't like me, and partly because they don't like the \"Jew.\" I know that if I confronted them about it they'd say \"you're family, you don't need to be invited, just show up,\" but I know DAMN WELL they don't want me there.\n\nMy wife says it's up to me whether I want to help or not, but she also says that there is power in mercy.\n\nI don't know, though. I think she's bigger than me in that way.\n\nI'm looking for some outside perspectives on what to do here.\n\nThanks for any advice, Reddit!!!\n\n\\---------\n\n\\*\\*TL;DR: my family has always been mean to me. Now they need money and want mine. What to do?\\*\\*",
        "permalink": "/r/relationships/comments/8tnqo8/my_41m_family_71f_42f_40f_are_trying_to_shame_me/",
        "comments": [
            "Ignore their pleas for money.   They have no use for you except as a means to continue the life they have always led...without you.\n\nYour wife is a goodhearted person but all your would get would be insults and more begging.",
            "Ask yourself: \"If i was in trouble with money, would they help me?\" \nIf the answer is no then you know what to do.",
            "You and your wife are kind, decent people. To even be considering this bail-out is a kindness that your “family” does not deserve.  Please don’t give them a dime. There are 5 grown adults living in that house. They are the ones who blew a secure future on a whim. They’ve done nothing but treat you with disrespect and contempt for your entire life. Giving them your money will not stop that. Coming to their rescue won’t make them see you in a different light. They’re horrible people. ",
            "don't help them. whatever you do, just don't. imagine actually helping them? they're going to continue using you because they know you'd be easy to fool. don't let them guilt trip you. the fact that they're using your fathers death saying \"he would've wanted this\" is SO messed up. \n\nthe things your mother and sister have said are horrible and the fact that they didn't come to your wedding or said much about your wife losing a child, shows how awful they are. they don't deserve your kindness or money. \n\ni honestly think you should text them, \"hey try working at a fast food place\" and ignore them.\n\n",
            "Nope.  Not even comforting you/your wife after a miscarriage?  Never inviting you to family gatherings?   Making antisemitic comments about your wife?  That’s not family, and you don’t need to give them a dime.  ",
            "Give them NOTHING, OP. They have neither earned it, like you have, nor have they been the best family members to you. \n\nI am (also) the scapegoat in my family, and was treated almost identical to how you were growing up. \n\nI'm getting a degree in Engineering and my Gold Child brother works in a casino dealing cards, but my mom has made it VERY clear that she loves my brother more than she ever could love me. \n\nThey disrespected you your whole life, ridiculed all of your amazing achievements, never accepted your wife and had you started a family (I am so sorry for your loss, OP) they probably would have shunned that child too. \n\nIs this really \"what your father would have wanted\"? His only son made to feel horrible about himself, and his personal choices (from what college he went to, to who he chose to love), and at the mercy of 3 vindictive women? \n\nFrom what I know about your dad (who seemed to love you, even if your mom pushed him around) from what you put here, the answer would be NO. \n\nThey did this to themselves, you are already not part of the family(they've made that VERY CLEAR), and thus, this is not your problem. Tell them to kick rocks. Not your circus, not your monkeys.\n\nGood luck, OP, stay strong. You are an valuable, amazing human being, who did amazingly well for yourself and your adorable little family unit, despite your rotten Family Of Origin's bad influence and discouragement. ",
            "This would be a no from me. \n\nFirstly because they are horrible and have thrown away every chance to have a relationship with you ran your wife. \n\nSecondly because it is almost always a bad idea to lend family/ friends money. It will not end with a happy family and regular holiday get togethers.\n\nFinally because there are four adults who could have been out there working (possibly even for a fast food company...) to pay for the home they enjoy the benefit of. If they can't work, they can't have nice things.",
            "It would seem that there are 5 income earners in that house sharing the expenses.  If they cannot come up with a plan to keep the house with 5 incomes, they certainly will be unable to reimburse you.  \n\nIf they are expecting a gift, that is patently ridiculous as they have 5 income earners in that house. I understand your egg donor is 71 but I also know that almost every McDonalds restaurant is looking for daytime help.  ",
            "Tell them that in exchange for all their kindness and support they've shown you over the years, you'll certainly give them the help they deserve.\n\nThen give them nothing and ghost them. Fuck those people.",
            "Your family does not sound like they would be grateful for your help, rather they seem to believe they are entitled to it. From the details in your post it sounds if they have spent years alienating you and turning their nose up at your life, your wife and your worth ethic, but they seem eager to now benefit from it. You already know that if you give them this money you will never see it again, and you know they will not change their behavior. Your wife is well meaning, but you know the toxicity of your family first hand.  There are 5 adults in that household that can work and come up with a means of either saving the house or finding other accommodations.  Your money would  only enable them to continue on their path of bad financial decisions.  \n\n   I am glad your wife's family is good to you both. Your time, money, and affection seems better served in that area of your life. ",
            "Dude, your family HATES you. I'm sorry, but they do. They've been showing you this all your life. Even now, when they're staring disaster in the face, they can't even pretend to be nice to you long enough to get the money. \"Rich Jew family\" - that's horrible. Really horrible, and they're saying it to the people who have the money that's meant to save them? No. Unless you want to reward them for a lifetime of hatred, and guarantee that they'll keep hating you forever, DON'T DO IT.\n\nETA: Sorry, I've just read the bit where your wife lost a child and they're still horrible. DO NOT give money to these people. How would your wife feel, if you gave cash to the people who've been shitting on her your entire marriage? She'd decide that their opinion was obviously more important than hers, and she'd have cold hard evidence to support that. You're in a marriage. You're meant to be on a team with your wife, not with the people who have tried to destroy you for your entire life. If not for yourself, stay strong for her sake. ",
            "So your ‘family’ mocked you as a child and robbed you of your rightful inheritance and then have the audacity to ask not only you, but your wife’s family to pay for their failure. My blood boiled just reading the lack of shame your family has. There is power in mercy assuming the people you are showing mercy to have some shame, but your siblings and Mother have literally no shame. Why else would they beg you for money? Do not give them a dime. \n\nYou’ve done the hard part by escaping them, and you seem to have built a happy life, which is great. So don’t ruin it by giving into them and letting them back into your life. Like you said, you will not see a penny of it back if you loan it to them. It’s a lose-lose situation. \n\nHonestly, if anything, I would be very petty and I would take this chance to mock them, and I don’t consider myself a vindictive person. But after abusing and bullying you for years, they expect you to bail them out?! Fuck them. Your life will be infinitely better without them.  ",
            "What have your sisters husband's been doing with their paychecks since they weren't paying rent? \n\nThe whole lot of them are moochers. Say no and put your foot down ",
            "Their treatment of you is awful. I hope you see that. I hope you're able to get counseling to grieve the loss of your dad, and of being so ignored as a child. You deserve time and space to get support for your family rejecting you.\n\nYour resentment is clouding this issue. You're looking at this like you finally have power over them to either give or withhold love- in the form of money- that you didn't receive. You are imagining that they need you and you can save them. Perhaps that they will even be grateful and invite you in to the Christmas party and to the love they share between themselves and to the family home. Well, no. No amount of money will buy affection. These family patterns are too deep. You resent their closeness and they in turn resent your success and independence.\n\nSo try to separate. Would you give the money to support your mother in retirement? Would you gift it with no reciprocation? Would you buy the house outright and ask for rent? Would you evict if they never paid? Would you have invested in the yoga business? Why invest now, when they've put everything in what you knew to be a losing investment?\n\nConsider why they're in this situation. Why is a household with 5 earners and no mortgage in dire straits? Haven't the husbands been saving for years? If they love the living situation so much, why don't they pitch in? What other options are available?\n\nKeep in mind that begging to you via text and calls costs nothing. They got everything they wanted from your dad with similar tactics. Begging, if you have no pride, costs nothing. It is cheaper and easier than taking out a HELOC, pooling all resources, getting a job, or dipping into savings. So to you, it seems like the last thing before the bank repos the house. But maybe not! You don't know. And you're considering giving your money emotionally without being in a position to explore all other options. That's their work. But don't let guilt drive the decision without knowing all the facts.",
            "They’ve made their bed, now let them lie in it. Do not feel guilty, or bad for a second for saying no.! They have treated you horribly & no matter what you do it will never be enough. Save your hard earned money for your beautiful wife & peaceful life. ",
            "They are antisemitic bigots and you tell them to pound sand. Your wife has a kind heart but nah, son. Nah.\n\nGo no contact and stick to it. These horrible people bring no joy to your life. If you want to give your wife a reason, tell her exactly what I said.  They see you only as a chequebook and not as a beloved son or brother and you have no use for it anymore.",
            "5 income earners fucked it up that badly? I wouldnt trust them with monopoly money",
            "You and your wife have handled this so well. It's amazing to me that she's even considering helping them given what they've said about her.\n\nThese people aren't your family. They have treated you worse than a stranger would. They took a poorly calculated risk and have to deal with the consequences. None of them were forced into it. It's moronic to invest all your capital in a luxury yoga studio, especially if you're two couples living with Mom.\n\nYou worked your ass off for over 25 years. Don't give away all those hours of work because some local assholes make poor life decisions.",
            "Everyone else has given really eloquent and well-worded advice. So I'm just gonna say...Tell them to fuck off.",
            "So you can give them the money and they will treat you exactly the same. Except now they might ask you for more money in the future. They aren't going to be grateful from the sound of things.\n\nOr you can not give them the money and they will probably hate you for it.\n\nSomeone suggested buying the house, which is a horrible idea. They'll resent you for it, you won't be able to collect any rent, and you won't be able to do anything with the property without evicting them.\n\nHow important are these relationships to you?",
            "You're always going to be the \"black sheep\" of your family; you know this, and you need to come to a sense of peace with this. I can tell that you're 50% there. \n\nI would not associate with these people at all, much less give them a large sum of money.",
            "There is power in mercy, but stopping foreclosure on the home isn't mercy. \n\nEven if you pony up this huge sum to stop it now, they still need to be able to make the monthly payments in the future. They won't and will again expect you to bail them out, leading to a toxic cycle where adults don't have to take responsibility for themselves.\n\nIf you're worried about them being homeless and feel that you want to help them, offer to front the money for a security deposit on an apartment for them (don't co-sign a lease!!). \n\nHowever, I don't think you should feel the need to help them out at all. These people have made perfectly clear they don't value you or your wife, and giving them any amount of money just tells them that their behavior and actions until this point are acceptable. \n\nFinally - if they do get kicked out, see about buying your father's house if you feel an emotional attachment or want it to stay in the family. Perhaps your nieces/nephews will turn out a few black sheep as well who you can help out. ",
            "Block and ignore\nWhy are you still talking to these horrible people?",
            "It's true that there's power in mercy. Your wife sounds like a good person.\n\nBut it's also true that helping these people and staying in contact with them will only make your own life worse.\n\nThey're all grown up and able to look after themselves now.\n\nIf you want to, you could always offer to pay for a session with a financial planner to help them budget better/work out what they're going to do about the circumstances they've gotten themselves into.\n\nBut they're not good people. \n\nThey're anti-semitic, shrewish people who treat you badly.\n\nSo block their numbers, never talk to them again and live your life well. \n\nThen take your wife somewhere nice to thank her for being awesome.",
            "Call me petty, but if I were you I’d wait for the bank to foreclose on it. Pick it up at auction or make a lowball offer to buy it. If or when you get it, have it demolished. Petty level over 9000, but would make me feel good.\n\nThey treated you like shit your entire life. Mentally abusive at minimum. You owe them nothing. They are only reaching out to you now because they need something. And still not even being nice about it. People like that don’t deserve someone like you.",
            "Put a card in your fridge, wallet or night table with a list of the all things that they did to you, so you remember and are not tempted to help them in anyway.\nAnd look for filial laws in your county\n",
            "Aren’t there FIVE adults in that house? Let them WORK to get the money back! Paying the money will only make them more dependent on you. They WILL need money again. Be it for one of the kids college, or one of the men lose their job - they will come back for more. \n\nI really feel for you. You deserve to be happy with your wife and your dogs without being dragged down by your, frankly, horrible family. If it was me I would try to limit contact with them. ",
            "Christ you owe these people literally nothing.\n\nYou've turned the other cheek so many times (not even coming to your wedding *holy shit*) and they've shown no sign of remorse, that they'll change or that they have ever done anything wrong at all.\n\nYou did whats best for you and what they always wanted - you got out.\n\nPlease do yourself this favour once in your life and stay out.",
            "Do you know which bank is it ?\n\nIf yes, make an offer for buy the house, and get them kicked out of it. \n\nDo it through your wife under her maiden name if it is legal in your country. \n\nIf I follow their logic about the traditional role of a man, the house should be your. \n\nGet what is yours.",
            "I think you should send a single text saying \"I am showing you the same support that you have shown me.\" And then block every single one of them.",
            "I wouldn't even pay for their funerals if I had to.",
            ">none of them came to my wedding\n\n>they all always have a big Christmas party every year and never invite me or my wife\n\nThat tells me more than enough about them.  Tell them to fuck off, I would have cut contact with this shower of bastards long ago.\n\nFor an added kick in their teeth I'd consider buying the family home when the bank forcloses on it and evict them just to rub their noses in it.",
            "I would not even so much as respond.",
            "You don't reward people for abusing you. Bailing them out will NOT make them finally love you. Your only response should be \"Sorry, that doesn't work for me.\" Shut them down.",
            "To quote Pulp Fiction \"Jules, you give that fuckin' nimrod 1,500 dollars, and I'll shoot him on general principle.\"",
            "Grab you phone. Bring up each contact. Block it. Go on Social media  - BLOCK. They may be blood but they aren't family. The second you give them money you have lost the battle and they will never EVER stop asking. So just cut them off and out of your life. You don't need them. They bring nothing meaningful to your life.\n\nYour wife means well but she's also an idiot. People who have normal family don't get that sometimes cutting toxic people out is better than being the 'bigger/better\" person. ",
            "These horrible people didn't even come to your wedding. Why do they know how much money you have? Why are you in contact with them?\n\n\nYou owe them nothing. If you decide to go the route of buying the house and renting it to them, have a property management company deal with it. You know they wouldn't pay rent if you were the one collecting. I'm so sorry your family is awful. Focus on your wife and in-laws, who sound wonderful.",
            "Helping here wouldn’t be merciful. With manipulators like this, there can only he refusal. Anything else is reward for their behavior, and permission to do it again. \n\nIf you want you can offer to pay the first and last of a single apartment for your mother. Personally I would simply say you don’t have the money to lend. I’m always a bit puzzled when people say someone “knows” they have money to lend. How? Money may be in the bank but allotted for something else. It’s entirely fine to say you don’t have anything to loan them, and leave it there without further reasoning. I’ve done it, when someone got aggressive with me about loaning them cash. They named off the investments and salary I made, etc. so I just said “yes, I’ve been responsible with my money. I’m comfortable but that doesn’t mean I have money to lend you.” Because...maybe I had money but it was for other things. That’s fine. It’s reality. \n\nYou don’t have the cash to give to the family that’s bullied and tormented you, they’re self-centered bigots and you have *nothing* to gain from this. They’re devoid of any self awareness and this will not show or teach them compassion. They’ll just know they got what they wanted and can behave the same way again and again. Which also means that much of any “fuzzy feelings” you might gain in showing them mercy will quickly go out the window. ",
            "Tell them to get fucked. They completely cut you off, and this isn't going to change anything. I'm pretty sure you know that, but hearing it again won't hurt. These are shitty, manipulative people who just want to get bailed out. Guaranteed they will go right back to making your life hell if you give them this money. At least you'll be richer if you decide not to give it to them. ",
            "First, I'm sorry your family has spent so long mistreating you. It was never fair, or just. Your mother is a shitty, small person who doesn't deserve to have a son like you.\n\nYour status as scapegoat child was unearned and undeserved, but it sounds like your success is due entirely to your work, which is something that many successful people just can't say. It's a pity that your sisters were idiots, but they too were victimized by your mother - just in a different way.\n\nBut you know what? Goats are notoriously poor beasts of burden. \n\nThe family of your origin is not your responsibility. They are grasping, foolish, and they can't even stop insulting you and your wife while demanding that you fill their empty hands with the fruits of the labor for which they ridiculed you.\n\nI do understand your wife's point of view. And I agree that there is power in mercy. It's a very Jewish stance. \n\nBut there is also power in silence, and in a flat \"no\", and in quietly refusing to be abused by them any longer. Because they still are, *even as they demand that you open your wallet to them*.\n\nYour mother is old. Age sucks. Guess one of the daughters that she's functionally hamstrung will have to step up and take care of her. I wish them well in that.\n",
            "If they said \"that's what your father would have wanted\"... well wouldnt he have wanted them to treat you like family for that last 20 years?\n\nSeems like they are not being sincere. Besides, it sounds like your brother in laws have good jobs and no rent/house payments. They should have thick bank accounts, and if not that isn't your problem.",
            "They didn't even come to your wedding. They mocked your miscarriage.\n\nI can't believe you're even considering helping them.\n\nHell, I can't believe you haven't cut contact with them completely a long, long time ago.",
            "My mom acts like your mom.  And when I helped her, instead of her being grateful or nice, she mocked and insulted me for it.   She had to make herself\nFeel better by putting me down \n\n\n** Would you want to give them money and then be insulted by them\nFor doing so?**. I can see them mocking your wife, te rich Jew, haha she’s so\nFoolish for marrying OP and giving us money.  \n\n\nWhat you can do- if you want. Don’t acknowledge their texts or calls.  Instead put aside a small amount of money, ie 10K, for each kid- and make sure that it can’t go to the parents. \n\n\n\nAnd maybe change your number.  And if\nYou speak to them, tell them an insult they used to tell you",
            "It will never stop once you start it.  They will expect you to be the piggy bank till you cut them off again.  Don't start. ",
            "Don't give them a dime. \n\nThere are 9 people in that house, 5 of which are fully grown adults. If they need money, they need to work with the bank and all get jobs, mcdonalds, grocery stores, car washes, whatever they can to earn the money they failed at making with the fancy yoga studio. \n\ngood for you for even considering this, but if my dirtbag of a father ever asked me this, when his wife is perfectly capable of working but just \"doesn't feel like it\" I would tell him \"No way, I worked hard for the money I have, if you can't do the same I am sorry. I will not be lending or giving you any money\"",
            "I think you already know you don't want to do this, and you want validation that you're not being cruel or a bad son to refuse.\n\nFor what it's worth from this Internet stranger - no, you're not being cruel or a bad son. There is power in mercy, but they are not asking for mercy. They will not literally die or be homeless if you refuse. They'll probably suffer financial hardship, have to move into less desirable living quarters, but you aren't deciding their fate. You don't have an obligation to save them from their mistakes and make life more comfortable for them.\n\nYou know giving them money will do absolutely nothing positive. It will not improve your relationships, it will not make them grateful, or sorry for how they treated you in the past. It will just mark you as an easy touch they can come to every time they have another sob story.\n\nYou don't have to be spiteful or vengeful or enjoy their suffering. You can just go low or no contact, and tell them 'no.'",
            "Cut them out of your life already! They’re shit people, and have only ever been shit people. They only thing they deserve is being told to fuck off already.\n\nPlease go to /r/raisedbynarcissists, many people want to “make amends” with their families just to have a family, or they’re longing for a loving family that everyone else has. That’s never going to happen with these people. They won’t treat you better than they have your whole life if you give them money, they’ll have just found another way to use and abuse you.\n\nTell them in no uncertain terms to fuck off. Perhaps your dead dad would have wanted them to not be fucking terrible people but hey you can’t have everything.",
            "Let em burn. A claim to that house was never yours and now won't be anyone's. \n\nYou built your future and and security, they squandered away theirs.  ",
            "Lol nope. No money for them.\n\nSix grown adults in the house and none of them have an emergency fund? Sounds like a much needed karma uppercut.",
            "Honestly, fuck them. Your dad gave your mom all that money and she squandered it; you are not in a place to be giving your mom money every time she asks (and believe me, if you help her \"this one time,\" she'll be back for more.)\n\nAnd honestly, this isn't just some Redditor with a justice boner. Your family is horrifyingly bigoted towards your wife (but isn't afraid to ask for her money!), they have treated you like garbage your whole life and yet have the balls to ask you for money. \n\nFor your own mental health, block them. Block all of them. You have a family that loves you, and while there is power in mercy, there is also power in using that money towards people who love you and don't go out of their way to hurt you. ",
            "If I were in your place, I’d tell them to stop contacting me. Then I’d follow up with the correct legal steps if they did not do so. \n\nThese people don’t care about you. They don’t care about your wife, but you already know that. Giving them money to help will not change anything. \n\nThem using your fathers memory to try to guilt money out of you is absolutely disgusting. They know they’ve been treating you like trash all these years. \n\nIt is not your job to take care of them. Your mother is an adult, and if you think she’s been taken advantage of, you should call APS. Take care of your wife, take care of yourself, and let the people who have been alienating you your whole life take care of themselves.  Good luck!",
            "Send them a condolence card. ",
            "This may not be an actual crisis.  There is a very good chance they have the money but are just not paying the bills, that's what people like your mother and sisters do, and now that the bank is ready to foreclose they are trying their last resort, you.   Even if they get kicked out that doesn't mean that they don't have the money, they may have kept most of the loan then didn't pay the rent for the last two years or more.  They are think they are getting one over on the bank.  They may negotiate a reduced payment plan, because the bank would prefer to get something and not nothing.  For con artists like your mother and sister, the bank foreclosing is a wonderful opportunity to con one more person, you.  \n\nThis isn't the case of someone who had a substance abuse problem and treated you poorly when they were addicted, and now that they are clean they need help.   If it were, then yes there would be power in mercy.  \n\nThese people act with thought and foresight, they've been planning your abuse all your life, this is just more of the same.    If you gave them the money they would not consider it an act of mercy, and they wouldn't be grateful.     \n\nIf you decide to help them you'll be doing it for yourself because they will still treat you like a scapegoat.  Before you give them a penny, hire your in-laws accountant, and lawyer.  Have the lawyer and accountant participate every step of the way.  You want to see the books of the yoga studio, all the bank accounts for everyone involved **BEFORE** you give them a penny.    Just to make sure that you aren't getting played to ensure that they aren't hiding money someplace.  \n\nThe lawyer and the accountant will be able to investigate and prevent you from being involved in a criminal scheme.  Funny thing, the authorities tend to go after the people who finance criminal activities, like bank fraud, with a vengeance, which means you would be the target more so than the family, especially when they claim it was your idea..    Work it all out with the accountant and lawyer ahead of time, and have the lawyer contact your family with a pre-loan agreement outlining all the investigation that you'll be conducting, and if the situation is exactly as they state, you'll evaluate your options to help them.  The lawyer and accountant may be able to negotiate a way out without you loaning any money.   \n\nYour family will reject the pre-loan, and start name calling.  Your only response should be silence.  ",
            "its simple: hell no, fuck them. they treated you like shit all your life, your father was a coward who never stood up for you so its not like you would be honoring your father's legacy, your family hates you with a fiery passion, if I was you, I'd  laugh at their idiotic decisions, hang up the phone and block every one of their phone numbers/contacts/social media. just wondering why do you even still talk to them?",
            "Do not do shit for your abusive, disgusting, worthless group of people that you call your family of origin. They treated you like garbage and expect you to just give them money because of their own stupid choices, and gaslight and emotionally manipulate you on top of it? Are they fucking serious? You and your wife sound like lovely people, but seriously: Your normal meter is VERY broken.\n\nLet them reap what they sow. And please: for your sake, consider therapy and cut your \"family\" off, for your own benefit. You keep seeking validation and acceptance from these people. They have made it clear that they are never going to give it to you. You're mourning the family you never had- which is okay because you've been abused and this is a normal reaction to abuse.\n\nI really wish you the best.",
            "Just no. They don't deserve it, I'm all for mercy, but there is a point where continuing to forgive people who have used you so poorly, is setting yourself on fire to keep them warm.\n\nOP, I'm proud of all you've achieved, you sound amazing and your wife sounds like a gem. Don't compromise your final security (what if one of you gets sick? Made redundant? Etc) for people who are lazy and are looking for a quick easy out of their difficulties. They obviously don't have any respect for you, and if you 'loan' them money, you will never see it again.\n\nFWIW, I profoundly disagree with the suggestion up the thread about buying out the debt from the bank so you would own the house. Your family are toxic, staying away from them has in some ways made your life easier. Seeing them regularly would leave you and your wife exposed to many more horrible comments and slights.\n\nYou owe them nothing.",
            "You give them money once, and they will continue to come back for more. Don't do it. ",
            "Let them reap what they have sown. All of it.",
            "I'd start by being petty. Take them to a nice lunch and consider giving them the money. Leave them with the bill. Then when they inevitably message you, tell them the buck stops here, right where they referenced your Jew wife's rich family. \n\nYour family is a pack of golddiggers. All of them, the husbands, too. Your only value, JUST LIKE YOUR FATHER, is what you can give them. Think about that. Those women probably put your father into an early grave. He wanted better for you, and at every opportunity, your mom and sisters took that away from you. FOR YOUR FATHER, tell them, in the harshest way possible, to go the hell away and never contact you again. ",
            "No. Don't help them. This is their mistake, and they need to find their way out of it without you.\n\nYou should really go no contact with them. Block their numbers. Your life is better without them dragging you down. You wanted to be a family with them, but they didn't want that. Let them go.",
            "Your family is a toxic garbage pile that has no place in your life. Don't give them anything, including your time. Cut them out like you would any cancerous limb.",
            "Your horrid anti-Semitic family should not get a dime from you. Please don’t cave. Go no contact.",
            "OP - I wouldn't give them a penny. \n\nIf however you decide to be the bigger man, then....\n\nA) Demand full financial disclosure from all parties, what assets and expenses do they have.  Do they have fancy cars that can be downgraded?  What efforts have been made to release equity in the house?  Is the Yoga business wrapped up now with all creditors paid or is there more trouble coming down the track?  I'm willing to bet that they can finance this but don't want to face the reality of doing so.\n\nB) Understand you will not get the money back, they will not repay and you will still not receive a fair share of the house. \n\nC) This will not normalize your relations with your family.  In fact they will probably resent you more.  You cannot win with these people.",
            "In my personal experience - don't.. Im 21 but already have gotten burned exactly this way from my family when they figured out how much money Im already making. Once you say yes one time they will never learn how to figure it out/make it work their selves because \"u/dolanboy has money if we need it\" thankfully Ive gone completely no contact with my parents and the GChildren and no longer have to be guilt tripped, but I still do get fb messages occasionally..",
            "There is zero reason five adults can’t figure out how to pay the mortgage on a house in a small town in Kansas. There is so much wrong with how they’ve treated you and how they’ve handled their money that can’t possibly be fixed with bailing them out. I would use this opportunity to break with these horrible people and focus on having healthy familial relationships with your in-laws.",
            "That money would be better suited for your retirement fund and a nice vacation fund. You and your wife sound like such caring people for considering helping despite their antisemitism and mistreatment. It would be a mistake to help them and acknowledging that doesn't make you a bad person..\n\nIf you do decide you need to help, I would get the house in your name and have them all pay rent.",
            "I'd say don't give them even a cent. They will take it and laugh at you and call you stupid. But maybe they'll feel bad for all the crap they've done and learn to respect you. Is there a way you can buy the house in your name?",
            "You can spend a fortune and have your family hate your guts, or you can spend nothing and have your family hate your guts. What sounds better? There is power in mercy. It would be a great mercy to protect the family you created with your wife from this toxicity.\nIf there was a button out there that if they pushed it, you would never have met your wife, paid for a home, bought your dogs and succeeded at your career, do you believe they would refrain from pushing it?\nThey've been pushing this button for decades, friend. They've been pushing and pushing and smashing that button to dust. Be happy the button hasn't overcome your hard work and keep protecting yourself and your happy life. If it was up to them, you would have nothing, and that won't change even if you share the fruit of your hard work. They never even meant for you to have earned it in the first place. They would still, to this day, celebrate you losing everything you have, happy to see their awful words about you becoming reality. Protect your actual family. Wife, dogs, wife's family. They are your family.\n\nAlso, check and lock down your credit right now. People like this will just take without your consent, thinking you owe them and you would never send them to jail because they're family. And seeing how great of a person you are, they may actually be right about that. So please prevent it.",
            "I don’t have any practical advice to give as to how to proceed but I just wanted to chime in and say you don’t owe them jack shit and you have the patience of a saint for not just straight up telling them to fuck off.\n\n>When I earned my degree in business, I was a \"wannabe businessman fast food employee”.\n\nMaybe if they’d treated the wannabe businessman fast food employee with a modicum of respect, he could have advised them that their business was doomed to failure.",
            "\"Mercy\" would be saying \"I forgive you.\" Mercy isn't giving them huge sums of money. That is called giving up your own agency, being a doormat, and being a fool. \n\nIf you give them this money they will probably misappropriate it and ask for more (we had some bills to pay too so we used pry of it for that, and now we're $2000 short! We need more money!) or they will do this all over again. Will you be willing to bail them out if they try another business idea? What if they suddenly decide that the kids all need to go to private school and start asking you for tuition? What if one of their cars breaks down? \n\nThere are five adults in that house. You don't even own a house yourself!!! Why should you be the one adult to work to save a house that you don't live in?\n\nThere is no \"honor\" and no \"taking the high road\" in giving them money. What you can do is help the ones who aren't working brush up their resumes, help research apartments in their area, or send them information about government assistance if that applies to them. There are ways to be helpful without fucking yourself over. \n\nAnd your wife is coming from a place of goodness, but she is NOT the one who was bullied and mocked and treated like dirt for over 40 years. She's only dealt with a tiny fraction of their bad behavior compared to you. You might admire her for her stance, but the reality is that it's easier for her to feel that way because she isn't an expert in their machinations the way that you are. ",
            "Once upon a time, there was a dog who climbed into a manger. Any time one of the horses came to eat, it would growl and chase them off. The dog had no use for the hay. It couldn’t eat it, but it didn’t want the horses to benefit from it either. \n\nSome people are dogs in a manger. They are jealous and hateful for no real reason. \n\nNo matter what you do, you’ll end up bitten in the end. \n\n\nIf you choose to help, involve a lawyer - it’s a business transaction, treat it as such. Separate yourself from it and them. Any communication about money goes through your lawyer. It’s on them to provide an accounting of what they need so you don’t find yourself fleeced for more. The money is paid directly to the bank. They never see it or touch it.",
            "Why would you ever consider helping them? \nThey've proven time and again they're terrible people to you their own son and brother. ",
            "Nope, they don't sound like family too me.  You help this time and they will come to you again and again.  They are toxic, let them go and enjoy the life and family that you have now.  ",
            "Let the bank take the house. Then, after they have been kicked out and had to find other accommodations elsewhere, contact the bank to buy the house and live there with your lovely wife and french bulldogs. \n\nSeriously. Do not help them. Just because you share blood, that does not make them family. They've made it clear that they think of you as a piggy bank. If you even gave them a cent, they'd still find fault in it and ways to berate you. \"Well, if you had helped in the beginning, we wouldn't be in this mess\" \"You have so much and you're *only* give us $xxx? Don't you care about niece/nephew/etc.?\" Do not open up that can of worms. Go no contact if possible.",
            "Don’t do it,  you’ll regret it.",
            "LOL\n\nHoly moly. I really hope you don't give them a dime and that you go NC with them. They're not family, they're just a bunch of assholes who happen to share some DNA with you.",
            "If you want to finance 9 people permanently go right ahead. These people only contact you when they want something they don't give a rats ass about you.",
            "If you give them money it'll just be the first time, not the only time. ",
            "I am a firm believer that a person reaps what they sow in life and your family let the fields fall barren.\n\nAnd yes, there is power in kindness, but it's a power your family has never thought to use, not for you, not even once.\n\nI'd bet twice the sum they've asked for that the moment you hand over their free money they would go right back to being vile and vicious to you. It sounds like they can't even bring themselves to be nice to you when they're asking for thousands of dollars!\n\nI'd be writing them a letter that read \n\nDear family members,\n\nI'm sorry to hear that you are experiencing financial difficulties. You have always made it clear that you aren't interested in having a familial relationship with me, so I feel it's inappropriate to lend you money on familial terms. I recommend contacting local financial advisers and seeking a consultation, they may be able to help you find a viable solution. \n\nWith regards\n\nOP\n\nSeriously, OP. Bollocks to these arseholes that you just happen to be related to. You have managed to drag yourself clear of their toxic bathtub full of nastiness and you owe them nothing, nothing at all. Start documenting the things they send and the messages they leave - get, keep and catalogue recordings of any voice messages - and if they persist then see a lawyer and get a restraining order/cease and desist made.\n\nEven if they had supported you, or been kind to you, or behaved in any way like a family should, you *still* wouldn't be financially liable for their shitty business decisions. \n\nIf I were you, I'd just smile yourself a little smile as you look over your hard-earned assets and enjoy the love and care of your family - your *real* family, the one that you have made yourself and married into.",
            "I'm sorry but I don't understand what your question is. These people have stomped on you your entire life, they have belittled you and treated you as other since childhood. They revelled In your poor wife's miscarriage, they don't invite you to holiday parties in the very house they are now bleating at you to save! There are 4 adults all of working age in that house. 4 of them, where the hell is their money? \n\nDon't pay for the house, you deserve better than to be roped into bailing out people who wouldn't spit on you if you were on fire, your wife deserves more respect than to have your joint marital assets used to bail out people who have treated her so shabbily. They have sown a whole lot of bad blood and you have every right to wash your hands of the,. When they try and claim \"faaaamily\" remind them of how they have acted over the years. ",
            "Your wife is lovely.\n\nAs are you.\n\nI appreciate that you are looking out for your nieces and nephews.\n\nI wouldn’t gift them anything, but would certainly offer to buy the house outright and rent it back at a reasonable rate.\n\nDon’t manage the property yourself. Put it through a real estate agent. Don’t get tied up in the mess.\n\nThey want a solution to ‘being homeless’ this is a solution to that problem. Which grows the wealth of your family, the family that counts, while also showing the mercy that your wife talks about.",
            "I love Frenchies! Give no one a penny. They have made their financial choices and you have made yours. They criticized your jobs so why should they get any benefits now. There are at least 4 adults able to work at paying the mortgage. They might have to flip burgers on the weekends to make it all work!",
            "I'm really sorry that you're in this situation.\n\nThey haven't treated you as family for decades, and it's not like they're suddenly inviting you and your wife to Christmas. They're not saying \"we're so sorry for how we've treated you in the past. We want to repair whatever damage we can.\" That would be worth consideration and time.\n\nBut they're saying, \"you are a blood relative and you owe us money when we need it.\"\n\nDelete their texts and block them. They aren't deserving of your generosity. I know you feel bad for your neices and nephews, it's not their fault their parents and grandmother are trash people. I would set aside some money to give each of them when they turn 18 if you want to help (don't bother giving them money now, their parents will 100% take it).",
            "You’re wife sounds like an absolutely lovely person. As I am sure you are. But your family deserve nothing, they have treated you badly since you were a child and this is the consequence of their actions. \n\nEdit. Even better, buy the house and chuck them to the gutter. They are all old enough to work. ",
            "Could you imagine how your wife would feel if you gave a dime to these antisemitic assholes? fuck them. they are the trash you take to the curb.",
            "Yourself egg donor and attached leeches are horrible people. \n\nYou can advise them how to take care of themselves 'mom, you should get a job at *fast food chain*, the brothers in law should each get second jobs, the sisters should get jobs that coordinate so they can alternate child care - sis a works 9-5, sis b works 3rd shift.   No child care bill, more money coming in and they get to keep the house. \n\nAnd they don't need to know how much you make.  And your in-laws-  your egg donor and attached leeches need to stay far away from them",
            "Fellow entrepreneur here, OP. My brother opened a mechanic shop 8 years ago that I thought would fail. I cried when it opened because I knew If it started to fail he would come to me for money because I had it. He needed some equipment early on, offered to sell me stock if I paid for it, and within the first year we became business partners because of it (I also cried after I gave him every penny of my life savings because I thought I was kissing it goodbye).\n\nThat's business ownership - accepting that most businesses fail and not putting anything into it you can't afford to lose. My situation worked out, honestly probably only by the grace of God. Your situation is different. I'm guessing the personal banker son in law suggested some type of HELOC to use the house as collateral. The higher ups at the bank would have to be starving to bite, business loans are separate from house loans for this very reason. If you breath word that the house loan is for a business any bank with morals would pull out. Also, at your mom's age the house should have been considered retirement money. She should have never been investing in anything riskier than a CD. \n\nI think your wife is the real gem in all this. For her to not be full of scorched earth is amazing to me. \n\nIf it were me, I wouldn't give the money. Your family of origin had already gone scorched earth with you by not attending the wedding - that to to me is a symbolic act of you don't want to be involved in their future. And then for them to rub it in your face with the death of a child - let's be real, yes miscarriages are somewhat common but at your wife's age she's not just mourning that individual baby but mourning having children at all. What your sisters did was incredibly cruel and callous. \n\nGiving them money will not cause them to reflect on their behavior. They'll be relieved they didn't have to face the consequences of their decisions, which they believe they are entitled not to face, and they'll move on. If you don't give it, they'll blame you for the loss of the home rather than reflect on the fact that it was their own decisions that lead them there. I have a feeling they'd go full scorched earth with YOU if you don't.. That's life of being a scape goat though. They sound immature. \n\n\n",
            "Don’t give them the money. Let the house get foreclosed. \n\nI think you should buy your home back as a big fuck You ",
            "Power in mercy?  Where was your family's mercy?  They burned the bridges long ago.\n\nAnd like you said, they need your money.  They don't even want you.",
            "This could be a good opportunity to get your fathers house cheap. You're a smart guy, you'll figure it out :-)",
            "Did they send you a wedding gift? If so I say send that value back. If not I say send a letter saying something to the effect of 'in your time of need I would like to return the wedding gift you sent '",
            "Your wife wasn't treated like an outcast by her family for her whole life, so she's coming from a different perspective.\n\nPersonally, I think you reap what you sow, and your family has not sown compassion and love. I'm sure if they had been successful, they would have been gloating and lording it over you and never, ever would have shared in their success.\n\nI'm not sure why you haven't gone no contact with them by now. Sounds like a good time.",
            "If you bail them out now, you will be bailing them out financially for the rest of your life, and then they will berate you once you cut them off. I think you should skip the drama and say no now. Also, these people add nothing positive to your life. I think you should protect your spouse and yourself and go no contact. ",
            "Tell them to fuck off. ",
            "Buy the house at auction, evict them, then move in. Let them know it's what your father would have wanted.\n\nBut I know that stuff only happens in my dreams.",
            "You and your wife have gentle hearts. Your family they don’t have a heart between the 5 of them. Ask yourself these couple of questions. Have they worked at all?  What happened to money inherited including your share?  Did they help you when lived in your apartment?  Did they offer emotional support? I think you know the answers which are no. Give them support during their financial problems...no. Give them money...no. Use the money for your and your wife’s needs not theirs. Good luck. ",
            "You're not responsible for other people's failings. End of story. \n\nThey are already mean to you. What more could they possibly do? \n\nIf you respond, I would throw in there something about how they said you're family. But they don't treat you like family, and you can't afford to just throw that money away.",
            "Let them dig themselves out.",
            "Watch Million Dollar Baby. \n\nIf you decide to help, don't give them the money. It should be a loan with strict rules and paperwork. The sisters too should be responsible for the debt. Giving them money will just empower them to think of you as a new daddy. \n\nIf you decide not to help, good for you. The more they try to make you feel guilty, the more you know you made the right decision. ",
            "Do not help them at all, do not even answer their messages! screw them, you don't need them.",
            "Once the bank reposes the house and kick them out, if you can, buy back your fathers house free and clear (it may cost you a lot more), it will be in your name and not invite them back for anything.\n\nAbove all else, do not give them money.",
            "One way to go about it is to offer to buy out the house and charge them rent to recoup. ",
            "You left out the part in your lede where your family also wants your and your wife's money because she's a Jew and they're anti-semites.  \n\nNo.  There's not enough no in the world for this.  ",
            "Don’t do it OP. Once your father died, your familial bond did as well. Blood doesn’t determine family. It’s how people treat each other, the relationships that they forge determines family.",
            "no. No. NO!\n\nNothing good will come of this, let your sisters’ and their families extend themselves and fix their problems. You have a life and a family. What if there was an emergency and you needed this money for something catastrophic? They would not help you, you need this to help yourself and your wife. \n\nThey will NEVER pay you back and it will give them license to repeatedly ask for financial assistance. \n\nI’m sure that your mother knew that your father’s wishes were for you to live in the guest house, why wasn’t that honored?\n",
            "Buy the house, make them Pay rent.",
            "Your post literally drips loathing for your bio family. Don't want to help them- don't! One of the joys of adulthood.",
            "DON'T YOU DARE HELP THEM. nothing good will come from this.",
            "This thread is oozing with hatred and spitefulness, and while I can understand where it is coming from, I would not recommend enacting revenge on them.\n\nThat being said, I would strongly advise not to bail them out with money. What they did to you in your upbringing was despicable to say the least, and I really do have to say I admire that you pulled yourself away from them and took control of your life.\n\nThey stopped being family a long time ago. It means so much more than just being related by blood.\n\nAs others have suggested, buying the house when it is auctioned would be an idea, but if it is linked with painful memories, I'd say let it go. Let it all go, and make it absolutely clear that they are not welcome in your life any longer, as hard as that may be.\nLet your sisters and their spouses come up with a way to get the money, it's a grave they dug all by themselves.\n\nHope everything turns out well for you in the end!",
            "hmm  I'll go against the tidal wave here.  \n\nGive the money but demand the deed to the house in exchange. Everyone can continue living there while your mother is around but when she dies, you will sell the house. It looks like they would have to choose that or homelessness. \n\nYou do your family duty, even though they don't deserve it. They all get to continue living at home and you get profit from rising house values over time. Also,  quite frankly, how quick will they be to criticize the guy that can sell the house they live in?\n\n\n",
            "Put up the money, take the house, evict them all.",
            ".You definitely shouldn’t help them. They don’t sound like they’d help you. They sound like they’d laugh at you & not give a shit. They suck, but them out like cancer and be free.",
            "You could probably get a great deal on the house if it is about to be foreclosed...",
            "Don't give them anything. Though if the house goes into foreclosure you could buy it. Tell them that you are keeping it in the family, but on your terms since it's your money.\n\nCongrats a successful life. Sounds like you have things pretty good.",
            "Tell them to take a long walk on a short pier. Don't respond to them. I am sure you and your wife are better off without them dragging you down. ",
            "Thought I was in r/justnomil for a minute, but no, you don’t owe any of them anything. No is a complete sentence but your wife has a point regarding mercy. Maybe you could set up some kind of account that only pays out the bare minimum/necessities for a set period of time with a deadline for when they’ll need to take over financial responsibility. \n\n",
            "I don't think there's any real upside in helping them out of this jam. I mean the idea of buying the house and renting it back to them is nice, but you just know they'll try and screw you over on it. You can't loan them the money because they won't pay you back. And bailing them out, while probably the most realistic thing, isn't something I'd do for people that only acknowledge me to be cruel or spiteful (until they want something).  \n\n\nIf your heart can't say no, just lowball them and leave them to come up with the rest of the money and then consider it kind of a buyout from the rest of their bullshit forever.",
            "I read your story man, and seriously, what is wrong with you? Cut those toxic people out of your life. You may be blood-related but you clearly aren't family.\n\nSend them a single text where you state your mind about the issues and let them rot. They see you as a fat piggy bank ready for slaughtering and will bleed you dry.",
            "I wouldn’t help them. I’d tell them that you won’t be helping and that these are the consequences of their actions over many years. \n\nYou won’t get that money back. We all know it. Keep it for you, your wife and whatever is coming for your future together. ",
            "If I were you I'd get them all on one big call, the whole pack of them, ask them to repeat their request and then just start laughing. Laugh and laugh and laugh. Say nothing else. Just laugh over anything they day until they take the hint and hang up. \n\nBut I'm petty. ",
            "Mercy is good, but these people haven’t asked for your forgiveness. This wouldn’t be mercy, it would be enabling. \n\nI would buy the house and tell them they can pay rent. Do this for your nieces and nephews, they’re innocent, and they deserve to have parents who work to support them. Teach them that they need to take responsibility. ",
            "Honestly, I don't know why you have any contact with any of these people. They seriously do absolutely nothing for you and only drag you down. Seriously, can you name one benefit of maintaining any kind of relationship with any of them?\n\nDon't give them money. Do you think that if you do it will stop with one time? They're looking to take advantage of you, the same as they have been your whole life. Just don't respond anymore. Ghost your family. I'm sure you'll feel much better.\n\nIf they won't leave you alone, then move. Across town or out of state or whatever, just change your phone numbers, your email addresses (or block/filter out their messages on both) and move on with your life. You're way too far along to have to deal with their shit, especially as they get older and will need help in retirement.\n\nAlso, maybe go check out some of the JustNo subs, like /r/JUSTNOFAMILY or /r/JustNoMIL (for your mom, they do mothers too). Your story is unfortunately all too common sounding for both of those subs. . .",
            "Give them exactly what they deserve from you - Nothing. Not even a response.",
            "Reading this and imagining being in your shoes emotionally makes me tear up. Tough read. Dont give em anything",
            "I'm usually a big advocate for \"do what you need to be at peace with yourself\". And while I still say that for your situation, I'm inclined to agree with the general consensus of the other comments.  \nYour \"family\" has long since stopped treating you like family. If they gave a damn about what your father would have wanted, they'd have treated you with respect and kindness, and they probably wouldn't have used the house as collateral in the first place.  \nThey've all but cut ties with you already, and quite frankly, they don't sound like they deserve your good will. \n\nYou can forgive them without helping them and help them without forgiving them. So, if you can, forgive them; forgivenes is a gift you give yourself. But please, don't give them a dime. If you want to throw a heap of money at someone, donate it to a charity. ",
            "TL;DR.... FUCK THAT.  Don't give them a cent! ",
            "What I would do is let the bank take the house and then buy it from the bank and move in to it. That would teach them a lesson for treating you bad. I'm an ass like that though. I would not bail them out though. Then you can say, look I bought my first home. ",
            "Why is this even a dilemma? People who treated you like shit your entire life want your money now that they've predictably squandered their own and you're not sure what to do?\n\nTake that money and go get yourself some therapy to recalibrate your normal meter. You've clearly been raised in a dysfunctional family of origin and must have some issues to even think about considering bailing any of these people out.",
            "Your wife is a kind soul. That said, the natural consequences in life apply- they made their choices and poor decisions and they also now need to live with the consequences. Those people aren’t family, they’re not even in your life, but now have shown up just for the cash. They’ll continue to treat you and your wife the same way once they get what they need from you. It’s not disrespectful to take care of yourself. Show mercy to YOURSELF. ",
            "This is where you take power back, you tell them to go fuck themselves. But definitely bring up the unkindness about the miscarriage and anti-semitic remarks that they made against your wife. Your wife's morality is certainly something, there is definitely power in mercy but these people are morally bankrupt and nothing you do will ever win them over. In fact any money you give them would further validate that they can just treat you as they would like.   \n",
            "I feel like enough people have said it already but please don‘t do it.\nThere is power in mercy but these people never showed any either over the span of 40 years.\n\nI know they‘re „family“ but they don‘t deserve a cent of your hard earned money.\nAnd hinting towards your wife‘s money is just ridiculous they should honestly land on the street .\n",
            "[deleted]",
            "Make them sign the house into your name. ",
            "*Mom...sisters...seeing as none of you could be bothered to come to my wedding, never supported my marriage, and never showed an ounce of remorse or care when we lost our child...I see no reason to financially support any of you.*\n\n*From this moment on, you are all on your own financially.  You will not now, nor will you ever get a single penny from me.*\n\nLook man...there are enough adults living in that house that they can afford the mortgage.  If the home is about to be taken away, thats on them...not you.\n\nBeyond that\n\nReal Talk bub...you do know you would be 100% happier if you cut them all out of your life...right?  Your family offers nothing of value to you ...at all\n\n",
            "Don't do it. They only came begging to you because all of a sudden they need you. They won't pay you back, and they won't even be grateful for the help.\n\nThey've insulted you your whole life, and then they insult your wife in probably her darkest hour. Those are the types of people you cut out of your life, even if they are blood. \n\nIt sounds like you found the perfect family to replace them with, so stick with them.",
            "> You know how that goes.\n\n*record scratch* What? No. We (mostly) don't know how that goes!  That is still the little kid talking who assumes emotional abuse is \"how it goes\".  I didn't think much of having visiting buddies help replace doors that had holes punched or kicked through them; you know how that goes.\n\nAnyway, your remaining family is cartoonishly villainously awful and you have lost enough time dealing with them already.  Happy to hear you have found a new group that cares about each other; recommend you spend your time and resources and mental energy there instead.  Donate to your favorite charity if you have money to burn.",
            "Your family are disgusting narcissists and you are their scapegoat. They didn't go to your wedding, your wife lost a child and they went TOLD YOU SO, and now its suddenly your DUTY to be their for FAMMMMILY?\n\nNo. Not only will they never pay you back this money, but they will not be thankful for this money--because in your eyes, you don't deserve it. They do. If you give it to them, the only thing that will happen will be they'll feel all the more entitled to ask you (really, DEMAND seems more apt here) in the future. \n\nYour wife is a lovely person, btw. Be proud and happy of your own beautiful family, and cut these toxic jerks out of your life. I recommend looking into the subreddit raised by narcissists--it may provide you with a lot of insight. ",
            "Do exactly what they would do if you ever needed the same from them. \n\nDon't even pick up the phone. ",
            "If you give your family money that they don't deserve based on the fact that they're blood related, you're a fool. You don't seem like a fool.",
            "Buy the house out of foreclosure,mock them mercilessly for being poor and stupid,then evict em and offer to rent em a doublewide",
            "Ignore them!!! I can relate in that my mother is a selfish person. I won't go into detail. You are so much better off. You're super lucky you actually turned out to be a good person. I consider myself lucky. I have tons of issues stemming from my completely broken/screwed childhood, but lucky I didnt turn out like my mother.  Your wife seems sweet to say that. However I think you need to not even bother with your family. They got themselves into this mess, let them get out of it. You're going to be a better person for saying no. It's a small 2 letter word that is the (sometimes not so much) easiest and most empowering to say. Good luck!",
            "Maybe I'm just cold, but I would offer to buy the house, but only on the condition that you were the sole person on the title, and that all of them pay rent to you at an amount that would cover your mortgage, your condo rent, property taxes, and property upkeep. Or market value, whichever is more money. If your siblings are so concerned about mom not being able to stay in the home they can pony up the rent for her. Hire a property manager and have them deal with all of them. You can be completely hands off. This is their only chance at saving the home, and if they screw up, oh well, eviction, and you keep the property as rental income.",
            "I’m usually no advocate for revenge but, if I were you, I’d buy the house in my name for a low price, serve them with expensive 3-month rental contracts, and then sell the house for profit. Show no remorse because you don’t owe them any. \n\n>It's not like I accuse my sisters' husbands of not being men because they live in their mother in law's house. Everyone does their own thing.\n\n”Men should be able to provide for their families. Why are your husbands living off of their MIL’s teet for free? Why can’t they buy the house if they’re so darn successful?” would be a very nice remark here. ",
            "Nope. They are horrible selfish toxic people who have always treated you and your wife terribly. Don’t give them a cent. They’ve made their bed, let them lie in it. Honestly, it sounds like they add nothing positive to your life whatsoever and it might be healthier for you simply to cut off contact with all of them. You don’t need to justify or explain your decision not to give them money. Just don’t return their calls and messages and live your life. They have never cared about you at all, they don’t get to pull the “but faaaamily” card now. Also they are racist bigoted turds to your wife and have been extremely cruel to both you and her. From where I stand you’d be mad to give them a dime.",
            "TBH I think you should buy your childhood home in the inevitable bank foreclosure sale but I don't have a lot of tolerance for shitty families...",
            "Tell your mom she can have 5 dollars if she gets down on the knees and begs for forgiveness.",
            "They would get no help from me.",
            "Obviously you shouldn't gift them the money but maybe it might be worth it to buy out part of the equity of the house legally? As you said that seems to be the only way you'll get any of your inheritance. Maybe they're desperate enough to go for it... Or maybe not, but who knows.",
            "Yes there is power in mercy, but they are not asking forgiveness.  They can’t even be bothered to ask you (from the beginning) in person like any decent human being would.  They see you as an ATM, a machine to demand money from , not a son and brother.  \n\nPlease don’t give them any money.  The temptation may be strong, to prove you are successful or to hope afterwards they would see the light and bring you back into the family, but that will not happen.  They would only continue to ask for more while resenting and mocking you and your wife, until you have nothing left to give (as evidenced by their comments to ask your in laws)",
            "Fuck all of them. I'm sure you wonder to yourself, often, why you even talk to these people. You wouldn't be friends with them if they weren't your family, they bring nothing but shit into your life. ",
            "Fuck them. They never cared for you, and are only contacting you to be a bail out system. If the opportunity presents itself, buy the house from under them, then put them all out.",
            "Why would you want to give such hateful people any money? Letting them fail is sometimes the only way. \n\nI do suggest that when the house goes up for auction/for sale, think about buying it if you want to be extra spiteful. ",
            "You are a great man. \nYou’re surrounded by a family of assholes. You didn’t pick them and you wouldn’t pick them. They’ve been anti semites and horrid to your wife. Don’t give them a penny.  If they ask why, tell them they’re racist, classist jerks who have told you constantly that you’re not good enough, that they’ve made it clear you’ll never see a penny if mom dies and you need to save for when that happens. Tell them you’ve left all your money to the bulldogs in case of your death. Tell them whatever you want but if your enemy asked you for money you’d say no. You owe these people nothing. ",
            "they don't like you. they only care about you now for the money and once they have it they will go back to treating you like shit again. go no contact, something you should have done years ago. they'll figure it out. ",
            "Do not set a precedent. Do not give these people money. You bail them out now, it's only a matter of time before there is yet another hairbrained scheme you'll need to bail them out of. \n\nIf both of these husband's work and have never had to pay for housing, what EXACTLY are they spending all of their money on? Ask yourself those questions, and you'll realize that the second you give them money you will never experience another moment of peace. \n\nIt doesn't sound like you are interested in having a relationship with these people, and haven't for many years. You might want to keep it that way, and refusing this loan is a pretty quick way to get them to leave you and your wife alone. ",
            "If you want to help, can you help in a less soul sucking way - ie, offer them jobs at your restaurant chain, or use your connections to help them find similar work in their area? There are four of them, after all- four incomes can add up fast.",
            "Bigger question - why can't the sisters and their husbands help?",
            "I would tell them to fuck off.  Even if you helped them, I would bet that they still would not respect you.  They are just trying to take advantage of you.",
            "I was impressed with your wife's thoughts on mercy. You guys are really special people.\n\nIf you choose to loan them the money, you should be prepared to just give it to them.  You should also be prepared for no one in that household to learn a lesson over this experience. They probably will not treat you better; they will probably just think they \"won\" again.\n\nI'd suggest you write down a list of pros and cons, and then give each thing a weighted value to figure out which choice would be the most beneficial to you and your wife?  For instance, \n\nPro: Feeling like you rose above your abusive past relationship with them and helped your family in its time of need. 10 points! \n\nCon: Feeling small, unimportant, and un-valued after they throw a family get together to celebrate and \"forget\" to tell you. 20 points.\n\nPro: Having $$$ in the bank (that you earned!) for your future! 10 Points\n\nCon: Not having $$$ that you earned in the bank and having nothing to show for it but more emotional baggage to work through. 20 points\n\nOnly you and your wife can make this decision.  The concept of \"Family\" has a really strong pull, doesn't it? My concept of family means I've always got a group of people who love me and have my back no matter what. You have that, too, you're just not biologically related to them. Maybe it's time to focus on your real family and leave all that pain behind.",
            "\"I will offer you the same support you offered me during the years...\"\n\nThey will get the message, and you will not waste anymore of your time. ",
            "Do NOT help them, fuck these people! They tried their best to make you fail in life and now that they are, they want help?? Stay headstrong.",
            "Tell them that if they're having so much trouble, you'll be happy to take on their children and provide for them. Like a real man.",
            "Offer them $1 for every kindness or compliment or loving act that they can specifically point to that they showed you in your life.\n \n",
            "They are never going to be the loving family you daydream about. For the love of god, have enough self-respect to stop taking their calls. It doesn't have to be forever but give it six months or so and see how you feel.",
            "Don’t you dare help them they may be your blood but they are NOT a family that loves you. Value yourself and cut them out. Definitely under no circumstance give them any money. This is their fault let them sort it out. \n\nEdit: also how dare they call your wife antisemetic things. How dare they disrespect you, the woman you love then also ask for money on top of that. I’m in shock you are debating what to do here. ",
            "I wouldn't do shit for them after the shit with your wife, even without how they've treated you ",
            "Oh man, please do not help them. If you need an anecdote to confirm everyone’s advice, my dad has the shittiest family ever. Abusive parents, 6 mostly unstable siblings, none except 2 have a lot to piss in. Willingly poor. They treated my dad like shit his whole life for getting out of rural KY and doing something with his life. When they realized he had money, they stared guilting him into small loans that turned into:\n\n- 1 brother copying the key my dad gave him and gave it to 3 of his crackhead friends, ended up robbing us blind and destroying our house\n\n- A sister getting pissed he didn’t give her enough money and told her drug dealer bf to beat the shit out of my dad. He got cornered after work one night and had to go to the hospital\n\n- previously mentioned brother trying to steal his identity \n\n\nI’m not saying your family is this bad but they certainly don’t seem like good people. You owe them absolutely nothing. Save any money you would loan them for your real family, aka your wife and her family. If I were you, I’d tell them to fuck off and ever talk to you again...but that’s just me.",
            "Don’t give them any money! If you are really fond of the house or if you want to make some money, offer to buy the house for a heavily discounted price and then either move into the house yourself or sell it for a big profit. ",
            "I don't know if you care about your siblings at all, but if you do then DO NOT give them the money.  The lifestyle they are living is destroying them as people.  Help them grow. \n\n\nThen wait until they forclose on the house and buy it.  Tell them to swing by for christmas parties.  ",
            "If that many adults cant make morgage then you would just be wasting your money.",
            "You shouldn’t have to feel shame for not wanting to help people that have treated you with disrespect your entire life. It would be an extremely generous thing if you did help them considering how they treated you, but I would say no in a respectful way. The truth is these 5 adults need to humble themselves and get a job in the fast food business that they think they are above!  If they want to pay the mortgage to keep the house they have some decisions to make! People who treat others the way they have treated you your entire life and continue to treat you will only learn when treated the same. This cycle of behavior by them will continue no matter what you do.\n\nIt's important that we see people for who they really are and not just who we want them to be. Whenever we get to know someone we build up an idea of who they really are in our mind. Generally speaking this is not always accurate to who the other person really is. \n\nAn example would be getting angry at a cheating spouse or significant other. Getting upset and hurt that the person cheated is a valid response. However eventually one must come to terms that how we anticipated the person to act was contradicted to how they actually acted. If how they acted is who that person really is and we really love that person, we should love them for who they are. We should not love someone for who we imagine them to be. That's why forgiveness is important. Forgiveness is a way of processing the negativity so that it doesn't hurt us.  That being said, forgiveness doesn't mean you should stay in a relationship with someone who is bad for you, even if you love them. I know my example is for a relationship but it can applied to your situation with family relationships. You really sound like a great person born into a not so great family. Whatever decision you choose to make, do what makes you feel better. Your hesitation to help is absolutely justified and is your true feelings about the decision. Listen to yourself and you can never go wrong. \n\nBest of luck to you.",
            ">Thanks for any advice, Reddit!!!\n\nPlay them the opening scene of \"The Godfather\", then tell them no.",
            "This seems like it should be an easy \"no\". Am I missing something?",
            "Tell them they can all go fuck themselves ",
            "Literally do not give them a single penny. You endured years of cruel abuse and now they want you to clean up their idiotic mess. If it was me, I’d say something along the lines of, “You should’ve considered this before you treated me like shit for my entire life.” (If you want to be petty.) if not, I’d just say, “Sorry, we can’t do that.” And leave it at that. But honestly your family seems awful, anti-Semitic, and insecure and the only thing worse to them than you being successful is you watching them fail. You don’t owe them anything. ",
            "Look back, again, on how they've treated you. You don't owe them anything.",
            "Block and move on. \n\nThey'll henpeck you to death just like they did with your dad. ",
            "Give them nothing. They will survive, I promise. ",
            "Sounds like they made their beds and now they should lie in them. It’s not your job to bail them out. You may be related, but they’re not your family.",
            "Five adults who had a free place to live for years and instead of saving up the cash to risk on starting a business they used the house as collateral!   Think about how bad with money they all are!  Please don't give them your money.  How would you feel if you paid what is due on the house and in a  few years they decide to use it as collateral again to start another business! I doubt they would ask your advice before doing it a second time.\n\nIf anyone should be shamed for losing the house it should be your mother.  \n\nI would give them advice (if they all for it), but not money. ",
            "I think you should just let them fall.  From your story it sounds like they've never shown you a moment of kindness.\n\nAlso, kindness CAN be in the lesson. Maybe if they fall hard they'll learn how to work and be humble.",
            "You owe them nothing. If anything, your \"mom\" owes you your dad's love.\n\nThey're just trying to leech on **your** money. They stepped on you for your whole childhood, and now that they fell themselves, they're expecting from you to lay on the ground so they can step on you to get up better. ",
            "At this point you’re family in name only. These people don’t treat you like family, they treat you like a stranger they don’t like. And as such you don’t owe them anything as they don’t have a relationship with you. Please do not give away your hard earned money to these very mean people",
            "Offer to buy the house, be sole proprietor, kick them out, save family house for your dad's sake.",
            "Don’t do it. They’ve made their beds. \n\nDon’t sacrifice your own financial future for people who’ve belittled you all your life and clearly wouldn’t do the same for you.\n\nNow is a great time to go no contact. Don’t even bother saying no to their pleas. Block them and never look back. \n\nI’m so, so sorry you’ve had to deal with this. My family is shitty as hell too. I feel your pain.\n\nEdit: please post an update when you decide what to do!",
            "Nope, OP don't do it. They took the gamble they knew the risk. Don't help them. The fact they didn't come to you wedding and said I told you so about a miscarriage. They disgust me. Sorry to say. But it looks like karma needs to teach these people a lesson for once.",
            "Maybe you could take over the house if the bank sets it for sale, just to f*ck with them... like Jesse in Breaking Bad...",
            "Don't do it. I don't say this lightly. They've made a bad situation, and you'll feel bad whatever you do, but trust me, you'll feel much worse in the long run if you give in. \n\nSpeaking as someone whose in-laws have taken me and my wife for fortunes, it's a horrible  horrible feeling, and it won't stop til they're dead. I guarantee if you cough up for this, their immediate reaction among themselves will not be \"Thanks\" to you, but rather \"Well done\" to themselves, for convincing you to part with your hard earned money. \n\nFor the love of God, say no.",
            "DON'T GIVE THESE ASSHOLES A PENNY. Enjoy your life and your bulldogs.",
            "The only way to loan them the money would be to draw up a legal agreement through a lawyer, with the house as collateral.  Do not loan money to them any other way. No promises, no gifts.  A proper loan with security for you.  You could give them a discount on the interest, that's all.\n\nHowever, I wouldn't even do that.  They made it clear you're not family but all of a sudden, now that they've dug themselves into a hole, you're supposed to be the good brother and son, momma's gonnna be homeless, boo hoo hoo.  Bull!  Five earners in the house, they need to do the hard yards themselves.  I wouldn't be surprised if they went into that ridiculous business venture knowing that they would always just guilt you into giving them money if it went badly.  I don't believe there's power in mercy, not when you're dealing with jerks. Do not give them money. They'll sneer at you for your weakness and you won't see a cent.  Walk away.",
            "Nope, lending money to the financially unwise is throwing money down the toilet. You can forgive them eventually for yourself but don’t have to lend them money. Your family is who you choose, and they don’t act like your family.",
            "No is.a complete sentence.\n\nCongratulations on your family-the one you married into.\n\nI don't know who those other people are, but they aren't your family.",
            "And why can they still text or phone you? You should have blocked them on your phone and every social media channel years ago.\n\nYou didn't have a positive word to say about them in your very long post.\n\nYou don't need our permission, but here it is, \"It's time to choose your intentional family, and your mother, sisters, and your brother-in-laws are not family. They're mean, spiteful, verbally and abusive people who happen to share your DNA. Don't give this another second's thought. Block them, and don't give them a cent.\"",
            "Always be broke to these people. If they need a dollar for the vending machine, “I’m so broke”. If the topic of new cars comes up, “man, I’d love a new car but I’m so broke”.  Don’t ever discuss your money with them except to be broke. ",
            "Dude let the house foreclose and then buy it from the bank, you deserve to have your childhood home back.",
            "Outside perspectives on what to do? Tell them to get knotted!",
            "I would not help them at all, however on the flip side if I did help them, I would have a lawyer to draw up a contract for the loan to where you have a lien on that house to where you can take possession of that house and do as you please, because chances are they're not going to pay back that money anyway and they are going to try to continue to use you. If you allow them to, make sure you have a lawyer draw up a contract of some sort for repayment with them putting up some sort of collateral. I recommend on this particular situation that if you decide to help them, you put a lien on that house until it's paid off in full. At that point you will see just how serious they are about being family. Either they will sign it without argument and at that point you may see that they are serious about being family , or if they do put up an argument or try to renegotiate the terms  to benefit them, then you know they're not serious. If they try to get out of the payments back to you, you can easily take possession of the house. In reality though, I would not help them. Let them help themselves the way you have helped yourself. By asking you for the money they are looking for a quick fix rather than trying to help themselves by getting jobs or whatever.",
            "The fact that they need your money and aren't even asking NICELY or pretending to not be asshats when BEGGING FOR MONEY is almost comical. \n\nLet the house be repossessed, and then buy it for yourself and your wife.",
            "Your wife is absolutely right that there is power in mercy.  But on your own terms, not theirs. \n\nDo not give them money as that will define the kind of relationship you will have (i.e.a purely financial transactional one). \n\nInstead, *if you feel up for it*, invite one of them over (maybe your mom) for dinner or something. See if you can build a genuine relationship with one or more of them gradually over time. This will involve, at some point, you calling them out on how they mistreated you. If they can truly hold themselves accountable, and express sincere remorse, then there’s room to build a relationship.\n\nIf they can’t, and act entitled or manipulative or defensive, then it’s their choice that your relationship stay stunted. Obviously you don’t owe anyone anything, especially money, to stunted relationships.\n\nBe prepared for them to call you & your wife “greedy Jews” etc. They sound like that kind of people. Don’t let it get to you. Show generosity to others. \n\nGood luck.",
            ">  they all always have a big Christmas party every year and never invite me or my wife\n\nJesus Christ\n\nBlock these people on everything and stop talking to them.  I'm sorry you have to go through all this, but it looks like you landed well on your feet and are a good person.\n\nIf you give them money you will never see it again, nor will they change the way they treat you. ",
            "You should know and get your wife to understand that you will never see most of that money back. Your family does not respect you, they just want your money. So after a few months of paying they'll run out of money again and come up with sob stories and start blocking you. So make sure you and your wife do not expect that money back.\n\nYou could just buy the house from the bank/them if it gets them out of the debt. And you get the house. But that's another issue as they'll come for you to continue letting them live there. Even the rent on that might not come if you allow them as tenants. They just don't respect you enough.",
            "Others have said many insightful things already, but I just want to say that I think your family was very abusive to you, even if they didn't physically abuse you. What they did was horrible and nothing they can do now could even atone for their sins. From the look of it, I don't think they even see they did anything wrong and they never would.\n\nJust cut contact with these selfish assholes. Your life will be much better without them.",
            "If 4 adults put together can't afford their home, thats on them. Don't give em a penny, just because they're biologically related doesn't mean their family. If you want to be kind, maybe put away some of that money you have saved up into an investment fund for your nieces/nephews for when they're old enough to go out on their own. But you don't owe anyone anything",
            "Don't give them anything, fam :/ ",
            "Do not help them. Set boundaries. These don’t seem like people who would ever help you in return if you ever needed it. ",
            "I’ve gone through something similar living with a ‘victimized’ sister who has blown through money, friends and stability her whole life. She now feels she can depend on me and my brother to bail her out of her problems now that both of our parents have passed. At times, both me and my brother have tried to get her on her feet, but her choices always led her right back into despair and neediness. She begs for help but for the past few years, we have told her ‘no’, ‘no more’ repeatedly and guess what, she’s somehow making it. I have no idea how but I don’t ask and have taught myself not to care even though it goes against every caring grain in my body. Tough love, my friend.  Put your wife and your marriage first. I guarantee you if you bail out your mom and sisters now they will be back in a few years for more. It’s who they are and what they do and you will never change them.  Best wishes, push through the guilt and focus on the people who bring you joy and value your contributions in life. You won’t regret it. Good luck!(P.S.  This was my first post.....hope it helped! :) )",
            "As a fellow scapegoat, I empathize entirely.  This is the sort of situation that continues to come up.  On the one hand, these people have been cruel to you your entire life, and don't treat you with the respect they would a stranger.  On the other hand, because we bond with our family no matter what, and they know exactly how to manipulate you, you feel you have a sense of duty.  Unfortunately, you can never, ever, win.\n\n\n\nIf you give them the money, they'll resent you for it.  If you don't, you'll never hear the end of it.  It's lose/lose.\n\n\n\nA suggestion might be to consult with a lawyer, and draw up some legal documentation for a proper loan.  You could then hold them to whatever stipulations the loan has.\n\n\n\nIn one version of the future, you might actually get paid back, but don't hold your breath.  In another version of the future, you could end up owning the house and charging them all rent. \n\n\nI make the loan idea because it's a middle of the road-type compromise.  You'll be able to say that you offered help, but you'll be hated for wanting repayment.  \n\n\nIt's unfair, but whatever happens, you're going to have to show a lot of strength.  It's very tiring having grown up as the scapegoat.  ",
            "For the love of all that is holy, do not give them a cent. From what I’ve read, they seem like horrible, selfish people.\n\nIf you love your wife and have any self respect, you will say, “NO.”",
            "Just wanna add my voice to the hundreds already here. Fuck em. You got yours without them, they can get theirs without you. They're not your family. Family doesn't do that kind of shit. You seem to have a great family through your wife though, keep that. You'll be fine. :)",
            "Dont help them, it's called karma, let it hit them full force.",
            "Hi OP, fairly new person here, just 22 years old. The way I was raised, by my loving parents, was always to show mercy to those who deserve. IMO your family doesn't. They're straight racists (kinda stereotypical, considering the place). I have hard time expressing my feelings, but this is only time I felt infuriated reading. IDK why. Maybe because you're so good at letting things go, and overcome so many problems and negativity that, forgive me for saying, really make me jealous of such determination, but, at the same time, make me relieved to see a good person like you succeeding. So, you, who stood up by yourself, putting up with all the bad treatment, have the right to be selfish once. Not saying this because you deserve a revenge, but because you deserve a slack, or better saying, you doesn't seem to be a vingative person. I recommend talking this over with your wife once more, and lay in the table all the cards. This is one decision you don't need to make alone, your wife support you, and I think it would be good to tell her everything (if she doesn't know) of the treatment you both receive.\n\nAnyway, good luck op",
            "So sorry you are going through this. Only give away whatever you feel happy to give knowing you will not get anything back and it may be misused or wasted by them, plus there will not be gratitude. No point in giving away too much and creating more resentment and anger inside yourself.",
            "Wowwwww. You put up with a lot more than my DH did. \nWe sat down to a meal with some family members who knew my Jewish background and then proceeded to say some off stereotypical and incredibly untrue things about it.  After that visit he promised me I would never have to associate with them again. And so far I never have. \n\nYou need to block these people from your life. And if necessary send a cease and desist letter or an RO. they will never stop. Also freeze all your accounts just in case your Mother still knows your social. ",
            "It doesn’t make you a bad person to say no.  Something that’s easier to say that to feel, I completely understand. But at this point I’d more likely advise you to cut contact before giving them a dime. It doesn’t sound like any of them has a single redeeming quality. And as a decent person, I wouldn’t ask my family for help at all (if it were my big mistake like that), for the guilt, let alone demand it and expect it. They are wrong, and they are going to have to figure it out for themselves. \n\nGood luck! It will be hard.  It was always hard for me, not matter how many times my mom took advantage. It took me a very long time to learn that biology doesn’t matter near as much as it seems. Just because she bore me and kept me alive doesn’t mean she loved me. And it doesn’t mean I owe her anything. ",
            "5 people with jobs can make a mortgage payment easily. \n    \nThey have not even tried.  \n   \nEven 4, excluding your mother, could do this.  Time for them to get fast food jobs and eat their words.  \n   \nIf you give any assistance, you at least need to tie the aid to conditions.  Like employment.",
            "Yeah definitely hit them with a spicy one saying \"maybe you should try managing a whataburger\"\n\nPeople like this are users, cut them off homie. ",
            "I would let them lose the house and then buy it when the bank sells it. The power in mercy is whether you rent it back to them at a reasonable price or you just live in it yourself with your beautiful Jewish wife and French Bulldogs in peace.  ",
            ">My wife says it's up to me whether I want to help or not, but she also says that there is power in mercy.\n>\n>I don't know, though. I think she's bigger than me in that way.\n\nI think you and your wife sound like amazing people, if you can even consider helping people who treat you so badly. \n\nI personally wouldn't help at all, but I don't forgive the kind of stuff you've described. I feel bad for the kids involved, but all those adults should deal with the consequences of their stupidity. ",
            "They didn't go to your wedding, they were jackasses when your wife miscarried, and they don't invite you to Christmas parties or mention that you weren't there? They are actively excluding you from their lives...\n\nLessons aren't learned if the person avoids consequences of their actions all together. From what you wrote, it sounds like your mom has objectionable views on the roles of males in life and a fair amount of that may have been impressed onto your sisters.\n\nFrom an outside perspective: your mother and her daughters sounds like disgusting people. Everyone has different ideas of what constitutes \"family\", personally I believe those 3 haven't been doing their fare share. In my opinion, if they can't tolerate you when times are good, then they have no right to invoke the \"F\" word (family) when times are bad.\n\nIm sure you have spent a lot of time thinking about this, and it many ways it may seem like paying this money would act as a \"Sacrifice of Jesus\"-esque moment where he without sin gives up the most as a show of love. Maybe you've considered that paying the money would show them that they have been wrong about you all along. But I doubt those 3 will perceive it as such if you pay, in many ways it would just show them that their attitude and views of you are correct: kick the dog when he's around, but when the cupboards are empty he'll bring home rabbits. Then go back to kicking him once your bellies full again.",
            "Don't give them a god damn penny. ",
            ">there's power in mercy.\n\nThere is even more power in letting go. ",
            "Don't pay them, of course.  I'd wait until the bank foreclosed, then buy it and rent it out to a Jewish family.  But I'm mean like that.",
            "You know what will feel worse than not helping them and watching them suffer the consequences of their own actions?  Rescuing them out of their own self-inflicted disaster, and then have them still treat you the same as they always did.\n\nThis part of my advice may not be popular here though - you may want to try to find some middle-ground measure to provide a little help without coming off completely heartless.  Not because they deserve it, but because they're still your family, and because once people are dead, you don't get any do-overs.  \n\nYou may have some pangs of regret later once they start dying off later in life if they cut you out of their lives completely over this, or you may not.  Just make sure you can live with a worst-case outcome if you take a hardline approach to this if you think it's a possibility...  How you feel today may be different from how you feel a few decades down the road, so think it over carefully before you act, but don't let yourself get walked on either...\n\n/my 2 cents...",
            "See if you can buy the house through a short sale as low as possible then kick them out ",
            "The only thing you need to be doing is putting credit locks and identity theft detection on all your accounts.",
            "Others have already said everything that needs saying about the perils of giving in to this request.  \n\nI would like to tell you - you are allowed to make *whatever* decision you like here.  You don’t have to balance the scale to decide.  That is, you could choose not to help them even if they had been the most loving, generous family in the world.  You could choose to help them now even though they have treated you appallingly.   It’s not about what is deserved - it’s about what *you choose*.  You do not owe them this help - and wouldn’t even if they were stellar people.  \n\nThe people you described are people who have wasted riches.   They should have built capital not lost it - how can five working adults with no mortgage not accrue savings over more than a decade??  Their own folly has led them here.   Assume that they will not change their ways going forwards - this will not be the only time they run into financial trouble.  \n\nIf you *did* decide to help them, there are exactly two options.  \n\n1. Give them money freehold.  Don’t loan it, don’t expect it back.  \n2. Involve lawyers.  \n\nI’m going to assume we’re all clear on what 1 would entail and jump straight to 2.   You do have a strange opportunity here if you want to take it.  You *could* bail them out - on the agreement that you are purchasing the house.   It is possible to wrangle this to have the house and contents (especially antiques etc) put into your name, have some restoration of the inheritance your dad meant for you to have.  You would need to work out an absolutely ironclad contract with a lawyer - perhaps they would pay duties, maintenance and tax until your mom died?  Maybe a small bit of rent as well?   Maybe $x put into a trust each month to balance against your costs now - to be divided amongst the kids when mom dies?  Over years it could accrue at least as much as the house is worth, and in a trust fund it could not be whittled away.   And you would get the house as well as your cut of that trust money.   \n\nThat kind of thing is what you ought to consider.  It would need to be *bulletproof* legally, and you would have to *want* to do it.  The house would have to be worth the money and in fairly good nick.   It would mean tangling with your family - weigh the cost of that.   It could get messy and ugly.  It’s risky.   But if you’re keen to reclaim the property your father meant for you to have, if it is a sound financial decision (ie the house/land will increase in value not decrease) and if you can afford it, it *is* an option. \n\nThe safest option is to leave well enough alone - but you sound shrewd and canny enough to be up to this kind of task, should you decide you want to be.  ",
            "Tell them it's all tied up in an annuity and you can't touch it",
            "I must admit that my first reaction on reading this was to let them lose the house, then buy it from the bank after they moved out, and don't let them back in.\n\nThis plea for money is all about manipulation, and has nothing to do with relationships. They know they could badger you in the past, and that's why they are badgering you now. It doesn't change their racism, to be sure.\n\nMy counsel is to not let them have the money. While it is nice to have some things from the past, you have to acknowledge that some stuff is only in the past: I might recall fun times with my grandparents in their home, but they died, and the home was bought by someone else who made it into what they needed. Even if I had the resources, I wouldn't acquire that home; I can't turn back the clock and make it what it once was.\n\nSo cherish the positive things you remember, but let them get out of their own hole.",
            "I mean, I would have cut them off no contact after their disgusting antisemitism and insults about your wife. You don't owe those people anything, their not behaving like family in even the smallest way, you've built a new one with your wife, her family and your puppers.\n\nRead an article called The Debt by Emily Yoffe, it's on The Slate. It's very good, and might help put this in some perspective for you.\n\nYour wife is a kind lady, but unfortunately kindness to people like your mother & sisters doesn't get you grace, it gets you used & abused.",
            "You would be insane to give them money. There would be no power in bailing them out, as they are too awful and narcissistic to conceive of your kindness and would likely call you an idiot behind closed doors.",
            "The crack addict down the street is nicer to me than your family has been to you your entire life. Why don't you just cut off all contact with them? They add 0 value to your life. ",
            "\"No.\"\n\nThese people are not your family. Your wife, your dogs, your in laws, and your friends are your family. The people you grew up with don't deserve the privilege of being considered your family.\n\nLeave them to their karma.",
            "No, just don't. It'll never stop. ",
            "The years of mistreatment followed by outright bigotry toward your wife, combined with the manner of their \"asking\" would lead me, if I were in your shoes, to tell them to go fuck themselves. \n\nYou might want to tone that down to a simple \"No, thanks\". \n\nOne alternative would be to offer to pay them, in exchange for legally signing over the deeds to the house to you and your wife, but someone more knowledgeable in law than me should be consulted about that. Then at least they could not pull the same trick again and ask you for yet more cash. However, I don't recommend doing that, as they'd find some way to fuck you over as your tenants (even if they were charged no rent), and you'd remain tangled up in their lives.\n\nOr perhaps you could simply wait and buy the house when it comes onto the market, after they default and are evicted.\n\nI would say \"No\" and leave it at that. If you're lucky, they would cut you off entirely and never speak to you again.  \n\n",
            "Everyone has covered most everything I’d say, so I’d just like to add that your wife sounds incredible.  You drive a car that is nearly 2 decades old, your family sucks and holds racist views of her, and yet she still lets you come to the decision on if you should give them a significant sum of money.  \n\nYour wife is trusting you to do the right thing, and that trust is a pretty amazing thing.  Do the right thing and don’t cut these assholes in on what you’ve built with her.   ",
            "I dont feel compelled to comment often, but f**k them, karma is a b!tch.",
            "Let the bank take the house and try to buy it from the bank. ",
            "You would be insane to lend them any money. They treat you like dirt and are shameless leeches. DO NOT GIVE THEM ANY MONEY!! Especially when they’ve been so cruel to you AND your wife. Don’t do it!! ",
            "Wait for the bank to forclose on the house, then buy it after they're kicked out. Live in it and refuse to let them even visit, let alone rent it.",
            "I think it's clear what to do.  Nothing.  You just have to do nothing.  This isn't a situation where you \"owe\" them and have some obligation to even consider this.  Even if your family was nice you still don't owe them a financial obligation of any kind.  If it makes you feel better you can always help your mom out with renting a place that's appropriately sized for her (e.g. doesn't have a bunch of freeloaders in it).\n",
            "sounds like you should not only not give them a loan, but never talk to them ever again.  Seriously, I'm amazed you still are willing to have any contact at all.",
            "They won’t learn life lessons, learn about putting evil vs kind into the world, cause and effect and more if you do this.\n\nI wouldn’t return a call or SMS, I’d write a snail mail letter explaining all that they’ve done to you, all the ridicule, all the emasculating, etc.\n\nIf they don’t support you, they can’t expect support in return.",
            "Dude even if you bail them out this time thell just eff it up again and your money will have gone towards nothing. And you only know what they tell you anyway, which is a sob story to guilt trip you so they can take advantage of you.  \n\nPlease don't help them. You'll be better off for it. ",
            "Help them or not, you’ll still be treated badly by these pieces of work. Please take care of yourself, your wife and the people that have been good to you. ",
            "If they had asked your advice on the yoga studio and you said NOT to do it, would they have listened?  But now they come to you?  Lol.\n",
            "Nope !!! You shouldn’t do it OP. Do not give them another reason to keep using you!",
            "You need to go no-contact with your shitty family. You're an object to be used with contempt in their eyes. Go buy yourself a new car and let them see where your priorities lie.",
            "Why dont you ask them why 5 successful adults living in a single household are all relying on the fast food worker who would never amount to anything to give them money so they can keep their house from foreclosing? \n\nDon't give them money. You'll never get it back, you'll never get the property, you'll never get invited to that Christmas party and you'll never get closer to your sisters or mom. ",
            "1. Don't help them. It's ok to say no. They will all land on their feet. I don't think your dad would have wanted you to help them, as he seemed to try to protect you from them, but failed. Do for yourself what he couldn't do for you. \n\n2. (this is unsolicited) Cut them out of your life.  ",
            "Reading this has made me sad for you.  What's worse is that I have seen this almost exact scenario in a friend's family and it was just plain abusive the way they treated the dad.  The only son had to escape completely, like you did.\n\nOffer to buy their house and then you will own the family home.",
            "Let them get foreclosed and buy the house back from the bank ",
            "don't reward their actions. sometimes being the bigger person is letting others fail to learn a lesson.",
            "> My wife says it's up to me whether I want to help or not, but she also says that there is power in mercy.\n\nThat's not mercy, that's just rewarding and enabling abuse.\n\nAlso, *why do you have any contact with these people at all?* These are toxic people who do nothing good for your life. Cut them out entirely and move on.",
            "I'm a jerk. I'd buy the foreclosure then evict them. Yes, i have issues. ",
            "Your whole story is SO messed up... wtf did I sadly read, really... \n\nI've not had an easy childhood (foreign father getting banned form my home county because of rape suspcions, me going to a kid shelter afterwards because my Mom was juged unable to care for me, then father killed himself when I was 9 and much more nasty shit but at least I was circled by almost only good and caring people (my mom being the most caring of them all) but your story is in a way more fucked up than mine and I mean it...\n\nIf you TRUELY believe that you helping them would improve your relations with your family (and if you actually want that), DO it but otherwise, don't do a single thing to help them. Though, to be brutally honest, from what you've told us, it seems they are just using you because they fucked up HARD but won't considerate you more afterwards in the slightest so personally, I would not help them and let them learn it the hard way. It's really Karma or whatever you want to call it, at this point. ",
            "Send them fast food applications ",
            "You know, we see a lot of stories like this on here, why is it so hard for these OPs to these shit heads to fuck off? This doesn't even seem like it needs an explanation. Seriously, read what you just posted and honestly how could you think you need any advice? Screw those people. Or throw everything that you just put here in their face.",
            "They don't deserve a penny and you owe them nothing. They've thrown your inheritance away and you've gained nothing from them. You'd probably be better off cutting all contact as that's usually what's best for every Cinderella situation.\n\nHave you been to r/raisedbynarcissists ? You could probably benefit from that sub and their advice in this situation may even be better than here.",
            "If you give them money, it will teach them that they can be terrible human beings (to their own kin, no less), and still get whatever they want and have no consequences). They're trying to guilt you into helping them, without actually apoligizing or groveling. This is appalling. I would personally say, \"I am happy to give money to help my family, a family that has shown me love, respect and gratitude. However, I only recieve that from my wife's side. Try getting a job at a fast food place.\"",
            "Wait till the bank forecloses on the house, then buy it if you want. If you have enough pity on your terrible mother give her the guest house to stay in.",
            "Please do not do it. They will use and throw you away. ",
            "I'm so sorry that you have such manipulative family members, who always treated you like trash and disrespected you.\nOf course there is power in mercy, but even if you do provide the money their behavior toward you will remain the same. They only see you as an answer to their problems and never once showed respect or any care for you. You know they don't deserve it. Helping them won't even make you feel better because you will be sacrificing yourself for people who never did the same and who cut you off a long time ago.",
            "In your entire story you did not write one sentence where I thought you should help these assholes.  Cut the rot out of your life. ",
            "I have to chime in a little late to reiterate that loaning them money is not mercy or strength. It will not change any part of your relationship with these people. Instead, it will turn your role into that of your father, and they will never stop thinking of you as a bank. Save that money and help your mother in her old age. Any money you give them is likely to be wasted again, and you will still be expected to help your mother as she ages. I only say this from experience as a scape goat who lost a great deal of money in hopes of earning love. Best wishes to you. ",
            "\"she also says that there is power in mercy\"\n\nThat's beautiful, as are you & your wife.\n\nI think, considering your birth family, that you did an amazing job creating a life for yourself, you should be very proud. You also created a family you can depend on & respect. The type of parents that anticipate *your need* of a new car & are there generously offering you one, no strings attached. And gracefully & respectfully accept when you decline.\n\nYou, your wife, your in-laws. That's why I would have savings. So that the people who love you & care for you are secure. That if something unexpected & financially devastating should happen to them, you have the resources to help.\n\nYour mother & two sisters are adults. There are two spouses involved, this was their business too, they can go their families for help. Their requests sound tinged with anger & antagonism, they know they're out of line. All ***five adults*** have to do is to bring their payments current. They don't have to pay off the whole thing, they can get a mortgage, your mom could do a reverse mortgage, there are many options available. The option I encourage you not to take is the one where you shoulder the cost of their entire failed venture, they resume living with no debt.\n\nI think your father would applaud the life you created, adore the woman you chose, tell you that you're not to step into his shoes & allow their cycle of abuse into your life. It's not even a matter of a history of mistreatment. It's still ongoing. The comment about your in-laws, your poor dad, all the rest? No, just no.\n\nBest wishes to you.",
            "How do they know you have money? To me that's rule #1 for families and friends.  Damn I'm broke (I'm not). Any money I do have is in retirement plans and I can't get to it. Sorry. \n\nNot a thin dime to them. \n\n",
            "It sounds like your family died fifteen years ago in that heart attack.  You aren't family to the rest, you're an option.  Your brothers-in-law don't call you up to hang out.  When was the last time you were invited for dinner?  Got a call on your birthday?\n\nPlus, that whole racist, anti-semitic thing, that's, uh, something.\n\n*Sorry, mom.  All their jew gold is tied up in hosting the Bilderberg meeting this year.  Dollar is tanking against the Euro, and, oh, right, I don't need to tell you about this, you already know!*",
            "I think you have done a marvelous job getting all this off your chest.  Quite a story and I admire you for taking control of your life and making it with no help whatsoever.  I would think that the majority of those in your same situation would not have done as well.  \n\nI don't think you owe your family anything. I think you have done the right thing by not responding to them and I would suggest that you close the door and let these horrible chapters of your life fade and continue your own journey without them.  If you did decide to financially help them it would just be the beginning.  Nip it before it starts.  ",
            "OP, you seem like a wonderful individual. Your wife sound lovely, and your in-laws seem nice too. I'm really sorry that your blood relatives have consistently been so horrible to you, because it doesn't sound like you deserved their abuse at all. They are trying to make you feel like a good brother and good son would rescue them, but they've never been good sisters or a good mother to you.  \n\nIf it were me, I'd probably just cut them off. I would tell them that I won't be giving or loaning them money and nothing they can say will change that, but if they want to talk to me and treat me like family then they always know how to reach me. Be a little sad that the people related to me by blood couldn't even be nice to me and only wanted to use me, but just focus on moving forward and on with my life.  ",
            "Holy shit man. I doubt you'll read this but I just wanted to let you know, you've been through some rough shit. I  greatly respect the fact you're even considering helping them out. I really would to love to say, just say fuck em and get your revenge. You sure as hell deserve it. If you decide to help them out, it's important to assume you'll never see a penny of it, as you stated. If you do decide to help them out, you are an incredibly selfless person. Good luck man, stay strong out there! ",
            "Yeah they're all exceptionally terrible people. Let what's coming to them come. ",
            "You owe these people absolutely nothing. Of course you want to help out because they have small children but they are adults who should plan ahead enough with such responsibilities, in order to avoid being left homeless. \n\nOnce you bail them out you can be sure that they will come back for more because they have never respected you and won't begin now, they will see your act of kindness as weakness.\n\nI mean, this sucks in so many ways but they made their bed so they might as well lie in it.",
            "Come up with a loan agreement that each of the siblings and your mother have to sign. Ensure that they put up the house as collateral. Advise them that this loan will be registered and they can essentially owe you the money and pay you back on a payment plan with interest. \n\nOnce they default on the loan, enforce the loan and get your father's house back. Then charge them rent. ",
            "There are FIVE adults in that house. They can make mortgage payments now since they have never had to before. You will not receive any recognition, or appreciation, if you bail them out. You have to look out for your own little family - your wife and your pups. Do not give those other people a penny. Let me reiterate. There are FIVE ADULTS in that house. They can pay for it. ",
            "*I'm still thinking about how they all always have a big Christmas party every year and never invite me or my wife, partly because they don't like me, and partly because they don't like the \"Jew.\"*\n\nThat's the line where i went from \"maybe consider it but be very very careful and be willing to walk away if they keep asking for more\" to \"fuck them and fuck no\". They get nothing and I would NEVER talk to them again",
            "Mercy would be buying them some food when they're going hungry. Giving them tens of thousands of dollars so they can continue to live their lifestyle after they've made poor choices - that's plain-old enabling shitty behavior. They've treated you like shit for years - how on earth could you even consider this? It says a lot about how they manipulated you for your whole childhood that you'd even consider it. Somehow you've internalized this notion that it's reasonable to treat people like this, and there aren't really consequences. If you really want the house or the guest cottage, then offer to buy them outright at a reasonable market valuation, so that your mom can come out of it with some cash. But then that would be *your* house. Really though, I think it'd be better to just steer clear. If you wanted to buy a house, there are probably hundreds to choose from in your city - and I have a feeling that any number of them would probably be a better match for you than the one that you grew up in (and which your family would probably hate you for buying, in any event). Ditch these shitty people out of your life and find better people to be around.\n\nIf you've got extra money that you think should be used to help someone, then find some people who are actually in a bad situation that *wasn't* their own doing. Help out some good folks who've had a child born with birth defects or something. Don't throw money at people who treat you like shit.",
            "I'm sorry you had to go through this and grew up with such toxic people who don't pay you the respect you deserve. \nYour 'family' consists of terrible people who seemingly only approach you when they need something and I guarantee you you won't get a dime back they will probably pull some shit like cutting contact with you. \nIf I were you I would tell them no and tell them exactly what you told us here. Maybe it will open their eyes, plus they get a taste of their own medicine if you cut ties with them afterwards. \nI'm happy that you found love in your marriage and your wife sounds like a wonderful person (and honestly fuck those antisemitic stereotypes does your family live in 1900?) I hope you stay strong, get rid of these toxic people and continue with your happy life. \nI wish you the best",
            "Your family sounds like jerks. \n\nJust because you might \"have the money\" doesn't mean that you have the money available, to them.  You can always say, \"We don't have that money available, sorry,\" and leave it at that. But you can definitely, as others suggested, set up some kind of trust for those kids, who would definitely benefit from summer camps and other time away from their awful family.",
            "It’s slightly upsetting to me that you’re even considering helping them out. They’ve treated you like shit, take you for granted, and you’re about to let them bully you into giving them money? Fuck that. They cut you out. They should be reaching out to help you first if they want you back as part of the family. Not the other way around. ",
            "Ignore for a moment how they’ve treated you — even if you had a great relationship with them, loaning them this money would be a very bad idea, because they are in this situation due to poor business skills and don’t have a plan, or perhaps the intention, of paying you back. \n\nSo then when you factor in the fact that they *have* treated you badly, your choice should be very clear. ",
            "How does your wife feel about this? Personally if my husband’s “family” treated me like they’ve treated her, I’d demand no contact ever again. Heck, even if it was my actual in-laws whom I like, I’d have reservations about giving away a huge chunk of our money.",
            "Don’t give them any money. Just DON’T. You’re too good for them and they don’t even deserve the time and energy you spend worrying about this situation. If you want to be the bigger person, simply decline and ignore any other begging from them. \n\nI’d be petty and tell them exactly what’s in your post, how they treated you as lesser than them and always mocked you. That it’s their own fault that you don’t want to help them out of their self made misery now. But that’s entirely up to you. ",
            "All I could think of when reading this is, why do you even have contact with these people? Much less than considering helping them? They bring no happiness or anything good into your life you don't have to have them in your life at all. \n",
            "You have worked and slaved, and earned this money. Your father would not have wanted you to slave away just to spend it on ungrateful peopls. Bless your wifey, but she hasn't had to deal with a narc for a parent. I am saying this to you op from experience.  Anyone in my family that I have ever helped, I have ended up regretting it. I always end up crying, I always end up feeling weaker, and exposed.\nThere is power in mercy, but not with these types of people.\n\nI am telling you right now what is going to happen if you bail them out. They will not treat you better, they will all convince themselves that you owed it to them. That it was the least you could do for being more successful than they are.\n\nThey won't give you anything at all in the end, and you won't earn brownie points.\n\nIf this was my family, my so would be furious I even was considering thjs. As he has grown up with narc as well, and he is NC. He can relate to what will happen. Your wife does not have that perspective because her parents are normal.",
            "If you can afford it, and it won't hurt you to do so, AND it won't bother you or eat at you when they don't pay it back, AND your wife won't have any resentment about it...\n\nThen sure, be the bigger man and do it. \n\nBut don't expect that it will change ANYTHING about your dynamic with them. All it'll do is change you from the family member everyone hates to the family piggy bank that everyone still hates. And now, they'll keep asking you for money CONSTANTLY.\n\nHave you considered paying off the debt anonymously, directly to the bank?",
            "I have no idea why you even still talk to these people, never mind give them a bunch of money (because that's what it is, you know they'll never pay you back). I'm petty enough that I would wait for the bank to take the house, then buy it from them.  ",
            "Think of all the wonderful uses of that money, whether it be nice, deserved things for yourself, your wife, wife's family, your doggos, charities, etc. and then consider that you'd be wasting it on literally the least deserving people you have met in your entire life.\n\nDONT DO IT ",
            "OP, I'm so sorry for your loss, both of the baby and the loving and nurturing family you deserved but never got. These people were terrible to you.  You owe them nothing, and you owe yourself the gift of cutting them out of your life. \n\nIf you're still looking for a way to find grace and mercy in this terrible situation, I would direct it towards your young nieces and/or nephews. If it makes sense for you financially you could set up an educational savings accounts for them. Being able to go away to college sounds like it could be a very good thing. Maybe there are some other small ways you could be in their lives without exposing yourself to the adults' toxicity. I would probably send them stuffed animal Frenchies for a Christmas gift, but there are probably less petty things you can think of :)",
            "You're getting agreement with people here... consensus is to not give them a dime. I very much agree... but stronger in that...\n\nYour birth family couldn't even offer you sympathy when you needed it, kindness when going through a tough time, or support when you started a family. Any of these acts would cost them nothing. Absolutely nothing.\n\nAnd here now they come asking you to give not advice, not love, but just cash.\n\nPlease see your blood relatives as the rats that they are and understand that your true family are the ones that give you love and support. The blood relatives should be blocked and forgotten.",
            "Honestly, your familial story sounds like the setup to a Brothers Grimm-esque fairy tale, and the decision is yours on which path this story will go. If you decide to bail out the family who has so meticulously scorned you, they will only feel validated by the outcome of the situation and learn nothing from this situation. If you respond to them refusing to pay their debts, they'll undoubtedly crank the guilting up to 11 to try to get you to crack, and there's just too much risk of that working for them. Personally, I suggest that you do not even honor them with a response. Cut ties completely. This sort of toxicity is something that doesn't need to exist in your life, and it's up to you to cut it out. This course of actions would force them to solve their problems themselves, and if they succeed then it will almost certainly force them to gain an iota of humility. If not, they'll only have themselves to blame for not being able to clean their own messes. There's a time and place to take the moral high ground, and this is pretty clearly not it.",
            "I'm just confused as to why you settled in the same town as these keels. There are other places besides Kansas with low rent. Come to Indiana! ",
            "I'm late to this post, but in all honesty your family is terrible. You deserve better. Most if not all of these posts are telling you not to give them money. I agree with that, but let me take it a step further. Tell them no and then cut contact with them. This cycle of abuse against you is not going to stop even if you were to save their GD lives.\n\n I get that you worry about their kids. But the only thing you can do to help them is to take them out of that situation. To that effect, If they lose their house, consider informing CPS. I know it's a cold blooded thing to do, but really the kids would be better off without  such poisonous people. Who knows? Most courts would consider a close relative with a stable two person household over a complete wreck of a mother. \n\nJust some food for thought. ",
            "I would text this to them: \n\n\"I work in fast food I can't possibly make enough money to help you out. And my wife's Jewish family is pretty stingy with their money, they are Jews after all. Good luck!\" \n\nThese people don't deserve one penny of your money (it might be funny to mail them a letter with one penny in it though...). Enjoy your life with your wife and cute doggos and forget about these jerks. ",
            "Don't bail them out. Seriously man, I've been watching my father live through this and it's frustrating. They won't respect you or be grateful to you for helping them out. If anything, they'll *expect* your help the next time they screw up.  Don't enable their bad choices. \n\nYour wife sounds like a wonderful woman and so does her family. Keep that money aside for them or your wife and your lovely dogs but please, please *please* don't help out these nasty, entitled people. Family doesn't mean shit, given that they haven't acted like it your entire life. ",
            "Don’t do it. They won’t even be grateful. How can these people not pay? 5 adults and no jobs? ",
            "Your wife is wise. Be merciful... to yourself. Stop walking through glass to try and reach a family that doesn’t want you. Stop giving them residency in your heart. Stop allowing them I have any power.\n\nSilence is what they deserve. Your energy and time are much better spent on people and projects that satisfy you. Give your love to those who love you back.",
            "Hi! I am not much old. So I don't know whether my advice would be appreciated or not. \nBut, anyways, I do think that the people you wrote about are not your family. Too much niceness can be hazardous to you. So please don't give any money to these horrible people. And do get a restraining order if they try to approach you too much.\nThanks for reading.",
            "If you do give them the money put a contact together where you win either way, either they pay you back or you get the house ",
            "I can’t understand why you’d even consider helping them.   They have treated you like dirt for too long for you to even consider it.   \n\nYou don’t need them in your life at all.  ",
            "No, no, no,  If you give them money they’ll just blow it can come back for more.  They’ll never stop asking.",
            "I definitely don't think you should help them simply based on how you've been treated. However, also don't forget that there are several able bodied working adults living in the home. Considering they've been living rent free,  your sisters/spouses should have been able to save some money. And if they're spouses are working as you've started, another option is for one of them to take out a loan. It sounds like at least 5 adults live there, I'm sure they can come up with a solution. It also sounds like you're an easy target for them like \"hey, before we put our necks out there, let's ask Bro to fork over the money\". \n\nEven if you give them the money, you're not doing anyone any favors. I'm guessing you're just delaying them losing the house in another few years because clearly none of them are good with money or decision making. You're basically enabling them which will later becomes society's problem and I don't want to pay for them ever. So please don't give them money or we'll all have to later. They're in a good position to problem solve or learn a valuable lesson before it's too late. ",
            "Just read your post over. You KNOW you should not give them a dime. It is your hard-earned money and you and your wife have a future together. They will want more and more after you bail them out anyway.",
            "BLOCK THEM ALL\n\nYOU WILL NEVER SEE A PENNY BACK AND IT WILL STILL NOT BE YOUR HOME\n\nENJOY YOUR NEW FAMILY\n\nPS Dogs are better than kids",
            "Two years ago i stepped in and became a foster parent for my four nieces and nephews in a time of need.  After my sister had gotten the help to get her kids back, my wife and i extended the olive branch to her in hopes we could get her on her feet.\n\n$200,000 of capital later, and we are back to her not having the kids and a custody battle with the husband. \n\nIf your siblings cant learn on your own, dont financially get involved.  Tell them that you have a couple of positions available at work if they need the extra income, but dont go and give them anything.",
            "They may be blood but they’re not family. That’s a solid no, dude. ",
            "I’ll also say - \nIt isn’t always mercy to save people from their own actions. ",
            "Step 1:  Let the bank foreclose.\n\n\nStep 2:  Show up to foreclosure auction or contact the bank about buying it direct.\n\n\nStep 3:  Buy the house.\n\n\nStep 4:  Sell it for a profit to someone else.\n\n\nStep 5:  Live your life in peace, far away from these people.",
            "Don't give them one red cent.  They're using you.  \n\n",
            "they're just using you. Don't do it. ",
            "I would not give them a darn dime. I am inwardly seething just reading this. Your wife has a good heart and you are lucky to have her but my response if they asked me would be no, No, and NO!! \n\nThey will not treat you better after you give them the money and you are taking away their power to be adults if you save them from this. They are adults and they knew the consequences. Just say no. ",
            "If you're concerned about the kids, put in an anonymous call to CPS about financially irresponsible parents endangering the welfare and stable living environment of their children. \n\nGood on your wife for saying that there's power in mercy, but if you're family deserved mercy, they'd have excercized it.  If you really feel guilty for not offering money, send them a nice letter and a real estate catelog (idk if that's a thing or not) with anything you think they can afford right now highlighted.\n\nThey don't deserve a damn ounce of your mercy, they will hardly deserve your forgiveness on their death beds.",
            "Shame you couldn’t buy the house and rent it to them through a 3rd party so they don’t know and have them pay rent until the house is paid for",
            "Or to be a turkey you could bail them out and make them put the house in your name :) but honestly, five adults should be able to figure out a mortgage especially since they weren't paying one before and surely had a cushion saved :) ",
            "Don't bail them out. They won't be grateful if you help them. They won't suddenly realize the error of their behavior and want to be a real family. They'll probably throw some snide comment in your face and stop contacting you. It sounds like your relationship is purely biological at this point. That isn't what a family is man. \n\n&nbsp;\n\nYou owe them nothing.",
            "Tell them to work in fast food to cover the mortgage. ;) ",
            "Listen OP, I come from a family with money and the absolute thing you can do is give them any of it. It's almost like a drug for them, they'll keep asking you and asking you until you have nothing left to give. \n\nJust stop it at the buck right now. Don't give them anything, let them work it all out. \n\nSay \"no.\" If you feel the need to justify it, just say that the money is already gone and you don't have it. ",
            "financially, obviously you are not at all obligated to do anything.\n\nfrom a personal standpoint though, you need to forgive them and move on.\n\nthe first half of this post was you explaining all the things that went on in your childhood that still sound like issues you haven't let go and internalized\n\nno matter what its always best to forgive and wish them the best. \n\nI am in no way saying you should give them any money, just that you will help yourself by deciding to forgive them, wish them the best and not hold grudges.\n\nalso, not saying that by forgiving them you are allowing them back into your life / relationships, can still forgive wish them the best and cut them out if thats what you decide is best..",
            ">It's a lot of money, but money that I happen to have, and they know it.\n\nNope, this falls into the \"not my circus, not my monkeys\" area. They're not your family anymore than any other perfect strangers on the street.\n\n>I haven't yet returned any of their calls or texts yet.\n\nI would stick to ignoring them. If it helps, don't think about this as revenge for the shits they did to you through out your life but the fact these people are related to you by accident and you have no real relation with them.",
            "There’s a lot of wisdom in here, I haven’t seen one person tell you to give them anything. Your wife is a sweetheart for even suggesting you think about it. \n\nI feel really bad for your nieces/nephews though. They are in a similar position to you growing up and I’m sure you can imagine what they are going through. I think a college fund for the true victims of your siblings screw up would be the merciful thing to do. I have a feeling your “family” would find a way to steal from them so be careful.",
            "I hate to say it but you might end up like your father as a cash cow. You’ve tried to help them many times, you never responded angrily as one might, you’ve been seemingly kind to them, fool me once but not again. ",
            "man fuck your family. they sound worse than gonorrhea. "
        ]
    },
    {
        "post_id": "4iiwcy",
        "author": "choreschoreschores",
        "title": "[UPDATE] My (33F) SO (28M) isn't pulling his weight around the house, despite being told more than once it's a deal-breaker.",
        "url": "https://www.reddit.com/r/relationships/comments/4iiwcy/update_my_33f_so_28m_isnt_pulling_his_weight/",
        "score": 2086,
        "num_comments": 155,
        "created_utc": 1462787807.0,
        "selftext": "Link to original: https://www.reddit.com//r/relationships/comments/47omwy/my_33f_so_28m_isnt_pulling_his_weight_around_the/\n\nOriginal Tl;dr: After discussions with SO [28M] about how his lack of contribution to housework is a deal breaker, things haven't changed and it's making me [33F] miserable :-(\n\n\n\nFirstly, I'd like to thank everyone for their replies and the few PMs I was sent. I had to leave for work not long after I posted, but I did read everything once I got off my shift and took a lot away from the post. I thought I'd give a quick update for those who are interested. \n\n\nI gave things a fair go. \n\n\nI tried a small list of chores. That didn't work - I'd find it sitting where I left it a week later and nothing done so just done it myself. \n\n\nI had him move out and stay 3 nights a week. I think he felt this got him out of cleaning up after himself since he didn't live here anymore. I found more crap lying around than before. This went on for a month. \n\n\nIn the end I finished it. I gave it a go and the situation didn't improve - a deal breaker is a deal breaker, right?! \n\n\n\nI didn't realise being with him was affecting me so negatively that I'd be this relieved and happy after breaking up - my so-called great relationship was actually sucking the life out of me! I've since embarked on a journey of self improvement and things are going really great. \n\n\nThanks again for all your advice! \n\n\n\nTl;dr tried a chore list, didn't work. He moved out and stayed a few nights a week - got messier. Broke it off. Life is going good!",
        "permalink": "/r/relationships/comments/4iiwcy/update_my_33f_so_28m_isnt_pulling_his_weight/",
        "comments": [
            "I can't imagine being so lazy that I'd rather lose my SO than pick up a mop once in a while. I'm so happy you're happy!",
            "Any reaction from him?",
            "Good job at standing up for yourself!",
            "I'm really glad you stood your ground and did what's best for your own sanity. And I bet your place takes significantly less time to clean now without him there.",
            "I think it's especially commendable that you took it in steps and gave him a couple extra opportunities to improve, because it means you got to see the full extent of his slobbiness before making the decision. It's an extra bit of learning experience and now you can move on. Congrats!",
            "Good for you!  You lost 200lbs",
            "I can relate to your original post and I learnt a few tips from it. My boyfriend and I have been living together for about 6 months and his lack of housework is already draining me so I can't imagine how you felt. Happy for you!",
            "This is a good read for me. I struggle with alcohol and for my significant other, that's a deal breaker. I've been sober for 3 months and it's been hard but this read just further motivates me to stay sober.\n\nIt got me thinking about deal breakers and how it's not just your SO that has deal breakers; friends and family do, too. Good read.",
            "So, what, did he move back in with his mommy, who will forever do his laundry for him? ",
            "Thank fucking god! I'm popping the champagne for you OP. Well Done!",
            "[deleted]",
            "I can just imagine him telling his side of the story.  I'm sure words like \"crazy\" and \"nuts will be tossed around liberally to explain why\" he decided to move out.\"",
            "That was pretty much my ex. If I didn't like something, he was so sincerely sorry that I felt that way. -_-\n\nI say you're well rid. I know it completely sucks actually making the decision and acting on it, but it always gives you the fresh start you need. So so glad to hear you are doing well!!",
            "LPT: Don't tell someone \"more than once\" that something they're doing is a deal-breaker. If you've already told them it's a deal-breaker and they keep doing it, then you break up -- or else you're the one breaking a deal.",
            "I'm very happy for you, it was definitely the right thing to do. I wish you the best. :)",
            ">I had him move out and stay 3 nights a week. I think he felt this got him out of cleaning up after himself since he didn't live here anymore. I found more crap lying around than before. This went on for a month.\n\nWas willing to give him the benefit of the doubt up until here. It got to the point where you asked him to move out, and he still insisted on being dirty? Had to be done, you made the right choice.",
            "I think by this point it should be obvious that you gave him far too many chances than was fair or necessary.\n\nA deal breaker is a deal breaker. It's a deal breaker from the first date all the way up to the 20th year together. It's not that you have a \"quirk\" that eventually turns into a deal breaker. . . it was a deal breaker from the start.\n\nI want children. This is a dealbreaker. I told my current SO this information on our third date, and he said he is willing to have children. So far, so good. If he told me never wanted children, deal = broken. I wouldn't continue seeing him. I wouldn't continue to date him for six more months, ask him again if he wants children, and hem and haw about it being a dealbreaker if he won't have children. I wouldn't wring my hands and force him to move out of the house and then wait a month and see if he changed his mind. If the deal is broken, the deal is broken.\n\nLearn from this: next time the deal is broken, don't hang on for months and years more hoping the deal will unbreak itself. It won't, and you'll just have wasted more time.",
            "Good for you - I just broke up with my fiancee and realized the same thing. That relationship was sucking the life out of me. ",
            "I get a little flutter when we're right and everything happens exactly as we said it would.\n\nHow did he react when you told him you're breaking up because he doesn't contribute to household chores?",
            ">I didn't realise being with him was affecting me so negatively that I'd be this relieved and happy after breaking up - my so-called great relationship was actually sucking the life out of me! I've since embarked on a journey of self improvement and things are going really great.\n\nBeen there too. Colors look brighter, the world feels like your oyster and you feel full of life.\n\nGood for you!",
            "Not only did my ex NEVER do anything around the house, he was incapable of not making gigantic messes everywhere he went. Get a spoon, leave the drawer open, shave my beard, leave all the hair trimmings in and around the sink. Get home from work, take all clothing off and leave in front of front door... I couldn't take it anymore. Peace out!",
            "I'm glad things have worked out for the moment. It really sounds like things weren't right between you, and I'm sure you'll find someone better soon :)",
            ">a deal breaker is a deal breaker, right?!\n\nI read the title and was like \"oh here we go\" because it was obvious that it wasn't a deal breaker if it has been asserted multiple times that it is.\n\nI'm really glad you had the guts and the self-assuredness to end it.  It's a tough decision to make over something like chores, but as others have said, it's less about chores and more about respecting a partnership.",
            "> I didn't realise being with him was affecting me so negatively that I'd be this relieved and happy after breaking up - my so-called great relationship was actually sucking the life out of me!\n\nCongrats and all the best, OP!  It's a wonderful feeling to have your life and your freedom back after you've been in a toxic relationship.",
            "You think with the amount of breakups in this sub reddit - that people would use their head and make decisions by themselves. ",
            "Yay OP!\n\nHappy ending for you!",
            "awesome job. May your new journey be filled with light and happiness.",
            "Best. Diet.Ever.",
            "Yay for you! \n\nWhy did you move him out instead of you moving out and taking a day off?\n\nOr is this your own place? That'd be a different story.",
            "Great update OP. Now remember that you deserve the best and the best doesn't have to be trained or reminded constantly. \n\nGrateful for my guy reading threads like this. He does what needs to be done. Not to shut me up but simply because he's a responsible adult doing his share. ",
            " a deal breaker is a deal breaker, right?!\n\nRight!",
            "In your other post you mentioned that you were open to other points of view so even though it's after the fact allow me to toss out a possibility. \n\nFirst off, no matter what, it's not right that he seemed to ignore a clearly stated need of yours. That and being that you were the primary breadwinner, he should have been doing more of the housework. \n\nHere's the thing it's two sort of intertwined but not identical points having to do with knowledge. Even in this day and age, there are guys out there who have never been shown how to do housework.  And if you had a tendency of going after him and re-doing it on the rare occasions that he did do something, then it's possible that he developed a \"why bother if I can't do it right\" stance. This is all the more likely if he had an impossible to please parent(mother especially) growing up.   Just to be clear, there's nothing in what you said to make me believe that any of this is necessarily the case, it's just a fairly common dynamic that I've come across, and personally experienced. ",
            "Good for you, OP",
            "Having him move out and only seeing each other half the week was BRILLIANT. He knew he literally had more than one foot out of the door and he still didn't get his shit together.",
            "Well done, OP! Keep it up. ",
            "Good on you!  I had a similar situation.  Dude actually didn't even know how to blow his own nose, and amid the rest of the mess, he would wipe his boogs all over the walls.  I've never once regretted leaving.  Every time I look back, it's with a sense of immense relief that he'll never be back here.",
            "I like these updates with realistic happy endings",
            "The best thing I've ever done for living with an SO, and living with roommates: Get a house cleaner. Worth the money. ",
            "[deleted]",
            "Sounds like you both dodged a bullet. ",
            "[deleted]",
            "Lawyer up. Gym up. Lock up. ",
            "[removed]",
            "[deleted]",
            "[removed]"
        ]
    },
    {
        "post_id": "xj9pyx",
        "author": "AmberSnowSex",
        "title": "How do tell my sister her toxic marriage is why I don’t hang out with her anymore?",
        "url": "https://www.reddit.com/r/relationships/comments/xj9pyx/how_do_tell_my_sister_her_toxic_marriage_is_why_i/",
        "score": 2088,
        "num_comments": 147,
        "created_utc": 1663682694.0,
        "selftext": "I (38F) am having trouble being there for my sister (32F), and I’m not sure how to tell her why.\n\nI’m about two years out of a 17-year marriage that ended extremely badly. We had issues throughout the relationship (as well as a lot of fun), but the last couple years he was intensely controlling, abusive, and violent, and since he left I’ve done a lot of work to recover and get myself in a healthy headspace.\n\nMy sister went through a rough patch around the same time my divorce started, and I learned way too much about her husband (37M) during that period to ever trust him again. They’ve been together for years and while he’s never been my family’s favorite (insufferable know-it-all, dominates every conversation, generally pretty annoying), we all just dealt with it because she loved him and we’re adults. \n\nBut since their rough patch, I haven’t been able to be around him. During that time he served her with divorce papers and told her he was going to take their <1 year old baby away and never let my sister see her again. He convinced my sister she would lose in court anyway, to the point that her plan was to give up, sign all the paperwork he gave her, and leave their baby while she moved out of state with our other sister. This all sounds bad, but my sister is extremely naive and also has the worst anxiety I’ve ever seen. She was convinced she’d lose their baby no matter what, and she was so broken down she didn’t have it in her to fight. Anyway, she told me this plan and I successfully talked her out of it, got her a great lawyer, and she was on her way towards accepting their divorce and rebuilding her life when he suddenly changed his mind and they reconciled and have been acting like everything is fine ever since.\n\nDuring her eventually-abandoned divorce, my sister was terrified of being homeless and not having anywhere to go. I was starting over too, so our plan was that I’d buy a triplex and she and her baby could live in one of the units, me in one, and our little brother (22M) in the third one. I went ahead with that plan and have just been renting out my sister’s unit and let her know it’s there if she needs it.\n\nI cannot be around my sister’s husband at all. I’ve seen behind the scenes. I know he’s abusing her emotionally, financially, and I strongly suspect physically too, although she’d never admit it. \n\nI am aware that the right thing to do here is support her decision, and grin and bear his company, but I can’t do it. I get that it’s immature of me, but the situation is too much like my own marriage, and I won’t be within 100 feet of it. I especially don’t want him in my new home, which for two years has been a happy, heathy, peaceful safe zone.\n\nMy sister basically won’t leave the house without this man (because of her anxiety and also his control issues), and they are literally ALWAYS together. She posted on Instagram a few weeks ago about being sad and confused about why her family never spends time with her anymore. I’d like to gently explain the situation to her, but I’m not sure how to tactfully say “it’s not you, it’s your awful abusive husband we can’t stand.” Looking for advice on how to softly tell her I’m here if she needs me but that I’m unwilling to be around her husband.\n\nTL;DR How do I tell my sister that I love her and want a relationship but that I can’t be around her abusive husband because he triggers my own relationship baggage?",
        "permalink": "/r/relationships/comments/xj9pyx/how_do_tell_my_sister_her_toxic_marriage_is_why_i/",
        "comments": [
            "This is tricky because right now, she’s in a dangerous phase. The phase where they’ve reconciled, and it’s them against the world. \n\nUnderstand first and foremost: anything you say right now WILL get back to him. \n\nMy suggestion is to make it clear that you simply want to spend time with just her. Don’t say it’s an issue with him. Become a broken record and let her make the connection. “It’s really important to me that you and I can spend time together just us. Can you find an opportunity for that?”\n\nShe’s gonna push. “You don’t like him?” And that’s when you say, nope that’s not it, nothing to do with him; it’s really important to me that you and I have opportunities to spend time together, just us. \n\nKeep him out of it. Will it be very obvious that he is the problem? Yes. Can you afford for those words specifically to get back to him? Nope. You’ll lose them both. She will follow him because you’ll become the enemy. \n\nAsk after him. He’s good? Good to hear it. Call her for catch-ups. Make it clear you want the relationship with her. This is not about him (even though *of course it is*). \n\nAs time goes on and they go into different phases of this cycle you’ll be able to address things more directly. For now, I’d start here.",
            "Seconding other comments. You **cannot** tell her you don't like him, no matter how much you want to. \n\nI was in a similar situation with a friend and their abusive SO.  SO was one of the most horrendous personalities I've ever met, AND hated me to boot, but still insisted on coming along to everything my friend and I did together. I became very proactive about scheduling girls' nights, hangouts while SO was out of town, and lots of activities SO hated with a passion. It was a good way to spend time with my friend and avoid the SO. I never badmouthed SO, no matter how difficult it was. Thankfully, they broke up, and my friend is now seeing someone wonderful. \n\nI don't recommend cutting off your relationship with your sister, nor do I recommend telling her why. She needs to realize on her own that he sucks, and she needs to know she's still got someone who cares about her and will offer her an out if she seeks it.",
            "I have had several friends in abusive relationships, and have had to learn how to support them without enabling or normalizing their abuse. \n\nIt's something I've talked to a lot with organizations that work with domestic abuse victims, and I've also talked a lot with people who have come out of abusive relationships themselves. \n\nThe things you want to avoid are: \n\n1. Pushing her to leave\n2. Always bringing the conversation back to how wrong she is and how badly she needs to get out. \n3. Putting her down for not leaving yet, or talking to her in a way that belittles her or berates her. \n\nPart of the reason you need to avoid these things is because the abuser is already doing them. He's already pushing her to stay. He's already belittling her ability to act for herself or stand up for herself. He's already telling her she is incompetent. Having two people yell the same thing at you doesn't help you see things clearly. And the abuser will always win out because he is able to be around her more and has shaped her view of the world. \n\nHere are things you SHOULD do. \n\n1. Treat her abuser like an abusive person. Meaning, don't spend time around him. Don't engage with him. You don't need to say anymore than \"I'm sorry, I can't spend time with him. But I'd love to see you.\"\n\n2. Try to keep a relationship that's just between you and her. Meaning, spend time one on one (if he lets her). Help her keep a life and identity outside of the relationship (something he's trying to keep her from doing.) This probably means saying \"I don't want to spend time around your husband, but I'd love to have lunch every week just the two of us.\" \n\n3. Express trust and confidence in her ability to handle herself and her agency in the situation. This is hard, because a person in an abusive relationship is NOT acting in her own best interest or acting with agency. But part of that is because her abuser is telling her she's worthless, nothing without him, useless, incompetent, and completely reliant on him. The way to combat that is to TREAT her like she's the person she was before her abusive relationship. So if she says \"My husband yelled at me for burning dinner\" instead of saying \"He shouldn't do that, he's so abusive!\" you could say \"Wow, that's awful, it must be hard to stand up for yourself to him but I'm sure you're going to be able to.\" \n\n4. Avoid blaming. Avoid blaming her for choosing him, blaming her for missing red flags, and blaming her for staying. She already feels ashamed of all those things. Shame paralyzes people. It makes them feel like they are stuck. You are trying to help her realize she's NOT stuck. In your situation I would make sure you are not blaming or shaming yourself for your abusive relationship around her. Abusers come in all shapes and sizes. We could all be manipulated into an abusive relationship by the right person. Abusers are very good at getting people to stay, otherwise they would have no one to abuse. No one should be ashamed of finding themselves in the situation, just empowered to leave when they are ready. \n\n5. Lean on the phrase \"when you're ready.\" It can be hard to listen to someone complain about being abused when they're not trying to leave or recognizing it as abuse. So if she has lunch with you and starts telling this story about him abusing her, you can say \"Wow, that's hard for me to hear. I hope when you're ready, you can stand up for yourself.\"\n\n6. Don't normalize the abuse by acting like the stuff she is telling you is okay. But you should use neutral, non-shaming or blaming language to react to it. \"That's hard for me to hear.\" \"That sounds awful.\" \"I wish you didn't have to experience that.\" \"I hope that changes.\" \n\nA way to mentally imagine the way you handle this is, someone is stuck in a burning house. They need to get out, but they won't move. You want to just run in there, throw them over your shoulder, and get them out. But you can't. They're too heavy, and they refuse to move. They HAVE to want to leave. So what you do is stand by the exit and hold it open. You're reinforcing that *there is an exit.* It's right here. They can stay if they want to, but it's their choice, and at any moment they want to leave, you'll be there to help them. \n\nYou have to be that doorway to leaving. Affirm who they are and help them keep a hold of their sense of self by spending time with them away from their abuser, doing things she likes, and talking about other things besides the relationship. This holds the door open and says \"Remember, there is a whole world outside of this person.\"\n\nUsing neutral language that isn't blaming or shaming her, or combative towards him, when she brings up abuse, reminds her that there is a whole world out there that thinks she doesn't deserve the situation she's in, and would support her if she left. Remember, he's saying \"This is your fault, if you weren't so X I wouldn't have to treat you this way.\" And you're saying \"Wow, that's awful, I hope there is a time when you aren't treated that way.\"\n\nAvoiding pressuring her, so she can cycle through her desire to leave or attempts to leave without feeling like if she tries to leave, and fails, she will be judged or even more isolated. (Most people take at least 8 attempts to leave an abusive relationship. So think of it as her starting to walk towards the door in the burning house, and then getting scared and going back. You just stay holding the door. The door is always open. She can start and stop, and try, and retreat, and nothing changes. The door remains open.)\n\n\nThat all being said it is also okay (and healthy!) to set boundaries with her about her husband. You can tell her that it's hard for you to be around him when he treats her badly, so you'd rather just hang out the two of you sisters. \n\nYou can say \"I am having a hard time hearing you talk about the way he treats you. I don't want to get involved, but can we talk about something else?\" Or \"It's really upsetting to hear you tell this story and knowing the situation you're in. I don't know if I can be a supportive listener without giving you advice you don't want to hear.\"\n\nAnd you can be pretty blunt. \"I love you, and I support you. When you're ready to leave, I'm here. But I can't handle listening to you talk about the way he treats you like it's normal. It's painful for me to know you're being treated that way, and I know you're not ready to leave, but I can't be a person treats this like a normal.\"\n\n(I will say when I've said the above to some friends, they stopped talking to me at all. That's a risk you take.)\n\nSometimes shutting down someone's ability to complain makes them have to actually deal with the things that are happening.",
            "My sister is in a similar boat, I can't stand her husband, so I just told her that so long as I have a home, she and her kids have a home. When she asked about her husband I simply told her \"I don't like him. I think he's abusive towards you. I will never help him. I will always help you.\" She's been coming for visits without him more and more over the years and stays longer and longer each time. I suspect it's practice for the eventual divorce, but I don't mention it. It's her life and she'll do it at her own pace. I'm just here to catch her if she falls. But yeah, let your sister know exactly where you stand and that you'll always be there for her no matter what. A lot of people stay in bad situations because they don't have a way out. Having a guaranteed way out is empowering. Good luck",
            "Thanks everyone for the (mostly) thoughtful advice. I’m going to read through all the comments more carefully this evening, but I really appreciate all the input. I’m under no delusion I can convince her to leave, and I’m doubtful I could even talk her into any one-on-one time (though I will try). Still, it’s been helpful to read all the different ways to broach the subject and let her know I’m there for her. And yeah I agree bad-mouthing him isn’t going to get me anywhere.",
            "I was in an abusive marriage. When I left, my family came out of the woodwork saying \"I never liked him\", etc. It was very hurtful.\n\nSo now if I see a friend in a shitty relationship, I TELL THEM. I would rather say something and lose a friendship than not say anything and something bad happen to them.   \nSometimes people just don't listen to reason, just be there when they snap out of it, especially if it's running from an abusive relationship. They will appreciate you more in the long run because you were trying to stand up for her. \n\nI don't know what you can do legally, but I know there must be information out there on family of people in abusive situations.",
            "Respecting her choice just means that, respecting it was hers to make and she made it.\n\n\"Sister, I love you and I accept your choice, but the way he behaved was unacceptable *to me.* I don't invite people into my life who treat others that way. I would end a friendship with any man who treated his wife the way he treated you. Just because you're ready to forgive him doesn't mean I am. I am still angry with him and I get to be angry with him. For our relationship as sisters to work, we're going to have to make time *as sisters*, without him involved.\"\n\nIf he has a problem with her seeing you without him (and he will) you will need to point out to her gently but clearly, that he is purposely isolating her from others who worked to protect her when he was at his most abusive and who would try to protect her again if he decided to harm her again. You can respect her choice if she doesn't want to see you, but you'll be here for her when she changes that choice.\n\nAll you can do is keep the door open and hope one day she walks through it.",
            "> I get that it’s immature of me\n\nDon’t be so hard on yourself, OP - you can’t unlearn what you’ve seen.  I would just tell her that, even if she is unlikely to know how to process it. \n\nFinding a good counselor for yourself could be an intro to her in the future.",
            "Whatever choices you make, know that the instant you tell her what you think of her husband, that it will probably get back to him and that he will isolate her from you. He will not let her hang out with you one on one, he will not let you see their children, he will poison her against you because that is how abusers keep control. You can't un-open that can of worms.\n\nFirst, I recommend individual therapy if you aren't already in it, and domestic abuse resources. Hotlines have an \"the person being abused is someone I know, not me\" option. Arm yourself with knowledge because this is a minefield to walk.\n\nThen, you probably only really have two choices. Adopt a civil but not warm relationship with her abuser, or not have a relationship with your sister until she leaves him (which she may never do). Narcissistic personality disorder support subs have great advice on how to be around narcissistic abusers that are pretty good advice for being around any abuser. Info diet, grey rock, all that jazz. Treat him like a coworker you would never, ever interact with outside of work but cannot tell how you feel or you'd lose your job. Pretend he's the boss' son everyone knows is a problem.\n\nWith your sister, don't tell her what you think about her husband. Ask her what *she* feels. Create a safe environment for her to tell you the truth without feeling scared that you'll judge him (or her) for it. Like a teenager you want to tell you if they're in trouble instead of getting upset with them for doing drugs or having unsafe sex or otherwise getting into trouble.\n\nIt's also valid to not be in a place where you can do this. But it's unlikely you get to have both a relationship with your sister and no relationship with her husband.",
            "Just be honest. \n\n“I’m always here if you need me and I’ll come running when you’re ready to get out of there, but I can’t stand Chad and that’s why I don’t visit often”.",
            "You're going to have to tread lightly. Especially since she's in the \"pretending this is fine\" phase. \n\nYou're going to have to be there for her during this phase and pry her away some before saying what you need to say. \n\nTell her that after going thru what you went thru, you can't be around men right now. That you need sister and girl time. Make it at places that are super girly or private, so his jealousy isn't triggered as much. Think pedicures, going to those girly tea time places that old ladies love. Post pictures on social media showing it's just you and her in those places and tag her so he sees. You want him to think you're safe too.\n\nAfter a few months of that, then you tell her.",
            "The one thing you *cannot* do is give her reason to believe that it's because of *him* in particular.  \n\nThe reason for that is because in the situation she is in, she thinks that you don't approve of him or of their marriage (in fact, if she thinks anything other than that you support him and their marriage completely), there's every likelihood that it will cause her to dig in her heels and cling to him even *harder*.  \n\nThe issues with and within her marriage are an issue for another day.\n\nRight now the important part is for you to maintain a connection with your sister, both for your benefit and for hers.\n\nCan you draw on that \"sister\" connection, and put it in terms about how you need to spend time with *her*, but because of what you went through in your own marriage, tell her that you need some \"girls only\" time with just the two of you?  \"Nothing about your husband, no, I just need to not be around *any* men for a while\", or something like that?  Or tell her that you have stuff that you want to discuss sister-to-sister that's private?\n\nThe goal here is to figure out ways of inviting her to spend time with you, without him, without it seeming like it's *him in particular* you are trying to exclude.  If it's \"all men\" that you need to be away from (because of your own history), or \"everyone but her\" you want to exclude, because you have a private matter to discuss, you at least have a plausible reason to get together with her and not him, that won't put her on the defensive about him.",
            "He knows you will try to convince her to leave. So any time she spends with you is dangerous for her. The abuse usually escalates when when the abused gets close to leaving or has just left. \n\nShe knows very well why her family is not spending time with them. Leaving him will have to be her decision. Invite her to lunch as a girls' thing and offer to pick her up. If she declines you'll know she's not allowed to leave or be with you without him.\n\nHave as much contact with your sister as you can but leave any talk /text about him and divorce out. He probably is listening and checking her phone.",
            "You cannot. She's to vulnerable, too weak, too brainwashed and basically living in Stockholm Syndrome. \n\nWhatever you will say, she WILL SAY IT TO HIM. He has the upper hand here and will use his manipulative tactics to even further make her not to communicate with you. \n\nYour only option IS TIME. \n\nAt one point things will go from bad to worse. SHE WILL SNAP, SAY FUCK THIS and reach out to you. \n\nThis may be in 2 years or 20 years. And you need to continue living your life while not eagerly waiting for her to reach out. She needs to understand she has made choices and those choices will impact how her family is with her. \n\nIt sounds cold and pretty heartless, but as a Narcissistic abuse survivor, you won't find the courage to leave until YOU ARE SICK AND TIRED OF LIFE. When committing suicide is just not an option you are willing to go through, the only thing left to do is FLEE. \n\nLive your life, pray for her. When she reaches out to you because shes \"done with him\", YOU NEED TO LAY IT OUT:  we are getting you an attorney to get you free RIGHT NOW AND get you a therapist RIGHT NOW. IM holding your phone because I don't want you to see threats hes making to you, I'll get you a burner cell. WE ARE GOING TO THE POLICE AND GET A RESTRAINING ORDER RIGHT NOW.\n\nThis must be BOOM BOOM BOOM 💥  QUICK because she will be paranoid and afraid. If she's staying with you, you must get top of the line video surveillance. So, if he attempts to break in, it's on video and that evidence could be used against him. \n\nSo, be strong. It's going to be a long waiting game.",
            "My advice may hurt you more than help, so maybe proceed with caution.\n\nShe's in a situation similar to yours. Put yourself in her place, as you've evidently been in, and think what you would've like to hear from your own sisters back then, what would've helped you when you felt like there's ultimately no getting away, at the darkest point.\n\nMaybe it still feels too raw, but even she's more codependent of him that you were of your ex, or she's more anxious than you were, think... I know you know what to say.\n\nDon't forget to take care of yourself too while trying to help her. She needs a lifeline, but you're totally in your right to take a step back if it feels like too much.",
            "I used to be in the same position as your sister and I can guarantee you that bad-mouthing him will only make her cling to him more. \nMy best friend helped me get out of my abusive relationship and she did it by always asking to hang out one-on-one, never brought him up outside of “how is he” and made it known that she was only there to see me. It took a few weeks before I put 2 and 2 together but that was also with me going to therapy 3 days a week \nAlways support her but not her relationship, support her decisions on what she wants like hanging out with family without him, work, etc but don’t bring up the relationship or him because he’ll use it against her and I can guarantee he’s already trying to use “your family doesn’t want you around” because you’re all avoiding him \nDon’t blame her for what’s happening in the relationship and don’t use blaming terms. At any point you see her alone always talk about other things and be her support outside of the home and for if/when she leaves",
            "You already know the words.\n\n“I love you. \n\nBut because of the trauma of my own marriage and what I learned about your husband during your recent divorce proceeding, I can’t be around him right now. I’ll let you know when that changes. I appreciate your patience with me during my healing and processing time.  \n\nI still would love to spend time with you and my nephew. Why don’t we go get coffee/go the the zoo/hit some garage sales etc this Saturday morning, just the three of us?”",
            "I recommend trying the WIN Method...\n\n(Note: The structure is always When/It/Next. There's always the one person who complains about this and thinks \"I\" is better, I disagree and that's not the format of this method. Do what works for you and keep scrolling.)\n\n[W]hen.....(insert problematic behavior)\n\n[I]t makes me feel...(insert how it made you feel with full transparency)\n\n[N]ext time, please (insert desired outcome and lay your boundaries down) \n\nAfter this, it's about enforcing your boundaries. Don't allow yourself to be distracted or baited. If someone disrespects your boundaries...leave/hangup/tell them to contact you when they're ready to respect your boundaries. Don't negotiate them, stand by them.",
            "Maybe you can  tell her you see so many of your ex husband's actions in her husband's behavior that you just have to \"live and let live\" cause you absolutely can not be around him without it triggering those old feelings/memories......tell her you don't want to tell her how to live her life so you just stay away......I wish you both the best",
            "Op, just wanted to say that you are a wonderful person, a solid support and your family is lucky to have you in their lives. The strategy that top commenter developed is really smart",
            "You need to help her by encouraging her to have a bank account in your name only, saving up money for her getting her into therapy, and continuing to be there for her.",
            "Friend, sometimes the truth is the best option. Tell her you love her, and want to spend time with her alone. Let her know that you aren’t capable of forgiving her husband and as such you aren’t willing to spend time around him.",
            "Tell her straight up, short and to the point. I had to do this with one of my best friends and he appreciated my honesty and lack of mind games/sugar coating. It took time for him to get there and for us to heal our friendship, but it was worth it.",
            "You have every right to feel the way you do. That said your sister is smack in the middle of the make or break controlling phase that fairly dangerous in most relationships. She almost had a way out with the divorce but the husband likely backtracked when you got her a lawyer and he realized the win wouldn't be easy. \n\nI would just try to be there as I could be and help her to realize the situation she's in. She has to see it and want to escape. No one can help her but herself unfortunately.",
            "Don’t tell her softly, tell her affirmatively that the statistics from this level of abuse to murder are staggering, she was given ample assistance to escape, and she instead returned to the person who has a statistical chance greater than zero of murdering her and her child. Abusers isolate their victims and you’re cognizant of that but you will not let her decision impact your life and home. She is responsible for the danger she and her child are in bc the escape hatch was wide open and she chose to “reconcile” with zero changes to the situation. After a separation or attempted divorce is THE most dangerous time for abuse situations and you do not want to enable her into being unalived. \n\nI would tell her in no uncertain terms you love her and are afraid for her and she’s welcome to escape to you any time day or not but you will not cosplay in the abusive farce that everything is fine. It is dangerous and unacceptable and you cannot control her decisions but you can and will protect your own home from vicious hateful people. She may have difficulties but that does not exempt her responsibility for protecting herself and her child. She has greater resources than many people, mostly women but also men, who escape abuse for the sake of their children. You can’t make her prioritize the wellbeing of her own child but you don’t have to condone her living with a monster who only reconciled with her bc he figured out he was going to massively lose in court. I am a family law attorney and I can promise you 100% he stopped the divorce ONLY bc he wasn’t going to be able to torture and abuse her with it the way he planned. He will either send her to a hospital or morgue from here, EVERYONE leaves their abuser eventually it’s just whether it’s on your own steam or in an early body bag. My dad’s verbal abuse took twenty years off my mother, she’s in the grave, guess how the vampires doing?\n\nShe is a parent, she MUST face reality and you are not her minder. She needs to take her feelings of discomfort and LEAVE him. I have had to put my foot down with several friends and family before bc abuse in my family history means I accepted all sorts of crap. I will not enable an addict to the abusive cycle, they’re not incompetent they are unwell and no one can help unless they admit they have a problem and seek help. After ALL that she refuses to admit she has a deadly problem. The number one cause of violent death for women is intimate partner violence, it is easy to get tossed, hit your head on a table and that’s lights out your child is at the mercy of a vicious predator. \n\nIf she doesn’t understand staying with him is that serious, then she needs to be told with zero softening. She is not a special snowflake, men murder their whole families escalating right on over the physical abuse all the time. You have EVERY right to want to distance from her decisions and protect yourself.\n\nI was in an extremely abusive and scary relationship and I escaped. I have represented a dozen women who escaped thinking their life was over. It was not, they are unanimously better off. She needs to be made aware of the gravity of the situation and her escape options and if she wants to drag you into it then she needs to understand for self preservation you will need to go no contact bc secondary trauma is VERY real. You don’t deserve to be traumatized by their relationship as she lays it all at your feet. You absolutely can and should help her escape but do not enabler this ahole to keep abusing her by filling in as her therapist and helping her rationalize this god awful choice. I’ve had guys go on to injure the child so badly they had permanent damage in order to torture mom, this is absolutely not ok.\n\nHe should be having supervised visitation every couple weeks for a few hours paying significant child support. THAT is what a court anywhere in America is going to order. Staying with this dude so he can potentially just crack and kill them one day is not in the best interests of her infant and I could not respect someone who decided their manageable adult fears outweighed real tangible risk to their kids. I have anxiety and PTSD, I get how scary it is and hard, but AGAIN she is not an invalid and is 100% responsible for her choices.\n\nIf he decides to flip that baby’s high chair and it dies she better be prepared to go to jail for involuntary manslaughter. If she’s not she better be ready to move. Abusers get WORSE with time, every single time, and from what you’ve described they’ve already exhausted all the runway. They’re only in their 30s, this level of violence is not uncommon with the introduction of children. I honestly cannot stress enough how irresponsible of her it is to keep her child in that environment when other options exist so whatever you say to her frankly isn’t harsh enough. \n\nGet her out of there!!! If you can’t, distance and be very explicit exactly why with her. Sometimes you need someone else to tell you how it is bc you’re so broken so just tell her. She may get upset but you’re 100000000% justified in giving her the harsh unadulterated truth at this point. Giving up her out was beyond foolish and it’s not your job to save her. Her husband is responsible for his abuse but SHE brought a child into this so she absolutely is responsible for their care and a self indulgent pity party rolling over is completely unacceptable for anyone older than maybe 26. She’s grown, it’s time she took it seriously.\n\nI’m sorry this is so harsh but if she came into my office for a consult I’d be terrified and telling her the same thing urging her to get out same day and filing a TRO tomorrow. What you’ve described puts her in the highest risk demographic for *both* her and the child’s mortality, if she tries to leave again she needs physical protection bc the stats of the second attempt after something like this are terrifying. For the love of all that is holy just Google some numbers on DV, send it to her and tell her you refuse to watch her suffer. I can’t believe her attorney didn’t throw a full on fit trying to keep her from dismissing and didn’t countersue. Absolutely not trauma informed whatsoever, I require my DV clients seek immediate counseling exactly for this reason, bc their support system and self esteem is eroded to nothing, absolutely asinine outcome. Reconciled my whole butt, that man just didn’t like he was going to have to pay something and not get his way, SANE people never make these threats and it’s misperception alone thinking “oh yea guys threaten to completely alienate the mother all the time.” NO NO NO they absolutely DO NOT like 90% of the time. The people that do this aren’t only always abusers, they are super sick and I have won supervised visitation EVERY SINGLE TIME over almost 10 years? Why? Bc they’re abusive openly! They’re openly sociopathic so it’s easy to prove. This situation is scary scary scary. GET HER OUT OF THERE!!!!!!",
            "You should take her out to brunch while he is at work and have a pleasant day with her.   At the end of the time together, tell her she is family and that you got her back if she needs you.   All she has to do is call and you will be there, with whatever is needed.    Leave it at that.  She can read between those lines.  Good Luck.",
            "I completely understand not wanting to be around him as it can also trigger you regarding your past relationship.\n\nBut your sister will need support when it happens again, and if you're not there, she will most likely go through all that anxiety and be his emotional punching bag again.\n\nAs much as it kills you to see her with him, be there for her so when shit hits the fan again, she has to you there for her.\n\nWhen someone who is in an emotionally abusive relationship loses their support system, it pushes them further to stay with their abusive partner as they feel they have no one else there for them. \n\nPlus you should look at it as you keeping an eye on him. If he catches wind that you don't want to be around him, he will probably isolate her from you and ban you from visiting the house when he's not there.\n\nKeep your friends close, but your enemies closer.",
            "As someone who also went through a similar divorce as you, you can see it unfolding for your sister. However, you can also see she isn't ready to leave, yet, just like we weren't until we made it happen. It's a tough place, because you want to support her, but know nothing will have her leave him until she's ready to. \n\nOne of my biggest issues when leaving was also safety and where would I stay, would he be able to find me. We know it's not as easy as just \"leaving.\" I briefly took my daughter to a shelter, and thankfully he ended up moving back home with his parents. There isn't enough legal support for women. It didn't matter when I called police (they said he still lived there and has a right to be there, even with violence), and when I involved my lawyer for custody, was actually told no one would believe me about the violence or abuse because if \"it really were that bad, I would've abandoned my house to live permanently at a shelter.' ...while simultaneously trying to hold down my job and worry about child care? \n\nHaving been there, try to offer support as much as you can, but I can also understand it to be traumatizing and bring up your own anxieties. Have resources ready for her when she Is ready to go. Unfortunately it may take her some time, and not everyone does ever leave these situations.",
            "I read a very [good comment](https://www.reddit.com/r/relationships/comments/xhh3pi/comment/ioxz9ii/?utm_source=share&utm_medium=web2x&context=3) on one of the relationship subs from a person who was in an abusive relationship highlighting all the things NOT to say and how to phrase it instead to help someone in this type of situation and I'd like to post it here because I think it could help.\n\n>I was so mad at my family for assuming that there was something wrong with my previous abusive partner and now hearing you talk ab what you see going on with your sister it all makes sense to me. I am going to give you my biggest tips as to how to maintain a relationship with your sister while she is going through this.  \nstart by saying something like hey I miss you. DO NOT ever say \"Hey I miss you, all you do is spend time with Justin\" do NOT let Justin be your focus. you have to try everything you can to rebuild trust with her. If she ever says \"well you never loved me bc xyz\" say \"I am so sorry that I have not been better to you. I have been on my own journey of growth but you should have never experienced any unkindness and i hope you can forgive me\" validate her feelings bc if you do that and give sincere apologies (even if whatever shes accusing you of is bs) he cant manipulate her into thinking that you guys never loved her. always focus on her, not on him. and be REALLY nice to him. bc then he cant isolate her by saying you guys ignore him or give him dirty looks or something. make sure he knows hes welcome in yours/your moms house whenever he wants, so that your sister will be able to recognize his isolation.  \nONLY say something ab her partner after months of attempting to establish this relationship with her, and after she has told you multiple toxic/abusive things he has done- I want to express several, bc if he winds up hitting her, and you've already expressed concerns ab him, she might not tell you. And when he has hit her, thats the optimal time to convince her to get out and call the police, you can literally look up domestic violence statistics to show her etc, try to convince her not to go home, and press how even if she stays w him, calling the police will help her potential future children and his future girlfriends-  \nIf you want to start the conversation earlier, ask things like \"why are you smiling different in your pictures? what did you do with the extra money you had after trading in your car?\" etc but at separate times and never when her SO has just been mentioned, so she wont think youre implying that its about him. abusers train you to be extremely protective over them, and to cut off anyone who has anything bad to say about them. let your sister know you are here for her always, and an unjudgmental space. ask questions ab her partner concerning romance, like what did you do for valentines day, etc etc. So she is comfortable talking to you ab him, he will eventually convince her to not talk ab him w other people, bc she will accidentally spill abusive things ab him bc she doesn't realize they're abusive. When she all of a sudden starts clamming up (after youve rebuilt connection) mention to her that its not healthy to keep everything inside, and if anyone would have her hide things from her loved ones, there is no excuse bc they are asking her to choose them over her mental health. but waaaiiitt to do that stuff  \nINVITE HIM AND HER OVER TOGETHER. Make him feel like he has successfully manipulated you too. that is so important. try to come off as dumb to him. the only person my toxic manipulative ex husband was ok w me continuing my relationship with was my friend who has special needs, bc he never thought she would catch on. Every emotional abuser I have ever known of was like that.  \nALSO encourage her to get a reddit account if she doesn't already. bc hopefully, eventually she will come to reddit. tell her you LOVE the relationship threads bc of all the drama, and have her subscribe to them. Reddit helped me fall out of love w my ex husband bc when I told ppl ab him on here they have all validated that he is insane and horrific. It helped me recognize abusive tendencies in him I wouldn't have otherwise, and helped me realize I ONLY am insecure ab some things bc he gave me those insecurities.  \nask her to share the good parts of their relationship regularly, so that way she cant say \"well hes so good bc of this and this that you cant see\" you can say, i know you have strong feelings for him, but the bad is outweighing the good things youve told me, and honestly nothing good could outweigh this much bad.  \nI would also consider more positive affirmations for her. Maybe telling her something like that you think she deserves the world and know she'll get it someday. whatever feels right to you  \nEdit: typos. also, thanks guys, this is my first time ever revieving awards! I hope everyone who has a loved one in a similar situation sees this. There is not much you can do in this situation besides love and patiently wait, but this is everything I can think of that might have helped. Also hearing from his ex gf's might have helped bc im a girls girl and if i had known how he'd treated them I would have been able to see him clearer. but most arent like me in that way.  \nI also might edit and add a little bit of advice as I think of it as time goes on\n\nEdit: formatting was weird, had to fix it",
            "Have you watched bad sisters? Sounds like he’s taking notes",
            "Let her know that no one wants to be around her husband",
            "I wonder what the other side of this is. It sounds like you were both planning to leave your husbands around the same time, and I'm sure that shared misery bonded you. But then she stayed with her husband. You feel betrayed, resentful, maybe even jealous that they've reconciled. I suggest you focus on the things within your control: like your responses and feelings. Don't try to make your feelings your sister's problem. You feelings about her marriage are, frankly, none of her business. Your feelings aren't really about HER marriage, anyway. Don't talk to her about this, talk to your therapist.",
            "I would tell her right in front of him. Put him on the spot. He probably hasn't been singled out to his face. Put him in check. It's you're goddamn sister. Otherwise leave it alone. Those are the two paths in my opinion. As u had said you were being adults by accepting him cause she loves him, she needs to be adult enough to understand what the results of her choice to reconcile with him is. In a situation like this u just wish he could go away and be the one feeling like shit for being abusive but the reality here is you're sister is going to suffer and continue to suffer if she doesn't begin thinking for herself. And not even you can make her do that.",
            "Have you watched bad sisters? Sounds like he’s taking notes",
            "I’d stop being tactful it’s not going in your problem is she’s convinced she needs him so anything negative will be you attacking her.\nBeen in a similar situation with my ex and her friend.\nI tried nice with my ex when talking about her friend it really didn’t work and eventually ruined the relationship. He was emotionally abusing her constantly threatening to kill himself if she ever upset him. also threatened to stab me she didn’t tell me because he would get upset and he wouldn’t cope in prison…",
            "Not trying to be mean here but considering both you and your sister seem to have failed marriages there seems to be issues with the two of you as well. Family members generally have a lot of the same problems due to being raised similarly.\n\n I point this out because a lot of people and woman especially are always blaming the other person in the relationship while not being critical of themselves at all.  They will make these post about relationship problems and it's always them talking about their partners issues while having zero  self awareness. \n\nYou can run from your marriages but you can't run from yourself. I hope you don't expect to have different results if you get remarried. You might not have the same issues but don't be surprised if the end result is the same. \n\nAs far as your sister goes I would personally try to spend time with her. If she feels like he is the only one she has don't expect her to leave him. She likely sees her self in a situation where if she leaves him she will have no one since she hardly sees Family. Why would she expect it to be different after she leaves him?",
            "You have great advice on here about keeping the relationship with her open without having to deal with her partner.\n\nIn my work with abused spouses I learned that it takes an average of 7 tries for someone to actually leave the abusive spouse.  This may have been the first try for her, or the 5th.   Just know that it might not be as fast as you would like. \n\nKeep the lines of communication open with her.  Don't badmouth her partner.   Share how great you are doing.  Share pics of how you decorated the triplex.  \n\nTake care of yourself!  You're a great sibling",
            "I am sure you did right to go forward with the triplex and I personally would always repeat to her that it will be ready if she and her child decide to move there. Though I would not grin at her abusive husband as if everything is ok, I would behave in a way that it will be palpable I dont like him(I did this when my ex best friend dated a totally horrible boyfriend, but eventually I had to stop talking to her until she finally broke up with him).",
            "Set boundaries and find a space you’re comfortable and be there for her within those boundaries",
            "Step in if she's being physically abused otherwise keep out of it and say nothing. You are being triggered by this situation and it's ok to mention that if she asks again but really you should be able to be there for and hang out with her on her own.\n\nHowever, it sounds like she's a massive over-sharer and the details of what's going on in her marriage are giving you anxiety. It's ok to tell her that if she intends on staying with him she should avoid telling you all of their marital problems. Problems within a relationship can be worked on but family never forget if they're aware.",
            "This is hard. You don’t know if he checks her phone and things like that but the most gentle way is just being honest and open. Say you see her marriage dynamic similar to your own and you’re worried about her safety. She will always be your sister",
            "Just say, your toxic marriage is why i dont hang out with you anymore",
            "I've been in an abusive relationship. I needed someone to actually stand for me when I was too scared and too manipulated to stand for myself.\n\nIt took someone saying, straight out,\n\n\"Hey, the way you're being treated is not ok. For real, you can leave. I know it's really scary, but it's possible to leave. You can totally stay, and keep managing this cycle of abuse, I just want you to know that you don't have to.\"\n\nFollowed by,\n\n\"You need to be in therapy right now.\"\n\nIt took both for me to get out. First, I needed people to actually tell me that life could be better than I had it. That it didn't have to be that bad all of the time. That it wasn't a normal relationship. That I was being scared and gaslit into staying. It actually took three people saying that to me. Then I needed therapist (and actually a second therapist, a marriage counselor) to work through it with me.\n\nIt still took years for me to leave. I still had to plan my escape very carefully and with the help of multiple friends.\n\n\\*Note: I don't have any idea what's right for her situation. That's just what *I* needed.",
            "I don’t think accepting her decision and bearing her husband’s company is the right decision at all. He is a danger to her, and if violent, to the baby as well. If he’s not dangerous to the baby yet, he will be later with his words and actions. Do what you can to get her to divorce, and get these things off your chest. By no means do you have to spend time with him.",
            "Literally just say that. It’s your sister.",
            "You need to send her messages full of I statements. Do not blame him, because as others have said, they’re in the “them against the world” phase of reconciliation. \n\nSo you need to make it about you. “Hey sis, I love you, but my husband left me with scars and sometimes when I’m around your husband he says or does things that remind me of my ex, which makes it hard for me to be around him. I’m not blaming him or saying he does it deliberately, and I don’t want to lose you from my life, but right now I’m just too emotionally raw. Can we please still hang out, just you and me?” \n\nI mean, clean it up and make it more relevant to your relationship with her and your ex, but _don’t_ blame or accuse him of any kind of behaviour. If you do, she will turn against you, or worse, she’ll tell him what you said, and _he’ll_ convince _her_ to cut you out of her life. You don’t want that. For either of your sakes. So keep it as a ‘you’ problem and not a ‘him’ problem. Plus, that will likely make her want to support you even more, which may help her to stand up to him and allow her to see you alone (not so you can convince her to leave him, but it might help her feel a sense of independence that she wants to expand).\n\nBut don’t, do _not_ bad mouth or criticise him to her. She will not be open to it. You can pose ideas or hypotheticals that might make her think, or talk about the shitty things you know both your ex and her husband are guilty of in the hopes of subtly causing her to consider things, but don’t do it openly or obviously. It will not end well and you will lose her.",
            "I think there is a lot of really good advice here for how to care for the relationship between you and your sister. I'm wondering if you are also feeling guilty that you can't around him since he triggers your own baggage? Especially since you want to show your sister you are supportive of HER but can't be around HIM that must feel like you have no way to show her as he's always there.\n\nI really love the ideas of telling her you want to have sister time. And sister/baby time too, and doing things that he might not be interested in but she would do.\n\nI think for **yourself, it's good to remember that boundaries are you stating to  yourself what you're comfortable with**. And they're a statement of the kinds of behavior you expect, so that you can be healthy. You can't control whether or not someone will respect your boundaries (he might try to tag along to pedicures, for instance). But you can decide how you respond to that so that you are comfortable and so that other people know what you expect. They might not like what you expect, or give you what you expect, but you can tell them and shut it down if you don't get it. \n\nThis is a super basic example of what I mean, but I used to be a teacher and now I work in a job where sometimes I have to be the chat support person for middle and high school students. Occasionally they think I'm a robot and so they say rude things. I'm a nonentity on the other end of a website and honestly, I could just ignore it. But I tell them how that affects me in a very basic way: \"I don't like being called stupid. That hurt my feelings.\" or \"I don't appreciate being spoken to that way.\" They might continue on saying those things. I can't control them. But I can leave the chat or warn or ban them. I state *my expectations*: I deserve to be spoken to politely. *My boundary*: If you do not, I will end this conversation. \n\nIf he came along to the nail salon you might say something like, \"Oh, Sister, I'm so sorry you misunderstood! I was looking forward to sister time. Let's reschedule for a time we can make that happen. I'll give you a call to find out when works for you! I love you! Bye!\"\n\nThe important thing is *you* decide what is healthy for you and when he steps over that boundary you take yourself out of that situation. You hold the line for yourself because your sister needs someone who knows how stay firm in their boundaries to help her when she is ready to go.",
            "I was recently in an abusive relationship like your sister. My friends and family who were privy to my ex’s behavior began to resent me and my naïveté and started to victim blame me and it messed up my friendships. That didn’t help me to leave at all. Most of my friends and family didn’t understand that leaving is a process, and that it takes an average of 7 attempts to leave an abusive relationship. They began to call me a liar when I decided I wasn’t coming back, and then he would manipulate me and suck me back in. My friends and family decided they didn’t want to talk to me anymore, and it only further isolated me and made me want to stay with him more because it felt like he was there for me when they weren’t. What actually helped me to leave is my friend who was consistently there for me and didn’t say anything judgmental towards me. She kept pushing me to see that his behavior was abusive and not normal and pushing me to see reality, and even offered her place for me to stay. If it weren’t for her, I likely would have been stuck in that relationship for much longer. I say this to show you what it’s like on your sister’s side. Please have empathy for her, and realize that if he’s gaslighting her, she may begin to doubt reality and subscribe to his. You may be tempted to shun her until she sees the light, but that isn’t helpful either. Please keep in mind that it can be tempting to submit to his untrue and delusional narrative. Leaving is a process, and even just seeing an abusive relationship for what it is is a process. This is all part of the cycle of abuse. I highly suggest reading up on abusive relationships and calling the Love is Respect Hotline if you’re frustrated or concerned- they have great people who are very helpful. “Why Does He Do That” by Lundy Bancroft is also a helpful book.",
            "Try a fun girl active but makes sure he comes . Always invite both . Go places where he won’t like but still invite . But don’t tell her where y’all are going and make sure you drive . Make sure it’s super girly",
            "Tell her before it’s too late",
            "You’ve all seen how awful he is when he was trying to divorce her and then realized his control was slipping. Just list the things you stated that he did that you all witnessed and explain thats why they don’t want to be with him. Maybe if your sister get a clear pic of what’s going on and how her life will look living with this man she might snap out of it. But if it just look like you’re all avoiding her of course she run to him. He is not honest, don’t do the same with her.\nKnowing why people don’t hang out with you is better than nothing. Might still hurt but you’ll know why. She’s not any less sad if you slowly back away from her.",
            "Just be HONEST.  Tactfully HONEST.  If you don't know how, google: Honesty and Relationship skills to LEARN HOW.  goof luck.........",
            "I don't think it's at all immature of you to not be able to be in this mans presence. Your sister made her decision but you also have a right to your own boundaries and I think its reasonable that you feel that way. Like so many threads posted here your situation is what I refer to as a \"bowl of shit\" situation in that there is no pain free way for you to get what you need. \n\nYou sound mature and level headed so I think you already know that you need to communicate with your sister about how you feel and you need to be ready for her to not totally understand or agree with it. It sucks because you obviously care for her a lot and have her best interests at heart but sometimes putting your foot down regardless of the consequences is the best thing you can do for a person. I also think it couldn't hurt to make it clear you are and will always be there for her regardless but that you refuse to suffer someone who would treat your family (or likely anyone else) that way.\n\nI applaud you for being there for a family member and I am glad you managed to get yourself out of a bad situation as well, I hope your sister is able to see the light and get out of the bad situation herself. Best of luck to you.",
            "Honey, I think the best way is to be honest. I'm pretty blunt so I go with that. I would just tell her, your husband has serious problems, none of us are comfortable with him, we are worried about your safety, and offer her a place to live at least temporarily. I think she needs to physically get away from this guy for a while just to know what normal life might feel like again. Some people spend so long in prison they come to prefer it because they're afraid of what independent life would be like. The insecurities & unknowns of it. Whether they're up for it.  She needs to be in a safe place at least for a while where she can have some freedom. It's probably better if she can physically stay with family members so there are people around to protect her in case he becomes abusive. But that's where I would start.  Until she starts to see that her situation, which she has normalized, really IS unhealthy and unbearable and she is able to see physically how life could be different, she will be too afraid to move and too unaware that life can be different. The bandaid has to come off.  Be wary of him though, he might get really nasty if his dolly gets away....you might need restraining orders. But if you all love her, you can't just let her die in his prison.",
            "Honestly I have a sister also in a toxic marriage. He puts hands on her, brainwashes her and constantly yells at her. Everyone in my family tried having an intervention with her but she got very defensive and told us to mind our business. She said she made a promise to god when she married him and can’t divorce him. She also said he’s the man of the house and this is how real men are… I don’t allow my son to spend the night at her house anymore since she married him. Sometimes there’s nothing you can really do but focus on your own life and let her learn the hard way."
        ]
    },
    {
        "post_id": "5c4nlp",
        "author": "heartbroken00000000",
        "title": "My [25/f] boyfriend [23/m] of 1 year has been having a threesome with his coworkers [23/m & 24/f].",
        "url": "https://www.reddit.com/r/relationships/comments/5c4nlp/my_25f_boyfriend_23m_of_1_year_has_been_having_a/",
        "score": 2080,
        "num_comments": 108,
        "created_utc": 1478735674.0,
        "selftext": "Thank you all for your kind and caring support. Though this all happened today, I have began making my next steps.\n\n\nI did end my relationship with Jim. The conversation was difficult to have, but it needed to be had. There were questions I needed to ask for my health (such as STIs and such). Though he did say he used protection, I still scheduled an appointment with my doctor for this coming weekend.\n\n\n*Edit to add this part in [I overheard Jim's phone call with Derek. He told Derek what had happened and ended his relationship with them. He also said he is quitting his work tomorrow. I do feel bad but know that is purely his decision. ]\n\n\nJim will be moving back into his parent's place tomorrow. I will be canceling my lease tomorrow morning. I did contact my best friend from back home and simply explained that I will be returning home. He offered to fly up here to help me, but I said no because I know I will break down. Right now, I need to keep strong. Seeing a friend here will only allow myself to break down into a huge mess.\n\n\nI'm doing my best to stay positive. I keep telling myself, \"Better now than later. Good thing it's only been just a year and not five or more. Think of this as a life lesson. Do not hold grudges and do my best to move forward.\" It's hard, I admit, but continuing to tell myself those things helps me. I would love to believe that this experience has not swayed my views on relationships; rather, I would love to believe that this experience and relationship has revealed a little more of myself. I still need to do a lot of reflecting but that can come after I have done all the physical work (moving back to my home state).\n\n\nAgain, everything seems to be happening so fast but it's progress. Thank you all for your kind and loving support. I hope my experience and progress can be of some hope for others. I love my boyfriend extremely and though I did not mention it in the post, I did make a lot more sacrifices for him than he has ever for me. Through all that, I don't see it as losing an investment in someone but rather I am moving on for a healthier opportunity and hopefully he will be able to learn from this as well. I have no plans on getting back together with him. His words were sweet and tempting, but they were poison.\n\n\nThank you again :)\n\n* Original Post \n\n\nHi reddit,\n\n\nI am extremely heart broken and am in need of advice and even comfort. I don't want to use real names so I will be putting in different names. Thank you for understanding.. Let me share with you all on what happened. \n\n\nI [25/f] have been dating my boyfriend [23/m] - we will call him Jim, for a year now. It was long distance at first, but I moved to his home state in August so that we can be together physically. Everything was perfect. Jim and I were extremely happy with each other, always communicated, and we were just a happy couple. \n\nHe works at a cafe and there he befriended one of his coworkers [23/m - we will call him Derek]. Derek has been inviting Jim to get a few drinks after work, and the two became good buds. I've met him before and he was really nice. Jim thought he was a cool guy too. Then in mid-October Derek would invite my boyfriend over to his place. They'll just hang, order pizza, and drink some beers apparently (Jim would text me that he would hang out with Derek after work then come home. I never required him to text me where he was, but Jim was always sweet to text me messages throughout the day. I did the same for him too.). Throughout the entire night, Jim would tell me how he met Derek's girlfriend [24/f we will call her Karen] and that they were very nice people. I texted him back that it was awesome and sweet how the two invited him and shared a good time with him. I thought that was just that. \n\n\nSo Karen and I have never seen each other. All I knew about her was that she was Derek's girlfriend, she was nice, and also I learned that she and Derek moved in together like early October. I thought that was pretty cute. That's all I knew about her. My boyfriend started to hang out at their place more often, and I would only think of it as something as coworkers/friends just hanging out after work. I do admit that I felt left out and even asked Jim if I could hang out with them. He would say it would be a hassle since then he would have to come get me from my work or at home then go to Derek's place and also that they only hang out for a short while. I just would say \"Alright\" and be done with it. \n\n\nI had a day off work and texted my boyfriend that I will come over to his work place to have lunch together. He told me that would be awesome so I went. It was pretty busy in there, but not super busy where the workers wouldn't be able to casually talk. I noticed my boyfriend working and one other girl. Between orders, this other girl would be touching Jim's arm and would smile at him. She would act really flirty with him...and my boyfriend seemed totally fine with it. It hurt because 1) he was letting another girl flirt with him and 2) he always felt bothered if I would flirt with him in public - mind you, I'm not all handsy, but I do playfully hug his arm. \n\n\nWell Jim didn't notice me in there so I just kept to myself. Until several of the customers walked out, Jim finally noticed me. We went out for lunch, but on our way out I asked him, \"Who is your coworker?\" and he told me it was Karen. I asked him if he found her attractive, and he said word for word \"Honestly, not really. She's not ugly but she's not pretty or anything.\" \n\n\nI told him how I felt about him and Karen acting that way in the cafe, and he only told me it was meaningless since that's how Karen is. I tried extremely hard to just kill my jealousy, but it really hurt me. I cried in the kitchen after Jim had gone to sleep that night. \n\nA few days after that event, Jim would be going to Derek's place after work and would come home really late. Earlier today he told me he would be hanging out with Derek again, and with my own insecurities boiling inside me, I asked Jim to stay home with me a few times of the week because we rarely saw each other due to our work schedules. We ended up arguing, and in my anger I snapped at him saying something like, \"Fine then you can go to your little threesome.\" His face went pale and just a sick feeling made me believe that what I had said out of anger was actually true. I asked him and he admitted it.\n\nI ultimately found out that my boyfriend has been having a threesome with Derek and his girlfriend after work almost every day since October. I asked Jim if he was bi, but Jim said they were just sharing Karen and it meant nothing - it was only sex. It hurt. A lot. Jim and I shared the same views that an open relationship never could work for us, that sex with another person while in this relationship would be viewed as cheating, and so on (he was the one who set down the ground rules, and I agreed to them - we both were very monogamous). At least I thought. \n\nI am completely heartbroken. Jim is in the other room just sitting at his desk, and I'm in the bedroom bawling my eyes out while seeking some sort of help from reddit. Honestly, I have no friends here. The friends I have back at home didn't want me to go and we left on bitter terms. I'm ashamed to reach out to them for help. I just can't shake off this feeling of utter disgust and betrayal. I love my boyfriend so much. So very much. A pathetic part of me wants to just work on our relationship, but that is just a horrible choice. I know I should leave him and go back home or whatever.. but right now I'm just in shock. \n\n  \n\n  ---   \n  **tl;dr**: Found out my boyfriend has been having a threesome with his coworkers. I am extremely heartbroken. How did anyone who experienced infidelity such as this cope and/or move on? What would you advise me to do?",
        "permalink": "/r/relationships/comments/5c4nlp/my_25f_boyfriend_23m_of_1_year_has_been_having_a/",
        "comments": [
            "[removed]",
            ">Jim and I shared the same views that an open relationship never could work for us, that sex with another person while in this relationship would be viewed as cheating\n\nYou both previously agreed on being monogamous and chose to commit to this monogamous relationship. He betrayed your trust and relationship, that's all there is to it. \n\nIt is your choice as for what to do, but getting over such a betrayal is a difficult thing to do. And just know that he didn't confess to you out of respect of guilt, you just happened to get it out of him. If that didn't happen, how long would he continue deceiving and cheating on you?\n\nEdit: spelling",
            "Step one: accept that \"Jim\" is a cheating douchebag and your relationship is over.  You don't seem like the type that could accept or forgive this kind of major infidelity - but maybe I'm wrong about that.  Only you know that answer.",
            "Just read your edit, I'm so proud that you've taken charge and you're doing what's right for you.\n\nI'm sorry that this has happened to you, but I have no doubt that you'll come out of this stronger and far more capable than you ever thought you could be. Good luck <3",
            "Whenever you feel weak and think about staying with him, picture the three of them having sex. It's not the healthiest of things to do.. but it'll do for now while you're at your weakest. ",
            "In so sorry. I don't know how you can get through this, it is a massive betrayal on his part, and he took advantage of your calm and easygoing personality. I hope you don't change because of this, you seem like a really cool and laid back woman, the sort of friend I'd like to have. \n\nYou know you need to leave this mess. It's going to be hard but I can guarantee your friends and family will welcome you back with open arms. Go. And heal. ",
            "Friends will understand. You made a choice and it didn't work out. Please reach out to them, if they don't understand they weren't really friends you want by your side. So sorry you have been betrayed like that. Be good to your self and get out of that relationship and house, you deserve so much more.",
            "I'm so sorry you are going through this right now. -BIG hug-",
            "I'm so sorry to hear that. You seem like a wonderful person, don't let anyone ruin that beautiful personality. Breakup, move out, and chin up. Love!",
            "Good to hear you dump him\n\nYou said he and you agreed no open relationship. Right. Because the bastard didnt want you to have sex with other men but he can have sex with other woman. \n\nWhat a cheating douche. ",
            "Wow, just wanted to say your attitude is inspiring. I'm currently heartbroken due to an extremely raw and painful breakup and reading your post brought me a lot of comfort, so thank you. It probably won't make you feel better right now, but you sound way too good for this asshole. Just from reading that it's clear you deserve so much more. ",
            "You seem very strong and you realize your self worth and that you can do SO much better and you deserve much better than this. I understand this is likely very painful for you right now but trust me, it will pass and you will be so glad that you never looked back. ",
            "Fuck Karen, seriously. You want threesomes? find a single man. Your ex douchebag's just as disgusting, he could have declined but he just went \"nah, fuck it\" and carried it on for months; vomit in my mouth rn. Please dont be sad, like honestly and very seriously, you are SO MUCH BETTER OFF away from these three losers. I know these are just words on a computer screen but my god, you dodged a flaming bullet. You've done the right thing for sure. I genuinely wish you all the best. Move back home, cry for a few days, then become a bad ass woman and start weight training, it's electrifying and a massive boost all round, mind and body. ",
            "You're a strong girl, doing all the right things and handling this extremely tough situation with class.\n\nYou show such maturity when you can say this at this time \"I'm doing my best to stay positive. ... Do not hold grudges and do my best to move forward.\"  \n\nFocus on this, the sooner you get rid of negative emotions towards him and move on, the more it will help you. Discourage even your friends from refering to him with negative references (jerk, a..hole, ...etc),  forgive him, and in your memories remember him as someone with weaknesses.\n\nAll the best. You will find happiness soon and bring a lot of the same to another lucky someone.",
            "Good to hear you're staying strong and moving back home. Also, don't feel like you made a mistake, or feel guilty for moving to be close to him. You were pursuing something that meant a lot to you and Jim took advantage of that. You're stronger and wiser because of it. ",
            "Glad to hear your edit! Nice work. I can't imagine how horrific that would be - I'm sorry I don't have any Wisdom to give. But you're doing the right thing and I 100% agree, thank god this didn't happy years down the track. He didn't deserve you. What the shit was he thinking? Ugh it doesn't matter fuck 'im. ",
            "huuuuge internet hug :-( what he did to you was awful, and you're better without him. ",
            ">Right now, I need to keep strong. Seeing a friend here will only allow myself to break down into a huge mess.\n\nIt's okay to break down. You don't always have to be the strong person. I'm not a particularly emotional person myself (which sometimes people think is strange because some people have just expected me to be more emotional than I am because I'm a woman) so I totally appreciate the need to be strong in these circumstances. So that being said, Maybe it's good that you stay strong while you leave (you don't want any temptation to take him back in a moment of weakness), but just know that once you're back home around people that truly care about you, it's okay to cry and break down and do whatever you need to do. Grieve the relationship. You felt that it was serious enough to uproot your life to be closer to him which is a big change, so it's okay to want to mourn that loss. While you might have left on bitter terms, I'm sure they will all understand when you explain the situation (apologize if there are any apologies deserved and don't be afraid to admit you made a mistake because this wasn't a mistake you were *definitely* unable to avoid - I mean, I don't know what your friends thought about you leaving and if there were any signs, but you don't always know somebody will be cheating on you every day with their coworkers). It will all be okay and as you said, it's definitely a \"better sooner rather than later\" scenario as you are still young enough to bounce back and learn from this experience.\n\nBest of luck!",
            ">BF wants threesome\n\n>Doesn't include GF\n\nYep, fuck him, move on.",
            "Wow , OP your outlook on all of this is absolutely admirable. Keep pushing forward and stay strong. Just going through a nasty breakup myself, trying to look up to your words of wisdom to help me go forward as well.\nSolidarity from an Internet stranger.",
            "I just want to say that it's inspiring to hear that you are strong enough to walk away no matter how enticing it is to try and make it work.    \n\nYou are a badass.   ",
            "Good job woman. You are young, there is much time to get over the pain that you are currently experiencing and develop new relationships",
            "You sound like you have a very good head on your shoulders, and are making all the right steps. I'm so sorry you have had this experience. ",
            "Good for dumping that cheating doche. love yourself and never let anybody take advantage of you. \n\nOk, Sorry I know this is a serious post, but I just gotta ask. So did you name your bf and the other after Jim and Karen from the office? \n\nIt would make sense since you would be Pam in this scenario, and I never liked Jim and Karen together to begin with.",
            "No one ever deserves what you had to go through. I hope Jim comes to regret his decisions and realizes you can't do that to someone. It's upsetting but sometimes people need to make that mistake to realize you shouldn't ever betray someone's trust like that :/\n\nThis may not help, but on the positive side you have another 60 odd years to meet someone you'll be equally as, or more head over heels than Jim. And you will find them.",
            "Dump him it's not worth it. ",
            "I know that feeling and know what you mean,  I'm sorry this is happening to you.  It'll get better. Acceptance,  It's a cold bitter pill. Honestly,  if this is something he wanted to pursue he should have asked you if you wanted in on a 4 some.  Without you,  everything about this was wrong.  \nGood luck OP,  bigger and better things lie ahead. XO",
            "[deleted]"
        ]
    }
]