[
    {
        "post_id": "3knvuc",
        "author": "None",
        "title": "My (M31) refusal to pay off my sister's (F31) debts is causing a big family drama",
        "url": "https://www.reddit.com/r/relationships/comments/3knvuc/my_m31_refusal_to_pay_off_my_sisters_f31_debts_is/",
        "score": 2074,
        "num_comments": 547,
        "created_utc": 1442065881.0,
        "selftext": "This is kinda long and I know that asking strangers on the internet may not be the best way of working out what to do but I really need to get this off my chest.\n\nThe first thing to say about my father is that he places a very high value on formal education.  He had very little of it himself but believes that it is the best thing that you can do in life.  I am one of a set of non-identical twins (with my sister) and she is everything that he could hope for in that she has a bachelors, a masters and has just completed law school.  Unfortunately for him (and me) I am not suited to formal education at all.  I did enroll for one semester at a state u but I knew from Day 1 I had made a mistake and left.  He was furious about that at the time and confidently predicted that I would be a bum and a loser for the rest of my life.  \n\nHowever, I found my niche as an entrepreneur and after struggling along for a few years at the beginning am now doing very well.  In the same way that I knew college was not for me, I know that running my own business is.  I have started and sold a number of them over the years and, although not everything I have tried has worked out by any means, the last one I managed to sell for a decent chunk of change (low 8-figures) and have recently moved across country to NYC to find a mentor to help me play in the big leagues.  Prior to this incident I thought that my Father had come to terms with me not going to college etc and making a success of being a businessman instead.  He and I have never been on the very best of terms but I did honestly think we had managed to get to a sort of “working relationship.”\n\nI should add that my sister and I have always been close and although our lives have taken us in different directions we still speak at least once per month.  I always knew that she must have incurred a good amount of student loan debt over the years but I have never tried to tell her how to live her life and she has never tried to tell me how to live mine.\n\nMy sister got engaged last year to a guy she met in law school, I have met him once when they came to NYC for a visit and he seemed alright to me.  Fastforward to two weeks ago and I am travelling from NYC to our hometown for a “meet the family” type dinner with my family and my future BIL's family (coincidentally, they come from a nearby town).  Upfront I will be very honest and say that I didn't really want to go as it is a long trip for me, I am very busy and what does it matter if I meet his family or not?  But I go, for my sister's sake.  \n\nAnyways, just before dinner my father pulls me off to one side, tells me that sister and BIL have a combined student loan debt of nearly $500k (WTF!!) and it would be really nice if I “did something for the family for once” and paid it off for them as a wedding gift.  Frankly, I have been expecting him to ask me to contribute to the cost of the wedding and I had already decided that I would just keep my mouth shut and pay up so long as it was less than $25k, but this really shocked me.  It was the really matter-of-fact way that he said it.  Now, I have the money and wouldn't really miss it but that was not the point.\n\nIt gets worse.  As we are sitting down and eating it transpires that he has told everyone there that I am “rich” and I will be paying off the student loan debt.  There are toasts and heartfelt thank-yous while I am just sitting there stunned at being railroaded in the most brazen way I have ever seen!!  \n\nLong story short, I said a few things I probably shouldn't have and end up walking out of the restaurant there and then and going back to the airport and catching a red-eye back to NY.  While I am in the air I am stewing on the whole situation but by the time I land I have calmed down and thinking “what have I done”?  However, when I switch my phone back on in the cab back to my apartment it just blows up with voice messages and texts from my parents and sister.  Later that night, my sister rings me again and this time I answer it.  I explain that it isn't about the money but the way in which it was just assumed that I would pay up.  I know that this sounds really petty now, but I was just so angry at the time.  My sister was really surprised as she knew nothing about it before the dinner and afterwards dad was going round telling everyone that I had said I was going to pay it but had now changed my mind!  She ended up being really embarrassed in front of her future in-laws (who are now wondering what their son is marrying into) so is now very pissed at our dad.\n\nNow I come to the issue.  Turns out my sister went back and confronted our dad about it and there was a huge row and now she is talking about eloping and not having a big family wedding at all or only inviting her fiance's family etc etc.  My phone is being besieged with messages from my parents to talk to my sister and ask her forgiveness so that she will forgive them.  The final message from my father before writing this was just him ranting about how I don't deserve the money that I have and it is because of “people like me” that college graduates are struggling.  Seems that we aren't in such a good place after all.\n\nI am not sure what to do.  Was I totally out of line?  I don't have many friends to talk to about this and those I do have probably have as equally skewed perception on this as I do.  Did I get this totally wrong?  Should I just have paid the money?  I hate being railroaded and that is what it felt like, as though my only value there was a source of funds.  Having said that. I'd hate to think that my sister's wedding gets ruined because of me...\n\n\n\n   \n**tl;dr**: I have made some money selling a business and my father thinks I should pay off sister's and BIL's student loan debt as a wedding gift and blows-up when I refuse.  Family drama ensues, wedding in danger, parents blame me.  Should I just have kept my mouth shut and paid up?",
        "permalink": "/r/relationships/comments/3knvuc/my_m31_refusal_to_pay_off_my_sisters_f31_debts_is/",
        "comments": [
            "[deleted]",
            "Your father is trying to live vicariously through his children. The education he wanted was something he only experienced through your sister and so holds you in contempt. That is his problem at this point, not yours. Keep up with your sister, she didn't expect you to pay and seems to recognize that what your father did was wrong. Her eloping is up to her and her fiancé. If you want to help (that 25k is no joke even against 500k of debt) go ahead but don't feel like their choices mean your own life decisions take a back seat. You worked for your money, they worked for their education, each came with its own set of consequences.\nDon't let your fathers expectation hamper your success.",
            "I think it was super generous of you to consider offering $25,000 to pay for your sisters wedding. To me, that is already going above and beyond as a brother.\n\nYour father is out of line. Also, you're lucky that your sister is also on your side. If she wasn't, this would be really messy.\n\nYou don't need to pay for your sisters (let alone your BIL!) college education. If you wanted to gift them anything as a wedding gift, that's your prerogative.\n\nYou need to simply let your father know that the only money he gets to decide how to spend is his own. Full stop. And it was wrong of him to try and trick you into paying by announcing it in front of everyone. You are owed an apology. ",
            "You did the right thing. There is absolutely no reason that you should pay her debts, and if that is a condition of having a relationship with your family, it sucks that you had the misfortune of being born into a company of idiots.\n\nIf it makes you feel better: you sound like the most grounded of all of them.",
            "Dude. Look at my post history and read the post on my inlaws expecting my husband and I to pay up for my BILs honeymoon. For some reason, my inlaws think we owe his brother a piece of our hard earned pie. We don't and you don't. I think your father is jealous of how well you succeeded without a degree and a lot of his identity was probably based on what he could have been had he been privileged enough to get a good education. When you didn't get an education and succeeded anyway you basically ripped that chip right off his shoulder. Your sister followed his advice and ended up in massive debt. I bet if your father had the means he would love to pay it, but he doesn't so to redeem his own pride he wanted you too. This isn't about you it's about your father's pride, identity and self worth. You did nothing wrong and I'm sorry you're having to deal with this. Distance yourself from your father because it looks like he's just waiting for you to fail.",
            "This is all on your dad. He made his bed, he can lie in it. ",
            "Your sister knows what went on and believes you. She should be able to smooth things over with her fiancé's family. \n\nAside from the fact that the money owed isn't that much for you its a HUGE amount for most other families in this world. How the fuck have they racked up half a million of debt? \n\nIf you can, and you want to, then help your sister out on your own terms and just cut your dad out your life. You've done exceptionally well despite his influence and will continue to do so. Anyone who involves you in something this major without your permission should just be dropped. ",
            "You are absolutely right. This is a matter of principle.\n\n\nYour father pushed your sister to get the education (and the debt). This was his vision, his principle.\n\nNow he is trying to manipulate you into relieving your sister from consequences of his and her past decisions which proves that he was wrong all along and you were right.\n\n\nDon't pay your sister debt. She has extremely valuable education. In 5-10 years she will be able to pay it in full while making 6 figures salary per year. She will not suffer by any means.\n\n\nOne of the reasons why lottery jackpot winners go bankrupt quickly is they keep giving money to their family and friends. Once you gift serious amount of money to somebody all other family members start feeling that they are entitled too: some nephew has serious medical condition, somebody got in accident, somebody opening the business and struggling - list goes on and on. Once you start giving your money away - they never stop asking and there will be even more of family drama.",
            "Your sister is standing up for you. She's on your side. ",
            "You handled this like a champ. If I were you, I would encourage my sister to just go ahead and elope. Eloping gives them a head start on paying off their tremendous debt and it does away with the unstoppable drama train ahead.\n\nAnd, if you don't think you'd miss the 500K, go ahead and take it out, and tuck it away in a long term investment. Should your future partner or child be struck by accident, health issue, or something otherwise unexpected you'll be glad you've nested that egg. \n\nBest to you.",
            "You are getting a lot of validation and psychoanalysis of your Dad but little concrete advice... I have some suggestions I think may help you and everyone move forward.\n\n1. I think you need to arrange another dinner with your sister, future BIL, and his parents without the rest of your family. Apologize for the drama and enjoy a nice, relaxing evening. Don't bring up your wealth or wedding gifts at all, and if someone else brings it up (I can't believe anyone with any manners would) then change the subject.\n\n2. Put yourself in the frame of mind as though your father will never know what you gave them as a gift, that you do not know about their debt, that they are eloping and will have no wedding costs. Then decide on a gift. It may not even be financial; that is fine. Maybe it is a large cash gift that she can put towards her loans, towards her wedding, towards a down payment... Maybe it is a horse. Or a honeymoon. Or a designer wedding dress. Whatever would make you happy to give her, do it, and don't think about the other pressures when deciding.\n\nYour sister is not a victim of her student loans. She signed every paper agreeing to pay back that money, and she was an adult when she did it. And if she chooses to have a large, lavish wedding, she is choosing to spend thousands on that that could make a large dent in her debt. The most important thing here? She knows all of these things, and expects nothing from you. Good for her. \n\nYour father has been analyzed enough here. \n\nNo matter how much wealth you own, you don't owe anyone anything. Being wealthy and coming from a non-wealthy family, this issue often comes up. The question you have to ask yourself is, what level of wealth is it \"okay\" to start assuming family members owe you something? My brother and his wife easily make $100,000 more than me and my husband per year. But it would be apalling for me to expect them to give me money. Yet, at some level of wealth disparity this problem always arises... The answer is never. It is never okay to assume you are entitled to someone else's money. Period. And you should never feel like someone else is entitled to your money. That way, gifts can be given and received with joy, not out of obligation.\n\nSo, give your sister a wedding gift that gives you joy to give her. And tell your father your finances are none of his business, and you will not discuss it with him further. Ever.",
            "Here's the thing.\n\nYour sister and BIL are GROWN ASS ADULTS. They decided to get the loans, they can fucking pay them off. That is not your problem. At all.\n\nFor your father to even consider asking that is completely ridiculous. If he placed such a high value on her getting an education, he should be the one helping her pay the loans down if needed. You are her brother, not her damn parent. Your money is YOURS and its being rude how your father is acting. \n\nFuck your dad. I feel bad for your sister too because he not only managed to tarnish your reputation, but hers too. If I was your sister I would elope and not include him in anything. \n\nI would let your sister know that your father did that without you agreeing to it in any way, shape, or form. If she needs help, she can ask like any grown mature person, and accept whatever the answer may be. \n\nYour dad has such a shitty attitude. And after reading through your post a few times, I know its jealousy. \n\nHe obviously invested alot into education, pushed your sister to do the same, and then you wound up with more than he could have ever dreamed. That's jealousy. \n\nDon't let his jealousy and rudeness ruin your relationship with your sister. And DO NOT give any of them any money unless it is 100% okay with you on every level.",
            "It's awesome that your sister is taking your side, no questions asked. She sounds awesome.\n\nYou father on the other hand is a piece of work. What a shit head. Don't back down. There's lots of good advice here, but do not compromise with him on this. If you compromise, it should be with your sister only.\n\nGood luck, and I'm sorry that some people in your life just see you as a wallet. It seems to be the en vogue thing on reddit these days.",
            "That is so far over the line that I wonder if there might not have been some sort of mitigating factor.\n\n> just before dinner my father pulls me off to one side, tells me that sister and BIL have a combined student loan debt of nearly $500k (WTF!!) and it would be really nice if I “did something for the family for once” and paid it off for them as a wedding gift ... As we are sitting down and eating it transpires that he has told everyone there that I am “rich” and I will be paying off the student loan debt ... My sister was really surprised as she knew nothing about it before the dinner\n\nDid your father tell anybody before talking to you? When he said you \"should\" give them the money, did you say \"no, I will not do that\" or \"I'll have to think about that\", or did you just kind of not respond?\n\nIf you didn't respond, he could have taken that as assent. Obviously he shouldn't have (very, very, very shouldn't have) but there's a huge difference between deliberate railroading and an honest - albeit thermonuclear - fuckup.",
            "You obviously didn't get rich by giving away $500k anytime a blood relative just expected you to do it. Clearly you have more sense than that. I am a woman with a brother, and your situation sounds a good deal like his: no matter what he did, my dad was quick to criticize him and to praise me. Is this a common family dynamic?\nI digress. How totally out of line for him to say you don't deserve the money you earned. He's just butthurt 'cause you blew a hole in his worldview. I'm with another wise commenter: pay for a nice wedding as that's what YOU wanted to do in the first place, and go nc with Dad until he gets his head on straight. Not that I believe education should cost as much as it does, but why should your sister not work to pay off her debt? She doesn't seem to want you to shell out for it. She's competent and can make her way in the world just like you did. Why would your Dad assume she can't? Your Dad's meddling. I'd be mad, too",
            "[deleted]",
            "oh your dad is stupid. Your sister was not in on it, so there’s no reason at all that it should negatively influence your relationship with her.\n\nIf I was you, I’d help your sister with her debt (if the expense is trivial for you), but make absolutely sure your parents are never informed of this. And then I’d probably stop seeing your dad for a few years.\n\nAnd congrats on the success with the entrepreneurship.",
            "The way your father put you on the spot is horrible. You did the right thing leaving. \r  \rI would go low contact or no contact with your father until he apologizes to you and the rest of your / future BIL's family. \r  \rIf you want to help your sister out, stay in contact with her, and do it on your own terms. \r  \rFor example, let's say they get married, and find stable jobs. You could buy a house (still in your name) and have them live in it rent free while taking care of it. This would free up rent / a mortgage while they could focus on paying off their student debt.  \r  \rIn the end, it is your hard earned money, and you can do whatever the hell you want with it. ",
            "The gall of some people. Holy smokes.\n\nPaying 25k toward her wedding was unbelievably generous. It was her decision to get 500k in debt. If you wanted to do that of your own accord, that would be one thing. But their presumptuousness is out of this world.",
            "Their debt isn't your problem and you aren't the family piggie bank. Your dad is an ass for springing that on you and going around telling everyone that you would pay off their debt. I'm glad it blew up in his face.",
            "It might almost be better to let your sister elope, then pay off the debts anyways just to stick it to your parents - sort of a \"I can do this because I want to help my sister, not because you're scummy asshats.\"",
            "Your dad wants to feel like the hero without the work and sacrifice. Like the type of guy that has a business idea and will you provide the effort and money for a 50% partnership. \nIn his mind, he got you to pay, so that counts as helping his other daughter. The one that followed his mental rules to life. \nHe highly resents you for breaking his perceived mental rules for life and succeeding. (It also means his life rules are wrong and he can't admit that to himself.) If you had not been a success, he would have also made you feel awful the rest of your life for not listening to him. ",
            "Why does your dad think you have the ability to give your sister $500k?  Exactly.  These people (at least your dad) are greedy a-holes.  Never mention money again to them.  Not what you have.  Not what you sold your last company for.  Nothing.  You thought you would stick your dad's nose in your success and this is what it brought you.  Your business is not their business.",
            "For my wedding, I had to pay for everything and did not get a single gift worth more than $100. $25k sounds like a ludicrous amount, let alone 500k. Can I be your family member? I'll send you a christmas card and everything, new big brother !",
            "Everyone's focused on how much debt it is, if some of it was federal student loans it'll be forgiven after 10 or 20 years depending where they choose to work. So paying off $500k is possibly dumb, if they themselves won't have to pay that full amount.\n\nYour sister sounds like a solid ally. Don't let your dad being an ass ruin you relationship with her and her husband.",
            "Major kudos to your sister because she is handling this like a champ. I would talk to her and tell her you appreciate that she isn't trying to take advantage of you. Since you had already planned on giving her 25k, I would still do so. Tell her she's your sister and you love her and while you can't pay off her debts, you want to help her and her new husband get off to a comfortable start. 25k can be a deposit on a house for some people, or it's a great way for them to have a cushion. It's not your responsibility to pay her debts, and 25k is extremely generous. \n\nAlso, I guarantee that your sister isn't blaming you for what happened, she is blaming your parents, who are to blame. ",
            "Let's say you did pay off the $500k, then what? Wont your sister and BIL feel indebted to you forever? It's sets up such an inequality that will likely will ruin your relationship with either or both of them. ",
            "Bro, my dad is very similar.  We had a crap relationship when I lived with him as a teen.  We had a 'working' relationship when I was an adult living away and we didn't need to interact much.  The relationship turned crap when I had to have more interaction with him for family functions like yours.  \n\nAfter years of trying to make it work and compromise so we'd have SOME kind of relationship and letting it affect my own family's health I saw there was no end game other than my pops getting everything he wants.  I realized he was a high school drama queen trapped in a grown mans body.\n\nI cut him out and things have never been better for me.  I still love him but I've stopped allowing him to set the parameters of our relationship.  If he decides he's willing to be a part of my life according to the rules I've set I'll welcome him back.\n\nDon't let toxic people fuck up your shit.  Even if they're related to you.",
            "This is between you and your sister. Cut dad out of your life if you have to because he is a piece of crap for doing this. On the other hand your sister was innocent and the amount that you are willing to give to them should be between ONLY you and them. If you decide to help at all, nobody else needs to know. This is ridiculous.",
            "OP, \n\n\nYOU DO NOT NEED TO GIVE ANY MONEY TO YOUR SISTER'S WEDDING NOR FOR THEIR COMBINED UNIVERSITY DEBT \n\n\nYou are under no obligation to give your sister any money whatsoever. Your parents should be the ones giving her money OR her fiance's parents. I'm going to be quite frank with you, your family of origin did not teach you nor model for you what love is. Giving money does not equate to love and the choice to not give money is not sign that you love your sister any less. \n\n\nLove is accepting another person for who they are, for what they do, for being enriched by having them in your life. You were never given what other children or young people experience in terms of unconditional love from your parents. You're still not shown love by your father. His 'love' or should I say approval of you is based around whether or not you do certain things that he wants you to do. That quite simply put: IS NOT LOVE. \n\n\nI can't believe these comments discussing how much you should give and whether there should or should not conditions? Those people have bought into this false assumption that you need to give money to show love or to give money if you have it to another family member. Given these assumptions, I'm not surprised that you're now feeling an obligation to contribute a significant amount of money. \n\n\nSo, I would discuss with your sister your intention to support her wedding by giving her a gift. You are not responsible for your sibling's higher education debt and even less responsible for her fiance's. You may want or need your money for something else. You may need it for a new business enterprise, you may need it for your wedding (if you get married), you may need it for your children, it really doesn't matter, it is your money. No one else in your family can tell you nor should they even attempt to tell you what to do with your money. Best wishes and stay strong. \n\n\nTL;DR - You were not shown what love is in your family of origin. People are equating giving money as a sign of love. \n\n\nEdit: grammar and sentence structure",
            "I hope you made it clear when you got angry that nobody told you that you were paying up. I respect you for what you did and am glad that your sister wasn't in on this scheme to milk you of your money. Your dad should be proud of you, its a lot harder to be successful without a formal education.",
            "It would be one of the nicest things i've ever heard of for you to wipe their debt clear as a wedding gift and would make an indescribable difference to their lives and if you had decided to do that it would be Amazing.\n\nYou didn't decide to do that though. Fuck you weren't even asked to, it was just announced that you were. Who on earth thinks that's acceptable?",
            ">It gets worse. As we are sitting down and eating it transpires that he has told everyone there that I am “rich” and I will be paying off the student loan debt. There are toasts and heartfelt thank-yous while I am just sitting there stunned at being railroaded in the most brazen way I have ever seen!!\n\nThat piece of shit set you up. He hoped that doing it that way would pressure you into agreeing. He clearly wasn't expecting you to have a backbone and walk out on them all.\n\n>She ended up being really embarrassed in front of her future in-laws (who are now wondering what their son is marrying into) so is now very pissed at our dad.\n\nGood. I'm glad she's not going after you and that everyone is pissed at the correct person.\n\n>My phone is being besieged with messages from my parents to talk to my sister and ask her forgiveness so that she will forgive them.\n\nEr... nope. Don't do that. You're already both on the same page.\n\nNext time your father contacts you about your sister and the wedding, tell him that he needs to talk to HER about it, because it's not your wedding. She gets to decide if she wants to elope. Not you. Not him.\n\nIf he tries to get you to talk about asking for forgiveness, hang up. Keep hanging up every time he does it.",
            "This is on your father and not you.  Mend things with your sister, it is a good idea to have her and the fiance over , as this isnt their fault and they're the most important family to you from what I read above. I think what you had in mind as a gift (something sub $25k) is generous and appropriate but the half million ask is not.",
            "You did the right thing. And if you pay their debts now, you will forever be looked at as a safety net.  That's not a healthy basis for a relationship.",
            ">I am not sure what to do. \n\nStick to your guns. Don't answer any texts from your parents. Stay out of that fight. They started it.\n\n>Was I totally out of line? \n\nNo! Your dad was. He was wrong to ask you to pay for it all. He was wrong and cruel for tacking on the \"do something for your family for once\". He was wrong to tell everyone at dinner that you would pay. He was wrong to lie about you by saying you'd agreed and then changed your mind. Literally everything your dad did was wrong. You didn't screw this up at all. You were blindsided by this whole thing and you reacted properly by saying no and getting out of there. \n\n>Should I just have paid the money? \n\nNope. It isn't your job and it doesn't seem like your sister wanted you to either, given that she didn't ask you to herself. If she and her fiance are good at their jobs they will be able to pay it off themselves.\n\n>I'd hate to think that my sister's wedding gets ruined because of me...\n\nIt won't be because of you. It will be because of your father, if it does indeed get ruined. He started this mess. He can blame you all he wants but that won't change the fact that it's his fault. He resents your success; you had no college education, same as him, but you managed to become very successful and he did not. That's what this is about. And that's *his* problem, not yours. Don't let him make it yours. Don't accept the premise or the blame. ",
            "I don't know how this works, but sometimes people can be jealous of you and not respect you at the same time. Mixed signals like this are hard to handle, especially when they come from a person who should be devoted to your well being like a parent. Try reading what you wrote as though you are a stranger on the outside of this situation. It might make it easier to recognize the various boundaries your father has violated. Don't worry about managing the fallout of your dad's actions - your sister and her partner will decide how best to undertake their nuptials. Focus on the relationship that has been the most consistently rewarding and nurture your bond with your sister. After things have calmed down a bit and your sister decides what she wants to do about her wedding, and if you still feel inclined to offer money, then offer her the money without strings, to be spent as she wishes. Whether she pays off student debt or puts it towards a lavish wedding ($25,000 is a ridiculous amount to spend on a party IMHO) your generosity will surely be appreciated.",
            "Wow, your dad is a complete fuck head. He's coincidentally the exact opposite of my father - who would think being a successful entrepreneur at your age would be on the same level as being elected to the Senate. I'm not even kidding.\n\nThe way your dad went about this makes me think he's jealous, bitter, and envious of your success and position. I feel terrible for your sister. \n\nYou said you were willing to go up to 25k for the wedding, and given your financial resources I think that is perfectly reasonable - I'd offer to buy them a honeymoon trip with that money. \n\nAs for your dad, send him a message and tell him that until he apologizes he will not be a part of your life. ",
            "> Was I totally out of line?\n\nNo. Not the least bit. I won't fault your father for asking but after you said no he had no right to tell people you would be paying off both of their debt. He also had no right to tell them about your money.\n\nHe and anybody who asks, now that they think they know, needs to understand that any money you have isn't fun money for you. It is your next investment, seed money, collateral for a loan, etc. for your next business venture.\n\nI advice moving forward is to stop speaking one on one with your father unless it is necessary, at least until he understands how he screwed up. Perhaps have your sister, mother, or other trusted family member there.\n\nNext since things are a little odd with her and her fiances family it might help to get to know him a little better. Something that is separate from the rest of your family. Perhaps some long weekend you can meet them somewhere.\n\nI would call your sister and just talk things out. Discuss a little bit about your money so there isn't misunderstanding. Again I would use what I said earlier, let her know you do have some money but it is all budgeted for business stuff so you really \"don't have it\" to pay off her college debts. If you are still willing to help with the wedding let her know. Tell her that you set aside $10K or $25K or whatever number you are comfortable with. If you are comfortable with her using it for other reasons if she elopes let her know you are ok giving it to her for the college loan or first house. \n\nAs far as asking her to apologize to the family. That is up to you and maybe her. But perhaps you'll want to be seated somewhere other than your father at the wedding.",
            "You aren't responsible for your sibling choices. Keep your money.  Tell your family and just cut them I\nOff if they object. Your dad is trying to make you do what should have been his responsibility. \n\nWeddings are a waste of money. ",
            "As one fraternal twin to another, my advice is don't do it.  Don't even give a loan.  From then on you'll always be the brother with money and you're setting a precedent that you'll bail them out if they get into trouble.  Your sister and her fiance are a couple of lawyers.  They should definitely have known that if they are going to finance their education with debt then they would have to pay it off sometime.   Would you pay their mortgage off for them too?  How about paying for their kid's college?  Don't be surprised if they come to you hat-in-hand for every large expense because you \"have the money.\"\n\nThe reality is you made your money on your own.  You took risks just as much as she did by financing her education through debt.  If she's smart things will work out for her.  It's not like lawyers make chump change.  \n\nAlso, your father ruined the wedding, not you.  Don't beat yourself up over it.  ",
            "This is rage inducing. Your dad is a first class asshole. Cut ties with him. If you pay up, he will leech off you forever.",
            "Dad sounds like a huge dick.  ",
            "Vultures, the lot of them. Money brings out the worst in people. You did nothing wrong and you don't owe anyone a dime. Hold your ground and stay true to your convictions. Can I have some money?",
            "I'm sorry dude, that sucks. The sad thing is I bet he probably wouldn't do that if the roles were reversed and your sister was doing well, but you weren't. I feel like he's using favoritism, but idk your family enough. Hopefully not, and he would ask your sister to do the same. Is that something he ever mentioned growing up? Help your family?",
            "Damn. That's a lot of money. To ask someone to pay off half a million in debt is ridiculous. And to then say that you don't deserve it is even worse! You worked hard and you earned that money. And its your right to choose how you spend it. It sounds like your dad is an asshole who is jealous of your wealth. Your sister sounds really cool though.   \n   \nI think you handled the situation perfectly fine.",
            "I'd like to add that even if you wanted to pay off her debt, why would you pay off her fiances debt??\n",
            "Their debt isn't your problem...if you paid it they'd just ask for another half-million dollars so their kids can go to law school. Best set a reasonable limit now, like you did.\n\nHow did you learn what you needed to know to start your businesses?",
            "Your dad is an idiot. First, has no belief in you to do anything with your life, then when you do have success, (bet you $5 he still doesn't believe it if you really got a deep answer out of him) he wants you to give up all the money that the supposedly successful sister should have had (in reflection of him and his \"grand duties and advice\" as a father).  He sounds very narcissistic, manipulative, and to ask another important question - why isn't he putting in his own money to pay that debt off? He sounds like a loudmouth / blowhard. \n\nDon't get bullied into this. Do with what YOU want with your money. It sounds like you're willing to help out with the wedding but I'd also recommend you paying directly for wedding related expenses. Don't just hand over a check! \n\n\n",
            "Obviously your dad was out of line and you'll have to come to grips with how you want to handle that relationship going forward.  As for your sister, in your comments you've said you love her, have a good relationship with her, and are now concerned about her debt level.  We don't know your financial situation and truly how much 'extra' money  you have available.  If you truly feel worried about your sister's financial position, take a good look at yours, decide what you are comfortable with, and just TALK to her about what's going on.  Are they both employed? Are they able to make the payments?  Can they afford a house as well as the student loans?   Have they started any retirement accounts/savings?   \n\nYou've worked hard for your money  and no one has giving you a free ride.   But, in your heart, it's OK to want to help your sister, who you love and care about.  It's OK if you want to give them a bit for their wedding, it's OK if you want to pay off her loans (or all), and it's OK to not do anything.  We can't tell you what to do.  Everyone's family dynamics are different.  Decide what you can easily afford and not jeopardize future plans, decide what you're comfortable with, and then have a private talk with your sister (without the fiance) and have an honest talk about how her financial life is right now.",
            "You don't owe them anything really. This is your hard earned money. Your sister is pretty well qualified. I'm sure she'll be able to handle her situation well. ",
            "Fuck your dad, he's an asshole, that's all ",
            "I don't think anyone should feel compelled to pay down their families debts just because they have the money. You don't get and stay rich by spending money like water, your Dad is harsh and shouldn't have done any of that to you. I dunno what you should do aside from not paying down her debts, maybe take a break from your Dad for a bit :/",
            "HALF A MILLION DOLLARS? nope..\neven if you gifted 25K thats... AMAZING.\n\neven.... 1000.  even a new god damn washing machine.\n\njeez. ",
            "not your debt dont pay, your dad is a dick for assuming you would and college debt is not anyone's fault but their own.",
            "Sounds like your sister wasn't in on the whole shebang, so don't hold it against her. You can (if you want) help her out with the 25k you wanted to gift anyway, but you're in no way obligated to give away half a million dollars. Your father is a pompous, self-righteous jerk that thinks he can still push you around like you're still a boy",
            "Your dad is delusional. If I were you,  I couldn't be in the same room with him.  He wants you to take care of your sister's debts despite his disdain for your life choices. WTF? If he's such a big, wise man he should pay off his daughter's debt. It shouldn't even be your responsibility to pay for her wedding, much less her and her fiancé's ridiculous law school loans.  The fact that you were expecting to be expected by your father to pay for the wedding,  and you were willing to do it,  seems like he already has you brain washed into doing more than a brother should ever do for his sister. ",
            "I have student loans of 16k, by the way you're paying them off. I told my friends already.",
            "> Should I just have kept my mouth shut and paid up?\n\nFuck no. NEVER. Even your 25k scenario is a bit much. I am in a similar situation as yours: sister cannot set $1 aside for the life of her. All I do is pay $2-3k for my niece's school each year, whenever I feel like it or if they ask nicely. You are living your life, not theirs.",
            "She and her husband both have law degrees, they're not going to have a problem paying off their student loans. No, you absolutely should not give them half a million fucking dollars as a wedding gift, that's insane. You've done well for yourself and worked hard, your dad is being an ass and I my guess is he has a huge chip on his shoulder because he has never and will never be able to provide for his family the way you will be able to provide for yours when you decide to settle down. You are, at 31 years old, far more successful than he will ever be. Unfortunately, instead of him being proud of how you've done for yourself, he's gone the other route and become an entitled jerk. \n\nYour sister seems to understand that this was your dad's fault, not yours. You don't need to do this, but if you wanted to, you could always send a nice letter to your future BIL's parents apologizing for what happened at that dinner and that you weren't prepared to be put on the spot like that, and that this type of behavior is not something that is normal for the family. As I said, you don't have to do this, but it would be a really nice gesture for your sister. Because let's be honest, if I were one of BIL's parents I would be a little wierded out about what happened too. And the consideration of writing them and apologizing would go a LONG way towards relieving them of any negative first impressions they have. Oh, and if you are going to do this, get some nice stationary and write the letter by hand, it sends a message that you are sincere and didn't just shoot them an email when you had a couple minutes.",
            "You handled the situation like a champ. Don't speak to your dad about money, he clearly sees you as an atm and to him, you can only show your worth by giving your hard earned money to the family. He's acting truly outrageous and honestly such interactions are beneath you. \n\nNow your sister seems to have been as clueless as you were about this whole thing. If you want to do something nice for her and not feel like you are giving in to your father you might consider buying them a nice surprise honeymoon. It would be a gift that's totally acceptable and wouldn't feel like you were forced into anything. That and they will always be appreciative of the experience you provided that they wouldn't otherwise have been able to get on their own. \n\nDon't feel bad about their super high school debt amount. They are both lawyers and should be able to pay that off in just a few years and still have a great standard of living. In ten years you and your sister will both be millionaires and looking back on this it will be no big deal. The experience of paying off your own school debt is one that I think makes people mature in a way that might otherwise never occur. It's good for her to be responsible and take care of it and she has the means to do so. \n\nHope this works out for you man, you sound like a good guy and totally deserving of your success. ",
            "Honestly you're handling this much better than I would have. You worked hard to earn your wealth, and your sister worked hard to earn her debt. It's not your responsibility to take any of that off her hands, and it certainly is not your responsibility to waive the debt of a man you barely know. For your father to expect that of you is genuinely appalling. Clearly you know how to handle your money just fine, or else you wouldn't be where you are now. It's already wildly generous of you to intend on contributing the 25k, but don't feel obligated to do so  just because of your father's condescending nature. You have every right to choose how and when to spend it, if at all. ",
            "I might of missed something but it seems like your sister handled this okay. It's your dad that's really the fuck up here.\n\nIf it were me, which it isn't so who cares, I would cut my dad out of this discussion and try to talk to him about boundaries, which he likely won't take anything away from, then talk to my sister about helping her out. Maybe paying off their loans in a big lump sum as gift isn't the best course, but if you want to help your sister I'm sure there's another way you could help her out that would work well for the both of you.\n\nI think it would also be worthwhile to find out how much of the student debt belongs to your sister and how much belongs to her fiance. It doesn't really matter that much since their finances will be melded but I'd still like to know this if it was me.\n\nA thought experiment that might help you figure out exactly what you want to do is try and think about how you would of reacted if you had just casually found out that your sister and her fiance have all this debt. Pretend that your dad wasn't sticking his nose where it doesn't belong and what you would of done then.",
            "Your dad is to blame for all this he went around telling people without your consent your sisters loans are not your responsibility ",
            "You weren't out of line at all. Walking out of there was exactly the right action to take. Fuck the lot of them. You owe them NOTHING. If your sis and BIL have all that education surely they can get some jobs and pay off the loans THEY incurred.",
            "You did the right thing. Whether you have $5 or $5million - those dollars are yours.\n\nYour dad wants to look big and powerful and he went grandstanding and now everyone knows he's a fraud. Good.\n\nYour sister also did the eigrightht thing and her not wanting your dad around after this is a solid boundary and also natural consequences for your dad's behavior. You should not get between her and your parents - they owe you a huge apology but they also owe her a huge apology for creating drama and taking attention for themselves at an event that should have been about her.",
            "So you're supposed to gift your sister's future husband a couple hundred k?\n\nUm, no.",
            "You did the completely right thing. Fuck your dad. With a metal spork.",
            "Check out the comments on the thread about the mother committing her daughter's work (carved boxes) to charity auction without asking her. \n\nAll the replies apply to you as well. \n\nFuck that noise and your father who wanted some glory at your cost.",
            "Seriously, fuck your father. He's being no kind of a parent to you and is about as brazenly rude as I've ever heard of a person being. He assumed that you would be giving away half a million dollars without even asking you about it, but *you're* the one there's something wrong with? I'm sorry, but your father is a total ahole.",
            "Where they there when \"you\" were struggling?  Your father does not get to dictate how you spend your hard earned money.  Do not pay for your SIL and BIL's debts.  They are grown adults and can figure it out for themselves.  The only one who looks stupid here is your father.  I would limit contact with them since he feels \"entitled\" to your money.",
            "If I were you I'd go no-contact with your dad until he apologizes. In the meantime, if your sister is truly serious about eloping, maybe you could offer to pay for a vacation for a small amount of people to go somewhere she's always wanted to go, but never been able to afford to do so.",
            "I think you should go no contact with your dad.\n\nI think, if you're willing, you can/could still offer your sister that $25,000 since she appears to be innocent. \n\nPerhaps, though, since you are successful, if you want to help your sister, perhaps you can help her find investment opportunities, she might be able to pay off her own debt more quickly. ",
            "So... You father seems to still hold you in contempt and has zero remorse about what he has been doing.\n\nHere's my advise on how to deal with that, based on how insaw my gf dealt with her narcissist father.\n\nHer father has always been vile and verbally abusive to her family. Even when he was \"nice\" he would still sporadically throw out some insults at my gf, which she would just deal with because she was used to it. One day though, not long after she met me, she decided that she's bad enough and she started to completely ignore him. Even if they were in the same house in the same room, she would pretty much ignore his existence. For several months he went through various stages of anger about it: at first he would go on profane rants, he would pretend like nothing happened, he would play the victim etc. My gf ended up starting to talk with him a year later, and he hasn't insulted her once since.\n\nThe point is, he assumes that he can do whatever and won't face any consequences because he's your father, and its not like you can just cut your father out of your life. You need tonshow him that his actions have consequences, and that ifnhe doesn't change he won't have you in his life anymore.\n\nMaybe write a short email explaining how you feel, and why you think his actions are wrong, and then just ignore him forna good long while until he gets over this whole situation and apologized.",
            "The first thing came to me head you need to tell you dad is \"why you asking for money someone is a loser in life\"\n\nSounds like you dad is those who belive \"my kid will pay me back in the future because i raised him\" people like that are full of shit\n\nStart by telling everyone in the family the exact things you told us in here reddit so you family knows how full of shit you dad is because looks like hes gonna lie hes way out to the family you need to talk or you gonna be \"the bad one\" here\n\nThe only thing i can say is to stay strong and say fuck to you dad and if you truly wanna help you sister do it under the table somethings like \"hey i was goin to give you 25k for the wedding but looks like the wedding is gone so this may help you with the debt\" but only if you truly want to help her \n\nExpect more shit like this in the future because your the guy with money shit tier people will come to try suck you money somehow and that applys family too\n\nim a clerk at a store and i have customers (that look they have money) telling me such crazy storys about family issues because \"hes is the only one who can help you\" or \"i helped a family member and now i dont know how to get him out of my house\" \"hes a lazy piece of shit cant deal with my [insert family member here]\"",
            "Wow your dad is a jealous condescending asshole, holy fuck",
            "It's your money. He can't offer it to people as it's not his. Call your family as tell them ,\"Look. I had planned to help out with some of the wedding costs. I was going to pay no more than 25K so that Sister could have the wedding of her dreams without worrying about the cost. Dad had the idea that I would pay off both Sister's and Brother-in-law's debt and assumed I would be okay with this. He did not ask me, he merely told me to do it despite the fact that I do not feel comfortable paying such a large sum at once unexpectedly. Sister did not ask me to do so nor did she know anything about it until it was sprung upon her at the dinner. I have no qualms helping them if they really need it or get in a tight spot, but I will not honor my dad's demands about what I should do with my own hard earned money.\"\n\nThat's it. Apologize to the in-laws that your dad is a jerk and automatically made an assumption that you'd jump when he said jump. Then give dad the cold shoulder for awhile.",
            "Once you open that floodgate you'll never be able to close it. I am not saying to never give money but remember this. \n\n1. Never give/loan money out and expect to get paid back. \n2. Once you give/loan money then you'll be asked for more money and from everyone. \n\nI don't know what you should do but good luck. Money really does bring happiness but it also brings evil with it. ",
            "I feel like he tried to put you on the spot yeah but why he expected you to do that I'm not sure. Was he telling the truth about the student loan amounts? Why did your sister not know? I might be paranoid but I'd feel like it was a way to ask for money in general from me. You reacted the way I would have too by leaving. ",
            "I hate when people volunteer my wealth.",
            "No, you should not pay up.  It wasn't your Father to offer and quite frankly, what an asshole.  \n\nLet's say you did pay off her debt, then what? Your father might do it again. He sees you as his own personal ATM and you might be paying off his debts, vacations, new car or new house etc etc\n\nTalk to your sister and keep the bond going.  What do YOU want to do?",
            "So your dad always thought you would be a loser and bum because you didn't get a higher education, you end up being very successful, and now he is trying to use you as an ATM? Fuck no OP. Stand up for yourself. What he did by offering up YOUR money was completely unacceptable. You are under no obligation to pay off your sister's or anyone else's debt. What you work out between you and your sister is your business, but with the lack of respect that your parents show for you, I think you need to reevaluate your relationship with them. I also think that you need to be blunt and tell them that they are never to do anything like this again or else you will not have a relationship with them. Don't let anyone use you or treat you like shit, even if they are family. ",
            "Under the assumption that you trust her and she hasn't given you a reason to assume that'd be a bad idea, I'd say talk to your sister about this. Tell her whether or not you'll contribute to her paying off debt - after all, she didn't do anything wrong to you, so your stance on *her* issues shouldn't change for the worse.\n\nIf she wants you to talk to your dad about this, consider that too - she doesn't seem like a person to ask you to beg them for forgiveness. If you can do her a favor by saving the wedding (be it by making a partial payment towards her debt to appease your parents or by talking sense into your parents), I'd say go that route. If however she is content with not having your dad included in the wedding, that's cool too I guess?\n\nReally, your dad shouldn't guilt you into anything at this point. Do what you can and want to make your sister happy.",
            "I would literally never talk to my father again if this happened. How DARE he expect you to pay up 500k? What the *actual* fuck? No. That's not how this works.   \n\nCut contact and move on is what I'd do. Or at least have nothing to do with them until they apologize to you in the most sincerest of forms and don't expect a dime from you.",
            "Man... Sorry that your father's such an asshole.",
            "May I suggest you check out r/raisedbynarcicists? Because, dear Gods but it sounds like your father may be one.\n\nNext, from what you've said you have a good relationship with your sister. So sit down with her and her fiancee (after deciding what works for you in terms of a gift) and ask them what they want. The hell with your parents -- they're obviously not contributing enough to make up for the drama they're causing.",
            "Adding to everyone else's replies, I'm not sure why your Dad felt it was OK to a) tell people you are rich and b) grandstand with your money by making the announcement. It sounds to me like he's intimidated by your sis's inlaws and was trying way too hard to make a good impression.\n\nThe other thing that struck me was his contempt for you. The people like you comment is pretty low and makes me believe that he thinks you've come by your wealth at the expense of someone more deserving. He should be beaming with pride over your accomplishments.",
            "What surprises me is that you're only met this guy once and they expect you to pay off his student loan debt. Like whhhaaaaaaat? You're not a charity. You don't have to give your money to someone that you worked so hard on just so their life is easier. Its one thing to help your sister in her student debt,  but I don't see why you should pay his off as well. ",
            ">Long story short, I said a few things I probably shouldn't have and end up walking out of the restaurant there and then and going back to the airport and catching a red-eye back to NY. \n\nWell done! You've been disrespected and there was a blatant attempt to publicly manipulate you by your own father. This sort of shit requires immediate action to establish boundaries, which is what you did.\n\nYour dad seems to treat you as a naive child, not a smart and successful  man, and he believes that his influence over you is much stronger than what it really is. A big mistake on his part. Playing favorites with children is bad parenting overall. It is damaging for a \"bad child\" (you) and a \"golden child\" (your sis) as well.\n\n",
            "You absolutely did the right thing holding your ground.  You cannot be railroaded like this and expect your parents to EVER respect you or your wishes if you do not draw the line here.  I suspect that this pattern of behavior from your parents is not the first time, and it will not be the last time.\n\nI would tell your parents that their behavior is unacceptable, and you will not discuss this any further with them, and that -any- discussion about money with them in the future is also unacceptable, and you will not respond nor countenance any of their attempts to bring up money.\n\nYour sister doesn't sound as crazy, and I would let your sister deal with it as she wants to.  You have to realize that its not your fault if your sister doesn't have the big wedding she wants (or doesn't want), and drop your associated guilt about the fall-out.  Your parents brought this on themselves with that kind of behavior.\n\nI'm sorry your parents acted like this dude.  I sincerely hope you can find people who don't take you or your hard work for granted.",
            "It sounds like your sister isn't embarrassed at how you acted as much as she is ashamed at what your dad did and what the future in-laws now think. \n\nAs for your dad, I'm sorry that you have to put up w that, hopefully he doesn't ruin your chance to have a relationship w your sister.  ",
            "People are shocked by the huge $500K figure.  But to put that in perspective, that is a small mortgage in some parts of the USA, such as where I am in the San Francisco Bay Area.  I had a mortgage that size and we paid it off in 11 years with good salary, but probably significantly less salary than two lawyers should make.  (I would expect them to earn at least $300K/year combined once they pass the bar.)  We did not have a wedding, just a small ceremony for just $100.  We also had a baby during that time.  We didn't live in poverty, but we were on the frugal side, but still ate out, had cable, and so on.\n\nMy point is that is a perfectly managable amount of debt, even with a mortgage on top.  I have co-workers who have $1 to 2 million mortgages, and they do fine.\n\nI do not feel that they need to be \"rescued\" and their debt is completely normal for their educational background.  Erasing the debt will frankly spoil an experience they need to go through.  They need to live within their means and be able to plan and handle their own lives.\n\nThat said, you can talk to your sister about all this.  If she is a responsible adult, she won't want or need your help.  They will already have a plan on how to pay it off.\n",
            "Your dad's a piece of work. Your sister is great. I wish I could have been at that dinner.",
            "I would buy both of the houses either side of your parents and rent them out to some crack heads for $1 a month. ",
            "In my own opinion:\n\nIf your sister was out of the loop on this and it was only your father who was acting like he was in control of your money, then clear all miscommunication issues with your sister and mother. If you feel like it'll be good to be on good standing with your sister's fiance, then maybe with him as well. It's important to make sure everyone knows that that was your father's idea without your knowledge.",
            "If you really wouldn't miss the money, then just fucking do it. \n\nThis doesn't impact you and meanwhile it completely changes their lives for the better. Sure, there's a principal involved and you can't be expected to bleed money for the rest of your life.\n\nBut that's not the point right now. The point is you can, for no real effort to yourself, change their entire lives for the better. You can unload a lifetime of stress for your sister. ",
            "If she makes it as a lawyer she will have the money to pay her own debts, like a grown up. \n\nIf she does not make it as a lawyer, it's still not your problem to clean up after here. Even though it would be nice if you can afford it. ",
            "If this mess hadn't happened and if you had a close friend who suggested that you pay off their student loans, would you have done it? If so, go for it, but do it on your terms. You have an opportunity to make a huge impact on their new life. From your description it sounds like your sister would do the same type of favor for you if the tables were turned. Either way don't let your dad's actions ruin your relationship with her. ",
            "You are cool with your sister-her wedding will not be ruined bc of you-it is 100% on your father's shoulders.\n\nCall your sister-have a real conversation with her.  Explain you won't be paying off the debt but you want them to have the wedding they want-you had planned on gifting them 25K for either their wedding celebration or whatever they would like to spend it on.  Make plans to get together again.\n\nSend an email to both your parents\n\n\"Mom, Dad, I know you know how incredibly inappropriate and manipulative ti was for you to tell others that I had promised to pay off the student loans when in fact we have never even discussed this topic.  I will not be paying off the loans. I will never be discussing money with you again. We can consider having other conversations after you apologize to both my sister and me. Until you have recognized first that you were in the wrong and second how harmful your actions were I don't wish to have any contact with you.",
            "Honestly, if you really want to repair the relationship with your father/parents, family therapy is probably your best bet.  Because it sounds to me like there are all kinds of unsaid, unresolved issues lurking below the surface provoking all of this drama.",
            "It's probable that your dad is not well. That sounds to me like a very impulsive act, unreasonably so. I wonder if these are early signs of some kind of dementia.",
            "I know, its driving me crazy. This is OPs money, end of story. \n\nIf he doesn't want to pay the debt, that's fine because it isn't his damn job. ",
            "Tell them to absolutely fuck off!! Your post legitimately irritated me so much, why is it that parents always seem to think the brother has a responsibility to babysit the sister when she can't take care of her own life?  Its fucking sexist.",
            ">  My sister was really surprised as she knew nothing about it before the dinner\n\nthank your sister for her sanity, and make sure she know you don't hold any grudge against her. stop talking to your dad. after that, it's your sister's move about what to do about the wedding. it's her call to dictate the terms of who can be there, and if you don't want to go then don't go.",
            "Look, as someone with quite some student loan debt (not nearly as much as 500k though, wtf?), I'd love to have a rich brother who was willing to pay it off. I would NEVER ever expect him to. Let alone be pissed if he would not. I wouldn't even ask him for it, or \"casually\" mention it. That's just not cool.\n\nWhat your dad did was beyond insane and it seems your sis is on your side. Keep in touch with her, don't necessarily pay off her debt just because you feel guilty. If you WANT to, then sure, go ahead. But it's your money and it's 100% ok if you don't want to.",
            "> The final message from my father before writing this was just him ranting about how I don't deserve the money that I have \n\nYour father is a COMPLETE ASS who still can't see through his jealousy enough to realize he was entirely in the wrong here. \n\nThe person who can \"fix\" this situation is your sister. She's the one with leverage (parents want to go to the wedding). Tell her that the wedding means a lot to your parents, and, if she still is willing to have the wedding, you'll put your father's actions behind you if he apologizes to her and you, comes clean/apologizes to the fiance/fiance's family, and promises to never pull a similar stunt in the future. If she agrees, she can then let your parents know that these are her conditions for moving forward. If she's not still willing to have the wedding, and is set on eloping, then there's nothing you can do. She may make that choice, and I wouldn't blame her. If she presents these terms to your parents and your father refuses, then he only has himself and his stubbornness to blame. \n\nPlease don't feel guilty regardless of how it turns out. This situation is 100% your father's fault. Also, even if the wedding issue is worked through, it will probably not help your relationship with him. Again, that's 100% on him. His behavior toward you has been horrendous. ",
            "> low 8-figures\n\nDamn. Good for you.",
            "Do not pay her shit tbh. And that is a dumb statement for your father to make, it's your money.",
            "Wow... Ok, I'm someone who is really struggling with the financial reality of higher education. I think a lot about how terrible it is that school costs so much money and how it limits people. However, what your father did, to completely understate it, is rude. It's not his money to give away. It would be one thing if someone approached you and asked, with much humility, for a chunk of money as a wedding present. But this is different and terrible.\n\nAlso how much is their wedding going to cost, do you know? It sounds like they're not aggressively paying off their debts.\n\nIt sounds like your father hasn't figure out what the younger generation has pretty much figured out at this point... Education is too fucking expensive and it's literally ruining lives.",
            "Your dad was definitely totally out of line with what he did. Just not acceptable at all. That said, if I had upwards of 10 million dollars I would pay off any debts my family had without a second thought. That's ultimately your decision though, not anyone else's to make. ",
            "500k?  Really? \n\n\nI think not and think anyone who thinks this is a good idea can do the paying off themselves :)",
            "Do not give them 500 thousand dollars. This is a baseline gift. What will they imagine you can give them if they have future problems? Do not set this high a precedent. \n",
            "Definitely don't pay off the BIL's debt. Maybe pay off your sisters though if you feel like you want to. Family first.",
            "\"and have recently moved across country to NYC to find a mentor to help me play in the big leagues.\"\n\nlol. Are you looking for Donald Trump? This post sounds fake.",
            "I'm so confused why your dad seems to dislike you so much for being a self-made man.",
            "As a dad with a son and a daughter... I would never just assume that the most successful child should take care of the others debts. Sure, I'd be elated if they came up with the idea themselves without any coercion. But that is not my expectation of them. I think your dad was beyond wrong. ",
            "> him ranting about how I don't deserve the money that I have and it is because of “people like me” that college graduates are struggling\n\n\nLOL WAT",
            "I've heard that relationships get tricky when a person gets a bit of money. Suspect things like this are why. You father's behavior was ridiculous and the most worrying thing is that he thought that was a reasonable thing to do. I hope things get better. It would suck to be isolated from your family because they wouldn't behave reasonably. Unless you want to just give them whatever and call it their money too, you probably need to take a hard line with them so that they understand that they will not get rich by manipulating you. Its a hard position to be in, I hope it gets better.",
            "A 500k wedding gift???? That is fucking absurd to demand of someone, no matter how rich you are. ",
            "You weren't out of line at all. In fact even given your wealth, $25k would have been incredibly generous. You have no obligation to shower money over everyone.\n\nIt seems your sister is an innocent party over this. I don't think you should tell your sister to \"forgive\" your father, but you should say you'd prefer it if you regard it as a private matter between you and your father and ask her to go ahead with her normal wedding plans. Say you'll give her away if your father doesn't show up and behave civilly.\n\ntl;dr; Be generous, but not that generous. Don't throw $500k at your sister and her new hubby. Make a substantial donation to the wedding. If you have that much money to spare, tell your sister that you'll invest it in a trust for future children of the family (yours and hers).",
            "You totally did the right thing.  Your Dad is a complete ass.  He had no right to make a commitment to anyone on your behalf.  If anyone owes your sister an apology, it's your Dad NOT you.\n\nBTW, my husband and I also place a high value on advanced education (college, trade education, etc...).  We back that belief by actually saving money to help our kids pay for those expenses.  The fact that your Dad encouraged your sister to get all that education but didn't support her with money is ridiculous.  If he wants her debt paid off, he can pay it himself.  (For her to have that level of student loans, some of the debt is almost certainly in Dad's name or with him as a cosignor.  So he's not asking for money just for Sister but also himself.\n\nAs far as any money towards a wedding, don't commit to anything.  Instead of saying \"here's money for a big party (wedding)\", let the couple have their wedding on their budget and them give them a gift in the amount of your choosing.  This would encourage the couple to be reasonable with their spending.\n\n",
            "you are under no obligation to pay the debts....especially of some douchenozzle future BIL that may not be around in 2 years. Also your dad is an a-hole for putting everyone in this position.\n\n2 things of note.  \n\n1) Your family doesn't sound exactly like they are in financial dire straights. assuming your sister and her future husband will both be lawyers then they will be more than capable of paying their own debts.\n\n2)  if it wouldn't hurt you...and it was me..... i'd consider paying your sister's debts(hers ONLY) as a gift....then ask her make nice with the wedding but keep it small. .....under the stipulation that the parents sincerely apologize to everyone involved\n\n marriage is a big thing for parents even if they are dicks....but if they can't apoligize sincerely to you and everyone else....then i would give sis money to pay her(only) debts...and buy them plane tickets to hawaii and tell them they have to elope as a condition to get the money to spite your parents",
            "\"Father, do not insert yourself into my relationship with Sister. How I chose to interact with her is none of your business. Do not assume that my wealth, skills or property are yours to hand out. You have made a error in judgement and boundaries, and I will be expecting an apology. If you don't reflect and sincerely apologize, then I am afraid you have harmed our relationship irrepairably. I also will not intercede on your relationship with Sister - she is quite capable of expressing her opinions and her needs to you herself.\"",
            "I am going to do a to:dr because I'm angry for you I went through a similar thing but was just that I would pay for a fucking dinner.\n\nAnyhow, no you don't owe anybody and you sure as hell do not need to pay anybody any money. Your father does think he hit the lottery and I wouldn't be surprised if you hear in the future that he needs a new car or the house needs some work done and they hint about needing money all the time to you.\n\n",
            "Just because you chose a different path than what your father wanted for you and succeeded doersnt mean youre obligated to pay for anything. The whole 'you people' thing irks me..",
            "Your future BIL is a stranger to you. If you choose to help your sister with her student loans, that's a kindness that should not automatically be extended to her husband. ",
            "This is 100% on your dad. Your sister handled this extremely well, from my perspective, and you have every right to be super pissed.\n\nYour father resents you, I think, because by his estimation (hell, by society's definition in general) you should be making minimum wage at Del Taco. After all, if education=success, lack of education=lack of success.\n\nSo as weird and counterintuitive as it sounds, your dad feels you didn't \"earn\" this. He feels that you, more or less, got really lucky being this successful and now you should be thanking your lucky stars for making all this money and helping your family left and right because your sister deserves the success, whereas you just kind of fell into it. I think it would help sitting down with your dad and discussing this, because it sounds like your relationship with your father is extremely broken.\n\nThat said, he definitely owes you, your sister, and your sister's boyfriend a major apology.",
            "Your sisters wedding would be destroyed by your father, not you.  Make up with your sister because you are both victims in this, and pay off her loans if you feel its the right thing to do.  ",
            "You're not obligated to pay down your sister's debts. Your father is the one in the wrong here, and his behavior at that dinner was entirely inappropriate, seeing as you and your sister now both feel like shit for no reason.\n\nYou said that you were worried about ruining your sister's wedding. None of that is on you, but if it makes you feel better about the whole thing, offer to kick in some token amount. You said it would be within your means, and it would be a nice thing to do- based on what you've said about your sister, it sounds like she'd be grateful even if you just got her a blender or something.",
            "A big wedding is not a good idea. Even debt free, spending 5 figures on a wedding is usually not a good investment. Eloping and then coming back a few months later for a celebration party would be the most financially sound decision, especially if they work out a plan to have someone host it or provide for some of the necessities - food, decorations etc. These things could be considered wedding gifts.\n\nBut before they even get to that point, major discussions about finances needs to happen. A truly generous thing you could do for them is to give them an interest free loan which they use to pay off the highest interest loans immediately. I think anything else would put your relationship at risk. I know I would never be able to feel the same way with a family member who would gift me that kind of money when I was struggling.\n\nYou may want to point your sister and BIL-to be to /r/personalfinance for better advice. Be warned that they will get comments about being dumb for getting themselves into so much debt without a plan. But for the most part they'll get decent advice.",
            "You were never out of line. This is THEIR hot mess. You didn't offer anything, you didn't hint at anything. They assumed and pushed you. I would have done the same. Let them deal with it. Be there, when they are done. Don't pay up.\nIf you wanna do something nice, then offer them to LEND them the money, with a proper contract and a good interest rate, if any. Since they are going to law school, you would assume they should be able to pay their debt themselves later on.",
            "Tell them you already bought yourself a house. You 'love your house because you want to have a family one day'.\n",
            "I am goi to ignore most of what is said and point out that they would have to pay a massive amount of tax on that 500K as it would bee considered income when paying off the debt. Is your father even aware of that?",
            "Your parents are fucking crazy and apparently on some level your sister agrees. At least you know now she never had an expectation that you would pay off her debt, so at least you two are cool.",
            "I think it's time to set boundaries with your Dad. I would tell him that your impression is that he looks down on you and generally has a low opinion of you. That again and again he makes derogatory remarks to you. You can say that this is hurtful and for that reason you will create some distance between the two of you for now. \n\nAnd then you ignore him and avoid him.\n\nIt sounds like your sister is innocent.\n",
            "Uh... $500k for something you didn't even use or enjoy?!? What kind of ass thinks that's an appropriate wedding gift to someone else? And he doesn't even ask you before he mouths off to everyone about it? You did the right thing.",
            "Your dad was way out of line and upset both you and your sister. He needs to apologize to both of you. Paying off 500k worth of loans is a huge gift. Hell, paying off 30k of loans is a big gift. Your dad needs to apologize for his presumption. ",
            "Quite simply.. fuck that noise. Long story short, entitlement issues/not your responsibility. Make good with your sis, dont pay anything over 25k like tou planned, and hold your ground. You deserve every penny you made. And you deserve to keep it without family drama.",
            "Paying for the wedding is more than enough and your sister would probably think so too. They both have law degrees, that debt isn't going to ruin their lives or anything.\n\nMaybe instead you could make a sizeable donation on their behalf to a charity of their choice?  If you really wouldn't miss 500k, give it to someone that really needs it, and stick it to your dad right in his smug sense of self righteousness in the process.",
            "Fuck uhm",
            "The short and simple version: you work everything out with your sister and the two of you TELL your father the outcome. He has no input. It's what the two of you want, and your sister will be dealing with her fiancee's family. If she asks, you should speak to the future in-laws to clear the air and make amends for what happened at dinner, but again your father is not involved. ",
            "You were not out of line at all, your dad tried to manipulate you into paying a huge sum of money for your sister(who will most likely be totally fine as a lawyer) by, in my opinion, a form of blackmail. I would not pay anything(unless you want to and you and your sister keep it quiet) and do not talk to your sister about forgiving your dad. He put himself where he had no business being and fucked up, he needs to take responsibility for what he did and apologize. This isn't you or your sisters mess to clean up this rests squarely on his shoulders.. ",
            "It hurts my brain even thinking about why you should feel obligated to pay off debts someone else has incurred. ",
            ">Should I just have kept my mouth shut and paid up?\n\nNo. He totally put you on the spot and embarrassed himself by doing this. First of all, it sounds like he doesn't like you that much. \n\n>it would be really nice if I “did something for the family for once” \n\n>confidently predicted that I would be a bum and a loser for the rest of my life\n\n>him ranting about how I don't deserve the money that I have\n\nDespite all this, he thinks it's his place to decide how you spend your money. Asking you if you would do this would be one thing. Telling you to do it and then putting you on the spot is ridiculous. \n\n>My phone is being besieged with messages from my parents to talk to my sister and ask her forgiveness so that she will forgive them. \n\nHave they even asked for your forgiveness? ",
            "Fuck your dad with a stick, he's the kind of people that needs a doze of ass kicking. It's your money, you worked hard for it, FUCK 'EM.",
            "Don't give them a fucking dime, man. It's your money and you took big risks to be where you are. F them. ",
            "You don't owe them anything. Your dad owes everyone an apology. \n\nAnd frankly, if they have $500k in debt they should be eloping. Not blowing tens of thousands on a one day event. ",
            "Stay cordial with your sister. Forget your father as it will always be something else that he wants to you to pay for. Your brother -in-law had nothing to do with the situation. Give your sister a nice cash wedding gift and say good luck. They can use the education to cover THEIR debt on their own.",
            "Starting off here.  Dude,  congrats on making out in the world.  It's good to see you're actually doing well for yourself.  \n\nSecond,  your father doesn't have a right to say anything about your achievements since you worked hard for it and earned it on your own. That's a sickly toxic situation in which they see you as contributing because you \"have to\". \n\nNot once in my life would I even contribute more than $10k back to my immediate family after all the toxicity I've been in with them,  because I owe them nothing else. Your sister should've never assumed you as paying such a huge debt because of your success. \n\nIt's her decision to spend $500k in loans? It's her responsibility.  Plain as day.  To automatically assume and tell everyone including your parents and FIL's that you'd do such a thing,  is absolutely ridiculous.\n\nAs for the messages and voicemails? I'd leave one ultimatum and tell them that if you still want to remain a healthy connection,  this has to be straightened.  Now.\n\nYou shouldn't have to bear the burden of others decisions,  and should not be completely set in a lie fabricated by them. That is just greed and you weren't petty for standing up and leaving.  You were leaving a toxic situation where it needed to be left.  Not on you.  \n\nSo I hope things get better with your family, and I hope you can still get through it OP.  ",
            "I'm guessing your father feels insecure about his economic situation.  He wishes he could wipe out his daughter's debt, and because he can't, he has chosen to project his guilt onto you.\n\nAlso, he may be one of those crazy people who mistakes their ideals for reality.  Your father probably believes it is ideal for family wealth to be shared.  Siblings should want to help each other.  But reality always falls short of ideal.\n\nThe reality, as I'm sure you know, is that you'll be expected to help out with things in the future, even if your sister does become a hot-shot lawyer.  You have to pick and choose which things are worth fighting over, and which ones aren't.  I say that while it would be nice to help with her student debt or her wedding, all of these things are ultimately luxuries that she should have planned for.  But if your sister is in serious need of help (let's say she was paralyzed in a car wreck and didn't have any insurance, for whatever reason), then you'll have your chance to shine as a loving brother.  \n\nI don't know if I would have handled the situation the way you did.  But I certainly don't fault you for being pissed off.  What your father did was horrible.\n",
            "First, let me just say that I am sooo happy I already had a glass of wine in front of me when I started reading this.\n\nLook, if you WANT to pay it, then do. If you don't, then don't. It's really that simple.\n\nYour father was absolutely an ass to handle it that way. He has NO say over how you spend your money. He made his bed (in regards to your sister's anger) and now he has to fucking sleep in it. \n\nPart of me wonders if your father is bitter and angry because you've made this financial success for yourself without the formal schooling he values so much. \n\nGood luck. This has to be rough.",
            "Also, I've had to deal with my parents' expectations of me to take care of their debt my entire adult life.  I completely understand your frustration about how cavalier your dad sounded when he expected you to pay off half a million dollars.  You have every right to be mad, and your sister and you seem to have a good understanding of one another, which is great.  Keep up communication with your sister and work with her about this wedding/debt issue instead of your parents.\nI also live in NYC, if you ever need someone to talk to about these  kinds of family issues, PM me.",
            "You should crosspost this to /r/raisedbynarcissists\n\nThis reminds me of the guy whose mom expected him to pay for her apartment at $5k/month. https://www.reddit.com/r/relationships/comments/3fwuub/update_i24m_caught_my_sister26f_trying_to_steal_a/\n\nCut your father out, he us treating you with zero respect.",
            "your dad is a dickhead. where does he get off deciding what you will do with your money? \n\nlooking forward to the update that should follow this one! good luck man! ",
            "Nothing like familial expectations and money to muck up an already troubled relationship. The problem isn't the money or the college, it is that you and your father have a lot of old baggage between you two. Your father sounds a little resentful that you didn't follow his advice and were successful - how dare you - and that your sister did and is now saddled with all kinds of debt and going to have a rough go for the next decade or so. You sound a little resentful that your father didn't respect the path you followed or the success you achieved, yet now he has lined up at the till like you owe him something. \n\nWhat it really sounds like you need to do is sit down with a mediator or relationship therapist - you, your sister and your parents. Life is too short to let this fester, and just throwing money at it could just make it worse and not better in the long term. \n\nAs a small business owner who is in business with family, I feel your pain on both sides. Best of luck. ",
            "Well, I have only your side of the story, but if you gave an accurate account of things I would say your dad is way, *way* out of line. Personally I have benefited from my mother's generosity in life and I would say that the sense of security of being able to turn to your family in a moment of need is one of the best things about family, but here it sounds like your dad was basically making promises on your behalf to make himself sound good. I'm happy life has gone well for you so far, and it sounds like your sister is reasonable, but your dad appears to be extremely self centered and completely uninterested in your perspective. It's worth remembering that if your sister made it through law school, she's not going to have great difficulty paying off that debt herself in a decade or two.",
            "I think you're sister is nice. Maybe get her a nice wedding gift (I wouldn't say 500k though..).\n\nAnyway, you're dad sounds shitty",
            "You sound awesome even though it seems you've taken a lot of crap along the way growing up. I think the $25,000 for the wedding is more than enough and shockingly generous. You shouldn't pay a cent toward their student loan debt. I don't know any poor lawyers and they will live quite well off, despite their loan payments. If you had been a failure do you think your father would've asked your sister to financially support you in your difficult time? Hell no. I used to do ok financially and my family always expected me to help out which I gladly did because I love them and that's what family is for, right? Right! But now that I am facing difficulty and about to lose my home,\nHow many do you think are there for me? None. My gofundme raised $0 despite my brother coming into some money recently. I think by me babying them it led to them being less responsible and compassionate adults. Struggle teaches you important lessons. You both made different decisions in life and yours worked out better, but that doesn't mean she's doing bad. I'm sure your sister and family know that if any of them ran into real trouble you would help. Maybe book them an awesome honeymoon :) You would be brother of the year for that alone. Good luck! Stay strong! \n",
            "I'm sorry your father is doing this to you. What he did was wrong and it sounds like your sister would not expect you to pay that debt. Regardless of how much money you have. $500,000 is a lot of money for anyone.  It would be wrong to expect Mark Cuban to do what your father asked of you. Further, your father needs to apologize for what he did. It was outrageous and you cannot have a relationship with a man like that unless his behavior changes. \n\nIf you pay this money your family will come to you for a free handout whenever they get the chance. And don't think that if you DO pay it that it will change how your family behaves. You'll just make them spoiled brats. When your father wants to retire to a beautiful condo that he can't afford, you'll be expected to front the bill. And there will be a ton of other times when it will happen. Do not give in. \n\nI am a young person making a lot of money, not nearly as much as you, but a lot for my age. I can tell you that money does not buy family behavior modification. Please trust me on that. ",
            "I'm sorry your father is doing this to you. What he did was wrong and it sounds like your sister would not expect you to pay that debt. Regardless of how much money you have $500,000 is a lot of money...for anyone.  It would be wrong to expect Mark Cuban to do what your father asked of you. Further, your father needs to apologize for what he did. It was outrageous and you cannot have a relationship with a man like that. \n\nIf you pay this money your family will come to you for a free handout whenever they get the chance. And don't think that if you DO pay it that it will change how your family behaves. When your dad wants to retire in a beautiful condo that he can't afford, guess who he's gonna expect to pay for it?  And things like this will happen all the time. You want to get into the big leagues, right? This kind of shit will hamper your goals. \n\nYou cannot let your father get away with such a disgusting thing. It was one thing to ask you to do it, but telling your sister and the fiancé that you WOULD was horrible.  \n\nI am a young person making a lot of money, albeit not as much as you (six figures, not eight), and I can promise you that money will not buy behavior modification. It will just make your family a bunch of spoiled brats, in the way a 10 year old would act. Your dad believes that you should share this money with him and thinks he's entitled to to it, even though he didn't believe it you. Don't let him get away with it. \nCongratulations, however, on your success. I hope you continue to succeed. \n\n\n\n",
            "This is 100% your dad's fuckup.  That is your money to determine how you want to give it away, not his.  He may think it would be wonderful for you to give all your money to some bullshit charity that gives AIDS to turtles, that doesn't mean you have to do it.\n\nSecondly, your sister chose a career path that required a lot of education.  She knew what she was getting herself into when she started.  And the result is that she will be rewarded financially in the future.  Her choice, just like it was your choice to go your path.\n\nIf it were me and I came into a bunch of money, I would try to help my family out.  There are times that my parents have given/loaned me money, I know my sister could use money, but I wouldn't just wipe out all of the debts that they've incurred because of their own decisions.    For example, my sister has a son, who because of my sister and BIL's salaries, will probably be limited in educational opportunities (I see educational including travelling to learn about new cultures, not just schooling). So if I had the money I would set up some kind of trust for him.  Not sure if there is something similar you could do, to show that you are giving back (if you want to) without just writing a blank check to the family for every time they want something?\n\n",
            "If you are inclined to do so, you could always pay off her loans under the condition that she keep it between you and her.  That way your dad doesn't see pressuring you in to paying for stuff as something he can do.  It seems to me your sister might appreciate it but doesn't assume it's your responsibility to pay for her debt.  In other words, I think she may be a normal human.  You probably could even just pay a decent chunk of it and take a huge burden off them.  That being said you don't need to feel like this is something you have to do.  It is your money.  You earned it.  She looks like she will love you regardless.",
            "Fk yo dad, as much as you may hate it, I am still gonna hate it, people that didn't receive enough education always tends to think like this, always stuck in his own way",
            "I don't have anything unique to throw in that hasn't already been said, just wanted to cast my vote that you were completely right and your dad is completely in the wrong. You don't owe anyone anything, and I get the feeling that if you didn't have money, your dad would be treating you poorly for not going the formal-education route. You can't win with him.",
            "If it really is about the principle of you being expected to pay off their debts (which is completely valid), you could wait and help them with it down the road after the wedding. You don't actually have any moral obligation to pay it off but if you want to then that could be a way to do it in which it would be by your own volition and not because of someone else's expectation. ",
            "You are right. Her decisions are her decisions, not yours. You don't work for them. ",
            "Do you have 500k lying around? Do you really want to help your sister by paying all that money which she and her husband put themselves into?\n\nYou dad is a jerk for railroading you into paying their massive debt.",
            "1) How can you ever be expected to give a 500k wedding gift? And how is that equivalent with doing something for the family for once?\n\n2) How are you expected to pay for your BIL's debt? You have no apparent relationship with the guy?\n\n3) Why does your dad feel you don't do anything for your family?\n\n4) What, if you were asked like an adult, would you like to give to your sister? What would you like to give to your BIL?\n\nThere is no guarantee this thing is going to last and you do not know this guy or his family. If you still have some interest in helping them maybe you can pay off some (or all) of your sister's debt (not simply giving them a lump sum) and create a trust for both of them that they will have access to in the future. This is beyond presumptuous. Your father clearly has little respect for you and may be jealous.",
            "What the hell is wrong with your father thinking that it's okay to expect YOU to pay a half-million dollars of someone else's debt??!??!?!!",
            "You say you have the money and wouldn't really miss it.  The question, then, is, do YOU want to give it to your sister?  If so, do it.  If not, don't. \n\nIf you want to give a smaller amount, do that instead.  But don't do anything because you were \"railroaded.\"  It sounds as if you have no good relationship with your father (parents?) anyway--you may want to work on that or not.  Your sister seems as if your relationship with her won't be damaged either way.  \n\nYou, my friend, have some soul-searching to do.  ",
            "your father sounds like Lord Cuck",
            "As someone who has supported her sister because her parents couldn't (our mother is a fuck up) and just recently stopped. I cannot tell you the overwhelming relief I feel about not being obligated to support her. ",
            "fuck them",
            "Employ her. Offer her a nice salary and then tell her that you'll pay the debt off after a certain number of years. That way you know you have a *right hand man, so to speak, that you can trust working by your side. That's what I would do. ",
            "You did NOTHING WRONG!  You have a screwed up, Dad. I do, too. I feel your pain. god, it hurts but stand your ground!  \n\n",
            "Your sister should now refuse to let your father pay for the wedding. And then you and her arrange it and you pay for it. Cut him out of the planning, etc., and just send him an invite without any more information.\n\nThat will upset his role as the father of the bride. He will learn from someone else how generous you're being by paying for the wedding and be ashamed.\n\nAs for your sister and BIL's student debt... that's their problem they went to college now get good jobs that will pay for it.",
            "It probably would have been better if you hadn't said anything in front of your future in-laws (your sister seems innocent here and it really sucks that she was embarrassed in front of them through no fault of her or your own), but you can hardly be blamed for reacting poorly to something as insane as your dad telling everybody you're giving away half a million dollars.\n\nAs for what you can do now--well, a lot of that depends on your sister. If she and a wedding weren't involved, I'd be inclined to let your dad stew in his wrongdoing for awhile and keep contact limited for the time being. But if your sister wants things to blow over, I think it would be kind of you to talk with your dad and see if you can reach a resolution, if only for her sake. \n\nThe larger question is whether or not this is something your dad's done before--you said he's been shitty about your lack of college education, but has he promised your money and time without your knowledge before? Does he tell lies about you or bully you in other ways? If this is a one-off, then perhaps you can shrug and move on. If it's a pattern of behavior, it's worth evaluating the extent to which you want to maintain a relationship with your father. I'm sure someone has already recommended /r/raisedbynarcissists. It sounds like you may have a golden child (sis) and scapegoat (you) dynamic with your dad. \n\nFinally, if you're planning on blowing $25k, I just want you to know that my student loan debt is a mere $5k. Just saying. ",
            "It really sucks that your success has tainted your family relationships but it sounds like the heart of it is your sister and dad's relationship.  Just keep in contact with her and make it clear that your dad has to come to you to apologize.\n\nBut yeah, don't pay a cent until the drama gets at least some closure.",
            "I just think it's hilarious that you have to point out that you, a male, are not identical twins with your sister, a female. \n\nAlso, I think you and your sister need to do damage control together. Your dad is the bad guy here. ",
            ">Long story short, I said a few things I probably shouldn't have...\n\nIn this scenario, I could justify you saying ANYTHING.  Kudos to your sister for sticking up for you.  My heart is warmed by sibling loyalty.\n\nFor the sake of the family, perhaps you could - not should - could consider talking to your sister to reconsider.  She has shown you loyalty, so having her understand that having her parents at her wedding is a once-in-a-lifetime opportunity and that she may regret not having them there.  Do it for HER, not them.  You'd only have to deal with your father for a day or two for the wedding.  Do it for HER, not them.  I'm praying for you, bud.",
            "Is your dad mad that he can't pay his daughters student debt and wedding? Why the fuck is it his sons job?! Shitty dad. That is appalling he would do that no matter the money you have. Maybe he's embarrassed.",
            "he's an entitled ass who caused a huge problem by trying to spend your money (seriously, $500k? that's a nice place in the city where i am) and then making you to be the bad guy/fixer when it blows up.\n\nadvice? dunno, if they elope, can you get on the guest list? dad can lie in his own bed.",
            "From the way you speak about this, I would guess that you are (unintentionally) very good at rationalizing your father's behavior for him, and your first instinct is to take guilt and blame on yourself for when there is a confrontation with him.\n\nYour father appears to be used to being able to do this to you, and expected that it is the way things work that he can just force you to do this, and lie about you and your motives when his narcissistic manipulation is not capitulated to. \n\nMy apologies to you and your sister for having to deal with him. Please just stress to anyone involved that you had never offered to pay off the student loan debt and the father had lied and told everyone it is something you had agreed to beforehand. Cut off as much of his credibility as possible. Do so in a matter of fact way.",
            "Pay off her loans as a wedding present and tell her that you don't want them to be a burden in their relationship. Don't let her or your future BIL tell anyone.",
            "Your father is a jerk.",
            "Don't have much to say but just wanted to add congrats on your hard work. ",
            "Your dad is an absolute mess. Your story gives me the impression that parents don't seem to know how to truly respect their children; even at 31 years old he still somehow thought it was okay to presume you'd pay your sister's debts and just go ahead and tell everyone before even getting your agreement. \n\nAnd then to go and tell everyone that you had agreed and just changed your mind when you never knew about it in the first place? Ridiculous.",
            "I'm only writing this because so many other people are taking the other side. \n\nI think it might be worth some time to consider helping your sister out. Maybe that's not writing a check, maybe it is. I say that because I think, in one way or another, your dad helped you out. You obviously love your sister and entire family. \n\nThat money isn't infinite. But I think if you can work something out, while making clear this is for you'll be better in the long run. This seems like a petty thing to come between family. ",
            "The biggest asshole in this situation is your dad.\n\nYou aren't wrong in feeling upset at all. It's not even about the money, it's the way your father approached you - he's asking for an indirect favor, but instead of coming from that angle, he approached you in a way that made it clear that he had no respect for you or sense of how significant and generous that gift would be. He didn't ask; he simply volunteered you up for the task with no words of gratitude or recognition of the gift of you'd be making, but rather as if you \"owed\" the family something. Of course that tone and the assumptions he made as well as forcing you into this situation would make anyone furious! The sense of entitlement in his approach is just mind-boggling. It raised my blood temperature just reading this post - it reminds me of my own parents' approaches so much. He was incredibly un-diplomatic and clearly has no negotiator or people skills.",
            "What the fuck? You're like the least obligated person involved to be paying any amount of money in this situation for any reason. 500k? I'd have laughed in my dad's face. My family is fucking loaded and I'd be ecstatic to receive $500 for a wedding gift. The fact that he just offered up half a million of your hard earned dollars is a crime. He essentially tried to bully you into giving up your money. I'm glad you stood your ground. He thought if he told everyone you'd do it that you'd be too embarrassed to say no. Not that it isn't petty, but I'd offer to reimburse the entire cost of the wedding under the condition that dad wasn't invited just out of spite.",
            "I think your father might have some mental issue, eg early dementia. This is not a normal behaviour. ",
            "[deleted]",
            "what ethnicity is your family?",
            "All you need to know is that your parents are asking *you* to apologize to *your sister* so that she will forgive *them*. If you think that makes no sense, congrats it doesn't. The only family drama here is caused by your parents, they're just trying to deflect responsibility. Tell them their beef is with your sister, if they want her to forgive them they should apologize to her. Then call your sister and empathize over having shithead parents. If you think you'll get a reasonable answer, ask her if there's anything you can do to support her through this.",
            "Uhhh no. What you should do is cut off your parents, your sister should uninvite them from the wedding and live happily ever after. Also let your sister know you'd love to contribute to the costs of the wedding (if you want to)",
            "Your initial instinct is usually correct. Your father should have talked to you first about any gift-giving and it is your decision how you spend your money.  Your father created this mess and he should find a way out of it WITHOUT your assistance.  Plus he owes you an apology.  \n\nAs for your sister's wedding, again not your problem.  I'll wager there are several reasons she wants to elope and/or not have your family there and most of those reasons have nothing to do with you.  And why are you offering to pay for her wedding? Don't do that.  She incurred the student debt, she wants to get married ...she has to pay her way. She's not a pauper, she's capable of making coin, let her. Now should she have kids, THEN you'll have nieces and nephews to spoil ;-)\n\nYou should keep your mouth shut but don't pay up.  Let your parents and sister figure out their own mess.",
            "What's there job situation ?If there both lawyers I would think they would be able to  pay the loan bill each month. just because you have money doesn't mean you have to be the \"cash cow\" of the family. Your dad should also realize how quite a few people have made millions and billions without ever going to college.",
            "Your father sounds horrible mate. That's just some really unfortunate circumstance. He sounds jealous of you, and that's a tight spot to be in. \n\nI don't understand this part though\n\n>My phone is being besieged with messages from my parents to talk to my sister and ask her forgiveness so that she will forgive them.\n\nis your sister still upset with you?",
            "Please remember that gifts larger than a certain amount have to be reported as income to the IRS.   It might be wise to break the gift into multiple years,  depending on what you decide to do. ",
            "Wow reading this made me feel all your pain and anger. I would be much angrier because your dad has no love or is extremely jealous of you deep down. He acted like, he had power over you and trying to force you to be submissive. I think he c u as a treat for a longtime. I would not pay anyone's 500k dept, especially my sisters boyfriends education.",
            "Well, the drama aside,  if you want to do as your father wishes,  I would only pay the sister's debt, not the fiance's. (I personally wouldn't pay it at all if in the same circumstance.) And I wouldn't pay it off in a traditional way. This is her debt after all.  You could tell her that as long as you are financially able to, every month she makes the minimum payment,  you will pay the interest portion of the loan,  so that her payment goes towards principle.  For example,  the minimum payment is $1000, $700 of which is interest.  She pays $1000. You pay $700. That way $1000 goes towards principle instead of $300.",
            "Oh and don't pay the loan outright.  This is very morbid but let's say your sister passes away unexpectedly in five years.  Her student loans would be forgiven.  If your going to pay it,  pay it monthly. ",
            ">My phone is being besieged with messages from my parents to talk to my sister and ask her forgiveness so that she will forgive them. \n\nTough tits. Your dad created the situation, so he has to deal with the fallout. He's literally trying to get you to fix this for him. Don't let him wriggle out of it. \n\nYou did nothing wrong here, OP. What your dad did was awful and coercive and, for what it's worth, I'm glad you stood your ground and left. And what exactly are you supposed to apologize for? Sorry for not cutting a check for a half million dollars right then and there?\n\nSeriously, if I was in your sister's shoes, an apology from the wronged party wouldn't make me forgive the person who actually screwed up. Especially if I learned that it was the product of yet more manipulation on the part of the guy who's to blame in the first place. \n\nThis is your dad's bed. He made it, and now he's got to lie in it. ",
            "You shouldn't pay them because your family is rude to you. Telling others that you're rich? That you're gonna pay whole debt? Without your consent???\n\nI mean doing a favor for your family is OK, but 500k is huge sum of money, and you're NOT supposed to help BIL at all. ._. helping sister is nice, but not BIL or someone else, except emergency (health issues, accidents etc. shit happens)",
            "You are in the right in my opinion.\n\nI'm sure you're sister would appreciate a gesture such as putting money towards her debt but you are by no means responsible for paying it. Also what you father did and how he reacted was completely wrong and uncalled for.\n\nAt the moment I wish I had even 0.01% of what you said you made from that transaction, whatever you are doing keep it up and always remember to help out the less fortunate for you never know how that small gesture can turn someone's life around. \n\nHope that your relationship with your sister does not suffer because of your father's actions. ",
            "Wow you are a good brother with good sense. Your family is unreasonable. I can't imagine where your dad was coming from. Stand your ground. You earned it. Btw, is your father an immigrant, if you're in the United States? It sounds like a cultural thing, to help family, but you are going above and beyond.",
            "I'm not really sure how having Lawyers for family would help, but have you considered having them on retainer for advice and legal consultation? Your sister seems to be a consummate professional, and I'm sure her husband can have the same thing said, perhaps you guys can come to a deal, since the money isn't that big a deal, though the situation is. It helps both of them, and you have the possibility of professional help if you ever decide you need it.\n  \nMake sure any contracts are drawn up and arbitrated by a third party however."
        ]
    },
    {
        "post_id": "7chnom",
        "author": "luxorio",
        "title": "My [F27] boyfriends [M28] centipede escaped and we're fighting about it. 2 years",
        "url": "https://www.reddit.com/r/relationships/comments/7chnom/my_f27_boyfriends_m28_centipede_escaped_and_were/",
        "score": 2070,
        "num_comments": 463,
        "created_utc": 1510516526.0,
        "selftext": "He has a Vietnamese Centipede (google it) and it came with him when we got our first apartment together a few months ago. He's into exotic animals so this is his idea of a pet. I didn't mind, *as long as it never left the tank*. Now it's got out somehow.\n\nThe problem is we'd been going to have his brother, SIL and niece over to visit today. His niece is at the \"crawling everywhere\" stage. These centipedes are very aggressive and will bite if startled or not handled properly. I said he should cancel the visit until the centipede is found. Or at least warn them!\n\nHe said no it's not a big deal. What? There's a baby going to be crawling all over with a venomous centipede on the loose? He said she could provoke it into coming out of hiding, then he'd jump in and get it before it could hurt her.\n\nThis is fucking insane to me. I get he wants to find his pet, I want it found too but how is it acceptable to put a child at risk?? So I told him if he didn't tell his brother then I would and they could decide if they came. He said \"Fine whatever\" and hasn't spoken to me since that this morning. He DID go call them then, and predictably they didn't want to come. We rescheduled, but he's still annoyed at me...for taking safety seriously?\n\nWe've still kept looking for the centipede but I can feel his annoyance at me. Is there something I did wrong?\n\n*Tl;dr* My bf's Vietnamese centipede escaped it's tank. When I told him we should cancel a visit from his family who has a young child, he didn't think it was a big deal. Ended up telling them anyway but he's irritated at me. I don't think I did anything wrong by bringing up safety concerns. What's up with his reaction?\n\n**Edit, how things stand as of 10 pm:** Still no centipede. The apartment isn't that big (3 rooms, 1 closet) and we've checked literally everywhere, no square foot has been unturned. And yes we stripped the bed and sorted through every piece of laundry. We live in a very large and very old building, hundreds of residents. At this point we think it likely got into a crack somewhere in the wall or gone down a vent. The building isn't exactly up on its repairs.\n\nI did calmly tell my boyfriend we needed to talk about his reaction. I told him the phrasing some of you used, that he was basicly saying \"Let's use my niece as bait and lure it out.\" He hadn't seen it like that but when I said so he realized it was true. He apologized for being huffy at me, and for his astoundingly braindead idea about his niece. He said he was panicking and mad at himself for not securing the tank right, and acted defensive. Now that he's cooled off he realizes he was in the wrong. He knows he messed up, I told him if he wants an exotic pet again it MUST be a safe one. At least an escaped iguana or stick insect couldn't hurt anyone. He agreed to this.\n\nThank you to everyone who offered advice!!\n\n**And edit again, ~10:30 Monday night** Hi everyone, I never expected there to be so many comments, I haven't had a chance to read them since last night but I have a few messages from people wanting to know if it's been found so I just wanted to say that no it unfortunately hasn't. We've pretty much given it up as gone now. Who knows maybe it'll find it's way back somehow but unlikely. Also thought I'd let you know my bf decided to hold off on taking on any other pet exotic or not for a while until he has the time to do a lot of research on how to care for one properly and be more responsible.",
        "permalink": "/r/relationships/comments/7chnom/my_f27_boyfriends_m28_centipede_escaped_and_were/",
        "comments": [
            "I love Vietnamese centipedes. I've kept Vietnamese centipedes. I do not, currently, keep Vietnamese centipedes, despite their position as my #1 favorite invert I've ever kept. Why? Because I have two small children, and murderpedes are fast, tricky, and mean.\n\nYour boyfriend is acting like an idiot. Since he's into exotics, I'm annoyed that he doesn't realize he's acting like an idiot--Exotics keepers do a lot of self-governing within the community and we constantly struggle with local (and larger) authorities to convince them that we're responsible, safe, and doing things right. Not only is your boyfriend putting a child at risk, he's doing wrong by both his animal and an entire community of people who keep unconventional animals. \n\nI'm also super curious as to how his murderpede got loose to begin with.",
            "[deleted]",
            "Good job alerting the parents of the baby OP, now please alert the rest of your fucking APARTMENT BUILDING! I would be so pissed if my apartment neighbors venomous centipede was loose and unaccounted for and they didn’t tell me. I’d be “sue the ground out from under you” pissed.",
            "Presuming this apartment is not the only one in the building, you need to alert the building this thing is on the loose.  These can really hurt someone if they get bit.  I'd also be willing to bet that if there are any pet clauses in your apartment lease that this isn't even allowed.  Most complexes specifically say nothing venomous is allowed even if other pets are.\n\nP.S.  Please tell me you're not in Minnesota so I can sleep tonight. ",
            "You guys live in an apartment? Congrats, you guys are literally the worst neighbors on all of reddit. The next time one of those ask reddit posts happen about the worst neighbors you’ve ever had, I fully expect someone to post about their new neighbors who loosed giant venomous murderpedes in the building.",
            "He’s nuts. I can’t believe he would take that chance. I’d be moving out if there was a dangerous pet on the loose and I’m an adult ",
            "I keep exotic pets. Tarantulas, millipedes, lizards... a centipede isn’t too unusual for an exotic pet but they are absolutely nasty and I am genuinely concerned that an infant could be seriously wounded by just one little bite. They aren’t generally fatal to humans... but when that human is extremely young, potentially allergic, and lacks the ability to identify and avoid this type of threat? I would not risk it.",
            "1. I am very aggressively *NOT* googling that lmao\n2. So like....he wants to use his niece as bait essentially. This is literally the *stupidest* thing I’ve read all week and the fact that he doesn’t understand how wrong it is to not tell the parents of a small child that there is a venomous arthropod on the loose in his house is **nuts**. If his brother and SIL came over without knowing and Niece got bitten, they would be so unbelievable angry at your BF. You didn’t do anything wrong in my opinion. ",
            "I have nothing of value to offer that has not already been said. I probably don’t live in the same state as you. Maybe not even the same country. \n\nHowever, I cannot sleep until I know he has found the centipede and it is locked away, because I’m afraid it will get me. Is this irrational? Yes. Do I care? No. \n\nOP. Please provide update when nightmare fuel centipede is locked up so we can sleep. \n\nThanks. \n\nEdit: OP, you need to find the centipede. \n\nIt is 11:37 pm where I am now. Based on the time of your update, we are in the same time zone.  \n\nYou need to find the centipede before it finds me. \n\nEdit 2: 9:27 AM, exhausted, need to get some sleep soon, did you find your terrorbug?",
            ">We live in a very lage and very old building, hundreds of residents. \n\nWho also probably have children and pets.  Please put up some notice in your building that there is a giant centipede (venomous) running around or call the building manager if you have some kind of company running the place so they can do it.  You and your boyfriend do not want the death of a pet or the severe injury of a kid on your hands if this centipede gets somewhere else in the building.",
            "I saw a David Attenborough documentary once where they were showing a centipede and it got away on camera and the whole crew nearby ran away so they didn't get hurt or poisoned. Adults. Running away from one of them. You did absolutely the right thing.",
            "I’m sure any parent would appreciate a heads up that a venomous animal is loose in the apartment where they’re planning to bring their toddler. You did the right thing there. \n\nYour boyfriend is likely mad because he has an exotic, dangerous (from the sounds of it) pet & doesn’t like that other people take issue with that. Which is a “him” problem, not a “you” problem. \n\nKnowing that he likes exotic pets, is that something you want to be around for the rest of your life? It sounds like this is an important part of his identity, so it’s unlikely this incident will change his mind on having other pets in the future. ",
            "All I can say is that if someone actively and knowingly endangered my child the way he's describing here, I would never speak to them again. They would be lucky to not get beaten. Seriously, what kind of shit does that? \n\nYou don't endanger other people without their or their parents consent. Not to find your pet, not take a crap, not for any reason at all. Doing so is INCREDIBLY selfish. You especially don't endanger a child because of a pet. Because I GUARENTEE you that if either of that babies parents saw the damn thing try to bite, they would have stomped that sucker so fucking fast. And then, upon figuring out your BF new his venemous pet was on the loose, never spoke to him again. ",
            "I'm not trying to be dramatic, but I would not stay in a relationship with someone like this. This situation shows so many different, serious flaws with him; \n\n_____________________\n\nThey aren't just aggressive.  They are also very fast and extremely intelligent. You need a specific tank or put multiple weights on top of a normal one -- if you don't, they figure out how to open the tank. Then they go out of their way to viciously attack anything that moves.\n\nYour boyfriend knew this, yet allowed the centipede to get out anyways. I know people who own these animals -- they literally have multiple locks and weights on their cages, they always know where this animal is, because it can seriously hurt somebody. This kind of centipede has killed kids before. \n\nSo your boyfriend has allowed this situation to happen, which is already an issue. Forget the kid -- this animal will hurt you if it doesn't die first.  Yet not only did he allow that to be a possibility, he doesn't even seem to care. What is the point of having a boyfriend around if he'll willingly let you get bit by a centipede? I'm not trying to be funny but lol really???\n\n\n\nAlso, his idea that he can just jump on top of it to capture it is unbelievably moronic. They are way too fast. I wouldn't be with someone who is so careless with dangerous situations, who just poses ideas that would make it even worse.\n\n\nAnd then there's the issue of the young child. Anyone who could be so careless with the health and safety of a child is someone I would leave.\n\n\n_____________\n\n\nGood luck, try not to get eaten by the centipede lol...",
            "This is the kind of pet owner I really dislike. Like these people who say “don’t worry he won’t bite you” completely disregarding someone’s phobia of whatever the animal is.\n\nYou did the right thing. I’m side eyeing your boyfriend hard. He seems childish for not talking to you and immature/irresponsible generally not to recognise that the baby could be hurt ",
            "You absolutely need to let people in your apartment know about this. Unless you two can prove that the centipede escaped the building, not only is it ethically your responsibility to warn other tenants, you could be legally responsible if it bites someone.",
            "According to Wikipedia, they’re only known to have killed a human being once, but that was a seven year old girl that got bitten on the head. There’s an outside chance that it could have been deadly for the baby niece, and even if not deadly, it absolutely would have required emergency medical attention. You not only made the right call, but I’d be seriously reconsidering a relationship with someone this obtuse and self-centered that he was willing to use his baby niece as bait for his venomous pet. ",
            "He sounds batshit from this post. He's really willing to use a toddler as centipede bait? Seriously? You absolutely did the right thing, OP.",
            "You made the right call. Now you have to question whether or not you want to have kids with this guy.",
            "You really need to warn the people in your apartment ASAP if you haven’t already. If someone sees it or their child does and it gets hurt or worse that is 100% on you guys. :( ",
            "Holy Saint Agnes on a polka-dotted mule! Disclaimer: IANAL. BUT: If this critter bites/stings/otherwise injures someone, your BF may be held liable financially if the victim decides to sue.  The medical bills will be bad enough, but then you add a tort claim for \"pain and suffering\" on top of it... unless you get a judge who likes creepy-crawlies, your BF is likely to get hammered.\n\nI hope you guys find that thing before it hurts someone. And I think you should think twice about staying with this guy. ANYONE who thinks it's ok to use a baby as bait is... well, let's just say it brought out all my Papa Bear instincts. ",
            "Where do you live? Many countries have VERY strict laws about exotic pets, especially insects and bugs that are venomous. In my state, you need a permit to own anything that could injure local produce, injure people, or cause problems, even if the species is from another state. And even then you are subject to surprise inspection from the government to ensure your enclosure is secure and appropriate for the creature.\n\nAs he's not handling the situation properly, I would suggest contacting a local pest control. Otherwise, he does not sound like a responsible adult worth dating if he's willing to endanger his niece for the sake of a bug.",
            "[removed]",
            "Am I the only one seriously concerned for all the other residents of the apartment building? This is going to go very wrong...",
            "**\"The Vietnamese Centipede is the only species that has a human death attributed to it. The only reported fatal case was in the Philippines; the centipede bit a seven-year old girl on her head, and she lived for another 29 hours. Even though death from a bite of the Vietnamese Centipede is almost unheard of, the venom is said to cause extreme pain, therefore you want to exercise care with this centipede.\"**\n\nDude. *DUDE.* You may have saved his niece, but think of everyone else in that apartment building. You literally say that you believe it escaped into the building. This thing can kill or seriously injure other kids and pets that live in the building, they deserve to be warned.",
            ">Vietnamese Centipede (google it)\n\nDON'T if you don't like stuff like that - trust me\n\nOP, you did nothing wrong and your SO should be thankful you thought about your niece.",
            "I've never seen such a clear cut scenario of one partner being right and the other wrong. Your boyfriend is an ass.",
            ">We live in a very large and very old building, hundreds of residents. At this point we think it likely got into a crack somewhere in the wall or gone down a vent. The building isn't exactly up on its repairs.\n\n\nso... you do plan to alert the management or other residents about this thing being on the loose, right?  it sounds like it could be a serious danger to the residents of your building.  ",
            "This is the second post I’ve read here about one of those things being kept as a pet and escaping. Fucking nasty. ",
            "I just read your Edit to the post. If its a venomous animal and you think it might have gone to another apartment through the walls, please let everyone now. This could have serious implications for you both!! Its a negligent behaviour",
            "This isn't really relationship advice but... Ewww eww ew ewww. You're taking this way better than I would. \n\nAnd obviously you made the right call. Not everyone would be cool with a huge centipede, let alone a very aggressive one, on the loose. \n\nLet me go shudder in a corner somewhere.\n\nEdit: I get that it's his pet. I have pet chinchillas and I think they are adorable, but some people aren't that fond of rodents. i would never subject someone into coming to my house if they weren't comfortable with them on the loose.",
            ">We've still kept looking for the centipede but I can feel his annoyance at me. Is there something I did wrong?\n\nNo, you were 100% right, your boyfriend is being an idiot. \n\n>He said she could provoke it into coming out of hiding, then he'd jump in and get it before it could hurt her.\n\nThis is the stupidest fucking thing I've ever heard in my entire life. Is he this stupid in other areas? I hope you guys aren't planning to have kids, because he will *definitely* use them as bait for his exotic pets.",
            "Hope you don't want kids with this reckless idiot.",
            "Ummm, if the Murderpede escaped into the building and is venemous, shouldn't you folks notify the neighbors?",
            "Well today you just discovered your boyfriend  is not a responsible adult. It's up to you if you want to keep dating him",
            "I'd be pretty pissed if I were just visiting myself and I wasn't told. I can only imagine how a parent would feel if their child could have been at risk without their knowledge.\n\n\nThe brother should be thanking you and having a word with your boyfriend over what is and isn't acceptable to withhold from people. An aggressive venomous centipede is one of those things you absolutely should tell people about, regardless of whether or not they have children that could get bit.\n\n\n\nI get that he's worried about his pet, but he's still in the wrong here. ",
            "So the centipede escaped through a vent....aren’t you remotely worried..?",
            "Oh My God. Those centipedes are horrifying! I don't think I could stand to even be in he apartment with one loose. It would be questionable even if it was in a cage since th y can obviously escape.",
            "I find these in my apartment every couple of months  (live in Hawaii). They are vicious little shits and require *multiple* stomps with steel toed boots to kill. Completely ridiculous and irresponsible to let a baby crawl around *knowing* that thing is somewhere in the apartment. You did the right thing...your dude's decision making skills are highly questionable though. ",
            "Holy shit, I would lose my goddamned mind if someone tried to use my child as fucking bait for their aggressive, venomous pet! What the hell is wrong with your boyfriend?! What sane person would do something like that to anyone, let alone an innocent baby?!\n\nSorry, I don't usually flip out and swear like a sailor on here, but this post absolutely infuriates me. I hope you tell his brother and SIL he was planning on using their baby as venomous-centipede bait. That is unbelievably callous, dangerous, and just plain horrible! I would never be comfortable having a child around someone so blithely willing to expose them to a potentially deadly danger, without even so much as a word of warning to me! ",
            "As an exotic pet owner with the same kind of centipede I totally agree with you. This is just reckless and stupid. He should be actively trying to find his pet and return it to its’ vivarium too. If mine got out the house would be in quarantine and I’d be really stressed too. Are you sure it’s not buried in the substrate? Mine likes to burrow a lot. ",
            "> At this point we think it likely got into a crack somewhere in the wall or gone down a vent. The building isn't exactly up on its repairs.\n\nOne of your neighbors is going to have a very bad day.",
            "OMG tell your building. Some light googling informed me these monsters can LIVE FOR TEN YEARS ",
            "You need to let your landlord and other residents know asap. Sure, his niece is safe from this thing now, but what about other children in the building?",
            "If hes going to get mad at you for doing the right thing than theres something wrong with him. \n  \n",
            "Your boyfriend is an emotional child, and should not even be caring for exotic pets, and probably shouldn't be in a relationship with anyone.",
            "I'd be scared to sleep with that shit floating around lol, hope you find the thing.",
            "OP, this thing is venomous enough to kill children and pets, and it is loose in the building. Inform everyone immediately and get an exterminator post-haste. Seriously, lives are at risk here.",
            "I would like to know that your venomous animal escaped if I was your neighbour...",
            "You guys need to tell the other residents",
            ">We live in a very large and very old building, hundreds of residents. At this point we think it likely got into a crack somewhere in the wall or gone down a vent. The building isn't exactly up on its repairs.\n\nIf I was your neighbor, I would really want to know it loose so I could go to a hotel. Can you imagine what would happen if it were to go after someone's small child or pet? You need to inform your landlord.",
            ">We live in a very large and very old building, hundreds of residents. At this point we think it likely got into a crack somewhere in the wall or gone down a vent. \n\nSo...are y'all gonna warn people or?? Your safety concerns should also extend to people who are not related to you, even if your bf might get in trouble. ",
            "Are you going to warn your neighbors and their possibly small crawling children just to be fair?",
            "Agree with other commenters that the risk your boyfriend proposed taking is super fucked up (and from my legally ignorant perspective, I'm strongly tempted to call it depraved indifference), but I'd also like to add that I'm scared for *your* safety here and would be deeply grateful if you kept us posted.",
            "Hopefully you guys aren't planning to have kids anytime soon because his protective instincts are way out of whack",
            "Is he even allowed to own that thing? I bet everyone that has seen that thing has told him to be careful, don't let it get loose or even get rid of it. This isn't a pet, you don't hold it and cuddle it. This thing can be dangerous and his attitude about using his niece as bait just shows eveyone why exotic wild animals are not pets. ",
            " The fact that it possibly got into someone elses apartment is giving me anxiety because like, can you imagine just sitting there watching TV and seeing that thing crawling acrossed the floor? I'd literally burn the place down.",
            "Do you live in an apartment? I don't know how dangerous these things are, but if I was your neighbor, I would want to know one of these things was one the loose. Perhaps you should let your landlord or apartment manager know one is loose.",
            "Please tell your apartment management. Your neighbors deserve to know to keep a look out.\n\nYour boyfriend is a colossal, selfish idiot. You did the right thing for his niece. Now please do the right thing for everyone else in the building. People, their babies and their pets deserve to live in a safe environment and by not telling them, you're risking their safety.",
            "Tell the rest of the people in the building and stop being irresponsible jerks. Your boyfriend shouldn’t own any pets.",
            "OP PLEASE READ. If it did get into a vent or crack and you live in an older apartment building, you HAVE to tell management or animal control or warn someone. Everyone in your building is in danger now, especially people with kids and animals. A child, an elderly person, a dog or cat, could die. These people have no clue and it is your responsibly to warn them even if it threatens your lease, this is someone's life possibly. PLEASE TELL SOMEONE. This thing could be in someone else's apartment right now. ",
            "\"Hey we can use my niece for centipede bait\". Your boyfriend is a moron.",
            ">We live in a very large and very old building, hundreds of residents. At this point we think it likely got into a crack somewhere\n\nOMG are you posting warning posters?",
            "This whole post just made me sick to my stomach. WHY JUST WHY ON ANY OF IT. Also like others have said he better warn the apartment complex this thing is loose. Lawsuits for days if that thing gets in someone's apartment. I can't believe you even agreed to live in the same apartment as that thing. ",
            "My head has been itching since I read this. OP please inform your landlord this is horrifying and potentially a huge legal issue, not to mention ethical one. \n\nSeriously I'd be freaked if I lived in your building. ",
            "Your boyfriend doesn't sound like a stellar decision maker. He is 28 and much too old to be acting like this. Stupidity is a dealbreaker for me and should absolutely be a dealbreaker for everyone else.\n\nYou may love him, but he is a stone cold moron.",
            "Wow. Your boyfriend is an asshole.",
            "Tell the BF to spend an hour or two crawling on the floor naked and see if he can provoke the created to emerge.  No underwear allowed!\nIf you folks were my tenants eviction proceedings would begin today. ",
            "Okay, right now I'm mad at you for telling me to google \"vietnamese centipede\" because I almost had a panic attack. I didn't know there were centipedes that big and now I can never un-know it.\n\nI think you should arrange to meet the family elsewhere instead of having them come to your house. Maybe you could all go to the park or a cafe or something.",
            "I googled it and now that I know what it looks like, I'm terrified and will not be sleeping tonight. Freaking nightmare fuel. \n\nBut anyways for your boyfriend to be extremely flippant about a loose exotic pet that can kill you, is not okay. It's even worse that he'd even think about putting his niece at risk as bait. That's fucked up right there. What kind of person would put someone (anyone) they cared about at risk? Not a very good one, huh?\n\nIf I were you, I'd rethink your relationship with him because his reaction is just really fucked up.\n\nBut on a personal note, my boyfriend got bit several times by a rogue centipede that somehow made it's way inside the house, into his bedroom, and INTO the bed we were sleeping in. Had to take him to the doctor his symptoms were so bad (he's okay now since it's been a few years since this happened). Caught the centipede and sent it straight to hell where it belongs, but those things are awful. ",
            "Umm. You still need to let people fucking know they should be on the look out for this thing. ",
            "The poor people in your building. How do you even sleep knowing that thing could be crawling around under the covers??",
            "How about the other crawling babies and small animals in your apartment complex?? Are you fucking kidding me?!",
            "Thanks for the update, but.... did you alert the people living in your building?",
            "So are you or your bf planning to do anything to protect your neighbors and their children from this thing? ",
            "Are you planning on having kids?  If so, is this the guy you want to have kids with?",
            "Bf is sulking because he wasn't able to put his niece in harms way. At best, he is foolish. \n\nAre you prepared for this to be your life, having to veto his dangerous ideas?",
            "Jesus lady, you nees to call your god damn apartment complex manager and let them know a dangerous and *potentially fatal fucking bug* is loose in the god damn building. What the fuck is the matter with you, lady?!",
            "it was the right thing to warn the family. THEY made the choice to not come over (rightfully so) If he’s mad at you for that, then he’s taking his anger out on the wrong person. Make sure he realizes that. ",
            "There is no way in hell I could fall asleep in your house until that thing is found.",
            "When you find it, pls kill it with fire",
            "I'm glad he's not my brother, because if he wanted to put my baby at risk in order to find his escaped pet, I'd have some choice words for him.\n\nHis reaction is pretty telling, giving you the silent treatment.  Is he always like that?",
            "We have a 9 month old, and she gets into EVERYTHING. If we visited anyone with an escaped venomous insect, and they failed to warn us, it would be grounds for terminating that relationship. Knowingly putting someone else's child in danger because of your own stupidity is unforgivable. Good for you warning them. ",
            "Jesus fucking Christ evacuate the building and burn it to the ground. \n\nBut seriously you need to inform the residents. I'm sure they have babies too. And if I got bit by that thing I'd just go jump in a vat of acid to try to burn my existence from the timeline.",
            "You need to call the family *yourself* and tell the not to come. YOU also need to call the apartment complex people and let them know a venomous animal got out so some doesn’t get bitten and y’all get sued. I feel you’re just as guilty as your boyfriend if you don’t tell people what happened and they get bitten.  ",
            "Did you get it in writing that you were allowed to have this centipede in your apartment? Either way, you need to tell your management company. If someone gets bit, you will 110% be evicted. You will be liable for all their medical costs (I hope you have renters insurance!). Your complex is most likely going to need to spray the entire building to kill this bug and you will be on the hook for that, so again, I hope you have renters insurance. \n\nBasically, the only way you may be able to get out of being evicted **and** be a good person is tell your property manager and mitigate any and all costs they have. \n\nAnd trust me those costs are going to be a hell of a lot cheaper than eviction. ",
            "As someone who lives in an old big building I’m waiting for this idiot to update location. How stupid are these people that they are only concerned about the niece and not about this thing getting out. She said hundreds of people live in her building chances are that includes toddlers. Honestly wtf is wrong with both of these people? ",
            "You live with a person who owns an exotic centipede.  Where did things go so horribly wrong in your life?   \n\n",
            "I just wanted to say this post made me laugh so hard I’m in tears. \nLol tldr: 28M wants to use baby to bait out aggressive biting insect from it’s hiding place LOLOLOLOL",
            "First off, I did in fact google it and it is fucking gross. \n\nYou absolutely did the right thing. ",
            "this is the level of safety he will think is appropriate for when u guys have ur own children...i would reconsider long term relationship plans with this person, especially as he is 28.",
            "I just did a quick search on them and saw they like to burrow. Do you have carpet or crown molding? I could see it snuggling in somewhere like that. You might want to call 911 about this, they’ll send someone your way. My old roommate had to call a few times for her escaped snake and they were always very helpful. I know you said you’ve searched everywhere, but they have the authority to do some deeper digging (take apart vents, walls, etc), especially with a venomous animal. I wish you luck!",
            "Your BF needs to understand that if this centipede bit someone & injured them, or caused someone's death (I can see an old man or sth with weak immune system getting rekt by this), he is going to be responsible for paying out money he doesn't have. \n\nAlert the apartment. If someone's centipede bit me & that got me into a hospital or something, I'm definitely finding a lawyer. ",
            "Would be a shame if a heavy boot were to land on that thing.\n\nSeriously though, if you had a dog that was known to bite people and a toddler would be visiting, you would (should) lock the dog up and know where it and the kid are at every moment. This is not a whole lot different.",
            "Can you please just tell me that you don't live in Illinois so I can stop being worried that there might be one of those things loose in my building?  You are not over reacting.  If my partner let a venomous (aggressive) centipede get out of its tank I would be losing my mind.  Wanting to use a baby as bait to find the centipede without the parent's consent is mind blowingly stupid.  ",
            "He is being fucking ridiculous. This could put his niece into danger. He just needs to get over it. Honestly, if it were me I would have left the house until he found it. ",
            "Your boyfriend is an idiot and you did the right thing. I guess he wouldn't have cared if the child was bit? Complete dumb ass.\n",
            " Lol, has he ever been bitten by a centipede? There's a joke in Hawaii about the traditional cure being to stay drunk for three days. It's that painful.\n\nAt the very least, tell the brother immediately about the loose centipede.  Say it real nicely. Concern troll the fuck out of it.  That way, he can still choose to save his daughter, with the added bonus of knowing what a tool your boyfriend is. ",
            "Uh wtf. If I found out my brother was ok with using my baby essentially as bait for an animal to come out of hiding I'd be fucking livid and my child would never be anywhere near him again.\nHe sounds like a massive self centred ass.",
            "Jesus fucking Christ, is there no boundary to human stupidity?",
            "How am I not allowed to freely smoke weed or take LSD, but these ass hats can just keep poisonous, non indigenous spawns of Satan around?\n",
            "So you guys are going to notify the manager of the apartment building next, right? Seriously. This could become a very unpleasant situation. Take the consequences, and do the right thing.",
            "Your first mistake was getting into a relationship with someone who keeps a giant pet centipede.",
            "You need to tell the parents.  The idea of not telling them is completely abhorrent and shows a huge lack of empathy.",
            "Let your boyfriend be mad. A bite from one of those would most definitely kill that baby. Googled it and a 7 year old died within 29 hours of being bit. He'll get over it. Also...how the hell do you sleep with that thing on the loose?! ",
            "I want an update when/if you find it!!! Also BFs reaction when/if he finally realizes how irresponsible he's being!!!",
            "Look behind the fridge in the coils.",
            "Your boyfriend wants to use his niece as bait.  There aren't words adequate to describe what an absolute piece of shit your boyfriend is.  His reaction says a lot about him.\n\nYou need to speak to your neighbors immediately and warn them that you've lost a venomous animal in the building.  ",
            "Christ. That things mightve gone through a vent into another person's room. That is terrifying.",
            "I'm sorry OP. I can only advise you to stop looking.\n\nWe lost our adult-sized California king for 3 months. Turned the house upside down. Looked in every nook and cranny. Removed fittings of the wall to look behind them etc. \n\nJust randomly showed up one day heading for his tank. ",
            "What state do you live in? Because I need to make sure I'm at least 500 miles away from that thing if it's on the loose. This is r/nosleep territory. ",
            "You're being sensible and safe. He's being ridiculous and overestimating his ability with serious consequences. He really should apologize and own up to his poor behavior.",
            "I think the notion of having ANY animal (with minor exclusions; e.g. well-trained friendly dogs/cats, etc.) around young children is not safe. \n\nYou are not in the wrong by stating your discomfort by this. He may be annoyed because he did genuinely want to see his brother? Could also be because he genuinely thought his plan would work?\n\nI think you should talk to him and reassure him that you will continue to help support him to find his pet. Though, do also explain why you do what you did--after all, safety is quite important.\n\nBest of luck!",
            "Seriously? Like everyone else said he's obviously dumb and thank god you took action. Plus your 100x braver/cooler than me, I would never live with someone who chooses to have one lol",
            "I just looked up the bug on Wiki....there's been reported human deaths via their venom. Um....yeah, you are 100% right ",
            "That’s a serious bug problem. I understand you have love for your pet. But this is no puppy or kitten. I’d be so pissed if my brother knowingly put my daughter in harms way. I’d beat the shit out him. Thank God you took charge of that situation.  Now save yourself. ",
            "> At least an escaped iguana or stick insect couldn't hurt anyone\n\nSpeaking as someone who has been bitten by an iguana, they can too hurt you. However, they are not particularly aggressive and are not likely to come after you looking to cause you pain.",
            "I would just like to point out that iguanas can in fact do some damage, and if you stay with this man it should be n the condition that he will not own -any- pet until he gets his shit together.",
            "Sounds like my place about the repairs, did you find it yet? ",
            "What if it really gotten out through some crack in the walls, got into somebody elses apartment and bit them? I mean, theres nothing to do now, and I dont think raising alarm in the whole building is a way either, but come on, so irresponsible...",
            "* He knows you secretly (or not-so-secretly) don't like the centipede. \n* This secretly (or not-so-secretly) bothers him.\n* He secretly (or not-so-secretly) interpreted your argument against his brother's visit as an implicit judgement of his centipede ownership.\n* He's also interpreted it as you passive-aggressively trying to \"one up\" him on this centipede issue.\n* He was resistant to informing his brother because it would mean you won.\n\nNone of it is based in his rational brain and I'm sure if he thought you thought the centipede was incredibly cool, if he thought you adored it, if you wanted to take care of it with him, etc etc, then he'd have completely agreed with you about this. But I'd bet anything this is based in deeper resentments and implicit (or explicit) prior disagreements about the centipede, so he's not making wise choices.\n\n(also, the fact that he'd get caught up in the above rather than getting immediately freaked out by the centipede's escape is a pretty good indicator that he's a shitty pet owner. If you have a full understanding of the dangers and downsides of your pet and if you're considerate of others, then you swallow your pride and don't let personal feelings get in the way of what's safest and most humane for everyone involved.)",
            "Your boyfriend is an idiot. That’s all the you need to know. ",
            "What does it feel like to be in a relationship with an irresponsible idiot?",
            "I want to say I legit cried when I saw the thing.",
            "Can you get a ton of sticky pads/ mouse traps to put all over the apartment? Against walls, under everything that it'll hide under... I really don't know if this will work, but it's worth a shot. I'd be very concerned with a very small child around, who wouldn't be able to defend herself against it...",
            "You did nothing wrong OP! Thank you for pushing this and taking the safety of a child seriously.",
            "Lmao, use the baby niece as bait to lure it out. What the hell...",
            "I grew up in Hawaii with these suckers as house pests. *Shudders*",
            "Are you sleeping there? No way in hell!",
            "send him to the wiki\n\n>Scolopendra subspinipes has been reported as the apparent cause of a human death. The fatal case was in Philippines in which the centipede bit a seven-year-old girl on her head. She died 29 hours later.\n",
            "At first I read this post to mean the centipede *came with* the apartment. And, like, it was just wriggling around on the floor and he scooped it into a jar",
            "honestly everything about this is my nightmare. ",
            "Why would he keep one as a pet???   Those things are total bastards wild, I couldn't imagine keeping one captive...",
            "Oh god, it's on me, isn't it? \n\nWe can all be a little stupid about our pets, but it's incumbent on owners of dangerous ones to fight that instinct. I feel really bad for the little fucker and everyone else in your building. Glad you had a more productive talk with him and that hopefully things will change! \n",
            "Your boyfriend is a piece of shit. I hope the centipede eats him.",
            "I think someone found your centipede.\nhttps://www.reddit.com/r/tifu/comments/7crpsm/tifu_by_crushing_a_centipede_in_my_ass/",
            "OP WHAT STATE ARE YOU IN YOU'RE KILLING US HERE",
            "Wow... if he gets annoyed from just this, imagine when it's something that's worse.",
            "[I think I found it](https://www.reddit.com/r/tifu/comments/7crpsm/tifu_by_crushing_a_centipede_in_my_ass)",
            "I'm glad he backed down, but be careful if you want kids with him. He seems to have trouble with using logic to keep a child safe.",
            "Just looked up a picture and those things are beyond terrifying.",
            "Iguanas can be very dangerous, just saying. They grow to be very large and have very sharp teeth",
            "Start spraying bug spray. The centipede had left the apartment. Woe to the neighbors.",
            "I googled it. Can’t unsee that one. "
        ]
    },
    {
        "post_id": "1al4nir",
        "author": "None",
        "title": "My bf (27m) seems to think that I (26f) have to care and be sad about his cheating???",
        "url": "https://www.reddit.com/r/relationships/comments/1al4nir/my_bf_27m_seems_to_think_that_i_26f_have_to_care/",
        "score": 2067,
        "num_comments": 286,
        "created_utc": 1707317424.0,
        "selftext": "TLDR: He decided to cheat, but he's the one upset...because I chose not to care much about it. What's that about??\r  \n\r  \nHe told me he cheated and started crying and all. I wasn't surprised as he does something stupid every time we have any disagreements.\r  \n\r  \nHonestly, all I felt was a big relief. I had been thinking about telling my family about him, but I dodged the bullet. It'd have ended up a big embarrassment, but now, they'll never know he even exists.\r  \n\r  \nOf course, it does extinguish any attraction I have towards him and I'd never marry him. But the apology gift is very nice and I don't care enough to ruin that for myself.\r  \n\r  \nBut besides that, I'm launching a new business soon and this is not the time to be emotional, break up, move out, take revenge, etc. My job and this business are going to mean a whole lot more to me in a year, even 5 years, than any of this nonsense. To me, being at peace and getting along well at home is more important right now. So I've been cool, gracious, and focused on work.\r  \n\r  \nHowever, he keeps constantly disturbing me during the day asking why I don't care. If I'm not jealous of him, how sad he is, etc. He keeps taking jabs at me too, which does actually irritate me. I feel like he wants me to feel as low as he does. But I don't get it. If you make a mistake, why would someone letting you off easy be a problem??",
        "permalink": "/r/relationships/comments/1al4nir/my_bf_27m_seems_to_think_that_i_26f_have_to_care/",
        "comments": [
            "Sounds like he almost wanted the validation of feeling important in the way of getting an extreme reaction from you, and showing how much you cared even if you broke up with him immediately.\n\nNot really sure why you'd bother staying with him though. He's a cheater, he's self-pitying, and he sounds rather desperate. Sounds like more hassle than it's worth.",
            "I had that reaction to being cheated on too!  It was like waking up from a dream and not remembering it.  My brain instantly switches to just feeling like he was a stranger.  Oh well, f him.",
            "Because he knows if you still loved him and saw a future with him, you’d be devastated. Your apathy indicates you no longer care about him and are (I hope) just getting your ducks in a row before you leave him. He doesn’t want that so he wants the “devastated” response of a loving dedicated partner.",
            "He thought if you got angry with him, that “punishment” would alleviate the guilt he feels for being a bad person.  He also thought he was super important to you and you could never live without him.  Hah!  Sounds like he’ll have to shoulder his own guilt AND burst his own ego bubble.  Gee whiz.",
            "He cheated, now you know something about him that was important to know. \n\nHe did not value you enough to keep it zipped but he is NOW upset that you, as it turns out, do actually value him that much either.\n\nHe is the punchline in his own joke.",
            "Meh. There's actually a thing in Indonesia called Kasepekang, meaning that the shameful consequence of breaking the law is that the entire village shuns you. They just give you the cold shoulder for the rest of your existence in town. \n\nThis is his Kasepekang. Totally deserved. \n\nThe only reservation I have is how this might affect you down the line. Sure, now he's being a dog with the tail between his legs, but I feel the jabs are going to get more intense...or perhaps he will start bringing dates around which is hard to ignore when you are focusing on something important for yourself.\n\nJust make sure to establish the boundaries if it gets that far. But heck, if you get your business rolling, you could probably move to a whole new house without that man.\n\n-applause-",
            "I know you are extremely busy right now, but I recommend you move out. He's only going to keep bugging you.",
            "Idk why I've encountered a lot of relationships like this too its fucking annoying. There has been a lot of exes that do or say insane shit to get a reaction out of me even though I'm rather straight fwd person but still like fun and good times I just never enjoyed dramatic antics and that's exactly what they try to evoke from me\n\nDo these guys just really like drama?? Girl run for the hills. I guarantee you once they find someone else they'll act all normal and not put someone else through that similar bullshit when you don't deserve to be put through that hell no",
            "Seems like a pathetic person. He can tell you don't respect him and it makes him insecure.",
            "It shows him you don't care anymore and will take the next possible opportunity to break up, when your life isn't so hectic. You say he does stupid shit constantly when you argue, so, mentally, it looks like you've already detached yourself from him in instalments over a longer period of time. He isn't there yet. He very much still wants to keep you around, since you have been so good for him. That's why he's upset because you're not. He also probably can't see you just being friends as readily as you are now, because he simply isn't there yet. This is going to be highly annoying for you if you stick around to watch him go through the motions of grief. I also, personally, suspect you might be suppressing some of your own emotions because you are so focused on your business. It might hit you later. Be gentle with yourself. Also, I see you have a lot of compassion for him, but please don't forget that he is an adult who should be capable of managing arguments better OR find a professional to help him learn it.",
            "Some people want a big angry reaction so they can feel like they've been \"punished\" and don't need to feel guilty anymore.",
            "Is this person still your boyfriend? Why don't you block him? No need to let him keep disturbing you.",
            "I think folks have answered your question - he's doing this because he wants to see a reaction from you or else he feels like you don't care, aren't invested in the relationship etc. Instead you're acting like he accidentally stepped on the back of your shoe while walking. \n\nJust keep ignoring his pestering. Tell him that you process things in your own way and at your own time, and he needs to worry more about what his behavior says about his own character than about how you react to him.",
            "Ice cold. Keep your eyes on the prize. \n\nHe knows he fucked up, he knows the other shoe is dropping and the anxiety is killing him. As much as you don’t want to deal with it, I’d recommend at least being like “we’re done, don’t think we’re not, but I don’t want to deal with your bullshit right now. So leave me alone.” Or just quietly extract yourself and block on everything. Whether you like it or not, you’ll eventually have to deal with it because you live in close proximity. It will eventually be forced.",
            "sounds like you are over him.",
            "You said you two had a disagreement. Maybe he cheated as a way to \"get back at you\" and he thought it would destroy you or something. He thought you would cry and be all upset but the fact that you are not, his plan didn't work and now he knows where he stands with you. Just tell him if he is not happy he can leave and focus on your business as usual.\n\nHe cheated and he's upset? The nerve.",
            "NTA... \n\nTell him something like this.\n\n\"Why would I be upset. I am proud of who I am. I am secure with who I am. You are the one who belittled yourself and made a fool of yourself. Why would that upset me? I never truly expected any better of you anyway.\"",
            "He wants the validation that you really love/care about him despite his infidelity. The fact that you don't speaks volumes about how you must view the relationship or his value as a whole. \n\nIf you're not going to marry the guy just kick him out and move on whether or not you're starting a new business. Why keep that around?",
            "Get him out of your living space. You're doing great things for yourself and you don't need that bad energy around",
            "He is a deeply unwell person who tried to hurt you on purpose to get attention. Now he’s pouting about how you didn’t give him the attention he wanted. He doesn’t actually feel bad about cheating, it was just an act to get you on the hook to care about his little stunt, and he’s upset because you didn’t take the bait. I’d guess that some personality disorder is involved in this.",
            "Be careful that he doesn't sabotage your new business in an attempt to get your attention / force you to keep living with him / etc.",
            "lol what gift did he give you?",
            "You hurt his ego... it's more important than him betraying you (for the last time) and your hurt feelings. Lol.  Bye bye",
            "If you're expecting these jabs and disturbances to just go away on their own, while you (try to) ignore them-- breaking news, they won't. Your immature man is going to become resentful and find other ways to \"get back\" at you for not reacting like he wanted. Better come up with a solution quick!",
            "OP, IMHO the correct answer is:\n\n*I don't care because we're not together anymore. kthxbye.*",
            "Unbothered, moisturised, flourishing \n\nYou’re a legend",
            "Shake off the baggage before he feels entitled toyour money.",
            "welcome to dating a narcissist.",
            "I'm worried that staying with him could be dangerous for you. Your lack of a reaction tells him that the jig is up, that something here is broken. Who knows what he might do. If he's the vindictive type, he could sabotage your business or harm you. Please be careful!",
            "He knows he means nothing to you now. He expected you to be the gf devastated by his betrayal. Since you don’t give a shit, he’s devastated that he now realizes that you don’t care.\nSo you’re staying together while you build your business? It’s gonna crush him when he finds out you just couldn’t be bothered to break up with him while working, and when you’re on top with a well functioning business he’ll probably try to propose. \nHe fucked up, so whatever happens he did to himself, but that is sure gonna sting for him. At least he’ll be dating while you’re together so maybe he won’t be totally devastated when you make good and leave.",
            "Just tell him what he did killed your love and now you're just an indifferent roommate. Then tell him to stop bothering you, if he doesn't, go in the bedroom and lock the door.",
            "**I wasn't surprised as he does something stupid every time we have any disagreements**\n\nAnd why are you still with him?\n\n**apology gift is very nice and I don't care enough to ruin that for myself.**\n\nAhh... OK. You know you can just find a guy/person who will be nice to you without making mistakes right?\n\nYou can even get this stuff and more from guys who won't even want a romantic/sexual relationship with you if this is what matters to you.\n\n**To me, being at peace and getting along well at home is more important right now.**\n\nSounds like losing an idiot that does stupid things a lot will give you a lot more peace than keeping him around though 🤷‍♀️\n\nFeels like you're just giving him and yourself excuses to stay with him... and I think you know why just haven't admitted it to yourself.",
            "You need to limit his access to you. He is toxic.",
            "There's a thin line between love and hate. If your love isn't enough, probably due to their own insecurity or ego, then they aim for the tears.\n\nWhen they dont think they can be the best you've ever had, many aim to be the worst. The one who broke you and made you think you'll never love again.\n\nIt's perfect timing that you are moving on to a new stage in life. That's the perfect time to try and hurt you.\n\nI applaud for giving him nothing. \nExactly what he deserves.\n\nMore people should heed your example.",
            "This dynamic feels mad unhealthy. He cheats. You don’t care. Why even be together ?",
            "Go no contact. Who needs that drama?",
            "You dodged a big bullet. Block him and continue to prosper. The dude sounds like a narcissist and a loser. \n\nLike one can forgive a person and not care at all what you do from then on out. You chose the route of not being bothered by his bs.",
            "He ain’t the victim! He’s trying get to play manipulation",
            "In a lot of comments, you are saying that you don't see the point of breaking up right now, but the reality is that you ~already have~ broken up with him in your mind, you just haven't told him that yet. You are no longer attracted to him, and you see no future together --the only reason you want to stay together is because you don't feel the need to kick him out and living together is convenient.\n\n\nSo be honest and tell him that. You no longer consider him your boyfriend, but he is welcome to remain your roommate if he wants to.",
            "Squeeze as many apology gifts as you can out of him, and then kick him on the butt and leave..",
            "Lol, he's mad because you're controlling the story now, GOOD FOR YOU! So you're using him now for your future and then plan to dump him?",
            "Buddy has big time attachment issues. Pushing you away in an extreme way and then crying and clinging. Woof. Block him if he annoys you. The only thing that will help him is a lot of time and a lot of therapy.\n\nETA: oh wait you live together?! And you’re staying?! \n\nHe is pestering you about it because he wants you to leave and you are not going along with his plan.",
            "Honestly as long as you completely transition this relationship into a roommate situation (ie no more sex and romance), I don’t see anything wrong with it. I would just be honest with yourself for your own sake and mental health to make sure you aren’t putting up a front and refusing to feel emotions. It’s healthy to grieve things lost that were important to us, but I do understand if a 2 year relationship is small fry compared to other things you’ve had to grieve. Hope you’re on to bigger and better soon.",
            "Speaking from experience. He's a cheater, so he is shit. He will find a way to disturb you and make your life miserable, more than it already must feel after being inflicted such amount of pain. I believe you will regret staying any longer and that will only lead to more difficulties to leave in a future without much drama. My advice is: leave now, asap. You will be thankful later.",
            "omg I love this LMFAO. Aspire to reach this level of unbothered",
            "You don't have to be dramatic or chaotic to respect yourself. You don't mention if he is your ex, and you say that he is still your \"friend\". Why? Do you not realize that living in this situation is actually more likely to mess up your future? He doesn't care about you, and I'm sure you're feeling like a bamf for your reaction, but it's actually a little concerning and sad. He's going to be on your case, the jabs are going to get worse. He doesn't care about you or respect you. Why continue living with someone who is literally using your existence to fuel their narcissism? ",
            "Block this dude and walk away!",
            "I’m confused- are you still with him? And if so, why? I think he’s probably upset because he did this in part to hurt you/get a reaction, and it’s clearly not working. No reason could justify the cheating, though, so his feelings about your reaction aren’t important.",
            "Wait. Am I missing something? Your haven't told your family about him yet? After two years?",
            "OP, you sound like a very emotionally adjusted person. Best of luck with your business, you seem like the type of person that will be successful. I'd strongly recommend moving out, especially if you have somewhere that you could stay/build your business from.",
            "You seem very well adjusted and in control of your emotions. Bravo.\n\nThat said, give yourself time and permission at some point to break down and really feel this, else it will sneak up on you later and knock you on your ass when you're not expecting it.\n\nGood luck.",
            "He feels hurt because he is just now realising that you aren't really emotionally bonded to him. If you had been deeply emotionally bonded to him, then his betrayal would have caused you a lot more pain (Edit--at least that is the typical reaction that most people would have, so that's how most people would interpret it). The fact that you were able to emotionally disconnect from him so easily and without much pain is an indication of how weakly you were emotionally bonded to him in the first place (again--that is how most people will see it, because that is typically how people function). Based on his cheating behavior, it sounds like he wasn't the sort of person someone would ~want~ to be emotionally bonded to anyway, so that's not a dig on you...but it explains why he's upset by your reaction. Essentially: his ego is bruised because he thinks your reaction means you must have never really loved him much.",
            "yeesh thank goodness hes gone",
            "Sounds like u done wome stuff behind the scenes also",
            "Leave him asap as he will only weigh you down as you start your entrepreneur journey.",
            "I'm not sure how accurate this is, but I have this feeling like he might become a problem. He might get angry that you're not reacting to the point that he does something to your actual love:  your business. He's watching you give no shits about him and what he's done while you devote yourself entirely to your business. For him, your business might be like your mistress. Just a thought. I'd think it might be safer for you and your future to wrap shit up with him now.",
            "You not reacting shows him that you don't care. Not saying he doesn't deserve it (I don't know either of you), but that is probably also why he cheated, and confessed: because he wanted a reaction from you.",
            "I'm quoting another redditor, who said this on a different post: \n\n\"I think that if she cries and begs, it means *he's* still desirable. Instead, she's simply stopped caring about him, meaning he has no actual worth.\"",
            "But you haven't let him off easy. You might not have balled him out, but in your heart you've killed him off - he's dead to you. You're not jealous, because you don't care about him anymore. That's what he fears, and that's why he wants your reaction.",
            "OP, I love you! Focus on your goals. You are exactly on the right path! If he keeps disturbing you, throw him out. You are awesome! I need to know how to compartmentalise. 💪👏👏👏",
            "Why are you with him? \n\nHe's a cheater which is issue #1, but frankly, you don't give the impression that there's lots of love from your side either. Break up already.",
            "This is kind of psychotic. He’s upset that you’re essentially gaslighting him now - you’re not upset because you’re just gonna break up with him when it’s more convenient, so he can tell something is wrong. Staying with someone you don’t see a future with is user behaviour, and fundamentally dishonest imo.",
            "If you don't care, then you will not get emotional when you break-up. Just move on and don't look back.",
            "Lol, nice. I'm glad you feel nothing, and that's about what he deserves as well. Kinda pathetic that he wanted more than that, given that he's the one who fucked up? Like you're supposed to validate how valuable he is by caring. Do what makes most sense for you, protect your assets, and if he exits earlier, then that might be the smartest move he's made so far.",
            "You're a stone cold villain, ngl. But I admire your focus and work ethic, honestly. Personally, I'd break up with him and go full grey-rock as roommates (he ain't your problem anymore!). But if you're in a 1br, that may not be tenable. \n\nOverall, be cordial, but then yeah. Wait it out. Move on later.",
            "I would probably laugh in his face - what a manipulative moron",
            "I'm sorry but I couldn't not read this and laugh the whole time LOL this is ridiculous. Just break up with him.",
            "yo this is weird. he's fucked...but so are you. cmon...\"too busy\" to handle a break up?  its a break up. once its over, its over.",
            "I'm confused. You say you're letting him off easy, but earlier you talk like you're leaving him? Which is it?",
            "Why even put off breaking up though?",
            "You need to break up and move out. It's weird to stay with him when you've clearly broken up with him emotionally. When you decide to stay in a relationship, people naturally think you want to actually make the relationship work. It sounds like you're staying just to split the bills and not stress about finding a new place while you get your new business up. \n\nHe was wrong for cheating but you'd be wrong now for stringing him along to use him for your convenience.",
            "He did you wrong but the fact that you don’t care at all seems to mean the relationship was over before he even cheated. Just breakup and you two can set a timeline on when you won’t live together.",
            "You don't seem to actually care that he cheated, you don't seem to actually care about him nor do you see a future with him, so how exactly would breaking up mess things up for you right now? It really seems like you'd be just as unaffected with or without him in your life anyway. Doing neither of you any favors staying together. Sounds like he was seeking validation in a fucked way, and honestly breaking up with him will just save you headache from his BS down the road. You also don't sound ready for a relationship, and probably need more therapy. Not reacting to every day nuisances and trouble is great progress! Not reacting to *being betrayed by someone that supposedly loves you* isn't healthy, it's something you need to address.",
            "Why are you surprised that your bf is wondering what's going on?",
            "Er, you don't need to \"take revenge\"...just break up. His behavior is toxic and gross, but your reaction of just \"well it's not convenient to break up with him even though this relationship is dead to me\" is also not healthy...\n\nYou're delusional if you think staying with this guy is somehow the peaceful move for you.",
            "This is evidence of a social disorder; your reaction to him hurting you is what he wants, wants to know he has some pull; this a lil boy not a man",
            "> If you make a mistake, why would someone letting you off easy be a problem??\n\nBecause it's clear to him that you're checked out of the relationship and so he's confused why you haven't broken up with him. He cheated on you which is obviously messed up, BUT I feel like it's also kinda messed up that you're planning on stringing him along for the sake of your professional career.\n\ntbh, it kinda sounds like you were already planning on stringing him along even before he cheated and now you're like \"whew, now i don't even have to feel guilty about it!\"\n\nIdk, that sounds pretty immature and petty to me. You are clearly checked out of this relationship, do both you and him a favor and end it officially and get the hell out of there",
            "At least he was honest but I wouldn’t stick around feeling sorry for him. He probably needs therapy",
            "Honestly, this is badass. Wishing you success with your new business!",
            "Wait a sec- you moved in with someone that you didn't even deem worthy of telling your family about?",
            "But you did break up, didn’t you?",
            "I think you are very smart to not give him the reaction he's looking for, and it sounds like from your perspective you have checked out of the relationship and downgraded him to roommate status instead of partner status. It sounds like eventually you plan to make him a former roommate as well. These are all good things and I am happy for you that you have such a good head on your shoulders!\n\nHowever, the main issue now I think is that he is not AWARE that his status in your relationship has changed. He is still thinking you are partners, and doesn't seem to realize that what he did was absolutely a dealbreaker. He doesn't understand that you've checked out of the relationship and made peace with that, or that you will eventually end the relationship when timing suits you. \n\nDo you get the feeling/expect that breaking up with him and staying roommates until you can deal with housing logistics will cause him to treat you badly, make your life harder, and/or make the living situation super tense? \n\nIf so, I kind of understand why you wouldn't tell him you're done right away - but I still think not informing him that you're done with him is misguided. \n\nIt is highly likely he will see through you pretending to still be with him (while not acting upset anymore about him cheating) and realize it anyway. If drama is going to happen due to breaking up, it will happen no matter what, and I promise it won't happen on your timetable. \n\nUnless there is a danger of violence or him purposely making your life hell as a roommate, it really is best to confront this head on and tell him the relationship is over. Otherwise, you are going to have to not only deal with his constant checking in on you for a reaction, but also likely have to appease him with affection and love in order to keep him from questioning you over and over about where your relationship stands. That's not healthy for either of you, at all. \n\n**TL;DR: Don't pretend to be in a relationship with him still to avoid logistics and drama. That is unhealthy and will make things worse for both of you (but mainly you) when he realizes you've checked out of the relationship for good.**\n\n**Confront the situation ASAP (as long as it's safe to do so) and sleep in separate rooms/him on the couch until the logistics of moving and separating finances and such can be worked out.**",
            "You need to just break up. I guess I don't see how it's going to get less annoying dealing with someone who is so needy who doesn't respect you anyway.",
            "IMO you are good at compartmentalising.",
            "A fool and his honey are soon parted !",
            "You aren’t really in a relationship with this guy anymore he’s just your roommate",
            "Why can't you break-up clean & fast? If you're already mostly emotionally clean, are you using him for stability? Doesn't sound like he's too stable. \n\nAnd if the business fails? Most do. If you simply believe yours will succeed, good for you! But beyond the business question is if it does fail, are you stuck?",
            "There's a saying: the opposite of love isn't hate, it's indifference. Your indifference wounds him more than your anger and hatred ever could. The fact that his betrayal doesn't mean anything to you is probably shattering to his fragile ego.",
            "\"Because you're not worth my mental health\" And he's in victim mode 🤣",
            "This was clearly a cry for help. What he did was wrong, but you sound just straight inhumane. Let the man go.",
            "Seems like pot - kettle situation\nYou sound cold and if you really did love him your reaction wouldn't be ah I have more important things then this bs.",
            "He's upset because you're clearly using him. I understand your relief that he cheated because now he's done something \"unforgivable\" he \"shouldn't complain\". From the sounds of your dynamic, he probably cheated on you to get your attention.\n\nNow you want him to just stay quiet while you continue to use him until such a time as you decide to dump him. He also knows that's the deal, and he's not okay with it.",
            "Why stay with him if all attraction is extinguished? He does things like this every time you fight? Hell, why not just block him, especialyl during your work shift. He doesn't respect you you don't seem like you respect him and there doesn't seem to be any concern for any one elses feeling at any place in this relationship. I am confused. \n\nHell, tell him you want an open relationship that way you don't have to break up or move and you can see other people and not GAF",
            "Why do you think you should take revenge? Just move out and get on with your life.\n\nSounds like he's just upset that you don't care enough to beg him to stay.",
            "He sounds like suchhhh a loser omg thank god !!!",
            "He admitted to it. You def dodged a bullet.",
            "You're as bad as him.",
            "\"I'm not mad because you don't matter. So what you cheated, you're nothing to me.\"",
            "Because if you cheated on him he would be out of his mind furious, and he can't understand why you're not.",
            "\"You aren't important enough to be bothered by. If I thought you mattered or we had a future I would be sad of course but I never thought that so why would it upset me?\"",
            "How’d you respond when he told you?",
            "I say this as someone who was in a tangential situation (let ex live with me for a year because of rent + he'd go get coffee, groceries, etc.) -- it might be healthier to find a roommate rather than subject yourself to a dynamic that's contributing to PTSD/etc. He's still on your mind and heart if you're analyzing and asking about his behavior. This seems like an unhealthy and concerning tangle to be caught in and I can guarantee it is having ramifications on yourself that may not be apparent yet, I wish you well ❤️‍🩹",
            "\"I wasn't surprised as he always doesn't something stupid.\" There's the issue probably. You resent him for being such an idiot and a loser and he feels emasculated and unloved. And you're both right/wrong. But none of that matters anymore cause the relationship is over",
            "How have you met his family and live together and he never met your family?",
            "Honestly, you should just break up and cut all contact with that waste of  space. You seem to have a great life, you seem like a down to earth person, you deserve someone who respects you. \n\nAnd btw, cheating is not a mistake.",
            "because he did it to ruin your come-up 😅 his goal was to ruin your focus on work and that didn't work out for him lol",
            "He's pissed because of this: traditionally, when the guy gets caught he expects that either you break up and one of you gtfo, either there's some hot sex and some type of effort to salvage the thing.\nBut what he sees is this: you don't care, he's probably wondering if this is going anywhere long term, when you already know it won't. You aren't moving out and he doesn't feel like leaving if he's not forced to because he's weak. From his standpoint, he had a lovely time cheating on you, but he also enjoyed the way you took care of him. And how there's neither of that. He's been room-mate zoned and is contemplating building the next 5 years of his life with someone who might jump dump him and move on when she's done building her business. That's why he's pissed. If he had some balls, he would have left already. You should take the high ground because he's weak, and break up, then you can decide if you're ready to see each other's tinder dates rotating through the doors.",
            "He’s upset because you clearly don’t give a fuck about him anymore. I admire how strong you can be to decide that when someone wrongs you in a huge way. That’s really admirable. He wants you to care because it’s feedback you love and care for him. Of course relationships can get through so much worse and they do every day, but if you don’t want to, pick your time and leave him.",
            "Cheaters cheat when they don't love someone\nI used to cheat on my partners. \nI changed my life around and now am stable\nCouldn't dream.or think of anyone else but him.\nMove on. Don't know why you waste time",
            "I would never really side with a cheater, because no matter the circumstance, it’s never OKAY TO CHEAT.  I’ve never cheated.  And I’ve been pretty miserable in relationships.  So it’s never cool.\n\nBut if your reaction to cheating is minimal, and you can see that even that bothers your SO, it does make me wonder how void of affection and emotion your relationship must have been.\n\nI somehow have serious doubt about the denial of the impact of that betrayal.  You’re like IM GONNA STAY CUZ I NEED TO FOCUS ON MY BUSINESS\n\nSounds sus",
            "What his subconscious is telling him is that his cheating doesn't register on you. He can't face that he's not the center of your universe, not yet, so his unconscious mind is the only part that is facing reality. \n\n\nI know you said no breakups, but this is only going to escalate. You've seen crying and pouty. You don't want to see angry and violent. That's next. \n\n\nFollowed by apologies and jail time. I'm thinking impulse control is not his strong suit. ",
            "Block him and actually stop caring.",
            "I teach kickboxing, and one of my first lessons is that \n\n\"Fighting is very emotional. The other person usually wants you to match their emotional level, and if that means punching you, then so be it. \n\nIf you are aware of this and can control your emotions, you will have a huge advantage over your emotional opponent.\n\nHaving less emotions means having a clearer head and rationalization come easier, which helps in a fight\"\n\nDon't let him drag you to his emotional level, and be aware, that it frustrates people when they can't make you emotional, which makes them even more emotional.  (I.e: Expect More \"Mistakes\")",
            "Sounds like he expected you to be hurt and the fact you weren’t indicates you never cared that much for him in the first place",
            "The details of your relationship are very confusing. Your family has no idea he exists and you don’t see a future with him but you already live with him?\nI’m not sure why you would bother sticking around, even if you’re busy and now isn’t a convenient time.",
            "God damn, you are cold as ICE! Good luck with all the milestones and congrats on the business. I wish I could be as driven/stalwart as you",
            "Nah you should make time and move out. You’re not going to get peace in that house anymore.",
            "Some people are desperate for reactions and attention especially if you are a nonchalant person.",
            "Your lying to him is no better. You may justify it by saying it's his karma for cheating but rest assured - the karma wheel won't be sparing you a visit either. Just curious, does this mean that when he wants sex, you will you pretend that you like it? Tell him you are in love with him when in fact you only tolerate him for your own selfish end? \nHe probably did this because he already felt insignificant in your tightly-closed, self-centered little world. \nYou're a sneaky, dishonest, and manipulative person and I doubt your 5 year plan will be anything like you expected - because, karma. You got what you deserved. \nYou are two peas in a pod who deserve each other.\nI hope your cold heart finds warmth some day, I really do.",
            "I think he wanted some drama. It sounds like you are a pretty chill person, and sometimes people who are emotionally needy want big demonstrations of love, even if that's from sadness, rage or whatever. It's likely he did the bad thing to elicit the big feelings. Which isn't smart, but for some people it works (and they get to sleep around).\n\nIt's not that you don't care, you do, but he was a middling boyfriend who made an unacceptable choice. Therefore he is no longer a boyfriend and not worthy of your energy. Good for you for keeping claim on your energy.",
            "Your views on things are refreshing, especially with all the negativity and crap you see on Reddit and everywhere. \nThank you for being you, and I wish you nothing but the best in your life and your new business.",
            "Some guys use cheating as a way to \"humble\" you...mess with your self esteem. I'm not sure if this was his goal but you're handling it very well. Continue doing what you're doing.",
            "I am wildly impressed by your emotional maturity here",
            "What would it mean for you to communicate to him how disgusted you feel about his behavior? And what is keeping you involved with him even now? What are you looking for? Sounds like he is a bit bothered about you not giving him attention which is funny because he fucked up",
            "lol I don't think Reddit knows how to deal with someone who just doesn't care about their partner cheating",
            "People who test you are the worst. And it sounds like that’s what he’s doing. He wants you to be jealous cause it makes him feel special. But that’s sadistic.",
            "It's because, the relationship is basically over, so there are unresolved underlying issues. \n\nYou're not letting him off easy, you're just delaying it, and he can probably sense this.",
            "No you care. You no longer find him attractive so you are affected. Sounds like you're keeping him around since you need him for the time being. You're just suppressing. \n\n\nBreak up with the guy or seek couples counseling. What you're doing is bordering on abuse.",
            "Narcissists. They create drama for attention. Cheat to test you.",
            "OP is giving off weird vibes"
        ]
    },
    {
        "post_id": "3ouoii",
        "author": "throwawaydidntdoit",
        "title": "[UPDATE!] My [23F] boyfriend [25M] of 3 years says he knows I cheated on him while doing study abroad... but I didn't",
        "url": "https://www.reddit.com/r/relationships/comments/3ouoii/update_my_23f_boyfriend_25m_of_3_years_says_he/",
        "score": 2071,
        "num_comments": 321,
        "created_utc": 1444913894.0,
        "selftext": "[Original Post](https://www.reddit.com/r/relationships/comments/3oqvlt/my_23f_boyfriend_25m_of_3_years_says_he_knows_i/)\n\nOkay, so I want to thank everyone for all of the advice. I really appreciate it that so many people cared to give their ideas. A lot of people thought cheating, but some suggested he was just insecure.\n\nLast night I asked him to come over. I should have mentioned in OP that the original event actually happened in mid August. When it FIRST happened after enough I said \"Listen, you're pissing me off, stop saying that I did something I didn't do\" and he just said \"Okay, sorry\". But then proceeded to occasionally bring it up since August until now. Also we are long distance, kind of. He goes to school in another state, but is from my home town. He's been here the past few days due to family issues.\n\nSo when he was over I asked him why he feels so strongly I cheated, and at first he tried to brush it off. I kept pressing him and finally he said \"I just don't feel like you could go somewhere like that with a bunch of guys and nothing would happen\". I told him \"Well, you go to Florida for most of the year for school with a bunch of girls. So are you saying that you don't think I could do it because you've done something?\"\n\nWell, he flew off the handle and FREAKED out. Started yelling that he was so pissed I'd even think to accuse him of cheating. That he never had and never will. That I KNEW about any time a girl came on to him too strong because he'd tell me about it (which is true). I just sat there and watched him and then finally asked \"Well how is it ridiculous for me to ask you that, but you think it's ridiculous that I even argue that I never cheated?\" He just said that \"He knows me\" and \"He knows what I'd do\".\n\nFinally I just got pissed and said that if he can't trust me and thinks so lowly of me we probably shouldn't be together. He started going off then saying \"See!!! I knew you cheated!!\" I got fed up with the crazy and told him to go. He asked if I was breaking up with him, and I said no. I said no because I figured if I said yes he wouldn't leave, but I felt pretty sure that's what I wanted to do.\n\nAfter he left, called up his brother who I am sometimes close to and told him the story. He was surprised by how crazy he was but also told me that my boyfriend's last girlfriend (his first) had cheated on him, so he probably just thinks that of everyone now. He told me that my boyfriend has some massive anger issues and has been known to get physical with people/objects when angry. He also told me about a bunch of other crazy things my boyfriend has done... including \"running away\" from home as a 20 year old when he didn't get his way, cussing out his mom and telling her to die when she took his brother's side over a petty argument.. etc. Some other minor things were that my boyfriend has apparently stated he \"never wants to move out of his parents\" house and continue making youtube videos for the rest of his life.\n\nThat and how stupid my boyfriend acted to me over me doing literally nothing made me decide I wanted to end it. I called up my boyfriend and told him it's over. I'm pretty sad about it, I do love him, but I don't wanna deal with crazy dick. Plus it's pretty lame we've been together three years and he still thinks he wants to live with his parents forever. I've asked him a million times what he wants to do when he's out of college. He just says \"I don't know\"\n\n\n\n   \n**tl;dr**: Accused me more and more of the same thing. He didn't cheat, probably, but is crazy as hell, so we broke up.\n\n**Edit:** Thank you everyone for the comments!!! Wow. I'm trying to reply to most but I AM reading everything!!\n\nPeople are asking how I never noticed these red flags earlier. I KIND OF did, but wasn't sure. We were long distance, which I think often left me confused. A lot of times I'd wonder if his actions were just because we were far. Hearing his brother say those things just confirmed that's not the case.\n\nAlso a lot of you were upset I called his ex \"crazy\" and referenced her Cocaine use as an example. I actually knew her personally, she was a pathological liar as well as being actually clinically insane, and did a LOT OF Cocaine, and was like.. 15 or 16 at the time. Throwing the word crazy around was rude of me, and of course Cocaine use doesn't mean crazy. I'm a bit jaded when it comes to her because she used to be my friend but has done some pretty messed up stuff. So sorry if I came off as insensitive and for tossing those words around like that.",
        "permalink": "/r/relationships/comments/3ouoii/update_my_23f_boyfriend_25m_of_3_years_says_he/",
        "comments": [
            "Between thinking that he knows \"what you're like\" because of how his ex treated him and the fact that he has no female friends, I have to imagine this guy has a hard time seeing women as distinct, individual human beings. Unless something opens his eyes, he'll probably go through a series of increasingly shorter relationships from here, accumulating an ever-lengthening portfolio of exes he \"knows\" cheated on him, all of whom serve as evidence that his current partner is also cheating.",
            ">he was so pissed I'd even think to accuse him of cheating.\n\nOh, that's rich. I guess he doesn't like it when the shoe is on the other foot. \n\n>He just said that \"He knows me\" and \"He knows what I'd do\".\n\nUmm, obviously not. Plus, I just hate that attitude of judge, jury, and executioner. He sounds a little unhinged. \n\n>I've asked him a million times what he wants to do when he's out of college. He just says \"I don't know\"\n\nThat probably means he's not making plans for after college, and he really will be living at his parents' house making videos. The more time passes and the more you grow, you will come to see that you dodged a bullet here.  I'm sorry you're hurting right now, but you made the right decision. ",
            "Good riddance. This is way too much for any one person to handle.",
            "> I told him \"Well, you go to Florida for most of the year for school with a bunch of girls. So are you saying that you don't think I could do it because you've done something?\" Well, he flew off the handle and FREAKED out. \n\nMethinks the gentleman doth protest too much. And project too much.\n\nYou're best shot of him. Good for you for handling things like an adult! ",
            "Ran away when he was 20? Flew off the handle when you turned the tables? Wants to live with his parents forever? He sounds like a precious little flower that needs to sort himself out before committing to a relationship. You did the right thing.",
            "\"He just says 'I don't know.'\"\n\nBut I thought this asshole knew everything...? He can apparently see into a different hemisphere. How come he can't see out of his parents' basement?",
            "A lesson to us girls.....never let crazy stick his dick in you.\n\n\nFor real though, good job at approaching this with clarity & maturity.  It sucks that this is how it ended, but it could have been worse (like learning of his violent tendencies second hand instead of in person)",
            "So he was crazy. And paranoid. It's kind of weird that you've been with him for years and this seemingly came out of nowhere but you made the right decision. ",
            "> Well, he flew off the handle and FREAKED out. Started yelling that he was so pissed I'd even think to accuse him of cheating. That he never had and never will.\n\n100% guarantee he has cheated.  His reaction makes no fucking sense otherwise.  Accuse you with no evidence, then go nuts when you turn it on him? WTF?\n\nYour boyfriend sounds like a horrible, horrible person.  Honestly you are so right to end it.  Bet he does some crazy shit now.",
            "> I told him \"Well, you go to Florida for most of the year for school with a bunch of girls. So are you saying that you don't think I could do it because you've done something?\" Well, he flew off the handle and FREAKED out.\n\nSooooooo he cheated? Because either he really did cheat or he has severe cognitive dissonance about baseless accusations. Either way, good riddance.",
            "Fuck that shit man, good on you ",
            "Holy shit. This reminds me of my psycho ex. He cheated on me and came up with the shittiest cover story ever for it. I later found out he cheated on his ex TWELVE TIMES. WITH HOOKERS. Near the end of our relationship he was constantly accusing me of cheating, acting super fucking suspicious, and going off the handle about innocuous things. \n\nLater I learned it was to cover up his own guilty conscience. \n\nI'm glad you broke up, don't waste your time on psychotic abusers with anger issues. ",
            "Good for you. I had a boyfriend who accused me constantly of cheating while I was at college. I got so depressed about the whole thing, I was having suicidal thoughts. It doesn't matter if you love someone, you just can't be with someone who tears you down and is unwilling to trust you. ",
            "You did the right thing. ",
            "> Plus it's pretty lame we've been together three years and he still thinks he wants to live with his parents forever. I've asked him a million times what he wants to do when he's out of college. He just says \"I don't know\"\n\nthis alone would make me break up with someone, especially in their mid 20s. figure your shit out, i have a life to live and move on with",
            ">He just said that \"He knows me\" and \"He knows what I'd do\".\n\nThis alone is enough to get pissed and break up with him.  \n\nConsidering the other info his brother gave you, the best option is to break up and hope that this guy gets his shit together, which is not your problem or obligation to help him. \n\nGood luck with your future.",
            "So...how about a link to those youtube videos?",
            ">Well, he flew off the handle and FREAKED out. Started yelling that he was so pissed I'd even think to accuse him of cheating. \n\nMe thinks thou doth protest too much  ;)",
            "> I don't wanna deal with crazy dick. \n\nAmen, sister.",
            "Hypocrite much? You turned the tables on him and he freaks the fuck out. Immature and be glad you are not with a dude who wants to live with his parents forever. ",
            "Tell him he need therapy. \n\nHe needs help.",
            "Dude has serious paranoia and anger issues. He needs help. ",
            "that trip to Peru might have saved you. Go on with your life you just dogged a bullet.",
            "Ooof... Anger issues like that alone should be enough to dump him. Good grief. ",
            "Let me get this straight, your boyfriend who is falsely accusing you of cheating, got upset that you didn't actually accuse him of cheating, but compared the ridiculous idea of you cheating to the equally ridiculous idea of him cheating? Wow... \n\nLooks like we both feel the same way about this, upon further reading. I'm sorry that it hurt to leave him but it's probably for the best. Doing the right thing is rarely the easy thing",
            "He totally cheated on you. Get tested for STIs just in case. ",
            "I think you made the right choice. You deserves someone who appreciates and trusts you.",
            "Skimming through the old post, did he ever give you any EVIDENCE that you cheated? Did he brush it off when you asked, or did you even ask?",
            ">After he left, called up his brother who I am sometimes close to and told him the story. He was surprised by how crazy he was but also told me that my boyfriend's last girlfriend (his first) had cheated on him, so he probably just thinks that of everyone now\n\nah likely it (though sounds like he has lot of other issues) hopefully his brother is in best position to encourage for him to get help over processing and moving on with trust issues. or this will ruin most of his relationships. not much you can do.",
            "It's also super fucking annoying and invalidating that he is so certain that you'd only EVER want to leave him if you were cheating. His golden ass couldn't possibly do anything wrong so it must be something YOU did.",
            "Hi! I just perused through this and caught up with the original.. \n\nI don't think it's been mentioned, but please go to clinic and get tested. Hey maybe didn't cheat on you, but he maybe did.. be safe. \n\nAlso, congratulations on ending the nuts in a safe way. :)",
            "What's that sound? Ah, an angel just got their wings. Beautiful.\n\nYou dodged a major bullet. **Good for you.** \n\nJust don't let him come crawling back apologizing like crazy in a few weeks. You'll feel bad for him and want to take him back. DON'T DO IT. Remember what you've learned right now, and don't let it happen.",
            "Good on you for getting rid of him. Sounds like he has a victim complex and just refuses to accept that you didn't cheat on him, because he feels worthless and instead wants you to submit to him and grovel. ",
            "You did the right thing! I just did the same thing! No one deserves that kind of treatment from anyone. Good luck, let us know how it goes!",
            "His reaction to your question was maniacal. You literally asked him to suppose what suspicions he had of you with reversed roles, and he lost it. To me, this would normally be a cue indicating he was getting defensive over his own cheating, especially considering he was the one accusing you in the first place. Not saying that's what happened, but I wouldn't be surprised if that were the case after all. If that weren't the case, however, and he is just that crazy... well I hope he finds some time to work on himself. Either way, he's not ready for a relationship. You made the right move.",
            "> my boyfriend's last girlfriend (his first) had cheated on him\n\nOh boo hoo. You know who else has been cheated on? Millions of other people! Just because he got shafted doesn't mean he's entitled to treat other people like shit. In addition, life is too short to deal with another person's \"anger issues.\" Good for you for dumping him. You should have nothing but positive memories of your study abroad, and fuck him for trying to taint that. \n\nP.S. I'm trying to get funding for a study abroad in Italy next semester. I'm super excited! ",
            "What a waste of a two month trip now...",
            "Good choice OP. Hopefully he can work on his issues",
            "He was probably cheating, no one gets that defensive unless they are guilty of something. ",
            "Alright this dude is nuts or something. What a hypocrite he can accuse you of cheating, but then when you do the same he freaks out?",
            "Honestly, his behaviour screams of guilt for cheating on you. Though I'm sure it's difficult for you, it sounds like you made the right move.\n\nAll the best.",
            "To quote Ben Folds, \"If you can't trust, you can't be trusted.\"",
            "There is roughly about 1 billion men +/- 5 years from your age in the world, so find a better match and someone who isn't long distance.",
            "I'm nowhere on this guy's side, but I'm 23 and nearly a year out of college and I'm just now figuring what I want to do... and that's okay.",
            "I wonder if he \"knew\" you were going to break up with him.",
            "Get tested.",
            "Get rid of him. Sounds like an absolute douche bag.",
            "Bullet dodged.",
            "Simply put, it's up to him. If he wants to act insecure and paranoid it's his choice and his choice only, he's creating his own stress. There really is no point in having a relationship without trust. He sounds like a dick head anyway, so to be fair his carry on has done you a favour.\n\n",
            "GURL YAAAAAAAAAAAAAAAAAAAAASS\n\nYOU DID IT!!! i'm so proud of you!\n\nyes it hurts now but like in a year you'll be like \"GOOD RIDDANCE\"\n\nbesieds its hard to date someone with zero ambition. I did something similar and it made me resent his laziness. go back abroad to travel go be yourself go find a man who thinks the world of you.  <3 yaaaaaas",
            "You did the right thing.  He definitely needs professional help though.  You might encourage his brother one last time to seek help for him.  Who knows how crazy he gets in the next relationship.",
            "...three years you were with this guy?",
            "My ex told me people had told him to be careful of me and that he knew things I had done on nights out without him. None of this was true and he had no evidence to back up what he said. Throughout the relationship he was extremely emotionally manipulative and when it came to us breaking up he always say he would \"destroy me\" and tell my family what I was \"really like\". There was no reason what so ever for him to not trust me but he had been cheated on in the past and it messed him up pretty bad. He would constantly text other girls and see no problem even when he would spend all night on the phone when he was meant to be with me. I was so manipulated by him that it took a long time for me to get out of the relationship and even after we broke up we saw each other a lot because he made out like I was nothing without him. I then met my now boyfriend and he blocked me off every social media possible and had a new girlfriend within a week of finding out I had met someone else. What he did sometimes still affects me over a year after I last heard from him and I can't ever imagine being in that situation again. You have got out at the right time and can begin to rebuild things without him. He sounds like he has a lot of issues and you are better off without him dragging you down.",
            "Bullet dodged, by getting rid of him. You don't need that crazy in your life.\n\nSounds like he was the one cheating and sounds like he sees women as a hive mind or objects rather than people. \n\nMaybe go get checked for STDs just to be safe.",
            "I think he wants you to be the cheater because he's a cheater and feels guilty about it.",
            "Can't tease us like that OP, post the youtube videos!!!!",
            "A happy ending for you. A hard lesson for dickhead.",
            "That's too bad. Crazy dick can be a lot of fun sometimes.\n\nSeriously, sorry about the outcome of your situation, but it seems you made the right choice.",
            ">I've asked him a million times what he wants to do when he's out of college. He just says \"I don't know\"\n\nthis makes me sad - because i was the same way - that many HS students are so pressured into going to college that they do so, incurring debt, without even deciding what they want to do with that degree.  i can tell you that i didn't have a choice, if i had wanted to work or go to trade school or even community college, my mom would have vetoed the ideas telling me i'm too smart and that i needed to go to college.  it took me 4 years at one school, 2 years of full-time work to reassess my life, and 2 more years at a different school to finally get my degree.  i realize that my example is anecdotal, but still, there were more constructive and cheaper options for me that i just wasn't aware of.",
            "Now he will think you cheated on him with his bro",
            "He seems really childish. I think you made a good choice.",
            "So sorry OP!  It hurts to love someone and then realize they are not good for you.  You handled things well!\n\nI also broke up with someone long term  awhile ago that was a tough decision.  The things I found out afterwards about him...well let's just say I dodged a bullet!  So did you OP.  \n",
            "Yeah... well, I think you handled this the right way. As you say yourself: It's fairly clear he didn't cheat, but this type of behavior is simply not very respectful.\n\nI don't think you were wrong in staying with him for these three years either - it doesn't seem like you had a bad time, but if he is still unable to openly communicate with you after all this time, there is a point where you have to end it.",
            "You'll look back in a few years, after dating dudes who aren't messed up, and you'll shake your head about this loser.",
            "WOOOO Stay at home sons for life!",
            "Sounds like you saved yourself a lot of future heartache and headache.\n\nNow you can go on with your life without him holding you down.",
            "If he had a problem with you leaving somewhere for 2 months he should have spoken up about it instead of being passive aggressive. ",
            "When you called him and told him it was over how did he act?",
            "Good job OP.",
            "Yeah, you gotta dump his ass. It sucks, but it is better being alone than being with someone who will who hurt you and hold you back.",
            "This situation isn't all that unusual but I doubt many people understand what's truly happening.\n\n\nFirst off, good for your for not cheating.  Monogamy is not the natural choice in many circumstances especially in a college lifestyle.  Also, if there was something, why could it not be forgiven?  How can anyone love their partner if they cannot conceive that their love is strong enough to not forgive.  \n\n\nI was definitely thinking that his reaction fits in with what I know from psychological defense mechanisms.  The original accusations at you were likely projection -- he feels guilty about something, and it may not be cheating on you, but it may be having had a thought about an attractive girl or something.  When you turned the tables on him the increased volume in his denial also speaks of insecurity and possibly guilt.  I'd say insecurity definitely.  But keep in mind that the more attached or 'in love' we are with someone, the more likely we are to feel insecure because we do not want to lose someone we deem so important.  \n\n\nNow, I understand that you talked to his brother and now you know all this dirt about how crazy he is.  Honestly, brothers talking about their brothers does not equal truth.  I mean you've heard of sibling rivalry.  The brother is likely using the situation which you presented to him to blow off steam because there always a build up of tension between siblings.  So you can't believe everything you hear.  Also, consider that something mild can be embellished to seem insane... like you said that you were told that he got angry and threw something and it was a big deal.  Well, I'd say that an assault is a big deal, and if it was a big enough deal there would have been a police report or something.  So could it be exaggerated?  Well have you ever gotten frustrated and thrown something across the room?  I think everyone has.  There are degrees that the brother is controlling honesty about... like did he break one plate or did he shatter the china cabinet and everything in it.  \n\n\nYou say you still love him but you now think he is crazy as hell.  Well, I guess I can understand that it's easier to start the process of \"moving on\" if you think he is crazy as hell.  But consider that you have also admitted loving him... and that's being vulnerable.  It would be a risk to your ego and emotions to work things out and potentially have things not improve or what not.  But this is the risk we take when we 'love' another.  \n\n\nIn the end we all have relationship \"deal breakers\" as Dr. Phil used to call them years and years ago.  You decide what you can live with and what you cannot.  You are the one to define what the love you give will look like and to state your expectation of what the reciprocation should be.\n\n\nI wish you both all the best whether your journey's take different paths or you come to a solution.",
            "you definitely made the right decision in the grand scheme of things.\n\nI feel like the whole situation really brought light to who he truly is as a person.  it's scary that you can be with someone for that long and still not know who they are.",
            "I know i'll be downvoted but... People take what people say too danm seriously.\n\nSometimes in this sub everything means something, everything said bears some awful and meaningful truth underneath it.\n\nShit, when did people have to be so god dammed perfect. They can't be angry, or have insecurity issues. Shit, young people don't even get allowed to be young. \n\nFor me this is silly, really, for both parts. Sorry. It's so easy to find issues with other people, so easy to blame someone because i don't feel perfect.\n\nWork on your shit. What is the big deal if love each other,? i just don't get it.\n\nDon't take words as dogmas. So he thinks you cheated on him...but still wants to be with you? Has insecurity problems? Sure, fuck i wish i was that complacent with my insecurity. But i get it, maybe it was not a big deal evemn if it happened.\n\nI don't know....maybe I'm playing the Devils advocate here, but, if your relationship is ending I don't think it's because of that shit. Especially when you say you decided to end after you heard what someone else said. Don't you know your bf? Make up your own mind.\n\nSorry about my english. Not my best language.",
            "Your situation is sucky and I'm sorry for it; boy be cray, but I just have to say that I'm tickled by the fact that you capitalize 'cocaine' every time.",
            "He's projecting.\n\" I don't care it's whatever\" -sign something is wrong.\nBlowing off like that when you said according to his logic he could have been cheating too - serious, serious sign something is very wrong. \n\nSeems to me he's cheating or cheated at least once. I'd wager on it actually. \n\nAlso he over all just seems like someone with problems that could, can and will affect you both in the future. ",
            "Considering how little he thinks of you, his mother and women in general, there's no way he didn't cheat on you in Florida. \n\nThe way he erupted when you told him further convinces me that he probably did. \n\nNot that it matters now, but I think you made a very good decision, OP. ",
            "Wow, sounds like you were in a relationship with an abuser and that relationship was about to hit the turning point. Glad you got out when you did.",
            "All the other reasons you listed at the end made me think this was a great decision, in addition to the level of crazy he has been.",
            "Wow, having someone cheat on you, **destroys** your trust.\n\n1. He probably was livid about the assumption of him cheating was ludicrous because he's been through that. I would never wish that upon anyone (I've been cheated on and regaining trust was one of the **toughest things I've ever done**)\n2. Don't ask about what he wants to do out of college, ask about what he likes currently and talk about the future possibilities that he could have if he went through with them. Psychologists can have their own office and can make their own schedule, etc. Be supportive. (My SO does the whole, *I don't know*, thing which frustrates the living hell out of me, but I'm learning how to steer around that blockade)\n3. When he says *I know* it could be a gut feeling, he needs to be in therapy for his trust issues and understand that just because he has those *feelings* it doesn't mean they are **real**.\n4. His youtube idea is extremely dumb, only a 15 year old would think this would be good. As a hobby, it could work and potentially turn into a full-time thing, but you need something stable first.\n5. He sounds extremely unstable, both mentally, and emotionally. **Therapy would be the best bet.** I would attempt to get his family to usher him into it.\n\nBreaking up, I'm not sure if that was for the best, or for worse, because now his trust capabilities are going to be torn in even more directions.\n\nI'm sorry you had / have to deal with this sort of mental instability, it's is up there at the top; It sort of reflects a bi-polar, schizophrenia, with a dash of OCD (Intrusive Thoughts).",
            "I'm sorry that you're hurt, but grats you got away without some crazy shit going down, kids, getting married, first, etc. Three years sure is a long time though. ",
            "Leave that pathetic excuse of a man, what a waste of time and space.",
            "Have you ever consideres that he's cheating on you? And just trying to pin it on you as well? And you know since he's okay with you \"cheating\" you should be too?",
            "So. \n\nYou were dating an adult who lives with his parents? \n\nLol.  \n\nThere is a lesson here somewhere.  ",
            "Obligatory \"This will probably get buried, but. . . \"\n\nWhere I come from there is a saying: \"Never put your  dick in crazy\". As I read this, however, it occurred to me that the inverse is also true: \"Never let crazy put his dick in you.\"\n\nGood riddance to ~~bad~~ crazy rubbish, I say.",
            "Lol no one is this screwed up without some serious red flags within a 3 year time period. Good move on your behalf to leave him.\n\n>He just said that \"He knows me\" and \"He knows what I'd do\".\n\nThis made me curios though. Did you sleep with him after 2 hours of meeting or something??? What was your rebuttal?",
            "[deleted]",
            "If he didn't cheat, the only other thing I could think might be it would be that he's snooped through your stuff while you were sleeping and took something out of context?? Could that be a potential? Is there any pictures of you with guys or any thing that he could remotely twist and manipulate himself into believing it's cheating because he has had a bad past with cheating exs? ",
            "how the hell did you not know he had anger problems or any other red flags after three years of dating? are you that oblivious?",
            "Your boyfriend's brother is a dickhead for not having his bro's back over some gf.  shame. ",
            "If you just broke up with him like that after 3 years because of one accusation then I'm sure you've cheated on him. If not on the trip than before definitely ",
            "[deleted]"
        ]
    },
    {
        "post_id": "3fb3v5",
        "author": "throwawayyapt1234",
        "title": "My [28F] roommate [28F] is away for the weekend. I thew a party last night and invited people over. This morning a lot of her expensive items are missing. I can't afford to replace any of them.",
        "url": "https://www.reddit.com/r/relationships/comments/3fb3v5/my_28f_roommate_28f_is_away_for_the_weekend_i/",
        "score": 2075,
        "num_comments": 572,
        "created_utc": 1438360918.0,
        "selftext": "I don't know if this is the right place for this but I don't know what to do.\n\nI live with this girl named Meredith. For someone I met online when looking for a roommate to fill the second room, she has been absolutely great to live with. We aren't the best of friends but we get along well. We both have busy lives so we usually chat for a few minutes in the evenings and on the weekends. She's actually an awesome roommate. She's quiet in the mornings and night, clean and takes good care of the common areas. When she first moved in, she asked me if she could put a lock on her bedroom door. I thought this was odd because the last roommate never did this but it's her own room so I didn't really care. She left the extra key for me in a kitchen drawer and told me she usually doesn't lock the room but if she goes away for a few days she prefers to keep the door locked because she's quite watchful of her things.\n\nAnyway, Meredith has a good job but I don't think she is super rich or anything like that. When she first moved in, she only bought two suitcases of things. I commented on this and she basically said she likes designer items so she buys just a few high quality items but pays a lot for them. I don't really know anything about designers or labels but I kind of got to appreciate them after seeing her wear these items. \n\nYesterday, I had my last exam of the summer semester and officially finished my course. I decided to have an impromptu party to celebrate at the apartment. I texted Meredith letting her know and asked if she wanted to join in and bring friends.\n\nMe: DONE!! I am going to have ppl over to drink later. Want to join? You should ask Jen and her boyfriend to come too.\n\n\nMeredith: Awesome! Congrats!! I am going to be in [place] remember? I am coming back Sunday because I have a session at 9. Have fun celebrating!\n\n\nMeredith: There may be a bottle or two of wine in the fridge. I bought it last wknd. You can have it for tonight :) :)\n\n\nMe: Thanks!\n\n\nMeredith: By the way, if there's going to be people over, can you do me a huge favor?\n\n\nMe: Ya what's up?\n\n\nMeredith: When you are in the apt later, can you pls lock my room? I think I left my Tom Ford sunglasses on my bed as well so maybe you can put them in the closet or something?\n\n\nMe: I am here now. \n\n\nMe: Hey, I put the sunnies in the closet and locked the room. Have fun in [place].\n\n\nMeredith: Perfect, thanks! \n\n\n\nSo people were over last night but it ended up being a much bigger party than I expected. People brought friends so it was really crowded. I got drunk pretty quickly. My friend Allie was feeling a bit ill and wanted fresh air. I am an idiot. I wish I could take this all back. I was too drunk and wasn't really thinking. Meredith's room has a nice large window where you can sit on the ledge. I unlocked her room with the spare key and let Allie in. I went back to drinking with friends. At the end of the night, a couple of people crashed in the living room but left when they were sober.\n\nI woke up this morning to a very messy apartment with drinks spilled everywhere. I had every intention of cleaning it up. I walk towards the bathroom and notice Meredith's door open. I remember opening it last night so I just wanted to go back and lock it again. I noticed that a few of her drawers are open and her closet is open. FUCK. Now I am freaking out. Meredith literally only has ten or so hangers in her closet of which seven are EMPTY. Everything was there last night because I opened it to put the sunglasses in. The sunglasses are missing as well. I am really freaking out now. I don't know what else is missing. I looked up Tom Ford sunglasses online and they run $350+. Some of her purses are $6,000 each. I have no idea how much any of her clothes are worth. I can not afford to replace any of these items. Not now and not anytime soon in the future. I know it's all my fault. Anyone could have taken the items since so many people were in the apartment. I called Allie and she told me to file a police report which I will do now. What do I do? I have every intention of paying Meredith back but I literally can not afford to do so. I think she will be very upset about this. A lot of her things seem to be gone. It's not like she's very rich that she can just write it off like no big deal. A lot of her savings went into these items. I feel so horrible.\n   \n**tl;dr**: Had a party at my apartment. Roommate is away and asked me to lock her bedroom door. I did but then got drunk and opened it hours later. Wake up and many things in her room are missing. She has very expensive taste and I can not afford to replace any of the items. What do I do?",
        "permalink": "/r/relationships/comments/3fb3v5/my_28f_roommate_28f_is_away_for_the_weekend_i/",
        "comments": [
            "[deleted]",
            "Life lesson learned the hard way.  For now all you can really do is file a police report and contact your renter's insurance company (because you have renter's insurance like you should, right?).  I don't know how far renter's insurance will take you though, with items that expensive.  If you don't have renter's insurance, you are SOL--the police won't do anything, and obviously nobody you invited will admit to taking stuff.  Doesn't hurt to ask around, but realistically the stuff's gone for good.\n\nAs far as the personal relationship side goes, you're up shit creek.  There isn't any excusing what happened, and she is going to be, quite rightfully, angry.  Apologies only go so far when thousands of dollars of stuff is gone.  Be prepared for a conversation about someone moving out.",
            "Start picking up extra shifts in case the police can not help and insurance won't cover it. You fucked up, you foot the bill.",
            "For what it's worth, this happened to me but I was in Meredith's shoes. I figured out who it was after a little cross-referencing between friends and was later compensated by the friend of my roommate that brought the thief into our home. You have a significant amount of liability here, but don't panic. There are still options. \n\nFirst, sit down and think about who came. Make a list. Think about who you didn't know. Call the people you remember being there and ask who they knew/didn't know. Ask Allie! Don't accuse anyone or seem panicked (it will discourage cooperation), but be serious in your need for info. Think about it this way, you looked at and welcomed a thief into your home, and I bet you can deduce who it was. At least down to a few potential people. Who was there that you will likely never see again? Who did you talk to the least? Who brought the most people? Has anyone been to another party recently where something was stolen? \n\nAlso, look online to see if some of the items have been posted for sale on craigslist or ebay. You're probably not dealing with a criminal mastermind here. Definitely go to the cops, but understand that they cannot help you as much as you can help yourself.\n\nCheck your renters policy. Call Meredith, explain what happened, the options moving forward you are aware of and apologize. Sincerely apologize, with no exceptions. Do not surprise her with felony level theft when she gets home. You want her to react before she sees you so she has the chance to be calm when you first talk about it in person. Include her in the process and show her you are working to make things right. She will be angry, and you are liable for what happened. Treat her with the utmost kindness and respect, even if she yells at you. You do not want to give her a reason to pursue a lawsuit. \n\nBest of luck!",
            "You need to call Meredith right now, and have her give you a list of her expensive items and the value of all of them so you can file a police report. \n\nThen you need to go to your friends and ask for all the names of everyone invited. \n\nIf renter's insurance doesn't come through and replace all of her items, I suggest you get a credit card and max it out repurchase all of her things. Fingers crossed that renter's insurance covers everything.  \n\nSeriously,  though. I know you can't afford it, but this is 100% your fault.  Your roommate did everything correct. She bought a lock for her room, asked you to pack everything up, and requested you lock the room when she was not there. You unlocked the room and let everyone in the apartment go through her things. If I were her, I'd be pissed and I'd expect you to repurchase everything. Who cares if you can't afford it? You could have suggested anyone that felt stuffy take a walk. You could have walked to a 24h cvs and bought a fan. You could have started to kick people out when it got too crazy. Instead you unlocked your roommate's room without her permission, and invited everyone inside of it to get some air. \n\n",
            "[deleted]",
            "[removed]",
            "Wow, poor Meredith. You really fucked her good. I guess she just learned her lesson on meeting roommates online or letting them invite their skeezy friends over for a party when she's not home.\n\n> She has very expensive taste and I can not afford to replace any of the items. What do I do?\n\nYou find out if renter's insurance will help, as BeyondSelfish suggested, or you start paying her back in installments.",
            "Damn, OP. The point of locking the door was to NOT let anyone in. The fact that you then opened it again and left it that way is the same as not having done it at all. You get no credit for having locked it earlier when she asked.\n\n> it ended up being a much bigger party than I expected.\n\nIt was your party. These things don't \"just happen\" to you. Furthermore things like this will stop \"happening\" if you take some ownership of your life and choices, because then you can't blame the universe or others as much.\n\nTake a hard look at the people you know. Do any of them tend to make new best friends with random druggies that hooked them up on the street, that kind of thing?",
            "You screwed up big-time. If the police can't help, you start saving your money to make it right. No more drinks or dinners out until you have paid back the stuff you lost. This is 100 per cent on you.",
            "Holy shit I'm so sorry but this is entirely on you. Do you know everyone who was at the party? You gotta track down whoever took that stuff and report them to the police. ",
            "Right now, offer any extra cash you have to start covering the missing items. You need to get in contact with everyone at the party and figure out if anyone saw anything. Meredith should also make note on all the missing items so you know exactly what people stole from her. ",
            "[deleted]",
            "Does anyone else remember the post from like a couple weeks back from the girl who was going on vacation and wanted to lock her room but felt bad since the roomie uses her balcony? Is this OP's roommate??",
            "Whelp, you done fucked up royally.\n\nAs the roommate and the party organizer, you had a responsibility to ensure shit didn't get stolen.\n\nShe can sue you for it. And if she does, she's gonna win.\n\nLesson learned.",
            "Wow. You're *that* girl. Fuck you and your shitty friends. Your poor roommate probably doesn't even have an inventory of her stuff and will never get that stuff back. Some may even have sentimental value. File a police report, but if your renter's insurance doesn't cover it, you will HAVE to cover it yourself, with interest, as fast as you can. I hope she sues you and has your wages garnished until you cover the thousands of dollars of missing property. Grow the fuck up and get better friends and learn to keep your word even if you've been drinking. She asked you to do just one fucking thing, but you broke your word cause someone wanted \"air.\" There's plenty of that outside. And what are you doing letting a sick person in her room so she can potentially lay in her bed and barf in there. All this after she even let you drink her wine for the party! You did this to a nice woman. You are 100% at fault and the only way to get ahead of that is to start making payments immediately. I would be so livid at you if I were her. You're 28!! Holy crap, learn to behave like it. It's upsetting just to read because everyone knows someone like you. She's learning her own lesson right now about trusting people she's met online. By the way, when you're the only host, you should stay sober enough to know if you're getting robbed. This is so many levels of bullshit and it's all your fault.",
            "[deleted]",
            "If you have renters' insurance, file a claim. \n\nIf you don't have renters' insurance, find a way.  You could start by selling your stuff, your loss will pay for her loss; you can also get a part-time job and just sign over your paycheck to her till you're paid off.\n\nWelcome to adulthood, take responsibility and do the honorable thing.",
            "You're gonna get sued ",
            "[deleted]",
            "Get in front of this and make sure that Meredith finds out all of this from you, without excuses, rather than coming home and discovering her things missing.\n\nThen accept that you are responsible for the costs.  If you can't afford them then you'll need to work out  a payment plan.  \n\nApologize, don't make excuses.  \n\nAlso, the suggestions about filing a police report are a very very good idea.",
            "OK, first: you can't afford to replace these items, but can your parents help out? Easier to pay them back long term than this poor girl.\n\nSecond, you should do as much investigation as you can since the police might not search high and low. It might also help if you put word out that this is felony territory and the police are involved, but if the items turn up at such and such a place you will close the case. \n\nWhen you call your roommate, make an effort not to be emotional. The profuseness of your apologies won't matter, but the chances of getting her stuff back will. So make a list of all the clothing and start searching eBay, and Craigslist. Also search Facebook and Instagram for these people to see if you can find anything out. Maybe someone said something stupid, maybe there's a pic of someone wearing something you recognize. If you find them, give them the choice of returning everything possible or being arrested for felony theft.\n\nNo more parties for you. No more friends over without explicit approval from roommate. If there's any way to swing reduced or free rent, swing it. Rethink your relationship with alcohol.",
            "Start looking for a new roommate because Meredith is going to be moving out on you soon",
            "Get a lawyer.  You unlocked and entered her room without her permission.  I would get a job and start paying her back.  ",
            "When I was 16, a friend of mine had a house party. It got advertised on facebook, so you can imagine how many people turned up. The neighbours got pretty annoyed at the noise and the stink of weed and called the police. Luckily, I managed to get me and my very very drunk/high friend out of there before they turned up. About 7 people got asbo's that I know of.\r\rBut the house was trashed, the fences outside were annihilated all along the road, someone punched a hole in a ceiling(?), the bannister on the staircase got ripped off, all their food got eaten and lots of things got stolen, including all their forks and tv remotes.\r\rThe guys parents got called back from their holiday by the police. They had to redecorate the whole house due to graffiti and the smell off weed getting into everything, as well as replace the neighbours fences. \r\rPoint is, the guy had to get a second job, while at college and give his parents his paycheck every week for the next year to pay for the damages. They also made him write a very embarrassing public apology about what an idiot he had been. Even though it wasn't directly his fault he was held accountable as he put it online and invited everyone possible and he had to deal with the consequences. OP, they were your guests, regardless of whether they were friends of friends, you had the choice to stop the party in its tracks, when things were getting out of hand, but you were too drunk to care. And what a huge invasion of privacy, it was your housemates room, you shouldn't have even gone in there without permission, she trusted you. I don't think i could trust someone again if they went in my private space without permission, let alone if they let a bunch of strangers in, who stole my things. Insurance companies can be a bitch about things like this, they may not even pay out as they were let into the place voluntarily, the insurance people of the guy I knew did nothing about it.\r\rBe prepared for the rest of your tenancy to be awkward as hell too.",
            "[deleted]",
            "AMA request for Meredith. \n1. What was your reaction when you heard the news? Did you break anything with rage? \n2. What was the most valuable designer item you had in your room? Total? \n3. You seem like a nice girl. You don't deserve this. I'm sorry about it happening to you but what's going to happen next? ",
            "Break it gently to Meredith, take responsibility, but make sure you've ALREADY filed the police report. She needs to know you're not taking this lightly or brushing it off with an \"I'm sorry!\"",
            "Hey, do you live in a big city? Favor, Uuber, Lyft, etc will hire just about anyone, and if Favor is in your city, you can use a bike as well. You can work after your regular job and make decent money",
            "You are about to be sued.  Enjoy.",
            "Sounds like its time to start a 2nd job as there really is no correct answer.  I would call your parents and try to get them to loan you whatever it will cost to replace this stuff.  That being said there is no way to smooth this over. ",
            "Perhaps call consignment shops around the area and see if they have had anyone selling the items?",
            "You just had a riotous party, as far as 9/10 people know it was great.  Add everyone you remember on FB, see who refuses?",
            "[removed]",
            "OP, you're an idiot. \"She may be upset\"? NO. She is going to FLIP HER SHIT. Want to know how I know? I had a room mate do this to me. Have fun and grow up.",
            "Call your roommate immediately. File a police report today. Call everyone who was at the party and try to recover some of the stolen items. Start looking for a new roommate or apartment. Find two jobs, start making payments for the items stolen. Quit drinking. Obviously you and alcohol don't mix. You violated your roommates personal space, and she was robbed. Apologize profusely and pay up.",
            "...\n\nYou never get that drunk if you're throwing a party at your own house.  At least, not until everyone has left that isn't a close, close friend.  \n\nSource:  Rented a party house for a year, had parties nearly every night.  Never had anything stolen or fucked up because I regulated.  ",
            "So, you can contact the police and renters insurance, but that might not cover all of the missing items' values as normally there are deductibles and such. You will need to see what you can get back with insurance and probably get a job to pay back the remaining costs (expect to personally pay back a couple hundred to a couple thousand depending on how fair the insurance company is and how much the deductible is).\n\nThrowing a huge impromptu party with open door policy is hugely irresponsible, not mention you got black out drunk while being the host of such a dangerous party. These are not reasonable actions of a 28 year old, this better be a huge ass wake up call for you. Hell, I would expect better judgement from an 18 year old.\n\nAlso, expect things to be 100% rocky with your roommate until she can leave or break the lease, personally I wouldn't feel safe living there anymore.",
            "You can't ask the friends you *do* know if they saw anyone walking out of that room with armfuls of clothing and bags? \n\nIt doesn't seem like someone'd be able to sneak out of a full-on party with that much stuff without *anyone* having seen anything.",
            "Also, not to dump on you, but how are you twenty-eight years old? This is kid stuff.",
            "I applaud the people in this thread who gave you proper constructive advice because i find myself unable to do it. You piss me off too much.",
            "[deleted]",
            "Well, what you shouldn't do is tell her her things are missing and you can't afford to replace it. You might not be able to right now, but you absolutely owe it to her to replace them, if renters insurance and cops gets you no where.  Honestly, if i were your roommate, reading your exchange, I'd be super pissed. She was generous in offering her wine and place she rents for a party and all she does is ask you to keep her room locked and you can't even do that? You need to find a way to make the money and repay for her things. This is your fault entirely and she shouldn't have to bear the consequences of your shitty actions. ",
            "Better take out a loan or be prepared to be sued....you fucked up royally ",
            "I say: Police first. Then start bringing up a guest list at the party. Start contacting people you know were there and start asking who they brought. Don't tell people who were at the party you're reporting to the police quite yet. If you immediately freak and tell them you're going to the police, you might tip off the thieves and cause them to hide more carefully. \n\nAfter you talk to meredith and get a list of whatever she is missing, start looking on EBAY and Craigslist for all of her stuff. ALso consider local pawn shops, thriftstores, and consigment stores. \n\nI would also consider offering a reward for information that brings you directly to the thieves. Maybe 100-200? It will not get the thieves to turn themselves in, of course, since the items are running into the thousands, but it might incentivize one of their friends to turn them in. ",
            "[removed]",
            "Try r/legaladvice. Condense your post to the relevant information about your actions in throwing the party and When and how you realized items were stolen. That subreddit will not sugarcoat the situation but they will give concrete advice on your next actions. ",
            "(I know I'll be down voted but oh well)\n\nLet's see. \n\nA nice, quiet respective roommate who's polite and nice asks you to lock her room full of expensive items while you throw a party full of (mostly) uninvited guests while she's not there, and lets you have some of her unopened wine as well. You let your friend into her room and didn't bother to lock it while you got blackout drunk and now most of her items are gone.\n\nThat's messed up. Hate to be blunt here but you don't have too many options. Best case scenario, she gets (understandably) pissed and never trusts you again. Worst case; she moves out and sues you for letting the thefts happen. Sure you didn't steal anything but after she told you to lock her room and you opened it, her trusted roommate, to a house full or practically strangers, well, I would be mad too. \n\nAs /u/jpallam said:\n>I assure you, those items are almost definitely in a resale shop or on eBay by now.\n\n100% correct. Maybe if you're lucky and report the names of the people there (that you know of) to the police you can get SOME of the items back and maybe some money. Even if you *do* get the items back, there will be tension.\n\nBut right now things aren't looking too good. I recommend you tell her before she comes back or as soon as she walks through the door back from her trip. Walking into her room and finding at least 80% of her belongings missing would not be a good idea. \n\nYou owe her that much.\n\n**EDIT**: You're 28? Gosh, this is something my guy friends (high school) would do, **not** a college grad. ",
            "File a police report and write down the names of everyone that was there. If you don't know some of the people get their names from the friends they were with. It'd be wise to have phone numbers/addresses for these people as well.\n\nHow many people were there? Just because someone is your friend, doesn't mean they are your friend, or beyond taking advantage. Have the officer investigate and so forth, there will probably be prints everywhere, but her room will help narrow down culprits.\n\nIf/once the culprit is determined be sure to press charges or whatever. This is thousands of dollars worth of stolen property, regardless of whether they were in your house by permission, it does not grant them permission to steal.",
            "I had to check your age again.That says it all.Not being able to afford it is not an excuse,pay for the items with credit and take responsibility for it by making it YOUR debt.It sounds like you want to get out of the situation by not having to pay her for her things.That's not an option.\nBe a grownup and pay her back any way you can.You'll recover sooner or later.\nIt makes me mad that you are using such a victimising tone,your are not a victim,your roommate is.",
            "Call the cops!!!",
            "I am wondering if your building or street has security cameras? Cops will know this.",
            "How is renter's insurance going to cover this??\n\nShe unlocked the door and invited those thieves herself. This is as stupid as it gets.",
            "Wow your friends are skanky thieves, if I was your room mate I would want to break the lease and get the hell away from you. You have demonstrated you aren't trustworthy. You should apologize, file a police report, and work out some kind of payment plan with Meredith. I think you should text your asshole friends and ask that items be returned.",
            "And just like that, the extra cost of a 1 bedroom apartment is completely justified to not deal with roommates like OP.",
            "Twenty fucking eight????????\n\n",
            ">I don't know if this is the right place for this but I don't know what to do.\n\n\nThis belongs in a r/tifu ",
            "[deleted]",
            "Why would you get super drunk at a party you're hosting that got out of hand? If you're having people over, shouldn't you play host and remain at least somewhat coherent?",
            "You need to go to the bank and take out a loan ASAP,  you need to pay for everything,  also she could take legal action against you and I hope she does. ",
            "Get in touch with every person who was there and plead for the stuff back. otherwise *yes, you have to pay for all of this*. Also be prepared to lose this roommate situation. And grow up, you're not a teenager anymore. Who the hell has people in their home and they don't know who the people are?",
            "you should also mention to her that if she purchased the items with a visa card, some items are automatically insured against theft. this is not bullshit, and a very little known fact, i told my friend and if you can prove the purchase was made with a visa and its within a certain time they will cover the cost. my friend got a new blackberry from visa after reporting it stolen, she just had to prove that she purchased the phone with a visa card at the att store. \n\n",
            "I'm gonna pretend like I'm in /r/legaladvice here, because that's the kind of advice that's most useful to you right now:\n\nA) File a police report for the missing items. \n\nB) If filing a police report doesn't work, you just have to eat it, because ultimately, you are responsible for these items. Work something out with your roommate. ",
            "good job. Has anything good ever come from letting a bunch of drunk strangers into your house, much less SOMEONE ELSE'S room?\n\nyour room mate deserves an adult on the lease, not some idiot teenager. i really hope you spend the next few years working this debt off to this poor girl.",
            "You're the shitty roommate that people don't want to live with. I'm sure you didn't mean for any of this to happen but you didn't care if I did by your actions drunk or not ",
            "I would suggest you text/call the people who you invited and let them know the stuff was stolen.  I would tell them that if everything is returned withing 24 hours, nothing more will come of it.\n\nHowever, if they do not return everything, let them know you are going to file charges with the police, and press charges against everyone who attended, and let the police take it from there.",
            "You are fucked, buddy.",
            "have dealt with this before, i'm pretty sure that renter's insurance won't cover you. try to take out a loan, apologize profusely, work with the police. make sure you check all social media because sometimes people will be stupid and post \"their\" new things on fb/insta. good luck and hopefully you've learned this time! x",
            "Ohh OP. You dun fucked up. Well, file the report. Talk to Meredith and beg for her forgiveness, do not cry. She's probably going to move out, don't try to change her mind. Keep up on your local Craig'slist, stuff is likely to end up there.\n\nAfter all that, get new friends. Seriously. Your friends suck.",
            "What the fuck",
            "yeah, it's time for you to get a second job. you can't pay her back *right now,* but it's absolutely possible. wow. just wow. ",
            "The key component here is your memory. Who was there that didn't belong. I'm sure you can think back to last night and figure it out. Who else knew about your roommates things? Were you bragging about how much stuff your roommate has to someone? Why was your roommates room the only one raided and not yours? It doesn't add up. Think back OP, I'm sure it'll come to you 😉",
            "Start calling everyone from the party and get the word out the cops are involved. Make it clear you want the stuff back. Don't rely on the cops to do it for you. You need to make every effort.",
            "Pay the price of your stupidity.\n\n",
            "Their finger prints could be on the hangers and everywhere else Get police involved, find out what you need information wise that can help after explaining. Contact Meredith as fun as that will be, find out a list or have her come back from whatever she is doing since it's mostly gonna ruin her weekend anyway and help sort out what's missing. You also might want to consider after all this re-evaluated who you are friends with cause if you don't, I'm sure Meredith will.",
            "Maybe you stop acting like an undergrad. ",
            "Your poor roommate. I hope she sues you. ",
            "I'm kind of amazed you were even able to pull together a raucous, drunken blowout party full of strangers and theft at 28 years old. I'm 28 too and I can barely organize my friends to go to lunch because everyone has commitments, many have started families and have kids at home, are working on promotions, etc. \n\nWhereas at 28, you still hang out with a crew that is getting so drunk they're nearly sick and bringing so many people over to party that you can't even keep track (not to mention ones that steal) \nThis will be an expensive mistake, but maybe it'll help you reevaluate some things little bit. And I say that with peace and love.",
            ">>Meredith: There may be a bottle or two of wine in the fridge. I bought it last wknd. You can have it for tonight :) :)\n>>Me: Thanks!\n\nLook at the generosity of her roommate! She's so fucking nice, and of course, OP does say \"Thanks!\" but in a way that is kinda non-caring almost. Similarly to how she unlocked the door, it almost seems like the root problem here is that OP just didn't care enough about her roommate. \n",
            "To add to everyone suggesting you figure out how much renter's insurance will cover you, maybe you can also post (on fb, for example) and encourage anyone to share information about the stolen items and that you'll be going to the police",
            "You have to tell your roommate immediately.  The police will need an itemized list of all missing items.  Also, is there any possibility that some of the missing items are things she took with her if she's gone for the weekend?  Maybe not as much is missing as you think.",
            "This is what renter's insurance is for. Hopefully you have that",
            "You need a better class of friends.",
            "Call the cops, file a report, and check Craigslist every single day.  You may just get lucky.",
            "Call police, report theft, see if they are willing to do fingerprinting, call renter's insurance, call Meredith, contact everyone at party, telling them about the theft, start checking craigslist and consignment shops. \n\n\nOh, and get two or three jobs to repay roommate, should renters not cover it, cause she deserves to have her items as quickly as possible, and not when you get around to it.",
            "This is where an emergency fund comes in handy. How much do you have tucked away in yours?",
            "So if I were Meredith,  you'd need to add \"find a new place to live\" to your to-do list.  Because I'd be looking to make your life an absolute hell hole. ",
            "Do you guys have renters insurance? As it happened at your party, I'm not sure if renters insurance would cover this. If not... start saving.\n\nAnd learn that if you're hosting a party, you need to moderate your drink intake and keep an eye on your guests.",
            "OP you suck. Just the fact that you \"We aren't the best of friends but we get along well\" with someone like Meredith (from yur own account); shows what a douche you are  ",
            "Do you care about doing the right thing, or minimizing your own liability?\n\nIf you care about doing the right thing, listen to the comments in this thread. If you're willing to be a horrible human being to minimize your liability... ignore all of the comments (except for this one) and lawyer up. You're running around admitting guilt everywhere without talking to a lawyer, which is maybe the second-dumbest thing you've done recently.\n\nThere is a very high chance that you are going to be sued over this (and rightly so). But you (personally) may not want to impoverish yourself for years over a rando Internet roommate.",
            "Yikes. I'm sorry. That really sucks. Knowing that you fucked up and that your mistakes hurt others - especially friends and people you like - is for me the worst feeling in the world. It was a mistake made in a drunken moment. The party went to far and you messed up.\n\nYou need to call her immediately. Because it'll be worse if she hears from any mutual friends that you had a rager and she was burglarized. Also you need to know precisely what was taken so you can give an itemized list to the police. And know how much money you're in for.\n\nYou need to start to try and piece together a list of who was there and who they brought. Save any photos you find of the night and the party on facebook, twitter, instagram, whatever - that might be able to help you get an idea of who was there. Text friends and ask who they brought to the party.\n\nFile your police report.\n\nYou need to check your renter's insurance policy. See what that covers. Call them.\n\nYou should keep an eyes on craigslist and kijiji and call around to pawn shops and second hand stores.\n\nYou might have to come up with a payment plan with Meredith depending on if any of it can be recovered or if your insurance covered it.\n\nSorry pal.",
            "Of all the posts that I want to see an update on,  this one needs an update the most. ",
            "If i was youre roomate id start swinging on you...immediately  lol",
            "Do you gave renter's insurance? You or her would have had to include the value of these items in your total value of possessions when you got your quote for your plan. ",
            "check local craigslist or see if any friends (or friends who notice people they brought along) suddenly have designer gear in their profile pics or pics from the party. \n\nit might be a plan to start appealing for witnesses/rewards for info, because a party that big and that many clothes, someone must have seen something. talk to the police about this\n\nif she really demands money back and somehow you have to, payment plan might be only option to negotiate a way so you're not in debt",
            "[removed]",
            "Where in the world do 28 year olds throw parties like this? All the mid-late 20s people I know are in/graduated graduate school or have careers and have long since moved on from the party lifestyle. I had to re-read the title to confirm the ages here after I read the line about getting black out drunk. I doubt OP has renters insurance and the police won't get the stuff back, so OP better get a job if she is truly determined to pay the roommate back. ",
            "Get a credit card and take out a loan against it and pay her back as much as you can. Ask your parents for a huge loan. Use your school loan to pay her. Get a second job and pay her. Wash cars. Serve tables. Sell your own car, bike, stereo, computer, iPad, etc. Then get into some treatment. You have a drinking problem. ",
            "your friends kind of suck... and you are kind of an idiot.\n\ncall the police and get a list of people who were there that night",
            "Look up and notify EVERY local pawn shop or store that buys the sort of stuff that was stolen up to an hour away from your home. Make a script of what was stolen, what it all looks like, and read it aloud to whoever speaks with you over the phone. This will take hours, but it will help.\n\nI had a girlfriend that threw a party at my parents house when I went on a family vacation, a laptop and a nice shaver were stolen, I wanted to hit a girl for the first time in my life when that happened.",
            "Man she's going to be heartbroken. I know this life lessons sucks OP  ut you have to stand tall and assure her you'll pay her back. Write up a contract and sign jt acknowledging all the lost items as she tells you and sign jt with a date for installment payments on what you can't find to replace.",
            "You're 28 and throwing house parties like it's college? This is your end result in trying to be cool. Are you sure you're 28??? \n\nMy only suggestion to you is to tell her the truth as soon as possible and try to reimburse her. I know many people say filing a police report will help. Which it may. But you willingly let these low life thieves into your apartment. You chose the wrong group of friends to hang out with and you trusted them in your home and sanctuary that you shared with your roommate who you disrespected by unlocking her door and not caring for her stuff. The only thing you can do now is slowly pay her back with a job. \n\nI feel bad for her. Even though I'm not one for luxury brand items, to some people it's their life and they take pride in owning expensive things. I only wished your stuff were stolen instead of hers. ",
            "You sound like my brother. \n\n\nYour sober self has as much common sense as your drunk self.\n\n\n\nMaybe you'll learn something, but if you're like my brother, and you sound like it, you won't.",
            "Do you have renters insurance?",
            "Pendejo. Call the cops asap. ",
            "First thing you do right now is call the police and file a report right away.\n\nNext you call Merideth and let her know what happened and that you already filed a report.\n\nIf you have renters insurance call and deal with that.\n\nYou could do a number of other things ive seen posted like sending out a mass text saying your disapointed and theres a security camera and your waiting on merideth to get home to see who did it and people could return the shit or whatever. I wouldnt count on that to pan out though so the first 3 things i said need to be done.\n\nAfter this though id take a look at your life. Maybe quit drinking or at least quit getting blackout drunk. Maybe also take a look at your friends and eliminate a few of the more problematic ones. \n\nApologize to your roomate as well. Give her the spare key back as your not responsible enough to hold onto it. If the stuff isnt recovered anytime soon and theres no insurance to cover it then start working on a payment plan.\n\n\nPersonally i suspect your friend that you let into the room. But who knows really. Id keep a eye on your friends though for suspicious spending habits or even being stupid enought to wear what they stole. Watch craigslist and ebay as well for the items that are missing and see if you can link the accounts to someone you know or who was there.\n\nI really hope your hot, at your age these kind of parties should be done with and life is only going to get harder for you if they are not. You should also have a pretty good understanding of your drinking limit and know when to cut yourself off by now as well. Im only 2 years older than you and have long since figured out when to quit drinking and usually switch to water afterwards to avoid a hangover, i pound a bunch of water and piss a lot before going to bed and wake up feeling great. But i also tend to just avoid drinking much if at all. I for sure never get black out drunk though.",
            "As others have said, file a police report. Also start looking for another roommate, this shit isn't going to go over well and who can blame your roommate.",
            "If her purses were stolen you probably got her Id and credit card or check book stolen so you should probably talk to her real soon",
            "[deleted]",
            "It's moot now but I have to ask why you (28F) didn't go to bars instead of having a college house party in your apartment. As someone who has lived in apartments, it was probably very obnoxious to your neighbors as well. "
        ]
    }
]