[
    {
        "post_id": "57o3in",
        "author": "throwaway908070x",
        "title": "UPDATE: Boyfriend[23/M] has implied that he'd leave me[22/F] if I wouldn't stop playing my PS4...",
        "url": "https://www.reddit.com/r/relationships/comments/57o3in/update_boyfriend23m_has_implied_that_hed_leave/",
        "score": 2055,
        "num_comments": 44,
        "created_utc": 1476565420.0,
        "selftext": "Original post -- https://www.reddit.com/r/relationships/comments/57h7wl/boyfriend23m_has_implied_that_hed_leave_me22f_if/\n\nWe made up.\n\nNot.\n\nHe came back home drunk at like 4AM, and I had a few things gathered together as I decided that I'm going to be staying at my parents for a while and sort things out like rent etc. Before I left for my parents he apologised in the morning at like 10AM (took the day off work because of it) , but didn't apologise for 'calling me out on my addiction.' And 'Just telling me to quit my boy habits'.\n\nI was baffled and I asked what it is he want from this relationship (Because I was under the impression he wanted me to break up with him), and he said for me to listen to him and basically do what he says, so I told him I am listening to him, and that I didn't like what I was listening to. \n\nSo I told him he was being sexist pig, made points of saying how often I play my PS4 and that he can use it more than me. I then rounded it up by telling him to go f*** himself and that we were done (not the most gracious thing to do, but it got the message across.) \n\nI'm sitting in my old bedroom receiving mixed text messages from, between \"I'm sorry baby please come back.\" and \"Stop being such a b****\" You get the point reddit, I don't need that, nor deserve it. I'm a mixture of emotions, but hey -- At least I can romance MacCready or Danse on FO4. Haha.\n\nTLDR; broke up with him, told him he was being a sexist pig and I'm at my parents, currently romancing MacCready/Danse on FO4 (Ha).",
        "permalink": "/r/relationships/comments/57o3in/update_boyfriend23m_has_implied_that_hed_leave/",
        "comments": [
            "Oh fuck that dude. My ex was the same way, telling me I'm too old to be playing on my PS4. He was a controlling freak. Have an amazing bf now and he plays with me on PS4. You'll be ok and you'll find someone better.",
            "Boy habits? Does he realize this is 2016?\n\nI'm a 68 yr old Nana (wife, and Mom too!) and I play video games on my PC! Have been playing video games for years!\n\nNo guy in my life has ever complained about the gaming or that I've ever \"morphed\" into a \"boy\".\n\nGood for you! :)\n\n\n*Nana internet hug*",
            "I don't know what is is with some 'gamer' guys it's like they love the idea of a girl who plays games but it has to be to this completely rigid schedule in that it needs to be only games that they deem worthy and you can't be better than them or like it more, but you also have to be an expert or otherwise you are just a 'gamer gurl' ugh. \n\nAs an aside, it's a real damn tragedy that you can't romance Nick Valentine, but Danse is a nice consolation prize.",
            "Fallout 4 is amazing. I'd jump in front of a car for my husband, but if he tried to suggest I stop my video games I'd probably push him in front of one.\n\nThere's this weird thing with guys who like video games- some of them pretend that your devotion to them is the hottest thing ever, but the moment they find out it isn't just a hook to get them interested and that you REALLY like them? They get all shitty about it. Thankfully dudes like that are the squeaky power-armor that get the grease, and there are a hundred rad guys to replace them that actually WANT a girl who has fun doing nerdy shit. \n\nAlso the measure of a person who is worth sorting things out with? They DONT go from \"I love you take me back\" to \"What's wrong within you you worthless whore\" every thirty seconds.",
            "Now you have to admit that all that gaming takes you away from your more important duties in life: waiting on him hand and foot, cleaning his toilet, and providing him with one-sided sexual favours. I mean, it's not like you're a real person with interests of your own; you're not male.",
            "The PS4 would have been the start.\n\nGood thing you got out now!",
            "Good. If he says lovey stuffy stuff to you, and if you start to melt, read your last post. Have fun with your hobby!",
            ">And 'Just telling me to quit my boy habits'.\n\nWhat an expletive deleted! I'm glad you chose your console over more of that.",
            "How long were you guys together? He sounds like a misogynist pig. Good job on leaving. ",
            "MacCreedy has too much baggage IMO. I'd go Dance.",
            "Good riddance to the turd boyfriend. I mean seriously, he really thinks calling you a b**** is going to make you go \"omg, you're so right honey!  I love you!\" Urgh.",
            "'Listen to him and do what he says' wow okay no I'm glad you got out of there ",
            "As a 26 year old woman who not only plays video games pretty much whenever I can, but also bonds with my husband through video games every day as well: I'm so glad you dumped him and didn't let him try to change who you are. Video games brought my hubby and I together and the fact that your ex thought you had to grow up and stop playing them and that it was too boyish of you is silly.",
            "Dude. My husband doesn't care how much time I spend on FO4, Elder Scrolls, Witcher 3, etc because those are ways I get my stress out. I don't drink, I don't like bars/pubs, and it is so removed from what I do in every day life, gaming gives me a chance to completely get lost in another world (I also do this with reading). It's called self-care! Glad you dumped him. ",
            "Glad you dropped him, you aren't addicted and he's a butthead. Find you a man who lets you squee over your videogame boyfriends. ",
            "PS4 is awesome, who needs boys?",
            "Good for you! Now romance that sexy mercanary!",
            "Just to clarify, you have your PS4 right? He doesn't still have it?",
            "I'm 34f I like my games too, I'm not boyish cause of it, you made a good choice.",
            "I also romance MacCready/Danse, if you want some cool fanart I'm your girl :P",
            "Good for you.  My ex used to make fun of me or stomp around if I even played for a minute.   Joke on her, my new gf rubs my shoulders and plays with me.  Find people who like who you are.",
            "Fuck that shit if a girl made me choose between her and my computer I would choose my computer every time, it doesn't ask me to give up my hobbies because it doesn't \"approve\" of them.",
            "Good on you, girl! Not to lean too heavily on stereotypes, but there are plenty of men who are out there, right now, who are praying that they will meet a gal who loves Fallout. Also, I romances Cait as a female character, I liked her accent :)",
            "God, I'm sorry you had to deal with that. Hope all goes well!!",
            "I approve of this plan. Haaaannccooooockkk.....",
            "I do understand this at all. You think most guys would be STOKED about a girl thats loves to game. Hell I'd be through the roof if i met a chick that plays pc games as much as i do",
            "You made a good choice. ",
            "Good for you. You should do what you enjoy in life, and not have to give in to a control freak. While you're at it, block him on everything in case you're tempted to go back.",
            "I like to play video games too and my boyfriend used to when he was younger but isn't in to them at all anymore as far as I'm concerned. It's good to know there are more gamer ladies out there. Is fallout a really good game ? Never tried it but it sounds like fun "
        ]
    },
    {
        "post_id": "4nwhda",
        "author": "bittersis",
        "title": "[Updated] Due to our living arrangements my older sister [26] F] has become very resentful of my sister [16 F] and I [16 F] spending time with her husband [26 M] over her. It's clearly affecting her marriage but we don't know what we can do to fix it",
        "url": "https://www.reddit.com/r/relationships/comments/4nwhda/updated_due_to_our_living_arrangements_my_older/",
        "score": 2052,
        "num_comments": 123,
        "created_utc": 1465836016.0,
        "selftext": "Original post: https://www.reddit.com/r/relationships/comments/4m1h23/due_to_our_living_arrangements_my_older_sister_26/\n\nBasically, our parents left for Korea two years ago to live closer to our grandparents who were both battling illnesses. They originally planned on staying in America until we graduated High School but due to worsening health conditions they decided to they weren't going to wait any longer. Our older sister stepped up to impress our parents but ended up taking on a little more than she could handle becoming very bitter and jealous toward us, borderline abusive especially with how much time we would spend with her husband.\n\nWe got quite a few PMs that were telling us that things could easily go from verbal abuse to physical abuse so we quickly started to look through our options which were basically move to Korea or try to live on our own.\n\nAfter little bit of research we found out that in our state minors are legally able rent with a co-signature from an adult/parent and as long as the landlord agrees. We turned 17 on June 3rd which I think helped us out quite a bit. So we spoke with our parents about our situation, we made sure not to blame my sister but told my father that we thought it would be best that we moved out on our own to give our sister her life and husband back.\n\nOur parents agreed and we started making calls and within the second day of looking we found a nice cheap single bedroom apartment within our dad's budget. We share a bed now anyways so it's not that big of a deal for us go with one bedroom. We moved pretty quickly through the process, we figured the sooner the better and there was a opening. Our dad flew back from Korea here to help us as soon as we were able to get all the paperwork set in stone. Even though he was extremely upset with my sister, we pleaded her case. And for first time went head to head with our dad a little bit because we understand our parents are cruel and many times unreasonable people and that our sister went through their mental abuse alone while we had each other. \n\nWe must have said something right because he didn't scold her or anything like that. He thanked her for helping us in our time of need and watching over us for 2 years. Which is actually a lot coming from our dad. \n\nWe did end up thanking our sister for everything and expressed how grateful we were to her. To our surprise she actually cried as we were leaving totally unexpected and told us if we needed anything to just give her a call. We wrote her note, which we gave to Frank to give to her later on, not to be overly dramatic but just because we didn't think we could really say everything we had to say in person. We wrote down everything we could possible think of that we wanted to say to her,  about her life, our lives, our parents, how we feel about her, and just some sympathy overall. Basically a big thank you, with some heart to heart. Hopefully one day we can meet back up with her as equals and repay her for her kindness but for now, were just going to do our own thing. We know it'll take more than 3 page note and a little praise from our father to fix our relationship with her but it's a start.\n\nOur father has agreed to keep giving us money to live off of and for rent and told us to continue focusing on our future. His words were to not worry about part-time work and to just focus on school, high education and anything that will improve our college situation before we graduate high school.  We're taking the CCNA certification in a little under 4 weeks and then we'll work on getting any other smaller certifications as well as, \n\nWe did speak with Frank who said we were very brave and mature for taking the initiative and noticing our sister's behavior. He apologized for being unable to prevent her actions and said that he would still check on us and that we were free to text and call him for anything at anytime.\n\nWe've been on our own for about 5 days now and so far everything is great.\n\nThanks for the advice.\n \n\n**TL:DR:** We moved out into our own apartment, our dad came back and thanked my sister for supporting us for the two years and to check out our new place. We left a note with Frank to give to Lily hopefully to give her some perspective about how we actually feel in hopes that someday we can reconnect as sisters.\n",
        "permalink": "/r/relationships/comments/4nwhda/updated_due_to_our_living_arrangements_my_older/",
        "comments": [
            "Wow nice! What a classy way to handle things that note. You've shown maturity beyond your years.",
            "I'm delighted to see this update. You guys made some extremely mature decisions, and behaved with real grace. I know the comments on your original post got fractious, but it looks like you were able to take the best bits of the forum's advice and come up with a great solution. My hat is off to you both, and I hope that as adults you guys will be able to forge a better relationship with your sister, as long as that's healthy for all involved. Kudos on the way you handled your dad, as well.",
            "[deleted]",
            "I looked at the top comment of the original post that was critical of you and in this post you seem to have taken a lot from it. You seem very understanding that sometimes shitty situations make people act in bad ways even if they have good intentions.. As was the case with your sister. Kudos to you for seeing it from a wider pespective and finding a good solution. Good luck.",
            "CCNA, at your age? wow good work - I do networking / run an ISP for a living, feel free to PM me if you guys ever want some free pointers/help :) good luck on your own.",
            "the victim blaming in the last thread was appalling, and I thought so even before you added the edit. ",
            "Wow. I never caught the original, but as someone who also moved out at 17 and has been independent ever since:\n\n**You'll be fine**\n\nYou're adults, you're smart, capable and have some means to survive. You'll make mistakes and that's ok, but I think you'll actually get a bit of a jump on life.\n\nCongrats!\n\n(I didn't leave for a bad reason, I was on the tail end of the age-group who could start school, so wound up going to college at 17 and had to move about 100 miles away from home) ",
            "You two handled that with maturity, grace, and true empathy. Bravo.",
            "Just a bit of advice from a fellow female who lived alone for many years-you girls need to be diligent in ensuring your home is safe. Lock the doors and windows at all times, especially when you are home. Buy some of the el cheapo alarms that let you know when a door/window has been opened and blackout curtains for all windows.\n\n Keep an eye out for anyone suspicious and don't even crack the door to anyone you were not expecting or don't know; demand identification if they claim any form of authority. Befriend your neighbors, especially couples/other women, because they will keep an eye out for you. Good people tend to be very protective of those around them, especially in your situation.\n\n If possible, get a dog, doesn't have to be a big one, just so long as they can bark, acting as a first alert. Stash a few knives around the house, especially in areas you are particularly vulnerable  (bath & bedroom). See if there are any self defense courses offered for women in your area and take them.\n\n I'm not saying this to frighten you, I myself never had any problems, but a little diligence can go a long way in self preservation. Best of wishes to you and yours.",
            "You sound like amazing human beings. You handled this in the most mature and effective and harmonious way possible.\n\nYour kindness to your sister is really inspiring and I cant tell you enough how much I respect you for it. \n\nGood luck!",
            "I am really glad this worked out for you two! All the best. ",
            "I'm glad you were able to move out.  Good luck!",
            "You two seem really cool. You successfully handled it and without hurting anyone's feelings. Hardly seems like you needed anyone's advice.\n\nI guess I can only say two things:\n\n1) Get a cheap camping mattress (Foam or inflatable) and sleeping bag in case for whatever reason you can't share a bed (Like someone gets ill)\n\n2) Learn how to cook proper meals that can be frozen and saved rather than rely on shitty take out and microwave meals.\n\nGood luck and have faith in yourselves!",
            "Sad to see so many people here putting you down when all you wanted was some advice.  Some of those posters went out of there way to twist your words around to whatever they wanted to hear. \n\nWell I think you took the good advice and made the best of things.  I'd say don't be afraid to reach out to your sister and brother in law for help if you need it.  Living on your own can be tough for people as young as you.  Good luck with high school, college, and life!",
            "Glad to see a positive update!\n\nIt was super confusing seeing all the posters who sided with your older sister in your original post. Hope things work out for you!",
            "Glad everything worked out for you all.\n\nBut I'm so unimpressed at how most users chose to attack you and your sister, even when you explained things further all they did was criticise. Those people should be seriously ashamed of themselves.",
            "I'm really glad you two were able to get out safely before anything bad happened between you guys and your sister.\n\nI think the first post got completely out of hand with the victim blaming, even before you posted the edit so I'm glad you guys could find a few bits of solid advice to work with.\n\nKeep working hard, getting the CCNA at such a young age is incredible hats off to you, as someone who works IT there are men in my office in their mid-thirties still trying to work toward it.\n\nYou two are inspirational!",
            "Glad you girls could.move out and focus on school. Your last thread became a ridiculous shit show of the reddit community so hopefully this one will be civil",
            "Wow. I'm rooting for you two and hope for another update! You are very lucky to have this amount of support. Your parents are setting you up to be extremely successful in life",
            "This truly brought happy tears to my eyes for so many reasons. As already mentioned you and your sister are amazing young women. I know many adults who wouldn't have handled that situation with nearly as much maturity and grace as you both did. I'm impressed with your whole family. Sounds like everyone moved out of their comfort zone and came together to fix what sounds like a long time bad situation.\n\n> We share a bed now anyways so it's not that big of a deal for us go with one bedroom.\n\nMy sis and me did too for quite a while. <3 sisters like we have!!",
            "This worked out amazingly well. You both handled everything with grace and maturity.\n\nI'm really glad you guys decided to write your sis the note, too.\n\nHave fun in the peace and quiet of your new place. ",
            "If this is an indication of your characters and maturity at 17, you will definitely go far.  Bravo!",
            "You girls show a lot of empathy, maturity, kindness and wisdom way beyond your years. I'm glad you were able to move out on your own, get some things off your chest with the letter and keep your Dad a bit more mellow during the transition. I hope everything is smooth for you both now, sounds like you are certainly mature enough to handle being on your own. I was out on my own by 17 as well and it's kind of young but if you seem capable, congrats on the positive moves forward :)",
            "Pharmacy technician is another smaller cert.\n\nCna 2 certs will allow you to work at a hospital and not just a long term care facility. Avoid memory care places like the plague ",
            "Wow great news, good luck with the CCNA.  Hopefully it will migrate to bigger things.  CCNA didn't really help me too much, but at your age having a cert like that shows you can handle coursework and troubleshooting for junior network admins, which is very unusual for a 17 year old.\n",
            "This is amazing. You have made a brave, mature, kind decision -- I'm rooting for you! ",
            "Wow I'm so impressed at how mature you 2 are. Very reasonable and spot on with the critical thinking.   You will both do just fine and have super successful careers and lives. Good luck!",
            "You two seem really cool. You successfully handled it and without hurting anyone's feelings. Hardly seems like you needed anyone's advice.\n\nI guess I can only say two things:\n\n1) Get a cheap camping mattress (Foam or inflatable) and sleeping bag in case for whatever reason you can't share a bed (Like someone gets ill)\n\n2) Learn how to cook proper meals that can be frozen and saved rather than rely on shitty take out and microwave meals.\n\nGood luck and have faith in yourselves!",
            "You two are going to be incredible adults. You're already handling very adult situations like pros. Seriously, thinking back to how I used to be I can't even imagine being so solution based and mature. You two did a great job and I wish you good luck in all of your school endeavors!! ",
            "You are amazing girls. Dont change and you will go far in life.",
            "Excited for you! Depending on where you are, maybe we could become pen pals, so you have support! PM me if you ever need an ear.",
            "...you guys are 17? I can't imagine having the ability to take care of myself, much less make decisions like this, at 16.\n\nYou and your sister are going to do amazingly out in the world.\n\nEdit to fix the age.  Still applies. :)",
            "I had commented on your previous post. This is a really pleasant update, and I am really glad to know that you were able to find the best solution to this problem. You've really shown maturity beyond your years. Its something that I did not see in your first post. \n\nI do believe that due to the actions you took, you will be able to rebuild a relationship with your older sister. She might have flaws,  and you might not always see eye-to-eye, but you seem to be heading in the best direction. \n\nHave fun living on your own, and good luck in the future :) ",
            "Normally I come and here and just see people's lives fall apart. Seeing this outcome is awesome. It was really encouraging to see the way you and your sister handled the situation. The objectivity you've shown in the situation is incredible. I'm glad things are better for you now. I wish you all the best!!",
            "My birthday is June 3rd too!! \n\nGlad things worked out for you. :D",
            "I didn't read all the comments, just wanted to say congrats on good move! Also, after you settle down, think about some part time job, especially in field you go to school for. Having some working experience gives you great advantage when seeking job. Also, experience with people and learning to recognize toxic ones faster (bosses, coworkers etc). ",
            "Great job ladies. I'm glad to see this situation worked out so well as there were a lot of nuances to it if I recall correctly. And I also recall that people were not very kind in the comments. I have parents who are immigrants and stuck in 'old school' mentality too so I know how you feel with relation to your parents and their attitudes. Keep navigating forward as you are, and good luck with all your future endeavors, and be at peace knowing that although they may not be perfect all the time, you have a great and loving family who cares about you, who will support you and be there for you no matter what happens. ",
            "This is very nice and shows a maturity beyond your years.\n\nHowever do not allow Frank to come over without your sister. He should not be 'checking up' on you and/or your other sister without your older sister there.",
            "holy shit! you are awesome and so mature!",
            "Ohhhh no you don't. You don't get to just finish an update with a happy ending. You need to cut someone out, of your life and delete your Facebook at the very least.",
            "You two rule. On the other hand, it sounds like Frank should run for the hills, and soon, before they have a child."
        ]
    },
    {
        "post_id": "4gqgsq",
        "author": "jellyjapanthrowaway",
        "title": "UPDATE My [23F] boyfriend [23M] of 3 years and his family just told me they’re going on my dream vacation and I don’t know how to deal with my jealousy",
        "url": "https://www.reddit.com/r/relationships/comments/4gqgsq/update_my_23f_boyfriend_23m_of_3_years_and_his/",
        "score": 2055,
        "num_comments": 680,
        "created_utc": 1461789252.0,
        "selftext": "Original: https://www.reddit.com/r/relationships/comments/4fo6aj/my_23f_boyfriend_23m_of_4_years_and_his_family/\n\nHi r/relationships. Thanks for all of your advice in my previous post. To those of you giving me information on programs in Japan - thank you! I took all of your advice to heart, but unfortunately I already have a job in the STEM field lined up to begin this summer and programs like those are not in the realm of possibilities.\n\nAnyway, on to the actual update. I talked to Jack the night after I made my post. I told him that I knew his parents meant well by it, but the way they were constantly filling me in on the details of their trip made me more sad than interested. At first Jack didn’t understand what I was trying to say or why hearing about the trip would upset me; when I reminded him about my rejection from the study abroad program and the time he’d spent helping me work through that, he was able to empathize a little more. \n\nJack told me he recognized that his parents were, albeit indirectly, being rude by going out of their way to tell me about the vacation. He said that gushing so much about a vacation to anyone who wasn’t going was insensitive and if I asked them politely they would tone it down. Unfortunately, he refused to talk to them himself. I’d requested that he do so to get things resolved a little more smoothly, but in the end it was up to me. \n\nI decided to call ahead and visit Jack’s parents privately to have the conversation, instead of during or after one of our dinners (that would have been awkward). I broached the subject with his parents by saying that I appreciated their thoughtfulness in trying to keep me updated on the vacation planning, but that travel to Japan was still a sore subject to me and hearing about it made me sad. I spoke for a while about my dream to travel there, the study abroad, and how I was very regretful that the experience had impacted me so strongly. It was incredibly selfish of me to get jealous so easily, and I planned to work on my sensitivity in light of the issue. I had hoped that by making the conversation more focused on my behavior than theirs, it would deflect the blame from them and feel like less of a direct attack. It did not work so well.\n\nThroughout my whole monologue, they were completely silent. As soon as I finished, Jack’s mom said quite coldly, “I’m sorry you’re offended.” I kept the conversation going for a few more minutes, trying my hardest to reiterate that it wasn’t their fault, but I received only short, cold responses. Jack’s dad did not speak at all and walked out of the room as soon as I stood up to leave. Before I left I thanked his mother for speaking with me and said I’d see them at dinner during the week. Her only response was “we’ll see.” \n\nWhen I told Jack about the confrontation, he was confused by their reaction but changed his stance on the whole thing. Now he’s saying that I was being unreasonable from the start and I should’ve been able to tell they would take it poorly as it was rude of me to mention it to them at all. He insists that they would have had the same reaction if he had told them instead of me. \n\nOver the course of the week Jack’s parents never contacted me about dinner, which the four of us usually have together weekly. Our dinner dates are always on Wednesday, so yesterday I decided to take the plunge and give his mom a call. I asked if she was still on for our usual Wednesday dinner and told her I’d been wanting to make a new recipe for them to try for a while now. She said, “sorry, that’s not going to work.” And that was the end of the conversation.\n\nSo here’s where I am now, hurt and completely confused. His parents are ignoring me completely and my relationship with Jack is strained since he vehemently denies supporting me at all. I’m at a loss for what to do here. I don’t know why either of them reacted like this. Any advice is appreciated, as always, but I’ve decided to just see if time will mend the wounds. In the meantime, I’m reconsidering my relationship with all three of them. \n\n**EDIT**: Jack's mom called me on the phone a couple of hours ago. In a nutshell, she told me very spitefully that they brought it up to me so frequently to make me jealous. She said they were hoping I would eventually break down and beg them to pay for me to come - that way they could show Jack that I am of a lesser social standing and \"not a good fit\" for him. Then, she basically broke up with me for Jack over the phone (wtf?). I am honestly at such a loss here, maybe this was just a lie she made up because she was offended but even so it's incredibly hurtful. I have no idea if Jack knows about any of this but I don't care, I am done with him and them, I do not want to be associated with such classist, manipulative people. This was such a terrific waste of three years of my life.\n\n**TL;DR** talked to boyfriend, he understood but wanted me to tell the parents myself. They were upset, Jack has apparently taken their side, and parents have avoided contact for the past week.  \n\n**TL;DR update** Jack's mom called me and claims they wanted to make me jealous enough to beg to go on the trip with them so that Jack would see how poor I was and break up with me.",
        "permalink": "/r/relationships/comments/4gqgsq/update_my_23f_boyfriend_23m_of_3_years_and_his/",
        "comments": [
            "Just read the update.  Just remember, you are a young bilingual woman entering a STEM field with your entire future in front of you! You'll make it to Japan someday and with a job lined up, probably sooner than you think! And Jack... well, Jack is a 23 year old man who just had his Mommy break up for him.",
            "> they brought it up to me so frequently to make me jealous. She said they were hoping I would eventually break down and beg them to pay for me to come - that way they could show Jack that I am of a lesser social standing and \"not a good fit\" for him\n\nThat is just... surreal.",
            ">  Unfortunately, he refused to talk to them himself.\n\nLet that stand as a big red flag in future relationships.  If Jack's not willing to take the lead in dealing with his parents over something this innocuous, even if he understands where you're coming from, how can you trust him to have your back if they do something that *really* makes you uncomfortable?",
            ">Jack's mom called me on the phone a couple of hours ago. In a nutshell, she told me very spitefully that they brought it up to me so frequently to make me jealous. She said they were hoping I would eventually break down and beg them to pay for me to come - that way they could show Jack that I am of a lesser social standing and \"not a good fit\" for him. Then, she basically broke up with me for Jack over the phone (wtf?)\n\nWell, now you know they're spinless snobs, you can move on and find better people and given how shitty these people are, that will be very easy for someone as good as you.\n\nJack must have known they didn't think highly of you, that's why he refused to speak with them.  He didn't want to go against them.\n\nIt's a shame that out of the four of you, you were the only adult.",
            "I think it was crappy of him to put you in that situation. What could have been a quiet comment from him turned into a huge awkward monologue from you.\n\nI am sorry that his parents responded so coldly, and given Jack's response to you after *he told you to confront them*, I would move on.",
            "> In the meantime, I’m reconsidering my relationship with all three of them.\n\nthis is the only thing that makes sense now. honestly though, the relationship should have been over as soon as Jack decided that you weren't important enough to him to stand by you and told you to face his parents by yourself, but especially now that he's trying to throw you under the bus to his own family.",
            "I'm married and I have a child. My husband and I are in our 30s, and we have dated and dealt with all kinds of crazy dynamics as well as ups and downs. I'm saying this so you will understand the background in my piece of advice on this:\n\nJudge everyone by their actions. Not your intentions. You've been with your BF for 3 years, and I am sure at this point, you are looking at him through a serious lens to determine if he is \"lifelong\" material. This is a decision that should NOT be made on love. It's should be made on:\n\n- Similar/compatible religious beliefs\n\n- Similar/compatible family planning beliefs\n\n- Similar/compatible financial planning, practices, and beliefs\n\n- Similar/compatible extended family viewpoints, interactions, and beliefs\n\n- Mutual respect\n\n- Teamwork (I know this sounds funny as hell, but it's true)\n\nThere are a few other items that will make or break a long term relationship, but I'm sure you get the jist. In this, your BF kind of failed. \n\nFor starters, he fed you to the wolves. You had a legitimate concern with his parents. Your emotions and feelings were valid. Were they easy emotions? No. But they were real and they were valid. Instead of manning up, taking responsibility, and doing what was right for you and your relationship, he took the easy way out. He told you to take care of it. \n\nSecondly, you did. When you did, they were cold. You can't really do anything about this. I think putting the emphasis about you and how you need to work on yourself and requesting compassion and understanding was brilliant. That shows maturity and the search for growth. I like that. But they didn't handle it in an adult manner. They got quiet, passive aggressive, and dismissive \"We'll see\" is right up there with saying  \"nothing\" when asked \"what's wrong\". That's what petty teens do. \n\nThird, Jack basically gas-lit you when you told him what happened. First, he tells you to handle it. So you do. Then he tells you by doing what he told you to do, you were rude to do anything at all! \n\nFourth, the general consensus I'm getting from this is that his parents and him are acting as if you should have \"shut up and colored\". That pretty much means that you should have ignored your own valid emotions and feelings and put stock and value into theirs over yours. Their need to tout and gloat about the trip and his need to appear as the golden boy with the submissive girl. No one. And I mean NO ONE respected you, your emotions, or your feelings in all of this. \n\nJudge people by their actions. Not your intentions. Not what you hope they could be. You can't fix people, you can't change people, hell you can't even persuade people most of the time. People are going to treat you however they think you should be treated. Right now they think that you were rude for having emotions. They think you were wrong for voicing your opinion and need. Think about that very hard because that behavior won't magically go away over time. \n\nUnfortunately you now have a bigger problem on your hand than just this trip. Often this is also how these things are uncovered. The trip looks like the catalyst of the opening of the proverbial can of worms. \n\nSo what do you do? \n\nWell......\n\n1. Decide for yourself now how you deserve to be treated. What's your self worth? \n\n2. Decide for yourself now if this behavior is acceptable to be an ongoing behavior. If it's not, decide where your line in the sand on this is.\n\n3. Sit down with your SO and have a talk about the validity of your emotions on this. I.E. Tell him your emotions and feelings were valid. Make him explain why he believes they are not or why he isn't valuing them or treating them as if they are important (saying \"I am!\" isn't. His actions are beyond showing otherwise.)\n\n4. Decide if you want to move forward with trying to repair the relationship with his parents. This does not mean rolling over. If you know you are right, then you are right, stand firm. But understand you can only meet them halfway. If they are unwilling to try, you can't do much else and will need to respect that. \n\n5. Figure out now if this is how Jack is planning to \"support\" you in the future. Cause I have a feeling that when it comes to his parents, who could one day be your in laws, he may turn into a son instead of a husband around them. Go check out /r/justnomil for what that future looks like. \n\nI'm not going to say dump him or stay. But I will say you need to give this it's due diligence and think longterm. \n\n",
            ">Now he’s saying that I was being unreasonable from the start and I should’ve been able to tell they would take it poorly as it was rude of me to mention it to them at all.\n\nHe can't seriously claim that what you said was rude, but that his parents bragging about their ability to take an expensive trip that you can't was not. This is more then just picking their side, it's denying reality. \n\nI suspect that for whatever reason his parents don't like you and didn't want their son to date you.  This isn't your fault, they just seem like shitty people.  From your last post any reasonable person would not have repeatedly bragged like they did if they had any consideration of another persons feelings.  If you got a new phone and knew that one of your friends really wanted one but couldn't afford it, would you go on and on about how great it was to them each time you saw them?  Would you talk about how great and well paying a new job was to someone who had recently been laid off from theirs?  We all know that those things are asshole things to do.  And they didn't do this just once- they announced the trip to Jack in front of you, and kept on talking about it each time they saw you.  This was intentional. \n\nBeing rude in the way they were pushes you to confront them or avoid them and then they get to point (like they are doing now) at you, as if you standing up for yourself was the problem.  Remember it wasn't. If Jack can't see how awful his parents treated you then you are much better off without him.",
            "Wow just read the edit, that is one of the *shittiest* things I've seen. I know the \"you dodged a bullet\" thing isn't enough to make you feel better.... but shit, you dodged a bullet. \n\n>I have no idea if Jack knows about any of this but I don't care, I am done with him and them, I do not want to be associated with such classist, manipulative people. This was such a terrific waste of three years of my life.\n\nI'm really glad you're taking that view. Fuck Jack, from the moment I read that he wouldn't talk to his own parents I knew he was a twit. Stay strong OP.",
            "WOW.\n\n\nI'm really sorry that you've encountered such douche bags in general.   You didn't waste time on them but learned some very hard lessons.   You don't want to be with anyone like that, and before I read the edit, I was going to suggest you wash your hands of the entire family.  It seemed like they wanted you to be jealous and were bringing it up purposely.\n\n\nMove onto better things.   Most people are not like them.",
            "[deleted]",
            "Wow, bullet seriously dodged there. I'm seriously grossed out just by reading that.  ",
            "Honestly it sounds like behavior I've seen from more wealthier people. They go on these expensive trips all the time, they have huge banking accounts.\n\nBut they get offended so, so easily. Even when it's something as simple as \"please don't flaunt\" it's suddenly a grave, offensive slight towards them and their family image/reputation.\n\nNot everyone is like that and I've seen people on the lower ends of economic prosperity get offended over bizarre things as well, but this isn't too surprising. A very real possibility that they're the type to do this - Jack suddenly joining in shows that too - and... Yeah, it happened.\n\nI'd definitely reconsider it. They're not likely to apologize. They got offended at what you said despite a hefty chunk revolving around your issues, not theirs. I doubt they'd have the integrity to apologize - you'd be the one to do so. \n",
            "Here's the thing. You've been dating their son for 3 years and having dinner weekly for much of that time, but yo u have never been included in a vacation. If they were cash-strapped, I'd get that they couldn't pay your way,  but even then, I would have expected you to be invited. Since they're rich, I'm suspicious that they have been polite, but never fully accepting. They may have always expected him to drop you for one of their \"kind\". This vacation is a convenient wedge they discovered and are choosing to exploit. ",
            ">they brought it up to me so frequently to make me jealous. She said they were hoping I would eventually break down and beg them to pay for me to come - that way they could show Jack that I am of a lesser social standing and \"not a good fit\" for him. Then, she basically broke up with me for Jack over the phone \n\nTwist ending!\n\nThen in light of this new info, you are much better off without them. \n\nDo NOT answer if he calls. ",
            "Wow so that really blew up in his mom's face hey?  She was expecting you would be the type to be looking for something from them and when you weren't she couldn't handle it. \n\nShe sounds like a real asshole.  \n\nThe Great news is that those assholes can have one another.\n\nI'm so impressed with how you handled yourself.  It truly wasn't a waste of three years even if it feels like it.  There were probably lots of good times and you have an excellent idea now of what kind of family you don't want to marry into.\n\nYou wouldn't know it from reading this subreddit, but there are lots of well off dudes with kind families.  I'm not saying you're looking for a well off guy, but more that you don't have to avoid them or judge them all by this experience.  There are a-holes in all walks of life.\n\n",
            "Holy crap that Edit is the most fucked up thing I have ever read. \n\nThis whole time I was kinda thinking \"look they're a bunch of weirdos, you should just tell them you feel bad because they probably think you enjoy listening to their planning since you're interested in Japan.\"\n\nAnd then I read that you sat them down and told them and they were being weird and I thought \"Ok, they're probably just really embarrassed because they know they were behaving badly.\"\n\nand then I read that edit. I mean, wow. What fucking cancerous people. Human garbage, be glad they are out of your life. Thank god this happened now and not when you're on a marriage track. You're 23, you have a bright future ahead of you and you've learned a valuable lesson about assholes from some of the biggest in the world. Nothing can stop you now, brush it off and keep your head up because they're not worth a second thought, and neither is Jack unless he truly had no idea and can FULLY understand the gravity of what his parents did to you and deals with it accordingly. ",
            "That child had his parents break up for him. If not by actively telling them to do so then by being passive as they did. Holy shit. \n\nMy mouth was agape reading your entire post. Nobody should treat you like that ever. You just met a guy with a really shitty family and unfortunately it came to a head. Sorry - nothing against you. Just how it played out. You didn't do anything wrong. You were just you.\n\nInternet hugs.",
            ">Jack's mom called me and claims they wanted to make me jealous enough to beg to go on the trip with them so that Jack would see how poor I was and break up with me.\n\nwhat. the actual. fuck.",
            "Oh my god what three sacks of shit you are no longer weighed down by. Imagine their bewildered rage at being confronted with such goodness and honesty from someone they believe is so far below them. ",
            "Old country saying :  \"These folks think their shit don't stink.\"     \n I think you are wise to reconsider your relationship with them because they are severely lacking in empathy.  Give them time to process that they were being rather insensitive to you and that you were doing the best you could to nicely ask them to tone it down.  Next time just say \"for petes sake stifle it.  I can't go to Japan and i'm tired of hearing about your vacation.\"  Sometimes blunt works better than sensitive.",
            "I can kind of understand their reaction, but they're being really immature about it. It's unfortunate and they are handling it poorly, but it's possible they were genuinely excited and thought you would share that, and now they are hurt and disappointed that they can't. Maybe they are embarrassed as well. Or upset that now their happy trip is marred by negativity. It's not right of them to be refusing to talk to you and not making an effort to continue normal relations even if they are upset. Perhaps you are right and time will help mend the wound - if it happens quickly, I personally would be willing to forgive and forget their bad reaction and move on.  \n\nJack, though? He told you that you were perfectly reasonable and should talk to them, and now is telling you that you're unreasonable and should have never brought it up and that everything is all your fault. I would be so incredibly pissed off at him right now.   \n\nIf he really thought it was a bad idea, he should have said something - otherwise, what he just did was set you up to fail and ruin your relationship with his parents. If he did not think it was a bad idea and is now just saying so because they are mad, then he's a spineless asshole who is throwing you under the bus just so he can suck up to his parents. You and he need to have a very serious conversation about his actions in all this. ",
            "If I were you, I wouldn't have said anything. Sometimes you just have to suck it up, recognise that you're not being particularly rational, and stay on the right side of people. \n\nThat said, it sounds like you were incredibly respectful, polite and non-accusatory... so I don't really understand your boyfriend's parents' immature and cold reaction.  At this point I would write them - and your boyfriend - off as assholes to be honest. You've been with your boyfriend for three years, so he should absolutely not be blaming you for this or being a dick about it. He should have talked to his parents when you asked him to.\n\n",
            "The way I sense this is that the parents never liked you too much to begin with - possibly because of the wealth imbalance. Once you did one thing wrong, it compounded their negative feelings towards you.\n\nThe 3 of them are a bag of dicks. If they are so rich, they could have afforded for you to come on their dime. Your boyfriend has no spine and is still a child. He obviously takes his parents' side over yours. At best you have a few more months time with this boyfriend. His parents will influence him further away from you.\n\nIf he goes on this trip (A very likely scenario it seems), you should break up with him. I really see no future for you with these people.",
            "So people keep bringing up the fact that the parents could have brought you along to be a translator. It might be better than nothing, but it isn't actually a great idea. \n\nA. At some point you would want a break. It would be so tiring for you to translate for the whole group and be their employee. And if you are with your boyfriend, there is no doubt that you would want at least one night off to go be with him. What would the parents do then?\n\nB. How can they actually make sure you speak the language as good as you say you do? You might be amazing for an American and have gotten straight A's but an actual Japanese person will almost always be better than you.\n\nC. Same with culture. You may know A LOT about the culture, but a Japanese person would know a ton more. If a native told me how to behave in a restaurant, it would be an interesting cultural exchange. If my son's girlfriend told me how to act in a restaurant, I would be pissed.\n\nLook, I know for a fact that you will go to Japan one day. You have the drive and passion and money will start rolling from your STEM degree. It would be different if you could never ever go in your life time. I understand your feelings, but you made waves when you didn't have to.  ",
            "This whole thing seems extremely contrived. Especially the edit. SO's mother is written like a caricature. ",
            "This story doesn't add up.",
            ">She said they were hoping I would eventually break down and beg them to pay for me to come - that way they could show Jack that I am of a lesser social standing and \"not a good fit\" for him\n\nWhat the fuck dude.",
            "> I have no idea if Jack knows about any of this but I don't care, I am done with him and them  \n  \nI am happy to see that you are thinking exactly what I would suggest :)  \nYou have lost nothing of value, it may hurt right now because it's too fresh but eventually you will see that this was in fact the best possible outcome. You were civil, you tried, they were assholes but oh well, these people exist in life. It's good that you're done with them.",
            "Woooooow. What a piece of work. You'll make it to Japan some day OP and thankfully it won't be in the company of these miserable excuses for human beings. Good luck with your job! ",
            "What a horrendous, toxic family. I hope you are able to move on from this in your own time, at least they all showed their true colours before it was too late.",
            "Just read your update. My jaw dropped. These people are horrible. They may have money, but they will never have class.\n\nSeriously, OP, you have more class in your pinkie fingernail than all three of them put together. If anyone is \"lesser\", it's these selfish dipshits. You sound like an amazing person. \n\nThe good news is that while things feel like shit now, and understandably so, you're going to go on to have a great life, while they are going to stew in their own bitter, hateful juices with no hope of improvement.",
            "[deleted]",
            "Jack is a coward and his parents are being insensitive and cruel. It sounds like the whole family is emotionally stunted, they don't deserve to have you in their lives ",
            "It sounds like you've stumbled upon a nest of assholes. Unfortunate, that. \n\nI can see where your boyfriend gets his tact. \n\nEdit: HOLY SHIT THEY'RE EVEN WORSE THAN I THOUGHT. God help *any* woman who marries into that family. Jesus fucking Christ.",
            "Holy shit what a trio of clueless douchebags. Well at least, now you know they were doing it on purpose. Please get away from this little boy.",
            "Not sure how well this will go down here, but I really don't think you should have said anything.\n\nSure you want to go to Japan yourself and it's OK to envy their holiday but to actually make that their problem is quite immature. I can't imagine what you expected to come of your chat with them? You admitted it wasn't their fault, you admitted you were being incredibly selfish and jealous yet you still acted on it and made them feel like they had done something wrong? If you knew all that you should just have started working on it.\n\nI think you have shown them you are immature and unable to deal with quite an easy issue in a reasonable way and they are just shocked. The way you dealt with it comes across as incredibly self involved. They probably thought you would be interested in hearing about the trip as you love Japan, as any reasonable person would be in your situation.\n\nMy advice is to apologise. Explain that you realise how childish you were being with your request and hope you can win them back around. I suggest you show an interest in their trip and give some advice or suggestions about things they should do etc.",
            "Fuck'em. If your boyfriend is gonna be a pansy and not defend you who will? He's your *significant* other. Your other half. Your partner. And he can't simply try to reason with his parents? C'mon. Their whole family is acting like some pre-teen ninnys. ",
            "I am so sorry. You were incredibly mature about this entire situation and I can't imagine the hardache you are dealing with.",
            "Do not regret the loss of 3 years, you didn't lose them, you learned from them.  I will quote of all things, Bob's Burgers, the pain you feel in your chest is not your heart broken its your heart growing.  I wish you the best! someone get a gofund me started for a trip to japan for a certain someone, just sayin",
            "Your bf is a coward when it comes to his parents. Not a shock since he plans on riding the gravy train his whole life",
            "Amazing and horrible. In your original thread someone convinced me that they could have good reasons for things like hiring someone else to be their translator. They could have, but they didn't. They probably booked the trip in the first place to mess with you. \n\nThey are the ones who are classless. I guess money doesn't buy manners.",
            "I just... have the hardest time believing someone would plan an elaborate trip to a destination on the other side of the world.. as part of a game to make a person seem lesser in the eyes of their son... and then call that person and tell them of their plan.\n\nPlease, reddit, someone, anyone.. am I alone in this or does anyone else find 75% of the non-standard r/relationships stories to be total BS?",
            "The way your boyfriend's parents behaved was childish and they should be ashamed of themselves. I get the feeling they like flaunting their money and what they can do with their money and didn't like actually being called out on it.\n\nThe biggest problem in this situation, IMO, is that your boyfriend wasn't willing to go to bat for you. I'd say that's a major red flag. I get the feeling he didn't want to confront his parents because he likes their money and doesn't want the gravy train to stop. He seems like a selfish prick who has a lot of growing up to do.\n\nYou deserve so much better, like someone who will defend you and completely have your back when others, even their own parents, mistreat you. I think you should ditch Richie Rich and his snobby as fuck parents.\n\nI hope that one of these days, you can go to Japan on your terms and do everything you want to do/see everything you want to see. I hope when that day comes that you have the time of your life! ",
            "Everybody wants to believe that they are nice, thoughtful people.  Sometimes people don't realize when they're not.  You approached them and respectfully told them that this conversation was actively hurting your feelings.  The adult reaction would be to apologize, and move on.  Their reaction was to act like you were the problem. These people are douchebags.",
            "This is why you don't follow through with the advice you get from /r/relationships",
            "AYE YO IGNORE ALL BULLSHIT BELOW ME:\n\n**Ultimate edit x2: FUCK THAT FAMILY. I guess it's my fault for giving them the benefit of the doubt due to cultural differences. Classless parents raising a coward son is what they are!!**\n\nI'm confused here. \n\nBefore anyone down votes this I'm not attacking OP's maturity. I understand that she admitted fault in feeling jealous and that she is being \"petty\" (her words, not mine) about the whole situation.\n\nBut, can somebody explain to me why the parents are at fault for being offended? I come from an extremely strict background but I've gone against my parents (Chinese culture) many times but have also respected them in cases when it comes to relationship. They've hated and loved past GFs. It sounds like OP is making something out of nothing when she confronted them about their vacation plans. Is it their fault that they're going on a lavish vacation to Japan? While I understand that she wanted to go to Japan for a while now, she's not required to sit on the side and listen to her parents if she ultimately feels that uncomfortable, and that is what led to the parents getting offended. It may seem small to us, but to them it could be a sign of disrespect from a potential daughter-in-law.\n\nI think without understanding what culture her parents are from, you cannot conclude and judge that their parents have shown their true color. Perhaps in their culture, her confrontation with them was a sign that they don't want somebody with such jealousy to become apart of the family.\n\nEdit: It looks like I'm getting down voted already. Which is fine. But for those that disagree with those comment at least come up with an explanation? I understand where you're coming from that boyfriend (or potential wife/husband) should always stick up for you vs your parents. Unfortunately that type of thinking doesn't apply to older generations of certain cultures. Once you've offended them they'll be cold to you and does not want to see you as apart of their family. \n\nEdit 2: And for anyone saying that they're being pity, what would you do if you your future son/daughter-in-law did something to disrespect you? \n\nUltimate edit: In the end I think OP is maturing and have admitted that all this is pretty much based on her jealousy and past history of not getting into a program in Japan. It sounds like she has her head on straight. Regardless of the outcome, I hope she gains a lot from this and that she one day gets to go to Japan. \n\n",
            "As someone that didn't read the original story until now, my first thought was that Jack's parents were talking about the trip so much to make you jealous. They KNEW how much you wanted to visit Japan and could have afforded to bring you along. It also didn't fit their typical vacation plans. If they cared so much about trying to \"bond\" with you, they would have just invited you to go along with them. Many of my college friends take vacations together with their significant other, along with their family. It's normally a great way for the other person to feel closer to the family.\n\nWhen I read your update, Jack's parents' reactions said it all. They just never expected you to talk to them directly and confront them about the issue. I don't think that you did anything wrong here. Jack wasn't willing to talk to them for you and you attempted to maintain a good relationship with his parents by communicating with them your concerns and hurt.\n\nIt's unfortunate that Jack wasn't willing to stand up to his parents for you or to talk on your behalf. He was supposed to be the one to do so. On the bright side OP, you've dodged a bullet! I have a feeling that Jack's parents have been hinting to him that they didn't approve of you anyways, given his reaction. Also, shame on Jack's parents for having no class at all. How mean can someone be to plan a vacation, based on someone else's dream vacation and then rub it in their face for months!",
            "I'm still utterly baffled by this. Why would you bring this up with his parents? They're going on a trip you'd like to go on and therefore they shouldn't talk about it? You're a grown-arse woman OP, fucking act like it. Will this be response to issues like this your whole life? Any time you're jealous of others you'll ask them not to talk about the thing you're jealous of so as not to cause you discomfort? Your BF's parents were exceedingly polite considering your shocking manners, I would have laughed you out of the room. Grow up.",
            "What a messed up family!",
            "Phew.... sounds like you dodged a big bullet there with that family.",
            "Wow. That update is unbelievable. Good riddance, I am so so sorry.",
            "༼ つ ◕_◕ ༽つ DUMP HIM ༼ つ ◕_◕ ༽つ",
            "So, you lost a spineless mommy's boy with insane parents. Honestly kinda sounds like they did you a favor.",
            "What incredibly horrible people. Move on, work hard, save money, go to Japan on your own terms. It's not going anywhere, you have time :)",
            "What a strange thing to say. I mean, if she really were manipulating you, she wouldn't just call you and tell you all about it, not unless she'd know you were already in an inescapable situation and wanted to gloat. In which case she'd probably break up with you for Jack and then bring it up. If she did try to manipulate you and it just didn't work, she just had the perfect thing to switch to: tell Jack all about how you're such a bitter and ungrateful person. A longer game, sure, but she probably could weave something out of that.\n\nOn the other hand, if she weren't manipulating you, and was just offended that you wanted her to tone it down because she wanted to make you plain old jealous, why would she make up something that makes her look even worse? Admitting she wanted to make you jealous is much less horrible than admitting she wanted to make you jealous because you're inferior and her son deserves someone better.\n\nWhat an utterly weird situation and family. Glad you're out of all that. ",
            "WOWWWWWWWW.\n\nI know it feels terrible now, OP, but man did you ever dodge a bullet. What kind of elitist psychopaths would pull something like that? And let's not even get into the f-ed up fact that Jack wouldn't even talk to his own parents about this (I bet on some level he knew) and then let his mom break up with you for him? L O L @ his immature ass.\n\nYou sound like a wonderful girl, and I hope you get to go to Japan someday soon. Good on you for being done with this family and its dysfunction.",
            ">EDIT: Jack's mom called me on the phone a couple of hours ago. In a nutshell, she told me very spitefully that they brought it up to me so frequently to make me jealous. She said they were hoping I would eventually break down and beg them to pay for me to come - that way they could show Jack that I am of a lesser social standing and \"not a good fit\" for him. Then, she basically broke up with me for Jack over the phone (wtf?). I am honestly at such a loss here, maybe this was just a lie she made up because she was offended but even so it's incredibly hurtful. I have no idea if Jack knows about any of this but I don't care, I am done with him and them, I do not want to be associated with such classist, manipulative people. This was such a terrific waste of three years of my life.\n\nWell perhaps you dodged a bullet by staying with a guy who won't speak up on your behalf about a topic that is upsetting you [I think that your jealousy, while isn't necessarily right, is completely understandable but something you need to work on perhaps - but it was hurting you for valid reasons non-the-less and he should have spoken up about your discomfort to his parents] *or* who's parents that are actively bullying a 23 year old [in the hopes that it'd end in a break-up]. I mean, you definitely *don't* want to be entangled in that childish and unnecessary drama for life!\n\nI know you mentioned you have a job lined up so it's not possible for you to visit there, but at the end of the day you just need to then realize that it's down to you. We have choices in life and if you are choosing a career path that won't offer you the same opportunities, that is just that: your choice. I am not saying you shouldn't prioritize your career path or that you should be making compromises to be able to see a place you've always wanted to go [trust me, I know that feeling! husband and I are dying to go to Japan ourselves!], but that means you have to also realize that it's possible to visit in time. You just need to work your buns off and save. If you are willing to save hard and make sacrifices, you'll be able to go sooner rather than later. In fact, putting your career first *is* important because the better position you put yourself in, the more likely you'll be able to visit Japan because you'll have yourself in a more stable place. It might not hurt, though, to take a year off and maybe just teach english in Japan if it's that important to you? Taking a year off might set you back career wise, but it also might not [I don't know what your career area is like to be honest]. Perhaps there are graduate degree or study programs where you can go there and still further your education? Worth looking into.\n\n**EDIT** : Also, forgot to add that, while I don't think you did anything wrong when speaking up for yourself, in future maybe just bring it up as/when it happens. In that scenario, you would be giving it more real context [and maybe making it less of a big deal] and at least your boyfriend would have been there to witness it so he'd have a fighting chance of baking you up - as I assume now it'll turn into a your word against his parent's. I.E. they say \"oh we just booked such-and-such activity in Japan! We are so excited! blahblahblah\" and you respond with \"Oh, that sounds fun. Actually, I just wanted to say that I am excited for you guys to have this trip but I am also a bit bummed out as you know I've wanted to go there for some time. I'm being irrationally jealous and I'm trying to work on that, but if you could also refrain from giving me all the details, it would help me out greatly as I end up fixating on what I'm missing out on. Again, it's nothing you've done, it's me and I do think you'll have a great time, I just get too upset knowing what I'd be missing\". Or *something* along those lines - even if you have no intention to work on yourself, etc., it would just be a bit of a formality I guess. Again, just to re-iterate, what you did definitely was't wrong, I just would have gone about it a bit differently. ",
            "I understand that you were/are jealous, but that's your issue to deal with, not theirs.  That is something you should have discussed with a therapist so you can work on the root of your problem.  \n\nYou cannot expect other people to censor themselves to protect your feelings.  That is your responsibility.   \n\nAs for his parents, I wouldn't have you in my home if you came to me with that.  Who knows how else I may offend you?\n\nTake some time for yourself and talk with a therapist.  Who knows how you'll react when they actually go.",
            "Your ex is an asshat.  Send him a link to this so he can read the comments about him being an asshat.",
            "Im really sorry to tell you this, but your boyfriend and his parents are very rude and insensitive. They don't even acknowledge your feelings or try to move on with things. I think you are the one who needs space from them, something tells me that they are committed to gang up against you.",
            "Three years is a little time compared to the lifetime you would've spent with the wrong guy. Hang in there, you will definitely be able to visit Japan one day! Hope everything works out for you, and keep us posted.",
            "Honestly, OP, you made a serious social mistake in asking your in-laws to stop being verbally excited about their vacation JUST because you are jealous. I'm shocked you even had that nerve to tell them that they were upsetting you. What right do you have to rain on their parade? They're gushing about it because they're EXCITED and they felt that you were someone they could share their excitement with, but you basically have shut them down and made them feel incredibly uncomfortable around you. Congrats for that. I'd be uncomfortable around you too if I were them. \n\nWho wants a dictating, sensitive, self-centered, daughter in-law forcing them to censor their talking conversations because you don't know how deal with your own personal feelings? Why punish them for your insecurities, OP? \n\nI don't blame your boyfriend for finding it difficult to stand up for you. He knows your being silly and overly sensitive. He may have been sympathetic since you can't help how you feel, but you or him going to his parents is OUT OF LINE. They are not responsible for your mental well-being and they deserve the opportunity to share excitement with loved ones. ",
            "You were really rude. I don't get why people just can't be happy for others... I know you are upset you can't go but being petty and jealous is not the answer. You'd be at a better place in life when you learn to be happy for others :)",
            "Well that edit was a plot twist.  ",
            "Yeesh, looks like you were right to bring it up with the parents all along. Stay well clear of that spineless momma's boy, that whole family is trouble. You know what, they may have money but honey you have all the class.\n\nEdit: Also, I know you won't do this because you're too nice...but if it was me, I'd wait to break up with him. I'd wait just long enough to teach him the absolute most vile, awful things ever to say in Japanese under the guise of them being useful sayings.",
            "So I have read the OP, update and the subsequent edit. As everyone else has said, the first red flag is Jack not talking to his parents about your feelings. That's absolutely his place to do so, and while you did well in taking up his slack there, his parents are just straight up assholes. I'd steer clear of all of them, and in the future you can look back on this as a learning experience.",
            "As much as I'm trying to believe you, I noticed your post has been edited and it almost appears like while they appear to be spiteful people, can you admit to a degree of polishing this with selfishness  too?  The fact that you're bothered by it and a tad petty with some of the context of your writing?  \n\nPeople want to side with you but it's hard when you've admitted to a sense of immaturity and selfishness glossed over the pettiness from the parents.\n\nI'm not trying to be mean here, but it's hard when it looks like \"poor me\" with the edits and measure of how this impacted a trip to Japan.  I'm sorry, but other trips will come.  You can still go, but I think you're being a bit dramatic aside from the point that his family are ridiculous.  Furthermore, it's weird how you have weekly dinners and then this situation occurred.  It doesn't add up.  It seems there's been some underlying issues that had you stepped back wouldn't have happened and if it's true that the family doesn't like you, there shouldn't have been other times that this raised a red flag and it not boil down to just this one event.  There had to be other issues.  Sorry, but there was probably more to this relationship and the Japan trip.  This was just the one time everything blew up.\n",
            "I have to respectfully disagree with your post. From what's been conveyed it doesn't seem logical that his parents were being \"indirectly rude\".  To a degree, this isn't about your affected feelings.   This is a out two parents who are excited to get a vacation.\n\nLet's take for example someone trying to buy a house and were excited they bought one. It was their first house ever, but you lost your house a few years back and it was either similar to the house this new person bought or even better, in the same neighborhood, but yours was foreclosed due to whatever reason. The sense that people have to \"tone down\" their excitement for other people really doesn't have to be tolerated in cases like this.  Yes, it can be outright annoying when they boast on and on about it, but that's life.\n\nThere are going to be fun and exciting that come you're way too and when they do you'll want the ability to rave about it too... Whether it be a trip to Japan or something brand new on your life.  For a sec, it almost felt like you were unhappy with someone else's excitement (the parents) and approached them about how it affected you. They really don't have to tone it down because of the issue concerning your rejection.  Chances are they didn't think about that when they planned the trip.  In other words, it's not about you.\n\nI know that sounds harsh and mean, but they were extactic  and happy.  This is something that they're very happy about.  Same thing goes for females when they get married and start wedding planning. Would you ever say something to someone about your feelings being impacted if you had issues with weddings?\n\nThere's going to come a time when things will be thrilling for you and all you'll do is rave about it.  When that time comes, are you going to want someone who is affected by it to tell you to \"tone it down\"?\n\nAll of us can have the ability to be excited over stuff.  There is going to come a time where you'll have the chance too.",
            "Wow that update went from 0-get the hell away from that guy real quick.",
            "My MIL tried to do something similar: Invited my husband on a trip-of-a-lifetime and specifically said it was \"for family only\". \n\nI'm not sure how she thought it would work, but she's always tried to use her money to manipulate and control him. Where it would have worked with his brother (he would have left his partner in a heartbeat) my husband just reminded her (for the umteenth time) that I AM HIS FAMILY. \n\nStrangely enough, when DH refused her oh-so-generous offer, no one ended up going. It's too bad, really. She's now dying of cancer, will never get to make that trip, and has completely lost the love of her youngest child. ",
            "Man this thread is cancer.\n\nOP: you were out of line, that's all there is to it. If you actually want an adult big-kid relationship, I suggest apologising profusely for your poisonous attack on their happiness and family holiday.\n\n> I had hoped that by making the conversation more focused on my behavior than theirs, it would deflect the blame from them and feel like less of a direct attack.\n\nThat sums it up - it *was* an attack - you wanted to change them instead of just working on your own issues, and they seem to have rightfully picked up on that fact.",
            "Jack is weak sauce. He can't handle disagreeing with his parents, to the point where he will outright gaslight you and make it seem like he never supported you even though you both know he damn well did. He refused to even talk to them on your behalf about a minor little thing like this. Basically where his mom and dad are concerned, he's got no spine. Is this something you'll be able to live with in future - say, if you two end up married or have kids? Will he be able to deal with it if his parents overstep, or will he automatically take their side against you? Given that he couldn't deal with something small, there's no way in hell he's gonna be good for the big things. It will always be a point of contention between you two unless he grows up and becomes an adult.\n\nFrankly, his parents are no better. Any reasonable person would understand why this was a sore spot for you and would apologize and not bring it up again...their reaction is petty and childish instead. Yikes. They sound like narcissists.",
            "I think this was all blown out of proportion. Seems like a a silly thing to destroy your relationship and ties with bf's family over. ",
            "You made your feelings about other people instead of owning them yourself, and honestly yes that was rude. You don't have to tell people everytime you feel a negative emotion, especially when there is nothing wrong with what the individual is doing and it is not being done intentionally to hurt you. Not only that, instead of making one comment about it, you turned it into a huge big **thing** by making a production about it. ",
            "The mistake you made was taking to heart the sympathy of all the people on this board that sided with you without reservation not realizing that there is a strong bias for the original poster on r/relationships. \n\nNow imagine kind of advice everyone here would give to an OP that wrote: My husband and I are taking our children on a nice vacation but one of our son's girlfriends asked us to stop discussing it in front of her because she is sore that she won't be able to attend.\n\nIt's a dream vacation for you, I understand that.  But you're young and you will have many opportunities to make it a reality.  The only correct thing to have done was to to be happy for your boyfriend's family.  Being sad for yourself makes you appear very self centered. ",
            "Their response is a bit ridiculous ",
            "Ya know - whether you did the right or wrong thing by talking to them privately (I personally think your boyfriend left you no choice and good for you for communicating your feelings to people who supposedly cared about you)!  Either way - they should have the decency to treat you with some respect and not just give you the cold shoulder like that. Says a lot about them if you ask me: ",
            "Sorry hon. It's over. The faster you move on, the sooner you'll realize you dodged a bullet anyway.",
            "Yep, you got yourself some assholes. Mostly Jack though for not understanding and then stabbing you in the back later on. The parents are acting like high schoolers, they can't even pretend to be civil when having a polite, open discussion. They didn't try to understand your point of view and they're still holding a grudge like class A assholes.\n\nI may be reading into this a bit much, but I speak from experience. A 23 year old who cannot speak to his parents is a boy, not a man. That his mommy and daddy have their little boy (and you) over every single week is kinda nice. It shows that they're close. But it's also sometimes a sign that their little boy will always be a little boy who will never grow up. My ex also went over to eat his momma's food every week to the age of 30. When we split he raced back to live with mommy and daddy and has never left.",
            "What a spiteful cow. She will ruin all his relationships until he dates someone SHE deems \"suitable\".\n\nAnd bloody hell she broke up with you FOR him???? I wouldn't be surprised if he didn't know. \n\nHOWEVER having said that, his utter refusal to help you deal with this as a grown up makes me suspicious. \n\nThis hurts now, but honey you've dodged a HUGE bullet. \n\nCome and hang out in /r/justnoMIL for a while to see exactly what you've avoided. \n\nIf he comes creeping back just tell him you are interested in dating a man, not a little boy whose balls are stored in mommy's purse and who has mommy do his dirty work for him. ",
            "Well, at least you found out now that Jack's a weenie before you wasted any more years on him.  ",
            "Honestly when I got to the end of this I just got so disturbed by the obvious lack of empathy and not even any attempt for some sympathy. It definitely reflects on their entire family as people and I'm sure is influenced by their wealth that they may take for granted.",
            "Jack is being an absolute jerk and should have taken the lead in talking to his parents. After all, they are *his* parents. His backtracking is also a serious red flag. How can you be with someone who would so easily change their stance on being supportive?",
            "I think you've just found out that you've vastly overestimated your standing with Jack and his family.  If Jack truly understood your financial situation, he should have shut down the trip offers OR offered to pay for you long before Japan came up.  Instead, he refused to support you.  Your choice was continue to deal with hearing about yet another trip or talk to his parents.  You thought his parents would be receptive to your thoughts and feelings, and neither one cared.  You ended up being wrong about Jack and his parents.\n\nIt was far easier for them to excommunicate you from their lives than to say \"Oh, we didn't realize it was so important to you.  We'll stop bringing up our trips until you're able to join us.  See you at dinner!\"  Neither Jack nor his parents could show you the common decency of telling you to your face their decision.\n\nYes, it's selfish to expect people to dance around your feelings like that...BUT it's also incredibly rude to continue to discuss detailed trip plans when someone has made it's clear they can't/aren't going.  Doesn't matter the reasons AT ALL.  It's one thing to say \"Hey, we're going out of town to COUNTRY on DATES\", but to continually go on and on about a trip in front of someone who isn't going is rude.\n\nI travel a lot and it's just common courtesy to not rub trip plans in someone else's face.  I share the bare necessities and will share more IF ASKED, but I don't volunteer my full itinerary to people who aren't going for whatever reason.  It's like discussing place settings for a party they're not invited to.  Just incredibly rude.\n\nHow can you come back from being gaslighted by Jack?  How do you come back from his parents cutting ties?  How do you come back from Jack not letting you know about dinner?  Even if you wanted to come back from that (you shouldn't!), there's no coming back from this for his parents at the very least - their view of you has already changed.  Jack might want to string you along a bit longer, but who wants to date someone who doesn't care about your feelings and neither does his parents?  What future is there?\n\nHave there been arguments before or is this the first time you actually had a genuine need for something from Jack?  Seems like you \"caused some trouble\" and now they're all done with you now that you're \"work\" to be around.\n\nCut your losses and find someone who actually has your back.",
            "First thing..\n\n>  she told me very spitefully that they brought it up to me so frequently to make me jealous. She said they were hoping I would eventually break down and beg them to pay for me to come - that way they could show Jack that I am of a lesser social standing and \"not a good fit\" for him.\n\nI hate to be that person, but this type of update makes me really question the validity of your story. You have dinner weekly with these people and have always been included/welcomed by them.. and now they were secretly trying to break you and your SO up? And he doesn't care? This is weird enough to be a troll post. But whatever. Suspending my disbelief and moving on....\n\n> Unfortunately, he refused to talk to them himself.\n\nThis is a huge problem. Your boyfriend's parents were doing something that hurt your feelings, and he refused to be the one to tell them to tone it down. It would have come off a lot less dramatic if he had just casually told them to scale it back on the vacation talk.\n\n> I decided to call ahead and visit Jack’s parents privately to have the conversation\n\nI understand you are sad and hurt. I get that. But you're a 23-year-old girlfriend and although you're both adults, that is still young. In his parents' eyes, you're pretty much still kids. Especially since y'all got together at 20. Making a special visit to speak with your boyfriend's (not fiance, not husband) parents to explain that something harmless to anyone else is upsetting you and they should stop probably isn't a good idea. Even some reasonable people would be weirded out by that. I'm not saying it is right for them to feel that way, but really.. this was your boyfriend's place. Stepping in and taking care of issues with a SO's family members when you're not even married is really just a bad, bad idea. I know you're all adults and it shouldn't be that way, but that's just kinda how it is. Many parents would take what you did the wrong way.",
            "your boyfriend sounds like a dick tbh, he should have just told his parents that you were still sad about not being able to go to Japan & to maybe tone it down.\n\nhe refused and put you in an uncomfortable situation for what could have been a really easy fix. His parents are insensitive, and while it wasn't a super great idea to confront them, they should have recognized that you were just disappointed about not being able to go. It doesn't sound like you blamed them, they should of just said oh we didn't realize, sorry. I don't see why they made such a big deal.\n\nI'd dump your bf. ",
            "> I’m reconsidering my relationship with all three of them.\n\n\nGood plan, OP.  \nJack and his parents have revealed themselves to be shitty people. Jack absolutely should have been the one to talk to his parents over this, OP. I'm guessing he didn't do it because he doesn't want anything to threaten whatever \"allowance\" he gets from them. :/\n\n",
            "Okay, this family is fricken weird.\n\nSo Jack wouldn't help you be a mediator on something his parents were doing that he himself agreed was kind of rude..\n\nAnd his parents were *so offended* that you communicated something as simple as, \"The constant gushing about your trip to my dream country really hits a nerve because I got rejected from going,\" in *the nicest way possible* that they won't even have dinner with you anymore?\n\nDude. What the fuck is wrong with these people? I'm sorry this is really uncomfortable for you and that you trying to speak your mind went so far south, but honestly OP... they all sound like a bunch of high school kids. \n\nI would understand if they were a little \"put off\" by the whole formal occasion of you telling them how you felt face to face, but coldly refusing to have dinner with you? Good christ.",
            "You poor thing. You did well, remember that. Don't let Jack tell you otherwise, he's the coward. You shouldn't have had to face his parents especially alone, but I think you did a good job. You tried to prevent it from sounding accusatory and the fact that they instantly shut you down goes to show that they might not be very empathic/compassionate people. \n\nAt 3 years a relationships is usually reaching a point where it's fairly serious and might lead to a future together. Jack is not supporting you. While he does need to prevent too strong f a bias towards either side, he is your partner and should have your back for things like this. You didn't ask for anything unreasonable. You just discussed your feelings. If he can't admit his fault, he might not be in it for the long run. \n\nYou're starting a new job soon, and I'm assuming recently finished school or still are in school. Your cancelled plans to go to Japan are still recent and your feelings are understandably still fresh. He should be more compassionate towards your feelings in this matter. My partner's parents are going in a cruise soon but they don't rub it all in my face everytime I go there, nor my partner's face. They talk about it here and there but nothing too extreme. To be honest though, anyone going on any trip bragging about it to close friends/family who aren't so lucky are wing sort of douchy. Even if you weren't dreaming of going to Japan, bragging about it so much is still a kind of selfish/narcissistic thing to do and a bit insensitive. \n\nIt's really up to you how to move forward, but I personally would advise having a serious discussion with your boyfriend as soon as you can. Ask him perhaps why is suddenly being so cold about the whole situation. Maybe there's something he's not telling you. Either way, if you can't resolve this in a way that makes you able to (someday) forgive both him and his parents, it might be best to just move on.",
            "Your boyfriend is an asshole. As soon as you said that he refused to talk to his parents on your behalf, he outed himself as an asshole. Also, he lied. He said that if you politely asked his parents to tone down their gushing (which he *acknowledged* was insensitive), they would. Then he acts as though *you* were rude for bringing it up, though it sounds like you did you graciously. \n\nSecondly, his parents are assholes. \"I'm sorry you're offended,\" translates into \"you've offended us by taking issue with our behaviour.\" Have you ever felt before that you weren't allowed to disagree with his parents?\n\nSo, not only do they gloat about a trip that you wanted (and made no effort to invite you, they just wanted to rub it in your face), they are offended that you don't take their shit with a smile. And then they give you the silent treatment. After three years of dating their son and being  a part of their family, you deserve better than that. Not to be cast out the second you bring up a valid issue. \n\nJack threw you to the wolves and is denying any responsibility. His parents have cast you out for daring to be hurt by their hurtful behaviour. No one in this family has your back. I don't think there's any coming back from this.",
            "I'll go against the grain here. You should have never confronted them, and you should have sucked it up and put on a smile and pretended to be happy for them. Every day I see someone with something I don't have, do I go and confront them about it and tell them to keep it away because my \"feelings are hurt\"? No, I don't. You're not a special snowflake OP, despite what popular media and a large portion of this sub tells you. I would have broken up with a girl who has special snowflake syndrome as well.",
            "OMG, I thought his parents were just being rude and inconsiderate...this is just on a whole nother level! While I say screw them, I'd still want to hear my boyfriend of three years do the breaking up to believe that's what he wants. Not advocating you stay together, just now you know you can't trust his parents to be decent human beings, so they could be just making shit up because they want y'all to break up and he might not have any idea they told you all that. I think it's a bit unlikely since he took their side, but I think if I were you I'd still need to have a talk with him. Sending you some internet hugs! (My dream is to go to Japan too!)",
            "My goodness, you're going to look back on this one day with a *huge* sigh of relief. \n\nThe bullet you've dodged is huge",
            "what the absolute fuck.\n\nHere I was hoping that they were actually going to surprise you by inviting you on the trip.\n\nWhether she meant it or not, you don't want to associate yourself with these kind of people, I think it's pretty obvious.\n\nPeople who do that kind of shit are the real ones with \"lesser social standing\"",
            "Get out of crazy town!",
            ">Unfortunately, he refused to talk to them himself.\n\nAs soon as I saw that, I knew it wasn't going to go well.",
            ">Jack's mom called me and claims they wanted to make me jealous enough to beg to go on the trip with them so that Jack would see how poor I was and break up with me.\n\n\nFuck all of them. Fuck their whole family dynamic, weird passive aggressiveness, unnecessary bullshit, ect. Go do something worth your time then deal with snobby uppity asshats. You know what kind people do that have that much more money? They offer to take you because they want you to experience it with them. Rather than trying to bait you into begging to humiliate you.\n\nFlip the bird and walk away knowing that you still have your dignity.",
            "Fuck those people. ",
            "One, you were petty and childish to complain to his parents about their enthusiasm, regardless of your \"dreams\". You should have just smiled politely and left them to their excitement. You were jealous...adults get over it.\n\nTwo, your husband is spineless. He pretends to support your feelings but sends you off on your own to childishly confront his parents, and when that goes over like a lead balloon, suddenly he's on mommy and daddy's side?? \n\nThree, the in laws were definitely insensitive, bordering on being braggarts about the trip. BUT...it's their time and money and they can go wherever the hell they want. Their trip is not about you. Perhaps they were even trying to warmly share some of the excitement with you? Even if they were just being shamefully ignorant, I don't blame them in the least for being cold to you. You had no right to impose your petty feelings on them. Your jealousy is not their problem.\n\nMy in laws and my sister are both world travellers, and both have been to places that are dream destinations for me. I would never push my envy upon them and insist they shut up about it all. They are all entitled to their adventures and my support of their fun. Worst case, just bloody smile and nod...you might maintain some semblance of maturity.",
            "So after reading all three updates I conclude that you dodged a bullet.",
            "Holy shit that edit. ",
            "If everything you said here is true I would stop talking both Jack and his parents. They don't sound like nice people at all",
            "Ouch. Wow. Okay so unempathetic boyfriend and unempathetic parents. Coupled with your boyfriend refusing to support you or talk to his parents. \n\nMassive, glaring red flags here. \n\nI don't even know you and my heart hurts for you. \n\nIn high school my boyfriend went on a trip and got to swim with dolphins. That was my dream, but my family was too poor to make that happen. When he got back he didn't rub it in. He was super sensitive and actually said he felt almost like he was cheating on me because he got to live my dream. I was in no way mad at him and his empathetic response really helped with my jealously. \n\nYour boyfriend is being insensitive. And after seeing his parents response I can completely see why. If I recall in your post you struggle majorly financially and they don't seem to grasp your poverty. Not all wealthy people will have this thought process but some will. In my experience having my SO be understanding and sensitive to my financial past and present is essential to the relationship working.\n\nI don't know if your relationship can go any further. He doesn't seem to \"get\" it and worst of all he won't support you with his parents. This is a big deal and seriously worth ending the relationship over. ",
            "People don't want to see your jealousy or envy. Sometimes, admitting to them that you were jealous, envious, and petty can raise their sympathy, but it can also make you seem like a small person who can't be happy for others. \n\nIf they are rich, they are going to keep doing things that you wish you could. Their life constantly inspires jealousy. It doesn't make sense to keep people close who are jealous like that.",
            "His parents are dicks. Your bf left you out to dust and isn't supportive. \n\nBe glad you're not going on this trip. Especially as translator where they paid for you to go. You'll see their true colours when they think of you as \"paid help\".\n\nSit down with your BF and ask him if this was anyone but his parents would he have acted this way. If yes, then why stay with him? If no, then determine why his parents being involved change the dynamic. Act accordingly.\n\nPeople are gonna do things you can't do. Ultimately, you are responsible for your life and you have to persevere through emotional adversity. You'll go on your trip one day, no doubt. Don't invite bf or his parents.",
            "I literally can't close my mouth.",
            "His parents are rude as fuck. I can see them discussing in great detail a lavish meal they had at an exclusive restaurant in front of a hungry, poor person and then having an attitude when you ask to change the subject because it's only making you hungrier. And they're immature. I'd STOP CONTACTING THEM without an apology, including no more dinners. You've made the overture. It's their turn now, and if your boyfriend doesn't stand up for you at all, then that means you come third in his life, after mom and dad, even with the matter directly affects you. ",
            "I think this whole relationship between him and his family and you and his family has probably been fucked up for a while. I say that because to me it seems weird that you're having dinner with his parents every week, and they can not pick up on your discomfort. I mean to me it's just weird to have dinner with your in laws so frequently anyway. But if you spend that much time around people there should be a strong sense of intimacy and trust. To me it seems there is no intimacy or trust there. You seem more like a body occupying a seat at the table rather than a human being. ",
            "Honestly you were being over sensitive about the whole issue. So you don't get to go to Japan right now.  That doesnt mean people can't talk about it around you. Use it as drive to save up more u till you can go. ",
            "Man OP, I'm sorry things took a turn that way. I want to reassure you that I don't think you were unreasonable at all. If anything, it was unfair of Jack to ask you to go to his parents. He should have done that himself but as I see it, he selfishly didn't want that potentially uncomfortable talk *or* he never really had your side at all and therefore couldn't go to them himself. Either way I think your reconsidering the relationships is wise on your part. I know that must be hard. All the best.",
            "Why did this happen? Because your boyfriend hasn't grown up enough to stand up for his partner to his parents. He could have graciously taken them aside and been like, \"It is a huge dream of GF to go to Japan one day and I would love to go with her once she doesn't have work keeping her here. I think it is bumming her out to hear about it so much. Can we keep the details at a minimum in the meantime?\" \n\nBut no, he didn't do that, and threw you under the bus. K. \n\nPersonally, I think you made a mistake once you spoke to them directly and alone. And that's not your fault. You're not their daughter. You are their son's girlfriend, and they don't have to like you. This is why this subreddit always encourages the child to intervene with the offensive in law, because the parent has much more difficulty cutting off their own kid. This is a good example of why. I'm sorry, because it's not your fault, it is more of a political maneuver, and ultimately Jack refused to do it. You have a boyfriend problem. \n\nAnyway. Give it some time, but if Jack is so determined to side with his parents over you then he can marry them.\n\n",
            "Boyfriend should've had your back but didn't. Think long and hard if this is the kind of guy you wanna be with...",
            "What the duck at that update!?",
            "He is going to grow up without much personality ",
            "You are better off without him and his parents. They're all selfish babies.",
            "You dodged a bullet.",
            "what the fuck? his parents are absolute scumbags for intentionally trying to make you jealous. and she was trying to show how poor you are wtf? i'm mad just by reading this. these people need to lose all their fortunes and endure hardship. hang in there OP, you deserve way better ",
            "And now you're free of that spineless bastard and his classist family.\n\nI'm sorry you're hurting right now but this is going to be a relief when the pain wears off",
            ">TL;DR update \n\nclassy, real classy. Wow. \n\nYou are well out of this. I am sorry JAck proved to be such a weakling",
            "what a fucking wack job of a family haha. Get away from them while you can",
            "They sound like douche bags.\n\nBullet dodged. ",
            "Wasted? No, girl. You learned an important lesson from that relationship. ",
            "I'm so sorry this happened to you.\n\nI also had to deal with my (ex)boyfriend and his family, who traveled for 1 month to Japan, the place I really wanted to visit someday. I even took japanese courses in university, but I had no money and my mother was not able to afford any trips because we were broke.\n\nI was really jealous and hurt, of course, just like you. My ex boyfriend left one month, leaving me behind during the only 1 month vacation I had between two jobs. He was 25yo and still prefered to travel each summer in very expensive trips paid by mommy/daddy instead of traveling with me in cheaper destinations. But more important, he couldn't act like a grown adult during our whole relationship. He wasn't willing to put our relationship first. \n\nI think that you dodge a bullet with this one. What lead you to be jealous might also be the fact that your ex wasn't willing to give you enought space in his life. I understood that only several months after he broke up with me by sms. He tried during our whole relationship to make me believe that I was a selfish, stupid person and that I had to, basically, STFU (even when he was hanging with his ex in restaurants for lunch time). Please do not believe anything he said about you ! Your ex's parents sound really shitty, and you have to understand that there is nothing you can do if your ex is not willing to grow-up and to care about your feelings. Big red flag when I read about his reaction when you reported the mama's cold speech.\n\nEven if it hurt like hell, I advise you to do the no-contact thing and to move forward. Don't waste your time. He's doomed anyway.\n\nEDIT : I also think that it was a mistake to talk to them about this. His family is obviously a huge problem to build a healthy relationship, but you ex is the one who should have done something. He is the real problem here, not his parents or the travel.",
            "I would make it a point to tell anyone who knows you are Jack what happened. Make sure anyone in the community knows about. People this classist deserve to be outed for it and putting a strain on their relations with others seems like a fair way to separate friends or relations you might have in common. \n\nIf one of my friends threw another friend under the bus like this, especially his girlfriend or her boyfriend I wouldn't want to be around that person. ",
            "I think you handled the situation extremely maturely, OP! Your BF and his parents' reactions show that they are obviously immature and petty. Frankly, you're the bigger person here; you spoke up about your feelings and were completely upfront about it, as opposed to making snide little passive aggressive comments when the parents spoke  about their trip. \nHonestly, you sound well rid of them! ",
            "I can only congratulte you on getting out of that so called relationship which is more of a mess than anything else.\nYour SO completely failed on you and his parents are horrible. Jack didnt stood up for you when he should have. \nMove on, its about time. ",
            "> In a nutshell, she told me very spitefully that they brought it up to me so frequently to make me jealous. She said they were hoping I would eventually break down and beg them to pay for me to come - that way they could show Jack that I am of a lesser social standing and \"not a good fit\" for him. \n\nOh what the hell...\n\nAnyone else wondering if the trip was actually real? ",
            "Wow.  Just wow.  What awful people.  Good on you for walking away from this terrible family, that is some ghastly crappy behaviour.  Onwards and upwards, m'dear.  What's the bet his mother will spend her entire holiday in Japan gritting her teeth and spitefully thinking of you, instead of relaxing and enjoying herself?  ",
            "You should tell him what she said to you. He's weak, and I think you're better without him, but hearing what she said might be enough for him to realise how controlling his parents are, and help him be better person in future. And if you don't say anything then he'll definitely just believe whatever lies his mum tells him about it. \n\nMake sure it's clear you have no interest in staying with him, and are just letting him know for his benefit. He'll be more inclined to believe you if you have nothing to gain from it.",
            "The fact that Jack wouldn't have the conversation with his parents in the first place means he NEVER had you back.  \n\nI'm sorry Jack and his parents are super shitty human beings.",
            "So according to Jack's mom you're not good enough for him.\n\n\nJack's a momma's boy and won't defend you to his parents. He's actually taking his mother's side against you.\n\n\nJack's dad is staying out of things because he's not going to speak against his wife on your behalf. Maybe he's the on your side, but you'll never actually know about that.\n\n\nJack is very immature for a 23 year old and a bit of a snob. Unless things change dramatically after all this is pointed out, I'd say it's a deal breaker.",
            "Oh my goodness, I'm so sorry you had to experience this! I was so hopeful after reading your first post that they were planning to surprise you with a trip. For them to hope that you would beg them to pay for you is disgusting and her comment on social standing is abhorrent (did you tell her it's 2016, not 1916?). On the plus side, you dodged a bullet. Though you're sad about your BF (or should I say BF's Mom) breaking up with you, you want a partner that is going to support you and listen to you when you feel upset, not jump the fence and leave you high and dry! You will get to Japan one day, there's no doubt about that! You are already so successful and will only continue to do so. At this moment, be excited that you've got an incredible placement lined up - one that is only going to continue to advance you academically and professionally. Japan will always be there! Additionally, if this is who they are at their core, you wouldn't want to experience Japan with them anyway :) Good luck OP, now go and show your placement who is BOSS! ",
            "On the upside, if it is true that they planned this trip to Japan for the sole purpose of manipulating your relationship into failure, then it's very likely that they won't be enjoying their vacation very much. Then again, if you see photos of them having a great time in Japan, then you will know for certain that you got away from a rotten family.",
            "I would still love to hear what Jack has to say about it all if you get a chance to update. Sounds like you dodged a bullet by staying away from that family, though.",
            "You got grazed by that bullet you just dodged. Sorry OP. :(",
            "You dodged a bullet. Can you imagine if you'd gotten engaged or married to a guy who keeps his balls in his mom's purse?! Major crisis averted. Keep rocking the new job that's coming up. You'll eventually meet a man who's awesome and he might even have normal, equally awesome parents.",
            "You should  read /r/JUSTNOMIL . It might make you feel better that you're free now and don't have to live with her for the rest of your life",
            ">Jack's mom called me and claims they wanted to make me jealous enough to beg to go on the trip with them so that Jack would see how poor I was and break up with me.\n\nWell, that's it. Fuck these people. You deserve better than people who use money to manipulate and make you feel bad about yourself. \n\nGoodbye, goodbye, rid yourself of these urchins. And seriously, even if Jack does come around.. do you really want to be forced to associate with people who went out of their way to try and get their son to dump you? Like God damn. ",
            "Wow, so let me get this straight... the PARENTS wanted to make you jealous? So \"mature\" adults who should know better and be above such pettiness actively set out to mean girl you and your spineless boyfriend is now taking their side?\n\nYeah, you don't need that kind of bullshit in your life. They got issues, and that's putting it mildly.",
            "I hope you end up confronting Jack to let him know what horrible people his parents are and actually breaking up with him.\n\nThat was disgusting and I'm so sorry that you're going through this. I'm even more sorry that you took the most adult way to approach the situation and they realized that their plan didn't work and just started treating you worse.\n\nI wish shit like this was illegal, honestly. There should be no reason for people to behave like this to others.",
            "You've already gotten a ton of comments, but I just have to say this: I know I don't know your situation, you said you already have a job lined up, but I still believe you can figure out how to get to Japan sometime in the near future. I used to think big trips to other countries were only for rich people, too. They're not. My now-husband has opened my eyes to this. If you budget for it, look into when the cheapest airline flights are, stay in hostels or airbnbs, etc. it is doable. r/travel might be able to help you figure out the cheapest way to travel in Japan. Even if you don't get to do every single thing you've always wanted, or you only get to stay 5 days, or whatever, at least you will have gone. I get stressed about the money every time I go on an international trip, and EVERY TIME I get home KNOWING it was worth every penny. Experiences are worth so much more than money. You can go back again in 5-10 years and really do it up, but for now I think you owe it to yourself as a way to get over your shitty boyfriend to get there asap. Best of luck to you, no one deserves to be treated the way you were, and you handled the entire situation with grace and class. ",
            "Has Jack had the maturity to speak with you about this?",
            "Is this real life? Are there really people like this? I'm sorry OP, that is just plain terrible.  He and his parents are fucking blow jobs and you deserve better!",
            "I'm so sorry that this happened to you, but you are so much better off. \n\nThis whole thing sounds like a goddamn k-drama. You do not want to be mixed up with rich people drama. It's a whole different level of crazy. ",
            "> I have no idea if Jack knows about any of this but I don't care, I am done with him and them, I do not want to be associated with such classist, manipulative people. This was such a terrific waste of three years of my life.\n\nJack deserves to know they told you that. Even if just in an email to him. Whether you stay in his life or not, whether they meant it or not, he needs to know that his crappy parents are willing to do something like that. I can understand (not excuse) his denial of supporting you initially if he is under the thumb of such awful people.... \n\nAlso, this may just be another effort at \"getting rid of you.\"",
            "Is this real life??\n\nOP I'm so sorry this happened. What a mindfuck. What they're doing is completely unreasonable. It'd be worth overlooking (for me anyway) if your BF vehemently had your back, but that doesn't seem to be the case here. Even then it really sucks having those people in your life. \n\nYou're 23, you're young. You can do anything in the world you want to do. Your absolute best revenge is to live well and build your life. Then down the line when Jack realizes he fucked up and tries to come back, you and your new SO can laugh in his face. \n\nWhen my mother and father started dating in college (former USSR), my grandmother (dad's side) constantly belittled her and thought that she was a dumb farm girl. She never thought my mom was \"good enough\" for my dad. She still doesn't. My dad didn't give one fuck. Now my grandma lives alone trying to guilt my sister and I into seeing her, but after seeing the way she treated our mother our whole lives we couldn't give less of a fuck. And my mother is still happily married to my father and they are doing quite well and have a wonderful life together.\n\nSo in short fuck his parents. Even in the best case scenario where he has your back, it's not pleasant to grow up with a MIL and FIL that look down on you. ",
            "You are WAY better off away from all 3 of them.",
            "This is ridiculous Jack has obviously never taken initiative over anything in his life if he is letting his mom handle his relationships. It's as if you were dating them, and not him.",
            "You seem like a very smart girl and I'm sorry that you have to deal with such ridiculous people. I'm sure when you spoke with them, you were very sensitive and thoughtful. I may sound cold and I hope not to offend you but these people would be a nightmare as in laws. The fact that your boyfriend changed his stance on the subject based on his parents reaction is an indication that he not yet his own man, and god knows when that will happen. If they were kind people they would have understood or even have invited you to go along, I know that's what my parents would have done."
        ]
    },
    {
        "post_id": "aab0wm",
        "author": "throwitaway462649261",
        "title": "How do I (28f) break up with someone when I’m their (31m) everything?",
        "url": "https://www.reddit.com/r/relationships/comments/aab0wm/how_do_i_28f_break_up_with_someone_when_im_their/",
        "score": 2054,
        "num_comments": 123,
        "created_utc": 1546009428.0,
        "selftext": "We’ve been together for 10 years. Through it all, I’ve finished my degree, found a good job, became financially stable, and he... Came along for the ride. \n\nHe has suffered pitfalls through the years that have definitely hindered his development (mental illness, family issues, job instability, etc.) but I’ve reached a point where I want to move on in life, and he isn’t in a place where he can progress with me. I’ve waited 10 years for him to get his shit together, finish a degree or trade program and just become an adult with me, but in so many ways he is still the 21 year old I met years ago. I’m tired. \n\nI know I want to end things, need to, but he still loves me deeply, and he’s told me before that I’m the only good thing in his life. How do I split our lives when he still considers me his world? \n\nTldr: Longterm boyfriend still in love and codependent, how do I end things without completely devastating him? \n\nEdit: I’ve been reading all of the comments and have been overwhelmed by the amount of support I’ve received. Thank you to everyone, especially those of you who have shared personal experiences. This is the most terrifying thing I have done to date, but knowing that it is okay to be the “bad guy” and how to start the process has given me confidence to move forward. Hopefully I’ll have a positive update in the future. ",
        "permalink": "/r/relationships/comments/aab0wm/how_do_i_28f_break_up_with_someone_when_im_their/",
        "comments": [
            ">he’s told me before that I’m the only good thing in his life.\n\nBecause he's not trying to create other good things in his life. ",
            "I was in the same exact predicament. I was married for 13 years, together for 17.  I worried about what she would do, like harm herself because of mental health issues. Eventually though, you cannot live your life trying to make someone else happy, or stay with someone because you feel sorry for them. Unfortunately, there is no easy way to do this, and it's going to be extremely difficult for a long while. You just have to rip off the band-aid and do what your heart tells you to do. He will live, and you both will move on to the next chapter in your lives.   ",
            "I married a guy like this. I was with him 8 years, pissed away my 20s with him. I'm 34 now.\n\nWe are now divorced 2 years and i have to say, i am so much happier. And lighter, i lost 80 lbs plus his dead weight.\n\nHe had depression and anger issues. He was unstable a lot of the time and also has moments where i thought he'd kill himself. \n\nHonestly, you are not his everything, and he is manipulating you into thinking that so its harder to leave. If you were his everything, he would have stepped up and grown with you, in order to keep you HAPPY, not just keep you. \n\nMake a plan on how to leave, get your finances and housing in order then just rip off the band aid. Life is too short to live it for someone else's feelings. ",
            " > how do I end things without completely devastating him?\n\nWhat do you mean by 'completely devastating'? If you mean, he's going to be sad, be emotionally wrecked, cry a  lot, etc? Yeah, that happens with most unwanted breakups. That's just life.\n\nIf you mean 'ruining his life'. Yeah, no. He has been coasting partially because he's had you to fall back on. When you break up with him, it will cause some difficulties in his life, but he is stronger than you both give him credit for. He will deal and cobble some kind of life together. This may be the impetus that finally causes him to adult up. Or he may just keep living like a 21 year old. But either way, he will be ok. ",
            "When they're not your everything too.",
            "I'll assume y'all live together. So first would be to get your things in order. Separate bank accounts if you have any, remove your name from joint credit cards, and find a new place to move in.\n\nOnce those are done, you'll talk with him and tell him that you are no longer compatible, and that you will be moving out. It's important at this point to be stern and not let him start arguments about why to stay, and to simply tell him it won't work, and you are moving out.\n\nThe planning you did before is crucial so that you can move out quickly. If theres a delay between your new place and the break up, try to crash at friends or familys place in the mean time. Staying in the same place as your now ex will usually make things very difficult for both of you.\n\nWhen you are completely separated, block him from all social media, and block his number. There is nothing to be gained from leaving access to each other.\n\nIt's gonna suck, and you are gonna cry a lot, even though you initiated it, you will hurt badly. But it will go away, and you'll be glad you moved on and now have the opportunity to find something better for you. ",
            "My ex was like this. Was with him since we were 18/19 for almost ten years. Had to push him to get a car (and he did, with my credit score), to get a credit card to further help him build credit, to get a new job that was full time instead of just chilling as a package handler at a warehouse as a part time without trying to move up in the company, same thing as he sits as a bartender at a casino - he could easily try to move up within the casino and even branch out into different departments, still hasn't tried.\n\nAnyway there's no changing. Some people just completely lack any sort of ambition or want to move forward in any way. Drop them. I'm so much happier with my bf who has the similar level of drive that I do.",
            "> how do I end things without completely devastating him?\n\nYou can't. The right thing to do isn't always the easy thing to do. He'll be devastated, and then he'll learn and heal and grow. \n\nI think it's for the best that you remove yourself as much as you can during that process. Block everywhere, if you get into a new relationship keep it low-key for a while, stay away from shared social activities when you can.\n\nIt'll be okay. He will be okay.",
            "[deleted]",
            "By taking care of yourself and being kind about the breakup. There's no need to heap his troubles onto him in addition to \"I'm breaking up with you\". I assume that sometime in the past ten years you've had conversations with him about how you see more in him than a guy in his 30s who doesn't have his shit together? So he knows (or should know) that something you don't like about him is that he doesn't have his shit together. You don't need to remind him of that.\n\nSo make it about you. You're breaking up with him because it's the best thing for you. You hope he does well, you don't wish him ill will, but you're moving out this weekend and please don't call.",
            "I was in a similar situation, not quite as long but after 2 years of living together his mental health had deteriorated to the point where I was more of a caregiver less of a partner. I knew I was done with the relationship (had also finished school was financially stable etc). I think the turning point for me was knowing that I had caregiver fatigue and was essentially being emotionally abused. When I did end people told me I actually seemed happy. He was wrecked after I left and as far as I know his life has gotten worse. I think what is important to remember is it is okay to put your health and happiness first. ",
            "**He will be fine without you.**  \n\nThere is a 99% chance that you are giving yourself too much .  If you aren't around to do stuff for him, either he will step up and do it or find someone else to do it for him.",
            "I was in a relationship similar to this, fortunately only for two years.  I’d say 10% of the time he was great, but the other 90% was an absolute struggle.  He would tell me that he’d be dead without me. \n\nIn our time together I graduated university, moved cities, established myself in a fantastic career.  Meanwhile.. he dropped out of university to be with me when I finished (he started a few years after me). He changed jobs multiple times (each time *I* got him the initial interview at the very least), and every single month there was an ‘issue’ with his paycheque.  He insisted that everything was down to his mental heath issues, and I believed him. He relied on me for financial security AND mental stability, it was all too much.  \n\nFor so long I wanted to end things because he was bringing me down and he was so unwilling to help himself, but I persevered because I worried that without me he would be homeless, penniless and suicidal.   In the end I realised that actually it wasn’t my problem to be concerned about.  He is a grown-ass adult who needs to learn how to care for himself.  \n\nWe sat down together and I explained to him why I was ending things. I explained that whilst I still cared for him, I did not have the energy to live my own life if I had to keep him afloat every day too.  I said “I can’t be happy for the both of us all of the time”.  He didn’t put up much of an argument, and I respect that.  He was devastated but he said he loved me too much to see me unhappy for his own sake.  I would hope that your SO will have this mindset too. Sorry for rambling! \n\nTLDR - You need to put yourself first. He is a grown man who ultimately can look after himself.  We will all experience heart-ache in our lifetimes, don’t allow yourself to suffer because you fear for him.  He isn’t your responsibility. \n\nI hope this helps xo ",
            "When you break up with someone, you don't get to be the good guy. You will be hurting him. There is no avoiding it. But you have to value yourself too. You have to value your growth and the fact that you deserve better. You have to make a plan and follow through. Get your finances in order, pack your shit, and leave. Go cold turkey once your shit is sorted; don't try to be friends because that will make it harder on him. Give him space. If this kickstarts his life as an adult, great. If he sinks, that's still not your responsibility.\n\nThere's no way to go around or over this. You have to go through.",
            "A lot of valid points here though another suggestion is to see if he made sacrifices for you to be able to do those things. \n\nI’ve seen it a few times where one person would grind so the other could go to school. If that’s not the case then that’s good to know. ",
            "I’m (34m) in this exact situation right now as the opposite of this relationship (28f)(6yr relationship).  Except the whole along for the ride part.  We officially broke up yesterday and it hurts me soo much.  I took her for granted and it costed me.  I tried to get her back by saying I’ll be more attentitive/acknowledge her more but she told me she couldn’t believe me and hurts her and brings her to tears.  We always do better for a brief time in arguments like this but then I slowly revert to not paying that much attention to her.  We became roommates instead of a couple.  She was tired.  It hurts and I am completely devestated but yeah a break up is actually what we/I needed.  I love her as much as she loves me.  So maybe I can actually grow from all this.  And maybe down the road our paths would cross again and I’ll be a better person to her.",
            "This is going to hurt him, but in the long run he will be better off. You deserve to be in a fulfilling, mutually loving relationship- and so does he. He may think he can’t live without you, but he can. He will learn this after you leave.",
            ">he’s told me before that I’m the only good thing in his life.\n\nThat doesn't mean you have to give up your dreams and goals for his status quo.",
            "Remember, breakups are not some negotiation in which both parties need to agree and come to the conclusion together that it is time to break up; they are a unilateral decision in which one party decides it is not working and ends it. The best part, once you've made the decision to break up, you no longer have to care about what they are doing or how they feel. Their feelings and any actions they take are officially 100% not your problem anymore. As I like to say \"not my monkey\".",
            "I was in this situation a couple years ago as well - I was with a guy for 6 years, throughout my early/mid 20's, and during that time I finished my degree, started my career, and became financially stable. I grew up, basically.\n\n&#x200B;\n\nI'm not sure if this is the case for you, but in my case, these changes in my life totally altered the power dynamic between us, which caused problems. In retrospect, I don't think either of us knew how to deal with that power shift. I became the \"breadwinner\", paid for rent, groceries, did most of the housework, etc. I absolutely hated it. Not because I necessarily disliked doing any of those things (except the housework lol), but because this guy just let me take everything over without ever really offering to pick up any of the slack. He didn't have a job, and wasn't actively looking for one. Then, understandably, he got depressed and totally stopped advocating for himself and developed a serious online gaming problem. \"Serious\" meaning that if he had a bad game, it would totally ruin his mood, make him extremely irritable, I had to walk on eggshells just to have a normal conversation. He'd play pretty much all day every day, so this applied all the time.\n\n&#x200B;\n\nAt the same time as this unhealthy behavior was going on, though, he'd also tell me that he loves me deeply, I'm the best thing in his life, I'm the best thing that has ever happened to him, etc. If that was true then why wasn't he trying to better himself so that we could better ourselves as a couple as well?\n\n&#x200B;\n\nI ended up breaking up with him pretty suddenly at one point because I just couldn't take it anymore. He later told me that although the breakup was really awful emotionally for him, it was the kick in the butt he needed to... well... get off his butt. He ended up going to a trade school and then starting his own business, and is now by all accounts pretty successful.\n\n&#x200B;\n\nI guess ultimately I'd advise breaking up, unless he has very immediate & very concrete plans to do something to help himself out of this. My experience is that you can't really force growing up, and if he's not ready, then he's not ready, and you should move on to somebody who's more on your level. Ten years is a long time for this to be going on. How much longer are you willing to deal with this?",
            "You have him enough time.. you dumping him may be the wake up call he needs to get his act together \nMove on",
            "You don't owe someone your life like some sort of human sacrifice.   \n\n Break-ups are hard for everyone but he will survive, I guarantee it and you're actually not helping him evolve or grow by staying with him.    \n\n You need to stop using him as an excuse to stop moving on with your life and *just move on with your life OP*.   You need to recognize that you are only stuck because you want to be stuck.",
            "Honestly, letting him go may be the best thing you can do for him.  \nWithout you there as a safety net, acting as his caretaker, he will HAVE to get his crap together.  \n\n\nYou have to do what is right for you. Keeping him around when you no longer want to be his partner is honestly more cruel in the long run, than being honest and telling him that the relationship is over.",
            "Tell him you're not happy and deserve to be, then wish him all the best. How he handles it is up to him.",
            "Similar situation so im leaving this here for reference later.",
            "Amazing how people will drop each other for material gain. What a joke.",
            "You leave because it's not on you to sacrifice your life and happiness to be his caretaker. He's an adult, not a child that others are obligated to protect and provide for.",
            "Codependancy is an ugly thing.\n\nI should know, took 3 years of work and effort for me to break out of it after my last breakup, before I met my now wife\n\nHuge improvement in my life!",
            "My wife had to do this with her ex. She always says although it was awful she felt light as air the next day bc it was a long time coming and was such a relief",
            ">I know I want to end things, need to, but he still loves me deeply, and he’s told me before that I’m the only good thing in his life.\n\nIt's hard, but you do it by knowing that it is unfair to both you and him to only stay with for that reason.\n\nIt sounds like you have done so much growing over the last ten years, and he has not. This is very common of people in their 20s, and even though you are in a relationship, you will not always grow in the same direction. \n\nI was with someone like this from 22-28. I excelled in my career and had all these aspirations, but he continued to work part time in retail and smoke weed 24/7. I always wanted to travel, but we could never do much as a couple because he always spent money on clothes, pot and takeout food until his account was dry. His father fell ill and passed away, and he used his depression as an excuse to not want to do anything at all but indulge in the above vices for the remaining 3 years of our relationship.\n\nBreaking up and going no contact was the best thing I have ever done for myself. I'm now dating and living with someone who makes me very happy and we travel the world together.",
            "You don't need to write every single thing you have attempted over the last 10 years but if all you've done is waited then now is the time to let him know what is wrong.\n\nI think every post on here should include what kind of communication was attempted. \"I have talked with him about this issue for years.\" Something simple like that would make things more clear.",
            "He’s probably not going to be independent and figure this out until he’s single and forced to. He’s an adult, and not your child or responsibility. Just rip the band aid off. \n\nI was in a long term relationship with someone who also didn’t really start taking care of some parts of his life until I broke it off. ",
            "One of the best pieces of advice I ever received was from a friend when I was young and in a relationship in which I was much less interested than the other party, but was dragging my feet on ending things because I was concerned about what he would go through, and how it would impact my social circle (lots of mutual friends)\n\nHe said “You aren’t the be-all end-all. You aren’t the holy grail. He’ll be hurt, but he’ll get over it. Everyone will get over it.”\n\nIt was exactly what I needed to hear. And he was 100% right. Life goes on and people figure things out. You do not complete him, and if he thinks that, then he has put you on a pedestal and that’s way too much for anyone to live up to.\n\nHe’ll get over it, so will you, and it seems like you both could be the better for it. ",
            "I'd say, rip the bandage off! But be kind about it. ",
            "I just ended a 14 year relationship with my ex GF [31F].  I’m the same age and for the last 2-3 years we were just on autopilot.  Recently she started accusing me of cheating on her when I wasn’t and picking fights so I decided to break it off.  I think what ends up happening with long term relationships is that each party doesn’t have the willpower to break the other’s heart, and that’s understandable.  At the end of the day you need to do what’s best for you and not let anyone else pull you down.  It’s been tough the last few months because I do miss her however I believe this is what’s best for me and I’m sure after reading your post that your mind is already made up.  Good luck",
            "Talking and taking steps slowly are a lot easy to deal with. Small bites so that you can both except and digest what is happening emotionally. \n\nIf you can, engage in therapy and slowly manage your way out of the situation. I've been the depressed co-dependent one and I was told one day as an ultimatum. It broke me, because I was blindsided. I wish that he'd talked to me, instead he just kept saying he loved me. \n\nYour relationship may have become a toxic crutch, you might be the only good thing because they are unhappy and have clung onto the thing perceived to be good even though it isn't. \n\nAny action you take, try to think how you would feel if it were done to you. If you act in a way that your moral compass is okay with, you will come out of it with less guilt and more emotional stable yourself. Because this is going to hard on both of you. \n",
            "I have been on the receiving end. It's sucks big time. We are together for 4 years. We both loved each other but we weren't compatible anymore according to him. He cried a lot before even telling me. He explained and I understood. He knew at times I had suicidal thoughts. So he made me promise not to do anything crazy.\n\nWe tried to be friends after that but it became worse after he started dating. It was a living hell. I stopped talking to him but the promise I made to him always kept me from doing anything crazy.\n\nMaybe you should cry more than him that's gonna distract him from his pain. \n\nBest of luck! \n\n\n\n",
            "I would first insist he see a doctor to get screened for depression, if he's not currently being treated. You presumably care about his well being, so make sure he has some sort of safety net. \n\nAnd then, you just leave. I'd arrange for him to keep the place you live together, if it's not a house you yourself own on your own. I'd consider helping him pay the rent for a few months, maybe 6 months. You may actually be considered a common law spouse in some states, and if he took you to court he might be able to get financial support for a while. Offer it up proactively, give him a bit of a safety net for a while.",
            "You might actually be doing him a favour (in the nicest possible way). You leaving him might be the wake up call he needs to sort his life out. \n\nTo coin a favourite /r/relationships phrase: don’t set yourself on fire to keep someone else warm. He’s a grown man and it’s not up to you to sacrifice your life for him.",
            "Nowhere in your post do you mention how well you both communicate or if you ever tried to help him or just 'waited for him to get his shit together'. Did you meet someone new and just want a change and do not want to fix your relationship?",
            "There’s no good way to dump someone, you just have to do it. Yes he’ll be upset, he’ll get over it eventually. Maybe it’ll even push him to make a life for himself. Suggest he get himself some therapy, he clearly needs it. Do you live together or separately?\n\nIf he threatens suicide then call the cops.",
            "OP I feel for you! I was in a relationship that was very similar and ended it. It boils down to this: are you willing to sacrifice your own happiness and satisfaction for someone else’s? Ultimately you are staying with him out of pity and guilt. It’s not worth forfeiting the rest of your life for, and may be the push he needs to finally better himself. I was able to end my relationship when I realized I wasn’t the love of my ex’s life, I was simply present and willing to tolerate his depression and lack of motivation. He would have been just as in love with any other person taking care of him. ",
            "I agree with the boarding saying that this relationship isn't working for you and breaking up is the best thing for you both. In practical terms, I wonder if you could move out of your shared apartment but still pay your share of the rent for 3-6 months while he comes up with solutions for the next however many years",
            "> How do I (28f) break up with someone when I’m their (31m) everything?\n\nI see humility is one of your great virtues.\n\nYou break up with them same as you'd break up with someone when you're not their everything: you convey \"this relationship is no longer working for me and I will no longer continue it\" in whatever wording best fits your context, and you move on with your life and let them move on with theirs. \n\ntbh some people just don't want to become an adult, and as long as they're willing to accept the drawbacks of that choice, there's nothing wrong with it per se. Everybody changes from 18 to 30, which is why relationships that start at that age rarely last. As much as that sucks, there's nothing catastrophic about it, not for you, not for him.",
            "You are not responsible for his happiness",
            "I'm sure it will be hard but you've got to cut him off. He's a dead-weight.",
            "You cannot be held captive by a relationship which has run its course. If he is no longer someone you feel you can “go the distance” with, every day you stay is kind of a lie. \nJust be glad you didn’t make it “legal.” My ex-wife and I spent almost 10 years married. 10 years of my life gone and nothing but heartbreak to show for it. Do yourself a favor and end it. The short term will SUCK. The long term will not. Voice of experience.",
            "I lived this exact situation and left, and then found myself crying over how sorry I was to myself for wasting so much time. Don’t let your life float away from you because of inertia or fear of one bad year. You only get one age 29, age 30, age 31... just go. He’s an adult, he’ll survive and maybe even thrive when he has to reassess.",
            "We've all been there but you know you need to find a better life.",
            "When he says you're his everything, what he means is that you're his meal ticket. I'm sure that, on top of all the things you listed, the are even more things he doesn't do for himself because he'll get you to do them for him. I'm not saying either one of you is bad. It's okay for him to lack your level of ambition. It's okay for you to do things for someone you love. It's also okay to break up, because you are no longer compatible. \n\n\n\n\n\nHow do you tell him? You just tell him. \"I've been growing and taking steps and moving forward and meeting goals and expanding my horizons all these years we've been together, and now we're just not on the same page anymore. We're no longer on the same path or the same journey. It's time for us to each go where our lives are leading us. And we can't do that together.\"",
            "He's his own person. He needs to act like it.",
            "I was in a very similar situation. \nHe had told me many times that if he didn't have me, he'd have nothing, and if he had nothing then it made sense for him to end his life. \nI broke up with him once I'd come to peace with myself about this. If that's what he wanted to do, I couldn't change it. \nHe didn't do this. \nHe is much happier now that we are apart. As am I. \nHe needs to be responsible for himself now. \nGood luck! ",
            "I was also in a relationship like this once. High school sweethearts, yet I grew up and he didn’t. It’s not your responsibility to make someone happy. They need to learn to make themselves happy before they can do the same for anyone else. Hard work pays off and you have proved that, don’t be afraid to live your life! ",
            "Like a bandaid do it fast! Don’t prolong the situation, because it’ll only make it harder. ",
            "Like ripping off a band-aid, quick and to the point. In a public place to keep down the drama, if any. Need a detailed exit plan, where you going, money, etc. It's the after care that will be difficult. Beware of the recidivism. Stay strong and gold the line. Seek support and ask for help, when needed. ",
            "[deleted]",
            "Good luck. Just as a side note, don’t do anything out of guilt that you’ll regret later. He’ll be upset for a while but he’ll be ok eventually. I was in a similar situation and kind of screwed myself in the divorce because I felt so guilty. Left some of my stuff so he didn’t have nothing and walked away from our home which was a huge investment. Yeah he had another girl living up there within a few months, so he wasn’t quite as “devastated” as I’d been led to believe. I regret not looking out for myself. ",
            "He will survive. He may not like it now but later down the road he will understand why. I left my ex of 6 years. During the time we were together I graduated college, and had a career for 2 years. In the meantime he was still working a minimum wage job, was in and out of college. Was a slob, let him self go.  Spent his money on irrelevant stuff, while I covered his rent. If you think you should run, run! If you dont, he is going to stand in your way and slow you down.",
            "I was around 20 when I had to make this decision with my ex. He dropped out of high school because of depression and finished it outside, but never really did anything else with his life. I worked and went to school and his plan was to be a stay at home dad while I worked (which is fine for some but not what I had planned for the rest of my life). I ended up growing resentful, but went to his house and sat him down and said it wasn't working out. It ended up just being hours of him crying and saying how I'm the only thing that made him happy, but that can't be my responsibility. It will suck no matter what, but you gotta put your happiness first sometimes.",
            "Honestly, the break up and possible rock bottom he’ll hit will be good for him in the long run. Breaking up is hard but you aren’t responsible for his happiness and you need to facilitate your own growth and happiness. Just... do it. The anxiety is an obstacle that is much more easily conquered the quicker you face it. ",
            "You just have to tell him and start the process. This is going to be an ugly-long process, don’t let folks tell you otherwise. It’s going to hurt and be very emotionally draining. Make sure you have other positive things in your life that you can focus on. It will take a long time to completely separate.\n\nBut as the saying goes, the best time to plant a tree was 20 years ago, the second best time to plant a tree is now. No point in waiting any longer.",
            "I am in a very similar situation. I've been trying to figure out how to end it. There is no easy way to break someones heart, but my heart breaks every day waiting for him to change. The reality is, he never will, so I must change what I'm willing to put up with. I'm tired and know I deserve better, but working up the courage to let go is tough. Helps knowing I'm not alone in feeling this way. ",
            "You end this or carry around 200 lbs of dead weight for the next 50 years. ",
            "I would say that although it is obviously going to be a very difficult and painful experience to break up, it is necessary for you to avoid many years or a lifetime of suffering. If your SO hasn't tried by now, he probably won't until you're gone. \n\nConsider this; At the end of your life, do you think you will regret not living your life to your potential? Do you think that your SO will hold you back from that? ",
            "You’ve made up you’re mind. Be open and honest as to why and be clear if there is no possible relationship following the break (no false hope). It’ll suck. You know him better than anyone, so hopefully you’ll know the best way to ‘break’ the news. ",
            "What do you mean when you say you want him to grow up with you?\n\nIs this just about him getting a better job or is he immature?\n\nDoes he cook, clean, pay bills etc? ",
            "I'm in a similar situation.  I have been telling my partner for years that it's over, and I keep telling him that we'd both be happier if we moved on and found new people.  I point out all the signs: no intimacy for years now, no common interests, often don't enjoy each others company, etc.  But when I talk about this he completely falls apart and tells me he would die without me.  He's the kind of man who has always had someone take care of him in many ways, so I know he wouldn't be OK on his own.  So I try to get him to go back to his ex.  His ex wants him back, but he doesn't want to go.  The only way I could end this is if I walked out the door and left him in crisis, and I just can't do that to him, or anyone.  I would feel terrible, and I would be so worried about him.  I have friends and family that have been telling me for a long time that that is precisely what I need to do, but I can't be that mean.  The only way I'm going to be able to move on is if I can convince him to agree with me, so that it's mutual.  I've been trying to do that for years now.  Do you think you have any chance of convincing him that you should break up?",
            "Baby bird has to leave the nest sometime. This has to happen. You cannot control his reaction or how he takes it. You just need to do it for your own sanity. What's plan b here? Waste your thirties waiting for him to get his shit together? He's never going to fly while living in your nest.",
            "I feel empathy for both of you because even though he's the one who's getting dumped, you surely still care about him on some deep level and wish things had turned out differently.  But yeah, the longer you stay with him - every day, week, month that you stay - you are delaying the future that you're working towards.  Break it to him kindly, but keep that in mind to keep yourself firm in your decision, too.  I agree with others that this may be the jump start he needs.",
            "You say it's over. No explanation. And leave. ",
            "He survived before you came into his life, he will survive without you again. He will be hurt, he will be heartbroken, he will be devastated, then he'll have to figure out how to get on with life. Just how every other person on earth has. Every single person on earth has gone through a devastating break-up they didn't see coming, everyone on earth has had their heart broken. Everyone has survived it. \n\nI recently heard that my last ex is still depressed after I left him *almost three years ago*. Even though his life is arguably better than it was when he was with me (better job, financial security, better house) and he is ENGAGED to a loving long-term partner (he dated her throughout his relationship with me, ethical nonmonogamy and all that), he is still miserable and \"struggling with life\". If you were to ask, he'd tell you that it's because he had his heart broken. But after 2.5 years, it can't be about me anymore. He was depressed waaaaaaaay before I left him. I think he'd just rather blame me leaving him than admit, \"I just hate that I'm an adult and am expected to take care of myself and contribute to the world.\"\n\nYou've spent the last decade waiting for him to grow up with you. He hasn't. That's on him. It's not on you to continue taking care of him.",
            "Two things: you shouldn't set yourself on fire bc others are cold, and no one can be your everything, bc no one can live up to that expectation, I would tell him how you feel and tell him how you want to change but if love isn't there then life is too damn short to not find love with someone else ",
            "She's not going anywhere. Calling it now.",
            "search him another gf"
        ]
    },
    {
        "post_id": "59c90y",
        "author": "spengbab_5evr",
        "title": "Me [24m] with my entire family, who now hate my guts for being a whistleblower",
        "url": "https://www.reddit.com/r/relationships/comments/59c90y/me_24m_with_my_entire_family_who_now_hate_my_guts/",
        "score": 2049,
        "num_comments": 122,
        "created_utc": 1477415755.0,
        "selftext": "I hope you'll bear with me here, because I have a lot of family members. I come from a religious community that doesn't believe in the public school system and tends to have a ton of kids. \n\nI have an older sister \"Julia\" 27f, a step brother \"Ron\" 22m, a step sister \"Molly\" 17f, a half-brother \"Joe\" 13m, and a half-sister \"Lucy\" 11f. \n\nGrowing up, all of us were “homeschooled.” This involved a lot of neglect, lack of textbooks or seasonally appropriate clothes/shoes, unheated house, and sometimes physical abuse. I lived mostly with my mom, but spent weekends with my step family. Both houses were dysfunctional. My step mom used to have a severe problem with alcoholism, although she’s been better in the last few years.\n\nRon is my best friend and I would be lost without him. We’ve supported each other through years of hard times, and we discuss a lot how our lives could have been different if we’d been sent to school or generally had a more healthy home life. Obviously, we don’t want the same thing for our younger siblings, and don’t want to see them struggling in minimum wage jobs while trying to study for a GED the way we’re doing.\n\nWhen I went to visit him recently I found that my step mom had gone out of the country for an ENTIRE WEEK and left the youngest two at the house. Ron and Molly both work (Molly hasn’t been doing any “homeschooling” for about 2 years) and are out of the house for most of the day and night. \n\nI tried to help Lucy with her math homework, but she was extremely behind grade level and kept getting distracted because she had to make lunch or do chores. Joe spends all day in his room playing video games and gets no guidance from anyone. I tried to (as gently as possible) get him to do some reading, but he doesn’t understand how serious the situation is, and obviously is having too much fun to care. \n\nSo I called CPS and reported educational neglect.\n\nAnd obviously everyone knew it was me.\n\nAnd Ron told me that Stepmom said I wasn’t welcome at the house anymore and to never contact any of them again.\n\nMolly is extremely mad at me. She blocked me on Facebook and doesn’t have a cellphone where I can reach her.\nJulia, who somehow heard about all this despite living across the country, also blocked me on Facebook, and reported my Facebook as impersonating a celebrity, (Facebook deleted it, generally making everything harder).\n\nThis stings even more because I’m already estranged from my biomom over my religious beliefs. I now have no family members left (besides Ron, thank bejeebus) who want anything to do with me. I feel like I make enemies everywhere I go.\n\nDid I do the right thing? Ron has been saying for years that he \"can't\" call CPS, and I guess this is why, but at least he doesn't blame me. He suggested that I try to talk to Stepmom once some time has passed, but I would have no idea where to begin.\n\n  **tl;dr**: I called CPS because my youngest two siblings are being educationally neglected. My whole family is now shunning me and I don't know if it's appropriate, reasonable, or even possible to try to reconcile with them either now or when we've all cooled off.",
        "permalink": "/r/relationships/comments/59c90y/me_24m_with_my_entire_family_who_now_hate_my_guts/",
        "comments": [
            "Expect the next few years to be tough, and expect your mother and stepmother to never come around. Your siblings will shun you until they get older and into the real world, and then they'll realize you were the one person who cared enough to put yourself out. Petition Facebook to get your profile reinstated (I'm assuming you weren't really impersonating someone else). Keep that profile up so the others can reach you when they're ready. \n\nAlso, there are great ex-homeschooled support groups online. You aren't the only one who's been through this. Get connected with them and form a new logical family since your biological family is such as failure. \n\n**Edit:** Of course there's a subreddit! Try /r/homeschoolrecovery as a starting point",
            "Yes, you did the right thing.\n\nA surgeon has to damage the body in order to do something that is needful that will help the body more than it was hurt...but that doesn't mean that the body isn't injured and doesn't feel pain from the surgery.\n\nWhat you did was surgery of another kind: you did something that was needful, despite the hurt that it would cause in the near term, in order to hopefully make things better in the long run.\n\nThere's no way to tell, now, whether you can reconcile with them.  That will depend entirely upon time, and upon whether they come to realize that you did what you did out of love for the kids, and not out of malice. \n\nFor now, all you can do is hope that what you did will benefit the children, and wait.\n\nYou did the right thing.  Never forget that.",
            "You absolutely did the right thing.  This is why CPS exists.\n\nThose poor kids.  The best you can hope for is they are relocated, and they understand what you did later in life.  \n\nI'm sorry you have to go through this.",
            "Although you did the right thing, the most important point is to **get out** of this \"religious community/cult\" that you are in and distance yourself from them as much as possible. They are doing you a favor by cutting you off. \n\nYou don't reveal much, but please step out into the world as much as you can. Go to college if you haven't already. Once you are self-sustaining and on your own, you can begin to look towards helping some of your siblings.",
            "You did the right thing. They kids are being neglected. \n\nThe family is all in the happy place of denial to keep the dysfunctional parents happy. You showed them reality, so they either have to (a) admit you're right, take a hard look at themselves and make changes, or (b) act like you're the anti-Christ. \n\nSo obviously they picked option b. In a way, it has nothing to do with you. They would demonize anyone who challenged their denial. \n\nWhat that means is, you won't be able to reconcile until either you are willing to say you were wrong and all the terrible things they said about you were correct (don't do this) or until enough time has passed that they can go into denial that it ever happened. \n\nIn the meantime, it's sounds like you're not flush with cash, but if there's any avenue to get counseling, you should look into it. If you're in the US and have health insurance, it may be covered. \n",
            "> and is claiming she’s gonna report me to the police for slander.\n\nBeing that slander is a civil matter, they won't give a rats ass. \n\nI suppose this threat only serves to illustrate the failings in her \"education\". ",
            "Give it time. Possibly a lot of time.\n\nEventually your younger siblings will hopefully realize that what you did was in their best interest. You reported an abuser and it revealed that she'd already done plenty to brainwash and poison your family against you. You did the right thing, but you probably won't be able to reconcile with your step mom.",
            "> Did I do the right thing?\n\nI think you calling CPS was appropriate.  I think you saw serious neglect going on and wanted to do something about it.  I think you knew the consequences but you also knew that talking to your step-mom about your concerns would have been unproductive.\n\nI'm not surprised a lot of your family reacted this way.  You need to remember, CPS has no magic wand to wave that will make your younger half-siblings suddenly get a better education while remaining at home with the family that loves them.  They are outsiders, and they can take kids away from families.  Also, there's a huge stigma associated with getting the attention of CPS.  \n\nWhen you feel sad about feeling cut off from your family, remember that you chose to accept that consequence in order to help Lucy and Joe.  If they get a better education, if they grow up better because of you, it'll be worth it.",
            ">Molly is extremely mad at me\n\n\nIf you get a chance to talk to her, be sure to let her know how hard it is for you/Ron to be struggling with minimum wage/getting a GED in your mid-twenties.  At 17, living at home, she may not think it's a problem, or realize how unnecessarily hard/ limited her adult life will be without a decent education.\n\n\nIf Molly won't deal with you, see if Ron can talk to her. Now that CPS is going to step in and make sure your sibs are getting an education, you don't want her to be stubbornly uncooperative just because she's mad at you. She also has a lot of power to set the tone for Joe and Lucy; hopefully she/Ron can start to counteract the neglectful attitude your moms have toward education.\n\n\n_Btw, what's Julia's deal? Is she still living the \"cult\" life even though she moved away?_",
            "You definitely did the right thing. I doubt you'll reconcile with your dad and stepmom any time soon due to the fact that they're morons who woukd rather rationalize this as being your fault for reporting them rather than their fault for abusing and neglecting their kids. I think you will probably be able to rebuild the relationships with at least some of your siblings, but they may not be receptive to any attempts to reach out until the situation has cooled off, or possibly until when/if they're out from under your parents' thumb. ",
            "Please check out Libby Anne's blog Love, Joy, Feminism as well as the associated network of former homeschool and quiverfull blogs.  There is a lot that will seem familiar to you and show you how to draw boundaries with your relationships to your family.\n\nGood luck.  You've done the right thing.",
            "Sometimes, the right thing is not the easy thing.",
            "> You have enemies? Good. That means you've stood up for something, sometime in your life. - Winston Churchill\n\nSeriously, look at the quality of the person who hates you, and see what it says about you. I would relish the hate of people who do things like this to their children.",
            "> I now have no family members left (besides Ron, thank bejeebus) who want anything to do with me. I feel like I make enemies everywhere I go. Did I do the right thing?\n\nThis is what abusive people do. They make you feel like a bad person for calling doing what's right.",
            "You did the right thing.\n\nOf course they will shun you now. That's not just what abusive parents do to family members who don't play along, that's what cults do to people who leave. You're dealing with both here. They have a ready made structure for labeling you the enemy who betrayed them to wicked outsiders.",
            "You did the right thing trying to protect those kids. If your family members can't see that then they are abusive selfish jerks who don't deserve you as a son/brother/etc. If you give it time, who knows maybe they'll cool down and open up to you again. But I think the important thing here is to recognize that your ethical and moral beliefs are different than theirs and that being in conflict with someone on that level can make relationships very difficult to continue. ",
            "You totally did the right thing. Well done for recognising that this was an abusive situation, and taking steps to solve it.\n\nYou're going to have a VERY rough time with your family for the next while, and possibly for the rest of your life. They won't understand that you did that to help them, certainly not now, and maybe not ever.\n\nBut rest assured, you DID help them. In the long run, things will work out better for everyone, even if that means you won't have contact with certain family members anymore.\n\nGood luck with this, buddy. I'm rooting for you.",
            "My grandmother used to tell me, that if the family ever became immoral and dishonorable, then it was my moral responsibility to turn against them, as a way to make amends for what they had done, this in my mind is what you did. You're family was in the wrong, behaving shamefully, and you did your duty to correct their path even if forcefully.",
            "Former homeschool kid here! You absolutely did the right thing. It's important that your siblings know that they have a right to an education. There's still time for them to realize that you were right. You may just have to wait a while.\n\nIt sucks and it's hard, but you should find some peace in the knowledge that you acted to defend your younger siblings. DM me if you need any support!",
            "Don't bother trying to talk to them. They don't understand that what is going on is wrong. You did the right thing by calling CPS and they're probably pissed at you because they have to suffer the repercussions of doing the wrong thing (i.e. step mom is in legal trouble and siblings have to do their schoolwork which they don't want).",
            "You did the right thing.  You and Ron knew/wished your lives could have been different and hopefully your siblings can get the support they need to not be neglected (not having heat, proper clothing, poor education, dropping out of alternative education to work, not having enough supervision)  You did a hard thing, but it is the right thing.  Hopefully your siblings can come out from under step moms abuse/control and will see the light down the line.",
            "Your family may hate you, but there's a ton of us folks thanking you for being concerned enough to make the call. \n\nWhat you did is admirable. You should feel proud you stood up for the right thing. ",
            "> is claiming she’s gonna report me to the police for slander.\n\nSlander is a civil matter, not a criminal matter.  She can go ahead and call them, though.  Don't expect much to happen unless they tell her to talk to a lawyer.  And even then, Julia can't sue you unless you slandered her specifically.",
            "Not only did you do the right thing, but you are my new hero.\n\nI grew up like you. \"Homeschooled,\" abused, spent more time doing labor than doing schoolwork. \n\nI think you know that if someone had done this for you when you were young you'd have been better off. If someone had done this for *me* as a kid, I'd have worshiped the ground they walked on for the rest of my life.\n\nYour little siblings are young enough to have a chance at catching up. You and I both know what that will mean for them.",
            "You did the right thing. You have more integrity, better morals, and are far more selfless than your siblings.",
            "You did right for your siblings. Never doubt it. \n\nPlenty of other people have edified you here using better words than I can manage, but I wanted to be another voice in this sea. You. Did. Right.",
            "Your family may never see it, but you did what was best for those kids. You gave them a chance at a real future. That level of neglect, especially toward children in the stages of their lives where they are coming into themselves, is unacceptable. You did well to look out for them. I hope that they thank you for your intervention someday. ",
            "You know how sometimes a (good) parent has to do something tough (like corrective discipline) for the kids best interest, even though the kid gets angry at them for it? That's what you've done. You've placed the well-being of your siblings above your desire to be liked by them. OP, I cannot applaud you enough - you made the hard choice but absolutely the right choice; you've given them a chance at life. You are **wonderful**.",
            "Sounds like you did the right thing.  Jehovah Witnesses get shunned by there families for in my opinion ridiculous reasons.\n\nI vaguely remember reading another thread on here where a family member brought up some legitimate issues about the father regarding dysfunction, abuse and or alcoholism.  The family member felt like for some strange reason everyone was mad at him and gave the father a pass.  \n\nSomeone mentioned in the comments that this occurs in dysfunctional families because he upset the group homeostasis. I couldn't find anything on google about it. Guess it's a fancy way to say everyone was used to the status quo, don't rock the boat sort of thing.",
            "I tend to think you did the right thing. You didn't look at what it would cost you.. you just said this isn't right and took steps to fix it. Yes it is hard. It is in their best interests even though they may not know that yet.",
            "DO NOT FEEL GUILTY!!!! YOU DID THE RIGHT THING! ",
            "You did the right thing.",
            "You did the right thing. Try and look at it this way, is it really worth not saying anything just to have your family talk to you? Is it worth being quiet about it so your siblings grow up without any education or skills or drive to succeed in life? I'm going to guess that if you did not report them, you would regret it for the rest of your life. I'm also going to guess that in a few years, your siblings are going to thank you for pushing for them to have a proper education.\n\nDon't be too hard on yourself, you really showed how much you do care about your siblings. And good for you for trying to better your life. Keep it up!",
            "Sometimes doing the right thing just sucks. It doesn't make it any less right, but it sucks. Try to keep in mind how you would feel 10 years from now if you hadn't done anything, watching your siblings struggle when you know you could have helped. Someday your younger siblings will understand that you are/were trying to help them. Be gentle with yourself while this settles down. Life is hard and you were brave enough to take a stand. <Hugs> ",
            "YES, you did the right thing. You are trying to give your younger siblings a much better life. They may not see it now, but, they will eventually. I wish the institutions that offer the homeschooling programs had much better control over what happens in the house. They make it too easy to cheat the system that ultimately only hurts the child. Give your family time to cool off and see where it goes and count your lucky stars your best friend/ step brother is still on your side. ",
            "You did the right thing, but your family will not see that for quite a while.",
            "I am so so sorry, OP your parents are terrible people. The road ahead will be long and hard but you and your siblings are better off for it. It's a good thing you did because that is NOT a safe environment for them. As a former homeschooled kid this especially pisses me off. This is NOT what homeschooling is meant to be used for and it makes me sick that abusive assholes like your family use it for their own gain. Your family is selfish and cruel and what they are doing to your siblings is wrong. I'm glad you got out of that and are moving on in life. I truly wish you all the very best, OP. Get your life back, man.",
            "So you're from a cult?",
            "You did the right thing.",
            "[deleted]",
            "I'm a mandated reported, and you absolutely did the right thing. Your step-mom is neglecting her children, and it will have major negative repercussions on their lives. Hopefully they get into a public school and can catch up as a result of this.",
            "Doing the right thing often comes with unwarranted consequences.\n\nI was a whistleblower at my last job, it was a weird situation. One brother was the owner but would just pop in every once in awhile to make decisions, never really working beyond managerial things in the office. The other brother was in charge of the kitchen and accounting and stuff like that. There is a strict policy that all staff had to pay for their food, even the brother who ran things plus the head chef who made the menu and worked just as hard as any cook. The only exception was the owner. Who knows maybe he had a few more exceptions but decided to lie to employees about it.\n\nI started working closing shifts, and noticed that a few people were abusing things and asking for food without ringing it in or paying for it first. I asked the brother who ran the kitchen if that was acceptable and he said no, only cook food that has been rang in first.\n\nShortly after that one of my fellow cooks, who was constantly being made fun of for not being that bright (sad thing is he wasnt stupid he was just intellectually lazy), being lazy (physically), and being gross (he would pick stuff up off the floor and put it on cutting boards or wipe his face with a towel then put it on clean plates), exploded on me and I gave him an earful in return. He called me an asshole, he told me that everybody hated me, he called me a narc... I asked him what the hell was going through his head, to hate me so much and to stick up for thieves, who weren't stealing from some big faceless corporation but rather a small business. How it wasn't fair to those who actually pay for their food.\n\nThe owner decided that he like the other guy more than me and I started losing hours. I guess it pays off more to try and talk everyone's ear off and be popular than it does to do your job well and take pride in it.",
            "Religious homeschooling should be considered child abuse by default.\n\nYou did the right thing. Hopefully your younger half-siblings will receive constant monitoring now, so maybe they're not entirely hopeless like your (step)sisters.",
            "You did the right thing ",
            "You are a good person. Sometimes it's hard to do the right thing. If you don't have a loving family you can still have love in your life and those who love you will be your other family.",
            "You absolutely did the right thing.",
            "You did the right thing. Ron needed help (actually the whole family does) and you did something about it. well done :)",
            "You are a John Snowden. Your life situation may suck, but know you made a difference. ",
            "I'm not sure what you expected. I mean, I DO think you did the right thing -but you really thought they wouldn't mind? Yes, if you try to have my kids taken away by CPS, I'm going to block you on facebook and hate you -even if I'm dead wrong and you're totally right. You did what had to be done for the sake of those kids -now you have to expect animosity and be ready to push through it and stand up for yourself. \"I'm sorry you hate me but I did what I had to for the sake of those kids. You may not understand and I certainly don't expect you to thank me, but YOUR NEGLECT is at fault, not my report.\" Even if you don't say it, you have to internalize it.",
            "TIL whistle blower doesn't mean blowjob giver ",
            "Tough situation. Did you make the wrong call so to speak? Not in my opinion. It might have been better to have a serious sit down with your parents to express your concerns first. Hell, even tell them if it continued you were going to have no choice but to call CPS. Once CPS they're involved things can get really ugly and I'm not sure the kids necessarily end up better off. You did what was best for the kids though, and hopefully they'll understand that someday, even if you spoiled their freedom and fun in the short term.\n\nSidenote, I just want to throw out there that homeschooling is not always a bad thing. My children are home schooled, though my wife is a certified teacher and does it professionally. Both of my kids are very bright and well above grade level in their education. They have weekly activities and even other group classes with other kids and plenty of friends, so they get plenty of socialization too. The schools in our area are pretty crappy and I don't think bad public schools are necessarily good to subject your kids to if you're trying to raise kind, thoughtful human beings. On the other hand, my wife also evaluates other home schoolers and there are definitely some bad apples out there who give it a bad name.",
            "No, calling CPS is never ok. They are evil. ",
            "[removed]",
            "[removed]",
            "This is going to come off as harsh and get down voted into oblivion but in my opinion you did your younger sibs a disservice. How? Well, are you aware of how broken and screwed up the foster care system is? There is a damn good chance that those under age minors will be taken into care and when they're older like you described they don't go to private homes they go to group homes. Sometimes they even end up in juvenile detention or mental health facilities for lack of housing. \nYes, they're being neglected. But at least they have each other. At least they aren't in danger of being raped, molested and severely emotionally scarred by the broken CPS system. \nSo, I do understand your family's anger. I do not in any way shape or form agree with what's happening to those kids but there may have been a better way to go about solving this problem."
        ]
    }
]