[
    {
        "post_id": "4jwqj0",
        "author": "oversightovermind",
        "title": "(Update) I (25F) want to talk to a hot guy who I can see from my office window",
        "url": "https://www.reddit.com/r/relationships/comments/4jwqj0/update_i_25f_want_to_talk_to_a_hot_guy_who_i_can/",
        "score": 2050,
        "num_comments": 501,
        "created_utc": 1463579286.0,
        "selftext": "Update to https://www.reddit.com/r/relationships/comments/4jlt53/i_25f_want_to_talk_to_a_hot_guy_who_i_can_see/\n\n\nSo we met! Thank you all for your comments, you talked me into doing it and I’m so glad I did. I made a little \"coffee?” sign as a few of you suggested and held it up after our morning wave yesterday. I didn’t put anything else on the paper because I didn’t want to look like a keener but we managed to set something up pretty easily. \n\n\nAnyways it went really well. There were just a couple things that I'm not sure about. He's suuuuuper good looking in person, he's really tall and fit and he looks so good in his uniform. We hit it off pretty well. We had coffee and lunch yesterday and we are going for lunch again today, and we've been texting a lot too. When we were walking back after lunch we walked past one of his coworkers who was like “hey its you!” and I guess they were also telling him to contact me. He told me his Christmas sign was meant for me and when I didn’t make a sign back he just figured I wasn’t interested in talking to him but I only didn’t make one back since I didn’t know for sure it was for me. \n\n\nOne of the things I wasn't sure about is his age, he's 8 years older than me. I don't think it's necessarily a deal breaker but I've never dated someone that much older because they usually want to get married and settle down right away. That brings me to the second thing, he's technically married and is in the process of divorcing and it will be finalized in a few months. Not sure how to feel about that one… he said he is very happy about it but I have to wonder what the cause for the divorce is, but that’s not something I should just come out and ask though right? Also this is stupid but he’s one of those guys who sits with his legs waaaaay apart and I’ve always thought people who do that are assholes but maybe he is an exception to that rule! He offered to come get me when my car broke down yesterday so I know he's a good guy. \n\n\nEither way he seems like a lot of fun and I’m glad I finally had the courage to reach out. Thanks reddit!\n\n\n**tl;dr**: we met up and he seems like a really cool guy. ",
        "permalink": "/r/relationships/comments/4jwqj0/update_i_25f_want_to_talk_to_a_hot_guy_who_i_can/",
        "comments": [
            "25 and 33?  That's not unreasonable, by the formula the lower range for 33 is 23ish so you're definitely in an age gap but it isn't unworkable. \n\nThe wanting-marriage thing you'll have to decide for yourself. See how it goes before you make to much judgement. He's just getting out of a marriage. He may want nothing to do with it for a while. \n\nAnd on that note, I wouldn't make judgements based on his divorce. Lots of people get divorced for lots of reasons. And if he's getting divorced I really wouldn't consider it cheating for him to be starting to keep his options open. Emotionally he's made the choice to start leaving that relationship. Do be aware of rebound. \n\nBut, if he's now getting divorced, was he married when he was window-flirtingish? Just things to keep in mind. It's not really damning imo, just another element to be aware of. \n\nI'm glad you guys met and it seems to have gone well :)",
            "Perhaps it would be best that you stick to coffee, lunch, friendly things while his divorce is being processed. You can get to know him better and ask about his divorce before you decide anything.\n\nAs for the age gap, the older you get the less it matters. If he is just getting divorced he likely isn't in a huge rush to remarry right?\n\nIt's super cute that his coworkers knew he was waving at the cute girl in the next building, and I think that says something about him as a person. \n\nI'm very glad your coffee sign worked!",
            "I really just want to say that tall guys often sit like this because anything else is uncomfortable. Next time you have the chance, sit down in a chair meant for children and notice where your legs end up. ",
            "Things to consider are of course the age gap, but at 25 and working you're both at the same phase in life; the divorce could be tricky if there's kids, but if not it might not be a big deal; he's at the 'settling down age', I guess, but if he's just out of a marriage then he'll probably want to take it slow.\n\nYou've only just met him, so if you wanna take it slow, then that's what you should do! No need to worry too much just now, if he seems so nice!",
            "I'd get confirmation for that divorce before I invested too deeply, OP.  Stories about a troubled marriage on its last legs are classic cover for affairs.   A lot of guys can get enthusiastic about a new flame but not have the guts to end a bad thing.   You could be wading into a mess. \n\nAdd him on Facebook, see if he's skittish about bringing you around his place. ",
            "Wasn't this the plot of a Taylor Swift video?",
            "This is cute. A total chick flick in the making.",
            "That age difference shouldn't be an issue with 25 and 33. It's when it's, say, 17 and 25 that there is a power differential created by the age difference.  Also in your case the circumstances just aren't there that would cause people like me to give him the side-eye. He didn't go out looking for a younger woman. \nHappy for you that you made this move and hope things work out for you.",
            "Just take it slow. Age gaps can be bad because of power dynamic and being in different stages of life. It doesn't really sound like that's a problem with a mid 20s and early 30s gap. Don't assume he's looking for something serious already, just go with the flow.\n\nI'd also keep an eye peeled to make sure he's *actually* separated and in the process of divorce.\n\nOut of curiosity, what'd he do when he saw the sign? Did he sign back? Sounds cute.",
            "For what it's worth, I'm 26 and my boyfriend is 32 and honestly I hardly ever notice the age difference, except when we bring up pop culture from our childhoods, LOL. I think the key in age difference relationships is 1) if there is an accompanying power differential, and 2) if the 2 people are in the same or different stages of life.\n\nYou're both clearly in the same stage of life (working, adults) and there's no clear power differential due to age or status. I don't think the age difference will be an issue. \n\nAs for the divorce thing - I understand why this might be something you're worried about, but I don't think it's worth writing this guy off immediately. Marriages end for a lot of reasons, and oftentimes they don't end because the people in them are bad people, they end because they realize they aren't compatible or aren't happy anymore. \n\nBesides, just because you met up with him doesn't mean you're going to marry him or even be in a relationship with him! Just take things as they come and spend this time getting to know him without worrying about whether or not you're going to date him forever and ever. If the divorce is an issue worth worrying about, it will become clear as more time passes. \n\nThis is a wonderful update! Good luck, and I hope things work out.",
            "Two things-  \n1-  25 and 33?  That's no big deal.  As a matter of fact, that's your ballpark, now.\n\n2-  Verify the whole divorce deal.  That may be a lot more trouble than it's worth.  \n",
            "I would stick to coffee until his divorce is final.Other than that I wouldn't worry too much. Hope it ends up great!",
            "CONGRATS!!! The age difference isn't that bad at all.  If he's divorcing, it's likely he's not going to want to rush into another marriage that fast.  It's just coffee.  Do lunch and another coffee.  Keep it in real time, don't think too much about the 'what if's' about the future or worry about anything that hasn't happened yet. ",
            "> he's 8 years older than me. I don't think it's necessarily a deal breaker but I've never dated someone that much older because they usually want to get married and settle down right away. That brings me to the second thing, he's technically married and is in the process of divorcing \n\nHahaha one of the greatest transitions I've seen on anything ever",
            ">he's technically married and is in the process of divorcing and it will be finalized in a few months\n\nJust be careful to not be the side girl...",
            "The timeline for the divorce is funny.  You're worried about dating a guy going through one, he didn't have a problem writing a christmas thing for you 5 months ago.  Kinda odd, but who knows how long/contentious the divorce is.  Just something to keep in mind.",
            "Regarding the age and divorce thing, I met my boyfriend when I was 32 and he was 24.  I was technically still married and waiting for the divorce papers to finalize. Shouldn't be an issue unless the divorce is more complicated with kids, house, etc. \n\nNot sure about your guy, but I certainly wanted to take it slow after the divorce.  Still together two years later, so give it a go OP. ",
            "Wait, wait, wait...backup... How exactly did the sign thing go down? That was the whole dilemma from your first post and all you give us is that you held up a coffee sign?? What happened after that? Did he hold up a sign with his ph# or what? Don't leave us hanging.          \n          \n8 years isn't a deal breaker but please be aware of red flags. Sounds like you already are so that's good. The fact he told you upfront about the marriage thing is a good sign too (\"sign\" heh heh). I'd want to know if he still lives with her. If he does then I'd say back off for now. No reason that you have to rush things. If they are separated and living apart then it sounds fine. My ex and I didn't get divorced for about 8 months because it wasn't a priority and I was the one that had to pay the money to file for it. It was a few hundred dollars if I recall. But we were way over and not living together even though we weren't divorced.         \n        \nIf he sits on the subway, for example, with his legs far apart and takes up other people's personal space then yes, that's being an asshole. If he's doing it because he's tall and it's comfortable to sit like that and he's not invading other's personal space then whatever.       \n        \nSo cool to read this update! I didn't post on your first one because everyone had already given you great suggestions but I was curious to know what happened! Hope it works out for the best!",
            "> He offered to come get me when my car broke down yesterday so I know he's a good guy. \n\nDon't be so quick to judge a person. He is interested in you of course he would come and help. I don't know if he is good or not, but don't pass judgement so quickly.",
            "Doubt he will be rushing to get married if he is in the process of a divorce. I would maybe keep things a little more casual or friendly until you can find out more details. Your age difference is not that bad. But he didn't say if he had any kids with soon to be ex...",
            "I was all excited for you up until this\n\n>he's technically married and is in the process of divorcing and it will be finalized in a few months. \n\nProceed with caution.\n\n",
            "Yay! I've been hoping you would update. I'm 8 years older than my SO & it's worked out great. In your comments you said he doesn't seem to want to take things too slowly. Just remember - you are in charge of what makes you comfortable. Take things slow, get to know him, if anything, you found a friend in the next building.",
            "What the hell does the way he sit have to do anything? Men sit with legs far apart because it's more comfortable because of our balls. We mean absolute jack by it. Two guys with completely different personalities will probably do it the same way.\n\nEdit: Just saw in an earlier comment you'll stop judging based on how we sit. Thanks!",
            "Hey OP!\n\nMy boyfriend is 33 and also mid-divorce!  (He also has two kids).  I'm 28, so I'm 5 years younger than him.\n\nI have been with my boyfriend since January but not official/exclusive until March.  I kind of waited until he offered some information and after a bit of getting to know each other, he was fairly open with the reasons.  Over time he's shared a little more with me.\n\nEventually I do think you need to know, but not immediately.\n\nI think mid-divorce should be a flag of concern (yellow flag maybe?).  It's not necessarily indicative of a guy not ready to date, but it might be.",
            "Well, when I was separated from my wife and going through with the divorce, but before it was final, I met a girl who was 8 years younger than me. We dated for a year, during which time the divorce became final.  Though we didn't last, the relationship was amazing and didn't end for any reasons related to age or marriage. So, don't let things like that cloud your judgment.  If you want to keep seeing him, then that's all you need to know.",
            ">I have to wonder what the cause for the divorce is, but that’s not something I should just come out and ask though right?\n\nSure, ask.\n\n>I’ve always thought people who do that are assholes but maybe he is an exception to that rule!\n\n...or your good first impression and his management of his presentation means you don't get to see the ways in which he's an asshole yet.  People usually save that stuff for later.",
            "[deleted]",
            "The age thing is okay but the marriage thing can be a red flag. What if he is cheating on his wife with you? So many men use that excuse. \"Oh, I am married but I am not happy and we aren't in love. I am going to divorce her and ....\"\n\nHe does sound too good to be true. It is worrisome.",
            "An age gap less than 10 years at this stage in your lives is not a huge deal. Most of the people I know have partners in the 6-7 difference range anyway. /r/relationships loves to admonish relationships with age gaps - even minor ones - so don't expect an unbiased response there. \n\nJudge him for his other qualities. Many people aren't looking to settle down in their 30s. That's a stereotype.",
            "Maybe he spreads his legs way apart when he sits because of his massive genitalia. I'd say if all goes well, you'll be well... ",
            "Where can I find one?\n\nIn all seriousness, how long has the divorce been in the works? You guys have been eye flirting for months. \n\nedit: My main thing is when he held up the sign for Christmas, were they still together or were they separated? Because he'd been hoping to get some feedback. If they were separated, then I would say no problem. If they weren't, then I'd be a bit uncomfortable with it. That's just me. ",
            "Nope. Call a lawyer, hit the gym and delete Facebook.",
            ">but he’s one of those guys who sits with his legs waaaaay apart and I’ve always thought people who do that are assholes\n\n\nI mean really?? Judging someone by the way they sit? ok...",
            "[removed]",
            "25 and 33 isn't bad. If the divorce is that close to being finalized, he's probably got all the stressful bullshit out of the way too. Once he gets to know you, he'll probably open up more.",
            ">Also this is stupid but he’s one of those guys who sits with his legs waaaaay apart and I’ve always thought people who do that are assholes but maybe he is an exception to that rule!\n\nHe's only an asshole if he's preventing other people from sitting or enjoying their space because of it.",
            "After a shitty week this has really cheered me up. Keep us all informed as to how it goes",
            "OP, thanks so much for the update! I was really hoping you'd fill us in on what happened!!  This was one of most interesting r/relationships posts I've read in a while.\n\nI'm glad you took a chance on initiating that contact (overcoming that he'd thought you had written him off).\n\nI think age gaps and previous marriages are things that are dependent up the very specific context of each person/relationship. Not all 5+ year age gap relationships involve a controlling, abusive older person and not all divorces are the result of flagrant infidelity/serial cheating. \n\nAs a a 6'01\" guy, I'd concur with other posters the legs spread apart stance is quite typical of tall people. It can be bad for back posture, but sometimes it's the only way to stay comfortable seated in a cubicle for long periods of time!\n\nHope everything goes great for you! Take things at whatever pace you're both comfortable with!",
            "Honestly, try not to focus too much on all that stuff. You're only going on your second date! If these things are issues, they will manifest over time. You can decide then how you want to proceed. Enjoy these dates for now! You certainly don't have to marry the guy. I'd just see how it goes for a while, and cross those bridges when I came to them. ",
            "This story is just too cute! \n\nI wouldn't worry about the age difference. Like others have said, it's not huge and would diminish in the future. \n\nI think it's a good sign he told you about his divorce status. It's not a reason to back away, just to be cautious. I would definitely ask more about it, but maybe not until you hang out a few more times/feel more comfortable. \n\nGood luck! Even if it doesn't work out, this is a great story :)",
            "I demand a future update when the rights to your love story is sold and a film adaptation is being made starring Ryan Gosling. \n\nI was rooting that you two would get coffee and all would be good. Thanks for the update!",
            "The leg thing is because there's really no other place for the legs to go, aha. I think it will be alright age-wise, because in the end, it's just how you feel about each other and not how old you are. And I (personally) don't feel like it's that much older, as long as he is respectful of you and your boundaries (but any aged person should do that!) I feel like you shouldn't \"fall in love\" with him (if it even goes that far) until he is fully divorced. My mother once dated someone who was in the middle of the divorce, but he backed out and stayed with his wife. I just worry a bit about that because I don't want you to get hurt. But honestly, it sounds like this went really well. I ship it. ",
            "Your concerns are valid but small in the big picture. I say go all in! YOLO and all that. I really hope things work out for you with or without him.",
            "33/2+7= 23.5\n\nYou are good. ",
            "I think the age thing has a lot to do with life experiences.  Sounds like you guy are similar at least besides the marriage.  \n\nI would look at the timeline though, was he making signs for you before his marriage broke up?  Just take it slow OP and make sure he gets divorced when he says he is.   ",
            "The only thing I would be majorly concerned about was the reason for his divorce and the time frame and I would want proof that he wasn't seeking you out before he decided on the divorce/separated from his wife and that it was going to be finalized and would want updates regarding that. Good luck and congrats! ",
            "My parents met while my dad was only legally separated from his first wife. The divorce paperwork was finalized a day or two before my parents eloped. My parents were married over 30 years when my mom died.\n\nBasically, don't let the divorce thing scare you off. Take things one day at a time.",
            "The fact that he's going through a divorce means he's less likely to want to rush into a serious longterm commitment soon. ",
            "Dont worry about the divorce thing. I started dating my bf when he was technically still married and it really wasnt a big deal. He got divorced bc he was no longer happy and thought they both deserved happiness. Things just happen in life. Dont overthink it. ",
            "I'm totally living vicariously through this post, everything about it is adorable and I can only wish you good things come from it.",
            "This is a great update, OP. Only thing I would be careful about is the marriage. Make sure he isn't lying, and then you'll be all set to go! Make him prove that they are getting truly divorced, and don't rush. Overall, I like this update!!! Go OP! ",
            "Yay! I was hoping you'd update! Awesome that you guys hit it off. I know you're questioning a lot of things, but just take things one step at a time and as they come. :) ",
            "The age gap is totally fine and if he's newly divorced (or about to be) I doubt he's in a huge rush to get married, so that solves that concern. \n\nMy last gf was 8 years younger and it wasn't a thing at all. Current one is 12 years younger and it's a bit more obvious but never been a source of trouble.",
            "For what it's worth, a friend of mine got together with her now husband about 3 years ago - similar age gap, he was also going through a divorce. No nasty reason for the divorce, just didn't work out and they both moved on. They're incredibly happy together - don't get ahead of yourself about specifics right now, just keep your eyes open and enjoy the journey! ",
            "OP, I love this story! One piece of advice from someone who learned the hard way: proceed with caution on people who are getting divorced. Their lives are in a LOT of flux, especially if there's kids, money, possessions, bad feelings, etc. They may think they're ready, they may swear up and down they're ready, but in some cases they just are not ready or in a good headspace. The fact you're looking to keep things pretty slow/casual is perfect. \n\nGood luck to you!",
            "I'm 24 with a 30. Not exactly the same but kinda close and we don't even think about it cuz we are really similar. I feel like as you get older, age matter less.. Kinda? Like in your early 20s with a late 30s people would be kinda \"oooh\" but mid 20s with early 30s isn't like that at all. And if it was 34 and 43 no one would bat an eyelash",
            "My advice is just play it by ear! He isn't looking to get married so just go out and enjoy your time together, if it works out great! If not, no big deal. I hope things work out! Best of luck amigo!",
            "I wouldn't worry about the age. Being compatible in terms of maturity and where you are in your life/development is more important than numbers, I'm 23 and the people I've dated recently have been 31-35. It's not a big deal.\n\nI would be hesitant on the marriage point though. On the one hand, my best friend started dating her current long-term partner while she was still married and separated, and they couldn't be happier. However, there are plenty of guys who *say* they are getting divorced/are going to break up/whatever so that they can date someone on the side while staying comfortably married. If you don't know him very well, I might wait on dating him or see if he can get someone to back him up, since you don't know whether you can trust him that much yet.",
            "Glad it worked out! Just, definitely let him finish getting divorced before spending too terribly much in time and energy on him. Unfortunately, plenty of guys use that as a line when they are really just plain married. If his divorce really is that close to finalized, it's not too unusual - and quite prudent  - to take it a bit slow.",
            "That's the cutest thing I've read in while haha ! Can't stop awing at the way you two met >< I hope it will work out ! And well I think age doesn't matter after a while. He'd probs won't get into marriage any time soon since divorce.",
            "If my boyfriend wouldn't have wanted to go out with me during my divorce process (they were adulterous) I wouldn't have the love of my life. I understand the reason might make a difference but don't discount him because of that. ",
            "My parents are exactly 8 years apart, Dad being the older one. I wouldn't worry about it. The older you get, the less it matters IMO. The reason you see people freaking out over an age gap on here is because often, OP has been dating someone 10yrs older since they were like, 17 or something. THAT is in appropriate. At 25 and 33, he's not grooming you for sexual abuse I'm pretty sure. Still keep and eye out though.\n\nAs for the leg thing, I'd just gently bring it up and maybe show him a few articles about it if it REALLY bothers you, but I wouldn't do that right now. Wait a few months and see if it continues to bug you. If you end up on a crowded subway/bus with him and he's doing it, politely ask him to make a little room - both for your and the other passengers' sakes. \n\nGood luck, & congrats! This was such a cute story. Reminds me of Jim & Pam from The Office :3",
            "Hes sits like that because balls get hot. Im hot blooded, even if its 50 degrees then my balls are hot. As long as he doesn't do it in such a way that it inconveniences others, like taking up three seats on a crowded bus.\nThis actually kind of blows because im sure there are others with this mentality. But balls get hot, you guys ",
            "Hmm I would slow things down until the divorce is finalised. Way down. If we have learned anything from reading the stories here, it's that you don't want to get into a  mess with someone still in a marriage, no matter how attractive they are. ",
            "Probably not looking for marriage as he is just getting out of one.",
            "Lol of course he's married ",
            "Get a background check on the divorce story.  If it checks out go with it, don't overthink it too early.  You're not obligated to dedicate your life to this guy just to keep seeing him for a few weeks.  DATE him.  The art of dating doesn't have to become a lost one.\n\nA lot of cheaters use \"Oh we're breaking up / broken up / separated / divorced / getting a divorce to trick/convince someone to cheat with them.  ",
            ">he's technically married and is in the process of divorcing and it will be finalized in a few months.\n\nYou don't need to bail, but you should definitely be pumping the brakes. Until that divorce is finalized, you don't want to be getting too emotionally invested. There is always the possibility that they will choose to resolve things, or that they will need to get some closure (one last fling). The last thing you want to do is have yourself as the third wheel in those situations.",
            " >Also this is stupid but he’s one of those guys who sits with his legs waaaaay apart and I’ve always thought people who do that are assholes but maybe he is an exception to that rule!\n\nThis poor man needs to run away fast",
            "Sits with his legs way apart....seriously? Who the hell actually cares about stuff like that?",
            "The cool thing about getting to know someone is that you get to know them.\n\nAbsolutely nothing wrong with asking direct questions and describing what you are looking for.\n\nHis divorce is convenient, because you can use it as a way to keep him at arm's length until you decide whether or not you are compatible. \n\nBe careful not to project your expectations upon him. You'll give yourself tons of anxiety over things that could turn out to be just fine. And, guys will always do something that is a little off. You just have to weigh it against the good qualities and remember that you might have a trait that seems odd to him, as well.",
            "I've been divorced. Most women I've dated seriously generally ask about it. I'm a pretty open guy so it's not an issue and I understand how that question would be important to them. I think it's a reasonable thing to ask especially since it sounds like he's been flirting with you for awhile.",
            "8 years older isn't that big a deal at 25. He isn't necessarily wanting to get married right away, don't overthink it. If he's technically married and getting divorced, just keep it casual for a while until the deal is sealed, don't get too involved. Wait until it all blows over and just keep it very very casual and fun.\n\nGuys who sit with their legs way apart aren't necessarily assholes. If I put my legs together it hurts my back severely because I have lower back problems. Sometimes there's a good explanation.\n\nJust take your time and get to know him slowly.",
            "Wait for a few more dates before you ask why they are divorcing.\n\n8 years older than 25 is not bad. A gap like that will seem less and less consequential with each year anyway.\n\nYou are concerned that he is really attractive...he obviously thinks you are cute though, I mean, he has been telling his coworker about you! I wouldn't worry. People tend to date within their own attractiveness level anyway. You want to know how cute you are? Look at who you attract.\n\nAlso, do not assume that because he in in his early 30s that he wants to settle down soon. Plus, settle down means different things to different people. I am in my early 30s and there were guys that assumed I would get baby rabies? I have never had the desire for babies. My point is, it is really important your goals match up, but you can't assume to know what their goals are, you have to figure that out from them.\n\nHave FUN OP. This is an adorable story and now you two cuties can go on a few dates and see what happens!",
            "Do please check his story on the divorce through public records. A friendly coworker isn't enough. You'd be amazed at the stories I've heard / lived insofar as how far their friends and coworkers may go to look out for each other. \n\nBesides that, enjoy :)",
            "AHAHHHAHA AAHAHAHHAHAHAHHHA AAAAAHAHAHHAHAHHAHA",
            ">he's technically married and is in the process of divorcing and it will be finalized in a few months.\n\nRecord scratch! You might want to verify this - not sure how, just be careful.\n\n",
            "Just one more person chiming in with in a relationship with a similar gap. My partner is 7.5 years older than me. We started dating at 26(me, F), and 33(him. Turned 34 about a month later). Doesn't impact our relationship at all with the exception of me teasing him and calling him old sometimes, or him being shocked when I don't get some his childhood references. ",
            "> sits with his legs waaaaay apart\n\nNow I'm worried I'm an asshole. A lanky asshole.",
            "I often sit with my legs far apart. It's just comfy. I think I'm still a pretty nice person.",
            "> Also this is stupid but he’s one of those guys who sits with his legs waaaaay apart and I’ve always thought people who do that are assholes but maybe he is an exception to that rule!  \n\nOnly way or find out is to see if he also hangs his toilet paper like a savage.",
            "When I saw your OP it reminded of the paperman cartoon! :)",
            "Maybe he suffers from BSTTL....balls stuck to the leg. Syndrome. ",
            "Men and women have entirely different hip structure. Not only that but a mans center of gravity is around his shoulders and a woman's is around her bum. People try their best to sit comfortably and it has nothing to do with being an asshole. Taking up extra space that others could use is shitty though. ",
            "This reminds me of the Disney short called \"paperman\" good luck to you OP!",
            "That age gap is nothing unless you let it. I met my current SO at 20. She was 29. 7 years later....all is good. \n\nIts nothing but a number so long as you are on the same page and you dont let it dictate how you feel about that person. ",
            "I am soooo happy you updated! I have been looking forward to this, I'm glad you did ot! If you guys do end up married, it's going to be one heck of a story to tell the grandchildren ",
            "As my dad always told me, you'd better regret something you HAVE done than something you did not :-)",
            "25 and 33 isn't necessarily a dealbreaker, but there's a bigger gap in life experience if he's been married and you haven't, so that's something that widens the gap between you guys a little, even though the chronological age difference is larger. That said, \"technically married\" is a HUGE red flag for me. I've known more than one person (male and female) who've casually misrepresented the status of a supposedly \"almost over\" marriage to a potential partner. I recommend moving REALLY slowly in any romantic context until you have a better idea of when his marriage will be officially over. Focus on building a friendship before rushing into anything else. Good luck!",
            "Don't discount any of this!!\n\nI met my current boyfriend in a situation not entirely unlike yours; he's a bartender, and last summer a few friends and I happened in the bar he works at. We only exchanged a handful of words but I thought he was really cute and something must have been drawing me to him, because I left my number for him on the back of my receipt when we left. He texted that night, and we've talked daily since (9 months ago). \n\nAs far as age goes, we're five years apart (me late 20's, him early 30's), and if anything I find it perfect since men generally mature at a later age than women, and I've always been more mature for my age due to the way I grew up. Also, if this guy is just getting out of a relationship/divorce, he's going to be in no rush to get married again any time soon. One of my favorite quotes on relationships comes from a John Steinbeck letter to his son, something I remind myself of often: \"And don’t worry about losing. If it is right, it happens—The main thing is not to hurry. Nothing good gets away.\"\n\nBest of luck!",
            "8 years can be a bit of a gap but at 25 and 33 I do think it's less of an issue.  Then again, I'm pretty biased as my SO and I met when I was 25 and he was 34, and 3 years later we're going strong 😀 As long as no other red flags pop up go for it!",
            "I'm way late too this, but I was going through my posted comments and stumbled upon the original post, then this.\n\nIn my mind, they are still dating and happier than ever.",
            "When I was 26, I met my now-husband. He was 35 at the time. I was nervous about the age gap too, but honestly? The only time we even notice it is when we're talking about childhood memories (or when I'm teasing him for being an old man). Don't let it stand in your way! We're wonderfully happy now and I wouldn't trade my husband for the world, even if he is coming up on 40 and I'm not even 30 yet :)",
            "Go on brush your shoulders off",
            "I'm really excited for you! Be careful not to wear rose-tinted glasses through your time with him. I'm glad you're already identifying things that might be wrong. Hope everything works out for the best.",
            ">He offered to come get me when my car broke down yesterday so I know he's a good guy.\n\nUh, no. I'm not saying he's a bad guy or a good guy so don't get me wrong. But I AM saying that even the worst of the worst guys (I'm talking rapists, child molestors, wife-beaters) pull out all kinds of gestures like this in the beginning. In fact a lot of the Worst of the Worst guys even go overboard in doing such things in the beginning, pulling out all the stops way more than an average guy, to get you hooked and also confuse you when they start to act like their true self, later. \n\nIf he's still doing this two years in, you can point to it as evidence of him being a good guy. NOT when he's doing it right up front, it's a nice gesture but it doesn't mean you know his character yet. \n\nAbout the divorce, I doubt you will listen, but I recommend you wait until the divorce is finalized before you start dating. After all, if it'll really be over SOO soon, then it's not a long wait. Right?\n\nThis prevents you from wasting time. ",
            "....whys he getting divorced? \n\nYou seem to have him on a pedestal because hes sooooo hot. ",
            "I dated a guy 9 years older than me... and married him! Honestly, once you're in your twenties age really doesn't matter, it mostly boils down to emotional maturity.  ",
            "Considering that he's just getting out of a marriage I think there's a fair chance that he wants to put that on the backburner for the moment.",
            "I'm glad you finally made contact! Just wanted to comment on your worry about the age gap. My wife is the same amount *older* than I. We've been together for 20 years, married for 16, and now have 4 kids, 3 cats, and 2 dogs. We still act like we're 20 year olds in love - so much so that our youngest (17 year old girl) regularly facepalms herself after catching my wife and I giggling and teasing each other. So that age gap means nothing. It's all the other qualities you would like in an SO and relationship that you should look at. Hope it works out for you guys! ",
            "It's just coffee :) Take your time, get to know him. If there are more really red flags then back away. Good luck with everything! Sounds like it's going well to start!",
            "[deleted]",
            "I'd be a bit concerned about the divorce too. I see a LOT of guys who pretend that they're separated, divorced, or 'in the process' when they're actually just looking to start an affair. \n\nI'd be wary, and perhaps do a bit of light digging to verify his story, but otherwise enjoy the company.",
            "\"guys who sits with his legs waaaaay apart and I’ve always thought people who do that are assholes but maybe he is an exception to that rule! \"\n\nwhat the hell?  I've never once heard that before...",
            "Man that guy must have an easy fuckin life",
            "age difference is nothing...in fact 5+ years older makes for more mature,better fiscally responsible man, imo. My hubby is 8 years older than me and it works.\n\nmarried thing: everyone flirts a little. its human nature.. if they say they don't, i don't believe it. You don't know the deets behind his divorce: it could be any number of things. don't judge.\n\nhave fun. date. move forward. and if it falls apart...you just have to shut your blinds!",
            "You have some very strange peconceptions! Abandon them and find out firsthand instead whether you're a good match :) ",
            "Update on house date please. Postboned?",
            "Keep it casual until the divorce is finalized. \n\nWouldn't want to see you posting here in some time \"my boyfriend said he was getting divorced but he hasn't yet and I feel used. Help!\"",
            ">Also this is stupid but he’s one of those guys who sits with his legs waaaaay apart and I’ve always thought people who do that are assholes\n\nYes, this is very silly  :-)\n\n>That brings me to the second thing, he's technically married and is in the process of divorcing and it will be finalized in a few months.\n\nDo not sleep with him until you have legit confirmation he is divorced.  There are tons of stories that start this way that end in \"He lied to me, he was actually married, I was the woman on the side and now I'm heartbroken\"\n\nPlus, make him work for it.  Guys really do enjoy the hunt believe it or not!",
            "Fuck the age and the divorce thing. Just enjoy each other. ",
            "Just an example of how a similar situation worked:\n\nMy best friend's parents are my ideal image of a working relationship. They met at 24 and 32, when he was going through a divorce after 8 years of marriage. They dated, married three years later (since he's going through a divorce you probably don't need to worry about any race to the aisle), and they just celebrated their 28th wedding anniversary in St Martin. If it's going well, give it a chance! ",
            "Good for you. I wouldn't be too worried about the age gap because you're both in a similar phase of your lives.\n\nI would advise taking it slowly until his divorce is finalized. I'm sure that the reason for it will come up naturally.\n\nGood luck in your relationship.",
            "Sounds like you're getting waaaay ahead of yourself. Go out a few times and see if you even like him. If things proceed in a good way then maybe start asking those personal questions. Age isn't a big factor, i don't think, unless he's really wanting to settle down now. Good luck and just go out and these questions should come up naturally.",
            "I was 24 when I met my then 31 y.o. now 43 y.o husband. I think 7-9 years is perfect. Stop making problems! ;-) Same story for the annoying habits. When you guys are further along, you'll see it as another reason to cuddle! :)\n\nDo make sure he gets divorced though. I once dated a guy who was divorced, then he was separated, then he was sleeping on the couch, and then it became clear that I was the other woman. Each stage took a week or two and it's not an uncommon series of lies. The fact that his coworkers are aware, though, is a good sign!\n\nCongratulations on taking a successful risk! Good luck going forward! :)",
            "It is so hard to find anyone willing to do anything nice these days... So if he treats you right, just roll with it.",
            "Men often sit with their legs spread spent to show their dominance. And if their legs are facing you and they are wide open, then that means that they really, really like you."
        ]
    },
    {
        "post_id": "2r3ltk",
        "author": "friendhelp219",
        "title": "[Final Update] My (28F) friend (26F) pretends she is Japanese, is alienating everyone around her",
        "url": "https://www.reddit.com/r/relationships/comments/2r3ltk/final_update_my_28f_friend_26f_pretends_she_is/",
        "score": 2051,
        "num_comments": 429,
        "created_utc": 1420206604.0,
        "selftext": "[Original](http://www.reddit.com/r/relationships/comments/2qe0ty/my_28f_friend_26f_pretends_she_is_japanese_is/)\n\n[First Update](http://www.reddit.com/r/relationships/comments/2qpw7k/update_my_28f_friend_26f_pretends_she_is_japanese/)\n\n\nHappy New Year to everyone, and many many thanks for all your feedback and advice throughout this whole ordeal.\n\nI appreciate all the people who reassured me about doing the right thing by telling Cara's parents, as it has been something that's kept me quite torn this last week. You guys were an amazing source of support in a tough situation. I never expected this to get more than a few comments, and the sheer amount of feedback has just been shocking. Again, thank you all.\n\nOne thing I'd like to expand on- A few people have wondered how Cara's parents were oblivious to the behavior. As far as facebook goes, Cara had two. She had her parents on a \"normal\" facebook that had a small friends list of relatives and a few distant people from high school. Her main facebook had her japanese name (which she never mentioned to them she had changed) and her main group of friends.\n\nSecondly, her interactions with her parents were short. She kept to herself and stays in her room often when at home. She told them she wanted to broaden her horizons and told them working as a translator would provide a great opportunity for that. They have paid for her trips to Japan under the impression that she was going there to scope out the work scene and to make connections. \n\nShe was careful to keep her home and social lives very separate and her parents never really had a reason to question their daughter about it.\n\n**So this is what went down after my previous update.**\n\nAfter the talk with Cara's parents, I went home and fully expected her to call, message, or even show up at my door. She never did. But, she removed her facebook profile which had her Japanese name, and a lot of information that supported her fake persona. She also deleted her tumblr, which also followed the same vein as her facebook. Everything was quiet for a good two days, and I chalked it up to her being embarassed about the situation and not wanting to talk to anyone about it.\n\nHer mom called me yesterday to wish me a Happy New Year and to let me know what was going on. Basically, this is what happened:\n\nCara got home from her ski trip and her parents were waiting in the living room with print outs from her blog, fb, etc. They confronted her immediately about the profiles and the information posted on there. She tried to tell them that it was for her career in Japan and that the Japanese would be more likely to hire something with Japanese heritage. They didn't buy it and she flipped out. She began to demand to know who showed them her blog/facebook. Now, her mom *said* they didn't tell her, but Im guessing they probably did because she knows its me. Its ok, I sort of expected them to tell her since they are her parents. \n\nAnyway, she had begun to cry by this point and it was hard to get any answers out of her. Her parents basically laid out everything I had shown and told them, esp the part about her dad being her step-dad. They told her they could forgive some eccentric behavior, but not full on disrespect of her parents, nor the needless lying that was going on. They told her she had two options- come down to reality or leave. She has no job, and lives at home for free. Everything is funded by her parents, including expensive trips to Japan. \n\nShe chose to stay. One of the conditions was that she had to remove social media accounts that continued to tie her to the lies. So her Japanese facebook was removed and her tumblr as well. She also had to agree to therapy. Her mom told me they were in the process of finding someone for her to see, preferably every week, so they could get to the root of the problem and begin to break the cycle of consistent lying. They are keeping an eye on her now, mostly because they are afraid she will lash out or do something rash, but honestly I think she isn't going to do anything. She is most likely really really embarrassed that she was outed and just wants everyone to forget it. I don't know how shes going to manage it, because shes going to either have to tell all her current friends the truth, or ditch them altogether.\n\nSo I wished her mom the best and we hung up. I thought that was that, but a few hours later, I get a call from an unknown number. I pick up, its her. She told me she hated me and she couldn't believe I'd do this to her. She called me a whole book of names and said she hoped someone would ruin my life as much as I'd ruined hers. Then she told me to never contact her again and to keep her name out of my mouth. I just said ok and hung up. I knew our friendship was at an end before all of this, but I cant pretend it wasn't uncomfortable to hear how bitter and angry she was towards me.\n\n\nSo that's it. I guess I got what I wanted out of the situation, which was for her to be faced with reality. I can only hope that therapy will help her to reconnect with her real life and to figure out whats going on underneath that whole web of lies shes spun for herself. Yes, it sucks that things had to end how they did, but i dont regret telling her parents and potentially saving her from colossally fucking up her life. \n\nAgain, thank you to everyone whos offered their support and advice. I didnt have anyone solid to talk to about this issue and if it hadnt been for the encouragement of many people on here, I probably would have just backed out. I hope 2015 brings you all great things.\n\n\n\n---   \n**tl;dr**: Her parents confronted her about the lying and gave her an ultimatum. She chose to continue living at home and had to remove the offending online accounts as well as agree to therapy. Called to tell me she hates me and never wants to speak to me again. ",
        "permalink": "/r/relationships/comments/2r3ltk/final_update_my_28f_friend_26f_pretends_she_is/",
        "comments": [
            "You would think that she would realize that people actually from Japan would know that she's lying about her heritage when she's applying for jobs and they meet her.\n\n",
            "[deleted]",
            "As a friend, you did the right thing. You didn't ruin her life, she walked so far off the path that she couldn't even see the path anymore. You called her parents so they can go pick her up and she's mad at you because she was enjoying the scenery? I don't know, this analogy's going off the rails a little bit. \n\nBut the point is, she needed a reality check. *Badly*. And honestly, the only people who can and should handle something of this magnitude were her parents. And you were the one who showed them how far off into the wilderness their daughter was. And they should be very grateful to you, as should your friend, one day. \n\nHer situation was completely untenable, and would have come crashing down on her one way or another. This way it's a controlled demolition instead of an uncontrolled collapse. She's mad at you because she had to build such a huge fortress of deception and lies in order to live in her fantasy world, and now it's torn down. She did that to herself, by lying to everyone around her. One day I hope she will realize what a mistake she had made and appreciate what you did for her. But I wouldn't hold your breath. Just move on with your life and be satisfied that you did the right thing. \n\nGood luck, and happy new year!",
            "Serious question: What is it about Japanese culture that makes so many young people obsessed with it to the point where they delude themselves and pretend they're Japanese? Is it just because of its imported media?\n\nWhile it's a great country to visit, there are a lot of aspects of its culture that aren't exactly admirable and it would seem their society itself is slowly failing. ",
            "> I just said ok and hung up.\n\nShe probably wanted a rise out of you with that phone call, so good for you for not indulging her!",
            "I'm really sorry that you lost your friend and she's so angry with you.  I hope that in time, she'll thank you.  You definitely did the right thing.",
            "You did a good thing. I've worked psych long enough to hope it gives you comfort when I say I'd have done the same. ",
            "You may have lost a friend, but you saved a person.",
            "Didn't you ask which name she wanted kept out of your mouth, the real one of the kabuki one?",
            "If her parents had not been completely paying for everything her entire life, as it sounds like, maybe she wouldn't have taken this delusion to such an extreme. People tend to stay immature into adulthood when there's no repercussions for not growing up and getting at least a part-time job.",
            "You did the right thing and I'm sorry that she's so upset with you. Right now she's probably incredibly embarrassed, but also sad that she's lost this fake life that she loved and put so much effort into. I hope that therapy helps her to realise that it was unhealthy and one day she will be glad that you stepped in. Well done on doing the right thing, even if it made you look like the bad guy to Cara.",
            "My brother is a compulsive liar who has been confronted with reality many many times through the years and it has never helped him to stop lying. There is something seriously wrong in their brains, and her phone call to you illustrates that she is a similar personality type to him. When \"caught\" they blame others instead of owning their part.",
            "as an American who lives and works in Japan, with my American wife who neither of us are delusional about turning Japanese, I really enjoyed reading this and thank you for doing what you did. We sadly use the word \"weirdo\" to describe a lot of people like this, but you exposed it for what it was - illness. Not only do you make her life better in the long run, you make mine better indirectly. I get lumped in with a lot of \"weirdos\" even though I'm here for business!\n\nBest of luck in the future.",
            "I have crossed paths with a lot of people like your friend Cara because I have similar interests and regularly attend anime and comic conventions.  The behaviors you described are pretty common (see r/weeabootales), except for maybe the pretending to have a Japanese father part.\n\nYou did the right thing.  At first I was a bit surprised that you went to her parents, as I probably would have called an intervention with her friends (at 26, I would assume her peers would have been more influential than her parents), but considering she still lives with her parents and on their dime, you probably made the better call.\n\nHonestly, the best person to help her, more than a therapist, I think, would be for her to meet a \"socialized nerd,\" someone who shares her interests but not her delusions and is patient enough to put up with her and call her out on her shit.  I don't know if any of her other friends fit that bill, but if you think she has one, you may want to try to contact him/her and let that friend know what's going on to see if he/she will offer Cara some guidance.",
            "I've been looking into this thread and there are a lot of \"but why do so many people choose Japan\" over their own culture or any other culture. As an average white guy from an English-American atheist family who has almost always been pretty obsessed with Jewish/Hebrew/Yiddish culture just maybe not to weeaboo (Jew-aboo?) levels, I'm going to take a stab at the whole Japan thing. I know next to nothing about Japan that I haven't heard from my Japanophile ex girlfriend, so bear with me and I apologize if I say something racist or inaccurate.\n\n\n\nAmerican culture is flat out *obsessed* with the archetype of the foul-mouthed, uneducated swaggering ape-man who doesn't play by the rules, doesn't care about his family or his nation (unless it's about his perceived rights), and can be counted on to drone on about \"muh guns, muh free market, muh liberty\" and \"gettin' pussy\". You will find your niche groups of people who don't like that, but no matter where you move in the states, you'll find that the 'ideal man' that most people strive to be is someone with a \"fuck my community, what about muh freedoms?\" attitude. I think a good example of a guy like this is Han Solo, or Jack Sparrow, or any of the guys you see driving around in giant pickups with \"WWJD\" stickers on the bumper. I can tell you exactly what Jesus wouldn't do, he wouldn't drive that truck and he sure as hell wouldn't throw his community under the bus for the sake of owning a firearm. \n\n\nWhen I went to college I found American Jewish culture to be most intriguing, particularly the focus on education and the idea that being a man has more to do with being there for your family and your people than it has to do with having a big dick, owning guns, and fathering a lot of kids you don't intend to raise. Similarly, the idea that education and being a scholar is something inherently masculine and not something attributed to \"book learnin' nerds and femboys\". Many people in my high school graduating class, including several of my good friends, dropped out of high school because they wanted to prove they were real men who work with their hands.                               \n\n\nFrom what my Japanophile friends have told me, Japanese culture has everything I appreciate about American Jewish culture, in that it's a culture that forces you to put your people and your tribe before yourself, and that bettering yourself should really be about bettering your community, not \"getting ahead of the pack\". \n\n\nThat's just my two cents. ",
            "Pfft,  she's a terrible fake Japanese.   If she was hardcore she would have totally committed *Seppuku*. ",
            "You done good OP, there's no denying, but it's the parents who are the real MVPs here.",
            "ナマズ",
            "Thank \nYou so much for the update. ",
            "I'm glad you told them, you can tell how much they really appreciate it. Her lying generates a whole hoard of issues, no matter what the subject. Lying to me is considered one of the worst things you can do to another person, because it means they don't respect you enough to tell you what's really going on AND they think you're a moron to believe what lie they give.\n\n> she told me to never contact her again and to keep her name out of my mouth.\n\nI've only heard this come out of the most gossipy bitches ever.\n\nBut jeez, I wish I had supportive parents to live under for free and get Japan trips, hot damn. I wouldn't create some creepy heritage alter ego and lie to them in return though. d:\n\nThe therapy will do her GOOD. Lots of good. Maybe one day, she'll apologize to you and admit it was the best thing someone ever did for her.",
            "That totally happened and is not an invented weeabootale",
            "Seems like her brain just got bored. 26 with no job and parents that do/pay for everything? Why NOT create a fake persona.",
            ">She called me a whole book of names and said she hoped someone would ruin my life as much as I'd ruined hers.\n\nWhen the truth can ruin your life you already had some pretty big problems.",
            "Isn’t loyalty to one’s parents a very important value in Japanese culture?\n\n(Well, really, it’s a very important value in *every* culture outside of North America...)",
            "Well, it's best for her that this happened this way rather than by a slip up on her part later on -- you had the chance to frame this as a mental health issue when you brought it up to her parents, it might not have been taken that way otherwise. I wouldn't count on her ever forgiving you, but you did do her a huge favour.",
            "Keep the option contact open. One day she'll hopefully be a normal person and may even forgive you. Hopefully then she could be a decent friend. \n\nOr she may not ever contact you again. No big loss.",
            "You did the right thing. Hopefully she'll be able to get the help she needs now. ",
            "I think it's really courageous what you did.   It'd be so easy to just be weirded out by the whole thing and to keep your distance.   ",
            "I knew someone obsessed with Japan growing up, except she wasn't delusional, and she was pretty awesome. It's thanks to her I got exposed to some amazing content (mostly anime).\n\nYou definitely did the right thing, it's ridiculous and sad how she responded. Maybe with time she can point that anger where it belongs: her own tendency to lie.",
            "God I want recordings of those therapy sessions... ",
            "This is the first I'm seeing of this, but it reminds me of this girl ai went to high school with, who claimed she was the daughter of a Mexican drug lord (girl was blonde/blue-eyed) and that her parents were actually her uncle and aunt. Dyed her hair black, tanned incessantly, tried to learn some spanish...\n\nI'll never understand pathological lying. I've known quite a few of people (typically girls) who do it, and it seems so stress-inducing to me. But, I guess we all have our own problems and ticks.",
            "Just be careful she doesn't ruin your professional life or something. People are vindictive. She may hold a grudge for the rest of her life for all you know.\n\nAlso, hopefully she is calling to thank you in a few years instead.",
            "(Serious) Why do you care about her lying about on FB, etc? Who is she hurting and why is it your place to expose her? NOT giving you grief; simply curious.",
            "Guys she's just Japanese-Kin and you have to accept her or else your not a true progressive. ",
            "white people are weird ",
            "I've been following your posts and I'd like to say I'm not sure if I would have done the same thing if I were in your situation.\n\nI'm not really sure that her behavior was hurting anyone or affecting anyone's lives in a negative way. Who cares if she has a fake persona or pretends to be someone she isn't? Did it affect your life? Did it hurt anyone? ... \"No\", so why did you feel the need to tell her parents?\n\nShe's a grown woman who obviously has issues but her issues do not affect anyone in a bad way. Lies? Lies only affect people who are stupid enough to believe them. Her parents should've vetted or questioned her \"business networking trips\" more carefully before handing over thousands of dollars for her to travel. Their ignorance is not your problem.",
            "OP, I'd like an update in six months please. Fascinating story. ",
            "You and right thing, and the noble thing, even though it was the harder path. God bless you.",
            "I kinda suspect she won't be able to make a clean break from her past habits.\n\nIf she does do anything more please keep us updated op. Been loving following this story every step of the way.",
            "Best of luck for the rest of the year OP, and hopefully she and her family also improve over the next year or so.",
            "Speaking as someone who has had the displeasure of befriending people with multiple FBs to hide shit from me and others, I would suggest ensuring that it's gone and not just hidden. It's way too easy to hide them when you need to and I imagine that if she's going to get treatment, it's going to be important to sever that part of her life completely.",
            "Beware the coming ninja retribution!\n\nYou did the right thing.",
            "I hope her therapy goes well. You did the right thing there.",
            "Crazy people do crazy things. Just keep that in mind. It took me almost 6 months to get rid of a crazy ex-friend once. She popped my bike tired, broke into my place, scratched my car, started rumors about me and had friends suspecting I was the crazy one. After about 6 months she kind of realized I wasn't reacting to her BS and targeted her madness elsewhere. Then people from my old friend group, who she still hung with, came to me to commiserate about her insane dramatic BS and tell me all the new crap she'd pulled on others after I left. \n\nJust making a point. It might take a while to be free and clear. ",
            "This is crazy stuff, is 26 the new 16? ",
            "No matter how nice or kind of a friend she may have been outside of the obvious illness, losing her as a friend really won't be a huge loss.\n\nThat level of unstable behaviour is draining. Maybe after a few years and lots of therapy you could be around her again if you so choose, but frankly I'm just glad that you did what you did.\n\nNo matter what she calls you, you were her friend to the end.",
            "I am very sorry for your loss, but years later this could be a blessing in disguise. ",
            "Wow, that is a weird situation but you did the right thing. I'm sure it was difficult to hear that backlash from someone you have been friends with for a long time and were trying to help. Remember that she could have chosen to keep up the ruse by moving out, but she chose to give it up and face the reality of who she is so she could continue not facing the reality of being not far from 30 and not being responsible for herself. \n\nObviously she needs to grow up and I've always believed we should not humor the delusional. Sorry you had to bear the brunt of it but it will be for the best in the long run.",
            "I'm not trying to be critical, but I just want to know; who was she hurting with the whole 'trying to be Japanese' thing? She is an adult (although seems quite childish) and why not just let her live in her fantasy world while you remove her from your life?  Again, I don't want to sound critical or anything, just want to understand the rationale behind telling her parents.",
            "You did the right thing.  She's just lashing out at you, even though she knows you were in the wrong.  Keep an occasional eye on the situation, make sure she isn't retaliating some way, and just focus on you OP",
            "You were an actual friend to her.  Even if it means the end of your friendship, you did right by her.  The day will come when she'll realize that.",
            "You did a tremendous service to your friend. Honestly if she doesn't realise sooner or later what you've done for her it's her loss. I'd be so grateful to have an honest friend like yourself if I was in her position",
            "Thanks for the final update. I had been following this story mostly because I had a somewhat similar experience with a close high school friend and ultimately had to call her parents about it because her obsession and delusion got to levels that made her reference suicide. WIth my friend, it still took many,many years for her to recover from her fantasy life and we drifted apart. She did eventually marry and have a child so I can only assume things worked out for her.\n\nGood for you for having this kind of courage. And one day, whether she tells you or not, she will be thankful someone intervened before things got really, really out of hand. ",
            "The problem is that she blames you for removing her obsession. Hopefully, her new obsession won't be exacting revenge on you. You see how far she'll go when she fixates on something. Be careful.",
            "This ain't over.",
            "This is the hardest fact of the human condition: when we're confronted with negative feedback, we end up hating the messenger, no matter how much good it ultimately does.",
            "She ruined her own life.  Don't let her put that blame on you.  You did the right thing, and this internet stranger is proud of you for it.",
            "You did the right thing.  Cara was setting herself up for a sad life and no one was going to stop her.  It boggles my mind that someone at 26 could build such a fake world for themselves.  Sad to think she sank most of her 20s into a delusional life, but hopefully she can catch up quickly.\n\nTotally different situation, but it reminds me of when I used to date a girl that made up a huge, fake backstory from her hometown about being a connected, underworld gang boss (at 14, mind you) and told everyone about it.  She was definitely a compulsive liar and had no problems just making something up on the spot, often the bigger and more shocking the lie, the more likely she would be to try to spread it.",
            "You seem like a really nice person, thank you for existing.",
            " \"I think I'm turning Japanese I think I'm turning Japanese I really think so!\" \n\nHas seriously no one thought of that song!?",
            "[deleted]",
            "You did the right thing, and going to her parents was very brave and in my eyes downright noble. Many would have just walked away. \n\nTry not to worry too much about her bitter words against you (though do keep yourself safe as others have suggested); she clearly needed help and you gave her the chance for that. You were the best friend she could have had.",
            "[removed]",
            "Hate that it had to end on that note, hopefully the therapy helps her fully come down to reality and get her life back in order.\n\n",
            "Man, this was practically like reading the life of Magibon, though i realize it's not her,  the same destructive behaviors seem to be present. Saddening.",
            "Massive weeaboo",
            "Sounds just like applemilk1998",
            "You did the right thing, OP! You may have lost a friend, but you set someone's life on a better path. ",
            "Maybe by the time she has seen someone, and potentially fixed the problem, she will call you back, and actually thank you for it?\nMaybe....Props on telling her parents about it though.",
            "So she was humiliated and ashamed and lost face?\n\nSounds pretty Japanese after all.",
            "*Called to tell me she hates me and never wants to speak to me again*\n\ntranslation: i hate everything ive caused by what ive done so im gonna blame you for helping me",
            "I would never talk to you either. ITS FUCKING FACEBOOK GET A LIFE",
            "Typical delusional fat weeaboo. Surprised there wasn't \"discriminashun for her cundishions\" arguments.",
            "Kudos to you for taking the time to do something about it. Maybe you won't speak to each other again, but it sounds like she'll be getting the help she needs, and will be the better for it. She doesn't know it, obviously, but she's lucky to have had a friend like you, even if that friendship isn't lasting.",
            "While there's obviously some issues there, Japan is a terrible country to want to fit in.\n\nRead this with a grain of salt, because it's second-hand opinion from possibly disgruntled weeaboos. \n\nFrom what I understand, there's this insane attitude that Japanese people are fundamentally different, and that only someone of Japanese blood can truly be Japanese. IIRC, there's Koreans who live there for generations without getting Japanese citizenship. They will never be Japanese. (Korea is similar - Korean babies in Japan will have Korean citizenship, by right of blood).\n\nSo she's trying to fit in, with a false social media profile, so she can pretend to be a real person in Japan.\n\nI'm not sure what her goal is. Whether she wants to make real connections, or simply to live a double life (to learn about Japanese people, or simply to feel like she fits in).",
            ">Called to tell me she hates me and never wants to speak to me again.\n\nOh well. More friends for you to make in her place that aren't like that I love anime but girls like that...\n\nThey annoy me",
            "You = Best. Friend. Ever.\n\nI give this one year at the very most, if she sticks to consistent therapy. She's so lucky to have wealthy parents who genuinely care for her and a friend like you. About the one year thing: I predict she'll be calling you back with an apology and gratitude.",
            "I've been following this whole saga and I have to say good on you for following through with this! Even though you knew the consequences, I think it's great. And you never know, maybe some time in 5 or even 10 years she'll actually realise what you did for her was a blessing in disguise. Happy new year!",
            "You did the right thing and are a good person.  I'm sure in a few years she will look back and thank you for bringing her fantasy double-life to an end once she establishes and learns to enjoy the *real* Cara.",
            "This could be a movie trilogy...it has everything! Someone please do something creative with this story ASAP.\n\nEdit: too many exclamation marks...toned it down.",
            "weeaboo takedown complete",
            ">but i dont regret telling her parents and potentially saving her from colossally fucking up her life.\n\nI'm not gonna comment on the lifestyle decisions of your ex-friend, but I feel like you should reflect on your actions as well. You already knew that your friendship with this girl was done when you posted your first post, and yet you still wanted to \"fix\" her but NOT remain a friend. Why bother fixing something you don't want anymore?\n\nJust because /r/relationships was a near-perfect echo chamber for you in this situation doesn't mean that what you did was right or that you shouldn't feel bad about it. You walked out of this girl's life and made sure to break some things on the way out. If this whole ordeal helps her in the end, then good for her. But if this backfires, which might well happen considering your ex-friends mental gymnastics, then that is on you.\n\nI think you should feel some regret, because I feel like everybody lost in this situation.",
            "You just wanted your friend to get better, and you did the best thing. Yes, it put her in an uncomfortable position, but she'll be living a better life if she and her parents follow through on that therapy ",
            "One day, she'll look back and be immensely grateful to you as the one friend who was willing to do something about her bullshit.",
            "I hope that a few years down the line, she'll contact you again with thanks for helping her come down to earth.",
            "You did the right thing, and the noble thing, even though it was the harder path. God bless you.",
            "Don't worry OP you did the right thing..Who knows, maybe down the line she will realize just how good of a friend you really were for doing the things you did and she might come around.",
            "You did the right thing. End of story. Never let anyone convince you otherwise. It took a lot of guts to do what you did, but often the hard thing is the right thing...and you did the right thing.",
            "Funny, if she wanted to be the opposite gender than most of society would bend over backwards to accommodate her delusions but if she wants to say she is another ethnicity she is a loser.\n\nFuckin double standards.",
            "[removed]",
            "I used to live in Japan and definitely love a lot of Japanese stuff, so I feel I can give you some viewpoints here.\n\nI want to say that I think there are some lies here and this reads more like a novel than a real-life story. You seem to know more than you should.\n\nI'm really offended by you saying \"I got what I wanted out of this situation\". Congrats man. You are now avenged while 3 people are pretty upset. I think it shows what this really was about here. It wasn't about helping Cara, it was about you going through hoops to prove a point.\n\nI don't think you should have gotten involved and I honestly think in the long run, you are probably just going to further some of her issues. I'm trying to think like Cara here, and if I were Cara, I'd probably have to create a third persona. I'd also be even more private and really wouldn't trust any friends/family. What do you think Cara is going to do, considering we know she isn't all there?\n\nI'll try to keep my notes limited here:\n\n- Cara is an adult. She's a freeloading adult, but she's an adult. If she wants to lie, that's her business. You can call her out on it or choose not to associate with her in real life, but posting about it on the internet THREE TIMES, tells me there's some other factors involved.\n\n- Cara obviously has some long-term issues going on here that neither you or me know about. We don't really know what happened in that house and we never will. \n\n- You should really stay out of situations that aren't causing direct harm to anyone. Unless someone is going to get physically hurt or get in legal trouble, stay out of it.\n\n- I think you should consider that the human brain is a weird thing and it's common for people to have memories of things that never happened. You see it all the time in stuff with nostalgia where people remember toys and shows being things they weren't. There's definitely some of that here. Likely, with Cara's exposure to Japanese stuff and anime showing real places in Japan, it's easy to see why that would happen. You should also consider dreams as I'll have dreams that seem very realistic, and often I have to say to myself, oh yeah, that was a dream, not reality.\n\nI don't think anyone was really in the right here and I don't think things are going to be automatically better, but I'm glad you were able to \"get what you wanted\". Congrats man.",
            "[deleted]",
            "is she fat?",
            "Wow, I read your story from the start and I was hoping you wouldn't snitch, you're gonna keep that shame with you now. I snitched on my friend once like 8 years ago and completely fucked him over, I still feel shitty about it."
        ]
    },
    {
        "post_id": "2vusqf",
        "author": "None",
        "title": "[UPDATE] My wife [33/F] and I [36/M] have been asked by my wife's parents [60's M/F] to take over raising my wife's sister's children [8 and 6/F]. I already have 3 kids [[10, 7, 5/F,M,F] and feel like I'll lose my mind if I have to take them, but crushed with guilt if I don't. Please help",
        "url": "https://www.reddit.com/r/relationships/comments/2vusqf/update_my_wife_33f_and_i_36m_have_been_asked_by/",
        "score": 2054,
        "num_comments": 479,
        "created_utc": 1423899128.0,
        "selftext": "Hello Reddit. I am the guy who submitted this post: http://www.reddit.com/r/relationships/comments/2s03z7/my_wife_33f_and_i_36m_have_been_asked_by_my_wifes/\n\nAnd I know I promised an update so I'm going to give a quick one before going to bed.\n\nI told my wife I desperately needed some time to myself so she was a complete sweetheart and watched the kids for me while I went to my favorite coffee shop and for the first four hours did nothing but drink Cappucinno's and read.\n\nI then started to think about what to do about the problem with my nieces. It suddenly occured to me that even though they had deadbeat fathers, perhaps the paternal side of thier family coud be of assistance.\n\nThat night I got home after my wife had put all the kids to bed and told her we needed to talk.\n\nI completely lost it and broke down sobbing. I told her I could not take her nieces. I told her how stressed I was with work, how exhausted I felt every single day doing nothing but working and being a dad. I told her she was a good wife and mom and I appreciated her having a part time job and taking care of the kids when I was at work but I was starting to resent how I had to pick up her slack and cook and clean because she wouldn't do it. I told her I was considering committing suicide because I just couldn't handle the pressure of having to fix her sister's mistakes and that I already felt like a failure as a husband and father and was sick of life.\n\nMy wife was white as a ghost. And she didn't argue or get defensive. Not once. She just gave me a big hug and started crying too and said she was so, so, sorry. She had no idea how stressed I was, how miserable, that I hid it so well.\n\nMost shockingly she admitted she had grown lax in her housekeeping and that in retrospect she was just so tired from dealing with the kids all day and working to boot cleaning and cooking hadn't really been at the forefront of her mind, since I'd been quietly making up for her slack and not saying anything she had just let it go unchecked.\n\nI told my wife there was no way I could take responsibility for two more children when I couldn't trust her to pull her load at the house. I said I was truy heartbroken for our nieces but that my children came first, and I could not jeopordize being a good father to them or have them lack in any facet of life because of them. I said a decision needed to be made soon and there was simply no way I could trust her to prove she would change and start helping out more and that we needed counseling because I was ready to end my life over how dreary and stressful things were. I also brought up we had no guarantees the girls wouldn't take after thier parents, particuarly her sister, as teenagers and make all our lives miserable.\n\nShe said she hadn't thought of that, and again how sorry she was and that I was right. She agreed immediately to counseling and that the dynamic of our home needed to change. That taking our nieces was out of the question when our own family needed some serious fixing. \n\nI could tell that my talk of suicide terrified her and she was willing to do anything to make things better. She begged me not to kill myself and then started sobbing and said she couldn't live without me, and to please not leave her and the kids.\n\nWe decided to talk about options for our nieces after getting some rest. My wife rubbed my feet until I fell asleep.\n\nThe next morning we took the kids to the park and while they were running around on the playground we discussed what to do about the girls. I brought up the girls father's families and asked if she knew any of them. She said no, but she could ask her sister for names and/or contact info.\n\nLong story short we found out Dad A had a brother, a married sister with kids and his parents. Dad B had a married brother, two sisters, one married no kids and the other with a boyfriend and two children, and his parents as well.\n\nMy wife and I sent emails to all introducing ourselves and laying out our nieces plight. That thier maternal grandparents could no longer care for them and that we were in no position to do so and were reaching out to see if they would be willing to take the girls who would have to be put in the foster system if we couldn't find someone.\n\nDad A's unmarried brother and Dad B's unmarried sister with kids never responded.\n\nDad A's sister, Dad B's brother and parents gave us varying responses which boiled down to \"sorry but no we can't/don't want to\"\n\nDad A's parents and Dad B's married sister without kids both gave us yes's! But here was the tricky part. They were only willing to take one child. Dad A's parents were sweet and polite but firm in saying they had no interest in raising another man's child, or dealing with potential drama from another baby daddy or baby daddy's family. Dad B's sister was also kind and said as much as she would like to, she and her husband were barely making ends meet and simply couldn't afford more than one child.\n\nMy wife and I were also in counseling at this point. We debated for awhile about whether to just take our nieces or to put them in homes where they would be loved and wanted but at the cost of splitting them up.\n\nI'm sure many Redditor's will bash me for our final decision, but it was with our therapists suggestion we finally decided our marriage and home life was too much on the rocks and had not had enough time to heal to take on the huge responsibility of raising my SIL's children.\n\nAnother long story short we got my in laws in contact with the other set set of grandparents and Dad B's sister and they are now in the middle of adoption and custody details. But from what I've heard is that the grandparents of niece A and the Aunt and Uncle of niece B will keep in contact and arrange in person play dates and Skype sessions so the sister's can stay in contact with each other and not suffer permanent seperation. We also told them that we still very much want to be in our nieces lives and would be willing to see them and have them for a couple days a few times a month or help in any way we could.\n\nThis was a very hard decision to make for my wife and I, but ultimately we feel we made the right one for us. We are still in therapy and are doing much better.\n\nMy wife is a much bigger help around the house and bought a book of easy recipes tailored to terrible cooks like her. We also took u/zizzmoo's suggestion and started doing a bunch of crockpot meals. It's cut down on labor and cleanup TREMENDOUSLY. In therapy I made a list of chores I'd like her to have done before I get home from work to minimize my stress. The list has really helped because she can focus on one check box at a time and has a visible reminder so she doesn't forget. Also thanks to u/zizzymoo we realized we were being way too easy on the kids and gave them a chore chart as well they need to check off, with allowence on Saturday if they finished everything and didn't rush through it. Seriously, thank you so much for your post u/zizzymoo, you had a lot of really helpful suggestions, even though we didn't end up taking our nieces.\n\nOur marriage isn't fully healed, but it's certainly recovered and I even look forward to coming home from work now.\n\nMy wife really is a saint and a sweetheart and I feel like I'm falling in love with her again.\n\nQuick note to say the sexism and misogony on this website was absolutely insane, people, mostly men, calling my wife lazy and horrible and saying she did nothing all day and was probably having an affair. When I stated in my first post my wife was a wonderful woman I meant it. Having three kids full time and a part time job is a lot of work. She was easily distracted and tired and cleaning just stopped being a priority. Since I always stepped up to the plate to cook and clean and never communicted my feelings, she had no way of knowing I was falling apart. She readily admitted her fault in the failure of our marriage and has truly shown she is fully committed to making things right again. I was shocked at the amount of hate shown on here for my wife, and can only say there are clearly a lot of bitter and obviously single people on this site.\n\nMy wife's parent's are sadly not doing so well with the combination of cancer and losing thier grandaughters, and my wife and I are trying to be as supportive and helpful to them as possible without jeopordizing the progress we've made in our marriage.\n\nMy wife's sister is still a batshit crazy worthless excuse of a human being who actually had the gall to call my wife up and thank her for \"sorting out the problem with the kids and getting it taken care of\" and then asking if we had any money we could possibly spare to lend to her. My wife basically told her sister to go fuck herself and that unless the money was for an operation to get her tubes tied to not ever contact her again.\n\nAll in all life isn't great but it is better and I can definitely see the light at the end of the tunnel for me and my family. Thank you to all the helpful redditors who cared. The douchebags know where they can shove it.\n\n**TL;DR Told my wife everything about wanting to commit suicide and how our marriage and my life no longer felt worth saving. She stepped up to the plate. We contacted relatives of nieces father's to see if they'd be willing to take them. The nieces are going to two different homes, but will still be in contact with each other, and we will still be a part of thier lives even though we decided not to adopt them. Wife and I still have a ways to go, but things are better and looking up.**\n\n",
        "permalink": "/r/relationships/comments/2vusqf/update_my_wife_33f_and_i_36m_have_been_asked_by/",
        "comments": [
            "This is a great update. I'm really glad that you were able to talk things through, and that you're both on the same page now.\n\n(In complete agreement about the misogyny--it's not a normal weekday if I don't get some hateful PMs about how I need to stop talking out my c*nt or something--but I'm glad that it didn't affect your opinion of your wife at all.)",
            "I'm so glad you came back to update us... I was just thinking about you guys the other day and wondering how things were going.\n\nI think you and your wife made the right decision for your family, and it was really a stroke of genius to look into the paternal families and not assume based on the irresponsibility of the birth fathers.  And I'm so damn relieved you and your wife are in counseling and working towards BOTH of you being less overwhelmed!  That's absolutely fantastic to hear :)\n\n",
            "The attitude in this thread that telling your loved one that you're drowning and at risk of self harm equates to being manipulative is thoroughly disgusting and disappointing. I applaud you, OP - I've heard \"why didn't he just *talk* to me?\" too many times after the fact. Fear of this sort of attitude that labels asking for help as manipulative or attention seeking is usually the answer.",
            "I think you and your wife are both amazing at being able to come together and communicate like this. It sounds like the girls will be well taken care of with plenty of access to family and people who care about them. I wish you all the best!",
            "I understand life is tough and you need to do what's right for you, but I just feel so horrible that the kids are getting split up. My SO (m 39) had a similar thing happen to him and his brother when they were younger and honestly I don't think he's ever recovered from it. Feeling abandoned and alone. The worse part was his brother ended up in a not so great place, we think there was some abuse. His brother barely reached out to us for holidays etc. I've only met him once in eight years. Life is tough.",
            "How is your wife doing with all of the changes? She's got more work and a lot of stress. I hope she is handling everything okay. You two are handling this like pros, though. This is a great update.",
            "Your wife seems like a good person who was just temporarily overwhelmed. I'm glad things worked out OP. You did the best you could in a difficult situation. You've taken care of your marriage as well as gone out of your way as reasonably as you could for your little nieces. Take care of yourself too. All the best.\n\n\n>My wife basically told her sister to go fuck herself and that unless the money was for **an operation to get her tubes tied** to not ever contact her again.\n\nI second this.",
            "I think you & your wife made a sensible, well thought out decision that is obviously best for your family & you should not feel guilty for this. However, have you checked in about how your wife is doing? Like really, properly, doing? Because she now has a mother with cancer, an ailing father, a husband with suicidal ideation, an alienated sister, nieces being placed away from her family, a part-time job & 3 kids to manage. That is a shitload of stuff to cope with, and you've just added more chores to the list too. No judgement, I'm sure she could help out more, but you should prioritize checking in with her & making sure she's okay too.",
            "You have handled a very difficult situation as well as you could and sought support from professionals.\n\nEach person and family deals with stresses in their own way.\n\nHow are the nieces doing after being separated? That part bothers me.\n\nThat said, our family had 2 full time working parents, both in stressful jobs and mine requiring some traveling. Housework was very far down the list of necessary things. \n\nFood was made, laundry was done and after that it was Love me, Love my dust bunnies.",
            "All these people bashing you don't seem to realize how exhausting kids are.  You've already got three and you've admitted to feeling suicidal.  Adding two more to your home would almost certainly do you in.  You CANNOT be an adequate caregiver when you're stressed to breaking.  \n\nThe arrangements you made for those children are what you would've seen had you left it up to child services.  Child services will almost always look for kinship care before tossing kids in random homes.  Everyone that's screaming \"they could've been together in foster homes, why would you do this,\" just shut up.  You don't know.  \n\nUltimately I think you made the right decision.  And it's possible that after some time has passed there will be better living situations for the girls.  No one ever said this arrangement had to be permanent.",
            "\"Quick note to say the sexism and misogony on this website was absolutely insane, people, mostly men, calling my wife lazy and horrible and saying she did nothing all day and was probably having an affair. \"\n\nYep, for each good person trying to give you honest advice, there are three sexist asshole trying to blame women for everything.",
            "I hate the idea of them being split up, but I'm glad that it worked out relatively well considering. I know it had to be a hard position to be in for everyone involved. I'm glad that you and your wife cared enough to make sure that they had homes with relatives that wanted them and will work to make sure that they can see each other. Also glad that you guys still want to be involved in their lives. Hopefully you have met with the relatives and made sure that they are decent people? And will continue to make sure that they're decent people? Because that part is worrying me a little. \n\nNow on to what pissed me off. \n\n>I also brought up we had no guarantees the girls wouldn't take after thier parents, particuarly her sister, as teenagers and make all our lives miserable.\n\nI do understand the actual reasons why you couldn't take them in, but that is an *extremely* shitty thing to say. You have no guarantee that YOUR kids won't turn out to be fuckheads as teenagers. These are kids that have been through a lot and deserve love. ",
            "\nGreat update. Just one tiny suggestion, and I am sorry if your words were just an exaggeration, but, if your wife really did tell her sister\n\n>  that unless the money was for an operation to get her tubes tied to not ever contact her again.\n\nShe may be contacting you again if she thinks that will be an easy way to get money from you. I might suggest to not give her the money, or set up a plan with the Dr.s, don't just give her money based on her word",
            "I'm really happy for you and your wife and to see that open communication and therapy is working for you.  It sounds like the best result for an absolutely difficult situation.  I wish the best for you both.  ",
            "It sounds like you and your wife have made the best decision you possibly could in an extremely difficult situation. I am so glad to hear you are all doing ok and wish you and your family all the best.",
            "It seems you and your wife have found good working solutions to your issues at hand.\n\nGood for you!\n\n\nYou both take care and I hope the future is brighter for all concerned :)\n\n*Nana internet hug*\n\n\n*love the response your wife had for his sister regarding the money issue!*",
            "That sounds great but I'm curious why you guys don't hire a housekeeper to come like .. once a week to take care of all of the \"big\" stuff you're too exhausted to clean. Yeah, it'd be some money but it wouldn't be *that* much money and it'll save you *a ton* of time and sanity.",
            "Good for you. I'm pretty sure I commented in your last thread, but I am a former foster care caseworker and I am here to tell you that **you absolutely made the right decision**. As a caseworker, I gained a lot of experience in what is known as 'kinship care', where kids removed from their natal homes become foster care kids but are ultimately placed with family. You would think I would be criticizing you for not taking your nieces in, but the truth is, if I were their caseworker, *I would never place them with you*. The point of foster care is to place children in homes that have the capacity for them. You guys are already at capacity. I would have done what you did, and located paternal family members willing to take them in. Social Services generally tries to avoid placing kids in kinship care in family homes that already have a large number of children. If you had just one niece that needed placement, and everybody in the family thought they could handle it, then Social Services might place her with you, but two nieces in a home where a parent is already overwhelmed is a recipe for disaster. In the state I worked in, Social Services pays child support to kinship foster families the same as non-kinship foster families, so there is no advantage for the state to choose kinship care, and if the family is overwhelmed there is a much higher likelihood that they will return the foster child back to Social Services care (I'm going to abbreviate it as DSS), which isn't good for anybody, but is especially bad for the child. I had a client in this situation. In his case, his aunt couldn't care for him because he had significant developmental, psychological, and behavioral issues and she became a single mother when she took him in. It was tough on everybody, and had I been around when he first entered the system, I would have objected to the placement.\n\n**You are doing the right thing.** I just cannot stress that enough. Even though the girls will be separated, this arrangement is still the best choice.\n\nAs for your wife, well, parenting is hard, and sometimes parents get complacent. I have a five year old son, and during his lifetime, both my husband and I have gotten complacent and left too much on the shoulders of the other parent. I think that is natural. Both times, the overburdened one has sat down with the complacent one and then sorted it out. I am not going to bash your wife. This is pretty normal.\n\nPlease consider getting individual counseling. Feeling worn down to the point of suicidal ideation needs to be addressed on it's own. Couples counseling is a great start, but individual counseling will help too. My husband and I have not needed couples counseling, but I have been in individual counseling for my own issues for a little while now, and I am happier, more functional, and a better wife and mother because of it.",
            "So she needs to do all the cleaning, cooking and child rearing while working a part time job. You are going to work and feeling stressed, so this entitles you to come home and just relax without doing the cleaning, cooking, child rearing? I would divorce you, this is life. There are going to be a lot more stressful thing in your life.  Do you expect your wife to always pick up the slack for you?",
            "Separating those girls will prove to be a life long traumatizing event.",
            "Well done OP! I wish for you, your wife and your family the very best in the future! ",
            "It's a shame that some of the worst people reproduce the most and then the responsibility falls on the rest of the family. But I think what you two decided on was the best decision for your family and no one on here has the right to tell you that you're wrong for it. \n\n",
            "Not being able to take them in I can kind of understand. \n\nBut I find the way you are talking as if this is a really good solution pretty hard to take. Two sisters got split up and shipped off to people they have never met before. People you know nothing about. \n\nCan you imagine that happening to your kids? \n\nI really don't understand this subreddit :(",
            "I really dislike the way you two call it \"picking up her slack.\" You are both working parents in a *partnership*. What the other person doesn't do **should** be done by the other and not looked at like slack being gathered. That's what being a team is. ",
            "This redditor wouldn't bash you, you did what was best for your own children and your marriage and your sanity. Raising three kids is tough. They need you. And having dealt with trying to raise someone else's very angry teenager myself, I can tell you it's no picnic. I think you did the best thing for everyone involved, even if it wasn't easy. The girls will hopefully get to know their other family members now too, and it's not like you can't continue to be a part of their lives. Good luck to both you and your wife. ",
            "1. All those people bashing your wife are assholes. I can't imagine raising 3 kids, while working part time every day. No wonder she's not doing many chores. She must probably feel very exhausted as well.  \n  \n2. You really shouldn't have gotten 3 children, sorry, mate. The situation you're in is unfortunately, because you seemed to overestimate your capabilities. Nothing to change now, of course, but just to put into perspectice, that I feel for you, but also think you made that mess yourself.  \n  \n3. Counselling was the right decision, but I would also suggest you might get some 1 on 1 with an expert, because of your feelings. You are burnt out (or almost there, but I'd say the feelings you describe fit that rather perfectly).  \n  \n4. What you need is your wife and children to take as much burden off of you as possible, which they seem to do now thanks to \"forgot his name's\" suggestion.  \n  \nGood luck and make sure that your children always know you love them but that they also understand the situation, that this family can only pull through if you all help each other.",
            "[deleted]",
            ">Dad A's parents and Dad B's married sister without kids both gave us yes's! But here was the tricky part. They were only willing to take one child. Dad A's parents were sweet and polite but firm in saying they had no interest in raising another man's child, or dealing with potential drama from another baby daddy or baby daddy's family. Dad B's sister was also kind and said as much as she would like to, she and her husband were barely making ends meet and simply couldn't afford more than one child.\n\nIf Dad B's sister takes in the girl in a foster situation thru CPS, she should be able to get funding and help.  \n\nI'm glad you told your wife how you felt and things are looking up for you.  \n",
            "I am so glad you and your wife made a wise decision. I am kind of in the same shoe. My SO is the legal guardian of his niece and nephew. I honestly don't know how he is going to take care of them if their parents die.\n\nI am just glad the chance is so slim. \n\nYou need to take care of yourself and your family first before you can take care of others. That's nothing wrong.",
            "FWIW I think you made the right decision. Thank you for updating. ",
            "I'm really glad to know that you guys have adapted and healed your relationship. This story was in the back of my mind for a while so it's like reading a happy ending. Much respect for being that emotionally open and for holding firm in the face of reality instead of trying to be more than you can be. Much respect to your wife for acknowledging that she needed to step up and take action. ",
            "It's a shit-sandwich but at least you're both taking a bite.  Thank you very much for this update and you and you're family will be on our minds.  Please update again in the future :)",
            "Big hugs, man. You've been through some hard stuff. ",
            "I'm gonna page /u/zizzymoo so that they can read this. (OP: you need a / in front to call them.)",
            "Your wife rocks, dude. I'm so glad that things are going for the better, for the both of you and your kids. Your wife telling her sister to go fuck herself..I love that! I think that she needed to be told off. I really hope everything comes through for your family. You all have certainly been through hell, but i hope you're starting to feel sunshine on your face again.",
            "Holy cow, OP - good work! One more suggestion: on the days you have both girls over for a visit, make it a joyous occasion, say, maybe Sunday dinner? When we were kids, that's what always brought us all together; a really nice dinner served at 2pm! It still remains a precious memory to me.",
            "very, very well done. i hope you sleep easy now.",
            "I think you did the right thing!! And your wife is not likely having an affair. An affair takes energy. Sounds like she is plum tired! Sounds like she loves you!! And you were correct in that you were signing up for a bunch of problems from every direction if you took in those girls. Since the girls are now being adopted, the sister will now have less ability to pop in and out and cause chaos.  (((hugs)) Don't doubt yourself! You 100% did the right thing. It took a lot of courage too!",
            "You are doing an amazing job. Take care of yourself ",
            "Honestly, this makes me really sad. I can't imagine splitting up a family like that. ",
            "This all must have been very hard on you. \n\nIts great that you and your wife are doing better and that you plan on keeping in contact with your nieces! Try to talk to them often!!\n\nGood luck to your family! ",
            "So happy for you.  My wife and I took her sister's kid after she OD'd and it his made our lives a living HELL.  I love them, but I wish we had said no. ",
            "Why was adoption or foster care not an option? There are great families out there that foster and adopt. The girls would probably still be together too. \n\nSpeaking from experience, seperation from your siblings is a huge loss. The hurt can stay with you for a long time too. \n\n Considering their crappy childhoods they were probably closer to each other then other siblings who grew up in safe homes. \n\nAnd it just hurt your little heart to think of them in foster care, unseperated. Were the girls even asked which they would prefer?\n\nThats why I consider you an ass. Not because you couldn't take them yourself. Its good when families recognize their limits when it comes to taking on more kids. \n\nTo be fair I thought you were a misogynistic ass after your whining that your wife cant cook or clean. This is after you stated she works pt and takes care of the kids. \n\nThe misogynists that responded probably felt they were responding to one of their own. ",
            "This made me tear up. I am so happy for you and your wife. I wish you both the best",
            "I know it must feel douchebaggery, but the trolls and detractors on the site are actually pretty helpful in preparing for \"worst case\" scenarios where people are completely irrational. Their comments add a needed perspective and the ones that are truly horrible are modded out pretty quickly. ",
            "I am so sorry for everyone in this situation. It seems like things are resolved for the moment and I'm glad that communication is better and I hope it stays that way. If I were the wife I think I'd be afraid to ever complain again, though. It just sounds like the whole dynamic is unsustainable. Wife is dealing with a job, three kids, homemaking AND sick parents. I hope she feels free to tell OP when SHE'S on the ragged edge, because I would be, after about 48 hours. Having sick parents eats up your energy in a way that's hard to understand.\n\nI think getting the kids to help with chores is a great way to start. ",
            ">My wife basically told her sister to go fuck herself and that unless the money was for an operation to get her tubes tied to not ever contact her again.\n\nBravo, seriously.  Her sister has no sense of priorities or respect.  Parenting isn't for everyone and people need to fucking THINK about whether they are ready and willing and fit to give up their former lives to raise children.",
            "Well done.",
            "great update, and i'm glad you're doing better! keep the communication between you and your wife flowing, and hopefully things will continue to get better. good luck!",
            "You did the right thing. Stay strong and just keep swimming!",
            ">I'm sure many Redditor's will bash me for our final decision, but it was with our therapists suggestion we finally decided our marriage and home life was too much on the rocks and had not had enough time to heal to take on the huge responsibility of raising my SIL's children.\n\nAny redditor giving you grief for living your own life and making sure your family is secure is a fucking idiot. You absolutely made the right choice - there's some healing in store for you and your wife, but the end result is happiness. Stay strong, brother. You're doing the right thing. ",
            "> My wife rubbed my feet\n\nShe's a keeper for sure",
            "How lovely to hear the effort and thought you have put into these decisions. I smiled so wide when you said \"I feel like I'm falling in love with her again\". Kudos to you both for fighting for your marriage and putting the best interest of your children at the forefront. Taking on the stress of your nieces' well being is huge, and you're handling it with maturity and grace. Your children are lucky to you have you and your wife.",
            "Kudos for mentioning the misogyny your last post attracted. I was horrified reading it. It scares me that there are young men on this site who hate women that much...",
            "This is one of the most uplifting things I've read because it actually feels real. Life isn't a fairytale, and sometimes love and happiness take hard work. Kudos for you and your wife having the strength to admit when you need help and following through. Best of luck to your family and nieces! ",
            "This, to me, looks like such an awesome partnership. Through a really difficult time you were both able to be honest and open and receptive to each other's needs. It doesn't matter if things weren't going well, the point is that you both addressed it in the right way which allowed you to move forward.\n\nGood luck!!",
            "Never ever feel guilty about what happened to your wife's nieces. Where ever they end up is not a direct result of your decision but their mother's. Your family comes first and you did the right thing.",
            "Kudos to you for taking the time to think it through and to your wife for listening to you! A very dear friend was in a similar situation (except they were her husbands sisters kids) and adopted the kids. While their heart was in the right place and things are working out (for the most part), they have all been through hell adjusting. My friend is carrying a HUGE load on her shoulders, her husband is angry and miserable, and their kids have paid a price as the home environment is very volatile. At the same time, the nieces, while together and in a good home must feel the anger and resentment of the others and feel like second class citizens. While it may have seemed like the best option at the time for the nieces, sometimes I wonder how their decision will end up impacting all of their futures and their relationships with each other. I think that while the decision was difficult, you ultimately did what was best for your children and your marriage and hopefully the nieces will get what they need in their new homes. Again, kudos to you and your wife for doing what was best for your family!",
            "I'm just going to let out a little of my geek side and make sure  /u/zizzymoo definitely knows about this thread. OP didn't put a second hashtag in, which I believe means that poster won't get a notification. \n\n",
            "> My wife rubbed my feet until I fell asleep.\n\nMade me aww\n\nEDIT: Silly formatting",
            "I certainly hope no one would give you flak for your decision. You guys stepped up to the plate and fought for your nieces in a way that no one else would! Even if it didn't end up in you guys being noble martyrs and saving the world's problems, you stepped in and made sure those girls were taken care of. That's something no other adults in their lives were willing or able to do. And that makes you guys amazing. You've changed their lives for the better. Good job you guys!",
            "OP, ignore the twatwaffles complaining about your solution.  They either don't understand your situation, have never been in something similar, or both.\n\nIf you like football at all, I encourage you to watch a documentary called Undefeated.  A middle-aged man starts coaching an inner-city high school football team in Tennessee, pouring his heart and soul into helping the kids, who all come from bad situations and have all sorts of issues in their lives.  The documentary starts off presenting him as the mythical savior-figure present in so many movies about similar subjects, but it soon turns to focus on the coach's decision to step down, because even though he's doing so much good for the kids on his team, he has his own family and that comes first.  \n\nYou should never feel guilty for this decision and you should feel proud of your ability to know your own limits.",
            "**YOU DID THE RIGHT THINGS ALL THE WAY AROUND**.\n\nNICE WORK! make sure you have a date night every other week or so... even if it's the dollar movie theater or just stepping put for an ice cream cone together without your kids. It will help you keep your calm.\n\nMy husband and I keep reiterating to each other... it's us two against the world. We're gay, no kids, with a dog from the shelter and very stressful wall st jobs, and aging parents that we put a lot of effort toward. It gets to be a lot.just keep creating date nights, inside jokes that only you two understand and keep saying it's you two against the world. You will get through it. We got through my deployment to Iraq, and the subsequent bullshit. The thing that kept me alive was knowing what a wonderful person I had to come home to and that I couldn't check out... it would be devestating  to him. I think you have a wonderful marriage... since you realized the reality of what you needed to do and you did it without judgment of each other. You worked together and resolved and are resolving your challenges.  You guys did an awesome job. Its not about having difficulties, it's about how you deal with them. Keep up the good work.",
            "Totally hope your wife actually said that. The adopting families know that the girls can't ever go back to their mother right?\n\nAlso please try to get counseling for yourself for your suicidal thoughts. And not saying you would do this but don't use your feelings or suicide as a bargaining chip or hold it over your wife's head. Telling her how you really felt this time around was appropriate but I'm just concerned for her. \n\nreally though just good work here. You did the right thing for everyone involved. ",
            ">  I was shocked at the amount of hate shown on here for my wife, and can only say there are clearly a lot of bitter and obviously single people on this site.\n\nThere are \"relationship\" subreddits where it would be worse besides this one. Everyone on the internet wants to idealize others, since they might as well and they can. I don't think it's that it's full of single bitter people, at least on /r/relationships.",
            "Your children absolutely need to be doing more around the house. Besides the fact that you are severely underestimating what they can do at their ages you need to be laying the foundations for a lifetime of good habits. I used to nanny for a family with 4 kids, though the youngest was under 2. The older 3 though were about the same age as your 3. They did the entire family laundry and were expected to do dishes and basic tidying. The oldest can operate a washing machine and the younger 2 can help fold and put away. This isn't putting too much responsibility on your kids, it's vital preparation for the real world.",
            "It sounds like you made the best decision possible in a bad situation. I hope it works out for you all.",
            "I think you need to be stronger. I said before that I have four kids, and plenty of others have five or more. You could have kept those girls together. ",
            "[deleted]",
            "[removed]",
            "I'm so happy that you and your family could find the right solution for such a sad situation. You made the tough call, but what's right for your own family has to come first. Good luck.",
            "I really hope you know your life has meaning. You and your family are amazing. :3 I aspire to be like you now. I really wish the best for your family and (I believe this is correct. Please correct me if I'm wrong) your wife's parents (?) I hope they beat the fuck out of cancer, and to her sister. Well, I can only hope she sorts her life out. And a Thankyou to those people who had taken the kids. :3 your guys are truly amazing and you have bought back my faith in humanity. As for now the only thing I can say about you is... You're really an amazing, caring, human being. Thankyou.",
            "Your wife is wonderful for being understanding and be on your side. It's great that you two were able to communicate and work things out.\n\nJust gotta filter the comments on this site; it gathers good people along with other crazies. ",
            "[removed]",
            ">Quick note to say the sexism and misogony on this website was absolutely insane, people, mostly men, calling my wife lazy and horrible and saying she did nothing all day and was probably having an affair. \n\nOh, go fuck yourself. You presented the case that we drew the conclusions from.  She was being lazy.  She was being selfish and inconsiderate.\n\n >Having three kids full time and a part time job is a lot of work. \n\nNo it isn't.  Unless your kids are special needs it just isn't that big of a deal.  I did the Mr.Mom thing while going back to school and working part time and it just isn't that hard if you have any discipline. Stop giving out passes for this shit.\n\n>She was easily distracted and tired and cleaning just stopped being a priority. \n\nIs she a cat or a responsible adult?\n\n\n>Since I always stepped up to the plate to cook and clean and never communicted my feelings, she had no way of knowing I was falling apart. \n\nIs she a blind cat or just so self involved that she has no empathy for you?  \n\n>She readily admitted her fault in the failure of our marriage and has truly shown she is fully committed to making things right again.\n\nThat is great.  Unless she gets easily distracted again.\n\n\n>I was shocked at the amount of hate shown on here for my wife, and can only say there are clearly a lot of bitter and obviously single people on this site.\n\nYou painted her as a lazy, selfish, and inconsiderate person and are surprised when she is cast as the villian?\n\nNo one jumped to conclusions here.  You gave us all the info.\n\nRemember, we only know her from the picture you painted and that was not a nice one.  ",
            "wow... both these posts just make me so sad for those little girls.  To be thrown away by their mother & now they will be separated & shipped off to people they don't know?!  hopefully you & your lazy wife can live with yourselves because i couldn't.  "
        ]
    },
    {
        "post_id": "4hnr79",
        "author": "florpaday",
        "title": "My BF (24M) spoke about me (23F) to a friend in a language he thought I couldn't understand. He then lost it at my \"rudeness\".",
        "url": "https://www.reddit.com/r/relationships/comments/4hnr79/my_bf_24m_spoke_about_me_23f_to_a_friend_in_a/",
        "score": 2042,
        "num_comments": 273,
        "created_utc": 1462288921.0,
        "selftext": "We've been together for 3 years. Lately he gets annoyed with me a lot, and doesn't hide it at all. He can get downright unfriendly, and it makes me feel worse than it probably should. I come from a family that is very civil, we never yell or swear at each other. He has a tendency to swear a lot in general, and has now taken to swearing when angry or upset at me. Anyway, quite frequently he'll just be in a huff about something I did wrong and display his annoyance at how useless I am openly. It has happened multiple times that it was something I had nothing to do with at all in the first place, and when that happened he did not even apologize, but acted as though he was justified in talking to me in this way because it \"usually\" is my fault anyway.\n\nAnyway, we live in his home country and I've been slow to learn the language, as I find myself surrounded by foreign students most of the day anyway (all our common friends are foreigners). An old friend of his came to visit, and stayed with us. I had never met said friend before, so I introduced myself. Pretty much as soon as I had finished my BF switched to his native language and started complaining about me right in front of me. He was absolutely unaware that I understand more than enough of the language to know he was talking about how \"useless I am\" (his words). I was floored at how he could do such a thing right in my face, to someone I was meeting for the first time. \n\nWe were going to grill and have a couple of beers, and I was pretty quiet because I was hurt. I didn't want to bring it up because we had a guest, and I thought I'd bring it up when we were alone. They were speaking in their language and I got bored, so I picked up my phone and checked my email. When I went to the kitchen to grab another beer, the boyfriend followed me and confronted me with why on earth I would behave so badly and sit on my phone while we had a guest, that I was acting as though someone had died and how I was acting like a rude B-word. (also his words) He was very angry, and started shouting while I just felt trapped, I couldn't go anywhere, his friend was sitting one room over and here I was being berated while I was still hurting from the way he had acted. \n\nHe pulled me to the bedroom and said that we were going to bed, that he didn't want to be around me like this and that if I couldn't behave there was no point in socializing. I did not want to go to bed at all, I was too upset. Nor did I want to go out into the living room and be with his friend, but I couldn't leave either. I can't remember clearly how I got out of the situation, I was too stressed, I just remember that finally I managed to convince him to go back to his friend because there was absolutely NO way I was going to lie next to him in bed while he was in such a mood. He was acting extremely cold, leaning away from touch and only talking to me to berate him. He went back to his friend once I said I'd come back later and I'd act \"okay\". I took ten minutes to compose myself and went out and acted like everything was fine and smiled and basically pretended the whole evening. \n\nThis shook me, and I started to notice that a lot of the time he is quick to act like I've committed a deadly sin when I do something that I feel isn't bad at all. Two days after this incident, he was smoking weed and I got tired (at 5 am), so I went to sleep while he didn't want to. The next day he did not talk to me in the morning, and then sometime in the afternoon when I asked why the fuck he wasn't talking to me he said it was because I was selfish and only ever did what I wanted (because I went to bed). \n\nI guess my question is, how do I get out of this situation? How do I stand up for myself when I feel like he is being unfair? How do I change this dynamic, or should I just give up? \n\n**Edit:** Thank you for all the advice. There's been a lot of comments so I haven't been able to keep up, but I am most certainly leaving him and I am still reading the comments, as there has been a lot of good advice regarding logistics and safety measures that I will look into implementing. From the bottom of my heart, thank all of you for the concern, advice, offers of help and most of all - opening my eyes! You guys and gals are great :)\n\n   \n**tl;dr**: I feel like my boyfriend has not been very nice lately (do correct me if I'm wrong though!), speaking about me to others right in my face when he thinks I can't understand and just being straight up mean for minor offences. I'm pretty timid and don't know how to stand up to it or change my situation. Can you help?",
        "permalink": "/r/relationships/comments/4hnr79/my_bf_24m_spoke_about_me_23f_to_a_friend_in_a/",
        "comments": [
            "Your relationship is abusive.  Get out.  Grab your essentials and get the hell out.  ",
            "Sounds like he should be an ex boyfriend. Why isn't he?",
            "He's an asshole. Break up with him. Do you have friends/family you could stay with and help you get out?",
            "If you are in Mexico, Hungary, Canada, Chile, Germany or Sweden, I have good friends and family who will help you in any possible way. If you need help in any of the languages spoken in these places, let me know and I can research resources for you. Take care, please keep us updated so we know you're okay. ",
            "First of all, you are being abused. Domestic abuse is not all about physical violence.\n\nIf, as you say, this is common behavior from him, you need to get out.\nI interpret from your posts that he used to swear when he got angry, but not at you, and over time that gradually moved onto you. He called you a rude bitch, and talks shit about you in front of his friends in a language you can't understand.\nI understand from what you wrote, that this is an average day for you - not a once in a lifetime thing.\n\nHe gets angry quickly, and your feelings are not valid so long as he is happy and getting what he wants. He thinks you are useless. Is that lazy useless, or stupid useless? Or both? Neither is a good thing to call someone you love, unless you apologize later at least.\n\nThis is pretty much class 101 for abuse tactics. You tear a person down by making them feel worthless. You trap them with you by teaching them that they can't do any better and they deserve your wrath. It's all downhill from there.\n\nDon't try to fix him. Don't stand up for yourself. Get out. You said yourself that his behavior is getting worse, and it will continue to get worse. Someone who treats you with that much disrespect does not love you. He doesn't care how you feel, he wants you to smile and put on a face for his company. You're not a person, you are a decoration. A fashionable piece of clothing for him. And you need to get the hell out.\n",
            ">He was very angry, and started shouting while I just felt trapped, I couldn't go anywhere, his friend was sitting one room over and here I was being berated while I was still hurting from the way he had acted. I can't remember clearly how I got out of the situation, I was too stressed, I just remember that finally I managed to convince him to go back to his friend because there was absolutely NO way I was going to lie next to him in bed while he was in such a mood\n\nThis sounds like a scary situation, and it sounds like you didn't feel safe.\n\nIt sounds like the beginnings of an abusive relationship. He openly insults you, and then gets upset with you for objecting. He isolates you, and gets irrationally angry when you assert your needs. When you argue with him, he tries to assert control physically (by cornering you in a room) and by telling you what to do (demanding you go to bed).\n\nMany relationships are worth fixing. This one is unfixable. Move on. After 3 years, you may have forgotten what it's like to be able to be yourself, and not have to walk on eggshells all the time.",
            "You're being emotionally abused. I know becuause I was once in a very similar situation. Leave him. leave him leave him leave him. You deserve better.",
            "He's controlling and manipulating you. Leave him now. ",
            "[deleted]",
            "If you can, read a book called \"Why does he do that?\" by Lundy Bancroft. Forcing you into a room, forcing you to go to bed when you don't want to, is physical abuse. It's a direct threat, that's why you are afraid. (Don't do this while you're still with him or he could see you with it anywhere)\n\nTake all your important documents. Make sure to change passwords to everything you possibly can. Find out if your country has resources for domestic violence situations. If yes, there may be an escort available for you, to make sure nothing happens to you while you collect your things. Collect your things when he's away. It's paramount to stay safe - is there literally nobody you could possibly ask to accompany you for a short time? An understanding coworker perhaps, or a classmate that doesn't know him, doesn't have any connection to him? Movers? Other service workers?\n\nGet these important things - you say two, three boxes? - That's not that big of an amount. You could actually load all that into a cab. Then go stay somewhere else. Don't tell anyone he can contact your whereabouts. Do tell someone he can't contact - your family perhaps? Tell this person about him and how he will most likely pretend you're in danger or missing, but whatever he does, they cannot give him even a morsel of info. Establish a safety switch with someone, it can be your family too: if you don't call them by X hour, they should call the police and tell them everything. Have this in place for the first week or so if you don't have anyone.\n\nAt work/school, talk to people. Do you have a school counselor? Talk to them. Do you have a therapist or a doctor you see regularly? Talk to them. Tell them you're afraid and are unsure what to do, they will be able to help you or direct you to local resources much better than us. Try to make new friends (not ones connected to your soon to be ex).\n\nAfter you move your important stuff out and are safely at an undisclosed location, leave him a note or send him a text breaking up. Don't risk a face-to-face meeting, there's really, really no point. Do NOT go back to his place EVER AGAIN. No matter what excuse he might come up with, no matter how much he apologizes or whatever - there are countless stories of people fooled by a charming abuser's crocodile tears, going to their place again, only to get themselves attacked or worse once the door is closed. When you leave an abuser, they lash out big time. If you ever need to meet with him face to face, which I really don't think you ever will - it needs to be a public place and you need to park close to the front (if the place has an underground garage, pick a different place). \n\nDon't be afraid to make a scene or call the police if he ever gives you trouble or harasses you. You matter. ",
            "What country are you in? If it's NL, Lebanon, France, Yemen, or Syria (though God knows who you'd be in those last two places) I have friends/family there. They might be able to help.",
            "Get out...get out...get out.  Seriously, get out before you get hurt physically.",
            "Leaving this guy isn't going to be scarier than living the way you are now. You've got to get away from this psychopath. He's taking advantage of the fact that you're a foreigner in HIS country. I bet you he would lose that tough guy act if the tables were turned. ",
            "Can you rent a storage unit for your things and then find a hotel to stay in once you move it until you go to your family event? Then maybe you could look online for housing while in your home country so when you come back to continue your program, you don't have to see your should-be-an-ex at all?\n\n\nBonus: he won't know where you or your stuff is. Make sure that if he asks you tell him a different time/day that you'll be coming back. ",
            "What the actual fuck, OP?\n\n* Lately he gets annoyed with me a lot, and doesn't hide it at all. He can get downright unfriendly\n\n* quite frequently he'll just be in a huff about something I did wrong and display his annoyance at how useless I am openly.\n\nWhen you do nothing wrong:\n\n* he did not even apologize, but acted as though he was justified in talking to me in this way because it \"usually\" is my fault anyway.\n\n* I introduced myself. Pretty much as soon as I had finished my BF switched to his native language and started complaining about me right in front of me. \n\n* He was very angry, and started shouting while I just felt trapped, I couldn't go anywhere\n\n* **He pulled me to the bedroom and said that we were going to bed** \n\nWhat are you a fucking three year old that gets sent to bed cause you had a tantrum and misbehaved???\n\nHow do you get out? You leave. Pack everything you can with you when you go to visit your family. If you have any friends, pack the rest of your stuff and arrange to ship them to the friend's address before you leave. Do this when he's not home. Start thinking about what you have to pack now so that you can move through the process quickly. Cut off all contact when you leave to visit your family but don't tell him you're breaking up with him. Do that after you're gone then cut off all contact. Find arrangements of a place to stay when you return. This is a 100 percent abusive relationship. You're not valued at all. You're a tool to make him happy and when you fail in this impossible task you're punished. What you think and how you feel is irrelevant to him because it *does not matter* in your relationship. The only thing that matters here is him. GTFO OP. \n",
            "This sounds like you could be in an emotionally abusive relationship to me. He shouldn't speak about you like that, and definitely shouldn't speak to you and treat you like that!  If I was you, I would look at leaving as soon as you could get your self sorted. I can understand your problem being timid though, I used to be the same, especially around men like that. If you need someone to talk to about it, feel free to pm me ",
            "I think you are looking for approval that it's ok to leave this relationship. You are being disrespected and aren't happy. \n\nIt is ok to end this relationship. You will be better for leaving!",
            "It's time to call in a Big Favor with a family member to fly back and be your wingman while you move out.\n\nThis is one of those situations where you just need to lay out all your cards and tell someone that you are in an abusive situation and need to have some backup.  Good luck, keep us updated.",
            "Dump him. He verbally and emotionally abuses you on a daily basis. You're in an abusive relationship. Get out of it now. Find some place safe to stay then when he's not home pack all your important things (and anything else you can) and leave. Leave a note, saying you're dumping him and why (he's abusive, doesn't respect you, and you deserve better). Don't answer any of his phone calls when he eventually calls you (and he will). Make sure none of your friends tell him where this safe place is at. Look for times when he's not home to get the rest of your stuff. Find a place of your own. Avoid anything that has to do with him, and move on with your life.\n\nHe treats you trash OP. He routinely beats you down with is words (whether you understand them or not) and that **is not** someone you should be in a relationship with. \n\nI mean, can you honestly see yourself settling down with this guy? Can you see yourself at your wedding saying traditional vows because there's no way he'd come up with something nice to say about you in personal vows? Can you see him calling you worthless and useless to his best man at your wedding reception? Can you see him berating you to the nurses at the hospital when you're in labor with your first kid? Can you see him telling your children that they're worthless just like their mother? Because that's the only end to this if you don't dump him now.",
            "Why are you dating this guy? He treats you like shit.",
            "Leaving an abusive relationship is difficult and scary. Does your school have any counseling services?  Or try to find local domestic violence services. Since you are going on this trip to your home country, maybe you can work that to your advantage - could a friend or family member come back with you maybe?  You might be able to tell him that you're extending your visit a few days but really go back on time, find a new place and then go get your things (preferably with someone else) and move to the new place. ",
            "1) How do I get out of this situation?\n\n-find a way to leave-save up for a plane ticket or ask your parents to loan you money and go back home.\n\n2) How do I stand up for myself?\n\n-dont bother-he will not listen to a word you say and just steamroll right over you\n\n3) How do I change this dynamic, or should I just give up?\n\nDon't bother trying to change the dynamic-he is not worth it.  Don't look at it is giving up-look at it as taking your life into your own hands, deciding you deserve better and empowering yourself with a fresh start\n\nprotip-he is an abuser-you should have some therapy to work on your self esteem and make sure you can see th difference between healthy and unhealthy relationships ",
            "I don't know if anyone has mentioned it being I can't go through 200+ comments but make sure your school also knows in some way or form that you are leaving an abusive relationship. Be it a close teacher, or better yet security. The last thing you want is this guy speaking in his native tongue to others about your wear abouts. It is a good idea to have a safe haven at the place you study at in case he goes there looking for you. Not students but some one in charge. ",
            "[removed]",
            "Why in the actual hell are you staying with this guy? He's terrible to you and doesn't even seem to like you. Dump his ass. ",
            "Please go. Do not stay, you're not in too deep yet and can still get out, because if you stay it's only going to get much worse. I can promise you that. Your mental state is in jeopardy right now and pretty soon you might be compelled to stay out of fear, or his manipulation, etc, the other shit(moving, etc) will work out but you have to leave otherwise it's only going to go downhill. ",
            "This is abuse and get out before it gets worse (it will.) ",
            "Don't play the victim anymore. Stop letting him tell you how things \"are\".\n\nTake control of your life and leave.\n\nThe people you want to be with are the ones who're willing to communicate, not abuse.",
            "I come from a family where there are a few languages spoken.  On one side, Italian was their original tongue.  When members of that side of my family want to \"talk privately in front of you,\" they switch to Italian.\n\nI don't think there's anything more rude.  I've asked them how they'd feel if I were sitting at their table, then leaned over and whispered in the ear to the person next to me while in plain sight.  They sense this is wrong, but cannot sense that it's wrong to switch languages in front of people.\n\nBF is the rude one.",
            "You're in an abusive relationship,  run. ",
            "I never thought I would say this, because I am usually not on the official break-up collective of Reddit. Holy shit though, DTMFA.",
            ">He pulled me to the bedroom and said that we were going to bed, that he didn't want to be around me like this and that if I couldn't behave there was no point in socializing. \n\nWhat a controlling piece of shit.  Get rid of this trash.",
            "Hey. I am a graduate student who moved to another country for my studies. So, I understand the isolation that comes with international relocation. As others have said, you need to leave your boyfriend, as scary as that may be. You are worse off with him than without, and he can actually drag you down to the point of compromising your well-being, and thus your studies. \n\nYour boyfriend does not have your back, and, as you note, his friends have loyalties to him over you. So don't ask them for any help. \n\nI hope that you can reach out to some colleagues or instructors for assistance moving out/storing your books and things. They don't need to be close friends or anything. Most people would agree to help you out by doing something that doesn't impose on them much, like storing a few boxes. Just dare to ask, nicely and politely, and I am sure that some will agree to lend a hand, a  couch or a closet. \n\nThen yes you need to figure out more stable accommodations for yourself, where you will be away and safe from that toxic boyfriend of yours. I know that this may sound overwhelming, but once it'll be done it won't feel so bad. You may well feel so much better. Are there opportunities to find a studio apartment, or an apartment where you'd have roommates that aren't in any ways tied to your boyfriend? \n\none last advice: reach out to your friends and family even if they are away. Feeling supported psychologically will help you go through all of this. ",
            "You give up. He's not someone you can change nor is he someone you should want to be with. He's rude about you when he thinks you can't understand him and he feels like he has a say over when you go to bed and how you live your life. His behaviour is so far out there that I don't even know how you've tolerated it so far. When he says you're selfish, what he means is, 'You won't let me control every single aspect of your life.'\n\nRun for the hills. You can't change crazy.",
            "You've gotten good advice on how to get yourself free.  Just remember to change the passwords to every email account, every bill, Facebook, every credit card, every loyalty reward program, your phone, your computer, your iPad, etc.  You don't want him to be able to log into any of these accounts to meddle with your finances, let alone find your new address.\n\nYou may want to have your mail forwarded to a post office box instead of having it go to your new house.  Maybe he will take the breakup well, maybe he will want to punish you for leaving.  Don't make it easy to find you.",
            "There's not much to add here, most replies are spot on. It's an abusive relationship and will get worse (most likely without you even noticing it, that's how abuse tactics work.\n\nGet out of there. And never underestimate university counselling, they usually know where to get the right support, emotionally, psychologically as well as regarding housing.",
            "This is classic abusive escalation. It will only get worse. Take the best advice from the whole thread and just grab your essentials and run. Material things can be replaced. Grab sentimental and valuable, clothes for your trip and leave the important things with your family for a while, start looking for a new place immediately. Good luck. ",
            "Pack your things and leave this chump. Clearly there are cultural differences in the way you two were raised and unless you enjoy being berated and treated like a door mat you are going to have to leave this guy. Sorry.",
            "That is one of the rudest things I've ever heard.  I wish I was your brother... I'd put him in his place and get you away from his pissy, insecure, childish ass.",
            "While your relationship is fucked I also wanted to add, I find it odd that others make such a big deal of others being on their phone at times like this. It definitely gets on my nerves when I'm speaking to someone and they dont have the class to look at me and instead are staring at their phone; but at the same time when a conversation doesn't involve you, or in this case where they're *speaking in a different language*, even if he hadn't been an asshole earlier you'd be completely within your rights to look at your phone. Fuck. Why do idiots behave this way.",
            "Go to your country embassy if language is a barrier when things get rough. They should be able to help you toward the right direction ",
            "Grow a spine and tell him when he pisses you off. FFS he is just going to keep doing it if you act like a door mat. If he doesn't want act civilly towards you cut him loose. ",
            "GET OUT\n\n\nLEAVE THIS MAN",
            "Get Out of this relationship hun. x He is abusive and this will only get worse.",
            "Please leave him. He is trash. You deserve better.. ",
            "Everyone is this thread has already told you what you know. This is an abusive relationship.  I spent almost 8 years being beaten, raped, and berated daily. I'll tell you now this is how it started. Little things would upset him  and he would make me feel like it was my fault. It does not take long for little bouts of anger to turn huge once they start. Load everything you own into storage and run. If you wait you will end up broken. Men like this are very good at pulling you back in and you will think it will get better every time. It won't. Please. Please. Get out. If you need help pm me. I will help you find the rescources. ",
            "This guy is an abuisve asshole. Get out. Just grab your essentials and go somewhere safe, then break up over text. You don't owe him any explanations.",
            "This is one of those posts where you read the relationship summary paragraph and don't even need to bother reading the actual issue being posted about.",
            "You are insane if you remain in that position. \n\nDo whatever you can to get out",
            "Find a place and get that sorted. You will have the essentials when you take the trip back home. \n\nWhen you come back just find time to move all the big stuff. Don't let on until you are sure all your stuff is out. \nWhen the argument ensues, and it will, don't hesitate to call 911 (whatever emergency is there) he may not have gotten physical yet, but from the sound of it, he's not far off. Get out of there. Good luck! ",
            "It's not giving up but it's definitely time to get out! He's awful to you and you need to protect yourself, beginning today!",
            ">Can you help?\n\n\nsure....DUMP HIS ASS. The guy is controlling and abusive. What could you possibly be getting out of this relationship?",
            "Give up, this guy is treating you like a child, and it's only getting worse.",
            "Dump this piece of shit ASAP.  He is treating you **horribly** and no one deserves what he is doing to you!  ",
            "Give us an update OP!! \n\nBest of luck",
            "**RUN YOU FOOL**",
            "Omfg leave him.",
            "I'm sorry but what the fuck are you doing? Get out of this relationship immediately!",
            "As others have said, you need to leave. Do you not have a single friend, classmate, teacher, school admin, or any other human being in this country who you could ask for help? All you need is someone to join you moving the stuff so dickhead can't corner you. If you literally do not have a rapport with any other soul in that country, look into government services. Hopefully there is a battered women help line, or police you can simply report the issue, and that you are moving, and feel unsafe having that happen alone.",
            "Hi OP. I just want to say that people have left other people for a whole lot less than you are putting up with. \n",
            "I'm just saying you could do better.",
            "Why are you with someone who can't stand you?  You need therapy for your lack of self-esteem.",
            "Idk why you'd stay with someone like this. You obviously acknowledge he's a dick most of the time, and you're not happy. So leave. What's the point of putting in effort and trapping yourself permanently if you're not happy?!  I do not understand people who cling to relationships they're clearly unhappy with.  Conversely, there are two sides to every story, and I guess it's POSSIBLE that you're both jerk to eachother in different ways. That said, it sounds like he's generally the one being a dick and thus you should run, fast. His behavior obviously doesn't register to him as inappropriate or abusive, so why assume it'll get better or that he won't escalate to physical abuse?  Wake up, OP. No one deserves being abused. ",
            "So, serious question here: are you in a position where you can financially support yourself without the bf in the country you're currently living in? Or do you have some means to get yourself home to friends and family, if that's not possible? Cause, if you aren't, you really need to start coming up with a plan because this relationship is looking like it's heading down the abusive path. If he's seriously starting to insult and harass you in front of his friends *now*, can you imagine the shit he might start doing in private? ",
            "Pack up as much as you can that's important and just take it with you and never go back. Ever. Your boyfriend is an abusive asshole. Leave anything you can that you can live without. Take your important documents and change all of your passwords.",
            "God damn, I would say end it just after reading the first paragraph! The rest of the post is just confirmation that he is an asshole. No one deserves this kind of disrespect. ",
            "You are being abused.\n\nVerbally and now escalating to physically.\n\nLeave.",
            "Wow, he is a really, really terrible piece of shit person. Run.",
            "You are in a very abusive relationship. You must get out.",
            "He is being emotionally and verbally abusive to you, get out, you deserve better! If he treats you this way, how would he treat your children? I have no doubt your confidence has been shaken, but you deserve better. You deserve a man who will respect you. Good luck...and seriously think of leaving....it isnt right and will only get worse.",
            "He must have some other fantastic qualities because what you described was someone who is a real asshole. I see you're going to a family event in a few days. Talk to them. Get their help if necessary. Good luck.",
            "I don't think he wants you around but is too chicken to break up, so he's complaining instead. Do yourself, and him, a favor and end it.",
            "Please leave that horrible guy. You are such a wonderful person that deserves so much better. Best of luck <3",
            "How much longer do you have in the program? A year or more? Do you have a grad student office? If your boyfriend a student also?\n\nI suggest finding a new place before you visit family - maybe share an apartment with another female student? Take your stuff a box at a time. Photograph everything before you move the first box... If your boyfriend destroys things, call police.",
            "Run like hell before it gets worse and I promise you if you stay it will get so much worse. This sounds like the way my ex husband treated me, and that bastard graduated from being rude and manipulative to breaking bones. ",
            "I'm scared for you, OP. Please make (secret) plans to get away from this guy, don't let him know where you're moving or where your stuff is, change up your school routine if he knows your schedule and regular haunts, make sure he hasn't installed any weird shit on your computer like a keylogger. Change your passwords for all your shit. If possible, plan your escape from a library/shared computer, setup a temporary free email account and arrange for any confirmation emails to go to that account and not your regular email address. And if you can, let us know when you're safe. ",
            "He's treating you like his property.  NOT at all like an equal.  And it will NOT get better, it will only get worse. \n\nIf you want to be treated better, you need to get out of this relationship. ",
            "Why on earth are you with him and let yourself be treated like shit? ",
            "After reading some comments it seems like you are going to do the smart thing and move out asap.  If you are desperate for a place to store your stuff, you might talk to a professor or someone at your school about keeping your books and equipment there for a while.  \n\nYou could also rent a hotel room and stay there while you look for a new place.  If money isn't an issue and you have too much stuff to move on your own you could hire a moving company as well.",
            "Your BF is emotionally abusive.  Don't let him take advantage of you.  Leave IMMEDIATELY and cut all contact with him.",
            "Get out now! There is no fixing someone who is that selfish, abusive, and that fucking whiney.\n\nReach out to family or friends from your native country to get out of this situation as soon as possible. Good luck!",
            "> display his annoyance at how useless I am openly.\n\nEmotional abuse right here. Take your stuff, cut him out of the picture ASAP, and work on yourself.",
            "All of these posts have really great advice. Reach out to friends, start moving things out now, find a new place to live. Do whatever you have to, just get out. I really wish you the best of luck. It can be so hard to leave an abusive relationship. I'm proud of you! ",
            "Please refer to top comment. AND learn from this unhealthy relationship so you don't get in this situation again. You deserve better!",
            "What country are you in?",
            "Even from reading just the first paragraph I have no idea why you're still with the dude (if you are). ",
            "Just wow. I once broke up with a boyfriend and never spoke to him again because he said, \"fuck you\" during a minor fight, and I never regretted it. You have serious self esteem issues to put up with this shit, please get into some therapy or you're just going to keep getting into relationships with people who abuse you. You deserve better.",
            "Woww your boyfriend is such an ass!!",
            "I'm glad to read that edit girl, you deserve so much better than all that! Keep your chin up, things can only improve once you leave his sorry ass.",
            "He's abusive you need to leave like now! Grab a plane ticket a bus ticket anything! Collect all of your necessities tonight and leave when he is asleep. This could turn physical fast and it will get very ugly. ",
            "I too came to say I could not continue to read the entire post, as there were way too many red flags in the first half. You've just described a textbook abusive relationship. I guarantee you it will get worse. Get out and cut your losses.",
            "Why are you not packing and leaving??  This is an abusive man!  If you stay with him, things will never \"get better' they will only get worst...until he is being physically abusive as well!\n\nPack and RUN..do not walk....away from this relationship!  It is pure poison!",
            "My last relationship was very similar, he would do all that but in front of me in english, and then accuse me of cheating on him frequently. He was secretly cheating on me.  Leave. Ignore his advances to get you back, if he tries. That is one toxic relationship you have.",
            "Based on his behavior recently, he's probably going to break up with you. If this is very recent and he hasn't been this much of a dick in the past, he probably has been thinking about how much he wants to break up with you and it makes him mad. It typically doesn't have anything to do with you specifically, but his own feelings about the idea of a relationship. I've been in that situation, the month long or so period where you are frustrated at your GF because you think you don't like them very much. It doesn't mean he has fully came to that conclusion, it means he has been thinking about all the things he dislikes about you and its the only thing he can think about. This happens to guys a lot in relationships around that time, typically its because they don't see themselves as 'free' like their single friends and begin to resent their partner just for being their partner.\n\nIts possible he may get over this, its possible he may not and break up with you, and even worse, its possible he may not get over it and not break up with you and become abusive. A lot of commenters are saying that this is already abusive behavior, but typically this place is very quick to label everything as abusive. Its shitty behavior but that doesn't mean he is an abuser based on this one incident. Its possible he just had a bad moment where he was mad at you, we ALL do shitty thing's when we are mad. I wouldn't be so sure to shout ABUSE ABUSE!... yet. These things can quickly get out of hand. That behavior can change if you allow it to continue without being resolved. \n\nEven a nice, sweet SO can turn into an abuser if the relationship goes sour enough. \n\nI would leave him before he makes the move, and make a big deal out of it too. Leave without warning, and make sure he knows and feels bad for the reasons why you left. ",
            "shut it down, deal breaker.",
            "Why are you still there? If he is not happy and making you miserable, then move back home. It isn't worth it to put up with that in any country. ",
            "See if your school has counseling services to help you get on your feet as well. If you need to take time off from school they may help you arrange resuming after a semester",
            "Leave this loser",
            "This is worse than being locked in a basement. Get out if you can. ",
            "Break up and move out.",
            "I am so happy to read your edit. Getting away from this manipulative, abusive person is the best thing imaginable. There is no way to salvage this that is either appropriate or safe for you. Follow the many comments on staying safe and best of luck to you!",
            "One more thing: his behavior is abusive enough that you owe him zero anything. No explanation, no goodbye. No money. Don't let him guilt you or manipulate you. He knows full well he is doing wrong, and will know why you left. So will his friends. None of them will ever admit it.    \n\nPlease be safe. No words, no warning. ",
            "Time to give up.\n\nHe's not a keeper.  He doesn't treat you with the respect and kindness that you would expect to give a stranger on the street. \n\nIt's okay to break up.",
            "I just wanted you to know that I got to the end of your first paragraph and think that he's abusive. Got to the end of your post and it was confirmed.  \n  \nPlease take the advice here and get out. Ask at your university about support for students (therapy, help finding home/roommates, financial support if you need it). People in your program might be willing to let you crash at their place for a few days when you get back from your trip home. It is a brave thing to recognize when you need help and ask for it. Please get help when/if you need it. ",
            "Why are you staying with someone who treats you like shit.",
            "Get a storage locker for 1 month asap, get a new place to live asap, do it in secret.  Wait till he is at work or class or whatever for a few hours and get your stuff moved out as fast as you can.  Don't ever come back, block him on social media, and move on as best you can.  Just get the essentials and get out!\n\nIn-fact, I recommend getting two huge luggage suitcases and using those for your boxes so you can try and get out in one haul.",
            "Sounds like a dick. Take your most valuable/treasured things and leave. ",
            "What country are you in. It kind of matters for giving advice. ",
            "I definitely think you should get out of this relationship, but i would just like to point out the hypocrisy of him getting mad at you for being disrespectful because you looked at your phone, meanwhile they are speaking their native language and excluding you/treating you like a third wheel. This guy is a toxic asshole.",
            "He sounds....really mean. Can you put your stuff at a friends house till you get back? See if you can crash with someone until you find a roomate. How he is treating you is not ok.",
            "OP I couldn't even get past the first paragraph without wondering why the fuck you are still with this jerk. He is very emotionally abusive and you need to leave him before he becomes physically abusive. You deserve better than that bullshit. No one should speak to you that way. Especially not a significant other. ",
            "Something that strikes me about your account is how complex the communication barriers between you and you boyfriend are. They don't need to be so complex.\n\nFirst off, I think he acted like a jackass to you, because he spoke poorly of you. That easily is the worst part of his behavior, and is what you should take exception to. \n\nThe less important issues are: \n  1) he spoke around you in a different language. As someone who's relatives speak in different languages than me during the holiday seasons, I find this really annoying, but it's just a nuisance, nothing more. They're still my relatives.\n\n  2) he had no idea you knew what he was saying in his different language. This actually makes both of you look bad. He should know what languages you understand; he should know this, because you should trust him enough to let him know this.\n\nReally, the problem is that both of you are uncomfortable around each other, to the point that your relationship isn't good any more. If you guys want to salvage it, you'll need to focus on the things that are worthwhile in your relationship, not the bullshit that drives you two insane.\n",
            "Abusive relationship, sounds like one of those islamic countries too. \n\nmove out and move on, life too short for shit like this from scumbags!",
            "I have one question: Why are you with him?"
        ]
    },
    {
        "post_id": "4oinb3",
        "author": "SO_throwaway1",
        "title": "Update: I [26F] missed an important funeral and now I think my 5 year relationship with my partner [28M] might be over.",
        "url": "https://www.reddit.com/r/relationships/comments/4oinb3/update_i_26f_missed_an_important_funeral_and_now/",
        "score": 2048,
        "num_comments": 364,
        "created_utc": 1466160244.0,
        "selftext": "Link to my [Original Post](https://www.reddit.com/r/relationships/comments/4mi0e8/i_26f_missed_an_important_funeral_and_now_i_think/)\n\nOriginal TLDR: my boyfriend can’t forgive me for missing his grandmother’s funeral, but it was scheduled only 4 days before I had to hand in my huge research project for my masters degree. He has been distant and treating me coldly and for the past 2 months and now wants me to go back to my home country and leave him to grieve alone for a few weeks. He says he needs some space and is considering moving out of our home; but overall wants us to still be together. Advice? Help?\n\n\nI just wanted to first say thank you very much for all of your advice, it was really helpful, it made me feel like less of a terrible person and made me realise that my boyfriend is still mourning the loss of his grandmother. My SO and I had a long discussion the night I posted for advice on Reddit; and we agreed that we wanted to be together but that something needed to change in our relationship. We set some basic ground rules; we both agreed to start seeing separate therapists, him for his grief and troubles with his Dad and me for my lack of confidence and stress management. He again asked for space, so he moved out of our bedroom and into the spare bedroom in our flat. I also booked a flight home for a few weeks to visit my own family, and I am set to leave in 4 days. \n\nWe were making some good progress this week, enjoying time with each other, going to the park, just generally trying to reconnect. After sleeping in the spare bed for 5 days, he decided to move back into our room, and I was very happy about that. Up until 2 days ago I genuinely thought that we were going to make it through this. \n\n\nThings came to a head last night; I received my grades back from the school. I am very proud to say that I got an A on my research project, and one of my urban design proposals has also been nominated by my school for a Gold award from the RIBA. I am incredibly proud, this year was definitely the most difficult in my entire life and I did not expect to do as well as I actually did, I literally just wept when I get my results. \n\n\nI sent my SO a long message, letting him know how I did, and about the nomination, but more importantly thanking him for being there to support me through my degree. I told him I loved him, and that I was glad we were working together on our relationship. \n\n\nHe came home that night fuming; he was so angry. He just yelled at me for basically an hour, about my lack of confidence in my own work, and about how I didn’t need to miss his grandmother’s funeral. He told me he hated me, and after that I sort of just numbed out. I don’t really remember much of what he said after that, I just stopped talking and listening. \n\n\nMy final, end of year show is happening this week. It’s a huge celebration of the student’s work; I’ve filled an entire wall to exhibit my architectural work and my research results. During the end of year show a lot of people find jobs, so it’s important for us to be there to network and talk about our projects with people in the industry; I did this for my boyfriend last year when he exhibited his own work, I spent 6 hours at that event talking to different people about how amazing his work was. This morning he told me not to expect him to come tonight, because he needs to go to the gym. \n\n\nI’m flying home in 4 days, and I can tell that he just wants me to leave and never come back, which is what I am doing. I have stuck with all my promises that I made to him, I’ve supported him as best I could and I’ve begun seeing a therapist. He hasn’t even called his GP to get a referral to a therapist yet. He doesn’t want to fix our relationship; he just wants to keep me around to pay half of our rent and to use as a punching bag. \n\n\nSo we’re over, I just paid my final half of the rent, and I’m moving back to my home country. I was originally only planning on returning for a few weeks, but with this ‘Brexit’ vote looking so grim I don’t really see the point in being in the UK anymore. Why return and find a job here when I will most likely be asked to leave in a year? I Like the UK, and I love my boyfriend, but it seems neither wants me so I’m going home to take care of myself. \n\n\nTLDR; Tried to use Reddit’s advice to fix my relationship, worked for just over a week.  I got my grades back and I did extremely well, my SO threw that back in my face, and is now refusing to come to my final exhibition of my work.  So we’re over, I’m moving back home, I have no plans to ever return to the UK.\n\n \n\n\n\n",
        "permalink": "/r/relationships/comments/4oinb3/update_i_26f_missed_an_important_funeral_and_now/",
        "comments": [
            "[deleted]",
            "[deleted]",
            "Congratulations on all of your success. I suspect some of your boyfriend's resentment at the parents who didn't take care of him transferred to you. You are right that without him getting therapy for deep-seeded issues, your relationship will not survive.\n\nGood luck!  This Brexit thing isn't over till its over. Polls are often wrong.",
            "He is dealing so badly with this I am stunned... Take care OP and good luck with finding a good job wherever you live! Too bad for him...",
            "[deleted]",
            "Just out of curiosity: Does he already know that you won't come back? If so, what was his reaction? If no, do you plan on telling him somehow? \n\nAlso, I think you made the right choise. I can certainly imagine that he will come around at one point and realise how idiotic his behaviour was, but I can totally see why you wouldn't want to wait for this since this day could also never come.",
            "Congratulations, you've done really well in the circumstances. I'm sorry that your relationship isnt functioning as it used to. I wanted to tell you that you werent wrong to concentrate on your school work. Yes, its your partner's family, but we both know that would not be a valid excuse in university. I've seen them ask for death certicates as proof before and thats only for immediate family. \n\nI feel for your partner, because my grandmother practically raised me and I would be so lost without her. However, that is my own feeling. I wouldnt be angry at someone if they couldnt go to a funeral with me. Even if it was my partner, I think that if the reason is very important, which yours is, then that is okay. \n\nHe's grieving and is lashing out at you because youre the closest to him and thats what people do. It is not the correct way of dealing with it but they do. I think he does need some space. And you should at least let him know that you are thinking of staying with your own family, and not returning. \nI'm sorry that this referendum is affecting your decision too, honestly, if I could up and go I would. and I'm British. I cant stand it, and we'll be losing thousands and thousands of great people if it does happen. Honestly I'm scared, and I would just leave if I could. I cant imagine what it feels like to be on the receiving end of all this leave rhetoric. \n\nYou'll be okay, I can tell. You're smart and a lot stronger than you think for persevering through your degree. Best wishes to you, whatever your decision. ",
            "Op, my boyfriend and I had only been together 6 months when my grandma died. It was during the time of his midterms. I of course went to spend her last days with her; by the time he finished and left to join me, she passed away while he was on the way. She was a second mother to me and I had desperately wanted him to meet her. I was disappointed and a little hurt, and every once in a while I still am sad she never met him since he is now my husband, but I never took that out on him. Your partner's grief was understandable; his treatment of you was wrong and you were right bit to stay there and be his punching bag.",
            "A partner is supposed to support you in difficult times and in good times. You helped him in every way that you possibly could and he didn't appreciate it, and also couldn't support you. You're better off without him.\n\nCongratulations on your achievements, you should be really proud of yourself! ",
            "Hate? He hates you? You really supported him to the best of your ability. I have to say he probably had expectations of the relationship that were different than yours. You saw yourselves as equals and he saw you as a supporting role in his life.\n\nYour life sounds awesome btw. I'm so sorry you endured this, but damn woman. You are so strong to keep your head up and keep kicking ass the whole way through. Do awesome things.",
            "I don't think you should leave the UK forever. You never know what the future will hold, and you sound like a smart hard worker. That's very valuable. \n\nI think it's right that you and your ex broke up. He definitely was using you as a punching bag and wasn't keeping up his end of the bargain. He is t ready for you and your achievements. \n\nDon't take your grief out on your career though. You are capable of so much, and I think that a lot of people here would agree. ",
            "He can't continually use grief as an excuse for his bad behavior. ",
            "I think the rancid cherry on top of this totally not okay sundae is him saying he was skipping your end of the year show because he had to go to the gym. That's such a passive aggressive and petty thing to do. You missed the funeral because you had educational obligations that couldn't be postponed. Trying to compare that to 'going to the gym' is completely out of line and mean spirited.\n\n I know grief can make people lash out, but to still be acting like this after you made an agreement to strengthen the relationship shows he's not ready to move on from being angry. And his version of angry is just cruel and abusive. I think you're making the right choice. \n\nCongrats on all of your success. You worked hard and totally kicked butt. I hope you can *BUILD* a great future back in your home country, and continue to grow as the lovely person you sound like. :) ",
            "You made the right choice. I thought a lot of his reaction was wrapped up in his grieving process in the first post, which maybe some of it is, but that's never an excuse to treat someone like this without making any effort toward change. You stuck around and gave the relationship one last try and he's (literally and metaphorically) going to the gym. It shows how little he's invested in changing or improving any part of himself for you. ",
            "Congratulations on your graduation and success, OP! I'm sorry it's come with such a painful personal situation. However, I think you're doing the right thing.\n\nThere are a lot of clear, obvious red flags in your descriptions of your boyfriend's behavior. The verbal punching bag stuff in particular is horrible. But honestly, the point I keep getting hung up on in your post is the fact that your boyfriend refused to attend your final show because he had to go to the gym.\n\nThe freaking gym.\n\nYou described how important this show is to people in your field and how you spent hours the year before networking in support of your boyfriend's work. He drew a direct parallel between you missing his grandmother's funeral because you were racing to finalize the culmination of your educational career (after many supportive acts following her death) and him missing this vital final show of your work because he was going to a gym for a random workout. That just blows my mind.\n\nI cannot even express how unreasonable and disrespectful he's being. Grieving or not, some words can't be excused and some actions can't be taken back. I'm glad you're moving on and have found a great job, though I'm so sorry about the painful circumstances prompting you to do so. Good luck and be well. ",
            "This made my blood boil. I get he is grieving but WOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOW.    \n\nOP I know you love this guy but.... you deserve someone who will appreciate you.",
            "The UK and your ex are worse off by pushing people like you away",
            "People so often place the dead above the living and I don't understand. It's necessary to grieve, but why is it necessary to grieve at the cost of your future?",
            "The unfortunate truth is that, life does not stop just because someone you love has passed away. He's grieving and I think one day he will regret how he treated you.  ",
            "I think you're making the right call to leave him but an irrational call to leave the UK.\n\nYou are in a position now to network and find an excellent job in the UK and even though the Brexit vote is looking grim, having a great job would more likely than not keep you in the country. Besides, the vote hasn't even happened yet. You would be losing valuable networking that you've busted your butt for, you shouldn't torpedo that just because your boyfriend turned into an asshole. It sounds like you're trying to punish yourself, that you're still feeling guilty.\n\nSo stay. Start your own life. If you have to leave, you can leave then but I doubt it will come to that. Don't just give up! ",
            "This guy is such a piece of shit. He's emotionally and verbally abuse you. Grief is not give you a pass to use someone as an emotional punching bag.\n\nCongrats on your exams! And good luck on the networking!",
            "I want to plaster this all over the stupid exit campaigners who think that \"dem foreigners just want my jobs m8\" like uh hello!? This person is nominated for awards and is obviously incredibly smart do you really think they're taking  YOUR job? Ugh this stupid vote has got me raging. I'm sorry you're leaving us (especially since it sounds like you have so much to offer our country) but I'm so glad that you're leaving your POS bf. He sounds nasty and quite jealous.",
            "So, here's the thing. \n\nGrief is an insane, unpredictable, uncontrollable monster that often brings out the very, very worst in us. \n\nWhen I lost my father, I was angry, vile, and mean. I lashed out at everyone. I ruined relationships with very important people in my life and I regret it. \n\nYour boyfriend might be going through the same thing. I'm decently sure that his behavior toward you isn't personal, nor is it really about you. He's in pain. Pain makes people do things they wouldn't normally do. He's gonna act crazy because right now, he damn well is. He doesn't even really know what he's doing: he's acting on pure emotion. \n\nThe loss of a loved one is a crazy, crazy time. I can tell you this with certainty: make sure you really, *really* want to leave, because if you do now, it's unlikely you'll come back. \n\nYou can try to stick it out and work through the grief. It's possible. I've known people who have done it. Or you can leave and start over. The choice is yours. ",
            "I'm thinking he's actually jealous you're doing so much better than him, and him trying to get you to go to his grandma's funeral KNOWING you had your final project coming up was a way to sabotage you. And when you didn't take the bait for it and ended up doing really well he was angry because his plan to ruin you failed. Probably one of those guys who can't stand it when his girlfriend does better than him.",
            "[deleted]",
            "[deleted]",
            ">I got an A on my research project, and one of my urban design proposals has also been nominated by my school for a Gold award from the RIBA.\n\nCongrats OP, that's amazing! Plus you dumped the baggage!",
            "I'm sorry that your amazing efforts are being entangled in your SO'S drama.",
            "Congratulations on kicking ass in your Masters project.\n\nSorry your boyfriend was so broken. ",
            "I don't think we'll vote to leave. Polls are often wrong, have faith please. ",
            "Don't be so dramatic, why do you assume you'll be asked to leave the UK in a year when Britain leaves the EU? You sound like a skilled worker, and skilled workers are always in demand.",
            "Hey, your SO might not come to your exhibition, but reddit will if you want! Best of luck! ",
            "I don't know why the outcome of this all is making me really tear-y. Best of luck to you OP, you sound like a very level headed and dedicated person. I hope moving back home and this new chapter in your life goes well. ",
            "Just chiming in with Brexit, I really don't want the country to vote out (I'm voting in), but they won't be kicking people out that already have jobs \n/ have migrated here. If you are happy in the UK please stay!! Other than that, I'm very sad that it had to turn out like this and well done on your results X ",
            "Wow! RIBA nomination is a big deal! OP you must be damned good. ",
            "I know he's grieving, but that doesn't give him an excuse to be a gigantic asshole. Leaving is the right decision.",
            "I don't think his behavior is okay. But I want to say something... in your OP you shared how wonderful your relationship was before. And the level of intimacy and closeness he and his grandmother shared. I don't think anyone would blame you (and many would commend you) for leaving, but I cannot imagine the immeasurable level of grief he is going through. Grief makes you mad. It is a real pain. Heartbreak is real, a sense of loss is a really dark emotion. I can't even imagine how difficult it will be when my boyfriend loses members of his family (knock on wood).  \n  \n  \nI don't know if your relationship is salvageable but I can understand to some degree his response to your email about your academic achievements. I feel like he interprets your project, and therefore your studies, to be what caused you to miss the funeral. I know you tried your best to be there for him but I'm sure he felt alone, abandoned. It sounds like you and his grandma were the two main emotional and intimate pillars of his life and he lost one and the other wasn't fully there for him as he would have wanted. Fear and loss make people irrational and so despite your reason for not attending the funeral being valid, I doubt he perceives it that way. You sharing your achievements was probably a reminder of that anger and abandonment, and while you think he has not been there to support your achievements and hard work, I think to some degree he feels that you were not fully there for him.    \n        \nThat being said, I feel for you. And for him. But maybe in the end it shows you two were not right to be together because the both of you did not know how to work through a really critical and pivotal moment in both of your lives.",
            "You sound like a smart person with a bright future. I'm really glad you got yourself out of that toxic relationship. Onward and upward, friend! :-)",
            "I hate that the Brexit vote is making people feeling unwelcome in the UK. ",
            "I just want to say congratulations and this internet stranger is proud of your hard work! You made a hard choice to go home but it will be for the best. Maybe ask at the show if anyone has contacts in your home area?",
            "I want to put my opinion up. I think you guys should have seen a therapist together. You're not married, but you have 5 years under your belt. You wanted a lifetime with him and I'm positive he does too. He's lost his grand mother and hes mourning. He went back to his home country and probably dug up the past like his father beating him which you previously mentioned. \n\nHe was acting out, he needed something or someone to blame and he did it all wrong and thats all HIS fault. He shouldn't have treated you wrong and responded in anger that he has, Im sick of reddits normal response and telling you to just leave him because hes an idiot. He's not an idiot and you have a PhD so you should know that. You love him for a reason, Don't let reddit tell you otherwise.\n\nFind some help so you can both sit and talk calmly about issues you have in the relationship even including his recent passing of his grandmother and your inability to attend the funeral.\n\nAnother note, he was probably angry at you not attending because something could have happened at the funeral with his family that made him so angry about you not being able to attend. It could his family talking badly about you, or his family talking badly about him and you weren't able to be there for him. Men are known to have trouble communicating their emotions and I'm definitely one of those guys. I still make it work with my girlfriend and its a battle but one worth fighting. If you need someone to talk to or anything of the sort. Please PM me, I'd like to focus more on good advice and making it work because I'd never want a community of people constantly telling me to leave the person I love.",
            "One of those posts I would love to read other side of the story... ",
            "grief or not, fuck him and his behaviour",
            "This is such bad timing. You are both going through key moments in your life at the same time: his is about loss. Yours is about your future. You are both arguing over who should get the most attention here. There is no winner. So please don't feel like you are right and he is wrong. You can't begin to understand the depth of his loss. I agree he's not in the right for lashing out at you, but I can understand how it may feel to him like you are gloating. When you lose someone so important, it hurts so much. It even hurts that the world just goes on as usual; it feels like it should stop and not move ahead. You moving ahead is like salt in the wound.\n\nHe needs to work on his grief, for sure. But having lost my mom at a young age I can understand exactly where he's coming from.",
            "I'm sorry that this happened to you! For what it's worth, you did the right thing by focusing on your schoolwork and supporting your SO in the best way that you could. You did everything that you could to try to strengthen the relationship. You can't control how another person will react or respond, and he made his own choice to not work on the relationship with you.\n\nGood luck with your end of year show! ",
            "Congratulations on your accomplishments! That being said, I don't blame you for wanting to leave either. There's genuine grief, and then there's taking things way too far. He has no cause to be so hateful to you. I mean, it's not like you just skipped the funeral to watch soap operas at home, yanno?\n\n",
            "Congratulations at doing so well, despite being with a partner who is angry with you for your achievements (and, perhaps, doing better than him?) I am glad you are leaving, this would not end there. He would have always been bitter when you achieved things, even those equal to his, and if you stayed with him you would begin to feel guilty for being successful. Nobody should feel that way.",
            "So you did the same course as him... And did better than him, it seems. And then he got raging mad. \n\nEh fuck that guy, do not sacrifice any of your career opportunities for him or let him drive you out of the country.",
            "What an asshole. Good riddance. He's upset you did well on your huge project? Fucking great. \n\nAnyone who disrespects your professional or educational aspirations, and asks that you shove them behind their personal needs/wants, is either incompatible with you or just a pure asshole (depending on how they go about it). This guy is a pure asshole. It sucks to lose someone close to you, but that does not remove all consequences from your actions. You're not allowed to just be a huge asshole. \n\nCongrats on your achievement, and I hope your grieving process goes smoothly and you'll feel great again soon!",
            "I understand he's grieving, but that doesn't give him the right to treat you like trash. By the time he realizes this mistake it will likely be too late. Fly home and never look back. His loss.",
            "Your boyfriend is an ass and doesn't deserve you.\n\nNever stay with someone that isn't proud of your achievements. ",
            "Congratulations on your project and best of luck!",
            "Good for you.  Now you are free to enjoy your success, and maybe give a chance to someone worthy of your dedication, talent, and achievements.",
            "Congrats on your hard work. His anger is a red flag to me. You deserve someone who who supports your work. His logic is faulty as hell. ",
            "If he is 28 I'm sure his fucking grandmother was pretty damn old. To let something like his grandmother dying derail his whole life is pretty telling of his emotional maturity. It's sad when you lose family but this guy has something wrong with him if he can't handle the fact that people get old and die. OP is better off finding someone who isn't unhinged. ",
            "Fk. He sounds like he lost a winner. Sorry about the rollercoaster week. \n\nGreat job on your schooling. That's so big. And so amazing.\n\nGood job on standing up for yourself. \n\nYou rock.",
            "This is just a sad story. Ex-BF is simply overwhelmed with grief and doesn't know how to handle it. Some day he will get through it and realize how much of an asshole he was. I don't think anyone was the bad guy here, and both parties lose.",
            "Just to say, as a Londoner, I really really really hope Brexit doesn't happen cause we need people like you. Also huge congratulations on your nomination and wish you lots of success : )",
            "Congratulations on your excellent work, AND on your mental clarity. You will be so much better off without this cruel person. ",
            "Your ex-boyfriend is an asshole, full stop. This should be one of the happiest times of your life and your ex is just shitting on everything. I know nothing about UK education or architecture, but I do know that if you win an award, that means you did a hell of a good job. You should be so proud of yourself.\n\nI'm sorry your ex didn't hold up his end of the bargain, but it sounds like he was just weighing you down anyway. He didn't even see a grief counselor, which was for his own fucking benefit! He sounds resentful and you don't want resentful people celebrating your accomplishments with you.\n\nCongratulations on the job and dropping the dead weight! Good luck at the showing, and best of luck in the future! ^_^",
            "I'm sorry this turned out so poorly for you :( Wishing you the best in your future endeavors.\n\nI still think he is stuck in mourning, but until he's ready to get unstuck, he's just an ass.",
            "i think you are making the right call. not being able to put aside petty bullshit to support each other is a major dealbreaker for me",
            "Just here to say: just because he's an ass and the relationship failed, doesn't mean you should give up on working in the UK. London has the most amazing architecture practices to choose from and with such a great research project that got the support from RIBA, you have a great chance here. I don't know where you're from but there are only few places where you can learn so much and do so much good for your career. You can always move back later but completely dismissing giving it a chance would be a shame. \n\nI know London can be a difficult place to live, especially on my own. But I can speak from experience when I say it's worth it - 4 years ago my ex did a very similar shitty thing to yours and I was ready to move back home but then decided to stay and while it was very tough the first year, I don't regret a thing and have the best job. There would have been no comparable company or job in my country.\n\nJust saying - it sounds like you have great talent and the drive and commitment to work hard. I think you would do great in London.\n\nFeel free to PM me if you need to talk.",
            "Print out this thread and all the comments and leave it for him when you leave. Maybe something might penetrate his thick skull about the mistake he's made and what it has cost him.\n\n",
            "It's--not your grandmother? Like, I get that he's grieving, but he can't expect you to abandon your degree and your career just because he suffered a loss. Also, grieving doesn't mean he gets to be mean to you.\n\nGood luck in future. I hope you feel better soon. You did the right thing.",
            "I'm sorry your ex-bf was so goddamn horrible to you. I know he's still grieving but he's shown a real lack of insight and compassion that goes above and beyond the pale. I think breaking up with him is the healthy thing to do and you're a very strong woman for moving on with your life when he's made it clear that he doesn't value you the way you value him.\n\nCongratulations on graduating and doing so well, and on moving on with your life! As incredibly painful as it may be in the short term, I am sure you will prosper in the long term!",
            "Drop the dead weight, do the networking. \n\nGive both home and UK job perspectives a chance. Do not limit your career experiences due to a bad relationship experience, you will miss opportunities. ",
            "This guy doesn't deserve you.",
            "Congratulations on taking care of yourself and your needs :) And on your work! It's amazing how far you've come! Honestly this guy was a complete asshole to you and you deserve so much better.\nQuestion, though. I've been interested in going into architecture for college (as well as possibly going to the UK because I don't want to stay in my home country that much). Is there anything you kind of have to say about it? Words of wisdom almost lmao. Sorry if this is completely from the left field, just wondering :) ",
            "You dodged a huge bullet.  This guy is just awful.",
            "he is still in mourning but acting like a jerk about it.....",
            "Don't leave the state if at bottom it is because you will be breaking up. Otherwise he doesn't deserve your love. People make mistakes, are flawed and miss opportunities.  Often on this board it is the opposite, a person says 'my SO missed x and x, I want to leave them' and people immediately come to their support.)",
            "thank god he showed his true colors",
            "Go you! I'm really proud of you for this decision. It must have been extremely hard but I think you made the right choice. ",
            "I know you love your b/f still and this sux, but just realize as good as things may have been the real barometer isn't just how great things are when everything is going well, but how as a couple you get through the hard parts of life because as we all know, life isn't just sunshine and puppies. \n\nStay strong and congrats on schooling school. ",
            "I could understand being sad but yeah he was kind of childish in his actions. Screw kind of he was an ass. I understand he's grieving but obviously you guys are grown and he had to understand that you have your life too. ",
            "Congrats on your success!!\n\nThe important thing is you tried, and that now you're doing what you need to do FOR YOU. Dont look back, and live your life.",
            "Ah. So he was just a dick. \n\nGood move in leaving him.",
            "[removed]",
            "[removed]",
            "Congratulations on your work and the RIBA Nomination!  This is all thanks to the hard work and effort you placed over the last few years and a lot of people are proud of you for this!\n\nI can understand your now ex's grief over his grandmother but I don't think he realizes that he cannot always have his grandmother stuck in his head forever, and hope that he eventually learns to let go of the now defunct past.  \n\nJudging by your last paragraph though, it seems like you have made a decision with him becoming your ex but you haven't actually let him know?  You probably should do so even if you do or do not come back to the UK based on the Brexit / EU Referendum.  The biggest mistake you can make is basing your current assessment on wanting to leave UK for good because your ex is there and that shouldn't be placed as a limitation for the knowledge you carry.  \n\nSure if you can find a better place for your work outside of the UK go for it, but if there's already a suitable offer waiting for you in the UK, I would say go for it there for however long you can to build up your knowledge outside of school so that in the future you can move up in the world.  \n\nAgain many grats to you, and it was def correct to finish your project vs attending his grandmother's funeral regardless of the timing of this.  Your education should always be a priority over anything that doesn't directly affect your life.  If I was your SO I would be extremely proud of you and would ask you to come visit the grandmother's site to relay the message to her in Heaven of how extremely proud he is to have met you, but alas this is something your ex can't do which is unfortunate.",
            "What a colossal jagoff.  Good for you for getting out.  ",
            "That's ridiculous, my grandma just died and my girlfriend came, I wouldn't care if she didn't though ",
            "Not to be an asshole but grandparents die, was he raised by his grandparents and not his mother and father?\n\nIt is something that an adult has to come to grips with.  I would be hart broken if my mother dies but  after two months  life goes on.  you lose family and friends the longer you are on this planet.  \n",
            "Sounds like you were dating a crazy person. You are lucky he acted like this now, instead of later on when you may have been more involved emotionally or financially. \n\nSorry to hear the death made him fall apart on you, he will eventually realize he messed up. ",
            "It sounds like he expects you to be there for him and feels that he gets to call the shots on when you should be.\n\nThat is controlling, possessive, and emotionally abusive behavior, and I'm happy that you're breaking up with him!",
            "[deleted]",
            "I'm gonna get some serious downvotes here, but I don't think attending his grandmother's funeral would have caused you to achieve any less than you did. Yes, he treated you like shit, yes he blew the fuck up, yes he was really disrespectful. But I don't think his ultimate point was wrong. ",
            "You should have just emailed him thanking him for his love and support.  I mean....If you wanted the relationship to work.  If he is still grieving and you missing the funeral was an issue, emailing him about your high marks and achievements wasn't the best idea...it pretty much guaranteed to brick any reconciliation.\n\nHe should have been understanding enough to not take it out on you like he has, but death makes people behave badly.  Everytime I have experienced a loss, it always brings out the worst and the best of people.  It sounds like he was at his worst, as a partner you might have tried to be at your best.  It's a really rough thing to deal with.  People act irrationally when those they love die.\n\nYour ex only threw your good grades back in your face, because you threw them in his.  This relationship sounds like it's over, but maybe for the next one, you might be a little less selfish, a little more empathetic.  You're not wrong for being proud of your achievements, and wanting to share them with the people you love.  But, you need to understand when it's appropriate to do that.  I know others will disagree, but this is reality it's human nature.  You want a relationship with another human you have to give and receive.",
            "My mother passed away nearly 2 years afo and it was very hard on me to get over it. I am still dealing with the repercussions today. For the first couple of months I just worked and ate. I was completely numb.",
            "Everyone's saying you made the right call but I dunno, I think you're being too rash. Grief can change a person, especially someone who meant so much to your boyfriend. \n\nI'll probably get downvoted to hell but I think you should give more of a chance to your five year good relationship. They're just so damn rare. I don't excuse his behaviour but he has a very good, non-permanent reason.",
            "Don't be so hasty. I bet he is just lashing out again and feels like you are rubbing it in his face you were justified for not going to his grandmothers' funeral by writing that long email.\n\nI might be in the minority here, but I think you might be moving too quick. See how the next month goes, let emotions settle more, and then make a decision. You've both had some huge happenings in your life and need time to process.\n\nGood luck.",
            "Kicked out if Britain leaves the EU? Lol",
            "Congrats, OP!\n\nIf your home is Boston, ping me and I'll buy you a drink, haha.",
            "I know the post has probably passed its height and you may not read this random person drifting in to you post but\n\n\nIf you do read this I hope you do get some time apart but I dont think ending the relationship now and forever is the best option. \nLoneliness is the worst feeling and when this is all over and you two can think clearly I hope you don't hold on to this bitterness.\n\n\nIf he does call you and apologizes please take it for what its worth and give him another chance. Maybe then he would have learned his lessons.\n\n\nThese things won't matter if you get through this and end up happy.",
            "First if you can't skip one day of work it means that you are badly organized at doing your work.\nSame thing if your work isn't finished a week before the deadline (for a multi-year project ...).\n\nI am PhD student and I have this excuse a lot from grad and undergrads I TA all the time. \"I was too busy\" when I clearly know they are not, none of them is half as busy as I am (I can still remember as I took excess courswork during my undergrad while working a part time job) and I am not half as busy as my supervisor. Each time I get the \"too busy\" excuse I never let it slide, it literally translates to \"I suck at managing my time\".\n\nThat said it doesn't change the fact that after you poorly managed your time, you end up not having time to spare in the last few days when the work should have been long done already. So at the point of the funeral I believe you when you say you couldn't spare time on something else than your study.\nBut sooner you could have handled things in a more organised way to be sure you could have been available at that time.\n\nYou say all this yourself there: \n\n\"Over those few weeks after she passed away, I tried to spend a lot of time with him. I took him to the archdiocese and we lit candles and walked through the gardens and talked about his grandmother. His friends came up for a visit that weekend and I spent the weekend with them to keep him happy, even though I should have been working on finishing my research project\"\n\nI realise it's easy to say that to someone after it happened \"you could have done things differently\" etc. But it's still kind of true and that makes his point of view more understandable. Although to me he is being kind of a jerk, I'd never be mad at someone for not attending a funeral, even if it was my sister not attending my parents funeral...\nNo matter if you could or could not have taken time to go, it's a shitty reason for being mad at you, especially after you already spent all that time with him before ! You deserve someone who can realise all the attention you give them so good luck to you in the future :) And as suggested below, go to Canada !",
            "You're partner had a really hard on for this granny. Ditch that creep",
            "Might not be the popular opinion, but he still needs you.  I am coming at this having been in his shoes.  He is going through a mental health crisis.  The first step for him is isolation.  He is trying to push you away first because you are closest.  Once you are gone, he is going to begin pushing others away until he is fully isolated.  Next there will be a major event, whether it be, drugs, alcohol, suicide, or some other traumatic event predicated on a lack of feeling or judgement.\n\nI know it's hard, but you have been with this guy for a while.  At some point you definitely need to start thinking about yourself, but I'm not sure you've done everything you can yet to salvage this or help him.  You need to help lead him to a change.  His blow ups at you are a red herring, they are actually some sort of internal struggle that he isn't yet recognizing.  Something that is difficult for him to process, so he shifts over to something else, something that in his head makes sense, but to the outside observer seems ridiculous.  This is easier, because he doesn't have to process the emotions of whatever it is that is eating him up.\n\nI know it is hard, but try not to take his attacks personal.  If and when he comes up out of the fog, and if you do the right thing by supporting him, he will recognize the idiocy of what he is saying and will apologize.  If you succeed, your relationship will be much stronger after this.  This is the shit that makes couples, makes them life partners.  What sucks about relationships, is that this isn't even the hardest thing you will ever have to deal with.  This is why they say that relationships are hard work - sometimes only one partner is doing the work, but it is still hard. \n\nYou need to work on opening up the communication first.  Then he needs to talk to someone (probably multiple people), you may need to hand-hold him there - maybe even literally.\n\nPM me if you want to chat more in depth about my experiences or if any of this resonated and you want more detail.  Whatever you do, I wish you good luck, both with any future relationships, and with this major exciting point in your career!",
            "You just don't want to work through his grief and are letting him down when he's at his lowest point. You really wanted to fight for it huh!  Im not surprised by his reaction when you told him about your grades that you skipped his most dearest relatives funeral for. Way to kick him when he's down so now he loses the two most important people to him. Circumstances or not you abandoned him at his most vulnerable point with the funeral and now you are doing it again. Frankly I'd never be able to forgive you for missing the funeral if I were him. "
        ]
    }
]