[
    {
        "post_id": "43rop7",
        "author": "smell_my_vagina",
        "title": "I [M36] don't want to set up my wife's friend [F31] with any of my friends.",
        "url": "https://www.reddit.com/r/relationships/comments/43rop7/i_m36_dont_want_to_set_up_my_wifes_friend_f31/",
        "score": 2045,
        "num_comments": 117,
        "created_utc": 1454374211.0,
        "selftext": "My wife, Jill, has a friend I'll call Chrissy. Chrissy is on the prowl for a boyfriend. Chrissy asks Jill if I've got any eligible friends, which I do. \n\nI don't want to set my friends up with Chrissy. I'm not crazy about Chrissy. I've got nothing against her, but she's not someone I'd consider a good match for any of my friends.\n\nShe's the type to swipe through Tinder and make nasty comments about what ugly losers the guys are despite being, uh, not a beauty queen or great success herself. She's loud and brash. She hasn't got much going for her, as far as I can tell. She talks a lot about reality TV, but I've never heard of anything like a hobby or a social life outside of happy hour and internet dating. \n\nI don't judge my wife's friendship with her - some of my friends are jackasses too, whatever. Maybe Chrissy's a fun drinking buddy. But I just don't consider Chrissy a catch and don't want to be responsible for setting her up with my friends. I picture a hypothetical single me being set up on a date with Chrissy, and later telling my matchmaking friend not to do me any more favors.\n\nMy wife, Jill, has brought this up once or twice. The problem is that Chrissy keeps asking Jill about it, and has mentioned it to me once or twice. Chrissy clearly isn't letting this go.\n\nHow do I tell my wife that I rate her friend two thumbs down and get rid of her without being nasty? \n\n**tl;dr**: My wife's friend is an unattractive person inside and out and I need a nice way of telling my wife that I don't want to set her up with my friends.\n\nEDIT: That was fast! Problem solved. Jill saw me OP'ing on /r/relationships, assumed it was about *us,* and asked if there was something I needed to talk about, so I pretty much just spilled it thusly: \"I don't like your friend and I don't want to introduce her to my friends but I didn't want to be a dick about it so I asked reddit what do do.\"\n\nJill laughed and rolled her eyes knowingly - apparently she's not blind to Chrissy's foibles - and said she'd take care of it.",
        "permalink": "/r/relationships/comments/43rop7/i_m36_dont_want_to_set_up_my_wifes_friend_f31/",
        "comments": [
            "The edit is perfect, haha. Glad everything worked out.",
            "> How do I tell my wife that I rate her friend two thumbs down and get rid of her without being nasty?\n\n*\"Tell her that I don't think any of my friends are her type.\"*",
            "[deleted]",
            "Try:\n\n\"Sorry, Jill, but I don't think any of my friends are Chrissy's type. I wouldn't feel comfortable setting them up.\"\n\nIf that doesn't work...\n\n\"Hey Jill, please stop telling Chrissy that I can set her up with one of my friends. I know you're trying to be a nice friend, but it's really putting me in a bind. I would have liked to be asked first, and besides that I don't think she'd be a good match with any of them. Please stop offering on my behalf as it's really making me feel awkward.\"",
            "Don't you have any uncouth, gross, or annoying friends? It seems most friend groups have that one guy. Set one of those up with Chrissy and maybe she won't ask again. ",
            "Fuck it, I'll go out with Chrissy ",
            "What are the chances Chrissy reads Reddit too?",
            "I think you need to explain your user name to your wife more than you need to explain this friend situation. I would be asking quite a few questions I was her.",
            "You have struck gold with your wife.",
            "Maybe not friends, but got any enemies..?",
            "LOVE the edit, and Jill is a keeper :)",
            "Tell your wife what you wrote here, she'll think of something to tell this lady",
            "Glad it all worked out, OP. Don't be nervous to spill the beans to your wife! It's actually a really good chance for you guys to get closer. Sometimes you gotta put something risky out there \"I don't know how you're going to respond to this, but I gotta tell you something. *Here is the something*\" \n\nLearned this from the Scream Free Marriage seminar. Best thing my wife and I ever did for our relationship. It really opened my eyes",
            "I have a friend like Chrissy. My Chrissy *really* likes one of my guy friends. They've met, I'm not hiding him from her, he's an adult and can date whoever he wants. But My Chrissy is kind of a mess. She always has some drama going on in her life, she drinks too much, shes in and out of relationships faster than I can keep track. One day he's OMGTHEBESTEVAR!!!11 the next she's dropping a thousand dollars to bail him out of jail on a DUI charge and he flees the state. She's exhausting to be around and I am not going to make any effort to facilitate a relationship between her and my male friend. ",
            "Your wife wins best answer of the day.",
            "Introduce Chrissy to your worst enemy.",
            "How did you even make it this far in your relationship if you can't even talk about something so simple? This sub has become fucking ridiculous.",
            "I enjoyed your usage of foibles. Need to incorporate that word more often I think ",
            "Haha, well that's a good way of getting it figured out then; also funny choice of throwaway username.",
            "That post was a whirlwind from beginning to end, well written and a pleasure to read. Not often you see a /r/relationships post that wraps up so nicely",
            "Edit was amazing! hahaha \n\nGoing forward, however, [if she continues to ask you personally] just tell her that you don't think any of your friends that are single would be a good match for her and leave it at that.\n\nEDIT: also just noticed your username OP. hilarious! hahah",
            "Setting up a friend with someone like that is a great way to lose a friend.",
            "I love your wife's reaction to this! You got yourself a good woman, OP!",
            "Your wife didn't ask you because she expects you to do it. She asked you so she can tell Chrissy she asked you so Chrissy will stop bugging her about it. So now everyone has plausible deniability! ",
            "Perhaps you have a friend of a friend who's also kind of a jerk and could be a decent match.",
            "I don't get how some people have working relationships with questions like these. ",
            "I wouldnt want to be set up with any of my friends friends - what if it goes terribly?! They'd feel awkward and caught in the middle. NOPE, not your problem!",
            "HAHAHAHAHAHAHAHA!!!!!!!!!!!!!!!!!!!!!!!!!!",
            "Am I the only one that feels a little bad for Chrissy? Annoying, bad-TV-watching, and unattractive people are people, too. Why not just *reluctantly* mention Chrissy to a friend, be indifferent about it, and let him be a man and make a judgment for himself?",
            "Nice username",
            "Now the more difficult question of explaining your username",
            "Well the other option you have is to have a get together like a bbq or party of some sort and invite your mates around. This will give Chrissy an opportunity and if your mates don't like her than you can say you've tried. Wife and Chrissy will move on.",
            "Oh my hell I love the edit! That made my day!",
            "Upvote for your wife!",
            "Better nuke that reddit account.",
            "It's almost as if communicating about a problem is helpful or something...",
            "it does kind of hurt that none of my friends want to set me up with their girl friends but I took the hint and didn't ask more than once about it. I don't have the cool kind of hobbies and don't look as good just like the problem with chrissy here. Poor Chrissy keeps asking about it and not getting the hint I guess.",
            "Dude just be careful about your wife knowing your username and that you post on /r/relationships",
            "Edit made me laugh out loud!! Now I'm just curious as to how your wife will proceed... further edits with the story please! ",
            "So it took about 10% of the time it took to write this up to tell your wife \"I don't want to.\" ",
            "Like I have to go on the interwebs to find and get feedback about weird interpersonal issues but you know if I ever lost my internet connection holy crap the communication between my wife and I would totally die",
            "Aw, it's good to see a happy ending on here for once!",
            "[deleted]",
            "r/quityourbullshit",
            "I am the GUY version of this girl... I know it... All I have to say is that I HAVE to ask. I'm\nSorry if I suck. "
        ]
    },
    {
        "post_id": "3dvp1n",
        "author": "thevision3142",
        "title": "[Update] My [25M] girlfriend [24F] is pregnant by accident. She wants to keep it; I don't. However, she told me she would terminate if I really thought it was best. I'm leaning towards yes, but I don't know if that is right.",
        "url": "https://www.reddit.com/r/relationships/comments/3dvp1n/update_my_25m_girlfriend_24f_is_pregnant_by/",
        "score": 2040,
        "num_comments": 436,
        "created_utc": 1437345510.0,
        "selftext": "https://www.reddit.com/r/relationships/comments/3cmh94/my_25m_girlfriend_24f_is_pregnant_by_accident_she/\n\n**tl;dr:** Girlfriend and I had an unplanned pregnancy. Even though she used to not want children, she wants to keep this baby. However, she left the choice of whether or not she keeps it up to me. I’m struggling. I think termination is best, but I don’t think I can make this decision for both of us.\n\n---\n\nI felt much better after my OP, since, like you guys said, I was giving her input and not making her decision for her, so I sat my girlfriend down and told her that I didn't think we should have a child right now. I gave her my reasons why, but I, of course, reminded her that this was ultimately her decision and she had to be the one to make it. I also told my girlfriend that regardless of what she chose, I would support her.\n\nShe took a few days to think the situation over, but she eventually decided that she wanted to keep the baby. After reading up on the termination procedures, she just didn't think she could go through with it, and I completely understand. I made sure that she knew I still loved her and wasn't angry with her. \n\nI can't say that I'm thrilled with the situation, but I accept the consequences of my actions.  It's not her fault, and it's not the child's fault. I'm just going to focus on being the best father and partner that I can be. \n\nThanks everyone.\n   \n**tl;dr**: She decided to keep the baby. I'm staying with my gf and focused on being the best partner and father I can be. ",
        "permalink": "/r/relationships/comments/3dvp1n/update_my_25m_girlfriend_24f_is_pregnant_by/",
        "comments": [
            "Stand up guy. I respect the hell out of you.",
            "Woah. That's eerily familiar. Mine has a bit of a twist, however. Our romantic relationship didn't survive, so it turned into a \"we're a team, and we'll do this together\" friendship. It turns out baby girl isn't mine, so I don't get to be a dad. Its a bittersweet feeling.",
            "I married my girlfriend that got pregnant. Please do not marry her for that reason alone. Worst mistake of my life. There was a few good years but way way more bad years. I love my son more than anyone on earth and now I fight a daily battle just to see him and I get to watch her make him miserable like she made me. Sorry to be a downer and I hope to god your situation works out better than mine did",
            "Shave five years off of your age and I was in the exact same boat man.\n\nThat sinking ship feeling.\n\nI'm not going to sugar coat a damn thing and tell you it's easy because it's brutal as fuck. And your love for someone has never been tested as much as when your both arguing over the temperature of formula and waking up at 2am to handle what I'm almost certain Israel is afraid Iran is refining(highbrow poop jokes, yup)\n\nBut I will tell you this. It does get easier as time goes on. My son is 7 now and it boggles my mind that I can sit there and have a conversation with him.\n\nLet me give you this advice and take it how you may. Fall in love again with the small things about your kids mother and let the small shit roll off of you. My sons mother and I didn't make it for various reasons but sometimes I look back and remember her sleeping with him, the way her hair fell there and it's a very different appreciation and respect for beauty in its absolute.\n\nBest of luck man. I'm sure you'll be fine.\n\nPS: Go stock up on those Gerber rice puff star treats. Kids love em, babies love em once they can handle it and I easily ate a king ransom worth of them while raising my son.",
            "Mother of a not-so-happy little accident here, 9 years of age already. We were super reluctant at first, now we wouldn't change a thing. All the best, you sound like a great father to be!",
            "[removed]",
            "[removed]",
            "Way to step up OP, ton of respect for you. Good luck to you and your girlfriend",
            "The other day my girlfriend decided she wanted to get a cat. I didn't want to get a cat. So we compromised and we got a cat.",
            "Bravo.",
            "Uber respect for your handling of this situation. May I suggest counseling for the both of you? There will be lots of changes in store for your guys. Also, you may want to consider some sort of financial planning. A life insurance policy on both you and your gf in case something happens to either one of you, the remaining parent will have financial help raising the child.",
            "Sounds like you have a really good head on your shoulders. Keep that. Best wishes to you, girlfriend, and baby.",
            "Have you guys talked about adoption? I can understand her not wanting to terminate the pregnancy, but if you guys aren't in a good position to be parents, adoption is a good route to place the baby with a good family. \n\nYou can even do open adoptions nowadays were the birth parents get updates on the baby, and some level of interaction (some adoptive parents/ bio parents will have a \"cousin\" type role for the bio parents. \n\nSomething to consider if you or the gf are still considering what to do. ",
            "Good luck to you guys and nice work being a good person. When I got pregnant by surprise I was so completely freaked out, I knew my now husband didn't want more kids and I loved him and didn't want to ruin his life. I also knew I couldn't bring myself to terminate. One of the most stressful times of my life. He was like you and supportive, she is an incredible almost four year old now and I'm pregnant with our third. (The second two planned) ",
            "gg",
            "Best of luck!",
            "Well, since you're keeping it:\nDon't buy clothes new. Get them secondhand. That is easily one of the biggest expenses and babies grow so damn fast.\n\nGood luck! I'm sure parenthood is tough, but if it were impossible, none of us would exist! Give it all you've got. (:",
            "Hey, I just want to let you know that I have a lot of respect for the way that you have handled this. You were honest with her about your wishes, but you've also accepted her decision and acknowledge your part in this, while also focusing on the right things. That's a pretty big step towards being a good father and partner right there, in my opinion. \n\nI wish you all the best. I'm not a guy myself but I'd suggest checking out /r/daddit and /r/predaddit, I've seen guys mention those subs occasionally. Good luck to you and your partner! ",
            "Although we never really considered abortion as an option, I was where you are 12 years ago and I know a little about what you're going through. I think about it every time I look at her and I'm so glad we decided to \"tough it out\" because she's totally awesome. \n\nYou'll figure it out. Good luck! ",
            "If you're not ready, just remember it's a lifetime mistake.",
            "Mother of two mistimed/unplanned \"oops\" babies. I was 24 when my first (completely 100% unplanned, total surprise with a scumbag biodad) was born, he is now 3.5 and the absolute joy and light of my life. \n\nI won't lie, the adjustment period was hard. I went from being a college student living my normal life, to a mom overnight. It was a jarring transition; none of my friends had kids and I had to look at Facebook pictures of being out and having fun, and I was at home after leaving an abusive relationship with an uncertain future. I cried a lot. \n\n\nBut despite my own personal struggles, I loved that baby and fought like hell for him. I learned to be a parent, and my priorities and identity organically shifted with time. I had a lot of support of friends and family who believed in me--which will be critical for you, too. \n\nPregnancy hormones will be a bitch, and you guys may have some ups and downs. My only advice is to just try to be as understanding as possible and take one for the team. Her sex drive may skyrocket and/or plummet; let go of your expectations for a while. \n\nIf the day comes that you decide you don't want to be together anymore, be absolutely sure you have your separation mediated by a third party--which means you should absolutely get a lawyer, even if the breakup is amicable. \n\nBest of luck. Head on over to /r/parenting, /r/daddit, and /r/predaddit to vent, brag, and get advice. Welcome!",
            "Adoption as an Option.",
            "Not to be a debbie downer or anything, but as much as you love and trust your girlfriend, I would get a paternity test on the kid if possible. You just never know.\n\nThink about it, she changes her mind about keeping the baby without your knowledge, and then all of a sudden your birth control fails? It's possible, but it seems a little too coincidental.\n\nJust my two cents.",
            "OP - I know exactly how you're feeling - the same thing happened to me.  Accidental pregnancy, partner couldn't go through with a termination, and so on.\n\nMy son is now a year old, and I can tell you, I've never been happier.\n\nI never wanted kids.  I didn't want the baby, right up until he was born and I held him for the first time.  The whole pregnancy, I was dreading it.  The second I held the little bugger, everything changed.\n\nHats off, OP.  You'll do just fine.  \nIf in doubt, give me a shout dude.  As I say - I've been there!",
            "SO and I have an oops baby that's 16 months old now. Wouldn't change it for anything. You're handling this with grace and maturity, so I know you'll be an awesome dad!",
            "When I was your age, I had a similar quandary. I tried to talk her into terminating the pregnancy. She refused, and I split with her before my son was born (not due to the pregnancy). Twenty three years later, I can't imagine a world that does not have my son in it. \n\nThere were tons of tough, shitty, exasperating times, but just as many happy and unforgettable good times. \nBe there, and be involved in your child's life, regardless of how things go with the mother. I promise you it will be worth the effort.",
            "Good luck, I guess.\n\nFor me, this is one of those \"Oh my God, I’m so glad I’m not that guy!\" posts.\n\nI just don’t get how some guys are able to stay in a relationship without an untenable amount of resentment when they get saddled with an unwanted child.",
            "OP, how's the finances looking for this?",
            "You're more of a man than most to stick by her when you didn't even want any of this. You will be a good father, whether you think so or not. It takes a bit of learning and you'll have things to give up, but the good thing about having a kid, is when they're a bit older, you can do all the fun things with them. Teach them to fish, teach them to swim, go play for a day and do mini golf and go karts.. This isn't the end of your fun life as you know it, just a different chapter. ",
            "Good for you. In time you may come to really enjoy fatherhood, you never quite know until it happens. Good luck, OP!",
            "You already have my dad beat. Props!",
            "Good fucking luck",
            "I had a similar situation about five years ago. I did not think - in fact I was sure I would not - I would enjoy being a father. I, too, was 25.\nBoy was I wrong.\nI love being a Dad. And maybe I just lucked out with my kid but, honestly...it's not really that hard. When you're young you can deal with sleep deprivation, diapers ain't that difficult, feeding is actually nice because it can be quiet bonding time, and tantrums are tantrums. They come and go. Frankly, my relationship with my SO is more difficult and demanding than that with my child, and not because of parenthood.\nI know you haven't asked for advice but here is some: start saving money, make time for yourself (and for her, and for the two of you together), incorporate extended family into the picture as often and as early as possible, and above all be on the lookout for post partum depression in your SO because that illness is no joke.\nIf you need advice or commiseration or whatever from a guy who has pretty much been through exactly what you're about to go through, please don't hesitate to reach out. Hell, if we're in the same area I can probably give you a bunch of used baby stuff.\n",
            "This seems a little sketchy. \"After reading up on abortion procedures...\" you say. Which ones specifically? The vast majority of abortions are performed with the administration of a single pill and the patient goes home.  \n\nI think this is a pretty well thought out anti-abortion submission. you can tell, because generally pro-lifers don't really know shit about abortion.",
            "My \"unexpected baby\" just graduated from high school, and his sister (also unexpected!) will graduate next year. Their father and I are no longer together but we have remained excellent friends and co-parents. I don't regret my decision to keep those kids at all. Good on you, you're going to be a great dad. Congratulations!!!!!",
            "My girlfriend got pregnant last year after we dated for two months. We just had the baby. Please pm me if you need to talk, I understand your situation all too well. ",
            "Oh boy. I guess you are in for the long haul. Kiss life as you know it goodbye. That being said nothing can replace the love you give/get from your child. Enjoy. ",
            "You're about a billion times better than the guy who knocked me up. I know you aren't thrilled, but I think you will start to be when she's further along and you can see it moving in her belly. Congratulations. ",
            "Remember if at some point you regret this decision, most parents do. Go get some sleep when this happens. ",
            "You're such a responsible man . Best of luck for ur family !!",
            "Get a paternity test and then be the best dad you can be to your kid.",
            "You're awesome! Just wanted to tell you that you are the dream boyfriend of every girl who's had a pregnancy scare before.\n\n I hope it works out for both of you.",
            "I don't mean to go all /r/conspiracy on everyone, but there's a really suspicious number of \"have you considered adoption?\" comments.\n\nLook, abortions can be difficult, but pregnancy and childbirth are *really* difficult. I'm the father of 2 kids that I love more than anything in the world, and my wife and I terminated one that we knew we weren't in a good place in our lives for at the time. It was the best decision we could have made. It allowed us to get to a place where we were able to be the best parents we could be for the kids that we do have. \n\nRaising kids is *really* fucking difficult, even if there's no doubt in your mind that you want them. Don't make it harder on yourselves. ",
            "[deleted]  \n ^^^^^^^^^^^^^^^^0.5505555892281464 \n > This comment has been overwritten by [this open source script](https://greasyfork.org/en/scripts/10380-reddit-overwrite) to protect this user&apos;s privacy.  The purpose of this script is to help protect users from doxing, stalking, and harassment. It also helps prevent mods from profiling and censoring.  \n\n  > If you would like to protect yourself, add the Chrome extension [TamperMonkey](https://chrome.google.com/webstore/detail/tampermonkey/dhdgffkkebhmkfjojejmpbldmpobfkfo), or the Firefox extension [GreaseMonkey](https://addons.mozilla.org/en-us/firefox/addon/greasemonkey/) and click Install This Script on [the script](https://greasyfork.org/en/scripts/10380-reddit-overwrite) page.  Then to delete your comments, simply click on your username on Reddit, go to the comments tab, scroll down as far as possible (hint: use [RES](http://www.redditenhancementsuite.com/)), and hit the new OVERWRITE button at the top.",
            "Good for you both on not only getting to experience the joys of being parents, but also on the ability to communicate and handle it all the way adults should. In today's society you see so much more of the opposite, where one parent chooses an alternative route and runs the other way so I definitely respect you for your decision, although the outcome wasn't exactly what you had hoped for. ",
            "[removed]",
            "You are awesome. You handled this very well. Been in your shoes before, and so glad we went through with it. Good luck and all the best to you.",
            "Really impressed by how mature you have been in a difficult situation. Best of luck! ",
            "Good luck to you, good sir. I think you handled the situation with a lot of dignity and respect. \n\nIf I might make a suggestion, I would definitely talking over plans with your SO. By choosing to have the baby, your girlfriend's life (as well as yours) will change forever. One of the first changes will be taking vitamins and diet, though your girlfriend will go through a lot of bodily changes as well. Make sure that she knows and understands that pregnancy can also be dangerous if complications arise, and the costs that will be incurred if anything goes amiss. Insurance is a must, especially considering that you and your SO will likely be seeing your doctor many times over the next few months for ultrasounds and checkups.\n\nWith my mother's first pregnancy with me, everything went 'normal' until she went into labor a few weeks before her due date. After three days of pushing in the hospital, with no luck, I (the baby) tested positive for meconium aspiration and fetal distress. She had to get an emergency c-section, and it was very dangerous for both she and I. We were both hospitalized for days after the birth as well due to the complications. The hospital bills were also very expensive, and my parents, who were both going to college at the time, ended up having to pay the debt off over the next several years. My youngest aunt also had a very difficult pregnancy and severe morning sickness for most of her first.\n\nYou will also have to figure out how to care for the baby once he/she is born, how to pay for diapers and clothes and other baby supplies, and figure out day care. As a piece of advice, my mother and grandmother both used reusable diapers that my grandmother sewed from cloth. Using reusable diapers can also save a *lot* of money, as opposed to buying disposable diapers all the time, and are much better for the environment.\n\nPersonally, I'm child-free and would get an abortion if in your SO's place, but I respect your SO's decision to keep the baby. However, I do have some experience, as my aunts have had a *lot* of babies (my cousins) in the past. As the eldest cousin by 4+ years, I was expected to help care for them.",
            "The younger you are, the healthier that baby is likely to be.\n\nThe younger you are, the harder it is to afford a child.\n\nThe thing is, it's a lot better to struggle with squat at a young age.  Doing kids when you're older means you can afford to buy them more things, but can't keep up the energy to play with the kids.  Most kids don't need things, they need time with their parents.  If I had gotten that through my skull twenty years earlier, I wouldn't need a chiropractor and steroids to fix my back from picking up my kids all day.\n\nOne suggestion, figure out day care asap.  It's could very easily be your biggest expense for the next 5 years.  I'm excited that two months from now, my day care bill will finally be less than my mortgage.",
            "When my girlfriend at the time got pregnant my world was turned upside down. I was also 17 and she was a lying scumbag who said she was on the pill... but that's another story. \n\n\nYou're not alone, despite the feeling of impending doom. You're doing the right thing, and I commend you for that. Many guys would run - and they do. How? I don't know. I don't know how id live with myself knowing that I have a child out there and I'm not caring for them. I love my daughter (6). Is she stressful? Yeah, kids are, even the good ones, which she is. But you'll fall in love with them. Just be a loving and caring father.\n\n\nAlso, just because you have a child doesn't mean that you NEED to get married. Those are two totally different aspects of life. You should only marry her if you're ready and she's the one.",
            "[deleted]",
            "I didn't see anyone give you this advice so let me fill you in on this. \n\nFrom personal experience you are going to find out who you both really are. Having a kid really sheds some light on who YOU are personally. It will bring out the best AND the worst in both of you. You both may fall in love with each other more. You may fall out of love with each other. Can go either way. Just remember this one important thing though my man. You do not have to be with your girlfriend to still be a great father to your child. Do not beat yourself up daily wondering about your past decisions and how much you may or may not have fucked up. Just remember that no matter what be there for your child and the best father that only you can be for your child.\n\nI have been in this exact situation right at the exact same age as you right now. I KNOW personally what you are going through. If it was anything like my situation it makes sense why you guys are even having that conversation. I feel for brother. I really do. It is the toughest and yet most rewarding thing in life. \n\nEither way best of luck to you. You will need it. Get your sleep now, and cherish it for the beautiful thing that it is. Once that baby comes sleep goes bye bye for awhile.",
            "Worthwhile decision. You wont regret this. Kids end up being a lot easier, and a lot more fun than people would scare you into thinking",
            "My friend, I was in exactly the same boat! I totally didn't think I wanted a child, but when my Son was born it hit my like a train. I adore everything about him and the thought of not having him in my life makes me want to cry.\n\nI hope you are as surprised as I was at how much you love being a Dad!",
            "What a shitty situation",
            "Good luck man! I had my son at 21 (unplanned as well), and while it has been anything but easy, it is the most rewarding and amazing things that has ever happened to me. Enjoy being a father, and don't let moments pass by, they're only so little for so long.",
            "GF wanted a baby, I didn't. So we had a baby. \n\nLived a charmed life of doing whatever we wanted. Now our world revolves around the baby's schedule. Would I change a thing, hell no. I love that little shit and you will too. ",
            ">After reading up on the termination procedures, she just didn't think she could go through with it,\n\nthis is some bullshit reason to keep the child.  abortion is like 20 unpleasant minutes, child is forever. that bird is lucky she has you",
            "My deepest respect for you! I don't know what I would have done in your situation. ",
            "I didn't want any kids, then had one with my now ex-wife because she changed her mind.\n\nOnce he came out, I wanted to punch old me in the dick.  Its awesome, you won't regret it.  By the way it doesn't make you like kids, just your kid, its weird.\n\nAlso, babies are boring as fuck for the first year and a bit.  Then they get fun.",
            "A similar situation happened to me when I was much younger. We choose termination, but now I know things would have been alright and maybe even better if we had kept it. You will be just fine. Enjoy that child.",
            "Man. I went through this too. Except i wasn't give the choice to keep or abort the baby. It was more of a \"I'm keeping it, you can stay or you can go.\"\n\nI stayed - and while I lost a lot of my freedom but it was the best decision I've ever made. My little girl adores me and it's such a good feeling. plus she looks exactly like me so I don't need to question the paternity although admittedly I've had anxiety about it. ",
            "I don't get all the comments of praise.\n\nWhat kid wants to be born to a father who doesn't want him?\n\nToo much of a pushover to simply say \"No, I don't want a child\", resulting in years and years of having a child you don't want. You can claim it won't matter, but it will. You don't want a kid? You shouldn't have one. End of story. doesn't matter how many people come along and say \"I thought so too, but now I love them!\". The ones who thought so too *and still didn't want that kid after they had it* aren't going to come along and tell you so.\n\n",
            "Congratulations to both of you.\n\nI was in a similar situation 7 months ago. I discussed it with my fiance and ultimately we decided together that a termination was right for us. We're planning on trying for a kid come this fall. At least I know I'm fertile! :D",
            "This happened to my (now) fiancé and I, our girl was a complete surprise, and I was the one who wanted to terminate initially. But after sitting down with him and talking about it at length, we came to the decision to parent, knowing that we may struggle or break up, but always commit to co-parenting the best we can. It's been 1 year since she's been born and I can honestly say, it's been the most difficult, most wonderful thing in the entire world, and I wouldn't change a thing. Good luck daddio, and feel free to PM me if you want advice/to chat!",
            "I admire the way you take the consequences of your actions. \nIt seems you will be a good father. Hope the best for you and your upcoming family",
            "Have either of you considered adoption as an alternative?",
            "The road ahead will be long and difficult but you are absolutely doing the right thing.  I wish there were more people like you.",
            "Dude I was in the same boat you were in a year ago. Except, neither of us really believe in abortion so I leaned towards adoption more and she wanted to keep it.\n\nI reacted the same way you did, but I don't regret a single moment of it. In fact, we're getting married next month and if it wasn't for finances (people like to think payday when it comes to weddings apparently) we couldn't be happier. My 6 month old is the best little boy you could ask for and loves life.\n\nIt may seem tough but get involved in WIC and food stamps if money is tight (if you're in the U.S.) and don't forget about the baby showers. And if either of you smoke, quit that shit. Lol my co-worker almost lost his house and newborn because of that, so it's mandatory I say that.\n\nAnyway best of luck and you're gonna be an awesome dad!",
            "Congrats I just hope you dont eventually hate her because of the choice. Just remember if you stop loving her you cant stop loving that child and be their for he or she whenever you can even if you and the mother over time grow to dislike each other. not saying that will happen but going by your post your not happy and the decision you made which made her happy didnt make you happy and this could be a future issue.. so we will be seeing you on here again in a few years.",
            "Just curious, how long have you been together?\n\nWish you the best of luck, you sound like an awesome guy. ",
            "This happened to my girlfriends family unplanned baby neither wanted and its turning out really well for the two of them ",
            "Don't hate on me for saying this, but... if you both, honestly feel like you don't want a kid, but she is worried about the side effects of termination, there is always the option to put the baby up for adoption. \n\nNot saying you should, just that it is an option. ",
            "Don't worry bro, you got this!",
            "Congrats! You'll do great.",
            "The very best of luck to you.",
            "Notice how all the people telling OP to go through with it are people with oops babies that *can't go back on their decision*.",
            "I'm with the top comment. Good for you. I wish you all happiness and the best in life, and I am sure that she appreciates this.",
            "Props, man.  I can only imagine how you must feel.  I have enormous respect for you for taking responsibility.  Your girlfriend is a lucky woman to have such a dedicated partner.\n\nYou might also try looking into your local crisis pregnancy center(s) if you need help with anything baby-related.  A lot of them have classes, material goods, and other resources to help you and your girlfriend navigate pregnancy and parenthood.  \n\nAnd when you're ready to hear it- congratulations :)  Being a parent is hard, but absolutely incredible.  I wish you the best. :)",
            "I was in the same boat, man. Just recently actually. Our daughter is 3 months old and she is absolutely ADORABLE! \n\nMy story is the same. My girlfriend wanted to keep it, I didn't. I have 18th in student loans and she hasn't finished school yet so it was horrible timing,  then again I don't think you ever have a perfect time.\n\nWe ended up talking and she same to the same conclusion. Honestly I just didn't want to grow up yet. I have a decent job and insurance but I wanted to travel and then buy a house far from my current location.  \n\nThat being said, I wasn't very thrilled until we went to the hospital. Something about going through that process changes you. When you see those baby pictures it doesn't fully click yet (or it didn't for me). But man I'll tell you, the second you lay eyes on that child you will be glad you didn't terminate. I absolutely adore her. It's only been 3 quick months but it's so amazing to watch them grow and learn. Even if it's something as silly as trying to mimic the goofy sounds you make. Sorry for rambling. You will understand soon enough.\n\nJust be prepared. That's the best thing you can do. The baby shower will help immensely so don't sweat it. And keep that baby on a strict schedule. It will help you a ton. Feel free to message me if you want to chat.  I just went through a very similar situation recently so I may be able to provide some insight. ",
            "If you are in hesitation over your child's life you will be in hesitation over your future. ",
            "lol dude you fucked up",
            "your life is over m8",
            "Glad to hear this. You sound like a good guy, she and the baby are lucky to have your support. Much respect. \n\nAnd in regards to children, I had a friend in a similar situation and 5 years later, he would not have had it any different. You may change your mind. ",
            "Getting trapped 101.\n\nYou're fucked, hope you didn't have any big plans for your life.",
            "I was 19M when our little \"accident\" happened - 8 years later and she is my whole world and a beautifil, intelligent girl that I would do anything for. I wish you all the best OP and you handled this like a real man; stand by your family.",
            "You won't regret man, I was in the same situation when I was 20, it just makes you want to work harder for what you have.",
            "I was too young, GF got pregnant, I suggested abortion, she said no.\n\nMy son just turned 3, so happy she didn't abort, turns out I love being a dad.",
            "[deleted]",
            "Luckily most of humanity was conceived \"by accident\". ",
            "Hell ya! You handled that like a pro. Good luck on the fatherhood path.",
            "Went through the same thing at your age. My now 14 year old daughter is the light of my life. Her 13 year old brother is pretty awesome too. ;)\n\nBest of luck to you!",
            "While you might have to put your hobbies on hold for now, there might be an opportunity to share those hobbies with someone down the road. Me. Or your kid, I guess. Whichever is more important. \n\nIn all seriousness though, I wish you and your gal (and your little one) the best.",
            "I have a lot of respect for you sir. This is quite the post.",
            "Sounds like you're going to be a great father. Congratulations man!",
            "Be the best father you can be for this child :)",
            ">I accept the consequences of my actions. It's not her fault, and it's not the child's fault. I'm just going to focus on being the best father and partner that I can be.\n\nTake pride in doing the family thing the old school way.  Reliable birth control has done lots of great things for humanity, but lots of bad things too.  I'm in my 40's now and I have a 7 year old running around.  Everyday I think to myself this would be easier if I were a decade younger.  Being a good husband and a dad is a lot of hard fucking work, and the most rewarding thing you can do in your life in my opinion.  Having a kid will drive you to be even more amazing than you probably already are.",
            "Didn't read the original post but wanted to commend you for your decision not only to accept *her* decision (her body, her choice, a lot of men don't 'get' that), but also to not use her decision as a reason to end the relationship.\n\nI went through something similar when I was on the birth control patch. My significant other had stopped talking to me out of nowhere and a week later I found out I was pregnant with what would be my 3rd child. I sent him a pic of the test, telling him we need to talk, and he begged me to come over and discuss. When I showed up, he was lovey-dovey, wanted to 'work things out' and be together forever, cruises and vacations and a marriage- he wanted everything I wanted.\n\nExcept, he didn't. He wanted me to get an abortion. I sensed that was the real purpose of the meeting and told him I couldn't/wouldn't. He got engaged, disengaged, lost 40 lbs, started a cocktail of anxiety/depression medications, shut off my phone, and spread lies about me. He met our daughter when she was about 3 months old. Then he sued me for custody. \n\nAlmost 3 years later and we're 'together' again. He's lost everything. I love him and I am weak- I don't think he loves me anymore...but he loves his daughter. I just wanted to give him the opportunity to feel unconditional love toward another human. \n\nIt won't be easy but it will be worth it to know you didn't push her to injure her body to appease you and most importantly, when you lay eyes on your daughter/son and realize how powerful such a little life can be. Thank you so much for not destroying it- and for not destroying your girlfriend's faith in you. \n\nThank you for being a man.",
            "Respect man.  Seriously. ",
            "Get ready for the most difficult/wonderful time of your life.\n\nHeads up, the first month is completely awful and there's almost nothing enjoyable about it.\n\nAfter that, babies rule.",
            "Fuckin hell bro. You are the damn MAN! I hope the best for you, your future wife, and your future boy/girl!",
            "Late to the party brother but I went through this exact scenario 4 years ago and it scared the fuck out of me. 4 years later I have a beautiful 3 year old daughter that although still scares the fuck out of me also simplifies my life in a way I can't describe. Enjoy it fella.",
            "I can relate with you in knowing what it feels like to have an  unexpected pregnancy come crashinh into your \"man-child\" lifestyle. In your OP you seemed tuned into the realities that your finances and time will now be limited once fatherhood is upon you. This is good that you already realize this. And while this is true and I wish I could tell you I've invented a way for days to be 36 hours long  so there was time for everything, I can promise you that you won't regret for one second the day your child is born that you are a father. I'm nearly three years into being a father (with a 2nd on the way!), and while there are times you wish you could go back to a \"me\" world, you find quickly how little that matters when you have someone fully dependent on you. You sound like a stand up guy and I have zero doubts your child will be loved. Good luck!",
            "If you're not positive you want a kid, you should abort it. You're going to be miserable.",
            "[deleted]",
            "[removed]",
            "If you don't want a kid it's unlikely gf was going to get a great dual parent upbringing...  Rather it may end up spiteful or infidelity etc.  I would make it clear you want abortion of it. ",
            "I'm just curious if you presented this as parenting the child or abortion being the only options.  Was giving the baby up for adoption ever considered?\n\nI applaud you for stepping up and taking responsibility, but it's going to be difficult for the child if he or she feels unwanted at any point and while I'm sure you would never purposely make the child feel that way, it could come through unintentionally given your feelings (which, of course, may change after birth).",
            "How can you all be happy for OP now that he has to throw away the life he enjoyed just because his girlfriend wants to go back on their agreement? ",
            "I may be late but I wanted to share. I was in the same situation at age 27 as a female. I was majorly pushed to terminate. So I did, thinking that would make him happy. That was by far the worst thing, decision I've ever made in my life. I will always regret it. I killed my little girl for a man. I will always blame him. We are no longer together. This was back in 1997.\n\nI'm so happy to hear you're being supportive. Good luck to you both.",
            ">It's  not her fault\n\nYou sure about that? You both share the blame unless there's some specific situation I'm unaware of. ",
            "file snobbish like airport drunk toy sable mindless fear bow\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
            "[removed]",
            "It takes two to make a baby, but one person gets to decide the fate of three.  Real fair.",
            "[removed]",
            "[deleted]",
            "Listen, the idea of being financially stable to have a kid is fairly nonsense. You will make it work, and you will be glad you did. You're a stand up guy. You're going to make a great father. ",
            "[deleted]",
            "It's not right if she doesn't want to terminate it. You took the risk when you had sex with her. It is your responsibility to be there for her and the child now. ",
            "[deleted]",
            "Viva le next generation",
            "Sorry but she is a ridiculously terrible person for forcing you to be a parent, especially after \"birth control failed\". If she has a moral opposition to abortion then she should put the kid up for adoption, or in an extreme case where she really wants the kid, should absolve you of any financial responsibility.",
            "You mentioned it's not your girlfriends fault or the child's but remember it's not your fault either. ",
            "Keep",
            "Yes",
            "[deleted]",
            "The consequences will never be the same.",
            "[removed]",
            "I'd terminate it as soon as possible. Up until a certain point, I have no problem with anyone ever having an abortion. After the thing is kicking, squirming, sucking fingers etc, it's pretty darn alive st that point. \n\nSadly though, as a guy, you have very little rights in this situation, but if she is willing take to a clinic today before she changed her mind. "
        ]
    },
    {
        "post_id": "5ocx3z",
        "author": "notsomatchofeline",
        "title": "Update: My wife [30 F] has given up alcohol for good and I [31 M] am finding it difficult to deal with.",
        "url": "https://www.reddit.com/r/relationships/comments/5ocx3z/update_my_wife_30_f_has_given_up_alcohol_for_good/",
        "score": 2036,
        "num_comments": 173,
        "created_utc": 1484595487.0,
        "selftext": "Today, I happened to stumble across this throwaway. Furthermore, I noticed that it happened to be the throwaway's cakeday so I think *someone* is prodding me to do an update on this!\n\nI posted a year ago about how my wife had [given up alcohol for good and how I was finding it hard to deal with](https://www.reddit.com/r/relationships/comments/40im59/my_wife_30_f_has_given_up_alcohol_for_good_and_i/).\n\nI'd like to thank everyone that commented on the original thread. I did read everything even if I didn't reply to everyone. There were people who thought (as I expected) that I was selfish, that it shouldn't matter that my wife was making that decision and that I likely had my own hidden drinking problems. There were others, though, that understood and could see my point of view.\n\nThe TL/DR of my original post is that my wife had decided to give up alcohol for good, had told me she thought she was an alcoholic and so was going to quit. She was not an alcoholic in the 'traditional' sense i.e. she didn't get drunk all the time, wouldn't drink in the day but she did have two or three glasses of wine pretty much every evening after work. A lot of people do that. When she told me she was quitting booze for good, it was a complete shock to me and I felt a very real sense of loss. I really felt heartbroken because I felt like there would be things we would 'miss out' on in the future together - sharing cocktails by the pool on holiday, sharing a bottle of nice wine over a romantic candlelit dinner, popping a bottle of champagne on New Year's, toasting to our (currently non existent) children on their wedding days. I felt like that had all been taken away from me. I knew that this was small fry compared to what others went through and what she could be going through but that didn't stop it hurting. Everyone's problems matters to *them* even if an abstract observer can clearly see that one person's problems are much worse than anothers'.\n\nWhen I googled for help and advice on the matter, nothing really came up so I want to keep my original post up and supply an update to let others that might go through the same thing that they're not alone.\n\nAs I mentioned above, some people were adament that my wife's decision to not drink ever again shouldn't affect me in the slightest. Basically, it had nothing to do with me and if I felt like it affected me then I had my own problems. A year on, I can defiantly tell those people that they are wrong. In a marriage, at least in the kind of marriage I believe in, you and your partner's actions and choices are intertwined. The whole point of a marriage is to *share* the rest of your lives together. I had expected and hoped for a long future together, sharing experiences that typically included alcohol. Our society, as a whole, is intertwined with booze. We first met when we were both tipsy at a student bar, pretty much all the social occasions we've ever been to have involved some alcohol - that's just where our society is. Drinking was, in some ways, a 'shared interest'. If you met a partner through rock climbing and you climbed together several times a week, got married, carried on climbing together all the time then suddenly your married partner said \"sorry, I'm never going to climb again\", you would feel hurt. Like something core to your relationship had been taken away.\n\nSo, what have I learnt in the past year? Well for one, your parter giving up booze really doesn't matter. You just adjust. I'd be lying if there were times that I miss us sharing a bottle of wine together but those thoughts are few and far between. It's far more important to me that she's happy and feels much better about herself. She's healthier, has a better outlook on life and when we are out togheter, we actually spend more 'quality' time together. I've never been a big drinker so if we were out, she'd get tipsier way before me so in a way, we weren't on the same conversation level by the end of the night. Now, we can talk 'properly' throughout. There are lots of benefits too, we spend much less on drinks now, of course - especially at home. We do, however, spend more on food. That's something I get more enjoyment from anyway though.\n\nWe've been on holiday, we've been to weddings, we've been out to loads of dinners, we've had Christmas together. It's all been fine. I always knew it would be - other people don't really judge much once you just say 'you don't drink'. As long as you don't make a big deal about it. My wife still doesn't tell people that she's an alcoholic; the story is still \"I gave up for dry January and found myself really liking it and felt better about myself so I gave it up for good\". It's just easier, makes less of an issue of it and draws much less attention. We're probably happier than we were before (although we were plenty happy then too). I love my wife and I love spending time with her.\n\nFor what it's worth, I do still drink. I didn't drink much before she gave up and now I do drink less. I'd share a bottle on nights out before but hardly ever drank at home. I'd say I had, on average, 2-3 units a week. Now I'm more at 0.5-1 units. I.e. Once every two or three weeks I might have a couple of beers. I hardly ever drink when we're out together. Only if I *really* fancy it. When I just 'quite fancy' it, I'd usually choose not to out of solidarity with my wife.\n\nOne change I have noticed is that I judge the shit out of restaurants that have a crappy soft drinks selection or lack of non-alcoholic cocktails. High end restaurants tend to have several great options and will go out of their way to cater to you. Other restaurants do seem to judge you for not getting a bottle of wine, likely because they make a healthy profit off of alchohol. Annoyingly, we're not doing it because we want to be 'cheap', we'd happily pay for an overpriced mocktail that's basically just tonic water with a cucumber in. I do enjoy being 'prepared' for my wife now though - i.e. if we're at a function where they're handing out champagne and nothing else, I will do what I can to get her something else; I'll happily be a bit of an arsehole if a place hasn't thought about providing non alcoholic drinks. There are plenty of people that can't drink for a number of reasons after all - religion, health pregnancy etc. Places really should be prepared.\n\nI've rambled on for a while here, it's a bit disjointed as I wasn't planning on spending loads of my day writing about this! I'll happily answer any questions others may have. What with it being 'Dry January' for a lot of people, this could be something others might be thinking about.\n\nI'd like to thank a few people from the original post for their comments; /u/gravityline and /u/Spectrum2081 for making me realise that it could have been a *lot* worse, she could have opted to go vegan instead which would have been bloody *awful*. u/lofwt and u/ShelfLifeInc for their points of view as non/little drinkers and for giving substitute suggestions. Also u/gooberfaced for saying that our life probably lacked any 'real' problems. That really made me laugh and see the truth in it!! There are many more that commented and helped in my original post but I can't list them all. Oh, also a shout out to r/stopdrinking; I got my wife to sign up to reddit for that sub and she's found it really helpful several times over the past year. :)\n\nTL/DR: My wife decided a year ago that she was quitting alcohol for good as she felt she was an alchoholic. This was a shock for me, I didn't think she was and I felt feelings of loss at the thought of a future where we wouldn't drink occasionally togehter. A year on, everything's been fine, we're happier, she's healthier and still doesn't drink. It hasn't been a big deal. I still feel some feelings of loss but they're so insignificant now and I realise that. Life is great.",
        "permalink": "/r/relationships/comments/5ocx3z/update_my_wife_30_f_has_given_up_alcohol_for_good/",
        "comments": [
            "I remember this original post! Glad to hear it has been working out.\n\nI think I would feel that same sense of \"loss\" if I had been you, even though logically I would also realize it's better for her health and general well-being. It's still a social thing that does bring us together. But luckily for you, your relationship was based on more than that :) Good for you guys.",
            "I am dating a Muslim and thought this NO alcohol thing would be a huge issue. But it's not at all. Funny How you are trained to think a certain way but then in practice, you don't miss it. Happy things worked out for you! (For the record, I still drink)",
            "This is a good update to hear! As a note, based on your post, it sounds like you're British. I lived for a while in the UK and the drinking culture is very different from the US--so I think it's a lot harder for people from the US to understand just how pervasive drinking is in the UK and just how many activities are oriented around drinking, so I understand your initial reaction. Regardless, I'm really glad that you were able to push past it and support your wife. Congratulations!",
            "I'm glad you've adjusted.  Just so you know, if she was drinking 2-3 glasses of wine a night, every night, she did have a problem with alcohol by most standards.  Anything over about 7 drinks per week for women is considered more than \"low-risk\" drinking according to the National Institute on Alcohol and Alcoholism.  Some people find that they can reduce their consumption to \"low risk\" quite easily and not be tempted to drink any more, but others find that complete abstinence is more effective, or just choose to go that route because that's how they want to see themselves.  I commend your wife for quitting, it is not an easy thing to do even if you aren't drinking very heavily.",
            "I'm right there with you on the lack of good non-alcoholic options in restaurants. It seems absurd that if you're not interested in booze, some high end restaurants have worse beverage options than the golden arches.",
            "So glad to see this update and im glad you guys are doing well! Super curious , what was the self help book that helped your wife ? ",
            "Glad to hear this was a happy update!  Keep living the good life!",
            "It's just nice to hear an alcohol-related story have a happy ending. ",
            "Aw, I'm glad it worked out for you guys! My husband doesn't drink so I try to find special nonalcoholic drinks to make him for special occasions like, cherry lime rickeys, Dr. Pepper with sweet lime juice, juice blends with club soda added. It's fun and there are a ton out there. ",
            "When I quit drinking my (ex) husband was very unsupportive. He would pressure me to drink. (I *was* an alcoholic, for the record)...\n\nHe's long gone from my life now and the guy I've been dating the last three years is also long time sober. We often share a bottle of sparkling non-alcoholic whatever. We still get to have the fun bottle with the foil and the popping cork. We still get to pour it in fancy glasses and talk and laugh and drink. It just isn't boozey. And really, I don't miss it. We don't miss it.\n\nI gladly toast the little champagne glass I'm given at a wedding and set it down on the table and go on with my life. New Year's Eve? I'm more than happy to be sober for that occasion. \n\nReally, after some point I mostly wonder why I ever needed or wanted it in the first place. \n\nI wish you luck! Sounds like you're on the right track. ",
            "This is quite an awesome update. I'm glad you two are doing so well and that it even helped your relationship. I like happy endings. ",
            "[removed]",
            ">Basically, it had nothing to do with me and if I felt like it affected me then I had my own problems. A year on, I can defiantly tell those people that they are wrong. \n\nWhy would you tell those people that? It seems like they were right. Your entire post is about you dealing with it in a way that not only didn't negatively effect your life, but the exact opposite. ",
            "I'm so happy that I stumbled upon your story! I've been dealing with this same thing (spouse quit drinking right before the holidays. is NOT an alcoholic). I also googled it, and I hadn't been able to find anyone else in a similar situation. Everything you described is exactly how I've been feeling! ",
            "When I first read the top of your update, I wasn't sure what to think. It almost sounded like you didn't learn anything at all.\n\nI'm super happy to hear that you have though,that you gave it a fair shot, but most importantly you seem to be a super loving husband because your supporting her by trying to help seek out alternatives for her. Good for you man! \n\nRemeber that all those moments you thought you lost can all be replicated with non-alcoholic beverages :)",
            "> Our society, as a whole, is intertwined with booze. \n\nAnother way of putting it is cultural brainwashing. As for whether or not your wife is an alcoholic, can I recommend the book \"The Easy Way to Quit Drinking\" by Allen Carr for a different perspective? He's better known for his stop smoking book. He points out that being an alcoholic or not is not actually black and white the way we usually say. Also it explains why giving up alcohol is not giving up anything of value.",
            "> I'll happily be a bit of an arsehole if a place hasn't thought about providing non alcoholic drinks. There are plenty of people that can't drink for a number of reasons after all - religion, health pregnancy etc. Places really should be prepared.\n\nThere needs to be more people doing this. Even people who do drink like occasionally something without alcohol.\n\nWhat I noticed as an occasional drinker, with strong preference for nonalcoholic beverages is that if I bring to a group party something nonalcoholic (instead of a bottle of booze) people may look odd at you at first, but soon they realize that even if they set out to get hammered they do enjoy to have something without alcohol on hand and 6 liters of juice disappears faster than anyone would think. On some parties I attended we even decided to get more juice when we started running out as the general reaction changed from \"why it is not alcoholic\" to \"it tastes good mixed with alcohol\" :)",
            "I gave up alcohol the day I found out I was pregnant. My daughter is 7 this year and I've not drank since.\nIt was a choice I am glad I made, I can still enjoy myself with friends without acting like a fool or becoming sick or having a hangover. \nWhen people ask I politely say no thank you, I don't drink. And I always get \"Why?\" Whilst they give me a funny look.\n\nBecause I don't want to. Simple as that. It's insane how people react to the fact you don't drink, like you've just pissed on the floor or something. \n\nSo it's great to know that youre supportive towards your wife in this.",
            "For several years I was drinking five beers a week, one with dinner, most nights.  I stopped drinking at one point, and was amazed that it took three weeks before I felt completely 'dried out'.  There's a sensation in my gut that took that long to go away. I went another three weeks without drinking.  I felt better overall without the alcohol.  Now I have one or two drinks a week, and that just feels like plenty.",
            "I just want to genuinely thank you for your update. I have been going through this for the past six months with my SO. People who say it doesn't affect you are full of shit. Society is *absolutely* intertwined with alcohol, and if you haven't given it up before you would be hard pressed to recognize this. I gave it up myself as well, and have never felt better. It's slightly more difficult for me because I'm a bartender, but I've embraced the fitness excuse. I'm not interested in sharing with people the fact that my SO has PTSD that gets triggered by alcohol, or that he's potentially an alcoholic, so we rather be safe than sorry.    \n\nLPT: don't ask people who say they don't drink *why* they don't drink. ",
            "Interesting read. Thought I'd share my two cents on alcoholism, from my own personal experiences, as well as my wife's. I have struggled with alcoholism from the time I started drinking, at 18 years old. I have been through almost 10 years of therapy, not to mention run-ins with the law. Prior to meeting my wife, I imposed \"rules\" on myself, although those rules had nothing whatsoever to do with the actual drinking. The rules I had in place were that I didn't drink during the work week, and the only times I **would** drink would be on Fridays or Saturdays, or both. The only times I would drink on Sundays is while watching football. \n\nLike you, I met my spouse at the bar. Initially, you have great times and great conversations over a drink. She was divorced, and had a little girl. After a relatively short period of time, I made an observation which was rather alarming:\n\nMy wife liked to drink. A lot. To the point to where she would intentionally make arrangements to have her daughter stay with family or her father, in order to be free from any responsibility, in order to stay out until 2 in the morning at the bar. She would stay out late during the week, and miss work as a result of being hung over. This happened multiple times in the months I was getting to know her. I also found myself breaking my own rules that I had set forth for myself, and that I didn't like at all. \n\nThe more time went on, the more observations I made. For example, whenever she was drinking and she got past that \"point of no return\", there was no leaving. If I was tired and wanted to go home, this would start a fight. I was the asshole, for ruining her \"fun\". She would drink to the point of being barely coherent. She would delay as much as she could before having to go back to the \"real world\" of being an adult. She equated drinking, or being drunk, with having \"fun\", and herein, my friend, lies the problem. \n\nThrough counseling, I've learned that there are two primary types of alcoholics: \n\n1. The Functioning Alcoholic: The Functioning Alcoholic is the person that feels they \"need\" to drink in order to get through their day-to-day. Be it having a glass (or three) of wine with dinner, or drinking a beer to pump their gas, this person feels the need to drink in order to function.\n\n2. The Binge Drinker: The Binge Drinker is the alcoholic who can not touch alcohol for days, weeks or even months at a time, but when the Binge Drinker starts, they can't stop. They will go on benders that will last for days or even weeks, sometimes even incorporating other drugs.\n\nI fell into the latter category, while my wife fell into the former. Combined, this led to a level of toxicity that I had never experienced before in a relationship. \n\nI also learned through counseling, and through first-hand experience that the alcoholic is manipulative. They will give every excuse in the book to justify their drinking. Whether it be stress from work, stress from being a parent, stress with family, or even celebrating. Had a hard day at work? Let's get a drink. Got a promotion? Let's celebrate and get a drink. That lead finally email you back after two years? Let's get a drink. You had diarrhea all day and your stomach is finally settling down? Perfect! Time for a drink. Virtually anything and everything you can think of. They will try to use anything they can in order to quench that thirst, to scratch that itch, to satisfy that inner demon. It was getting to the point to where my wife would go to the bar, and not tell me where she was until she knew I was almost home, so she didn't have to explain why her car wasn't in the driveway. \n\nThe other thing I learned through therapy and counseling is that alcohol changes people. Nobody in here could name a single person who behaved exactly the same sober as they do intoxicated. Not one person. Whether it be they are more friendly, affectionate, or downright angry and mean, nobody behaves the same. Not me, not you, not anyone. \n\nThe culmination of events that led to our sobriety involved alcohol. We were not yet married, and were out \"celebrating\" our engagement. We had one of my co-workers with us, and we went home as he was inebriated, and I was tired. My wife was more than angry at this, and while my co-worker was in the bathroom puking his guts out, in a drunken rage my wife took off her engagement ring, threw it at me and then called me an asshole. \n\nDoes she really think I'm an asshole? No. We are married, and have a baby on the way. It was the alcohol. Is she a terrible person? Hardly. Did she make poor decisions involving alcohol? Absolutely. It was after this episode that we went to our therapist, and we had a long discussion. At the end of that particular session, our therapist asked my wife for a verbal commitment to not drink. Not only did she ask this of my wife, but she asked this of me as well.\n\nI took my last drink March 11th, 2016. My wife has had a couple of missteps along the way, but I can't blame her. It's difficult going from the need to involve alcohol in order to \"have a good time\" to being stone sober. \n\nDuring one of those missteps, I indulged her and went to the bar with her, and sat at a table and drank Coke while she proceeded to drink six beers in the course of about two hours. Watching a rational adult transform into a petulant child who refused to leave the bar was almost shocking, and it only steeled my perseverance to stay sober.\n\nI gave up drinking because I would rather be stone sober than watch my wife struggle with her issues with alcohol abuse by choosing to indulge myself. I would, will do and will continue to do everything in my power to support her in sobriety. Has it been hard? Sure. Not for the co-dependency issue with alcohol, as what it sounds like in your post, but for my own personal struggles with drinking. Hell, the idea of drinking with my wife today gives me anxiety, as I have no idea who I'm going to get - the person I married, or a child who is throwing a drunken temper tantrum. Old habits die hard, and sometimes a beer just sounds absolutely delicious. \n\nMy wife actually suffered from the same mindset that you do (or did) in that if she wasn't drinking, she would be missing out on having \"fun\". You are correct, in that alcohol is seemingly intertwined with our every-day-lives, to the point to where people look at you like you have two heads if you tell them you aren't drinking. \n\nThat said, it doesn't bother me one bit. I've found strength because of my alcoholism. I own it. I **am** an alcoholic. However, it's because of that alcoholism and the struggles that came with it that has been partly responsible for who I am today. While I have found strength as a result of the alcoholism, I find even more strength in sobriety.\n\nOP - trust me when I tell you there's nothing to miss. It's quite the opposite. Now the world is open to you, and take in every possible moment. I wish both of you the best of luck, and I encourage you to join her in sobriety.\n\nedited for clarity",
            "This was great to read! I feel that if I were in your position, I would feel very similarly, so it is inspiring to read your update a year later.",
            "Thank you so much for this, it is an amazing story. Honestly you deserve a pat on the back for recognizing your feelings, soliciting feedback and giving the new situation a chance. A lot of people wouldn't do that, I know from my experience not drinking. ",
            "as someone who doesn't drink, most of this post is just baffling to me.   \n\nregarding a few points, first: my partner drinks sometimes, but i can't see how me drinking would change our relationship.   yes, we could share a bottle of wine.   but i don't see how that's much different than drinking our own beverages in each other's company.    \n\nsecond.  what does \"society\" being intertwined with booze have to do with anything?   i'm not society.   i'm a person.  and when i disagree with society on something, i don't go along with society just to fit in.   this isn't middle school.\n\nthird.   why would anyone judge you for not drinking?   and if someone did, why would you give a fuck what they think?",
            "[deleted]",
            "> Basically, it had nothing to do with me and if I felt like it affected me then I had my own problems. A year on, I can defiantly tell those people that they are wrong.\n\nThey were talking about negative effects. You go on to list a dozen ways in which they were right. This is a real slap in the face to people who took the time to lend their advice. You owe them more than to tell them they were wrong.\n\nOne of your actual examples of things you said you'd miss out on is your kids will not be able to sip wine with their lunch. I can't think of a kinder way to say it: That made no sense a year ago, and it makes no sense today.\n\nI doubt people were worried about the availability of seltzer water with cucumber when they told you that your wife's decision would not affect you. They were probably referring to the actual concerns you listed.",
            "> Our society, as a whole, is intertwined with booze. \n\n\nNo. a PART of our society is intertwined with booze. Not the \"WHOLE\" of our society.\n\n\nSome people drink. Some don't. \n\n\nJust like some people smoke. Some don't. Smoking is intertwined with SOME of our society, and not other people's part of it.\n\n\nDon't speak for others who do NOT share your values and don't make sweeping judgements to rationalize YOUR preference.",
            "I'm glad to hear it all worked out. Alcohol is really a big part of our socialization so I know it can be hard. I recently quit alcohol (not an alcoholic) and I'm also happy with my decision.",
            "Check out the movie \"Smashed\". It's about a couple that has to deal with taking alcohol out of their relationship. It stars Mary Elizabeth Winstead and Aaron Paul.",
            "I can't tell you how happy I am to see this update.\n\nI saw your post a year ago and always remembered it. I'm an alcoholic and don't drink any longer. Haven't for years. It almost killed me, and I'm young, so I think it would surprise people to know how bad it got. It didn't seem like much from the outside to most people. Anyway, you don't need my story. My point is that I have some perspective here that I think means something when I say:\n\nYour mourning at the time absolutely made sense. I don't miss getting drunk but it took a long time before I stopped feeling a little twinge of sadness every time a social moment where alcohol is considered important came up. I felt so weird warning someone beforehand, when they invited me to Seder, that I couldn't drink the wine. (I lucked out on that one -- they had grape juice because Great Uncle Steve or something couldn't have alcohol with his meds, and they didn't want him to feel left out.)\n\nI got engaged recently and my fiance is also a sober alcoholic. We didn't want alcohol, but we wanted the cultural, social moment of celebrating with drink. So we got that fake sparkling \"champaigne\" made of juice. We kept the bottle. Those moments are important and promote bonding. They are old and meaningful and have been repeated through generations, sometimes for many centuries. The moments have meaning, and the alcohol symbolizes that. \n\nFortunately, you've discovered all that can be worked around while still having those important moments. Yay! \n\nIt's hard, very hard, to mentally separate the moments from the traditions of food and drink that come with them. But once you do, things are still as good as ever.\n\nAnd I'm glad your wife is still sober.\n\nMy best wishes to you both.",
            "Tell me again how highly deadly and addictive drugs like alcohol and pills are so pervasive in our society, yet cannabis is still illegal?",
            ">some people were adament that my wife's decision to not drink ever again shouldn't affect me in the slightest. Basically, it had nothing to do with me and if I felt like it affected me then I had my own problems.\n\nI read this and was pretty disgusted so I went back to read the old post and see why commenters were saying that. I'm glad to say I literally could not find comments saying that. It saddens me that was the message you took away from so many people giving you so much positive support last year.",
            "[deleted]",
            "Tbh there's a huge difference to rock climbing as a shared interest and alcohol. 🙄 alcohol is not even a loss. It is the bane of existence on the human race and turns them into complete retards. When you describe the loss of \"sharing cocktails or wine or whatever\" I can't help but think that's the biggest most useless thing to miss I'm sure you have more interests than just drinking. ",
            "This is a great update!! Glad to hear things are still going well for you both.",
            "I'm so glad to hear that it's gone well! ",
            "great post and i can relate to you. i'm 26f, boyfriend is 31, and he doesn't drink. i can relate a lot to your OP-sometimes i do think about how we can never stay in with a bottle of wine or get tipsy at a concert. but i love him so much that of course i'll compromise losing that for having him. do you ever feel guilty drinking? sometimes if we are out for dinner, i'll feel guilty ordering a drink... even if he encourages it haha. i will say it's nice to have a permanent DD! like you, i'm not a huge drinker, but i do enjoy the occasional cocktail",
            "I don't drink and my partner does.  It is no big deal.  I've been off the sauce for over ten years.  He doesn't seem bothered by it, and I certainly am not.  He has a permanent sober driver, and I love the fact that my non-drinking isn't an issue.",
            "I know when my mom gave-up drinking it drove a large wedge between her and my step-dad who did not want to give up drinking.\n\nShe gave up primarily because they couldn't really afford it, but also because she had been diagnosed with Type II Diabetes and it really was not good for her, but he decided to be bull-headed about it and left her for a time.  \n\nShe eventually caved in and I wanted to say, or rather, kinda beat the shit out of the dude because he made a decision that my mom reacted to that put her health into danger because he put the drinking above 18 years of a relationship.  She started drinking again and when he asked me to help buy them beer, or whatnot, I just flat out told him No and told him why.  My mom pleaded with me to do it and she would work on it, and I caved a couple of times, but eventually he realized he was being an asshole and they both came to the conclusion together that they were done and are going on three years sober.\n\nI am glad that it was not as big of a deal as you thought it would be and I hope you two have a long and great marriage.",
            "I guess I'm confused. Why would sharing a glass of wine or something be any different than sharing a glass of Coke, if you weren't getting drunk together?",
            "Why would she have to drink alcohol to share these moments with you?  What's wrong with drinking a soda in a glass and you having a beer?  ",
            "Good for both of you!  It's not so bad, having no alcohol.\n\nI never liked the taste of alcohol (beer, wine, etc), but could manage wine coolers and moscato.  Ironically, once every couple of years, I'd have a Long Island Iced Tea--provided I didn't *taste* the alcohol, I was fine with it.  If I tasted the alcohol, *I Love Lucy*'s expressions during \"Vitameatavegamin\" had nothing on me.\n\nAnyway, at our local steakhouse, I'd always order a Shirley Temple with muddled mint leaves.  It's gotten so that one of the bartenders literally hands me the drink while we wait for our table.  I don't need the calories, but it's mostly ice anyway.",
            "Alcoholic here. I've been in recovery for a couple months short of a year now, and this was one of my fears-- not just that my wife would miss drinking with me, but that all my friends and family would. I'm pleased that you were able to adjust to it, and I'm pleased that pretty much every non-alcoholic in my life has responded the same way: It simply isn't that huge of a deal. Kudos to you for being supportive. And I'm with you on soft drink selection. At least have an overpriced seltzer with fruit or some shit in it, right? ",
            "I understand that feeling of loss that you talked about in your first post, I know rationally it doesn't make a huge difference because I don't drink much either but there are some times I'd like to share some wine or beers. \n\nI recently thought about this because a friend started dating someone new who is a recovering addict and who abstains from alcohol and drugs, she quit smoking pot and drinking even though she was a minimal drinker as well. At first I thought how I would deal with it and I don't think if I was starting a relationship I'd go down that path but if I was in one that I wanted to keep I'd make some changes and be supportive.",
            "I appreciate your candor about this situation.  I actually don't think it's selfish at all for you to feel the way you feel. \n\n\nOne thing I haven't seen mentioned in the comments is that what's underneath some of your feelings about her not drinking is that you enjoy how it connects the two of you. You enjoy it as an activity that's fun and helps you feel close to her. I understand why this would feel like a grieving process as a result. \n\nI kind of feel like that's what alcohol SHOULD be for normal, healthy drinkers...I liked your rock climbing analogy.  That summed it up for me.  \n\nI feel like your attitude is actually quite healthy for the marriage. \n\nDepending on where you're at with it, maybe it'd be a good idea to talk to her about it. I'd say the best way to approach it would be like, \"hey I just want to share how I feel about you not drinking, but I don't necessarily want to change your behavior. I just liked having fun with you back in the day, and I kinda looked forward to that in the future, and I'm just a little sad.\" \n\nif you approach it from the POV of wanting to be close to her, I think that's more honest bc that seems to be your true motivation. \n\nI think if you come at it like trying to control her behavior, it's prob not healthy but I honestly don't think that's your goal here. \n\nAnyways, thank you for your post. I think you sound like a good husband. \n",
            "I'm an alcoholic from the UK as well and fair play to you for bring so supportive to your wife. Taking from experience it can't have been easy for her but it seems like you've definitely helped her in a big way. Fair play. ",
            "Good to hear it worked out for you. My hubby will still drink with dinner if offered and I still can't stand the taste. It's amazing how expensive the mocktails can be.",
            "This is so great. Well done her and well done you for being such a supportive partner. I'm so glad you're both healthier and happier for it :) ",
            "Oh, hey, I remember you! I'm glad everything went well after all.",
            "> As I mentioned above, some people were adament that my wife's decision to not drink ever again shouldn't affect me in the slightest. Basically, it had nothing to do with me and if I felt like it affected me then I had my own problems. A year on, I can defiantly tell those people that they are wrong. In a marriage, at least in the kind of marriage I believe in, you and your partner's actions and choices are intertwined\n\n...\n\n> So, what have I learnt in the past year? Well for one, your parter giving up booze really doesn't matter. You just adjust.\n\nSounds to me like all those people were right after all.\n",
            "I think I saw the original post, but never commented. Anyways, I don't drink either, and like her, I have my reasons too. Alcohol isn't the end-all, be-all of everything social, and you found that out even living where you are, where alcohol culture is a bigger deal than it is here in the U.S. Still, it largely depends on who you're around, too.",
            "Bit late to the party but this post hits home a little bit, I'm currently single and obviously I've been adventuring in the online dating world  and been avoiding like plague girls who put \"NO\" in drinking. Why? I don't even know, I love my beer and wine but why should it bother me that my futur girlfriend doesn't drink?\n\nEh! Thanks for the post, changed my outlook on how I view things!",
            "this was a fun read. you are very mature for your age. i wish ya'll the best in life.",
            "I'm so jealous of you and your wifes relationship, you also sound like quite a catch, articulate, funny, don't take yourself too seriously and an all round good egg. "
        ]
    },
    {
        "post_id": "3d43hu",
        "author": "MagicMinister",
        "title": "I [30F] am a painter. MIL [66F] asked me to draw her for free. I refused. She's badmouthing me.",
        "url": "https://www.reddit.com/r/relationships/comments/3d43hu/i_30f_am_a_painter_mil_66f_asked_me_to_draw_her/",
        "score": 2040,
        "num_comments": 598,
        "created_utc": 1436784420.0,
        "selftext": "Title may seem like I'm an asshole but I'm not. Let me put the background information out here:\n\nShe has always been critical of my work and always considered it \"not a serious job\" and \"only a hobby\". When I was dating my now-husband, she would always advise me to get a \"real job\" and do this on the side as she argued \"I can never make enough to support myself doing this\". At some point she said \"you don't want to be a welfare queen for the rest of your life\". To her disappointment actually I've been very successful in the past few years and make more then her son does right now. \n\nMy SIL (her daughter) has 5-year-old twins and it was their birthday a few months ago. I offered my SIL to make a large drawing of the kids for free. There was a lot of reasons for it. My husband and her sister are close and she's always been very nice and helpful to us in every way possible, and is one of our best friends. I love her and her kids so I offered this and she accepted.\n\nMIL saw the drawing, apparently she liked it and asked me to do one of her and her husband. She gave me some instructions about the size and I told her that I will get back to her with a quote. For what she requested I usually charge around $5000-7000 so it's not a small thing. I usually offer 20% discount to friends so I was planning to give her that discount as well (I told her that she'd get 20% discount). She said \"are you going to charge me for it? I thought you'd do it for free like the one you did for [SIL]\". I told her that it's not possible as that was a birthday gift for her children. She said \"fine don't do it then you so-called artists aren't so different to gold-diggers\". I said \"welfare queen to so-called artist is an upgrade, I'm flattered\". I left then. This happened a week ago.\n\nToday I realized that she's been badmouthing me to everyone for the past week. She is saying that she asked me for a favor and I gave her an invoice and requested payment beforehand. She is going on about how she would have moved heaven and earth for her in-laws and would have never asked for anything and that this generation have no respect and responsibility to their parents and went on and on and on. She also posted stuff on Facebook about this, although without mentioning my name.\n\nHow do I handle this? My husband hates family drama and is away right now at a conference where he as a lot of responsibilities. I don't want to put this onto his plate as well. He knows about the initial conversation between me and MIL but not about her badmouthing me. He'll be back in a week.\n\n   \n**tl;dr**: MIL asked me to draw her and her husband which typically costs $5000-7000. I told her I'd give her a quote and offer 20% discount. She was offended as she expected me to do it for free. She is now badmouthing me, claiming I'm some sort of gold digger. ",
        "permalink": "/r/relationships/comments/3d43hu/i_30f_am_a_painter_mil_66f_asked_me_to_draw_her/",
        "comments": [
            "If it is any consolation, if I had heard directly from her that you didn't want to provide a painting for free to her and nothing else, I would still kind of imagine that was reasonable. I know (as I think most people do) that large paintings take a long time and know you can't be giving them to people for free, willy-nilly. \n\nOf course if she has sycophantic friends, they might immediately paint you as the bad one, but just know that not everyone would have the same opinion as they would.\n\nIt sounds like she doesn't want to have an actual discussion about it. You've already told her your view on it, so unless you want to argue about it, I don't think that there's much more that you need to do.",
            "You don't really need to do anything. You can't change her opinion without compromising your integrity. You don't owe this woman ANYTHING. She sounds selfish, manipulative, and immature. You can't stop her from talking. Let it go. If she didn't support you then, she doesn't get to reap the benefits now.",
            ">I said \"welfare queen to so-called artist is an upgrade, I'm flattered\"\n\nHaha! Love it!\n\nI know how annoying it is when someone is badmouthing you and you have to just sit there and do nothing, but I think it would be the best course of action. No matter what you say, she'll just find a way to hold it against you. \n\nWhat I **would** do is make her son aware of it. Maybe wait until he's back from that conference. Then let him handle the drama. It might be time to go no/low contact with her altogether for a while, as she seems to be seriously lacking respect for you. ",
            "When anyone who's heard her badmouthing asks you about it, sigh, shake your head and give a good natured chuckle. Then say, \"yeah, that's really not what happened. She asked me to do a $7000 job for free after denigrating my work for years, and got mad when I offered her the family discount instead.\" Heave a beleaguered shrug, and change the subject.",
            "I hope you don't have a hot tub at your house!\n\nThe way I see it you've got two choices. One is to do it and avoid drama and the other is to stand your ground.\n\nAs someone in a similar situation (computer shit), I just flat-out refuse being volunteered to fix anything for people. I simply tell them they can't afford me and that if I give away my skills then it means they're worthless.\n\nOnce you start giving your skills away it will never end. You may have to learn that lesson the hard way, but look at it like this: is it better to deal with a bunch of bullshit on Facebook or deal with having to be an on-demand artist and keep turning people down and arguing?",
            "[deleted]",
            "I am in this situation right now with an in law and he's fucking me around. You were right to refuse. Basically he wanted something drawn up for him, I did it how he asked, he's now claiming he never asked for it like the way I did it (despite having emails that say otherwise...) Anyway.\n\nI would inform your husband of the situation anyway, it's not your fault he now has extra stuff on his plate; it's his mother's. Stand firm and ignore the bullshit. If anyone ever told me they were pissed off because someone wouldn't do them a free painting I would think they were being totally unreasonable. My parents pay me for paintings I do for them, lol.\n\nBullshit family members love the idea that they can get something from you for free, real family members will pay you anyway.\n\n",
            "Don't stoop to her level.\n\nBut maybe you can: Tell her you have customers who pay at the moment and you cannot afford to draw for free, as you are a avoiding to become a \"welfare-queen\".\n\nPeople who talk bad about others behind their backs are not usually seen as noble. She will get her reputation when you, if asked, calmly \"explain\" the situation.\n\nYou are making a living out of your art, and as a family member, she should acknowledge that - also, that you are not obliged to draw her just because she suddenly wants you to.\n\nIt is your time of your life - she has been resentful all the years - you are not obliged to spend your time (and thus money) on a disrespectful person.\n\nYour husband should get your back. While he hates family drama, he can avoid it by telling his mother to back off and act respectfully towards you.\n\nWhy do you have to \"suck it up\" all the time, to avoid the drama she creates with her hateful attitude?\n",
            "You don't do anything. Limit your interactions with her, and have your husband talk to her instead of you. At age 66 it's unlikely you can teach her not to be a self-centred, manipulative bitch.\n\nAnyone who matters and knows you and your husband will know that you're not a gold-digger, or understand that artists actually do need some form of payment for their skill and multiple hours of effort expended on a project. Who cares what her bitchy friends think? They probably weren't going to buy your art or like you from her bitching anyway. ",
            "work is work\n\nyou don't go to a friend car-seller and request a free porsche.\n\ni use this metaphore when people try to do the same shit to me.",
            "I enjoy the irony of her calling you a welfare queen while she's the only one expecting a handout",
            "dime telephone simplistic hungry innate crown station drunk ossified overconfident\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
            "I had a similar sort of argument  with a friend. After I crocheted a stuffed sheep toy for my pregnant friends new baby one of my other friends offered to buy one from me.  That sheep took me 50 hours of work. I'm not a proficient crocheter, it takes me a long time. My friend expected me to sell her one for a tenner. Even at 5 quid an hour, which is well below minimum wage it'd be 200 quid.  I did the first one out of love, but I'm not a production company and I hate when people don't realise the sheer volume of time  spent.  Maybe mention to mil how many hours of your time the gift took. Maybe then she'll understand the price a bit more and back off.\n\nOtherwise I'm all for the turd painting someone else mentioned.",
            "She's baiting you. I would do and say nothing. She's making as ass of herself and will wear herself out soon enough. ",
            "hold on, you get people to actually pay 5-7k a drawing, and do enough                              of these to keep busy?  Kudos.  A good friend of mine is a portrait artist (I guess not super high end as he does lots of people's pets), and typically charges what works out to ~150 an hour of his time (usually under 10 hours).  5-7k are very impressive numbers.",
            "Out of curiosity, how much would you have estimated the value of the birthday painting to be?",
            "I don't think she understands the work that goes into this. So when asked about this you should also add the time factor that goes with that price tag as this is more relatable. 5000-7000$ is more than the average month of work pay for most people, so even if you subtract materials and only count raw labor I assume it's still a lot. Everybody will understand something along the lines of \"I can not work a month free just as a favor\". This will also make her request obviously ridiculous to others. You can also add that you were willing to work the equivalent of a weeks worth of pay for free.\n\nPS I am aware my numbers are probably off, but you get the idea. ",
            "My boyfriend's mother is also a successful painter who has given some of her paintings away to friends and family as gifts. I've yet to receive a painting but I am absolutely not upset about it. It's her artwork, so it's her choice. When the day comes that she gives me one as a present, I'll be thrilled, but I'm certainly not expecting one and I'd never dream of demanding one. Your MIL is way out of line and any reasonable person who listens to her side of the story would be able to smell her BS. Painting is your career, not your hobby. Of course you should be charging her for it. It's entitled of her to think otherwise.",
            "Could you please post something?  I wanna see a $7000 drawing.  I'd appreciate it.\n\nCongrats on standing your ground, by the way.  My cowardly ass would have folded up like an accordion.",
            "[deleted]",
            "do nothing , i think that most people know how she is , and will know she is full of shit , be the wiser one and ignore her ",
            "Have you visited /r/justnomil? ",
            "Maybe put a bug in your SIL's ear. \"Oh man, your mom is super upset that I'm not doing a piece for free, but I've got so much work to do that's paying, I can't put that off to do free work.\" With any luck, SIL will tell hey how ridiculous she's being.\n\nBut you can't really respond to bad mouthing except through transparency. \"I thought you didn't like my work, I'm not sure why you're upset now.\" \"I'm making money on paying jobs right now, surely you understand since you don't want me to be a welfare queen.\" Etc",
            " i have very similar issues with my MIL ... i am a chef and she has always been very insulting , telling me how \" anyone can do that \" . when she realized that i do have talent , she started making comments about how that's why i have a weight issue ,then she began hounding me to make things for her church , family reunions , etc , and wanted me to do it on my dime . women like these are jealous of talents that they don't possess and believe that a compliment and their approval should be payment enough . if her family and friends know how she behaves towards you , then i wouldn't really worry about it. they will understand why you responded the way you did . they have probably heard her speak of your work and talent in a way that was less than polite before and can more than likely see it from your perspective . ( i'm sorry if this was sub-par , i literally just joined so that i could comment on this )",
            "Stand your ground.  I had a similar sounding argument on reddit a few weeks ago when I mentioned that my wife and I paid our wedding photographer friend to shoot our wedding.  People started coming out telling me that the person isn't our friend if they charged us.  If it's your principal form of income and you are giving up time you would otherwise be earning income, you should be compensated for it.  I still don't understand how people think an artists time should be free for family and friends.  ",
            "> My husband hates family drama\n\nThere are two ways of hating family drama. \n\n* **Option A** : *\"Oh dear, Mum's being unreasonable again. It always amazes me how she gets everyone on her side. Thanks for how you've dealt with it up to this point. If she says anything else, please let me know because it'll be time for me to have another firm word with her.\"*\n\n* **Option B** : *\"Oh god. Look, I'm tired and I don't want to be dealing with more family drama bullshit. Couldn't you have made her understand? Maybe you could draw her a quick portrait? Oh god, I don't know. Look, it's been a long day, OK?\"*\n\nI am very much hoping he's an Option-A drama-hater. ",
            "[deleted]",
            "Jesus Christ, all these terrible in laws posts lately.  And here I am with wonderful pseudo in laws (not even married) who let us live with them rent free, and a MIL who just bought me a massage for my birthday and acts like I'm a saint if I vacuum a rug.\n\nOP unfortunately I don't think there is much you can do.  If you give in she will assume any future boundaries are the same (ie that they don't mean shit).\n\nDo you know if anyone she bad mouths you to actually even agrees with her?  I'd like to think that most people just nod their heads when she rants but internally are wondering what the hell is wrong with this woman.  Hopefully.\n\nAnyone with sense will recognize she's not in the right and also that her Facebook bullshit is immature.",
            "All of your actions sound reasonable unless she has been generous to you guys. Has she pitched in for your wedding or given elaborate gifts? That changes the entire context of the story. ",
            "I don't really have any advice that hasn't already been mentioned, but as a fellow artist (photographer) please know I feel you pain.\n\nEdit: I do have a story. One of my mother's best friend got remarried a few months ago. Knowing that I'm a photographer, she asked me to photograph her wedding. We talked on the phone for a good while of what she wanted, and at the end said, \"well just know that I want to pay you!\" I had already assumed this, because there was no way I was photographing for a whole day and then several days editing for free. I told her my rate for her wedding, but also mentioned I was taking **$500** off the price because I consider her family. She kind of went quiet and then said, \"well great, I'll get back to you if I want your services.\" Prior to the price, it was, \"Yes! Of course I want you to be my photographer!\"\n\nLong story short, she ended talking to my mother (who actually understands my profession) and tells my mom how she really didn't expect to be paying so much for photographs. My mom put her in her place and told her how much time, work, effort, and goodies I provide. Her best friend got back to me and accepted. My mom is my best sales person.",
            "I wouldn't do anything really. If someone else brings it up, tell them the simple truth. You made a painting as a birthday present. Weeks later your MIL came with a list of specifications like it was an official order and you replied with an invoice. Make it clear, you don't think it'd be wise working with MIL in the future because of her public reaction.",
            "So now \"working for a wage\" is gold-digging, huh?",
            "At first I thought you were an asshole, but fuck that lady",
            "Don't do anything. I'd make your husband aware before he heard from someone else though. Was he on board with your initial conversation with her?",
            "Your MIL is an asshole. She badmouths your job, then gets mad when you treat it like a job. She doesn't value you, as you seem to know.\n\nTell your husband, inform the relevant people of the exchange, and quit dealing with her. Continue to paint canvas and get money, and realize that every single dollar that you earn doing it is a fuck you to her. So not only are you successful, but by virtue of your success and joy, you prove her wrong. There's no real need for you to deal with her. You didn't even come off as an asshole in the title; you have a right to say no and to not do free work just because some jerk feels entitled.\n\nAlso, it's funny how she was always trying to take you down, but now that you won't do something for HER, suddenly she'd move heaven and earth and blah blah. She's a selfish, entitled jerk that doesn't value her relationship with you, your skillset, and your success. Fuck her.\n\nAlso also, \"welfare queen\" has some extremely racist undertones to it given the usage of the term to malign black women. So there's also that.",
            "Out of curiosity, do you have an online portfolio with some of your works? (That is, if you like to share it here.)",
            "Old people acting entitled and whining about not getting free stuff is pretty much just a fact of life. Let her have her tantrum and ignore it, she'll tire herself out eventually.",
            "Idk I see your side and it makes sense but don't be quoting rates discounts etc. A simple no to her asking would have sufficed. ",
            "Ignore her and after that ignore her even more. It's like the king of goblings she only has the power that you give her, so if you treat her like a senile woman who is losing her marbles more power to you. ",
            "Paint a smaller picture of her and make her look 70lbs heaver. Frame and hang it in your house.",
            "I would probably have handled this differently.  I would have told her up front that the other canvas was a birthday gift that took you an inordinate amount of time, and you can't take time to do another one right now without losing money from paying clients, but maybe in the future?\n\nI would have then done one, for free, in the future for a birthday or anniversary or something.  You would have pissed her off initially at first, but gotten browny points later on.  On going Family drama is not worth the 4000-5000 you were going to charge her.  I would have rather flatly told her no, than send an invoice to my MIL.\n\nAt this point what's done is done and you'll have to stick by your guns or she'll manipulate you in the future with the same tactic.  Have your husband speak to her.",
            "I would wait for your husband to come back before doing anything. Making any moves now by yourself is risky and you don't know how she's going to respond. Involving your husband, even though he hates family drama, gives your arguments more weight.\n\nBy the way, do you mind my asking what kind of paintings of you do? ",
            "If she wants a free drawing, do 20% of what she asked for and tell her that's the amount she can have for free. When she wants the rest, that'll be $5k, thank you very much, Madame.\n\n(Alternatively, ignore her completely while she has her social media tantrum. I'm sure your husband with face palm on your behalf when he gets home.)",
            "Dang, is this a throwaway? I really wanted to see some of your work! ",
            "Take the high road. Don't badmouth her to others. Continue interacting with others as if this incident hadn't happened. She might turn a few people against you, but most people who know both of you will know that she is toxic to others and you aren't.\n\nIf someone asks about you and her, simply say that she wanted the portrait for free, you declined, and now she's upset. Leave it at that. Don't explain yourself and don't make excuses to her or anyone else.\n\nMinimize contact with her. You won't turn her around, so stop trying. Don't have her over to the house. If hubby wants to see her on Thanksgiving and Xmas, let him go alone. If she asks what's up, be direct and tell her that until she gives you the respect you deserve, you have no interest in being around her. Then go on with enjoying your life. The ball is in her court at this point to repair things.",
            "You gotta give respect to get it back. Besides, you *offered* the free painting to the twins, whereas she just automatically expected to get one just by asking. There's a difference. Tell your husband about this, because if my mother was acting this way to my SO, I'd be FURIOUS. Too bad if he doesn't like family drama, he needs to be mature enough to handle shit like this when his mother is so clearly in the wrong.",
            "It's one thing for you to offer or give it as a gift. It's another that she asked and then made demands on what she wanted. She could have simply said something about wanting you to do a pic of them for their anniversary or something. \nThe best advice is given. Ignore her and what's she saying. ",
            "should have done outline not shitty but fast version of painting saying \"This is the best free painting i have done\" . then charge for professional tiring one.",
            "She used the term welfare queen?  That's hilarious, since she's the one with her hand out, expecting something for free.",
            "can we see examples of your art . I'm just curious about how it looks  ,not that it makes a difference to this post. ",
            "It would be one thing if she had a history of being sweet, helpful, and caring with you, but from the sound of it she's quite the opposite - the fact you're willing to give her a 20% discount is gracious of you. You did nothing wrong here.",
            "As a fellow artist I know this mindset all too well.  The problem here is your mother's value she associates to art in general.  She probably doesn't understand the time and material equipment required to do a large and professional quality artwork.  This is common of non artists, they often feel entitled because they know you.\n\nRegardless I'd handle it by explaining in a way she could understand.  Show her the time/costs you incur for a project.  \n\nAlso it sounds like this women doesn't respect art whatsoever.  You should point out that every consumer product she knows and loves was inherently designed by an artist.  From the style of glass bottle her fingernail polish is to the logo and style of her favorite walking shoes, to the car she drives.  The layout of the parking lot at her favorite salon was designed by an artist.  \n\nRemind her that art is a huge business, if it weren't than music and movies wouldn't be a thing and California wouldn't be the world's fourth largest economy.  \n\nThen at the end of your point show her on paper your income compared to her son's and that you will consider any more rumors and falsehoods on her behalf slanderous to your financial well being.",
            "How dare artists ask to be reciprocated for their work just like everyone else??",
            "Bitchy old people can't be reasonable. Just avoid her as much as possible. She obviously just wants to degrade you for some shitty ulterior motive I am unaware off.\n ",
            "Ask her for some ridiculous amount of free work in her chosen field. Maybe she'll understand that she is dumb. ",
            "You don't do anything for now.  Wait for your husband to get back, tell him everything and tell him that it's his mom, so he deals with it.  In the meantime, don't sweat it.  There's zero chance that she was a perfect ray of sunshine her whole life, and this is the first time she's every badmouthed someone.  People will know to roll their eyes and get on with their day.",
            "I think you handled it correctly, and your MIL is a disrespectful bitch. The good news is people are most likely aware of her issues, so this hurting your reputation is unlikely. For family members such as your SIL, it would be good to head this off at the pass so to speak, perhaps by \"asking their opinion\" on what to do as a way to let them know the real story. For the rest of them, just let it play out, and if someone publicly confronts you, very unemotionally explain it. \"I currently have x projects in progress, and historically have had dozens of these where I earn X. It takes X time, and I charge X dollars. I offered a significant friends and family discount for the work, but MIL was unhappy with the price and believes I should invest X hours of my workday for X days at no charge.\"\n\nI deal with issues like this on occasion, and it came up far more frequently early in my career when I didn't realize I needed to head it off at the pass. I work in IT, and while I have always done free work for parents and for close family or friends who I knew needed repairs and couldn't easily pay me, I don't take work I hate doing or work for far less than I'm worth otherwise. When I get asked if I can look at ancient, dusty system that I know from experience will be miserable to work on, or if I get asked to work on something by someone who wants to buy be a six pack for my time, I just say \"I'm actually working in (specific IT field) now and so I don't work on those any more. It may be cheaper to buy a new one, but (repair place) may also be an option. That generally does the trick. If it's something I'm fine working on, I'll do basically what you did: \"Sure, I can do that. My normal rate is $150 an hour, but I can give you a 50% friends and family discount. That should normally take around 2 hours.\" This establishes the value of my time, lets them know I'm doing them a favor, and generally prevents the offer of a 6 pack for hours of my time, which I have little of free these days.\n\nI think you did all of that, but your MIL has a track record of not respecting you or what you do anyway. At that point there's not much you can do, other than firing her proactively as a potential client.",
            "A wise man once told me \"Never give away your trade for free\"",
            "I really dislike the fact that some people have no idea of the effort and dedication it takes to do artwork at a high level, and expect you to do it for free.",
            "I am not adverse to confrontation, and if I were you, that MIL would be working my last nerve. So I'd probably say something like, \"I know you think that my drawing is a hobby, but it's not. It's work that I get paid very well for, thank you very much, and now you want me to work for you for free. Maybe if you actually respected what I do and didn't take every chance to belittle me and my profession, then I'd be a little more likely to put my much-maligned talents to work for you. As it is, I'm not, and if you want me to work for you, you'll have to pay me like anyone else. The 20% discount still applies.\"",
            "Personally I wouldnt have anything to do with her.  Why doesnt your husband tell her to fuck off for lying about you.\n\n> My husband hates family drama \n\nI read this as: My husband doesnt stick up for me, hasnt got my back, and hates the thought of setting and enforcing boundaries with his overbearing harpy of a mother.\n\nYou need him to get his shit straight on this.\n\nIn the short term though you just let it slide. People who know what she is like will discount what she says anyway.  Anyone worth caring about will at least wait to hear your side.",
            "Don't explain. You have your professional integrity to keep. If your friend is a carpenter, you don't ask him to build a deck for free. Or ask a professional protographer to do a wedding shooting for free. Small things are ok things to ask as favours occasionally, several grand ones are faux pas. You're just being professional.\nShe is being tacky and uninfomed here. And more she shows it to the world, the less classy and decent she shows herself to be. Don't warrant her with reaction. But maybe do a gift for someone else in the family on next christmas.\n\nEdit: On more constructive approach, she would like to have a drawing, and bears resentment or jealousy towards artists for whatever reasons, and doesn't really understand the value or art and working on the field as professional. Believe good intentions of her, she would like to bond and maybe have something of yours to show in her apartment, and maybe she thought that the idea of her modelling for you would be good time to get closer, and took your refusal as personal insult of not wanting to get to know her. I don't know how to approach this, a somehow more constructive  moment where you could explain of value of your art- maybe invite her to a gallery opening or some movie, something where she would get more proper frame of your field of work, or have your husband to explain why you felt her demands were out of place. That it is not against her, but of professional reasons. ",
            "Personally, I see a huge difference between OP's generous *offer* to the SIL than the MIL's *demand*. That's what I find most offensive. She doesn't owe her work to anyone and I can't imagine how MIL convinced herself that this was something she was entitled to.\n\nBased on the context, I wouldn't be surprised if OP offered to do a portrait for her in-laws as a special anniversary gift one day down the road **if none of this happened** (correct me if I'm wrong OP) but the fact that she didn't appreciate her skills until they're something she can use is awful.\n\nedit: forgot a word",
            "Ugh!  I hate this.  People don't understand that this is your livelihood and not a hobby.  It's the same as asking her to take off 50 hours of work at her job to help you out with something and not pay her for it.  If you're doing her painting then you're losing money that you would be making from a paying customer.  I do plumbing and I get this crap all the time.  You did the right thing.  ",
            "My girlfriend is an artist. I am currently unemployed but a good photographer who also happens to have a knack for fixing pc's and IT. People regularly expect me to photograph them or fix their computer for free, because I'm unemployed and \"have the time\". When I was stiffed after shooting a wedding (I was naive and didnt discuss price beforehand)  ...it was then and there I put my foot down and stopped being used. In doing so, suddenly I was the asshole. People are amazingly ignorant and selfish. \"I'm not going to pay you more than $20 to photograph my wedding, all you do is press a button. Anyone can do that\".\n\nThose people are no longer \"friends\"",
            "As an artist, I get this sort of attitude all of the time. I'm a tattoo artist as well, and it's pretty prevalent there too. I've heard everything from \"Well, you aren't doing anything right now, so how about you work on me for free? I'll pay you back by telling my friends about you. All your doing is tracing, so it's not like you're doing an actual job.\" It's really frustrating and has led to more than one argument. Even how much I charge for a piece of wall art gets attacked. I have some pieces that I've put 30+ hours into and only ask $150 for. A skilled laborer makes upwards of $100 an hour in my city. That's $3,000 by that calculation. And the $150 I'm asking gets laughed at for being greedy. \n\nPeople will always disrespect how much work and dedication goes into being an artist. They fail to appreciate all of the things we do to make a great piece of artwork. How much time we spend on educating ourselves, honing our skills, finding new materials to work with. And speaking of materials, BEING an artist is expensive. I've had to steal art supplies because I was too poor to afford them. \n\nStick to your guns. You did the right thing. That's your livelihood. Not a hobby. You're successful. Many artists aren't. Be proud of that. And don't be afraid to demand to be treated with the respect that your years of hard work and training have earned you. ",
            "[deleted]",
            "No need to do anything or bother your husband about it until he returns home. This should blow over pretty quickly. \n\nYou have done nothing wrong, except that when she first asked for a drawing, it might have been a good idea to bring up price right away, or just say that you are too busy. \n\nThe upside of this is that now its likely that she will never ever ask you to do any artwork for her ever again. She might not even want to speak to you for a good long while. As she sounds like an epic bitch, this sounds like a win to me. ",
            "What weird world does this woman live in? Art supplies ain't cheap, especially not professional stuff. My student quality water colors cost £200! And proper portraits can take months and months to finish depending on what material you use. What the hell!?",
            "You don't have to do anything if any of the family members know the real story it will spread especially if this lady has done it before",
            "Let her ugly remarks just hang in the air. She's lost you.",
            "Don't give her the attention that's she craving.  Unless her badmouthing directly impacts you in anyway, ignore her.\n\nIf her badmouthing does have direct negative consequences for you, then tell your husband he needs to step in and speak with his mother.\n\n",
            "I think it sounds like there is a lot of context that goes along with this situation. There's an entire history there of devaluing your work combined with the fact that you normally charge family and friends. How many of the people MIL talks to are going to know that? Does SIL know how MIL works and that her situation was unique? Does MIL talk to any of the people who might connected to your customers?\n\nIn addition to having your husband confront MIL personally, I think you might need to be thinking about making some of this information known through your own FB post or whatever you need to do. Right now MIL is framing the issue and controlling the dialog. It's not furthing drama on your part if it is a) the truth and b) needed to protect your image and your business. ",
            "Though not quite to the degree you are experiencing, my wife went through this situation when she was a tattoo artist. Family and friends would see her brilliant work and immediately assume, and I mean *begin to tell her what they want her to do* assume, that she would do it all for free simply because they had a relationship. She did much the same thing you did, offer a discount, but some people genuinely got salty over having to pay for her work. Her own brother (who is admittedly a scumbag), practically demanded a free tattoo, and after she refused, he has since stopped talking to her. When you have a in-demand skill or trade, this is just something you will have to put up with. The only thing that made it tolerable was setting clear boundaries and not budging on them. People eventually got the picture. You are an artist and a professional, not a dancing monkey to do as other people demand of you. You are not obligated to please them just because you have a talent. ",
            "Can we see any of your paintings? They sound like they are quite good if its what you do for a living. ",
            "Sounds like she's never taken your work seriously, hence why she balked at paying you.  Don't worry about the badmouthing.  Anyone who believes it most likely doesn't take your work seriously, either.  \n\nChalk it up to haters gonna hate.",
            "You don't owe her a damn thing. You could ignore her or confront her and to tell her to stop badmouthing you, and you could also tell your SO what's going on, and see if he would be willing to talk to her. It's partly his role to mediate this relationship, I think.",
            "How about doing it, but making her look terrible? A perfect way to troll her :P",
            "Break down the time and expense such a project entails and she might get it.",
            "Don't do it.\n\nI am a knitter, not quite the same as a visual artist, but I consider myself an artisan or a maker to some extent. I have people asking me to knit them stuff all the time. If I only knit the stuff people asked for, I'd never have time to knit stuff to sell.\n\nWhat she's telling you is that you should work for free. What does/did she do for a living? Ask her to do her job for free, and see how she feels.",
            "Ugh, family and friends can be the worst offenders of this social etiquette. If someone took the time to learn how to do something so they could make a living doing it then don't ask for them to do it for free. And people always want shit for free. Always.\n\nShe's got some pretty big balls to ridicule your career and work and then turn around and ask for work for free. She doesn't get that you didn't give that first painting away for \"free\".  It was a gift. That is a big difference. You made it with the intention of never getting anything in return. If you do this painting for her without getting paid she gets a nice free painting and all you get is resentment. And she clearly doesn't consider your feeling so it wont affect her at all.\n\nNow you have the best reason in the world to never contact her again. Yay you!\n\nAnd how the hell is your husband okay with her calling you a \"welfare queen\"??",
            "Family is a pain in the ass. I never do business with family. You have a skill set beyond most people in your field. It takes a lot of time to complete a painting so you lose a lot of money doing it for free. You don't have to do anything. She always talked shit to you and now wants something. If your family isn't crazy they will know its bs. Fuck it, I would double down. Do a painting for another family member for free. Maybe she will get so pissed off she never talks to you again. That is how you really win.",
            "Don't worry about your MIL. There's nothing you can do, unless you want to have a sit down and ask her why she's badmouthing you, then work it out from there.  \r\rJust focus on your relationship with your husband. Honestly if my parents thought my wife's (currently gfs) profession was useless, I'd consider myself a shitbag for not stepping up and shutting that down, so imo your husband has some work to do. He should be getting over his family drama allergy to take up for you when he gets back. Just try not to talk bad about his family too much during this process because that can be draining for someone who doesn't like to be involved. ",
            ">\"welfare queen to so-called artist is an upgrade, I'm flattered\"\n\nGreat comeback.  \n\nYou did nothing wrong.  I don't know what you can do about it except just live your life. I would let the husband know ASAP though.",
            "You could paint her husband....riding a donkey.\n  \n\"Hey, I wanted to make it as realistic as possible!\"",
            "Agree to the drawing and then present her with a picture of shit.",
            "funnily enough,I have been in a very similar situation, twice. I got everyone in a room and ranted about it. In the end i didnt do shit for her, and I believed she was only trying to test me and my skills, and to get something out of it, your MIL would love the idea of having a big piece of art work you did, as a token of your dedication to her, and it would make her feel powerful, as she has already bitched about you, and treated you like a second class citizen, it would be a sort of \"heheh look what that welfare queen made me, all that hard work, and i get to sit here and judge it\" ... in my opinion she needs to be called out, calmly, and express how upset you were when she called you a welfare queen, and how you should not be expected to slave over a big piece of artwork, after being bullied and when she has not formed any relationship with you, i would bring up how it feels like it is some sort of test, to set you up for failure, and how the point of \"i would have moved heaven and earth for my inlaws\" is invalid, and she forgets who raised your generation, she did, she raised them. Firs thing i would do is print screen the nasty facebook things, make a note of everything she said, and to whom she said it, and bring it up, show her, and explain how you feel depressed and unfairly targeted, and would like it to stop. when i was in this situation i said  something along these lines .....you have the right to express your distaste about me, but surely you would at least take care to make sure i would not find out, i believe you knowingly bad mouthed me so I would find out, to bully me into feeling bad, so you could feed off the anxiety you give me, you make me feel shit and hate myself, you dont like me, i dont like you. ... \n\ngood luck, i have had no support what so ever from any family or inlaws when it came to my art, i was bullied into quitting my painting, and i went on to do law, but that wasnt good enough for them either, there will always be something they want to pick on. congratulations on being successful, that is surely enough to annoy the fuck out of this horrible MIL. My SO's mother is like this, he hates family drama because of this, hes so fucked up due to her neglect and judgement, so he shys away, and just bows down until one day he blows up , and then the cycle starts all over again. ",
            "This is sort of irrelevant, but do you have any pictures of your art that you can show?",
            "She didn't ask you for a favor, she asked you to do a job. Would she ask a plumber friend of her's to come replace the piping in her floor for free? ",
            "So she wanted a gift that you didn't give her? Let her badmouth you; it will only make her look bad.  ",
            "I'm glad to hear she hasn't been mentioning your name. That would be extra shitty if she was trying to compromise your reputation as an artist. ",
            "Has she or her husband got a job? Ask her if she would do $5000 - $7000 worth of work for free. It's ridiculous. This is your job, not a hobby.\n\nFamily drama is the worst, though, and can be super tricky.. Is there, perhaps, a way you could try and come to a compromise with her? A smaller, more simple drawing as a gift? ",
            "Paint her a really really shitty painting. ",
            "Say nothing to her at all.  Narcissistic personalities absolutely despise when they're not the center of attention.  Don't feed the troll. ",
            "From your description of her even if you drew/painted her perfectly she'll probably only find negative things to say about it. I bet she would find bad things to say about the Mona Lisa if she ever saw it. Sorry she's putting you through this and I agree with what others have suggested and let your husband deal with her this time. Honestly, the people she's badmouthing about you to probably already know she's full of shit since this is likely common behavior from her so I'd ignore her for awhile. ",
            "Paint a canvas black. Tell her you did a painting of her soul. ",
            "You are not a gold digger. Let's be clear on that. You're a normal artist wanting to protect the value of their time and energy spent on their work. It would be the same if you were a musician, or a photographer, or a writer. You decide if you are willing to give up your time and energy to create something that otherwise would be paying for your ability to live. She has no right to demand such from you on the basis that you did it for someone else. That's not how this works, and if she wants you to have a \"serious\" job that you can live on then she can't expect you to do said \"serious\" job without you getting paid if you choose. You will never make enough to support yourself if you give away your work for free to everyone connected to someone you gave work to one time.\n\nIf she expects free work, then she also has no right to determine what quality you should give her. She's getting it for free, so she should shut up and be happy with anything you spend time on to give her even if it's not up to your usual standards.\n\nAs for what you should do.. This may not be advisable, but personally I'd lambaste her on social media for all your friends and relatives (and hers) to see. She belittles your chosen career as being unprofitable, then attempts to guilt you into giving her free stuff because as a gift you gave another family member something that you felt they were worth. I'd make it clear that your normal cost is $5000-7000, that you'd offer a discount for family, that at no time did the sister ask you to give her that gift. You did so because you feel she is worth giving a $5000 gift to. People that belittle your profession then demand gifts are not worth $5000 dollars.\n\nThat may not be advisable. And neither is telling her to fuck off, but I'd probably do that too. So take my advice with a grain of salt.\n\nAlso, I highly doubt she'd give you $5000 worth of anything as a gift just because you asked for it.",
            "Ask her how she can reconcile the fact that she blames you for being a welfare queen and then doesn't want you to pay for your product.",
            "It's different when it's your job. You offered to paint the painting for the birthday. The entitlement that your MIL has in appalling that just because she asks for something she should get it for free. What does she do for work? Maybe ask her to do it for your for free.",
            "Clearly MIL is in the wrong here. MIL is also a bit of a crazy person. That said, here are a couple of things you could have done differently:\n\nWhen she started talking about her picture, you could have sneaked in a mention of a charge right away. Maybe something like, \"Oh, wait. Before you start, let me get a pen so I can write this down. I can work out a price estimate for you, too.\"\n\nBy allowing her to describe her whole plan first, you allowed her to get fully excited about it, only to have it all dashed. This was disappointing to her. Plus she was probably embarrassed at having shared something personal with you, only to have you say, \"Yeah. Nope.\"\n\nSo disillusioning her sooner could have reduced her tantrum.\n\nSecondly, by saying, \"No, the other picture was a gift,\" you suggest that she doesn't deserve a gift compared to them. Of course, in the circumstances she doesn't! But she feels rejected, having reached out to you.\n\nSo I would have given another reason in addition. Something like \"I've been very busy with paying work lately. I can't afford the downtime for a non-paying job.\" That way it's not just about her not deserving a picture the way someone else does.\n\n(But ultimately, she's a bit crazy, so there's not much you could have done...)",
            "If it starts negatively impacting your livelihood, I smell libel.",
            "I have a lot of hobbies. Some I also happen to use to earn a bit of extra money, some I just do for fun for myself. \n\nMy main hobby/tiny side business is metalsmithing. I learned how to do it years ago, and I've made a lot of jewelry and art pieces over the years. My MIL and my SIL have both wanted me to make things for them either for free, or deeply discounted. As in \"well I know you sell that necklace for $150 but I only want to pay $50 for it\" and when I said \"No, I'm sorry, I can't do that\" kept asking every few months if I'd sell it for $50 yet. MIL wanted me to make her a sterling silver bracelet for free. When I declined (silver is frigging expensive), she bought her own beads and then sent me a bag of loose beads with the expectation that I'd put it together for her. I simply didn't do it. I left that bag of jumbled beads on my workbench for months. Oh, and the repairs..\"I broke this necklace/bracelet/pair of earrings and lost half the beads but you can fix it for me for free right?\" someone once handed me an opera length pearl necklace and wanted me to re-knot the entire thing because it had broken. Pearl knotting isn't even something I do. I directed them to a jewelry store to get it repaired. I now turn down all repair jobs because I was sick and tired of coming in to work to find yet another bag of broken jewelry on my desk. My husband's co-workers were even trying to send home their broken jewelry for me to fix. I can count on the fingers of one hand how many people actually offered to pay for it, and usually it was \"$5 is good, right?\"\n\nI also crochet, knit, paint, garden, sew, and embroider. People always expect that I'll make them something for free, re-do or actually dig and plant their gardens for free, make christmas gifts for them to give to other people for free, etc..etc..etc..or if not free, a huge discount. It's incredibly irritating. I'm currently learning graphic design and I'm sure that's going to bring in a whole new set of requests as well. \n\nIt's one of the least fun aspects of having any kind of skill that people want to make use of. Particularly when it's family who want to make use of that skill and not have to pay a dime for it. ",
            "Deal with it as you would deal with any client. You don't work unless you get paid. If the client talks bad about you, try to clarify her in a polite way that what she's doing doesn't make sense and is wrong, and you can't work for free just because she wants you to do it. Whether she understands or not, do that and then move on. If she decides to pay you, then do it. Otherwise ignore the request and don't worry any more about that.\n\nSometimes the people of the family do crazy things. There's nothing you can do except accept it, try to avoid being affected in any way (you're lucky if you manage to do it), and move on with your usual life.",
            ">My husband hates family drama and is away right now at a conference where he as a lot of responsibilities. I don't want to put this onto his plate as well.\n\nIt's his mom, his responsibility. You handled what you could (and rather artfully, I might add) and the rest is family matters.\n\nYou don't just badmouth your child's relations while your child twiddles their thumbs or is left out of the loop. I'd be mortified to learn my friend or partner didn't alert me if one of my parents wronged them, and the thought of avoiding conflict from one of MY family members and allowing one of my CHOSEN FAMILY to eat the full burden is not something I'd ever entertain allowing to happen.\n\nIt's my \"fault\" people I know and love come into contact with my family on my behalf.\n\nFew people love conflict, but only the spineless let their conflict fall on someone else they purport to care about. I say this as the daughter of a narcissistically-traited man who has often threatened to disown me for crossing his path (and who has actually disowned family and friends before), by the by.\n\nDon't try to shield your husband from the actions of his own mother. He's known her all of his life, he knows how to negotiate with her better than you do. Let him do his duty as husband and child.",
            "Not entirely on topic, but could we see some of your art :) ?",
            "To a stranger you just met a 20% discount sounds nice, but for your MIL charging her $5,600 seems a bit scummy. I work in the IT field and when friends or family members have \"computer problems\" I don't say \"this service is usually $2,500, but for you - I'll give you a 20% discount\". Usually they're grateful and and up paying me *something* - but the money isn't the point when it comes to them.",
            "I would be disappointed if I were your MIL that you wouldn't do one for me for free like you did the SIL, but that would be the end. Slight disappointment. If you are doing them as a gift to some, it isn't unreasonable to think you may be willing to do it as a gift for others; however, she's acting like a completely childish psycho. You just need to wait for the husband to talk with her. I don't think there is anything you can do other then let him know he has to deal with his mother (again, I can imagine). She obviously doesn't understand the value of good art and thinks it's a trivial amount of your time/energy. I'm sorry you're dealing with that.",
            "[deleted]",
            "> My husband hates family drama\n\nHe might have to get over that if you can't handle the old battleax by yourself.",
            "I'm an IT Director and we have to deal with this all the time.  If you give your services away for free, that is exactly what they are worth.  I quote friends and relatives an hourly rate of $65-$125/hour depending on what the problem is and when they want it done.  When/if they balk, I ask them if they would expect a doctor/lawyer/accountant to work for free.\n\nYou did exactly what you're supposed to do.  You gifted your services to someone and there is no expectation at all for you to do it for someone else.  They have nothing to do with one-another.\n\nPersonally, I'd treat it exactly how it is - petty.  I certainly wouldn't worry my SO over it right now at the conference, and I *might* remember and care enough to mention it later.",
            "My advice? Print off all the reddit responses to read and highlight your favorites.\nAs an artist myself and a nurse, I can totally sympathize ....everyone wants a free oil painting and medical care.",
            "You did nothing wrong.  \n\nStick to your guns on this.  She's a shitty MIL, and 'giving' her this $5,000 painting will only make her want more in the future. \"Can you paint my entire house for free?  Every two years?\"\n\n",
            "Just out of curiosity, what factors lead to a 5-7 thousand price tag?",
            "I'm going to go against popular opinion here.\n\nI have been a professional artist for 40 years. I worked in various capacities for advertising agencies and then owned my own art studio. I now earn a living in commercial illustration, portraits and landscapes. \n\nThrough the course of my career, people have asked for free art. \n\nYou wouldn't ask a contractor to build a house for you for free, even if that contractor was your brother. You recognize materials and tools cost money, there will likely be outside costs, and the project will involve a significant chunk of his time and talent. Those same factors are true for an artist, but unfortunately many people view our profession as nothing more than a fun hobby. You LIKE to draw, therefor I am doing you a favor asking you to draw something for me. \n\nOF COURSE you have the right to ask for full payment! A 20% discount is quite generous. You can certainly post something on your website explaining your position and point the moochers to that page. \n\nBUT \n\nMy personal philosophy was, if it is for a legitimate charity or the good will of an important person (business or personal) then I'd do it for free. \n\nFree work builds good will. It is a common business practice. About 10% of my work, when I was employed by large NYC ad agencies, were freebies. We put as much time and effort (sometimes more) into charity work as paying jobs. It was seen as a cost of doing business - the same as networking, conferences, events, publicity and PR. \n\nI know your MIL did not support you. I know you'd like to kick her in the teeth. I hear that. I really do. But this is the type of thing you do for all of your in-laws BESIDES your MIL. She's hopeless. But she can stir up enough shit (and apparently is doing just that) to make everyone else miserable. I think you know by now that if I were you, I would have taken on the job - but ALSO explained that because you are so successful and can demand such high prices now, your work is not for everyone. You have to be very selective even with paying customers. Let it be known that as much as you'd like to you simply cannot reject any more paying jobs to work on projects for family or friends. \n\n\n\n\n",
            "Call her out on telling people Bullshit. And let her now you don't appreciate her lying. Include the fact that this is your job  not a hobby and if she didn't want to pay for it, she's not getting a drawing. \n\nIf your husband can't say the same thing after (I honestly think you should tell her this first) then you have bigger problems.",
            "Don't do it.  Don't care about what she is saying to other people.  Don't fall into the trap about caring about family bullshit.",
            "There's not much you can do. She's a shit and dumb person who have treated you like crap and you don't owe her anything. Ignore her and if anyone ask you about the situation, tell them the truth. Most people are not that stupid and will understand.\n\nThis can relate a bit to working in IT. People expect you to do shit for free and fix everything for them. One guy I don't even like asked me to sort out his personal pc during my vacation...\nI don't know what your MIL does or used to do, but perhaps your husband can make her understand by asking her how often she does her work for free. Don't know if it's applicable, but it's worth looking into. \n\nAnyway, she seems pretty toxic and I would not lose my sleep over her.",
            "What does she do for a job (if anything)?\n\nWhatever it is, ask her to do an extra week's worth of evening shifts (or however long it would take for you to do the painting) on top of her usual job; you know, as a favour to you. ",
            "She's throwing a temper tantrum like a child. I say just let her use up her steam and eventually she'll find something else to be ungrateful about. You just can't win with these types of people. They want the entire world to cater to their demands and will always attempt to play the victim. Don't bother wasting your time or emotions on such a person.\n\n",
            "yeah, what you did for your SIL was a gift. YOUR offer.  What you would be doing for your MIL would be a commission.  HER request.",
            "Make a painting where she looks bad and her husband looks good.  Be very proud of it so she has to display it prominently.",
            "I don't know the family but considering how awesome you were doing this for the sister for free I doubt anyone nice in the family will believe this MIL, it sounds like her personality will make it pretty obvious what really happened.",
            "Don't focus on her, focus on your marriage. Your husband may hate family drama, but i can tell, so do you. Protect your connection and your relationship first, then work on your MIL.\n\nWhen explaining this to your husband, best bet is to talk about how you didn't ask for any of it, and inquire if he can think of any reason she'd be mad at me. Approach it like an adult, not a kid. Explain, don't complain. (Not saying you are, just saying it's easy to do that when you aren't paying attention.)\n\nBest of luck.",
            "sounds like a narcissist, my old man is the same way, had a family member come in to do \"construction\" got but hurt when the discount was \"only\" $500.00  off a 15k dollar job. this is a full blown kitchen redo, wiring, plumbing, cabinets, counter tops, installation.. i called him a cheap asshole and to not even bother asking \"my family\" my mothers side to do things for him...i don't consider his side of the family family..",
            "OR , OR you make the painting, but do it very \"character cartoony\" over sized foreheads, imbelish little things that will make her self conscience, lop sided titty, one eye bigger than the ohter, receding hair, more grey hairs,  make his father look immaculate... ",
            "You should draw yourself as a welfare queen,  and then put her face on it. Hang it in the house... Invite her over... Rofl I'm sorry.  I think its ridiculous she's saying that.  Art is rare and intricate. You rock. ",
            "Don't do anything. Anyone who knows both of you will see right through her spin, and anyone who only knows her will only believe her anyway. If you try to approach her about it directly, you will just inflame the drama.\n\nNothing you do will make this situation any better, but if it's bugging the shit out of you, my only suggestion is to talk to your husband's sister and get her opinion. She could also (quietly) correct any misconceptions that her mother is causing, if it's really necessary. \n\nBut really, it's just a bunch of blowhard bullshit, and it probably won't affect your life much at all to ignore it and let it blow over.",
            "Don't say anything. People like her never respect an artist or a performer that isn't in the public eye at all times; they think if you're not ultra well known, then obviously it's just a hobby! You do this for fun, why are you charging me?? She had a low opinion of you and your work to begin with, so there's no point in engaging her further. Tell your husband you won't actively antagonize her, then don't antagonize her. Let her run her mouth to her friends about how DAER U CHARGE ME FOR ART, either they also know the value of it or they don't.",
            "I would just ignore her. Are you able to avoid her for the next week until your husband gets back? I really feel the best response here would just be to avoid her and not engage at all. ",
            "It seems like she doesn't want to pay for the art, so I would think about what you would be willing to create for her for free, then offer her that, telling her that is what you have time to do for her at the moment.  That allows you to take the high road.  At that point she can take it or leave it.  I think people like to hear what can be done for them, not what can't.  She is your MIL, which counts for something.",
            "I am so sorry that you are in this situation. I think I would be beating a dead horse to say don't contact her and let your husband handle it. I wanted to say thank you for protecting your value as an artist. Knowing and working for what you are worth is so important, and one of the reasons you made it to where you are today! ",
            "I don't think she realizes how much work it is.  The time you put in for that gift to your SIL that took a lot of time and effort, just as it seems she has also put in a lot of time and effort into you and your husband.",
            "Ideally I think to have truly avoided any possible drama you should have said something along the lines of \"Well, I really would love to, but in the past you've bad mouthed me and my profession. It really offends me that you would expect such a thing after treating me so badly.\" Before giving her any quote or talking about price or anything of the like. Bring up the underlying issue first. And then react from there. If she's insincere about her opportunity to redeem herself - you can tell her to fuck off. But you might, MIGHT have had an opportunity to have a moment where she realizes she was wrong and apologizes. \n\nI understand this woman was a huge bitch to you and it probably felt awesome to be a bitch back to her, but I always strive to imagine the ideal and most civil way to address these issues. Maybe it's not too late for a moment like this. \n\nOne of the big reasons I want to give you this perspective is because the top answers here are just validating yes men. It's often hardest and not satisfying to take the high road, but I always encourage it because it's the only door for the best ending possible. The rest of the answers demonize and dehumanize your MIL, side with you and don't offer any new or interesting information because they just want to validate validate validate for the fix. I know it's hard when she's been so mean but she's a person too, who gave birth to your husband and raised him. We should try to understand those who've wronged us in the most compassionate way we can, especially if it's someone important in the family like a MIL.\n\nHope this helps and I hope you and your MIL can come to some kind of reconciliation. ",
            "So she saw that you did something nice for your SIL and children, then demanded that you do something similar for her...? That kind of sounds shitty, does that woman have any concept of relationships? I don't know; this is tough. I would just not bring it up to your MIL, and if she gets nasty to your face, calmly explain how that was a multi thousand dollar project, and you can't just drop everything just because she asked. The gift was to your SIL and only her for various reasons, but that's why you did it. She didn't impose that you draw for her, you did it as a gift. Also, I'm not sure how your family dynamic works but I would reccomend not bringing it up to anyone unless they bring it up first. Don't badmouth your MIL, just logically explain the situation. Don't complain about it to other people. I can't see a single person actually siding with her, but again I don't know your family dynamic and neither does reddit. Make sure to keep that in mind.....For her to put you in this situation and demand a favor that huge was manipulative and shitty though\n\nGoddamn, I'm studying accounting in school...Can't wait until family asks me to do their taxes for free on my days off after doing taxes 70+ hours a week. One word for that: nope.",
            "My default response is now \" I only make what  I feel like making when I feel like making it\" the sheep was amazing. Great pattern really easy. Looks wonderful. But it took my life. I have no desire to repeat something that time consuming now. I want to make different  things. Sometimes I'll see a pattern and want to try it so I'll make it. I made oggie boogie recently because the pattern looked fab. But I'm not a nightmare before Christmas fan really so I gave it to a mate who is. ",
            "I would do a small one and make her super fat and ugly. ",
            "Draw her and exaggerate her less flattering features. That will teach her. ",
            "[removed]",
            "Do what marge did for mr. burns.",
            "Paint her for free. But don't paint her how she looks physically. Paint her how she looks on the inside... selfish, petty, jealous, and spiteful. ",
            "Badmouthing you to whom? Gold digging where and/or what exactly? Painting a portrait is many, many hours of work, and contrary to your MIL's belief, most people know this. Don't take her too seriously, the people she's complaining to won't either if they have any grain of common sense. And if they haven't, they don't need to be your friends anyway.",
            "I would reach out to your SIL. I'm sure she was very happy with her painting and knows how hard you work. Approach the family with their family and you might be able to get them to understand another point of view. (If this MIL is as crazy as you say, I'm sure everyone already thinks she's full of it anyway) Reaching out to your sister-in-law might even get her to comment on the mother's FB post and enlighten people of the real situation. ",
            "it is common for the mother-in-law to fight with the son's wife for his affection.\n\nyour husband needs to tell your mother to knock this shit off. that if she loves him, she needs to respect his wife.",
            "Do nothing.  Everyone in this woman's life knows exactly who she is.",
            "if it makes you feel any better, r/techsupport feels your pain. we're all expected to set up crap for friends, family, everyone just because \"hey you know computers!\"\n\n$^#& off. I do that at work all day I don't want to come home and have you force me into doing it more. MAYBE if I'm feeling nice and offer. maybe.",
            "You are an artist commanding a fine sum and it is your career. \n\nI am a MIL. I would never, in a million years, ask you to do this. Seriously. \n\n",
            "Just ignore her, man. You don't owe her anything, not even an explanation. If anyone you actually care about asks you why, tell them that she's spent the entire duration of your marriage badmouthing your life choices, and then turned around and decided she wanted free artwork with a value of thousands of dollars. ",
            "I've had something similar happen to me.\n\nSomeone once asked me to paint their dog and we agreed that she would pay me. I kept insisting down to the last second that she could pay me whatever she wanted. She kept saying \"no, its your art, name your price!\" So, I finally gave in and decided to give her a price. I don't paint for people often so I discussed it with my mother and grandmother. Grandmother suggested $100, mom suggested $40, so I found a comfortable place for myself and said $50. I go up to her, give her the price I decided and she pauses, gets this shitty fucking disappointed look on her face and says: \"ummm, what about $40\". Here's the embarrassment I tried to save myself from by FUCKING TELLING HER TO PAY ME WHATEVER SHE WANTED. \n\nThe story doesn't end here. She actually went around saying I charged too much to paint. THE NERVE!!!! \n\nMoral of the story? Assholes aren't going to stop existing. Charge what you feel is appropriate for your work, and if they put up a stink then they don't get to enjoy it. Simple as that.    ",
            "Nobody who is sane likes drama, but sometimes it needs to be addressed in order for it to go away. Sounds like he's never really stuck up for you, maybe it's time he had a come-to-jesus talk with his mum.",
            "I am way late to this thread, but how long would it take to do?  Including all overhead, billing, replacement of supplies, ect...",
            "From what you are saying, she seems to be acting childish. My personal opinion is that this should be ignored rather than escalated. I think venting about it to close friends or your husband would be helpful but assuming the people she is talking o are mildly intelligent, they probably know her tendencies and take what she says with a grain of salt. Engaging in this would make it hard for people to differentiate who is acting childish. ",
            "Ignore her, honestly.\n\nI highly doubt many people whose opinion would actually matter to you would take her badmouthing seriously.",
            "This may or may not be seen, but OP it sounds like you have a very difficult MIL to deal with.  Do you have any advice on dealing with her in general and has she effected your marriage a lot? I'm asking because I love my boyfriend very much, but sometimes the thought of marrying him scares me because of his mother.  Any advice would be awesome.",
            "Ask for $7000 worth of whatever she does for a living, and then kick up a fuss when she expects you to pay for it.",
            "Pardon my french, but fuck that bitch.  Smile and move on.",
            "is 'hating family drama' code for 'doesn't defend me to his mother'?  you say your husband doesn't know about her badmouthing you, but i can't imagine how that's possible seeing how far back it goes.  if he *does* know about the past incidents, why have they continued?  also, what does his sister think about the whole thing?",
            "Maybe do one but very very bad or a small one. \nTell her :here you said you wanted free so this is what you get for free.",
            "Your husband needs to get involved. She may take him seriously. ",
            "seven thousand dollars?  i'd love to see your work! ",
            "Fellow artist here!! She's so far in the wrong it hurts. I suggest just shrugging it off, and just doing your own thing. Seems to be working, so far!!",
            "In your spare time, make one for fun...\n\nMake FIL look normal, but give MIL a really asymmetrical face (some features enlarged or reduced and slightly out of alignment so she looks really lumpy).\n\nKeep in in your house, but don't put it on display until family comes to visit, and then put it up in the guest bathroom across from the toilet.  \n\nI think that would be fun.",
            "I think everyone hit the nail on the head, she's not exactly a fan of you, but unfortunately theres not much you can do to change that. Unless she starts badmouthing you to people you know or care about, I would just let this go, as its not worth the drama that would come out. On a side note, I was wondering if I could see a sample or a piece that you've done? To be honest, I'm not very appreciative of art myself, but I'd love to be blown away and proven wrong.",
            "kick her in the teeth.",
            "You are a professional artist and I think it's perfectly reasonable that you didn't want to do it for free; this is your job and you should definitely be getting paid for the work you do. To your SIL you gave a gift but that's totally different to what your MIL is asking of you. I wonder if she'd ask any other professional people she knows, like a doctor or a builder, to do a considerable amount of work for her for free?\n\nSounds like your best bet is to first talk to your SO about this in-depth, ask his advice on handling his mother. He may hate family drama and he shouldn't have to get involved but if his own mum continues to be this disrespectful and rude to you he may have to. I'm hoping he sees his mum's behaviour towards you is not appropriate, at least. It may even be worth asking your SIL for advice too as you seem to get on quite well. You may feel it best not to involve her though.\n\nDepending on what he says, it may then be worth talking to the MIL directly and telling her you do not appreciate her rudeness and further explaining the quoted amount (explaining that canvases and art supplies aren't cheap and that drawings take a long time, etc). Though maybe, depending on the sort of person your MIL is, this may not help.\n\nBest of luck with whatever you decide to do.",
            "She is out of line. She asked you to do your job for free. A lot of people seem to think that just because you get paid for a skill or trade means that they are exempt from paying you. The people that she's telling are more than likely aware of this, if not screw 'em. It isn't affecting your business or livelihood and can wait to discuss with your husband until he returns.",
            "So...you're a gold digger for expecting to be paid for doing work?  Does she know what a gold digger is?  ",
            "Update?",
            "I wouldn't worry about it. Drama queens love drama. You are a professional, why would you give her a $5000-7000 piece of artwork for free? Especially now, or ever in the future. Maybe she should have been nicer to you all these years!   She wants you to commit time to a project you won't get paid for? \n\nThink of your husband and try not to stir the pot with arguing with her or talking about it.  If he catches wind of this, just say that you didn't know she would blow it out of proportion.  You gifted the art to your SIL, it wasn't an obligation or a demand. Your MIL is demanding free art - is she some sort of welfare queen? doesn't she want to pay for her art?  She is acting entitled and pushy, and then butt-hurt and vindictive.   \n",
            "Easiest solution would be to talk to your husband and find out what he thinks of the situation BEFORE you ask strangers on the internet who will give you horrible advice :D Enough with the snarky comments, but I'm serious. It's his family as well. If it were my mother acting like that towards my gf/wife I would take matters into my own hands and show here some proper respect...",
            "She probably wants the drama. Ignore her. If anyone asks you about what happened, or gives you grief about it, explain what REALLY happened. ",
            "i havent seen a comment yet about this yet, but it could have legal ramifications. if you can prove that her slander is costing you work you could have a case on your hands. \n\nas for your husband it doesnt matter if he doesnt like drama, its his mother, you need to tell him about it, he needs to straighten his mom out and you dont even acknowledge MILs existence until he does.",
            "She sounds like a Narcissist, plain and simple. I could write paragraphs about it, but I suggest you simply do a Google of Narcissistic Personality Disorder.\n\nIf this is a constant pattern of behavior, which it sounds like, you probably can't change her. People like this don't have revalations and suddenly become nice people, nor do healthy people obsess so much about people they do not like.\n\nNow, how to deal with her. First of all narcissists do this kind of shittalkibg constantly, and they can be very good at it (telling very convincing lies, etc). You absolutely should not get into a war with her on this front, as you shittalking her in return will only legitamize what she's doing. Instead, act surprised when you hear about her gossip and gently correct any lies. Also do your best to say *good* things about her (even if you don't really mean them, but do practise your \"acting\"), and even compliment her.\n\nYou may feel like a bitch doing this, but in reality you're undermining her believability. It really looks poorly on someone when they shittalk a person who says nice things about a person. It makes them look untrustworthy, bitter, and unfriendly.\n\nIf she escalates to openly engaging you, break off contact with her and sadly tell everyone how you really want her to like you but can't seem to win her over.\n\nIn other words, do the opposite of what she's doing to cancel it out.",
            "Yeah, someone who wants to commssion a portrait *of themselves* is probably not a great person.  Usually you have a portrait done of someone you love or want to honor - maybe it's herself she loves the best.",
            "Speaking as someone who knows lots of artists, title sounds like your MIL is a jackass.\n\nAs for how to handle this, it sounds to me like she's been handling it for you, if she's actually so self unaware that she's actually telling people she demanded free work from you.\n\nI really doubt you are the only one she's been judgy and nasty to over the years. I also doubt that her sense of entitlement stopped at your time and art.\n\nSo my advice is don't worry about it. The people who matter will instantly know that her story is exactly that - a story. Because they will have seen her in action and she will have pulled crap like this on other people.\n\nIf there are those who believe her wholeheartedly, they probably aren't the kind of people whose opinion you need to care about. \n\nIf anyone asks you directly (or brings it up) just ask them for $6k and several days of their time, as a gift. When they look at you with total disbelief, say \"That's what she wanted from me.\" If that doesn't get it through their head nothing will.\n\nOtherwise, ignore her antics. She can't actually do anything other than be nasty, and by being nasty she is hurting her own reputation not yours. ",
            "This is extremely petty. It comes down to how much do you value your relationship with your MIL. If you want to change it for the better, you need to initiate, because from this post you seem to victimize yourself unduly. \n\n\n\nShe disrepected your profession, but you countered it with being successful, proved her wrong. Now how about let bygones be bygones and start the healing process? What else are you waiting for, her suddenly admitting you're right? Why don't you have the bigger heart and do something nice DESPITE your MIL's previous antics?",
            "I would write a letter to your MIL and make a copy for yourself. Just explain your feelings and take time.\n\nThe time that you put into the letter will let you sort everything out and put it down clearly and concisely, more for you than your MIL. If your MIL decides to twist what was said in the letter and if someone approaches you just offer to share the letter with them if they are questioning it.\n",
            "MIL SIL? i haven no idea what these terms mean. ",
            "Here's an unpopular opinion:\n\nIf OP were a fast food server or fast food kitchen worker & the MIL asked for help serving at an event all day or prepping food most folks would see this as standard favor stuff, and while not owed to her, the simple \"no\" would make more sense than to quote the rate she is paid at work. \n\nIf your materials cost a lot that's one thing, but if you value your skill and endproduct and time that much higher than a minimum wage worker (or spend months on each drawing) -- then a part of that equation is you get to be resented by those who aren't similarly valuable for their special abilities. \n\nWhen the people mention how unsupported she may have been of the art I can't help but wonder if it matters that the husband likely works in a field where he is more of necessity than he is valued..\n",
            "ehhhh I know I'm going to get hated for this but I think you should have done the painting. It could have been a way to bury the hatchet and get her to respect your profession. She was soo impressed by the painting you did she finally respected your skills and wanted to be involved.  \n    You should have told her you would paint her one for her birthday just like your niece, and you only do free painting for special occasions for people whom you care about. So you wouldn't have had to do it right away and mega MIL brownie points.  \nEdit: She handled your response very poorly and probably isn't the greatest of people. But I believe compromises must be made when it comes too family.\n   ",
            "If ur MIL is as u described her, u don't owe her anything. She is a horrible person, talk to ur SO when he returns from his trip. Tell him to handle the situation, my wife and I handle our own parents to avoid this exact thing. Work very well for us, that way neither of us is put in awkward situations. ",
            "You just have to weight in how much she's done for you in the past vs the favor she's asking you. Despite the criticism she's given you, has she been a nice MIL in general? Has she been generous with you in the past. We often only remember what WE'VE done for others and not what OTHERS have done for us.\n\nThat should really help you have a better position on this issue.\n\nYou need to be able to talk to her and make her understand your point of you. Or just do it, because honestly, no matter how right or wrong one can be, it's not worth the bad tensions that will arise from all of this.\n\n",
            "How about you talk to her about it. You know, like a fucking adult?",
            "Gotem. Stick up to yourself. Once you let the in-law walk all over you, it's over. They need to respect you. Maybe if she admits her wrongdoings and talking down on you as an artist and your path of choice for a career then MAYBE she'll get a free painting. But for now, I don't see any reason to back down. MAYBE if it was her birthday as well. But based on your description, she does not desrve one. ",
            "Paint what she wanted and hang it in your house OR donate it to an auction. \n\nedit: Don't actually do this. IMO do the painting, you're stuck with her until she dies. Just make it clear: \"Everyone gets (1).\"",
            "I am an illustrator and I don't do free work even for family.  The second you do it for free for one person, everybody expects it.  It's the same with IT.  In the future NEVER do it free, even as a gift. Just buy people a gift instead, it will save you a lot of headache in the future.\n\nThat being said, to remedy the situation ask the MIL in law how she would feel if you asked her to do her job for free.  Judging from the info before this event, the MIL will never respect you anyway and will badmouth you either way.   If she still really wants the drawing offer an exchange of services rather than money, or offer to do it for her birthday or Christmas."
        ]
    },
    {
        "post_id": "7k4gy3",
        "author": "AchaeanAnolis",
        "title": "My [19F] pregnant SIL [26F] is cold and short with me, but kind to everyone else",
        "url": "https://www.reddit.com/r/relationships/comments/7k4gy3/my_19f_pregnant_sil_26f_is_cold_and_short_with_me/",
        "score": 2036,
        "num_comments": 167,
        "created_utc": 1513391172.0,
        "selftext": "Using a throwaway just for privacy reasons. Sorry if this gets long at all.\n\nMy sister is a lesbian, and married her wife a year ago. They receive financial support from my parents (they're wealthy, and generous), have good jobs, and as such, have decided to have a baby. Currently, her wife is about six months pregnant, and the two of them are visiting for holidays. I'm in college, so I don't see them very often (yes, my parents give me financial support as well- everything is fair and square), but I'm really excited for their baby. My sister and her wife had been dating since their senior year of college, and were friends since childhood before that. I'm 7 years younger, so I was kind of left out of the loop. I never knew my sister's wife until they got married, and even then, I was swamped with my first year of college, so I didn't *really* ever get to know her. I was really excited though for this trip, since we'd get some one-on-one time together!\n\nOur parents live about two hours away from my sister and her wife, and I flew in from across the country. We're all staying with our parents, who are not yet retired. My flight got in yesterday late at night, so I slept in. My parents went to work, my sister went to go do some shopping. My sister-in-law stayed in with me, but I didn't realize she was around until she came downstairs while I was making lunch. She's pretty obviously pregnant, and I haven't seen her since her wedding- so I was really excited to see her. She was not. I said hi, and went to hug her, and she backed away. I apologized, and she just kinda looked at me weird, and went looking through the fridge.\n\nI tried to make small talk with her, so I asked when she was due. She gave me a really weird look, like I'd asked what her cup size was, and then just said March and kept making her food. I said I was really excited to have a niece or nephew, then asked if she wanted a boy or girl. She sighed really loudly, said she didn't care, and moved on. My sister had mentioned that her wife had PTSD due to a previous pregnancy, so I worried that might've been it. I tried to shift the subject, and asked how her work was. She set her knife down really loudly, stared at me for thirty seconds, then said \"fine\" and went into the dining room without saying anything else.\n\nThroughout the day, I kept just trying to interact with her. Offered to get her a drink while I was in the room, she just muttered no, asked what she was watching, \"you wouldn't know it\" (it was the *Simpsons*), said I was really glad she was spending the holidays with us, a very begrudging \"yeah.\" Really, I thought this must just be how she is. Then, my parents and sister came home, and she was super cheery and nice to them. My dad was asking if they had names picked out, and she just wouldn't stop chattering on. My sister said she wanted a family name, and her wife insisted on a unique name. My mom pointed out that my name (Anais) isn't very common, but it's also a family name (same as my grandmother), and they should consider it. I said I wouldn't mind having a niece with my same name, and my sister was really enthusiastic about it. Her wife gave me a death glare.\n\nI just ended up getting the silent treatment! At dinner, I asked if she would pass the potatoes, and she didn't listen. I repeated myself, she ignored me, and then my sister told her I had asked for her to pass the potatoes. Suddenly, she was all bubbly and giggling \"guess I didn't hear!\"\n\nWhat do I do? Should I tell my sister? Directly challenge her? I have very positive relationships with my parents and my sister, and I want to be really involved with my niece/nephew, so I really don't want to go 100% no contact or anything. How can I try to resolve or at least get over this?\n\nTLDR: My sister's pregnant wife is weirdly cold and kind of short with me. What to do?\n\nUPDATE (as of this morning): So, we all had breakfast together. I sat across from my sister, between my parents, with my SIL kitty corner to me. My SIL actually SPOKE TO ME!! But it wasn't all that positive. She asked if I was seeing anyone, in kind of a snarky tone. I said no, school was really busy, I just didn't have time, etc. She responded, \"Well, not everyone finds someone.\" My sister tried changing the subject, asking my parents whether or not they'd gone to their winter home yet (they're those rich people). My SIL was *so* nice to them. She was saying what a gorgeous house it is, how grateful she was to have been able to take a vacation there with my sister last month. My mom is easily flattered, so once my SIL got started, she started gushing about her, and it was just a mush fest.\n\nAfter breakfast, I offered to go take our dogs for a walk. When I came back, my parents had left with my sister to go shopping again, and my SIL was the only one home. She asked me how I was liking college, and I said I was liking it a lot. I major in pre-dental, started talking about it a bit, and she rolled her eyes. I apologized for oversharing, and she said, \"No. It's fine. You just have a problem with reading the room, I guess.\" Then, she walked away. When my sister comes home, I'm definitely going to tell her about it.",
        "permalink": "/r/relationships/comments/7k4gy3/my_19f_pregnant_sil_26f_is_cold_and_short_with_me/",
        "comments": [
            "Whaaaat the actual fuck. I would talk about this privately with your parents and your sister. Because honestly, it sounds like there is a big underlying issue. Had you ever met her before? Even just briefly? ",
            "“Sister, you noticed that strange moment at dinner with the silence from your wife when I addressed her. I was hoping it was a one-off but she’s actually been pointedly cold and short with me since arriving. It’s important to me to be part of your life and part of your support system. I love you a lot so I’m asking if you know of any reason why I’m feeling very dismissed by her behavior.”\n\nThat’s what I’d say. She was pointedly, publicly rude to you. \n\nIf she’s rude to you again, before or after you address it with your sister, call her on it kindly. “Is there an issue here I’m unaware of?” Ask it gently but with confidence. This is your home and your family, and you dont deserve her treatment, pregnant or not. If she denies it, “I’m glad to hear that. I’d hate for any issues in our family seeing as we all love you”. She’s being a brat.",
            "Your situation actually pissed me off while reading this. Omg. I'd have a conversation with your sister and parents in private. Not sure how your family dynamics work, but I really think you should have a talk about this with the most appropriate person to go to. This is **not** okay.",
            "just ask your sister privately 'have i done anything to offend your wife? shes kindof short with me, but thought it might just be because she tired with the pregnancy. im trying not being sensitive here, because i really want to spend more time with you both. i just want to know if theres anything ive done wrong'",
            "So you said that the longest time you spent with her was camping (from a previous comment) and the wedding. Could you elaborate on the wedding? Did you interact with her at all? Were you in your sister’s bridal party?\n\nBut I agree with other commenters, you’ve just gotta talk to your sister and/or parents to see what can change to make this better for the rest of your stay.",
            "You'll never know unless you reach out to your sister, but here's an uncomfortable possibility: just because she is your sister's wife doesn't mean she will ever be nice to you, or kind to you, or sisterly with you. Which is a crying shame because you sound quite nice and like you've been trying, so absent some backstory where you drop kicked her dog off a balcony, who knows why she's like this to you? All you can do is be polite and kind to her at all times. But it is very clear she doesn't want to be close with you. \n\nYou are entitled to her being polite to you, though, so for that reason alone, if you are close with your sister, just ask her in person if there's any reason you may have offended or hurt her wife. It may not fix anything but it should put her on notice for things like passing you the frigging potatoes. How petty of her.\n",
            "The only thing that I can think of is that maybe SIL got used to the family dynamic while you're away across the country, and your presence is a harsh reminder that she's not a \"real\" daughter, and you are.  It could be jealousy coupled with pregnancy hormones, like somehow you're challenging her place in the family.  \n\nAnyway, I'd ask your sister first.  \"Have I done something to offend Patricia?  It really seems that she's upset with me about something, but I really can't figure out why.\"  And if your sister doesn't know or won't say, you can gingerly ask your SIL herself.  ",
            "After reading the update; next time she makes a snarky comment like that just respond with “have we got a problem?”\n\nIt’s important to learn in life how to not let people treat you like shit. There is no need to be abrasive or rude in to her, just call her out in a serious tone. You’ll find a lot of people will immediately stop treating you badly when you learn to do this. Mostly because they’re only acting the way they are because they think they can get away with doing it to you.\n\nI learnt this in my mid 20s, I should have learnt and practiced earlier. Here are a few other phrases you can use which are effective\n\n“I beg you’re pardon?”\n“Wow, I can’t believe you said that out loud. You must be really embarrassed” \n“If you would like to sit and talk about your issue with me then please take this opportunity, if not then I suggest you stop treating me this way”\n",
            "Talk to your sister and ask if your SIL has any issues with you. That being said, you can't force her to like you. All you should expect is that she stays civil with you when you two have to see each other.",
            "I would suggest having a conversation with your sister and your parents and mention the things you’ve noticed here, but perhaps frame it in a way that maybe you are being overly sensitive and ask if they can observe her interactions with you to see whether they think it’s valid. That way they can keep a closer eye on your interactions and address it with her from their own observations. ",
            "How was your relationship with your sister growing up? How old were you when she came out to the family? The only thing I can think of that leads to your sil not being crazy is that your sister has shared her perspective on things that happened in the past and now she is holding a grudge for the way you treated her. ",
            "Obviously:\n\n- She is nice to your sis because she is her spouse\n- She is nice to your parents because they are very wealthy\n- She hates you because you are the heir to half of their estate\n\nSometimes, things are that simple.",
            "Just read your update - she has a ***serious*** problem with you and it is really annoying. Holy shit what a b word. I know a lot of people disagreed with my comment to record her but hopefully I am wrong and your sister believes you. Good luck! Stay strong!",
            "I would ask your sister if she’s aware of any issues her wife might have with you because you’ve noticed her being very cold and standoffish with you but warm and friendly with everyone else. I would also ask her not to say anything to her wife just yet and first observe your interactions with your SIL for a day to see if she notices anything, and then she can address it with her wife. \n\nI don’t think your parents need to be involved just yet. It’s an issue between your SIL and you, and your sister is the connecting factor. The parents come in when it’s confirmed, dedicated hostility that isn’t going to change. ",
            "Reading this made me upset, you have the right to ask your sister what’s up. It seems like you haven’t done anything to upset her so it’s really confusing, like somebody here suggested you should show your sister this post.",
            "Any sympathy anyone could possibly have for your SIL should be gone after that update. \n\nDirectly asking you how college is going, and then rolling her eyes and scolding you when you answer? That's full on schoolyard bullying. Not someone who's just having a bad day or something. Not someone who's just \"introverted\".\n\nDefinitely talk to your sister, but do so diplomatically as others have suggested. If nothing changes or your sister takes her side, honestly at this point you should talk to your parents. SIL is being rude and antagonistic toward you in your own damn home, and that's not okay.\n\nThe way she acted in that update is honestly unbelievable.",
            "1. She looks down on teenagers as annoyances. I know a lot of pretentious, immature people in their 20s who totally do this. They go to a bar in a college town and hate on younger people for no reason.\n\n2. Jealousy. Are you more conventially attractive or thin? Is her body changing considerably? \n\n3. Your sister told her stories, and SIL decided to view you as the bad guy. \n\nNo matter what it is, bring it up to your sister, alone and in person. ",
            "I'd be tempted to call her out when she does the blatant stuff infront of your family, like the ignoring you at dinner when you asked for potatoes.\n\n\"Ohh! I must not have heard her!\"\n\n\"No, you definately did hear me, and chose to ignore me\"",
            "Do you and your sister get along well? Did you do something that might have upset her? Your SIL might think badly of you because of what your sister told her. Or she is just not nice with you because she can. She has to be nice to your parents because she receives financial help from them, so if she doesn't actually like your family she can unleash that on you.\n\nIf you feel like that would be ok, you can try talking to your sister about this, but unfortunately you shouldn't expect your SIL to end up liking you.",
            "Talk to your parents and sister in private. If she does it again, publicly, call her out. Be respectful and even toned but say \"you know what, I don't know what your problem with me is. I've been friendly, cordial, and respectful. You have ignored me at best and been openly rude at worst. If you wish for me to not speak with you, fine. But I will not be treated with such callous disrespect in a home I have just as much a right to be in as you do.\"",
            "How did the talk with your sister go? Very interested in how this played out.",
            "Maybe you should just directly ask SIL when you two are alone. \"SIL, I don't mean any trouble, but have I done something to upset you? If so, I apologize\" and go from there ",
            "I haven’t seen this suggestion yet, but I would ask for a private audience with your sister and her wife and just pointedly ask ‘What is the problem?’ in a polite, confident and tactful way. Don’t apologize for any of your actions. Let her do the talking, call her out on any BS she spews. This woman sounds like a royal B. \n\nIf she says her reactions to you are PTSD related I would consider an apology for any triggers that may have been hit, but I would also ask why she feels more comfortable talking about those things with *literally* everyone else but you. Ask her how she would prefer you to broach the subject. You’re going to be an aunt, your niece is family and is important. She needs to get that. \n\nMaybe she’s a super crabby morning person? Doesn’t excuse her behavior. \n\nShe owes you an apology. ",
            "Why the hell arent you calling this bitch out in YOUR parents home? Call her straight out and ask her what her problem is. People like this need to be dragged kicking and screaming to be decent and she deserves no mercy. If you let people treat you like this unaddressed then they will. Put a stop to it immediately. ",
            "> Should I tell my sister? \n\nDefinitely. Tell her exactly what happened like you told us and ask her what the eff is going on with her wife.",
            "People love to complicate shit.\n\n\"Sister, did I do something to antagonize your wife? Because she's being fucking weird.\"\n\nFin.",
            "You should really bring this up with your parents and then your sister. Your sister-in-law sounds two-faced and could be sucking up to your parents/sister due to the financial aspect of the relationship (not saying your SIL is a gold-digger, but there's no risk to her in treating you coldly like there is with your parents/sister). \n\nI say parents first as they're more likely to be unbiased and listen to you, where as your sister will likely have rose-tinted glasses on. However you go about it, just make sure you don't stay quiet on this subject as your SIL could be a part of your whole life, and you don't need a thorn in your side.",
            "I would do two things in order:\n\nFirst, I'd ask your sister if there was something you did to upset her wife.  It doesn't sound like there was, but who knows.\n\nIf your sister has no good answer, I'd ask the wife the next time you have some alone time.  \"Hey, did I do something that upset you?\"  It's possible she classified you as the annoying little sister and hasn't considered that you're no longer 11, or it's possible she's a jerk.  Or maybe there's something else.  Whatever the case, I'd try to resolve it with her directly, and if you can't, I'd write her off.",
            "Next time she does that, defend yourself. Make it blatantly obvious to everyone that she is kind of bullying you by making you feel excluded in your own home. In front of everyone, try and make conversation with her and have everyone see her brushing you off. If she ignores you afterwards and then says guess she didnt hear you, just straight up and not in an accusatory way say \"I've been trying to make conversation with you all day to make you feel welcome, but I've been shafted all day and Im not surprised you didnt 'hear me' for the milliionth time today. I dont know why you feel that acting this way is appropriate, but I dont have any animosity towards you. If you feel like apologizing or developing a relationship, Im always open but I cant take any more cold shoulders in my own home\". Go to your mom, shake your head and just say that you hate bullies. \n\nLet me tell you, girls who feel comfortable with these micro agressions and bullying do so because no one stand up for you, especially not yourself. When you do, thats when they stop. Fuck asking if the wife is mad or annoyed at you, you deserve better than to chase after her btch ass. ",
            "I would talk to your sister and just keep in mind that in life not everyone is going to like you without really getting to know you first.  The only way SIL has interacted with you were camping when you were a kid, her wedding where she was super busy being a bride and this moment you have described.  She may just need more time.  \nA side effect of being obviously pregnant is that for a lot of women they become “public property”.  A lot of strangers feel entitled to express opinions about their body, their baby and will even touch them.  Meanwhile pregnancy takes a toll on your body and I feel like around the holidays a new mother is still expected to be “on” when it comes to family gatherings.  Maybe she just needed some introvert time watching TV.  \n\nI’m also surprised no one brought this up but I found the whole name conversation thing to be really weird.  You didn’t mention the names SIL suggested but did tell us about your family wanting to name the baby with your name.  What if SIL has a special name picked and 4 people including the 3 most important people to her just strongly suggested using a different name?  It was not your intention but she may have felt outnumbered and not even able to name the baby that she’s currently carrying.  ",
            "Did she go to college?  Just noticing a pattern, from her perspective:\n\nYou didn't get to know her early on because you were busy with college.\nYou asked her to change her wedding date because of finals (college).\nYou stopped talking to her at the wedding so you could go talk about college.\nYou clearly annoyed her again today by talking too much about college.\n\nCollege seems to be a huge focus of your life.  If she has any hangup about college (ie didn't get in, couldn't afford, etc), the whole thing would probably be tough to take from her end.",
            "Your SIL doesnt like you, for some reason. That much is incredibly clear. You could ask her directly if you did something to upset her but I would suspect, given what you've written, that she wouldn't tell you what the issue is. \n\nI would suggest talking to your sister and telling her basically what you told us. That you understand that preganancy is a rough time but that you were concerned that the short behavior seems only directed at you (give your above examples). You want to be there for your sister and her wife so if you've done something upsetting or offensive, you would like the opportunity to know about it and correct it. \n\nDid you ever express a dislike of your SIL or uour sister being gay? Is it possible that SIL thinks you're only interested in your sister or SIL because of their baby? ",
            "She sounds like real B-word and Idk why you keep trying to talk to her. When someone gives you a vibe to eff off then listen to them. Treat then the same way they treat you. Otherwise confront her. She sounds very immature. I would at least tell my family, \"Hey shes super short with me and I can tell she doesnt like me so Im just going to pretend she doesn't exist.\" I wouldnt respond to her passive aggressive bs. Update us please.   ",
            "Personally - I'd record her interactions with you. Quite frankly I can't imagine anyone would believe you - not because they don't trust you or anything like that but more because she's SO BUBBLY with your parents and your sister. How could she not be like that with you? You know?  \n  \nI would do that before talking to anyone. It sounds insane... but you don't want to be the odd-woman out if you can't provide proof that she's treating you that way. She could very well start acting super bubbly with you in front of everyone (if she finds out that you told your sister about her) and then practically kill you with her stare when you're alone with her.  \n  \nNot going to lie... but she sounds a little... mental.",
            "I would suggest a talk with your sister privately. And I'll ask her to discretly pay attention to her wife behaviour with you next time all the family is together. Don't show her this post, bad idea. And after, if she doesn't react, talk to your parents. Your SIL seems crazy.",
            "It's not about tattling. Go speak to your sister alone. Mention the unexpected treatment and ask if there's something you missed or that you should know about.\n\nThe fact that your sister spoke up about the potatoes is a good sign.",
            "I would probably ask SIL in private. You’re all adults, it might go over better than going to your parents or your sister.\n\n“Hey SIL, have I done something to upset you? I feel like you’re upset with me and I really would like the opportunity to resolve this as I’ve been so excited to spend the holidays with you and sister”",
            "Could it be your sister has been badmouthing you to her? It really seems she's got a bone to pick with you. It might be a longstanding grudge from one of the two, for something you might have forgotten.",
            "[deleted]",
            "Depends which one you're more comfortable with, and/or which is more logistically convenient (ie who you'll have time for a chat with alone soon) who comes first, but I would talk to your SIL - heya, I figured you were tired and stuff but then you seemed different with the others, have I done something to upset you? - and your sister.",
            "Just let your parents and sister know you can't help but notice SIL doesn't treat you with any kindness. Ask what you may have done wrong.\n\n\nThen personally I would be petty and call her out every time she does it, \"Okay, or just glare at me, that is fine too.\", \"That's okay, next time I'll ask someone not blatantly ignoring me, that's my fault\". But only in the moments it happens, then just go right back to being your friendly, sisterly self. \n\n\nThen when someone (SIL) inevitably gets upset and points at you saying you're being rude/mean/whatever, \"That's how I've been feeling about your treatment of me. It's not nice, it's not equal\".\n\n\nBut that's just how I got my sister to see that she's being a jerk to me, obviously it doesn't work for everyone :P",
            "My brother-in-law doesn't like me; never has; he even threw me against the wall when I was a kid. The guy has mellowed a little over time, although he's still a dick in many ways -- sometimes people are just assholes. Clearly he's one of them. Looks like your SIL is as well.\n\nMy advice is to have limited to almost no contact with her. You can't win her over; your parents and sisters are enabling this bad behavior; and no matter what you do you can't win. So don't play the game.\n\nIn fact, I would text or email the whole family the following: SIL is and has been exceptionally rude to you and that you are extremely disappointed by their enabling this ugly behavior and not defending you. Make it clear you acknowledge you may have to interact with her at various functions, but those will be few and far between, and under no circumstance will you and she ever be alone together again. That ship has sailed. \n\nYour family has earned an angry reaction.",
            "I hope things work out when you talk to your sister. ",
            "Your sil sound jealous of you i don't know why but Why wasn't she happy that your accomplishing your goals?? A relationship can wait you securing your future is more important....i don't know you but I'm proud of u keep up the good work and i wish you the best of luck in this situation",
            "So OP? How are things? Have you spoken to your sister about this? Has anything been resolved?",
            "HUGE speculation on my part, but the first thing that popped into my head is the current political climate - do you two fall on opposite ends of the political spectrum? Maybe even on a single important issue? ",
            "Wow, I highly suggest you confront to SIL face to face. People like her need to be put in their place by the person they are victimizing and only then will they back down bc they are called on their crap. I’m surprised you haven’t said something to her already, she is so rude!",
            "Your SIL is a raging douche.",
            "I would call it out, \"why did you say that?\" \"Why would you roll your eyes at me like that?\" \"I don't understand, why would you do that?\"\n\nAct innocent and make her back up her behaviour. Sometimes it can make people trip up.",
            "Why do you care if she likes you? She sounds like a total count.",
            "I’d discuss with your parents, go with something brief and neutral so that it doesn’t come across like you’re trying to make your SIL look bad. Something like, “I was trying to interact with SIL yesterday when you guys weren’t around and she seemed uncomfortable with me. I won’t push her but just thought you should know about it”. Then continue to be cordial but not too friendly. I would not try to engage her in conversation anymore until you’ve figured out what her deal is.",
            "Talk to your sister.  I think you got off on the wrong foot with your sister in law in several ways others have pointed out.  But also frankly I think you might be annoying her.  That doesn’t excuse her being so rude but it’s worth thinking about.  You asked her when she is due, and it’s a little weird not to know when your sister’s baby will be born when it’s just three months away. She was probably annoyed that you had to ask, and then you asked her about her breasts... Personally you would have annoyed me in that conversation.  She later left to get away from you, and it sounds like you were repeatedly pushy while trying to be friendly, and she was annoyed so got more angry and was really rude.  \n\nTalk to your sister.  If your sister in law’s personality is more reserved you will need to change how you act with her in future, at least until you know her.  Or you may find out there are additional problems and resentments that may need to be addressed. ",
            "Talk to your sister. Not to \"tattle,\" but to ask if she knows why her spouse is angry at you or if you've done something to offend her that you aren't aware of. Maybe the whole thing is a misunderstanding of some sort.",
            "I would ask Sister first if she has a clue whats wrong, then i would ask SIL directly, \"we gotta have a serious talk, did i do something wrong to you? I cant think of anything but i feel you really dislike me and i cant do anything about it untill you tell me why, so lets be  adults here, tell me whats wrong\" ",
            "I'm guessing SIL is jealous or begrudging of something, there's no reason to act that way if not when you say you can't have pissed her off. Maybe have a tactile word with just your parents first about what happened at the dinner table and explain she'd been short with you that day. I mean admittedly her hormones will be going wild but i'd have expected everyone to get the same treatment if this was the case. Speak to your parents, see what they say, see if it continues and if it does just call SIL out on it and ask what you've done to upset her and how you can rectify this. ",
            "Some people are saying the questions you asked about her pregnancy were rude, which would be true if she were a stranger, but they seem perfectly reasonable to ask a family member. \n\nOn the other hand, since she's six months pregnant she might have given you a weird look because she expects you to know already. It does seem strange that you didn't, and maybe that's the issue--she feels like you are uninvolved in her and your sister's lives, and she dislikes you because she thinks you don't like her, or care enough to get to know her. Some of her behavior was reasonable (not wanting to be hugged by someone she doesn't feel close to), some was downright rude, but you might have to give her the benefit of the doubt if you want to bridge the gap.\n\nEither talk to her, or your sister, and with an open mind (in other words, being ready to hear something you might not like), ask if there's a reason she dislikes you. Since you say your sister has a deep need to be liked, she might not be the best person to talk to, since she might evade the issue or sugar-coat it. OR, instead of asking SIL if she doesn't like you (because she may deny it and just shut you out further), tell her you would like to get to know her better, and then follow through by keeping in touch and maybe asking your sister to help plan times for you to all hang out together. This may or may not be the issue, but if it is, SIL may warm up once she sees you are serious about having a relationship with her (and not just her future child).\n\n",
            "[deleted]",
            "I doubt OP will get answers she wants or confirmation that she’s being treated unfairly by SIL. \n\nMain reason, SIL has the best excuse: pregnancy brain and hormones. And most people give passes to pregnant women when they act out of character.\n\nThe best outcome would be to talk to sister and parents and just kind of sanity check the situation. Bring up how mean she was to you while they were all out, and then the mashed potato incident. Even if they come to her defense about being pregnant “she’s grumpy because she’s uncomfortable”, that maybe they can still correct her when she’s mean. Like when your sister said you wanted potatoes.\n\nI’m not sure what the outcome will be if the family does notice what’s going on. Hopefully your sister would at least tell her to cool it with her shit, even if she can’t get a direct answer as to why she hates you.",
            "Why did you keep mentioning how rich your parents are? You come off as superficial, the sister in law stuff aside. ",
            "Hey, so I’m not trying to excuse her petty behavior, but it’s possible that she’s upset about your prying questions right off the bat.  You think asking a pregnant woman her due date is making polite small talk?  When she was clearly not into that, you pressed on to ask a gender preference?  Look, people in general start to feel entitled to information about what’s going on in your body once you’re pregnant, and I doubt she needed more of that when just getting up from someone she (based on your description) barely knows.  I mean, at least you didn’t ask her how much weight she’s gained or if she plans to have a vaginal delivery.  Those ones are the worst, ugh.  Also, a lot of people will also pry/judge about your decisions to work or not work while pregnant, so in context your question about work also pushes that “why the hell do you want to know that?” button if it’s someone you don’t know well.\n\nAnyway, I still think she’s handling this is a pretty immature way.  Sure you could have been a little less socially awkward and pressing with her, but if she doesn’t either get over it or talk to you about it soon then that’s on her.  \n\nAlso, I’m sure you’ll get people saying that the questions you asked are just fine to ask someone who is basically a stranger to you.  Those people I’m sure are the same kind of people who go around pressing all pregnant women for answers to oddly personal questions. Lots of people telling me how little or much time to take off work before/after the baby is what got to me the most.  ",
            "[removed]",
            "I would (depending on the state you live in) record any private conversations you have with her. Maybe you're reading too much into things, and maybe if someone else hears her bullying they'll understand. But people like her thrive in the shade and we all have the technology now to throw a huge spotlight into their darkness. Even if you don't go playing it publicly to embarrass her, knowing you have the right of the situation can prevent her from gaslighting you.\n\nAnd also keep in mind that some people are just mean, and having a baby gives them a weapon to bludgeon others. Don't be surprised if you do something incredibly minor that causes her to force your parents to choose between you and their grandchild. ",
            "You can ask to spend the day with them. Try not to jump to the conclusion your SIL is being purposely mean. Maybe she’s just cold around you because she doesn’t know you as well. Maybe she’s stressed and feeling hormonal. She might not realize she’s being mean to you. She might be more polite to your parents out of respect since they are older/ she’s a guest in their house.\nIt could be an age thing also. You are younger so she might just be annoyed by that. Not saying it’s fair but she and your sister are obviously dealing with a lot right now. She might be slightly annoyed that your a “carefree” college student. \nThese are just some things it might be. I’m not saying you don’t have a right to feel hurt or upset but try and avoid confrontations.\nJust ask your sister if she’s like to hang out. You can mention how you feel you aren’t close and you’d like to be more involved. You can try and ask your SIL some more questions. If she seems annoyed just drop it and give her space. "
        ]
    }
]