[
    {
        "post_id": "4muwka",
        "author": "abcdxyz2",
        "title": "[UPDATE] My [25F] professor [30M] asked me to go on a date after I graduate next month",
        "url": "https://www.reddit.com/r/relationships/comments/4muwka/update_my_25f_professor_30m_asked_me_to_go_on_a/",
        "score": 5611,
        "num_comments": 234,
        "created_utc": 1465242833.0,
        "selftext": "[Here is the first post](https://www.reddit.com/r/relationships/comments/4lvz0t/my_25f_professor_30m_asked_me_to_go_on_a_date/)\n\nHi everyone! I just wanted to thank you all for your comments on my last post :) They really helped me. I was asked for an update so here we go...\n\nAnyways, I think I should have worded myself better. I wrote the post on May 30th and my convocation was on June 4th. I put \"next month\" in the title but realistically, I should have put \"next week.\" I digress. Looking back, the timeline is probably confusing but this post should clear it up.\n\nFirst and foremost, I GOT A JOB :) It is at quite a large PR firm within the city and I start next week. They didn't ask me for references, but instead, told me they looked at my LinkedIn profile and saw that I had quite a few recommendations there, so they were satisfied with that. I'm so excited!!\n\nSo I never ended up using Mark's letter of recommendation. After posting, I decided that I do want to explore something romantic with him. I immediately felt better after getting some third party advice, so the next day, I emailed him (I didn't have his phone number) and said this:\n\n\"Mark,\n\nFirst off, I want to say that I am incredibly grateful for the recommendation letter you compiled for me. I have a second interview tomorrow at one of the agencies I was telling you about. I'm a bit anxious but also quite excited. \n\nI just wanted to let you know that I will not be using the letter after all. I thought about what you asked me and I am very interested in going out to dinner with you. You have been an awesome mentor this last semester but I am ready to see a different side of you. I promise we don't have to get Indian food :)\n\nI wanted to apologize if I seemed standoffish when you asked me; I wasn't expecting it and it took me a while to process it all. \n\nAgain, thank you for the letter. Maybe I will see you at convocation this Saturday? And, just in case you may want it, here's my number 555-555-5555. \"\n\n(The Indian food  bit was from when he was sick one day and said he is 99% sure he got food poisoning from trying a butter chicken dish at a dive bar)\n\nAnyways, I received a text from him an hour later and we have been talking ever since. On Friday, I found out I got the job and told him. He said he wasn't surprised and I would do really well there.\n\nSaturday was my convocation. My parents flew down and it was great! I saw Mark at the mixer and he had a huge grin on his face and waved. I was busy taking photos and whatnot and noticed he left later on. He told me he didn't want to spoil my day and said we would talk soon.\n\nWe decided to go out to dinner yesterday (Sunday). To keep it short, it was great, he was great and he walked me back to my condo. We said goodnight and he started walking away. I was kind of disappointed and turned to walk into the door but I heard him call my name and he kissed me :) He said he's still new at this.\n\nAnyways this post was probably all over the place but I'm actually just feeling really giddy and excited. Between the new job, finally graduating and the lovely date I had with my ex-super-hot-prof, I'm on cloud nine right now.\n\nThanks for everything guys! Your advice really helped!\n   \nTLDR: Got a new job, graduated and went on a date with Mark. He's a good kisser. I'm happy.",
        "permalink": "/r/relationships/comments/4muwka/update_my_25f_professor_30m_asked_me_to_go_on_a/",
        "comments": [
            "Congratulations on your new job, glad your date went well. It's wonderful to see some good news on this subreddit!",
            "What a respectful-sounding guy.",
            ">He's a good kisser.\n\nGo, you! Future's looking bright. ",
            "> We said goodnight and he started walking away. I was kind of disappointed and turned to walk into the door but I heard him call my name and he kissed me\n\nAyooo! Smooth Mark is smooth! Congratulations! ",
            "I dated my (ex)professor after I graduated...like we went on our first date the day after graduation. He was wonderful and we had a great relationship. We eventually broke up due to different life trajectories, but I don't regret it at all and I remain friendly with him and his wife. I'm happy for you, OP!",
            "Adorable! Congrats and good luck at the new job as well!! ",
            "I was so hoping I'd see an update on this, and I'm glad it came so soon! This guy sounds like a keeper... And more importantly, SO DO YOU! I love how much thought you put into this, and it sounds like you guys are both really considerate human beings who deserve to be together. Wish you all the best of luck and hope this works out for you both! :)",
            ">but instead, told me they looked at my LinkedIn profile and saw that I had quite a few recommendations there, so they were satisfied with that. I'm so excited!!\n\nPost is fake, no one gets jobs off of LinkedIn. \n\n(Just kidding, glad it worked out!)",
            "OK, I will be that guy. \nHe sounds charming and you sound like a mature person with a great head on your shoulders. So, my advice is   \nGo no contract   \nDump him   \nDelete facebook  \nand ignore my advice.",
            "Oh wow he reached you at 555-555-5555? You're too lucky to have that phone number",
            "I love this so much! Congrats on both aspects!",
            "Best thing I've read today. Have fun and congrats!",
            "I'm rather late to respond, but I figured I would regardless.\n\nI have been happily married for 3 years - together for 6 total - to a man who used to be a professor of mine. I took one class with him and found him to be incredibly funny and endearingly shy. After the semester ended, we stayed in contact and developed a friendship. This quickly turned into a romantic attachment. Our age difference is greater than that of you and Mark. I have never regretted my choice of partner, and our relationship is healthy and loving.\n\nAll that is to say good luck, and these kinds of relationships can absolutely work.",
            "Awesome, first he stimulated your mind with his teaching skills. Next he stimulates that bootayyyy. Good luck. ",
            "> (The Indian food bit was from when he was sick one day and said he is 99% sure he got food poisoning from trying a butter chicken dish at a dive bar)\n\nI've changed my mind. Any man who orders butter chicken at a *dive bar* is some manner of idiot. Stay away.",
            "Shut up I'm not crying you're crying! :')",
            "Awww sounds like it worked out great! Congrats on graduating and your new job!",
            "That's crazy that you have the same phone number that my crush gave me! Are you guys \nRoommates?",
            "Giggity giggity yeah! Another job well done, Reddit. \n\nEnjoy your time, OP! ",
            "What wrong with Indian food ?",
            "This update is so cute and happy that it makes me happy. :D Yay OP! Good luck and congrats! ",
            "Awwwww! Glad to see this update :)",
            "Yay! Good luck with the new job. My dad was my mom's professor in the early 80's who asked her out after their class was finished. Still happy married today with three kids! ",
            "AWWW! I love happy stories!",
            "I'm squealing, this is so great. I'm so happy for you! ",
            "You go, girl! I can't stop giggling while reading the last paragraph. I'm so happy for you. 😄😄 I wish you all the best for your future. May all your good wishes come true. \nEnjoy the moment, girl. \nI'm writing all this with a huge grin my face. I can feel your happiness. 😆",
            "I wonder what this girl and the professor look like?",
            "This made me smile. Good for you! Enjoy it. ",
            "Continue writing this down and you get a movie. :) ",
            "I tried calling the number and said it was not available. ",
            "Well done on getting the job! Sounds like it's going great right now",
            "YAY!! So glad this worked out for you both!",
            "YAYYYY!!!! I was looking forward to your update :)",
            "Congratulations on the new job and I'm glad this all went well!",
            "This guy sounds awesome. Good luck!",
            "Aww great update. That's pretty awesome about the job as well! \n\nI was thinking recently of deleting my linkdin profile but maybe I should keep it up?",
            "Aww, I am so happy and excited for you! Congratulations on the new job - best of luck to you with it and with the new relationship. (:",
            "Congrats on the job!!! Glad to hear things are going well with Mark too :)",
            "What an exciting time in your life!! I am both envious and happy for you.  The years just following college were some of the happiest  of my life.  Wish you the best in everything.",
            "this update made me feel all giggly inside",
            "Congrats! You are living the dream every girl has! :)",
            "Sounds like a great guy! Congrats OP, we're pulling for you!",
            "Awesome update, happy everything worked out so well ",
            "I'm calling shenanigans... this doesn't happen in real life. \n\nHaha I'm kidding. Real happy for you OPEN. I feel giddy for you",
            "Yay!! I was smiling the whole story. Congrats!!",
            "I didn't see your first post but reading this update makes me really happy for you! It's always great seeing positive stories come out of /r/relationships. \n\nCongratulations and good luck with everything! ",
            "Amazing! This gave me warm fuzzies, so happy for you =)",
            "Your phone # is all 5s? Wow, what are the chances!",
            "This is everything I wanted it to be and more. I'm now expecting regular updates pls n thx",
            "My friends met this way and have been married for about 7 years now, just saying.",
            "[deleted]",
            "This is so great. This is what cheesy rom coms are made of and I love it! Congrads :) ",
            "Even the original post was a humblebrag",
            "New at this? New at dating former students? Believe me, he's not.",
            "Wonderful! Everything's coming up abcdxyz2!",
            "This is so sweet!!!! Congrats on the job!! I'm so happy for you. I love happy updates. \n\nSide note: you're living my dream right now. I always find myself developing crushes on my younger male teachers. ",
            "Yay for happy endings. You make kitty happy.",
            "He sounds like a really decent guy. Good on both of you for doing the mature thing.",
            "I'm so happy for you! Thank you for the update. This cheered me up :)",
            "Aw this is amazing, congrats!!",
            "I'm sure this will be buried, but just to add that one of my best friends has been married to her former prof for maybe going on 10 years now.  Very similarly, he waited to ask her out until graduation.  In my limited experience, it can work out nicely.",
            "yay for happy beginnings!",
            "Ooohhhhhh how awesome! I am so happy for you! You got a degree, a job, and a boyfriend! How wonderful. Congrats girl.",
            "This update makes me smile :) Good luck, OP. And congrats on everything!",
            "Finally some good news on this sub! Congratulations on everything :)",
            "Hopefully everything goes well! Post some updates as things progress.",
            "Hooray for all of those things! Congratulations on graduating, good luck at your new job, and yay for dating a good kisser. :D",
            "It must be so easy and convenient to remember a phone number like 555-555-5555!!",
            "I love this. Congrats on everything! Enjoy it! ",
            "That's awesome!!  Glad it's working out so far.  Had a feeling it would  :)",
            "Yay I'm so excited for you.",
            "This is so sweet! Congratulations!! ",
            "Awesome!! I'm glad everything worked out.",
            "This is so great!  Congratulations!\n",
            "OMG I love this whole story! It sounds like he is a cool dude and played this all right. Congrats on graduating and having a great first date!!",
            "Hey, that's lovely to hear!! Glad things are working well for you and this nice guy! (Also, sounds like he's respectful and cool, so double points for him)\nAnyway, june 12th is valentine's day in Brazil, just so you know *wink*",
            "Good job OP! Just remember that you need to pick out the restaurants. Who orders butter chicken at a drive bar?",
            "Fuck yeah. I've been hoping for an update to this one. So happy for you! ",
            "I tried giving you a call at that number to congratulate you but it didn't work...\n\nJ/k but for real congrats, glad it worked out",
            "Yay!  I was curious what you were going to do with all the advice we gave :)",
            "This is so stinkin' cute.\n\nBest of luck, OP <3",
            "Random question to anyone who has the awnser, could the teacher tell a student post graduation he would write the student a letter of recommendation if the student goes out with him or bangs him? could he get in trouble with the school board or whatever teacher ethics board?",
            "I'm so happy for you and jealous ;) I've had my fair share of professor crushes.",
            "Congratulations, I'm very happy for you. What a wonderful story :)",
            "Reminds me of Ted in How i met ur mother tbh. Glad you decided to give him a chance :)",
            "OP... This made me smile so much. I'm so happy that life is getting good for you. Some people only dream of what you have right now. Congrats on so many levels 😊😊😊",
            "Can somone eli5 the word convocation?",
            "Good job! Hope happiness awaits",
            "Hang on... THIS ISN'T YOUR NUMBER AT ALL!!!\n\nPlease email him back with your correct number!",
            "Congratulations! It's so rare we get so happy updates here! ",
            "Weeee girl, way to go!! :D I'm glad it all worked out, I crossed my fingers for you when I read your last post. Congrats on your new job and may you have a wonderful relationship with this man. :) I hope your dad is okay too! ",
            "Wow, you get to date a professor. You have no idea how many romance novels I have read are ....\n\n",
            "> He told me he didn't want to spoil my day \n\nSounds like a pretty good dude",
            "When you said \"ex-super-hot-prof\" I hope you actually meant \"super-hot-ex-prof.\" Hopefully he's still super hot and not formerly super hot. ;)",
            "I saw your last post and it's just nice to see something nice and positive come from this subreddit sometimes :) all the best with the job and everything!!!",
            "This is so sweet! Best of luck to you guys!! \n\nI am just curious what he is 'new to' though? Is it dating in general or just dating a former student?",
            "Oh this post gave me butterflies! I'm so happy this wasn't a creepy gross post, this guy seems so sweet!",
            "I like him. And I like you. \n\nErgo - Good luck, OP.",
            "You're literally living my fantasy(:\n\nI'm so proud of you. ",
            "Feels like a romantic movie in the making!!\n\nCongrats on the job, graduation, and that the date went well!",
            "This has been one of the loveliest posts I've seen on reddit. You're like living out my ultimate fantasy. \nI'm so happy for you! I really wish you and Mark all the best! ",
            "Holy crap - sounds like you have it made.  Well done and enjoy!\n",
            "I fuckin knew it. He is a late bloomer. You're probably gonna have to work with him on a few things, but overall I think it's all good in the hood for you. ",
            "Your professor is 25 years old and, by definition, has no idea what he's doing.\n\nIgnore it and go enjoy your degree-laden life!",
            "Omg I'm so happy for you!!",
            "> he is 99% sure he got food poisoning from trying a butter chicken dish at a dive bar\n\nthis is the most british thing i've read in a while",
            "My great uncle married his student and they were married for a very long time until she fell to breast cancer.\n\nEnjoy your life, this new journey, and don't smoke cigarettes and you should be alright!\n\nOmg so happy for you. Congrats and best of luck in your career and life overall!",
            "-screaming-  I HAVE BEEN WAITING FOR THIS UPDATE!\n\nAhh, congratulations OP! So happy for your accomplishments and the new job, and happy that you decided to go on the date! I hope things work out well for you in ALL aspects!  \n\nMark seems like a stand up, all around great guy, so yay! Enjoy it, OP. :) ",
            "Omg I'm so excited for you and everything new happening in your life, congratulations and enjoy it!! You sound amazing and he sounds amazing! ",
            "THIS MAKES ME SO HAPPY!  Enjoy the new chapter in your life :)",
            "Fun.  He sounds like a good person who is caring and respectful of your needs.  I like that while interested in you, he wants you to have your space and time with family during the mixer.  \n\nTreat him well as he is treating you.  Sounds like a romance is blooming.",
            "can we get more updates????????????? :D",
            "I'm genuinely squealing reading your posts. This is great!!! Congrats on everything.",
            "DJGHALJDHALK. \n\nI'm squealing of happiness. Congratulations on the new job and Mark :D",
            "I think this is the only happy story I have ever read on this subreddit...",
            "So happy to read this! Congratulations on the diploma, the job, and the wonderful date! Enjoy this exciting time in your life! ",
            "Squee!! This update makes me so happy for you. Congratulations om the job. That's super exciting and the sweet date is the cherry on top. ",
            "Yay! Nice everything is going so well for you!",
            "he abused his power over a female student but ok les ignore that "
        ]
    },
    {
        "post_id": "o0buhm",
        "author": "EasyZookeepergame988",
        "title": "Update : I (32F) snooped on my husband's (33M) phone and found out he is bi",
        "url": "https://www.reddit.com/r/relationships/comments/o0buhm/update_i_32f_snooped_on_my_husbands_33m_phone_and/",
        "score": 5572,
        "num_comments": 228,
        "created_utc": 1623755510.0,
        "selftext": "[Original post](https://www.reddit.com/r/relationships/comments/nnlyha/i_32f_snooped_on_my_husbands_33m_phone_and_found/)\n\nI did not expect so many responses and I was a bit confused on what to do but I guess most people in the community was telling me to give him space to process it himself and come out on his own terms.  I took the advice to be generally supportive of the lGBTQA community without being obvious about it. I also spend some time reading about bisexuality. \n\nI did post a story on June 1 but the best thing that happened was that his friend came out as bi herself. We follow each other on Instagram and she had made a post about it. I made a comment congratulating her and wishing her well. She did text me about a dinner and  while we were   \n chatting she thanked me for my support and this wonderful woman gave me an another opportunity to express my support and do it in more personal way than a comment. \n\nHe came out to me about a week ago. He was very nervous and still scared and all I wanted to do was tell me that I knew but from what I have read letting people do it on their own terms were really important. He told me, nothing would change. He just wanted me to know and he didn't want to hide a part of himself. It was okay. I told him nothing had to change. He was the perfect man for me and I loved him no matter what. \n\nHe did ask me later if I knew and I came clean. I told him I saw. Apologized for it and cried a lot. He was upset but understanding. He even apologized for suddenly changing his behavior which is bullshit as I should have dealt with it a lot more maturely. it just hit just right spot of insecurity for me.\n\nThings are fine. He is happier and we are getting back to our old routines. \n\n TL;DR:  He came out. I confessed to snooping and things are okay.",
        "permalink": "/r/relationships/comments/o0buhm/update_i_32f_snooped_on_my_husbands_33m_phone_and/",
        "comments": [
            "From a bi woman monogamously married to a bi man, I also want to express my reassurance that this doesn’t change the dynamic of a marriage. My husband and I both discovered that the other was bi after we married, and the knowledge has only positively impacted our relationship. It’s been lovely joking about people we both find attractive, having the same celebrity crush, and just feeling more open expressing certain parts of our identities. \n\nI remember hearing something about attraction while being in a committed relationship. The relationship doesn’t blind us to other people who we may find attractive, however we can admire a beautiful painting in a museum without wanting to fuck it. With this in mind, my husband and I can easily chat about things and people we find attractive, without feeling insecure about our relationship. My husband, as I think your husband did as well, married me because he loves the prospect of our future and family together. Attraction is just one small component of this.",
            "Straight spouse with a bi husband here as well. Glad you had such a good resolution! I completely understand why you feel/felt insecure, but at the end of the day it's about trusting your partner in the same way that you would if they were straight.",
            "As a bi woman in a monogamous straight passing relationship, I just wanted to assure you that this does NOT mean he's suddenly going to want to sleep with men or open your relationship or anything like that.\n\nMany of us bi folk are bi AND still 100% monogamous regardless of the gender of the person we love. Just because we're bi doesn't mean we HAVE to be in relationships or have sex with other people of other genders all the time, and just because we're in a relationship with someone of the opposite gender doesn't mean we're straight and just confused either.\n\nMonogamous bi people are in a relationship with the person we're with, we're attracted to them and we love them. Sure, we may have attraction to other genders, like, celebrity crushes etc, we may watch porn of same genders or have passing fantasies... but our **real** focus is on the person we're with. It's no different from a straight person having passing crushes or dreams about other people than the person they're in a relationship with. It doesn't mean anything beyond just an imagining.\n\nMy BF of 16 yrs recently came out as pan & is exploring being gender fluid as well, but he knew I was bi from when we first got together and our monogamy has never been a question. Regardless of our orientations and how our self identities may evolve, we love and are attracted to each other first.\n\nSo don't let your fears project onto him (although your worries are totally normal and understandable). Keep that open, loving, trusting communication going and you won't get any surprises. Keep creating the safe space of loving communication and sharing with the focus on solving problems as a team instead of making each other the problem & you two will always be able to figure things out.\n\nEdited because I realized I missed a few words & a couple if things didn't make sense. Thinking faster than I type lol\n\nEdit 2: I'm very moved at the response this comment has gotten. Much love to my fellow monogamous bi's out there, but in a platonic way only of course lol (And I have nothing at all against ethical non-monogamy, neither is \"better\", what's best is what works for the people involved!).",
            "This is a fantastic outcome! <3 I truly love seeing stories like this, because I see how differently bi men are treated than bi women. <3",
            "It can be harder for bi men in straight relationships because the homophobia around that is pretty high.  There is a lot of toxic ideas about masculinity where society says that bi-men are really gay because no \"real man\" would even think about being with another man.  I don't know if you saw that blind dating show - but there was a couple that was moving toward marriage and the woman found out that the man had relations with men before and she was disgusted and felt betrayed to the extent she felt he did something vehemently evil to her by not telling her on the first date.   That comes from society telling people that being on a spectrum of sexuality that is not 100 one direction is a betrayal to their partner.  So for men who date women, it's particularly scary for that to come out because the fear of stigma and someone leaving them is based in a very sad reality.  \n\n&#x200B;\n\nI'm so glad that you showed him that your love for him is true and that even with this knowledge you are committed and are not disgusted by him.  Not telling you directly may feel like a betrayal, but it is rooted in the realistic high probability that a straight partner would not just walk out, but would lose respect and develop animosity and hatred for the person who loves them.",
            "I’m so glad that it ended well for both of you. I really do think your relationship will be strengthened from this! I wish both of you well!",
            "I am a bisexuality woman married to a bisexuality man. We are completely monogamous and love each other fully. This is still the same man you have loved and trusted all these years!",
            "Thank you for the update. This is the ending I hoped for. It’s wonderful to see! I hope you have many happy years together!",
            "Nice. Communication is the key, here and in every relationship. Kudos to you both for being sincere and caring of each other, it really warms up the heart.",
            "This has happened to me with a good 1/4th of my past partners. I think more men are bi than even they know yet.",
            "🎶 bi 🎵 husband 🎶 energy 🎵\n🎵 she's got bi husband energy 🎶\n\nWe always like to see a good, loving conversation! Glad things are well with you both.",
            "My bf kind of indirectly confessed he was bi to me. I just casually brought up how I find women hot but that I'm physically and not emotionally attracted to them. My bf agreed on the opposite end and was like yeah what does that even mean? Lol. He seems relieved and that makes me happy. Random comment sorry lol.",
            "It took me almost 20 years to come out to my wife as pan. For guys bi/pan guys, there's always this fear that a cis-female we're in a relationship will just think we're gay. A bi/pan guy in a committed relationship with a female is often no different than a straight guy in that same context. No matter how many different types of people he happens to be attracted to, he chose *you* and a loyal guy is a loyal guy regardless of orientation. Hell, you could even look at it this way: as a bi guy, he has A LOT more options than a straight guy and chose you anyway. You could choose to take that as a very high complement.",
            "As someone who just got out of a relationship with a closeted bi man (to the world), it’s extremely difficult if he’s not fully comfortable with his sexuality. Just make sure he knows you’re there for him.",
            "I went back and read your original post and I have to say I think you handled it well!! Could you have just talked about it at the start instead of snooping? Yes, but we all make mistakes especially when it comes to our insecurities (Also you could benefit from seeing a therapist to talk about your past and help yourself trust your partner more :) )",
            "I am the bi parter in a monogamous straight relationship. I am so glad he came out to you. I've slowly been more and more open about being bi over time. I think hubs has pretty much always known. We were friends long before we dated and he had gone with me to gay bars and such. \nThe most important thing is to just continue being open and honest with each other. Make sure you are making time to communicate when you have questions or frustrations, instead of either of you hiding information or snooping on devices. Maybe take time to set a regular date night with no devices, just to talk. Being bi doesn't change the relationship, but lack of communication certainly can.",
            "Unsolicited advice so ignore if you want: As the bi partner in a monogamous relationship with a straight person. One thing that has been extremely meaningful to me is not just being accepted by my partner after I came out, but being thoroughly seen and celebrated. My bisexuality isn't just something my partner tolerate but actively accepts and celebrates.\n\nIt's different for every relationship and every person, but when you are ready and it feels genuine, you could think of ways to support and celebrate your husband's bisexuality. I think it will go a long way",
            "This is the best outcome ever and I’m so happy for you! \nI’m bisexual, my husband knew even when we were dating and has always been ok with it even when he was religious. He must be so relieved that you’re cool with it.",
            "my SO & I are both bi, but everyone just assumes we are straight! it can be tiresome, & if we didnt have each other to understand, i couldnt imagine it. so your support means the world.\n\nyou dont choose who you love, or who youre atttacted to. \n\nelated for you & your husband to be your full authentic selves together. \n\nsending loads of love 🐸❤️💙💜",
            "aw, thank you for sharing this wholesome content with us!",
            "This thread is so wholesome. 🌈",
            "I wouldn't bat an eye",
            "Congrats on taking the steps to communicate and take responsibility for the snooping! I know it is hard. Bi male here and my SO has insecure moments where my sexuality or past comes up from time to time.\n\nYour feelings may not be completely resolved or processed, so be open to exploring honestly your feelings of insecurity or jealousy. And be open to allowing him to admire or look at men without it immediately throwing alarms! (Now you can both drool over the Hemsworth brothers! 😍) \n\nIf you both talk openly and communicate honestly everything you are feeling, (using \"me\" and \"I\" statements, not \"you\" statements) you'll be able to navigate them together. It's a bumpy journey discovering bisexuality. You will both have to be accepting and validate each other to make sure the connection between you does not wear down again!\n\nI'm happy for you both!",
            "The way that this worked out was super wholesome and really shows you two will be able to work through things maturely in the future. All the best wishes and happiness! This made my day :)",
            "[deleted]",
            "I mean, for me, dating a bi guy is #goals  so im so proud that you guys worked it out. After reading your title and the update it makes sense these two closeted friends would suddenly have a lot to discuss. So glad you guys are happy...also maybe consider the fun you guys can have role-playing in your sex life now. :)",
            "Honestly don’t beat yourself up for snooping too much. He was hiding something from you, it could have been cheating but ended up being this. You had a reason to be suspicious.",
            "If before you were insecure of his communications with other women does that mean you will now have to be insecure of his communication with women and men? Sounds like a big burden.\n\nPeople downvoting but not addressing the fact OPs original post stemmed from insecurity about the close relationship her husband has with a woman. Presumably he has close relationships with men as well.",
            "[deleted]",
            "I'm glad it worked out! Never invade his privacy again, that was fucked.",
            "[removed]",
            "Pause for a moment to think about how manipulative all of this is... oof.",
            "Straight spouse with Bi husband.  We were always very sexually open and adventuresome but he never openly admitted to being bi. It took years for him to actually say the words. Which is weird as he never was shy about having connections with men. \n\nAlthough I repeatedly said I had no issues with his sexuality or interests, I guess he couldn’t actually believe me. \n\nFinally he’s much more open but says bi might be too strong a word. He likes sex with men but only as a occasional thing. \n\nAnyway, just wanted to let you know that you’re not alone. Cheers",
            "Thank god you are not a narcissist.",
            "My bf and I are both in love with Brandi Carlile, what can we say? ;) \nI like to joke that neither of us has a chance, but I have MORE of a chance bahaha.\nI identify as bi, but have only been casually with a couple of women. Pretty sure he identifies as straight but is also real open to checking out dudes with me so maybe there’s some wiggle room? \n\n\nJust jumping on board with what everyone else seems to be saying, we are in a monogamous relationship and have no desire to open it or even add more to the bedroom. If that’s something you’d like to talk to your husband about though, more power to you! Sounds like you have a healthy and respectful relationship.",
            "When I started dating my wife I told her I was bi (it's how I identified at the time but have since identify as pan) and she let me know she was curious. I told her if she wanted to find out I would not get in the way as we were dating and I know what it's like to want to know. Both of us now identify as pan and we will comment and talk about who we find attractive with absolutely no fear.",
            "Snooping is wrong to begin with, you finding out he's bi is none of your business. If he wanted to tell you he would've.",
            "For me the issue would have been if he is cheating. Otherwise sexual orientation wouldn’t be a big deal",
            "it will probably not end well.\n\nhere is a story I heard about a guy who married a bi woman. she ended up leaving him for a woman.\n\nnot saying that will happen to you or he will cheat but it is something to consider. there is always a chance of things going south.",
            "Here come the kinks....he wouldn't be saying he's bi  unless he wants to experiment",
            "I didn't even realize \"coming out as bi\" was a thing. I always thought that was reserved for 100% gays.",
            "So just to get this straight, if he sleeps with a man, is it not cheating? I just want to understand the mindset here",
            "Congratulations. Its really special when two people can love each other through something like this.",
            "This made me tear up.  Thank you for sharing a happy ending!",
            "I'm happy for both of you. Wish you the best.  \nWhen I started dating my first boyfriend, I was questioning of my sexual orientation. A few months later, I came out to him as bi. He was the most supportive guy ever, even helped me in coming out to my other friends and siblings. It feels great to be loved and accepted unconditionally. I'm sure your husband loves you a lot and is very thankful to have you.",
            "Thank god you told him. That was seriously fucked up."
        ]
    },
    {
        "post_id": "hrddje",
        "author": "RespectableGhost",
        "title": "UPDATE: Boyfriend (27M) and his girl best friend on social media being excessive",
        "url": "https://www.reddit.com/r/relationships/comments/hrddje/update_boyfriend_27m_and_his_girl_best_friend_on/",
        "score": 5575,
        "num_comments": 197,
        "created_utc": 1594772472.0,
        "selftext": "If you want to read the old post:\n\n[Original Post](https://www.reddit.com/r/relationships/comments/hpi6lz/boyfriend_and_his_girl_best_friend_on_social/)\n\nI read all the replies and I got many messages for an update. I appreciate all the advice that everyone gave. I called the bird brain last night and basically went off on him. He had explained that they previously did have a past many years ago but they had reconnected after his last relationship but it was strictly platonic but THEN...\n\nHe tells me that he has herpes? That's one thing. Then tells me that I should possibly get tested. The last time we were physically together was in May. I confronted him and asked him if he slept with someone and he admitted that he slept with one person (pretty sure there were more). He said it meant nothing and it was only physical and there was nothing emotional about it. I asked why he did it and he said it was more of a \"last hurrah\" before he moved but it was with someone totally random. I asked how you meet someone random and he hesitated and said Tinder.\n\nHearing all of this I didn't know what to say and was in complete shock. He said he was sorry and it didn't mean anything. He said he understood if I wanted to break up but would still want to be friends because \"I'm really important in his life\". I obviously immediately broke up with him but it feels like a huge weight is off of my shoulders. I don't plan on being friends with him either since it shows that he’s trying to have me around in his life, more of a benefit to him. He's a piece of shit and I'm glad he has herpes :)\n\nAnother UPDATE:\nThere were things I needed to get off my chest for my own closure and so I sent him a message saying that I’m not comfortable being friends after everything that he’s done and he’s trying to keep me around and what not. He responded back with a few messages but the one I thought that was hilarious was when he said “I am upset about the whole situation and the prospect of losing you in my life. You are an amazing woman and it was a pleasure getting to know you. I wish you the best and hope down the line, we are able to reconcile.” \n\nI realized with his response, he never apologized for hurting me or about the situation itself and saying HE’S hurt? I’m glad I got out of it sooner then later. I removed him off all my socials as well \n\nThank you everyone for the comments and support. I’ll make an appointment soon to get tested\n\n\n\n\n\nTLDR: The tool slept with someone else while we were still exclusively together and is a piece of shit",
        "permalink": "/r/relationships/comments/hrddje/update_boyfriend_27m_and_his_girl_best_friend_on/",
        "comments": [
            "Uhhh “Last hurrah”? What a odd and suspicious thing to say as a reason. A last hurrah before moving is a weekend with his girlfriend not sleeping with some random person..? Yeah, I highly doubt it was one time especially because of this statement",
            "[deleted]",
            "Absolutely dodged a bullet there. Breaking up sucks, but he sounds like a horrible dude and testament to you for being so strong.\n\nIt might be a good time to get tested for other STIs, for peace of mind. Whilst herpes tests don’t normally work unless you’re having a flare up, I would go get checked for other infections so you can have a completely fresh start away from that pile of crap.",
            "I'm petty, but I would straight be finding one of their social media posts and telling her that she might wanna get tested since her \"bae\" just let you, his girlfriend, know he has an STI.\n\nThe nerve of these people cheating then wanting to be friends, like you have no standards.",
            "Yes!!!!! Dodged a bullet 👏🏽👏🏽",
            "Guuuuurl...\n\nI had a huge crush on my best guy friend who I had known since I was 14 years old. We were best friends and talked all the time. He moved away to go to college and we still talked and were super close all those years. We met in middle school when we were babies, around 2004 or so. When we started dating when I was 25, it felt amazing. I was literally dating the guy I had the biggest crush on since I was a teenager. We had such a whirlwind romance. He was sweet to me, he bought me flowers, he treated me like gold, and I moved to NYC with him for a long time and we lived that New York life and completely had it made.\n\nThen...\n\nI had to use my laptop for something, but mine was having a huge update going on, so I just used his laptop (something I've never done before) and his email was open and there were DOZENS of emails where he was chatting with other MEN and I saw dozens of emails of him and other dudes setting up meet-up times to sleep together.\n\nI confronted him for sleeping with dozens of men while in a relationship with me and he didn't even deny it.\n\n\"It was just physical, it didn't mean anything! I love you! You're so important to me and I love you so much. Those men meant nothing to me, I'm not even gay. I'm completely 100% heterosexual.\"\n\nWas literally what he said. Also, I have nothing against gay people at all. My ex was a cheating scumbag -- it just so happened that the people he cheated on me with were randoms from the internet that he'd have one night stands with. People who use the whole: \"It was just physical, it didn't mean anything\" excuse are vile pieces of garbage.\n\nI luckily didn't have STDs and checked myself for everything after this incident. To this day, I'm still mad about this breakup and it's been half a decade already. Will likely hold a grudge until the end of time over this one.",
            "lmfao what a fucking dumbass. glad you ditched that clown OP. I see many STDs in his future",
            "I'm so confused about why he would move to chicago if he was such a douchenozzle ? Like, who uproots their life for someone they're cheating on? Def dodge a bullet OP, and I really like the other person's suggestion to venmo request him for STDs testing money.",
            "Wanna get back at him, publicly Venmo request money to get you std test done. And make it known that’s what it for",
            "What an absolute scumbag, good on you for leaving him immediately. There is someone out there much better for you.",
            "A “last hurrah?” So, basically, being with you is the end of his life, and the end to ever having anymore fun? It’s a relationship, not a death sentence. Damn, and he really went out of his way for that “last hurrah,” didn’t he? Downloading Tinder, creating a profile, liking pages and spending days chatting up various women. That takes EFFORT. More effort than he was willing to put into you. Maybe there was no emotions involved, but he went out of his way and made a conscious effort to cheat on you. And this is definitely not the first or only time he’s done something like this. \n\nYou’re better off without him.",
            "You should tell his \"best friend\" he has herpes, lol.",
            "Please read “Mr. Unavailable and the fallback girl”.....get him out of your life completely, No Contact. best of luck hun",
            "Good for you! \n\nListen, I grew up on a street where I was the only girl out 10 kids. Those guys are my brothers. I went to their weddings, I've bounced their babies around, I held their wives wedding dress trains, I've destroyed them in board games. It's not my place to be blasting them on social media - that's their significant others. They are like brothers to me, but they don't get special treatment.",
            "Well handled!! You deserve better and I’m happy you found out sooner than later and wasted anymore time on him.",
            "Get tested!  Good for you standing up for yourself, can be hard to do sometimes.",
            "Read this with my jaw on the floor. What the F*CK is wrong with him. Whatever you do, try not to carry around this as baggage or internalise any of it as your fault, he is just a complete and utter fck tard",
            "Yeah, the SO's \"best girl friend\" has turned out to be a load of crap (cheating/lying) on *more* than one occasion for me too.\n\nThere shouldn't be any secrecy or flirting if they're really just friends.\n\nHere's the thing so many people fail to understand/live by:\nA decent person and true/platonic FRIEND acts a certain way when their friend is in a relationship. They act **respectfully**, they don't flirt, they don't act possessive, and they *change the rules* when their friend is in a relationship.\n\nFor example, I might jokingly jump on and hug my single guy friend, I might call or text at whatever time bc I thought about telling them something at that moment, etc. etc. I don't NEED and GET to do those and other things bc they're \"MY\" friend, and I've known them longer. When someone is in a relationship, you *modify* your behavior. I don't get physical/grabby or flirty, I don't call or text past a certain reasonable time (no, it's not okay to be texting a partnered up or married person of the opposite sex (hetero) at 11pm unless it's an emergency).\n\nIf you have an SO with a questionable best friend, and they both don't feel like there are boundaries, then RUN!\n\n- Especially if they try to gaslight you and make you feel like you're being insecure, etc.\n\nIn general, you should never be made to feel like your reasonable boundaries aren't important.\n\nAnd telling you months into the relationship that he has herpes? Holy hell. That's a super shitty thing to do to you. \n\nGood riddance to that ahole!!",
            "Damn sorry. But good on your for standing up to that piece of shit 👏",
            "What a prat! You’re well rid of him now thankfully. “Last hurrah” what a crock of shit.",
            "Make sure you send him a public venmo or two to tip off the other girl.",
            "It’s both hilarious and sad when cheaters think saying “it didn’t mean anything” is some kind of magical excuse for hurting their partner.",
            "[removed]",
            "Whew, what a mess this was. You're better off without them, that's for sure.",
            "I guess it was the best decision you could take :)\nEnjoy the rest of your life with someone deserving.",
            "What a jackass. Holy shite, he's honestly a piece of shit.",
            "Wow fuck him. I’m glad you broke it off. May want to fix the title to ex-boyfriend!",
            "Congrats on dumping his ass and not staying friends with him.",
            "I'm sorry this happened to you. You are not a benefit, and he needs to stop treating you like you are. What an ass",
            "You go girl. You don't need that hollow sack of shit in your life. There is no excuse for lies and deceit, and he will be like that the rest of his life.\nYOU deserve happiness and respect, and he deserves his herpes to permanently flare up on his lips for the rest of his life.\n\nHead and Chin up, stay strong. \n\nWe say in the UK \"Keep on, Keeping on\"",
            "Set fire to everything he has given you and try to get some form of closure from it. Look after yourself first and foremost and be gentle with yourself too.",
            "Playas gonna play and cheats gonna cheat but he didn't see strong babes gonna move on...",
            "Yeah, p.o.s for sure...ur way better off. Play the field, have some fun and the right one will come around",
            "Man what an asshole this made me so mad reading this - fuck yeah for leaving you and fuck that piece of shit",
            "So relieved you dumped his cheating ass! Good for you!! You will in time find someone who deserves you,not a guy who thinks a last hurrahh is acceptable! What a douche!",
            "He's trash. You deserve so much better. I've been in a similar situation and while it hurts now, SO MUCH BETTER to find out now and not six, twelve, eighteen months down the road that he's trash.",
            "Thank you for respecting yourself and leaving him. I constantly see posts asking for advice after getting cheated and rarely will the person leave.\nPlease do leave and enjoy your life, find someone better. You are worth so much more. You deserve better and you being able to leave when you know he cheated already proves it.",
            "Get tested babe.. He is a pos!",
            "I would suggest you to get yourself tested. As everyone including yourself understood, he's not someone to be trusted, so it's better not to trust anything he says, literally anything. A  \nAnd as for your own health is concerned, I hope you got nothing from a person like him.   \nGood luck in future relationship/s. :)",
            "Aye. Well done. He probably got it from her and asking to stay friends after having your trust broken is pretty low. Probably wanted to see how long he could keep you around while possibly trying to hook up with his best friend.",
            "ngl I'm sure that \"best friend\" was the girl from tinder or something. or he's lying because who has girls over late at night and sends them payments. She might have been a hooker. I hope you don't have anything and please be safe!",
            "I feel like his best friend = gf and you WERE one of many side pieces.  Sorry you went through this, good move breaking up...no reason to be friends with this kind of person.",
            "Last hurrah, you bet it was a last hurrah, for you to get this moron out of your life XD",
            "You just lost a big heap of dead weight. Good for you.",
            "in the words of 11, \" I dump your a$$\"",
            "Kudos to you OP. You sound like a badass no-nonsense kinda woman. And yes, you don’t need a friend like that either.",
            "He's a crap boyfriend, he will be a crap friend.",
            "Please do get tested. I'm glad you left and aren't planning on staying friends.",
            "That guy is terrible. He hid that friend for a reason.",
            "Sometimes the trash takes itself out.",
            "Lol \"not an emotional affair just meaningless sex\" because this D has no emotions. Oh pleeease. Glad you left him- he sounds draining",
            "wait, I thought he was living where you were living. Why has it been since May since you've been together? I mean, you're probably glad and lucky that you haven't been with him, but why?",
            "I’m so happy for you! Good riddance",
            "Wow, this dude sucks worse than I thought. So glad you can move forward but I am sorry he deepened your mistrust.",
            "Good.\n\nMy now boyfriend’s ex pulled shit like this, when she moved 18 hrs away for school she’d post things with her “friend” except it’d be very coupley looking things and my boyfriend would just be like ....okay? A year into doing long distance they finally broke up and spoiler alert guess who she started dating almost immediately afterwards? \n\nGood on you for trusting your gut",
            "I like how this ends! He got what he deserved.",
            "He is a dork, and you deserve better!\n\nSo glad to hear that you broke up with him. Def get tested.",
            "You go girl!! You deserve much better than that piece of shit",
            "WHAT A PIECE OF SHIT",
            "Did you let the best friend know your relationship with him and show her proof of everything? Because I would let her know so if there is something more between them, she can get tested and break up with him too.",
            "It won't protect you 100% but this is pretty much why you should use protection until you're sure that you can trust someone and want to be with them long-term (like think YEARS or a lifetime). And even then, if they have an STI or STD, you should still use protection.\n\nFYI, a lot of times doctors won't test for HSV without an outbreak. My understanding is the test alone without symptoms can return false positives. I'm hoping you avoided this stressful situation, but even if you didn't, it not the end of the world and you'll deal with it.\n\nBest thing to do would be to contact your doctor and get their advice.",
            "Take his advise and get tested for std's. Then you'll know if he gave you anything. Too bad it wasn't respect he gave though.",
            "Oh my gosh go on tik tok and look up emyoungmoney. She does videos as \"the girl best friend\" and they're hilarious. When you watch them you'll be like...oh yeah glad I dodged that bullet. It puts into perspective how clearly innapropriate these behaviors are.",
            "I am old fashioned. I told my  husband I could not handle any back and forth texting with his old crush, who was recently single and contacted him. He understood and accepted it. If someone wants a monogamous relationship, which I assume your boyfriend does, then follow the definition of monogamous. Online relationships are fantasy relationships and do not contribute to a monogamous  relationship.  I am not commenting on whether monogamy is the only way, perhaps there are people who prefer a different way. Know what you want and then abide by what you have decided on.  This is just my opinion and what works for me. Others may feel differently.",
            "Condoms use them. Whoever he had sez with you are having sex with without a condom.\nGet to the gyno and get tested. Make him go to the Dr to see if he is clean. Make him show you his results.",
            "He hesitated before answering your question about where he met someone random? $20 says his \"last hurrah\" was with the \"best friend\".",
            " What a shit  head \n\nGood thing he’s gone",
            "“Girl best friend”? Hahah. I love that. *You* should be his girl best friend.",
            "Just forget about him. He has an obvious history of using girls from past relationships. Don't be one of them in the future and yeah get tested then get tested again 6 months later.",
            "I’m really glad you got yourself out of a toxic relationship, I’m so proud of you for doing the right thing. Honestly, guys ain’t shit but they are a piece of shit",
            "_”He’s a piece of shit and I’m glad he has herpes.”_\n\nNow _that_ shit’s gangsta.",
            "Ummmmmm HERPES? I’d ruin his life if he gave me herpes. Sorry not sorry.",
            "Yuck. Girl go get tested asap",
            "Dump this asshole. Also never, ever be friends with this child. He’s not a man, he’s a boy. A child. Understand? If his behavior isn’t proof enough, nobody can give you better advice than from the first post. \n\nI hope you make the right choice.",
            "I was really rooting for you until you said you’re glad he has herpes??? Sure he’s a shitty guy but you’re glad he carries a virus?",
            "\"**Boyfriend (27M) and his girl best friend on social media being excessive\".** I read the title and I know its better to breakup. I personally dont date someone who has a different gender bestfriend for a peace of mind",
            "Wow. You went from being worried about the “bff” to herpes, talk about a left turn. Glad you dumped the POS, you deserve better! And ALWAYS ALWAYS TRUST YOUR GUT!",
            "[deleted]",
            "I’m glad you discovered everything and are able to move on with your life. Having said that, you shouldn’t rejoice in the health problems of another person, even if you hate him. You should always strive to be the bigger person.",
            "Haha you two sound like you deserve each other!",
            "I looked at your original post and I just wanna say and this isn't me defending your ex or anything but me and my guy best friend always call each other baby boy and girl etc and its 100% platonic. Your man was an asshole through and through but there are friends that talk like that."
        ]
    },
    {
        "post_id": "jngvrf",
        "author": "Intelligent_Ad3412",
        "title": "Update: My (28F) boyfriend (32M) told me a “white lie” for almost 3 years and I’m not sure if it’s a red flag",
        "url": "https://www.reddit.com/r/relationships/comments/jngvrf/update_my_28f_boyfriend_32m_told_me_a_white_lie/",
        "score": 5567,
        "num_comments": 125,
        "created_utc": 1604431377.0,
        "selftext": "\nLink to original post: \n\nhttps://www.reddit.com/r/relationships/comments/i4nbdc/my_28f_boyfriend_32m_told_me_a_white_lie_for/?utm_source=share&utm_medium=ios_app&utm_name=iossmf \n\nTl;dr: we broke up lol \n\nMy previous post got more attention than expected so I figured I’d update.\n\nWell, it’s over. As many of you suggested, I couldn’t possibly build my life around someone who lied so pathologically. \n\nI initially agreed to work on the relationship provided that my ex get therapy to work through why he felt compelled to lie about so many aspects of his “life”. I also requested that he come clean to his parents, my parents, and anyone else he lied to or embellished the truth to. He agreed to this and seemed genuinely interested in working on things and himself. I really wanted it to work out and was willing to accept that maybe he was just wildly insecure/had some attachment issues or something that caused him to act this way. I waited 4 months for the therapy and confessions to happen and they never did, not surprisingly.\n\nFor those of you who were confused about how I didn’t know he did not own this apartment for so long/thought I had never met his parents - I had met them many, many times. But tbh they are pretty cold people who I never really connected with that much and was definitely not comfortable enough to be like “hey, is your son a pathological liar or is all of this true?”. On top of that, he also told a lot of these lies to his parents as well so they wouldn’t have been keen to what I was talking about anyway.\n\nIt got to the point where basically anything that came out of his mouth seemed like a lie or at least a half-truth to me. Also, I lost respect for someone who could lie so easily and then not even feel guilty enough or any remorse to come clean about it. I’m pretty honest, almost to a fault. So the cognitive dissonance there that occurred from being with someone who had basically opposite values from me was tough.\n\nI’m sure there were a lot of other things he was hiding, but I don’t even care. I’ve been single and living alone for a week and to be frank I’m killin it. Im now responsible for 100% of my rent and I barely have any savings left, but I still feel like a giant weight has lifted off my shoulders. Crazy how that works. \n\nI want to thank all of the people who gave me the hard truth straight up and encouraged me to leave. Even though it was all coming from internet strangers, it still helps to hear people tell you that you deserve more than what you’re getting. I’m so happy and I must be giving off a much better vibe because I’ve already had 2 dates and been asked for my number a handful of times (I’m a server at a restaurant lol). I sound like a cocky asshole but god does it feel good to remember you’re not as worthless as someone made you feel. \n\nThanks Reddit, and if any of you are in a relationship with someone who is like this - GTFO and don’t look back.",
        "permalink": "/r/relationships/comments/jngvrf/update_my_28f_boyfriend_32m_told_me_a_white_lie/",
        "comments": [
            ">I sound like a cocky asshole but god does it feel good to remember you’re not as worthless as someone made you feel.\n\nNot even a little bit. I'm so happy for you! Also, you should be proud of yourself.",
            "\n## PREMIUM CONTENT. PLEASE UPGRADE. CODE gb1jcrl",
            "Congratulations on getting out of a crap relationship! Best of luck in your future, OP :)",
            "I remember this story, I’m glad you broke up with him, you deserve better.",
            "I’m so happy for you - enjoy living your new life!",
            "[removed]",
            "I remember your post! It completely boggled my mind how this man could spin such a massive web of lies, and they were not even close to being 'white lies.' Good for you!",
            "Ah man lifting that dead weight off feels so great!! Glad you got out while you did. I wish you all the luck making that new place a home.",
            "You do not sound like a cocky asshole. You sound like someone who recognizes and values your own self worth. Keep going.",
            "Wait, your post is from 2mos ago, but you say you've waited 4mos for him to go therapy?",
            "See, a white lie would be telling you he loved a particular dish you made him, and never having the heart to come clean when you kept making it for him.\n\nWhat this guy did was lie repeatedly about important financial matters, and kept doing so after you got serious.\n\nHe just wasn't a trustworthy person.  It sounds like he wants to be more successful and independent than he really is, but that doesn't excuse the lying. \n\nThat being said - I have a lot more respect for people who choose to live with family to save money.  Same thing with family plans on things like phones, car insurance, etc- the arrangement can work great for everyone, it doesn't always mean they're mooching off of their parents.",
            ">I sound like a cocky asshole but god does it feel good to remember you’re not as worthless as someone made you feel. \n\nI'd be cheering out loud for you if I wasn't at work right now. This is awesome. :)",
            "I like how you described the many many lies as a white lie. Obviously you cared for him and wanted to convince yourself it was nothing even though it was obviously a huge deal. That is crazy level of lying and he lack respect for you and himself. Wow!",
            "Atta girl. You made all the right choices. Now you have an upgraded bullshit detector. Use it often :D",
            "Congratulations! \n\nYou might want to look at getting a roommate to help with living costs. That way you will be able to take your time when/if you feel ready to get into a new relationship.",
            "Congrats! What really stood in the last post was how hed cry on your shoulder about a lie. Fuck that guy, I've known toxic people like that before. Theres no redeeming them.",
            "So glad for you, OP, live your best life!",
            "[deleted]",
            "I remember you. This is making me feel better, you fighting for yourself and believing in yourself. Thank you so much for this update!!!",
            "Once a liar always a lair..run now before its too late",
            "[deleted]",
            "I missed your original post the first time around. I've just caught up and...good grief, you got put through the wringer. That was a \\_lot\\_ of lying for no good reason.\n\nKeep on kicking ass in your new single life. Enjoy it--you definitely deserve 100% less bullshit than you were receiving!",
            "Good for you!  You sound very mature, intelligent, and grounded.  I am curious how you ended it and how he reacted.\n\nI wish you the best for you sound like a great catch.",
            "My brother has the same issue. Lies about anything and everything.",
            "Yeah he sounds like a sociopath. I was married to one. Kudos to you OP for getting out now!",
            "You did the right thing, I'm sure it was difficult and I am happy for you.\n\nI was with someone similar he said he was in law school, he was not. He said he was in the military, he was not. He said he could cook, that was lie. Lots of small lies, things that don't seem like a huge deal but enough to make him untrustworthy. It's a weird situation to be in, so I get it.",
            "I've been friends with a pathological liar for nearly 40 years. He's one of my favorite people. I don't trust him as far as I can throw him. Sometimes the lies are small and sometimes it's like watching Rick & Morty's interdimensional cable which is why I like hanging around him.  Only in short doses.",
            "Is his name Billy? Sounds an awful lot like a guy I know",
            "I have a sibling who's like that. I never know what's true and what isn't. They were like this since childhood. I could never ever date someone like that. It brought me a lot of frustration growing up. I love them a lot and we are close but I wouldn't date someone that lies like that. Ever.  Trust is basically the one thing I need in a relationship.",
            "It is better that you found out about it now and not after you married to him. Relationship build on trust and respect at the very minimum. If your partner is willing to lie about something that is serious like finance, then he is not the one.",
            "I can’t really say anything nobody else has, but you’re such a strong person! With your attitudes and outlook, I’m sure you’ll continue to go far.",
            "They were cold to you because he lied to them about you, probably claiming he was sponsoring your lifestyle.",
            "> I lost respect for someone who could lie so easily\n\nI feel like that's one of the reasons I ended things with my ex. He had this opinion that everybody lied about stuff all the time and that's how people got by. Because that's what he did! But at a certain point I repeatedly witnessed him lying about things that didn't matter, to impress people for no reason. Instant ladyboner killer. \n\nNewsflash for the dudes: good women don't want to f*ck men who lie about crap they don't need to be lying about.",
            "the sad thing about this is that he's gonna do this again to the next girlfriend he gets and be alot careful with his lies. So who knows wen the next gf will find out the truth about him. Im glad your out of the relationship but damn i feel sorry the next gf for sure.",
            "My last relationship was built on a lie. He had suffered a gambling addiction, and never told me until our entire life was falling apart  then I look back and realize there were soooo many lies. \n\n I didn't understand why he was always coming home super late from work and not coming home some nights, he would just tell me he was with his aunt or his uncle, and I gave him space to do that and trusted him completely. \n\nThis went on for like a year, I had a baby daughter, just about 2 years old at the time. He helped me take care of her and drove us to daycare and work, and did errands for us. \n\nSo one day I needed him to pay the rent, I had saved up 600$ in an envelope and arranged for him to meet the landlord. After work that day he told me he met with the landlord and paid the rent. 5 days later, my landlord called me asking when my ex would be able to stop by with the rent money, she hasn't been able to get ahold of him after he called and canceled....... yeah. Money was gone. \n\nAnd then I broke up with him but I felt bad because he would be homeless (and not able to see his daughter who I actually cared about) so I allowed him to live in my basement apartment (own separate entrance, bathroom, and kitchen). I gave him 90 days to get a new place. I told him he could keep the phone I got him, but he would have to pay for his half of the phone bill. He agreed, he told me he would pay everything back, and the rent. \n\nBut I never got anything. I paid his rent for that 90 days. I paid his phone bill for that 90 days. I paid back the landlord with all my tax return money so I couldn't afford to get myself anything nice that year. The worst part is he stole the really nice flute that my mom bought me and probably sold or pawned it, I couldn't find it in the storage closet downstairs after he moved. :( \n\nThen he moved out a week after the 90 days, and left the basement totally trashed. I spent my 30th b-day cleaning it up. \n\nHe's been gone from my life for 6 years and I'm still recovering from the financial abuse. Any kind of lie is a huge red flag.",
            "My husband lied to me about where he lived and how he and his family lost their house and that’s why they lived in a trailer and to not talk to his mom about it because it really upsets her. He even took me to this house and told me stories of how he’d sneak out from this window and his room was there and what not. I believed him because he had never lied to me and I had no reason to believe he would. Weeeeelll a year later we’re living in an apartment together and I’m pregnant with our first child and he tells me super casual like that he lied. And he never lived in that house he showed me and it was all a lie to impress me because I come from money and he thought I wouldn’t date him. \n\n\nWell was fucking pissed but my dumbass stayed. \n\nThen I found out the our living room furniture in our apartment was rented and not something he bought off this guy he knew. \n\nAnd then I would find a bunch of little lies out. \n\nLike that ex girlfriend who was harassing him and kept bothering us and pestering us and sending me and him harassing text messages and “going to his house” and taking pictures of his car. And that wouldn’t leave us alone for 8 months...it was him all along. \n\nAnd I found out it was him when I got his sisters number and her number was the same number that would send me messages. But I’ve never confronted him about it because I don’t know how clean he’d come about it. \n\nThere’s been so many more instances of little lies here and there but I ended up marrying him and I’m now coming to terms with the fact I married a pathological liar but I’m waiting to graduate to leave. \n\n\nAll this is to say I’m glad you got out because this shit only gets worse.",
            "Phew. You dodged a bullet there",
            "Wow. Is this my ex boyfriend?? No really",
            "Sometimes the best solution to such a problem is a clean slate, a fresh start.",
            "This is a great update I’m very happy for you ! Stay strong!",
            "This update makes me so happy. As someone who went on to marry that liar type, I can only serve as a warning to others. Aside from the lies, he steals money from me. He swipes cash from my wallet. He found some hidden money and stole that, too. There is zero trust and I can’t be intimate. Therapy didn’t help his lying or stealing. I’m very stuck. I was getting a little scared for you reading the original post and am so happy to see this update. Without trust, relationships are awful.",
            "You most definitely made the right decision but I can't help but feel sorry for him too. He doesn't sound like an asshole; just insecure and working through some maturity issues. When asked directly he did fess up, which takes courage especially knowing he might lose you over it which most likely means he was at least trying to put you above his pride for once. \n\nThose isn't sympathy for the devil as I think he brought this on himself but I'm guessing he is still broken hearted right now.",
            "I’m sorry you had to go through with this but you honestly dodged a bullet. I would watch Doctor Ramani on YouTube. She specializes in narcissist and it’s gotten him written all over it. It helped me when I was healing from my compulsive lying ex",
            "Great ending to the post. I wish you get what you deserve.",
            "Congrats! But I have to know, what was the deal with the condo? It was just his parent’s?",
            "Reminds me of my ex husband. Sometimes it seemed like he would lie about stuff for no reason, as if the lie itself was a pastime. But he also liked to lie and generally misrepresent himself so people would think he was richer and more important than he really was. He told so many lies he would forget about them and I would catch him contradicting himself. In the end I stopped taking anything he said seriously.",
            "You did a huge, difficult thing and you should be incredibly proud of yourself. I can see why you love your mom; she's obviously a badass given how you turned out!",
            "Good for you! I hadn’t seen your post previously, though reading it just now the first thought I had was that he would eventually drive you into debt on his behalf! Well done, and good luck with your nice clean future!",
            "thank god you got away from that loser, jesus christ!",
            "My first boyfriend was an extreme liar as well. I was so head over heels for him I didn't even realize it until after he broke up with me. I started looking at so many aspects of our relationship that suddenly were obvious lies and I became so thankful that we had broken up. I mean, he lied about the kind of music he likes! If you're gonna lie about something as stupid as that, then what WON'T you lie about? Now honesty has become the number one most important thing to me. I'm glad you got out and I hope you find someone who deserves you!",
            "You sound awesome and you deserve someone who can reciprocate.",
            "I'm glad to see this update. I remember the original post and was like oh man, this isn't a white lie, dude is pathological. Congrats to you!",
            "Get an std test immediately.",
            "You waited 4 months for the therapy and confessions, but your previous post was 2 months ago...",
            "this is such a happy ending, congratulations OP, you did really well, im proud of you.\n\nyou shouldnt have waited 4 months though lol",
            "You know what, be a cocky asshole! You've earned it! I can't imagine it being easy leaving someone you've been with for multiple years & lived with. Not only did you do that, but you are killing it being single! Go on all the dates, find out what, and who, you deserve. More power to you!",
            "You dodged a bullet, but sounds like you need to work on some things. See what resources you have available, it'll help you in the long run.",
            "You are not a cocky asshole, you are doing amazing and im.so.happy for you! I remember your original post and I'm so glad you.closwd that chapter in your life. Keep rockin' it, girl!",
            "Good on you for leaving - definitely the right choice.  But - 28 year old waitress with almost no savings?  That is not killing it.  That is the opposite of winning.  Is this how low the bar is set on Reddit?!?!",
            "[deleted]",
            "Dead weight? Were you paying for any of the bills of that condo? \n\nI get he lied, and I have a zero tolerance for that myself...but it sounds like he was enabling you to give more money to your mom or save it.",
            "I think the fact that you are worried enough to ask social media says something. I'm just not sure who it says it about.",
            "That was a nice story I'm glad it worked out, I'd still like to know what was really going on this dude is shady, sounds like anything is possible. Cause it sounds what he was covering up was innocuous, maybe embarrassing, stuff but who cares, it's like lying for no reason. Also you don't work in Philly do you (;"
        ]
    },
    {
        "post_id": "3eo2ic",
        "author": "throw212awaay",
        "title": "(update)I(30m) just found out my girlfriend(28) of a year+ had a whole life I knew nothing about, right as I was ring shopping. Advice?",
        "url": "https://www.reddit.com/r/relationships/comments/3eo2ic/updatei30m_just_found_out_my_girlfriend28_of_a/",
        "score": 5505,
        "num_comments": 275,
        "created_utc": 1437926061.0,
        "selftext": "https://www.reddit.com/r/relationships/comments/3dcgt4/i30m_just_found_out_my_girlfriend28_of_a_year_had/\n\nI spoke to her the day after. She told me she had wanted to tell me for a while, but didn't know where to start-- that she thought about Sam everyday but at the same time didn't know how to begin.\n\nShe pulled out a shoe box from her closet and she showed me the pictures. Pictures of her wedding, this propped up little thing at the courthouse, her in a short white dress with a slight stomach. Her husband, this cocky smiled kid with this shaggy blond hair. \n\nThen the baby, Sam. Pictures from a red-faced baby to this little four year old person. Birthdays, and Christmases, and pictures of the three of them- a family.\n\nShe talked about Brendan. How they came from these radically different backgrounds and she barely knew him as a person before he was a father and husband. They'd only been dating three months when she got pregnant. They were twenty.\n\nThen she talked about Sam- her baby. She kept saying he was the best thing that ever happened to me. Hearing that broke my heart. She talked about how his hair cow licked in three different spots and how he was always singing or humming, that he loved to climb. She told me his favorite movie and book. She made him a person to me. \n\nThen she told me how they lost him. Some kid ran a red light and then he was gone. She barely remembers the funeral because she was so heavily medicated. But the worst part was after, going home and him not being there- how she'd walk past his room and expect to hear him playing, waking up and forgetting for a minute he was gone. \n\nTheir marriage had never been good and they turned on each other. He blamed her because she had fastened the booster seat on that side of the car. She blamed him because he had been driving. They were divorced within a year after the accident. Brendan had a new child within two.\n\nShe had spent the time doing overload on classes and working, keeping busy because it made things easier.She didn't see her old friends because they drifted away- they never knew what to say. And they mostly had kids of their own. She was surviving. But seeing Sam's brother who looked so much like Sam hurt so much that she decided she had to get away and stop wallowing. She took the pictures down, donated clothes and toys, deleted her fb and stopped seeing the old friends who weren't really friends anymore. She said she chose to keep breathing because that was what it had come down to. Then she met me.. and she said I made her want a fresh start- a better marriage and more children- because she loved me.\n\nWe talked for hours, she cried and I cried for her. \n\n I still love her maybe more now because I feel like she opened up to me so much. it's hard to imagine her married, with a son, toys on the floor, and pictures on the fridge. it's hard because in a lot of ways it's the life I've been imagining with her.\n\nI still plan on marrying this woman. She's the love of my life. \n\ntl;dr She told me about her past. I love her and understand why she didn't tell me. \n\n\n",
        "permalink": "/r/relationships/comments/3eo2ic/updatei30m_just_found_out_my_girlfriend28_of_a/",
        "comments": [
            "This must have been so hard for her.  I am glad you were there for her.  Good Luck.",
            "[deleted]",
            "Dude, you are the reason that she decided to make another go at life!  You should feel good about that.\n\nBeautiful story, a tragic past with a potentially happier future.  Best to both of you!",
            "It's good you found out everything from her at last. \n\nLosing a child is one of the most emotionally painful things a person can go through. She hurt for such a long time, its no wonder she wanted a fresh start without this horrible memory eating away at her.  \n\nYou came along and gave her this new beginning. I think you two will do just fine. ",
            ">it's hard to imagine her married, with a son, toys on the floor, and pictures on the fridge. it's hard because in a lot of ways it's the life I've been imagining with her.\n\nUgghh this is so so so sad. I got a little choked reading this update. OP, I wish you all the best in the future, and I hope the two of you can build a family that will go some way towards healing her past loss. ",
            "as someone who has lost a child in an accident, my heart was broken for her. you listened and now understand slightly, the pain that it causes. never goes away, you just learn to get through the day. you are a good man. i actually choked up reading your update. i wish nothing but the absolute best for both of you and your future family.",
            "I'm glad that most of the commenters in the last post were right--she didn't mean anything cruel by not telling you. She was just trying to be alive.\n\nGood on you for taking it carefully, OP.",
            "I just want to point out. Trevor is not a joke name. It's a great name.",
            "She has survived Hell. You are a wonderful person for caring so much. Best of luck to both of you.",
            "I think that... getting to know you was literarily like the first spring breeze after a long winter. You make her feel alive and almost a new, happy person, probably a feeling that she never thought she would experience before meeting you. The way i imagine it, the \"pictures on a fridge\" type of thing might not have happened quite as idyllically in her previous marriage, if they were young and the guy was an arse (as he sounds). She loved and still loves her son, but the picture perfect family, that she will experience with you. You're a great man. \n\nProbably she's going to need some therapy in the future, processing her son's death, which she clearly hasn't yet. Maybe, if you have a house, and she wants to (when she came longer with the processing part), you can install a little stone plaquet in a nice crner of the garden  \"We love you Sam\", and plant flowers around it, if she finds it comforting. ",
            "> it's hard to imagine her married, with a son, toys on the floor, and pictures on the fridge. it's hard because in a lot of ways it's the life I've been imagining with her.\n\nImportant note:  If part of the reason it's hard to think about this is because you wanted to go through it with her for the first time, and now it seems like it will be less special...  Or, that part of your dream is now gone because she's already done it, you're looking at things the wrong way.\n\nIf she chooses to go through life with you, that choice means more than any arbitrary \"first time\" can mean.  She's a wiser, stronger, and more knowledgeable person now, and she's choosing to work through all the pain from her past in order to move forward.\n\nHer having a shotgun wedding at the young age of 20 to a guy she didn't really love is nothing compared to her adult choice to make a life with you.  So work to put aside your reservations.  Everyone has secrets and regrets from the past, it's just that for most of us they're (fortunately) banal and uninteresting.  \n\nLearn to communicate with her, and let her know she can tell you anything without you blowing up at her or otherwise causing drama.  That's more important than almost anything else in relationships.\n\nBe glad your SO will have the wisdom to appreciate a good marriage and (eventually) a family more than most people do.\n",
            "Heartbreaking story. All the best in your new life together. ",
            "You're a good guy, OP. When I read your original thread, I really thought it was unbelievable that she could keep something like that from you for so long, even now that you've been talking about marriage and stuff. I'm glad she opened up to you, I can't imagine what she's been through.",
            "I can't imagine what she's gone through, because even though my husband and I lost our firstborn to stillbirth, and we got through it... we have two kids and losing them now, I just can't. I read your post, and I'm sitting here choking back tears.\n\nI'm glad you two will be able to move on from this. As a mother who once lost a child, having other children was very healing, but the other children are not replacements.  She has been burying this so deep, and she probably still needs to process this grief. Maybe get a counselor for her individually, and also see if you can go to pre-marital counseling together to help your communication.\n\nHoping for all the best for both of you. ",
            "You said in your original post she didn't want a diamond but didn't know what she wanted. Would it be too much to have her engagement ring be Sam's birthstone? Then he could be a part of your marriage in some small way. ",
            "> But the worst part was after, going home and him not being there- how she'd walk past his room and expect to hear him playing, waking up and forgetting for a minute he was gone\n\n:'(\n\nYou two sound awesome. Best of luck with everything. ",
            "As a parent, I can't even imagine losing one of my boys without becoming physically ill. She went through one of the most traumatic things you can go through as parent and human being.\n\nI'm glad she could tell you.. put in the same situation, I'm not sure I could. She obviously loves you very much.",
            "Nice to read something heartwarming and positive on /r/relationships for once.  All the best to you both!",
            "Damn OP.\n\nIf you wouldn't mind - when the time comes - PM me with registry info?\n\nBest of luck. ",
            "I'd post something substantial, but something's wrong with my computer, the screen is all blurry and I'm having trouble breathing.",
            "God, that's fucking heavy. But it's absolutely, heart wrenchingly beautiful. You're both so lucky to have each other now. Good luck with everything.",
            "What a guy. Seriously. There need to be more men like you in the world.\n\nCongrats, OP. You'll make a fantastic husband and father.",
            "As a mother of a 4 year old little girl, I can't imagine how heart wrenching it would be to lose her.  It is literally my very worse nightmare to have something happen to her or her sister.  I think when something like that happens, you do whatever you can to just survive and keep breathing, like she said.  If that means starting a whole new life, then that's what you do.\n\nI'm so glad you are being understanding.  I read your first post and was really routing for you guys to work it out.  She's been through enough.",
            "Glad it all worked out! You still should discuss marriage with her in a conversation before springing a surprise proposal on her.",
            "Communication wins again. Keep it up through your whole relationship. Best of luck to you both. ",
            "Much love to your gf (hopefully fiancé). That must have been absolutely horrifying as a mother. She definitely loves you to be able to relive that and open up that part of her past. Good luck to you both. I wish you a happy life :)",
            "Good man.  You handled this like a champ.  I'm so very sad for her but happy that she's found a fresh start with a man that loves her.  Best of luck to you.",
            "Well done mate well done. You are a good person. ",
            "best of luck with your life togather.",
            "That is so heartbreaking.  It makes me want to cry.\n\nYou can do all these things with her.  And it's good that you know now because she may have some very painful and emotional moments when starting a new family.  Be there for her.\n\nBest of luck, OP.",
            "I teared up reading this. I'm so glad things worked out for both of you, OP. She deserves someone like you. ",
            "Man a parent burying a child is one of the most unnatural things for a person to have to do. It's not in the order of our usual lives. I can't imagine how I'd deal with it personally. ",
            "I understand your shock and resentment towards her initially. But after this, how can you not feel compassion? \n\nShe's been through hell. Just wants to put it behind her. I can understand that. OP, you can be part of the life she wanted, but never could have had. It's good to hear you're going through with the marriage. I wish you both all the happiness in the world.",
            "Glad everything worked out, OP. Truly sorry for your SO's heartache.\n\nI didn't see the original back when you posted it, but I'm thinking a year or so maybe isn't *that* bad when it comes to keeping something truly life-altering away from your current SO. I mean, as a few people pointed out here, **You** are the reason she's chosen to give herself a second chance at love, and I'm betting she wanted to make sure of it before she confided in you. 8 months? \"Could be a passing phase, better not chance it.\" A year? \"This could be it, but I want to know for sure.\" She was probably getting there, and if she still had a box of things in a closet, I'm sure she knew you would have either found them or she would have shown it to you on her own time. \n\nI mean, it sounds like she came out and told you everything, so maybe that's telling that she was 'getting ready' to tell you, and comfortable enough to trust you with her past. The fact that she didn't withdraw immediately is, in my opinion, a really good sign. \n\nGood luck to both of you! :)",
            "I think its great that you're moving ahead and want to build a life and family together...the proverbial new start if you will.  Here's the issue though...you never get over the loss of a child. Never. Ever.  I'm sure if you reflect back over the past 18 months there were most certainly signs from your fiance indicating the loss and emotional trauma that you were probably at a loss to explain at the time.  \n\nApart from medication, I don't know if your GF went through any counseling or therapy at the time of her son's death, but I highly recommend that she and you considers it now.  This is not something you can get through on your own nor can you suppress it by deleting fb accounts. Its always there...just beneath the veneer ready to surface and will almost certainly affect her (and you) when you marry and decide to have children of your own.  \n\nBest of luck to you!  ",
            "One piece of advice - don't get hung up on her describing her baby as the best thing that ever happened to her. This is quite common in parents. I love my wife and she loves me but we would both cheerfully admit that we each moved into second place in each other's hearts the day our daughter was born.",
            "Did you pass on the wedding invite?",
            "Hey it's time for amateur fiction on reddit again!  Time to tug on the ol heart strings",
            "My condolences to your fiancee on her loss.  That must have been a horrible period of time in her life and I can understand why it must have been hard for her to tell you.\n\nI'm glad that everything is working out for you both.  Best of luck in the future.",
            "This is a great update! I hope she gets her Happily ever after. ",
            "I am blown away by this revelation. You're a wonderful man for standing by her in the face of this revelation. Even better, you still plan on marrying her even after the truth came out. The girl endured an unthinkable hell and you're exactly the kind of person she needs by her side.\n\nBest of luck and may you have many happy years together!",
            "Wow, I hope your good to her because she's dealt with enough.  But I wouldn't blame you for bailing out on that kind of baggage.",
            "I really shouldn't have read this at work. Now I'm having to hold myself together in public. All I can say is I'm happy that she found someone like you that makes her want that fresh start! I wish the best to both of you!",
            "That made me tear up.\n\nAm very happy you both managed to talk about it and have benefited from it. May you both find great happiness in your life together.",
            "That's so sad.",
            "I don't know you, and I don't know her. But you can add me to the list of internet strangers who you have brought to tears. \n\nI wish the two of you the absolute best. ",
            " Finally a happy ending on this subreddit, sheesh. ",
            "Came here with pitchforks, left with a tear in my eye",
            "she still probably should have told you.  maybe mentioned it to some degree.",
            "It's never too late for therapy. That kind of bottling up can seriously mess her up for life. I've seen it happen first hand. ",
            "I'm usually one of the first people to go with the \"dump them now\" advice when I read stories where people find out that their SO has been lying to them for a long time about something major, and I typically feel that that is the best advice to give, but this case is special. I can absolutely see why she repressed these memories and couldn't initially share them with you. OP, you're good people. Update this when you get engaged.",
            "I want to cry. This is beautiful. You both sound like beautiful people.",
            "I have been reading this sub for several days now.  Yours is the second to make me tear up man!  I hope the two of you see nothing but sunny days and rainbows, hear nothing but laughter and song, feel nothing but warmth and love for the rest of your lives.\n\n",
            "As one human to another, thank you so much for being there for this woman. She has endured literally the worst thing that could happen to a person and being with you is giving her something that she needs so desperately...hope. I wish you both a long, healthy, wonderful life together full of children, laughter, and love. God bless you both.",
            "Glad you haven't changed your plans with her. While it's never happened to me (though it happened to a close friend of mine), losing a child is the most devastating thing that can happen to a person and speaking about it makes the person relive every part of the child's life and death. In this case it sounds like she didn't tell you because she couldn't find the strength inside herself (who could blame her?). \n\nStay with this woman and allow her the space to speak about her son...or not. Whichever she prefers. That support will be amazing for her and it will be what a true man should provide.\n\nThanks for sharing. Great stuff. Best wishes.",
            "I never comment, but I love this. I wish the greatest, happiest love :)",
            "> But seeing Sam's brother who looked so much like Sam \n\nWait, Sam's brother? She has another child?",
            "That hit me right in the feels. ",
            "Reads like a shitty short story by a 6th grader.",
            "Omg I'm bawling here... I wish you the best. You seem made for each other. ",
            "I'm so happy you guys were able to get through this, hope the wedding goes off without a hitch and you guys get that happily ever after ending.",
            "Good choice not getting all bent out of shape about this.  I wish you guys the best.",
            "I am at work on break with five minutes left and I'm crying so hard over here",
            "I'm sitting here on Reddit while my 2yo son is upstairs playing and signing quietly during nap time, trying to imagine what it would be like to have a quiet house and I can't. What she went through must have been so completely and totally world-shattering. Good on you for being the kind of man that a woman like her deserves. Hold her close, OP, and I hope you are lucky enough to have children together.",
            "I'm so glad this worked out. She is so lucky to have found you. ",
            "You're a good person for staying with her, OP. Good luck with your life, I hope you guys are happy!",
            "damn onions.",
            "my heart is breaking for her. so sad. you're a good guy OP for being so understanding about this and for being willing to stick with her. good luck with the future. may it be filled with all things loving and wonderful.",
            "goddammit OP, that was so sad, but also beautiful\n\nI wish you the best of luck",
            "I don't know how I could have gone on. You're probably a big reason why she's still alive. Just love her and forgive her. Don't stop communicating. Encourage her to speak with a therapist and offer to join her in sessions if she'd like that. I hope your love only continues to grow and your relationship is filled with joy. ",
            "I just can not imagine how it must be to lose a child, how it probably changes you. ",
            "I don't know how much praying means to y'all, but I will definitely put all of your names in the Prayers for the People at my parents' church. \n\nYou are so so loved, and so strong. I can't imagine living the nightmare that your SO has gone through, and you are so strong for supporting her and being there for her. I will keep you guys in my thoughts. <3 ",
            "Damn it OP. The tears are flowing. I'm glad you are there for her, and I wish you two all the best!",
            "Came for the betrayal, stayed for the feels.",
            "Thank you for sharing. ",
            "Well this made me tear up, best of luck man. You sound like a great guy.",
            "OP, I hope that you two will spend the rest of your days overwriting every single unhappy incident that happened in her life. Power to her for restarting her life and to you for being such a gem of a person to convince her she had to.",
            "Goddamnit that's heartbreaking.",
            "You are a good man. ",
            "That must have been very difficult for her. You are awesome for sticking by her. Having someone like that in her life will help her heal as she moves forward to a new life with you. Best wishes!",
            "I love you OP. I am so glad that this went well for you two and you guys came out stronger.",
            "I hope the best for you man",
            "A sad then uplifting tale. The loss and romance is nothing short of pure poetry.\n\nBest to you both.",
            "Now you have the basis for a truly, sincerely happy partnership. A loss like that never leaves a person. She'll always have that sadness, but a fresh, happy life can make the sadness smaller and more manageable.  It's very meaningful that she shared her story with you. She's now given you all she has, trusted you with her unimaginable pain  - so you must be a great guy. I wish you every happiness. ",
            "Oh my lord.  All I can say is that if one of my kids would have died when they were little like that, I don't know how I could have gone on with my life.  I am glad you found it in you to work through this.  Poor, poor girl.  This breaks my heart.",
            "What a beautiful story.  I can't imagine the emotional overload you both must have felt during this conversation but it sounds like you were both honest with each other and had a really meaningful and important conversation.  This was hard for both of you but it sounds like you both emerged stronger.  Good luck and bless you for approaching this conversation so calmly and supportively.  I doubt the conversation ends here but you guys will be just fine",
            "I don't know what to say except your story made me cry, I really feel for her. I have two boys of my own and I can't imagine her pain. \n\nI really hope you guys have a wonderful life together, it sounds like she makes you very happy. Best wishes.",
            "Now this is true love right here! I can only hope that one day I may find someone like this. She is extremely brave for telling/showing you all this and you should feel honored/proud that you helped her get through these tough times. \n\nBest wishes OP! For you and your future wife!! ",
            "I wish the both of you all the best for now and for when you hopefully are able to have kids (because that's going to be another hard but happy stage).  Thank you for listening to her, recognising her grieving process, you've done the right thing.",
            "So glad you took the time to hear her out instead of shutting her out. Wishing you the best. ",
            "As the mother of three children this shook me.  I don't have any idea how people go on after losing a child. Heartbreaking. ",
            "I had my son when I was 20 as well. And was in a bad marriage that only resulted due to pregnancy. There the similarities stop, but I couldn't imagine losing my son like that. It's a nightmare and I was bawling by the end of your post. \n\nShe has dealt with the grief in any way she could. But she chose you to start over with. That means something. ",
            "I am so happy for you guys. ",
            "Props. Life tends to work out in the end, but it is never the way you thought it should.",
            "Sounds like you two will have an amazing future, that's for sure :)",
            "That's absolutely heartbreaking. People grieve in so many different ways, but I'd be worried about her holding onto such a heavy burden without (assuming) seeking some kind of support and just trying to avoid it. The pain of losing a child NEVER goes away and I fear it all may come crashing down on her all at once. ",
            "damn.  the story is powerful enough, but this is some damn poignant writing.\n\ni wish you and your lady love all the best, OP.  thank you for being there for her.",
            "Better make sure that's a sweet fucking ring, buddy ;-)",
            "I'm so happy you've forgiven her and still plan on marrying her. Thank you for deciding to do that.",
            "I am SO a glad you pursued it in a decent way, and I am also glad she was comfortable enough to open up about it. Losing a child is difficult. The pain never really goes away. And I'm glad you can accept her for who she is.",
            "this is such a sad story with such a beautiful outcome. thank you for sharing.",
            "What an incredibly sad past she has. I hope the best for you guys. ",
            "Listen to your heart. Don't judge her because she's had a kid or an ex-marriage in the past. Ultimately it comes down to who she is as a person and she had good reason to share that story with you when she was ready. Trust your gut, trust your heart.",
            "I'm glad she met you, OP.",
            "You made me cry like a baby. I hope all works out and you can give her the life she was meant to have. ",
            "Marry that girl",
            "Okay can we stop with the onions please!!",
            "this is the perfect update. given what I've read, I've no doubt that she truly loves you and the pain was overwhelming. Great job of her coming out with all of it instead of hiding any details. Sucks that it was hidden before, but it sounds like something one never recovers from, so I can see why it was hidden",
            "This is the only time I've ever cried while reading a reddit post. Good luck with everything.",
            "As a mother my heart is breaking for her. I truly understand why she did what she did. How beautiful that she was able to open up to you and introduce you to her beautiful son. I hope that it only brings you guys closer together.",
            "Too many onions between your first post and this update. ;_____; *sobs*",
            "I'm so glad you were both able to talk about it. I love the way you talk about her. All the best to both of you. ",
            "I'm glad this worked out. Best of luck to the two of you.",
            "I wish you both the best OP",
            "Glad you didn't flip out but instead actually talked to her. ",
            "You're her reason to continue. Be her reason to live again. I know you have it in you. ",
            "Teared up reading this.\n\nBest of luck to both of you. You describe the \"connection\" so well... most people dont get to \"be\" with someone else like that. You seem to know how special it is and so I wont harp on it much other than to say that you both are very lucky to have found each other.\n",
            "Right in the feels, good for you OP.",
            "OP, you are the kind of man I dream of one day meeting - one who loves them no matter what, even when the darkest parts of themselves have to come out. Good luck to you both.",
            "Poor girl, just heartbroken and trying to survive. It must've been so hard for her to put that life away. Lift that little box up onto the shelf, slide it back into a shadow'd corner. Hoping to forget it long enough for life to start again. \n\nDamn.",
            "Such a tragic, yet beautiful story.. Thanks for sharing! Wish you guys the best ",
            "[removed]",
            "Hi OP, it sounds like that went pretty well and I'm glad everything is out in the open now. I'm a parent and can't imagine what losing my child would do to me.  \nHowever, one thing still concerns me. Does your girlfriend have parents, and siblings, and if you know her family how come Sam never came up in conversation. If she does have family I think it would be a good idea if you talked with them about what's happened, with your girl's permission, to make sure the facts are roughly as she told you. She very expertly hid a huge part of her life from you, for understandable reasons, but I'd personally look for some corroboration of her story from someone other than her before I moved on with the wedding plans. Also ask her if there is anything else she isn't telling you, because now is the time.",
            "damn allergies... *sniffle*\n",
            "Congratulations working things out with your made-up fiancee in this imaginary story",
            "I cried reading this. Her story is tragic. But I am glad she found someone supportive. Good luck to you both. ",
            "Holy smokes man.  \n*who the fuck is cutting onions in my goddamn bathroom????*   \n\nSending you two all the best!",
            "I'm sorry for your loss - it was tough to read, and I'm sure it was much tougher to have lived through it. You made it, that's what's important, and you gave a lady the will to push through in life. Hats of to you, and many of us will be waiting when you propose!! :o)\n\n..on another note, you have very refined narration skills. I thought that I was reading part of very well written fiction. Have you perhaps considered writing, or do you write for a living? \n\n",
            "This story broke my heart because I couldn't imagine ever having to go a single day without either of my boys. Fuck, I was not expecting these feels. \n\nI have serious respect for you and for your lady. I hope your life together is everything you both imagined and more. ",
            "well done. good luck.",
            "this actually made me cry. Hope everything goes well with both of you from now on, she has had enough suffering for a lifetime.",
            "Omg this story made me ball my eyes out.  I'm glad that she's found you and has found some measure of happiness.  I can't imagine losing my child.",
            "This brought tears to my eyes. I am so glad to see that this is going to work out for the two of you in the end. I have a 5 yr old boy and a 4 yr old girl and I could never in a million years imagine losing either one of them. \nProps to you for not being angry and walking away.",
            "Fuck, OP, I already cried once today. Come on, don't make me do this..... ",
            "that was beautiful",
            "Ok, this is probably going to get downvoted into oblivion... and for your sake I *really* hope that what she has told you is the truth.\n\nBut... I have a friend who was in a similar situation with a girl.  Met her, they were dating several months, he was in love and had just asked her to move in with him. He then was informed (by an old friend of hers) of a \"secret\" life she had before meeting him.\n\n  When he confronted her about it she broke down and told him the story of her first child.  That she met her boyfriend & moved in with him immediately because her mom kicked her out of the house (Mom's boyfriend had supposedly tried to coerce her in to sex) and she had no where to stay.   This guy then became abusive, frequently raped her, and she became pregnant.  He then ramped up the abuse and started  slipping her drugs hoping she would lose the baby.  It didn't work and she had the baby.  The baby's dad and his parents then started a smear campaign against her, reported her to CPS as an unfit mother & drug addict.  They tested the baby and found drugs in it's system, found her \"unfit\" and awarded custody to the paternal grandparents.  She said she didn't have money for a lawyer and couldn't fight the charges, her family refused to help her,  so she decided to move across the country and put the past behind her.\n\nFast forward a few months... girlfriend is now living with him.  He feels so bad about what has happened to her, and wants to be her white knight, he decides to look into it on his own and try and clear her name in the hope she could get the baby back and be a family.\n\nAfter hiring a lawyer & paying the retainer he finds out that she did have a baby that was born addicted to drugs, and was placed in foster care.  Girlfriend wanted to drugs more than have a child and signed her rights away, the foster family (completely unrelated to the baby) then adopted the little boy.  He then contacted girlfriend's sister who said that girlfriend was kicked out of the house because she was addicted to meth and had started stealing from their Mom & her boyfriend... she wouldn't go to rehab, so they cut off all contact with her.\n\nHe confronted her with this information and she couldn't believe that he believed them over her and broke up with him.  He was heartbroken because he still had wanted to somehow make it work with her.  Since this happened several years back, she has been arrested multiple times for identity theft, check fraud, etc.\n\nVery long story short, please do some due diligence and check out the story she has given you before proposing.  Make sure it is the truth before being engaged/married to a pathological liar.\n\n*Edit: She didn't even know who the father was.\n\n**TL;DR: Friend was in a similar situation and found out girlfriend was a pathological liar, an addict, and willingly gave baby up.**",
            "Advice: Don't go ring shopping after only a year...",
            "What about your girlfriend's family? Have you not met them? Are they in on keeping her old life a secret?\n\nIs she hiding from them as well? And if so, is this because of the accident or for other reasons?\n\nThat she dealt with her grief by cutting people out of her life is pretty serious. She needs to deal with that before moving on with her life with you.",
            "It makes me glad to see something like this on Reddit, amidst all the break-up stories and revenge plots, to see two people who went through so much and come out on top. Upvote. ",
            "Why are you ring shopping after a year? ",
            "#:'(",
            "Wow. ",
            "I wouldn't be ok with someone who hid their past from me for 18 months. The reasoning makes you empathize with her situation, but that doesn't make it ok. She still violated terms of trust.",
            "\"I still plan on marrying this woman. She's the love of my life.\" So say we all.",
            "ring shopping after 1 year?   you're brave OP. \n",
            "Glad you figured it out. I'm amazed that you were so \"shocked\" that she had a life before you. This seems like an immature attitude and not conducive to seeing your SO as a separate person.\nThe fact that you got upset means you feel she 'owes' you her pain, and that's a pretty shitty place to start a relationship.\n\nEveryone has a life before they meet you and start dating you, and sharing her trauma is not something she owed you.\n\nNow that you do understand why she wouldn;t want to revisit a truly bad place, hopefully you've matured. This is like spouses of combat vets. They aren't going to tell you every goddamn detail just so you can feel like you've taken the complete \"tour\" of their psyche.\n\nI am always amazed at how callously and selfishly people view others' trauma, and how they think they must \"own\" everything about a significant other. Very controlling, immature behavior if you ask me.",
            "The funny version of this harrowing story: I know a girl that divorced her husband because he had a secret past...as a professional bowler.  She came across a bunch of trophies and plaques and whatnot, hidden in a box in the back of the attic like kiddie porn.",
            "[deleted]",
            "[deleted]",
            "[deleted]",
            "Omg if you marry her youre a fool. Dont say i didnt warn you mark my words",
            "[removed]",
            "As long as she didn't say she was a virgin, you're good to go, man. ",
            "Sounds like Brendan's pull out game is fucking awful honestly",
            "I'm glad stuff seems to be working out fine, but I'm a bit curious...\n\n>She kept saying he was the best thing that ever happened to me. Hearing that broke my heart.\n\nWhy would that break your heart? How could you *possibly* ever expect to compete with *her child*? And would you want to be with a woman who puts her 'lover' above her child?",
            "Fuck. That. She lied to you about something of that scale and you think it's okay? Good luck to you in the future.",
            "[deleted]",
            "i’m glad you had this moment, but the fact you were mad about someone having a life before you is really immature and not healthy. she could have had any number of reasons that she didn’t want to tell you these things. maybe she just wants you and none of that associated with you?\n\n"
        ]
    }
]