[
    {
        "post_id": "lqdjmb",
        "author": "helpmewithmail",
        "title": "UPDATE: I (24m) cannot stand my boyfriend’s roommate’s (26f) dog and I’m trying to understand why and get past it",
        "url": "https://www.reddit.com/r/relationships/comments/lqdjmb/update_i_24m_cannot_stand_my_boyfriends_roommates/",
        "score": 5470,
        "num_comments": 118,
        "created_utc": 1614069449.0,
        "selftext": "[Here is the original post.](https://www.reddit.com/r/relationships/comments/kfhw2j/i_24m_cannot_stand_my_boyfriends_roommates_26f/?utm_source=share&utm_medium=ios_app&utm_name=iossmf)\n\nMy first post didn’t get the most attention, but there was been a major recent event that made me think it was time to post an update. \n\nHis roommate went away for the weekend (Valentine’s Day weekend!) and it fell on us to take care of the dog. I, obviously, was not too excited to be having to schedule my Valentine’s Day weekend around this dog’s needs, but was willing to do so to have a weekend alone with my boyfriend.\n\nWell, much to my surprise, the dog is a total sweetheart! When her owner is not around, she barely raises her voice, sleeps most of the day, and is extremely easy to care for! It would appear that it is really stuff like the incessant baby talking that *actually* bothers me, not the dog itself.\n\nThrough observation, as well, I’ve realized that the dog only barks and whines because she knows she’ll get attention or food *from her owner* whenever she wants. My boyfriend has very cleverly trained the dog to know that that doesn’t work on anyone else. So no begging from us!\n\nSo now I ignore the roommate’s dealings with the dog, love the dog herself, and let my boyfriend’s roommate deal with the worst parts of owning an old dog and just enjoy a buddy to watch tv with when shes not around.\n\nWin win! Thank you everyone for all the great advice.\n\nTL/DR: Dog doesn’t suck! Roommate still sucks at raising the dog but its much easier to ignore now because the dog is so great!",
        "permalink": "/r/relationships/comments/lqdjmb/update_i_24m_cannot_stand_my_boyfriends_roommates/",
        "comments": [
            "That's a great update OP, thanks! Glad you made a new friend!",
            "Lol I love this post cause it pretty much explains all problems with dogs it’s mostly the owner and not the dog itself",
            "I can relate. I'm a huge dog person, never met a dog I didn't instantly melt over. Except my roommate's dog who is actually really cute but it's 100% the way she fails at taking care of it and having to deal with her yelling at the dog or then super, almost over-coddling it 10 seconds later that has made me grown resentful about having a dog in the house. But when she's not there and I walk past his crate, he's a sweet boy. It's just my roommate's \"training\" that I'm resentful over.",
            "FWIW, Kids operate pretty much the same way.  My nieces and nephew were/are all nightmares of whining, crying, begging and arguing around their parents, yet perfectly pleasant little people when they are alone with me because they know those behaviors don't do them any good.",
            "I can totally relate to this post. My best friend moved back into her family home after finishing her degree down in the USA (we're from Canada!). I absolutely adore dogs but never had the pleasure of owning my own. For some odd reason, I couldn't stand it when her family dog is active around the house. Their pitbull jumps up and would claw up my arms and legs because he's just too excited to have people around. This doesn't just happen when people arrive, but the entire time guests visit. He will get on the coffee table and knock over drinks.  You can't leave food unattended on the kitchen counter. If you leave your bag hanging on the coat hook or chair, he will take off with it. He loves to steal shoes and hide them in his bed. He will beg, whine and vocalize his frustration. It got to the point where I asked if the dog could stay in his crate while I visited.\n\nHis behavior didn't change until her parents went away on vacation. It was like night and day. He was so well-behaved; no begging, no whining, and no jumping. He would listen to commands. My best friend was the main caregiver to this dog until she left for University, then the dog became a family dog. Her parents lapsed in his training and let him get away with everything while she was away. All those manners snapped back once he realized she held the keys to his food, toys, and walks.\n\nLike someone else mentioned. There are not problem dogs, just bad owners.",
            "I didn’t see the original post, but from reading it just now, I definitely got the impression that it wasn’t a *dog* problem, but an owner problem. Some pet owners can be insufferable when it comes to their pets.",
            "Ive always said that its not dogs barking that bothers me in a neighborhood, but the owners that yell at them to stop barking.\n\n'Bella!  Bella , stop! Bella!  Bella COME HERE .  HERE NOW!  BELLA COME!\n\n\nget a fucking leash or dog run.   (They finally did. Small miracles)",
            "I've never met a dog I didn't \"like\" but I've certainly met plenty of people who rubbed me the wrong way.",
            "The roommate isn't \"raising\" the dog. It's an elder rescue.",
            "Pets are merely a reflection of the boundaries we do and do not have.",
            "One of my daughters baby talks to our pets and it makes me want put my head through a wall. It’s so irritating!",
            "It also could be the dog settling in, dogs that are passed around can take months to adjust to their new surroundings and act overly emotional at first.",
            "Just read your original post and thought she has an human issue not a dog issue! She'd drive me insane too.",
            "Your original post didn't get the most attention? You literally got dozens of helpful comments, advice and even one person telling you you have no idea what the dog must have gone through in its 12 years.",
            "LOL glad you and the dog are talking again, i really shipped you two",
            "My boyfriends mom treats her BIG ASS dog like a baby, even went so far as to say “she really little in her mind” & since getting her dog, it’s been hell going to her house! She also does the baby talk, not only to her dog but to my 12 (13 in 2 months) old daughter too. We all hate it.",
            "im in a similar situation. i freaking hate my boy friends dog. i dont really know why either. it is a tiny dog. it probably weighs about 4lbs. i hate him so much though. he lets him climb on the dinign room table when we are eating. he lets him chew up his nice furniture. he pees and poops everywhere. he is useless. he doesnt follow any commands. he is home all day for 9plus hours alone. i kind of feel sorry for him but its my boy friends fault.",
            "Just wanted to chip in and say, if the roommate is talking to the dog in a high pitched (baby)voice consistently, the dog likely perceives it as whining in “dog speak”, and perceives it as how they communicate. \nI have no helpful advice, but thought this might be a helpful piece of info.",
            "Wow. You found out your answer quite smoothly. If the problem was the roommate, speak with the roommate about the dog.",
            "The owners energy has a lot to do with how the dog reacts. Dogs really pick up on when a person is unsure in what they say or anxious, and will mirror that energy. Maybe observe how the roommate comes off or watch some dog whisperer so you can say you were watching and was wondering how they feel when giving commands or when the dog is passing other dogs/strangers.",
            "That dog have their owner wrapped around its finger, wth😂😂\n\nReminds me of a story i got told by a dog training instructor i know. She had this small dog who couldn't sit, so she caved a bit and gave it a treat for just initiating sitting. Then one time her granddaughter (5 or so at the time) came and told the dog to sit and it sat down perfectly and my friend was so baffled and asked her granddaughter how she did that😂😂",
            "Glad you realized it's the roomate who's the problem and not an innocent dog.",
            "I’m not surprised after reading the other thread. Who the hell just leaves a puddle of dog pee sitting there to sip a latte? And then makes their roommate clean it up after a guest steps in it? I seriously question wether that roommate is responsible enough to care for a senior dog, but that’s neither here nor there given your place in the situation.",
            "Baby talk to animals is so annoying. They aren’t babies! You’re just making weird noises and it is so grating!",
            "I think you are sick of sharing your place with the roommate.\nProjecting onto the dog.\nMaybe there’s more tension in the house when you’re all there",
            "Glad you finally learned that the dogs issues come from the owner and not the dog itself. It’s great things are better for you now.",
            "Why did the roommate leave for the weekend? Did it just happen to be Valentines weekend or was is Valentines related?  I hope your boyfriend got paid/compensation even if it turns out to be a good dog.  This isn't about the dog, it's about the owner and being accountable.  Unlike in your original post where she watched your boyfriend clean the dog's pee because she had to drink her latte before it got cold.\n\nThere has to be a premium, especially when it's Valentine's and taking care of a someone else's responsibility interferes with plans/limits freedoms.  I was asked to cat sit for during Valentine's weekend.  I would not budge of $80/night, they thought it was expensive but I would have had to be responsible for the cat during my own valentine's plans.  I could only think the owner's had valentine's plans out of town.  I think they wanted quality and peace of mind at a low cost.",
            "My dog was nearly perfectly behaved (GSD) when I moved in with a roommate. Now not so much. Can't wait until I find a new place. It sucks how living with a person who has bad behavior can make a good dog terrible.",
            "I actually had a very similar experience with my mother in law’s dog. When I spend time with him one-on-one, his behavior improves dramatically. Glad you figured it out OP :)",
            "She might not have trained the dog in a good manner.",
            "Aw, dogs are rarely the problem it's humans that enable bad behaviors and then wonder why they've lost respect and control.  \nI'm glad you two became friends <3",
            "I went back to read your first post before reading the update and I didn’t get halfway through before I thought “sounds like the roommate is the problem, not the dog”. Glad it worked out",
            "Thanks for the update,  im happy for you !",
            "Now you’ll know next time that it’s likely the owner that’s allowing bad behavior rather than the dog itself. That’s not to say there aren’t naughty doggos too, but I’m glad you realized how great the dog is!",
            "I've had my dogs for ten years. I am the only person they wont bother for food because I am the only person who has never given in to them. I can sit right next to someone else on the couch with a plate of food in my lap and they don't even look my way because they know it ain't happening. Dogs are smart. \n\nI'm glad you and the dog have both found a new bud!",
            "I did not grow up around dogs, for a long time I thought I didn’t like them. Any experience I had with a dog was not a pleasant one.\n\nThen one day, I became good friends with someone who had the *best* dog, RIP Albi. The sweetest angle. He was so sweet and gentle and such a good listener. I had no idea dogs what dogs could be like. Since then, I have met plenty of other great pups. It has also helped me look at the pups that get out of hand in a different light. It’s not their fault.\n\nIt really is all about the owners.",
            "Yup dogs do train their owners. This is the perfect example of that. Some dogs are just too smart.",
            "Head on over to r/DogCultureFree.",
            "What a great update! Her owner sounds exhausting tbh, constantly fishing for compliments. Being demanded to agree that she's just *so cute* with no let up? Even if she is cute, anyone would start resenting the constant demand for validation. No wonder your irritation started extending towards the dog, and I'm glad you figured out it's not the dog at all.",
            "Great example of bad owner not bad dog. ❤️",
            "I was reading the original post and instantly got that the roommate sucks at raising and handling the dog, nothing wrong with the dog itself. Many of the comments were so blatantly off and unnecessarily mean that I think most of them were terrible dog owners themselves lol.\n\nVery happy about this update, OP! Love that you're loving the pup.",
            "Aww 🥲 so glad to see a positive update, doesn't happen too often here & glad you've got yourself a new TV buddy, yay.\n\nCan't say I'm not a bit envious, I wanna dog sooo bad 😭 if anyone knows of the quietest breed ever we may be able to keep it a secret from landlords",
            "Lol I read the original and I already knew it was the roommate that was the problem. She sounds terrible. Good luck with her.",
            "I hear ya! Most newborns are like this. You are not alone. 4 hour stretches overnight at this stage is pretty great! Daytime naps are a struggle usually. It’ll get better!",
            "I read your previous post and I kept thinking “that’s not the dog it’s the owner” I’m really glad to see this update. I was a dog sitter in college and a lot of my “problem” dogs were only a problem for their owner.",
            "Love dogs, but I can't stand dogs that bark or whine or badger me or others during a meal. It's really bad behaviour and I have absolutely no idea why people like this behaviour or encourage it. My in laws have dogs who behave like this, I tolerate it in their home but really wish it didn't occur.",
            "The human is always the problem",
            "stop in the middle of conversations if the dog simply ADJUSTS its position when sitting to say “awww look isn’t she so cute?!” I can only confirm that the dog is cute so many time in a one hour period before going insane. It’s a constant stream of “awww [dog’s name] is so cute I love her awwwww.”\n\n\nmy BFF and I do this abt our own dog all the time but it's ok because  we are both equally gaga over the dog.\n\nwe both know that each other is the only other person who will never get tired of hearing how awesome the dog is :)",
            "There is a saying there are no bad dogs, only bad dog owners.",
            "I'm glad you got it figured out OP. Reading the responses on your last post though was crazy. It's amazing to me how much bad dog behavior people don't think is an issue. Like a ton of the responses were that you should be happy that the dog got a loving home regardless of its behaviors. Um, what? I love dogs, however I do not like untrained wild dogs. We have a friend who has a husky and every time we come over it jumps all over me, raking it's nails down my arms, backs or legs. It mouths on me constantly and it can't be out away because it will cry and bark the whole time if she's seperated from us. It's not like this is a puppy either, it's just never been taught to not jump, or behave. Another family has a small dog but the family let's thr dog lick their feet constantly, so every time I go over, this dog tries to lick my feet and it's so fucking disgusting, I hate it so much.",
            "You should tell them to get a dog sitter instead of dumping it on you",
            "There are no bad pets, just bad owners.",
            "Dogs are so much easier than people."
        ]
    },
    {
        "post_id": "savz9y",
        "author": "Downscale421",
        "title": "UPDATE I'm (27F) concerned about attending my sister's (30F) wedding after major lifestyle changes",
        "url": "https://www.reddit.com/r/relationships/comments/savz9y/update_im_27f_concerned_about_attending_my/",
        "score": 5447,
        "num_comments": 129,
        "created_utc": 1642951464.0,
        "selftext": "OP: https://old.reddit.com/r/relationships/comments/rzzk0q/im_27f_concerned_about_attending_my_sisters_30f/\n\nThank you everyone who gave me a lot of good advice! Sorry for not responding in that thread, real life's been a whirlwind lately, yay someone at the office testing positive for covid.\n\nLong story short, I did as redditors suggested and did a zoom call with my big sister, ostensibly to catch up but really to get a handle on how things have changed.\n\nMy sister was actually really great and supportive about my lifestyle changes. She apologized immediately for the 'jokes' when she saw how much weight I'd lost and was super supportive about me not drinking anymore and coming out of the closet. She is not the problem, at all.\n\nThe problem is our parents. From what my sister said, my mom especially has been steadily alienating everyone in the family. When I left, she found a new target in my little brother. When he joined the military and left, she started going after my cousins. My big sister, the one who's having the wedding, has always been my mom's favorite, but she says that she's opened her eyes to how my mom treats people and is planning to move away herself after the wedding (our parents are paying for most of it).\n\nI've agreed with my sister that I'm not coming to the wedding. We agreed that it would give mom a new target to make a huge scene over, and there will be an open bar at the wedding when I don't trust myself to be around that kind of thing. \n\nWe're now planning for my sister and husband to come visit me in my new city sometime after the wedding. \n\nThank you for all the advice and support!\n\n---\n**tl;dr**: zoom called big sister, she's great, I'm not going to the wedding but my sister will visit later",
        "permalink": "/r/relationships/comments/savz9y/update_im_27f_concerned_about_attending_my/",
        "comments": [
            "Love this kind of update, you and your sister sound like you have loads to celebrate, in your own time, in your own way.",
            "It sounds like you and your sister are well-equipped to have a healthy relationship with each other, which is great for both of you. Sorry that your parents are toxic but glad you're setting boundaries to maintain your own well-being.",
            "What a great update! It didn’t seem like there was any healthy upside to you going. I feel a little bad for your sister, because she knows your mom rules the day, not her, but happy she’s seeing the light. Maybe you and your girlfriend can plan to have a nice lunch or dinner on the wedding day in her honor and raise a toast of sparkling water to the happy couple.",
            "Wonderful update, hope you and your sister make some lovely new memories together from now on!",
            "Such an accomplishment to overcome your past…congratulations!! This is such a refreshingly grown-up way to deal with a sticky situation. I’m glad your sister was supportive!",
            "Woohoo! My AA sponsor told me not to attend any event where there would be alcohol if I wasn’t “spiritually fit.” I think you sound spiritually fit, but your mom is maybe a little bit of a black hole that could suck away said spiritual fitness. \n\nA lot of times, people don’t feel like they can opt out of big events like a wedding, so I’m very happy you made the choice to stay away. And with your sister’s support! So many wins here.",
            "This just made my heart so happy. Thrilled seeing this sub actually help people through stuff. Congrats on reconnecting with a family member and making healthy choices!",
            "What a great update! I'm so happy you were able to have a good conversation and that your sister is understanding and supportive. I'm sorry that your mom is cruel, but you don't have to let all interactions with you family members go through her. She doesn't control you or your sister anymore.",
            "> She apologized immediately for the ‘jokes’ when she saw how much weight I’d lost￼.\n\nI’m saying this as a personal trainer and healthcare professional who has very strong opinions about people with high BMIs, but I’d hope she would’ve apologized even if you hadn’t lost the weight. Yes, being overweight is objectively bad for you but being overweight doesn’t make someone a bad person deserving of bullying.",
            "This is a great update. You handled this situation beautifully.",
            "Maybe after the wedding and their honey moon you could have a sister bonding day!",
            "> My big sister, the one who's having the wedding, has always been my mom's favorite, but she says that she's opened her eyes to how my mom treats people\n\nBeing the scapegoat of a narcissistic parent is a horrible experience, but being the golden child can mess up a person too, just in other ways.",
            "This is so great! I am glad that you got to connect with your sister and we’re able to not only do what’s best for you, but have her support and understanding!",
            "Lovely best of. Sis came through.",
            "Point out to sis that if she plans on having kids, her parents will probably play favorites with the grandkids too.",
            "Such a great update. You take care of yourself!",
            "Sounds like OP and her sister have a really open and honest relationship. You love to see it.",
            "Such a wonderful update!",
            "Woot you go !  that is such a wonderful update and it sounds like you are getting your sister back :)",
            "I'm so happy you were able to get such a great update! It sounds like you and your sister could really build a great relationship with one another after everything that's happened!",
            "It’s heartbreaking what bad parents can do. I’m so happy you’re in a better place",
            "[removed]",
            "I felt really good reading this. This seems like a great outcome. I'm really happy for you.",
            "Aw that’s awesome. I’m so happy for you. I hope you have a good visit with her soon.",
            "I am 4 years sober as of last week and I want to congratulate you on your not drinking and also seeing a potential difficult situation with regards to keeping that way and addressing it head on with your sister.  That takes courage, and I am glad you and your sister get along so well that she is supportive.",
            "I can't say I blame your logic, I just find it sad when a family allows one single person to dictate anything and everything. Like, these 20 people can't have a get together because this 1 person *might* get mad. Eh.",
            "Wow, your sister sounds awesome. Good on you two for sticking together and working together to protect yourselves from your mother.",
            "[deleted]",
            "What an amazing update! Congrats to both of you.",
            "Excellent.  Sounds like it was tough but you (and your sister) worked through it.",
            "Wow!! Congratulations on all of the positive changes youve made!! I hope i can be more like you some day!",
            "This is a great update for both you and your sister. It's a great step to be able to know where to draw and maintain healthy boundaries for yourself and it sounds like you're doing a great job.",
            "Hey, good for you!  Your whole story really warmed my heart.  Shine on!",
            "you did amazing! so happy for you. wishing you the best.",
            "Great outcome! Yet another example of how you've taken control of your life. I'm glad you took a chance on your sister and that it paid off.",
            "You could go for the ceremony only.  Sit on the grooms side and wear a mask.",
            "Good for you 😊 \n\nI love happy endings",
            "This makes me so happy.",
            "I only just read your initial post, but relating to certain parts of your story made me want to share with you that this random Redditor with daughters is proud of the choices you’ve made and the path your on. Keep showing the world who you are.",
            "You got this!!! You’re gonna crush it",
            "I'm happy that it turned out so well. But ... The apology for the joke feels backhanded to me. Of course I wasn't there to hear it so I can't truly tell but it's the fact that you said she supposed as soon as she saw how much weight you'd lost. Even if you were still at your heaviest, those jokes were wildly inappropriate and hurtful. If you hadn't lost weight, would she have apologized to you for making fun of you? I'm sorry. That just seemed really off to me. I sincerely hope I'm wrong though and that she truly has put away such toxic behavior.",
            "This is beautiful. In your original post, you mentioned that your mom used the phrase “people who think they’re better than us.” This is a huge red flag, and I was crossing my fingers after reading that that this was exactly the result!\n\nGood luck with your new life!",
            "Amazing update thanks , my best friend is in the same situation but he still don't want to tell his family after almost 3 years , sometimes family is the most difficult",
            "Happy it worked out for you.",
            "I hope you learn to piss standing up. Very important tradition in some circles"
        ]
    },
    {
        "post_id": "bctq5b",
        "author": "LadyGrey90",
        "title": "My (28F) colleague (30F) didn't invite me to her wedding, and it's completely unravelled our friendship",
        "url": "https://www.reddit.com/r/relationships/comments/bctq5b/my_28f_colleague_30f_didnt_invite_me_to_her/",
        "score": 5424,
        "num_comments": 596,
        "created_utc": 1555181091.0,
        "selftext": "One of my work colleagues is a lifelong friend of mine. We lived on the same street growing up, went to the same school and when I needed a job after graduating university, she made me aware of an opening at the company she worked at. I applied, got the job, and it's been quite a few years since and we still work together.\n\nIt's a pretty small company, and quite male-dominated, so after we started working together we became really close. We take all our lunches together, we regularly stop by each other's desks for a chat, and we quickly became known round the office as inseparable.\n\nA year ago she got engaged to her long term partner, and I was ecstatic for her. She had a really tough time a couple of years ago (two family deaths close together) and I did everything I could to be a good friend to her while she was in the worst stages of grieving. She cried with me daily for weeks and I made sure she knew I was always available to listen. I also took about a third of her workload off her voluntarily, so she could take days off when she needed to without stressing about her work building up. So now that life has gotten better for her and she's always smiling and excited, it's really nice to see.\n\nEver since she got engaged, as expected, she's talked a lot about wedding plans, especially at our lunches. I know basically every detail. When she booked her venue she was really excited, but she refused to tell me where it was going to be, saying that she wanted it to be a surprise when the invitations came out.\n\nThe wedding is two weeks away now, and I've long since stopped waiting for my invitation to show up. I know when they were sent because she told me all about delivering them, and shows me every day the gifts people have started to buy off their registry.\n\nI feel silly for saying it, but the more I think about it, the more hurt I feel that I haven't been included. It's a big wedding, and she has invited some other people from work that I didn't know she was even close to. She hasn't mentioned the reason why I'm not invited, and at this point I feel too awkward to ask. I guess it's just a slap in the face because I really thought we were close, and now I'm realising that maybe we're not.\n\nThe trouble is, since all this I've started to really examine our friendship, and I'm wondering if she even cares about me at all. I can think of a hundred examples of where I've helped her work through decisions, listen to her vent, stood up for her when she's had issues with colleagues etc. Even tons of little things, like if anyone brings in cake and she's out of the office I always save her a slice so she doesn't miss out. But I can't remember a time that she did anything for me in return.\n\nNow when she talks to me, I've realised she doesn't even listen to me. When I'm finished talking she just carries on with what she was saying before, almost as if I'd never spoken at all. If we're ever talking about me or something I've been doing, she never has anything to say. She just kind of nods and then switches the conversation back to herself.\n\nI'm starting to think she couldn't care less about me, she just likes having someone around who she can talk at, and whoever that person is doesn't really matter to her.\n\nI've invested so many years into this friendship, it's really cut me deep. I feel used. It's also made being at work incredibly lonely, because she was my only friend.\n\nI've stopped having lunch with her and any time she tries to chat I politely bring the conversation to a quick end and go back to work. She doesn't appear to have even noticed.\n\nI do still wish her well, I'm still glad for her that life has turned around and she's so happy, but I'm a bit lost. I'm not sure if I'm being too harsh because I'm hurt, or if I even have the right to feel hurt in the first place, as I know weddings have a finite number of guests and you have to leave people out that you would invite in an ideal world.\n\nBut I'm not sure there's any way back from this either. Has anyone else had a similar experience? Am I being unreasonable or overdramatic? Should I just let the dust settle and see how I feel then?\n\nEdit 1: Just to clarify things that have been asked a lot or requested to be put in an edit - 1) She hand delivered the invites to other people at work so I know it hasn't been lost in the post 2) I haven't asked her about it because I'm a total doormat and scared of difficult conversations and 3) I invited her to my wedding, but that was years ago so it's possible she thinks things have changed since then.\n\nEdit 2: This has got a lot more attention than I expected, and my first ever gold from a kind stranger, thank you!\n\nI have read every single comment, thank you all so much for taking the time to give me advice. You have given me A LOT to think about.\n\nOpinion seems to be divided over whether or not I should confront the wedding invitation issue or just let it go. I am definitely going to make sure that it isn't a mistake, but as for getting an explanation why she didn't invite me I'm undecided. I'm going to have a think about that and the best way to proceed, but your thoughts have all been really helpful.\n\nIn terms of our friendship in general, I'm not going to be too hasty to write it off. I'm going to try and put my feelings aside and see if I'm right about it being one-sided. If it is then I will have learned a good life lesson, and if I see it as worth saving then I'll have to deal with that the best way I can.\n\nIt does seem the bigger issue here is my non-confrontational approach to my relationships. Some of your comments were hard to read but only because I know you're right and this is something I have to change. I've withdrawn from friendships before because they've hurt me and I've felt unable to say anything, and that's not really fair.\n\nIt's a general problem I have with uncomfortable conversations. Whenever I have to have them I basically descend into a panic, my mouth goes dry, I shake and I can't find the right words to say. If it's a bad enough problem that I can't ask a good friend a simple question then I can't ignore it any more and I need to work on this. Thank you for pointing this out to me as a real problem, I'm going to find a way to get better at it.\n\nI will post an update of what happens, thank you again!\n\nTL;DR My best work friend didn't invite me to her wedding, and since then I've started to question our entire friendship. I think it's permanently damaged everything we had, and I'm feeling really hurt, lost, and unsure of how to proceed.",
        "permalink": "/r/relationships/comments/bctq5b/my_28f_colleague_30f_didnt_invite_me_to_her/",
        "comments": [
            "Why don’t you ask her why you didn’t get an invite? If you thought of her as one of your close friends, seems like it would be worth the effort.",
            "I think the people who have suggested talking to her about the invite have the right idea, but because of the other issues you mentioned (mainly the seeming lack of reciprocity and care), I wanted to mention something additional.\n\nI have no idea if this is what is happening with this person, but something I've slowly come to realize over the past few years is that - due to my nature - some people come to see me as a kind of Attention and Care Utility. Like just open the tap and you'll get a pretty good listener, and someone who can be counted on to really try to be helpful and empathetic.\n\nBecause I am so reliably this, and because I do this right off the bat, regardless of how  \\*I'm\\* treated, two things often happen:\n\n1. a certain type of person realizes that this is a service I provide that they don't have to do anything more than activate. Consciously or un-, they realize I do this \\*regardless of what I'm given\\* so they realize they don't have to use energy to be reciprocal with me.\n2. I do this automatically and without ever evaluating if the other person has earned this level of attention and care.\n\nNow, part of why I did this is because who wants relationships to be transactional?? And if I am a generous person, doesn't it require me to live my own values regardless of what I'm given?\n\nWell, I've started to realize that there has to be some middle ground. It doesn't have to be transactional, and I am going to continue to be a generous person who wants to provide a lot of deep attention and care...but  I need to make sure I'm not burning up that energy on people who can't help me renew it by returning some attention and care back to me.\n\nOk that's a lot about me, I'm sorry, but I just see in your description of what you've now realized if this might be a mechanism at work with this person and in your life. And if so, I've realized a by-product of this dynamic is that this kind of person, in addition to not feeling a need to reciprocate, per the above, also never feels the need to, for lack of a better word, do anything to earn my friendship.\n\nSo I could see this kind of person seeing their invitations as currency to spend to increase intimacy or impress someone they want to cultivate a relationship with but since you're already on board with providing hot and cold running care and attention, she doesn't need to \"spend\" an invitation on you.\n\nSomething I've had to do with some of these relationships is just re-frame them. I need to not think of this person as someone who can give me the kind of empathetic warmth and concern I might like, but they might be fun! They might be interesting, or they  might help the work day go by faster. But I no longer expect them to meet certain emotional needs, and I also, frankly, have put a bit of a limit on the hot and cold running care I was providing. Not punitively, but as self-protection. (And usually they don't seem to even notice! So I was wringing myself out for...what, exactly?!)\n\nAnyway, I hope I haven't gone too far afield of your original issue, just some things that the additional details really made me think of in my own life.",
            "I had a similar situation (sort of). I was best friends with a guy since we were 13. He had some success in his life and we remained very close. He ended up dating a woman who was/is pretty famous. A short time after he started dating her, I found out from my mother's friend (who didn't know that I didn't know) that they were engaged. She had heard about it on the news or from some website. I looked it up on my phone and found out they had been engaged for two weeks. I still sucked it up and congratulated him. I was very upset, but kept it to myself because I didn't want to ruin the happy time for him. He talked to me about the wedding and how it was going to be very small, in her home state. Only immediate family. I joked I was disappointed that I wouldn't get to see him get married (years earlier he had told me I would be a \"groomsman\" when/if he ever did), but that I understood why they would want to keep it small. Months later, they get married. I see pictures on different websites and his sister and mothers FB pages. There were well over 100 people present at that wedding. Standing up next to him was his college roommate (obviously not an immediate family member) and my heart broke. Then, it hit me: our friendship had been one-sided for years and I didn't even notice or cared to notice. When it was his birthday, I would call and wish him a happy birthday. On my birthday, I wouldn't hear from him or I would hear but he would make no mention that it was my birthday. Not finding out about his engagement and not being invited to his wedding opened my eyes. After that, I stopped making an effort and he seemed to notice and stopped making one in return. About 2.5 years ago, he emailed me saying he didn't know where the friendship went but would I help him with a new TV project he was working on. I used the excuse that I was too pregnant (I was) to give it 100% of my time. He didn't congratulate me or anything. That sealed the deal for me. \n\nMy advice to you is to ask your friend whats up. My guess is that this friendship is one sided like mine was, but either way, you'll have some  closure to the friendship. Don't wait years to get that closure because it will eat away at you.",
            "\n\n“Look, it’s been on my mind and I’ve just got to ask: You’ve delivered all of your wedding invitations and I didn’t get one and why is that?”",
            "have you asked her? An invitation could have gotten lost in the mail.",
            "I'm confused why, if you see and talk to her every single day, you didn't mention when you never received an invitation?",
            "this has happened to me so many times in all types of relationships at all stages in life. I’ve honestly accepted that the few people that care are really the only ones. i’m kind and people use that, i wont change myself to be accepted by someone else. it is not wrong for you to feel bad that you were not invited, but you should never ever regret being a good person.",
            "I just want to address you feeling lonely at work now. Instead of spending all of your time with one colleague resulting in a work bff, its better to have a bunch of colleagues you can consider your friend. I know it might seem too late to do that in your current office, but hey, you've still got a long career ahead!\n\nAfter personally being in a similar relationship dynamic for years, I realised that it's always better to spread your source of energy, time and happiness, and not depend on one person/thing in any walk of life. People change, values change. You're more safeguarded this way.",
            "So clearly she hadn’t invited you and there’s no missing invite as she hand delivered to other people at work. So at this point I don’t think I’d bother asking. It’s pretty clear that she’s using you as an ear to yack at over lunch but she doesn’t see much actual friendship between the two of you. So if I were you I’d just continue doing the fade.\n\nIt’s super tacky to talk endlessly about your wedding to someone you’re not inviting.",
            "Youre doing great already with the fade.  💗💗",
            "You should ask her why you didn't get an invite. You've been friends for years, she's gone on and on about her wedding plans to you.",
            ">I think it's permanently damaged everything we had\n\nUnless there's been a massive, MASSIVE misunderstanding here. Like, she had a blank and thought she'd given you your invitation and received your RSVP already (highly unlikely since the wedding is only two weeks away, but I guess stranger things have happened), I actually think this has helped you open your eyes to how little you've gained from the friendship and how selfish this person is. I would go so far as to say there wasn't much there to damage in the first place, apart from, sadly, your own belief that this was a reciprocal friendship.\n\nIt sounds like while you're good enough as an emotional crutch when she needs you, you're not *quite* up there enough to attend her wedding when she doesn't. You may well have made the list at some point, but got bumped off as other people were thought of and yeah... I would be extremely hurt too in your shoes; she's being incredibly thoughtless and selfish right now. \n\nIf I were you, since you're beginning to realise how one-sided this friendship has been, I'd continue to pull away and make yourself less available to her. It's obvious to me that you were deliberately not invited, so I don't see much point in you bringing it up off your own bat. If she asks you if everything's ok (either before or after the day), you can then matter-of-factly tell her that not being invited to her wedding hurt you, but don't go much further than that. If she tries to justify herself, tell her it's fine but you'd rather just be left to carry on with your work.\n\nI wouldn't count on this happening, though. She sounds way too selfish to worry about anyone or anything other than herself and her wedding, and I wouldn't be surprised if you just kind of mutually faded out of each other's lives after this.",
            "You have to ask her if you are invited. If she says no then you will know exactly where you stand and can move on with your life. If she says yes then you can save yourself the heartache.",
            "OP you sound like a lovely friend, that any person would be lucky to have in their lives.\n\nHowever, I worry that you are judging your (ex?)-friend too soon. It sounds really strange if she would go on and on about her wedding, if she didn't intend to invite you. And her venue would only be \"a surprise\" if you would be there to witness it, no?\n\nWhat if the invitation got lost in the mail, or somehow got missed on their invitation list (you said it was a large wedding)? What if she's simply being a bit absentminded and in the clouds, not realising your silence or distance the right way (I can sometimes be obtuse without intending to be, I'm just a little absentminded and daydreamy by nature)?\n\nA more sinister option is some weird jealousy or opposition from the fiancé's side, but even that could possibly have nothing to do with your friendship.\n\nPlease, talk to her. Don't let what could be just a misunderstanding ruin what you yoruself define as your closest friendship.\n\nBest of luck - please keep us updated!",
            "[deleted]",
            "Are you guys so close that in her mind there wouldn’t even be a question about you being a part of her wedding, that it’s simply a given?",
            "A couple of interpretations jump out to me:\n\n1) She is uncomfortable with a person who reminds her of a time in her life when she was vulnerable.\n\n2) She is detaching in preparation for moving on.\n\nAdult friendship is tricky and in my experience much more transient than school or uni friendships. The truth is other relationships tend to take priority as we get older.",
            "She told you about her wedding plans, hand delivered the invitations to coworkers, and even after not inviting you she still has the audacity to talk about her wedding? Wow she’s bold! Hopefully there’s some mistake but I would for sure say something about it.",
            "If the friendship is already floundering, why not go ahead and put it out of its misery. Flat out ask, “I’m sorry and a little embarrassed to bring it up, but may I ask why I was not invited to the wedding? It’s fine, I just wondered why?” \n\nThat way you will know that it wasn’t an oversight of some sort, and she won’t have an excuse later",
            "I'm sorry you're going through this.\n\nI've felt the same way in the past where I've been the giver and others have been the takers. But you don't realize it until years down the line. I can tell you from experience that something like this changes you. It changes the way you form and continue the various types of relationships that enter your life. You become more cautious of giving--but only because you want to receive, too. It's healthy, and it's what you deserve.\n\nWould you be willing to update with us?",
            "I forgot to invite my best friend to my 21st. She obviously came because she knew all the details etc, and I was horrified when she slipped out that she hadn't recieved an invitation. Hopefully it is the same situation.",
            "Simply ask her OP. Say that you care about her and would have been honored to have been invited, but we’re curious why you weren’t invited and if she even saw you as a friend. \n\nWorst case scenario, you learn that she truly doesn’t value your friendship and you move on. Best case scenario she says, “holy shit, did you not get an invite???”  Sounds like a win win.",
            "Simply put she needs you at work as her buddy and that's about it.\n\nOutside of work she's covered by others & deep down she knows she doesn't have to \"work\"to have a relationship with you. Hence the invites I guess.\n\nSorry I disagree with everyone suggesting speaking to her. The woman is a fully grown adult & she is very much aware that you didnt get an invite --by your own words she refused to say where the venue would be at- till the invites went out-- this right here is telling. Even if you did say something, she'll what? I don't see her being honest about it & might even try to minimalize what she's done to make you feel silly \n\nIt sucks- a lot. You sound like me with several other people in my life. Frankly I try to stop doing the whole \"treat others as you would want to be treated\" because nobody every treats you that way...but I have a hard time NOT doing it & then I end up hating myself for it.\n\nGood luck!",
            "So I came here because I thought I was going to read about someone being unreasonable about not being invited to a wedding. But after reading, I'm 100% on your side. This person sounds rude and self-involved and like a terrible friend. If I didn't invite someone at work that I hung out with all the time, I would definitely NOT discuss my wedding plans with them. Especially since she invited other people at work? She should be talking to them about it then. The fact that she hasn't even asked why you've started to pull away or even noticed? Ugh. Remove your emotions from this relationship immediately. This person doesn't give a crap about you and you deserve real friends.",
            "I'm a quiet guy. I was new at a job a long time ago, really tight knit group. Our supervisor was getting married one year after I started working there, really big wedding in the best hotel in the city. Noone every approached me or invited me, and I didn't go - I thought I was a new guy, so didn't hold it against him at all. He told me after the wedding weekend he didn't see me at the wedding - and after I told him noone invited me, just went \"oh... You should've come.\" Just ask her, it obviously means a lot to you.",
            "I'm so sorry that she did this to you after making It seem like you were a valued friend. Unfortunately, the fact that she doesn't reciprocate your compassion and listening skills tells me that you are only setting yourself up for more hurt by bringing up your feelings about not being invited. The best thing for you would be to completely end the \"friendship\" and only speak about work matters. No more lunches, no more letting her confide in you and no more letting yourself be used by her emotionally. \n\nIF she brings up you being distant then, and only then, should you say something like \"While I considered us friends after all this time of being there for you, I realized, after you not inviting me to your wedding and not offering a reason why, that I no longer wish to be in a one-sided friendship. I hope you can respect that and limit your interactions with me to work related conversations. I'm sorry and I do wish you all the best.\" Otherwise you will continue to be disappointed and now that you've seen her and everything for what it is, continuing on the way you were would be foolish.\n\n I'm really sorry and everyday am let down by humans who can treat other humans like this. You seem like a wonderful and thoughtful friend! Surround yourself with people like yourself. Good luck with how ever you choose to end this, but please end it and firmly. 💜\n\nETA - To everyone saying she should be asking her why she wasn't invited, I say this -\n\nThe time to do it is gone. She knows OP knows she isn't invited and SHE should be telling her why, OP shouldn't be asking. Its just the nail in the \"end this friendship\" coffin. The answer is, is that this girl is emotionally manipulative and a user. She didn't value OPs friendship in the same way OP did. If it were me, I wouldn't give her the satisfaction of letting her know I cared about not getting invited. She likes having the upper hand and enjoys how she manipulates people. Seriously, If she valued OP and their friendship she would have told OP why she couldn't invite her BEFORE she handed out the invites to their other co-workers. Since she didn't want to be mature, sorry but fuck her. That's so petty and rude.",
            "> I've invested so many years into this friendship, it's really cut me deep. I feel used. It's also made being at work incredibly lonely, because she was my only friend.\n\nThis is everything you need to know.  You *wanted* her to be your best friend, therefore she *was.*  Also?  As your *only* friend, how could she be anything other than \"best?\"\n\nUnfortunately, we cannot wish something into reality.  There were many things you didn't want to see because they contradicted your desires, would threaten the world you had created--so you noticed nothing.\n\nShe didn't really use you:  you offered and she took what was on offer.  She never thought of you as *her* best friend, nor was she ever obligated to do so.\n\nI think almost all of us have this ghastly moment of recognition, that we've been indulging in childlike behavior, believing that if *we* mean well and do something nice, then other people will automatically treat us in kind.  I believe this is especially prevalent in women because we are socialized to be endlessly nice and self-effacing.\n\nSo, yeah, she was never the person you thought she was--**but she never pretended to be otherwise.**  You were and (presumably) still are lonely, so you needed someone you could pour yourself into and there she was.\n\nI am so sorry, OP.  Please continue as you are and start finding *real* friends.  No, you won't find them immediately, but simply taking part in activities with like-minded people gives you a social life.  And never put all your eggs in one basket like this again:  it hands far too much power to the other person, whether they want it or not.",
            "Since the invitations are out  ask her about the venue again. It lets her know that you know you're not invited in a totally non-confrontational way and might force her to tell you why. If not, say, \"Sounds beautiful, hope it's all you dreamed of\" and walk away with your head held high.",
            "I’m late to this thread, but I’m going to offer a suggestion anyway.\n\nGet her a wedding card (no gift/check, just a nice card), and say something like “I know I won’t be there on your big day, but I still wanted to get you guys a nice card”.\n\nThat way, if you ARE invited, she’ll correct her error on the spot, and if you AREN’T invited, you don’t look petty by bringing it up (after all, you’re offering well wishes and a token gift).\n\nIt’ll cost 6-8 dollars (or whatever a nice wedding card goes for), but you’ll know exactly where you stand, AND will have the high ground when/if you start wrapping up the relationship.",
            "Ok sorry if others have said this but are you POSITIVE she didn't send you an invitation that got lost in the mail (as dumb as that sounds it halpens..) or maybe intend to send you one and just messed up really hard??? I'm currently planning a big ass Filipino wedding and I have to say.. it would be very easy to miss if an invite didn't make it out. I'm even the one doing the brunt of the planning and prep- if a friend or coworker of my partner had a fucked up address on the invite that didn't make it to them or if I forgot them somehow.. my partner wouldn't know unless directly confronted! Particularly since she invited others from the office it's not like there was a hard line on \"no work friends\" (which people do.. weddings are expensive!). Just ask her. If she DID intentionally leave you out.. you were probably giving much more to that friendship than you were getting out of it all along. Good luck with the convo- it's not easy to confront a loved one who has hurt you!",
            "Point blank ask why you weren't invited. Skip all the BS and get right through it. You need to know. It could have been a complete mistake",
            "If you don’t ask her you’ll never know. It’s possible your invite got lost in the mail and you’re bellyaching over nothing. I don’t see any reason she wouldn’t invite you, yet continue to have conversations with you AT LENGHT about the planning and gifts. \n\nJust say, “hey, I’m not really sure what’s going on but I never got an invite and all this wedding talk is making me more uncomfortable than I would like to be around you. If something got lost in the mail I get it, but if there is a reason I’m not invited I would truly like to know why, and if that’s the case ask you to please stop talking with me about the details, because again, I feel awkward.” \n\nJust be an adult and choose your words.",
            "The thing that strikes me most is that despite saying you’ve known her most of your life etc you refer to her as your colleague rather than as your friend. Maybe your relationship isn’t quite what you think it is.",
            "She’s a narcissist and doesn’t view you as a friend, a work friend or otherwise.  And you say she’s invited other colleagues to the wedding? That’s shady. Surely, they’re not as close to her as you are, based off of what you’ve stated.\n\nPeople are telling you to confront her about the non-invitation. Why?? So, you can hear lies about why you weren’t invited or receive a fake verbal invite? No thanks.. \n\nShe doesn’t want you at her wedding and it took her getting married for you to see her narcissistic true colors after all of these years. She’s self absorbed. You don’t need that type of energy in your life.  \n\nKeep your interactions with her solely work related and keep your distance. The dust will never settle, because once she realizes that you don’t want to deal with her anymore, the air between you will worsen. She might even act like she’s been wronged to others in the office.  \n\nGet another job if it’s hard to work next to her now. But, I’d let this fake work friendship go.",
            "Looking for new jobs on a regular basis is healthy: it gives you an idea of where your industry is headed (trends in job postings) and what skills you should be building/focussing on. \n\nAdditionally, it gives you a good idea of what you're worth. The best way to get a pay bump or change in responsibilities is a new job. \n\nYou've been in your current position for a while. Apply to a few things. Interview around, even if it's just in an informational capacity. You aren't enjoying your current work, and the environment is strained. Sounds like it's time to put some feelers out.",
            "If her Wedding is 2 weeks away from now I wouldn't confront her. She didn't include you in a Bachelorette party or anything. You're just a coworker to her, not a friend. Now you know. She doesn't deserve your friendship, you're just starting to realize that it's all been one sided. She already knows or she'll catch on pretty quickly when you never have lunch with her again. It's her loss. Be nice to her but make things all about business, the only thing you should mention about the Wedding is congratulations and you hope that her and her friends have a wonderful time. Brush it off, she's not worth it.",
            "I wouldn’t bother asking. The point has been made. If anything asking just forces both of you into an even more awkward situation. As hard as it is, I would just move on. The fact that she hasn’t even noticed you distancing yourself is pretty indicative of the fact that she clearly doesn’t value your friendship, it is one sided after all. I’m sorry this happened to you but rest assured cutting her off will make room for someone who’s worthy. Plus, if she’s been that inconsiderate, it’ll be even worse after the wedding. What happens when she shows up to talk about her wedding and tries to show pics and such? Since it’s a one sided friendship, I would keep it strictly professional from now on.\n\nSometimes, those of us who are good to others expect them to be the same way towards us. As nice and idealistic as that is, some people are plain old selfish narcissists and care little for others.",
            "While I agree that asking her is probably the best course of action, I understand if as a non-confrontational person you wouldn't want to ask someone you still have to see and work with all the time. \n\nHow about just bringing up the fact that you're thinking of booking something (weekend away, flying lessons or whatever) on her wedding day. Don't just mention the date, make a point of saying something like, (I thought I might take a trip to ______ over your wedding weekend, I've always wanted to see ____). If she shifts uncomfortably, says good for you and then changes the subject, you know she never had any intention of inviting you. If she thought you were invited she'll ask why you're not coming...",
            "What’s your relationship with her outside of work been like over the years?\n\nWhat’s the relationship outside of work like b/w her and the coworkers who got invites?",
            "Do you guys ever spend time together outside of work?\n\n>I'm starting to think she couldn't care less about me, she just likes having someone around who she can talk at, and whoever that person is doesn't really matter to her. \n\nLots of people are like this. Even if they're not narcissistic etc. Lots of people don't actively listen.\n\nIt sounds like you're a warm and loving human being who's forgotten that others don't care as deeply or have as much empathy or appreciation for others as you do.\n\nPeople will ask you to listen to their problems. 100s of times. Cry on your shoulder. 100s of times. Then go home and never think about you. That's unfortunate. But it's life.\n\nAnd it's your job to never care more about others than they care about you. To be cognizant of that and be in sync.\n\nI'm sorry for what you're going through.\n\nRemember that people not appreciating you or your friendship doesn't mean others won't. And it certainly doesn't mean you don't have value. You can be the best friend in the world, but if you're friends with people who suck and are selfish then you'll end up feeling bad about yourself.\n\nGive your time and energy to selfless, empathetic, expressive, caring, loving people. Like you :)",
            "Be happy.  No weekend tied up going to a wedding.  You don't have to buy a gift either.  Score one for you.",
            "You got the answer - this girl is not your friend.  Now is the time to branch out and find some other friends, whether at work or anywhere else.  Don’t waste any more time on her.",
            "Let her go. She clearly doesn't like you. She sounds self absorbed. There are better people to be friends with. You should ignore her completely.",
            "Do you guys hang out outside of work or just st work and lunches?",
            "This sucks OP. It really hurts when you realize a relationship isn't what you thought it was. \n\nI wouldn't address this directly with her. You have to maintain a working relationship with her. Keep doing what you are doing and just pull back on her attempts to make conversation to a polite reply and leave it alone. \n\nAlso, I would make sure that any work any additional work you took on for her is given back to her, or you are getting compensated more for doing it.",
            "Well, it sounds like you aren’t invited, which is hurtful, but it clarifies the relationship (or lack thereof). The good news is that you can have the slice of cake you used to save for her at office functions 😉",
            "Whether or not the non-invitation to the wedding was a misunderstanding, there seem to be deeper underlying issues here. I find those more important.\n\nThe hurt about the wedding made you realize that you are the sole giver in this relationship? You always stood up for her, listened to her problems and cared for here, and this was not mutual?\n\nIf that is true, I would get out of this friendship. A misunderstanding one can clear up, but an unbalanced relationship not so much.\n\nI have had very similar experiences. A friend of mine I valued dearly, and which I did a lot for, stood me up on short notice at a very high birthday. \n\nWhen the initial hurt was over, this made me rethink the whole relationship and I realized that the feeling was not just as mutual as I thought, and that I gave way more than she did. I quit the friendship that moment. I never looked back, not even in anger. Nowadays I look carefully who I befriend - if it is an unbalanced energy hole, I put a stop to it at some point.",
            "How about this as a script?\n\nHer: burbling on about the wedding\n\nYou: What time's the ceremony?\n\nHer: 3pm\n\nYou: OK, I'll be sending good thoughts then, if I remember.  I'll be white water rafting/skydiving/going to pet a tiger at the zoo/seeing my cousin's newborn twins/other awesome thing of your choice.\n\nShe might then say \"Cool, thanks! or \"Hang on, aren't you coming to the wedding?\"\n\nI'm guessing she'll say \"Cool, thanks\" and try to burble further - she seems like that type - and you can then say \"K, must get on with my work\" and pivot away.\n\nAnd then on the day of the wedding - go and do that awesome thing, and keep doing awesome things.",
            "Which ever way this ends, stop having lunch with her and doing anything for her that makes her live easier. Walk away when she talks about the wedding. Do not engage in any personal conversations with her. Keep it all polite business.",
            "Be careful what you instigate. You work with her. Don't do any of this confrontational advice please. Your job and your life are vastly more important than your realization, please know this. I understand the hurt you feel--i was treated like this in a friendship, it hurt. \n\nYou'll never get a straight answer. Maybe she's worried you will look prettier than her. It could literally be anything. It's her special day, just let her have it.",
            "What did she say when you asked her why you weren’t invited?",
            "Here is a question, how long is it until the wedding?  Perhaps she's planning to ask you to be IN the wedding but hasn't finalized the wedding party?  I dunno just spit balling here, and hoping that she isn't that shitty of a person. \n\n&#x200B;\n\nBut if she is that shitty of a person, you dodged a bullet and dont need people like that in your life.",
            "Next time she brings up the wedding, say “I’m so excited to be there!” And see what she says.",
            "You talk a lot about the awkwardness around asking her but what about the awkwardness after the wedding when everyone is talking about it? I feel like you need to get this out in the open. Maybe she truly thinks she gave you your invite and will be offended if you blow it off?",
            "Flat out ask her. I'm pretty sure you already know the answer, but she owes you an explanation at the very least. Watching her mentally scramble for an answer might give you the closure you need.",
            "Why don’t you just ask her ?! I know what you mean about seeing stuff youve never seen before because I’ve been through that, you just have to confront her ? Just say it in a nice manner like “hey how come I wasn’t invited to your wedding”? Bit cheeky of her really in my opinion, but people will be people!",
            "I had one of these. I had a very good friend in college, good enough that when I moved out of state for grad school he and another friend of ours flew in for a week to visit and go hiking together. The 3 of us had spent a lot of time together in college, studying and socially. Afterwards we were in touch regularly. To this day I don't know why I didn't get invited to his wedding. It happens, I assume that in his mind he was moving into a different life. All I can say is it showed me what he was & what he though of our friendship, and I have not seen him since. I did try once when I was traveling for work to where he lives now - he said he was sick & couldn't get together. I left it there.\n\nI guess I'd say if you can ask why you weren't invited it would be good, but if you feel like you can't I'd totally understand.",
            "Perhaps you're just a \"work friend\" to her...I wish I have a more complex answer but It seems you have an unbalanced relationship, you care for her like a best friend would but she only sees you as her work buddy. My advice is to \"demote her\" (lol) to basic girl from work, so it doesn't cause any more heartache",
            "If you’ve invested this much time/effort/emotions, just ask. At least afterwards, you’ll know",
            "I think the fact you describe her as a colleague first, and lifelong friend second is telling.",
            "Please let us know what she says when you ask her. Do NOT let this wedding go on with out at least asking her.",
            "Did you ask her? What was her reaction?",
            ">But I'm not sure there's any way back from this either. \n\nThe isn't.  Send her a card and continue to withdraw from the faux-friendship.",
            "[removed]",
            "[removed]",
            "I would say ( and as a non confrontational person it would be hard) \n“So.......you must be getting excited now. Have you done all the tables? Are all ya work people together?”\nEmbarrass her, screw her lol",
            "Is there any chance your attendance is assumed by her? Because Y’all are so close?\n\nMaybe she just didn’t think she needed to waste money on an invite for you?\n\nEDIT: its been pretty much confirmed that this is not the case",
            "Lol. Seriously, just ask her. No assumptions. Spare yourself the drama inside your head.",
            "I truly don't understand why you haven't asked her about your invite. Maybe yours got lost? Maybe she has some reasoning? Maybe she thinks you don't care as much as you do about the friendship? \n\nCommunication is always key. Just communicate! What is the worst that will happen? She might get upset and you loose the friendship. But it sounds like that is happening anyways without communicating. Most likely you will get some understanding.",
            "If you call her a colleague and not friend is she really your friend?",
            "Honestly if I were you I’d bring this up. Very causally though the next time she mentions something about her big day. “Aww I wish I could be there to see” and see what she responds. You’ll know then in that moment for sure.",
            "Just ask. All you can do.",
            "Wow! I’m so sorry. That would be very hard to process and my feelings would be hurt, too. If you think the only way to feel some resolution is by being direct, I might say,  “hey, your wedding is coming up! I’ve enjoyed listening to your updates as you’ve progressed in your plans. Am I out of line to think I might have been invited? No pressure, I understand that there’s a finite number of people that can be invited, but I’m trying to sure-up my calendar.”  If you’ve decided it’s not worth it to you to be that emotionally vulnerable,  you might accept the idea that you are not as close as you felt. If you do this, I would try to create some distance, but keep relationship friendly and professional. You’ve got a long history, and you’re co-workers,  so it’s probably best just to wish her well. Some people are givers and some are takers. You sound like a giver. She helped you find your job, and you’ve been really supportive and kind. She’s likely benefitted more from the friendship, but you can stop investing. You can give the time and emotion you gave to this friendship to other people, while maintaining civility. Something I’ve had to learn the hard way is that  some people in my life are co-workers who I enjoy, teammates who share a hobby, some are likeminded in our volunteer efforts, and some have a many things in common with me and look after my feelings. The later I call my friends. Hoping you feel better soon, whatever the outcome.",
            "It sounds like you were her friend, but she wasn’t your friend. \n\nI’m sorry you’re hurting.",
            "Whew. It sounds like you've been spending a lot of time and emotional energy on someone who hasn't really noticed. It sucks to discover the relationship wasn't what you thought, but now that energy has been freed up for other, more constructive things. And, I suspect, you will definitely be quicker to notice if someone isn't emotionally good for you. This is a good thing! Life is too short to waste it on energy vampires.",
            "Oh my gosh, I do not think you should ask her why you were not invited! It sounds like she is not as close with you as you think. I only invited a handful of my co-workers to my wedding, and it was a little awkward with a few other co-workers not invited. Sometimes there just isn't enough room. The problem with your coworker is she is your best friend at work! That's so bizzare that she wouldn't invite the person she spends the most time with at work. I would keep trying not to get stuck listening to her talk as often, and make other friends at work who talk with you instead of at you.\n\nGood luck!",
            "It's possible she didn't send you an invite because it was so obvious you were coming.  I would recommend that instead of giving her the cold shoulder you ask \"am I invited?\" directly.  If there's an awkward silence and a no then your cold shoulder is justified and should continue.   If it is yes she probably has a good explanation.   From how you explain it, it seems like you were an incredibly obvious person to invite.   In my experience sometimes when planning stuff like that it's easy to focus on the people who aren't as obvious + distant relations as opposed to best friends who are a given.",
            "She is so close to you she forgot she didn't invite you and didn't even think to hand deliver an invitation to you.\n\nFlat out tell her \"I haven't gotten an invitation from you. Is this intentional or did it slip your mind?\"",
            "OP please just ask her if your invitation was overlooked or if you were genuinely not invited for some reason.\n\n\nI spent weeks following up with my wedding guest list chasing up RSVPs from people whose invitations allowed up super late or not at all (some of them didn't even show up until after the wedding which was Annoying bc we sent them out 8 weeks in advance).   It would be really horrible if her to talk about the wedding with you this incessantly if you're not invited ...",
            "You should really speak to her about it. I had two situations I can tell you about that make me say you should speak to her. I had a college friend that I was close to that I thought didnt invite me to her wedding and I made a little joke to bring it up once and she said she sent one, but since it was the week of her wedding she just verbally invited me then and there but I couldnt trade work days to go anyway.. \n\nSecond one; I have a long distance friendship with someone that I knew from an online game I played at the age of 12; we dont talk as often because we have different lives in different places but she invited me to her wedding that was all the way in TX regardless of that. We actually met for the first time at her wedding; best thing ever btw.\n\nBut anyway, I'm trying to say you really should talk to her. The length of time you've known someone, how close you think are, made me think you were going to be upset that she didn't ask you to be a bridesmaid. If she invited other coworkers to her wedding, I believe she meant to invite you not just because you work together but because you two are friends on top of that.\n\nMail gets lost a lot, I share the same name as someone on the same street as I and I know I list my house number correctly to receive my mail - yet that other person is always giving me mail of mine from her mailbox. 🙄",
            "THIS HAPPENED TO ME. I never got my invite, even went to the bachelorette. I made a reddit thread about it as well and got perfectly mixed reviews. I decided not to bring it up to her and while she was at her honeymoon in Jamaica messaged me saying “why weren’t you at my wedding” I broke into tears! Idk who’s fault it is but I personally never received an invite and I was too awkward too ask. This situation could go either way as my friend wasn’t as cold to me at all as yours sounds but I would be blunt and ask her what’s up.",
            "OP! I hope I'm not too late. I just got married in December and I found out just how stupid and unreliable the postal system is. Several people never received their save the dates or invites. You should definitely ask her if she sent it! It will NOT be weird. \n\nI really doubt she would continue to discuss the wedding details with you if she didn't invite you. I think it's very likely the invitation just didn't get to you. She's probably wondering why you haven't RSVPed to her wedding yet.\n\nIf you ask her and she tells you she didn't invite you, then you can be mad, but don't ruin your friendship by jumping to assumptions. Communication is key.",
            "You feel like she owes you? Nah, she doesn't have to invite you. Don't worry about it. Just be yourself and if you feel like listening to her, go ahead, if you don't, don't. I think she's a biiiiii.... but it's good she showed her true colors.",
            "Maybe your invite never arrived? Or maybe you’re not just as close as you think. I would honestly speak to her.",
            "You said that she hand delivered them to people at the office. Is it possible that she just assumes you will be going and she doesn't need to give you an invitation because you guys have been friends for so long?",
            "This doesn't make any sense. You need to talk to her instead of jumping to conclusions.",
            "I noticed a lot of comments are like, \"Why won't OP just say something?!\" But I can see why it's so hard for you to proceed. It's feeling unheard and unseen that's really problematic, not the lack of an invite. Even if your friend comes up with a valid excuse, it probably won't help you just put it all behind you and move on. The wedding situation changed your perspective of your friend.\n\nOf course this is a much more challenging issue to bring up than just saying 'Why didn't I get an invite?' But it's an issue that deserves attention and you have a right to talk it out. For tough situations like these, \"I feel...\" statements and being as honest as possible are good tactics, I think. You've come to a point where you're already distancing yourself if she blows up at you calling her out, and I think that's better than pretending nothing is wrong...but don't create too much distance before you try to reach a resolution.",
            "Ask about the invite. It's possible something happened to it in the mail. Hell, she could be having these same feelings as to why you haven't accepted the invitation yet.",
            "Please post an update to this it's killing me! You gotta ask my friend or you'll never settle. Always wonder.",
            "She’s an emotional vampire, perhaps even a narcissist. I had a friend like this too and they just use you. The part about all the talk being about them constantly really struck a chord with me. They want someone for emotional support but they don’t want to put any labor into the relationship. I would straight up ask her why she didn’t invite you though, I’d be really interested to know why.",
            "Ask her questions about the wedding. Like details about her dress, food at the party, etc. If you were invited she will probably say \"you'll see it when you get there\" and you can mention to her that you haven't been invited.",
            "Honestly, it sounds like you're a friend due to proximity for this woman, not a friend through shared interests. Every instance of interaction you mentioned sounds like it takes place in the office environment, not with mutual friends or outside of work.\n\nI get that *you* don't have any other friends that you feel close to, and that you find relationships hard to deal with. A lot of people are like that, but others are not. You also pointed out certain patterns that indicate either this relationship is very low on her friendship scale, or she's on the narcissistic spectrum, or both.\n\nIf she delivered invitations to people at work, those are either people she also has a relationship with *outside* of work--or those are relationships she's currying to advance her career progress. There's nothing wrong with that; a lot of business is centered around relationships. But you don't have that to offer her, it seems.\n\nThere's nothing wrong with having a relationship that has specific boundaries. If you enjoy chatting with this woman *at work* just realize that that's the *limit* of the relationship--it's a superficial \"proximity\" relationship that won't last once it isn't convenient to your work flow. \n\nBased on what you've said, I guarantee that once she is promoted or changes jobs, and you aren't in the same office, the friendship will disappear. \n\nI'm sorry you invested more emotional work into it than she has, but now you know what *type* of a relationship it is, try not to take it personally. It doesn't mean anything is wrong with you, it just means your compatibility is limited with this person.\n\nWe all have friendships at different levels, and learning to recognize when you're putting more into it than the other person is willing to reciprocate is part of being friends.\n\nTake it as a life lesson, accept the limitation, and how *you* choose to go forward from here is up to you. It isn't necessary to confront her about the wedding; take the lack of invitation as a signal and move forward accordingly.\n\nGood luck to you!",
            "You sound like an awesome friend..She does not. I'd ask her why you haven't received an invitation and other work friends have, just incase it is a mistake. Although, surely, she would have asked why you haven't responded to invite yet, if she had have sent one out. \n\nIf she hasn't sent one, I'd definitely take that as a sign that it's a one way friendship and you are being used. Stay friendly with her, in a professional way, but, move on. Make new friends and don't invest any time in her anymore. \n\nYou sound like a nice person. I wish you well.",
            "I just want to warn you a bit about something. \n\nI have a friend who, when I ask her advice, she is always saying things like \"Go confront them!\" or \"You should let them know how you feel,\"  and when that is great advice for dealing with people who care about you, it really is not helpful when dealing with people who don't.\n\nOne particular example: I followed that advice with an ex-boyfriend who was being horrible to me after we broke up - like over-the-top rude in social situations.  I confronted him and got a slight look of satisfaction from him, like he knew he got to me. No resolution, no feeling anything other than anger at myself for listening to her and exposing myself to him.\n\nYour friend is acting kind of crazy with how rude she is being, and clearly showing that she completely lacks empathy.  Why confront her?  Do you think she'll suddenly realize she's an asshole?  I doubt it.  It takes major trauma for assholes to change, and you telling her you are miffed may not even register with her. \n\nYou kind of already answered the question about how she feels about you.  I think you should just move on and avoid her.  Be happy in the fact that you won't have to buy another wedding gift, or sit through another boring reception.  (She sounds like an asshole, and I doubt she would have the mental capacity to plan a wedding that was actually fun for the guests).",
            "You’ve gotten a lot of great advice. I’m going to concentrate on one of your edits. You described what happens when you are put in a position where you have to confront someone. \n\nHave you sought counseling for this? If not, you should. Or at least take assertiveness training. \n\nOne thing to explore is what your fear is. It’s fear of something that keeps you from being able to stand up for yourself. \nFear of the unknown is very real. Fear of not knowing what’s going to happen. Fear of being ridiculed. Fear of being successful. Fear of being ignored. \n\nAll of these lend to, what happens if any of these happen? It’s possible you don’t know how to handle the situation if any of those things happen. \n\nYou should read, a lot, about how to handle situations that you’re uncomfortable in. Then put that into practice. Once you face these things and learn how to handle these situations, you won’t be a self-described doormat anymore. \n\nGood luck!",
            "It’s actually kind of telling about the true nature of the relationship that you describe her in the title as a “colleague” and not “life long friend” so I kind of wonder why that is.",
            "As difficult as it may be for you to say, I think if you want to try and save the friendship, then you should mention it to her.\n\nI think it's really callous of someone to tell you all about their wedding plans, the invites, where its' going to be with you at lunch every day and then not even talk about why you weren't invited. She should have at least talked to you if she cared about your feelings.\n\nI feel like this is someone who has lunch with you seemingly everyday and chats with you a lot. They should at least be considering inviting you. Especially if they are using you as a soundboard for all of their ideas and excitement about their upcomming wedding.\n\nI personally think you need to address this or it will always be something that you have in the back of your head whenever you guys talk to each other.  If you don't you won't be able to get past it and ever feel like this person is your friend.\n\nAt least if you ask, you have a chance at knowing the thought process behind it and can maybe move past it. \n\nIs it possible she just forgot to hand you your invite? Maybe she thought she gave it to you, but lost it instead? I know I would be heartbroken if a friend felt slighted because I had misplaced their invite and forgot. \n\nDo you know if she has hit her RSVP date yet? If she hasn't, maybe talk to her. If you don't want to confront maybe you can wait until that date and then if she is your friend she would hopefully talk to you directly to know your RSVP plans if the invite was in fact lost.\n\nOtherwise you will need to address this and then consider what this means to your friendship moving forward. I just don't see how sitting back and allowing this situation to fester is going to allow for you two to continue being friends OP.",
            "Ask her today if you are invited to the wedding.  Do it face to face so you can read her expression and body language when you ask. Tell her you did not receive an invitation.  Stuff happens. Mail handling can be problematic without anyone realizing it. She may be wondering why you haven’t responded to her invitation.  \n\nRegarding the quality of the mutuality of your friendship with her, ask yourself if your friendship has always been so one sided or if it has grown into one sidedness during recent years.  If it is the latter, I wonder if her distraction with her SO, the concept of getting married, and the wedding preparations have her brain so full that she is not responding in appropriate ways. \n\nI suggest resolving the wedding invitation part of things first, then wait a good while for her to come back to earth after the wedding, and talk to her about your friendship. \n\nSometimes, over time, people become more themselves.  It’s not always a good thing. I’m hoping she has just been very emotionally distracted for awhile which has led to her self centeredness  in your friendship.",
            "I feel for you with this friendshipbi had a similar one before. It's hard realizing it's one sided. All the hugs 🤗",
            "I think you need to clear the air - \"Friend - I have to be honest my feelings were hurt to not be invited to your wedding. I thought we were much closer friends then that. I see that to you we're just coworkers so I'll keep it professional from here on out.\"  If by chance the invite got lost and she's clueless on who RSVP'd, or if she is just that cruel and clueless you'll know. Find a way to shake up your routine at work - take a walk during lunch - even with a male coworker. Or join a book club or take a night school class that you can work through homework during lunch so it's easier to keep your distance because you are busy studying or getting fresh air.  You've been a really great friend, and I'm so sorry she does not reciprocate.",
            "I actually suggest getting assertiveness training from a professional. It is a real thing, and I honestly think you'd seriously benefit from it. It sounds like this has been an issue for you for a long time, and would be worth the investment.",
            "Any update? Has she just forgotten to give you an invite or assumed you didn’t need one?",
            "The world is full of women who are your best friend until a man comes along.\n\nBest to know that about her now.\n\nShe'll start calling again in about 6 years when she's getting a divorce. \n\nIn the meantime, keep being a good listener and a good friend to those you care about. The world will be a better place because of you.\n\nSigned,\nA  Much Older Woman",
            "You seem like you are already done with the relationship.  Don't try to get inside her head,and don't try to create blame, the two of you have grown apart, it happens, reflect on all the good years you had has friends and let it go at that.  People change, relationships change, that what times does, it brings change.  Start exploring new friendships.",
            "[removed]",
            "Sounds to me like you’re just a work friend to her despite your past.. things definitely change between childhood and age 30. I know I talk to my work friends about my upcoming wedding even though they aren’t invited. If it’s really bothering you that much, I would bring it up with her, but to be honest I would t expect any results in your favour.",
            "Your very first instinct is to refer to this girl as a colleague, rather that a friend. I don't think you have the close relationship you seem to imagine the two of you have. Most of the examples you list for why you're really good friends are more just acts of kindness that people who are good people do. It's not exactly evidence of a deep friendship.",
            "I have seen a few posts about this exact topic. I must be completely coldhearted, because I relish in not being invited. In my book, weddings rank right up there with funerals. Dreadful.",
            "OMG, just ask her what’s up. How is this an issue for you?",
            "this has happened to me many times with people whom I previously thought I was very close with.  It sucks, and honestly sometimes I still think about it, but I am also glad I realized what kind of “friend” they are.  Because at the end of the day, the people who I care about are the people who also care about me, however small that circle may be.",
            "You HAVE to ask her. For all you know, the invite was lost in the mail. Then, if you ask and she says you’re not invited, unleash the beast.",
            "This near-exact scenario has happened to me.  You're dealing with a textbook narcissist.  Consider this a big, beneficial wake-up call to grow from.  I wish I'd had the same awareness years ago.  I know it sucks bigtime right now, but as more time passes, you'll realize how far from a true friendship this was, and it'll allow you to be open to someone who actually cares about you.",
            ">I've realised she doesn't even listen to me. When I'm finished talking she just carries on with what she was saying before, almost as if I'd never spoken at all. If we're ever talking about me or something I've been doing, she never has anything to say. She just kind of nods and then switches the conversation back to herself.\n\nShe doesn't owe you a wedding invite because it's her day and she can invite whoever she wants but she does owe you a decent friendship. If she can't provide that, then make new work friends. \n\n>I've stopped having lunch with her and any time she tries to chat I politely bring the conversation to a quick end and go back to work. She doesn't appear to have even noticed.\n\nI would keep going with this. Just limit your time with her. She sounds like an awful person, she purposely avoided telling you where the venue is so you won't show up and on top of that invited people you weren't aware she was close to. Time to invest your time and energy elsewhere and next time pay more attention to how others react to your friendship. \n\nYou're a good person OP, allowing people to vent to you and just being a good friend, don't let this change how you are as a person. This is all on her, not you.",
            "You’re an adult. Ask her if you’re getting invited or not so you know where you stand. Maybe she thought you already got an invite but anyway stop sulking rather than being hurt and assuming that she purposely didn’t invite you. Maybe she did but at least you’ll have closure rather than losing a best work friend just because you assumed something but have no confirmation of it.",
            "Being able to have uncomfortable conversations is a critical life skill, and it would seem to be one you have chosen not to develop. Now seems like a great time to start, ask her why you haven’t been invited.",
            "Dude, let it go. I don't know how often you were hanging out or talking before this whole thing happen. But especially if you work with someone, there's nothing more awkward then having a big blowout fall out. in my opinion it's better to just let things fizzle out. Outside of a workplace environment I would definitely be direct. but she probably didn't want to like awkwardly end a friendship with you and you might be blowing this out of proportion, the chances are she's not even thinking about it or she hopes you won't ask about it. You don't know her reasons. this could have been her polite way to fizzle out, or there could have been a reason you don't even know about. \n\nEither way, you're so incredibly passive about it it's not like you're ever going to get an answer at this rate. try being a little bit more direct because she probably was passive with you because she knows you're a doormat type who prefers passivity",
            "😐\n\nAsk her where's your invitation. \n\nYou're acting like a kid who didn't get invited to a play date",
            "What if your invite just got lost? You shouldn’t rule that out",
            "Unfortunately, there’s really only two ways to go: ask her (and potentially figure out an underlying issue that can be solved OR hear things you don’t really want to hear); or just decide she isn’t the friend you thought and move on. As far as making your work environment awkward, unfortunately, it already is because you are already feeling uncomfortable and your relationship has already changed - plus people must have noticed if they knew you were inseparable before. There are ways of having the conversation that aren’t “confrontational” per se. Hugely uncomfortable but if you phrase things in a - “I’m confused and a bit hurt but I’d just like to understand and we can move on” rather than “you did this etc”, it can help. I’m sorry you’re in this position. It’s extremely upsetting and uncomfortable. I had a friend that didn’t invite me and handed out invites in front of me - she then realised and pulled me aside a while later and explained that it was because she was family friends with my ex and she was so sorry but she just couldn’t invite me, despite really wanting me there. To be honest - it sucked hearing that BUT ii was so glad she addressed it and was honest and her reason made sense. We were able to move on and stay friends!",
            "Do you think maybe your invite got lost in the mail? \n\nMaybe you're both feeling too awkward about it that neither of you are bringing it up? Perhaps she wanted to give it to you in person and forgot to hand it to you? Maybe she tasked someone else with posting the invites and they messed it up? Or it could be that she's really busy with wedding plans and hasn't realised you didn't reply to it? \n\nI find it a bit odd that she would just not invite you since you were supposedly so close, and yet she's going through all of the plans with you. Why would she tell you the venue was a surprise and say that it would be in the invitation, if you weren't going to get an invite? \n\nIs her talking about herself and not listening when you speak about your things a recent development? I find that when friends have big events coming up that they do focus on themselves a lot more during conversations because they're so excited, she might not even notice she's doing it.\n\nTo me it just sounds like she's really excited about the wedding coming up soon, which is why she isn't listening to you, and something happened to your invite and she hasn't realised you haven't replied.",
            "Have you asked her if she forgot to invite you?  Maybe she is talking to you all this time like this, thinking that you already know you're invited, either because you got the letter invitation or because she verbally told you, and didn't think she'll need to send a letter invitation to you.",
            "Communication may clear up a lot here. What if she invited you and the invite got lost in the mail? What if she thought it was implied or what if any number of reasons. Make sure you know the reason before investing your energy into feeling hurt. Yes it could be the case shes shutting you out but you cant be positive unless you ask!",
            "What if your invite was lost in mail? OP if your as close as you described even if she’s a shitty friend, you have a right to know why you didn’t get an invite.",
            "Just wondering, if she hadnt gotten engaged, would your relationship have continued in the same way?\n\nIs there a particular reason why you didn't know all these years, I'm just a bit curious because I've seen the same thing in others in my own personal life and it was just so obvious for me, but not to the 2 people in question.",
            "Talk to her immediately and just come out and ask her why you didn't get an invitation yet. Invitations that I thought had gone  to guests had never arrived so you just don't know until you just straight out and ask.",
            "Talking to her it's just the best option. Remember to be polite, I guess. Maybe she won't be honest but you will see through the lines. It's not really about the wedding, it's about your friendship, right? You need to know how close you are for her, so you'll know how to behave in the future.",
            "If this was just a work friend I’d say leave it alone but you’ve been friends for so long I feel like you need to address the issue before ending the friendship. I would tell her I no longer want to be friends and tell her exactly why. Not just the wedding invite but also how the friendship feels one sided. Tell her you still want to be cordial but the friendship is over.",
            "I also have been betrayed before, but in those circumstances I could at least understand their motivation. But why would your coworker do that!? Why is she so blind to see all the value you contribute to her life? \n\nI hope you can still sleep at night, because I wouldn't. \n\nIs it possible to rearrange your work responsibilities to reduce contact with her to zero?",
            "A girl I grew up with and always said how close we were and how I wasone of her oldest friends asked my ex to be  a groomsmen at her wedding and I always thought I'd bea bridesmaid but I realized we werent so close when I couldn't ttend her hen do due to lack of finances and she stopped talking to me.   \n\n\nSometimes you have to let people go no matter how much it hurt",
            "I’m not sure why you haven’t asked... especially if you’re that close and she talks about the wedding to you all the time. And then you post here... I think it’s obvious you should ask.",
            "I’m not sure why you haven’t asked... especially if you’re that close and she talks about the wedding to you all the time. And then you post here... I think it’s obvious you should ask.",
            "I’m not sure why you haven’t asked... especially if you’re that close and she talks about the wedding to you all the time. And then you post here... I think it’s obvious you should ask.",
            "Definetly ask what if it’s a misunderstanding?? Ask at least know where you stand! I’m sorry you feel so hurt but this. I hope it works out in the end. Also grow your friend circle. It’s hard but it’s definetly less lonely!",
            "As someone who avoids confrontation like this, I can relate to your situation. I've had situations where something was unsaid and was bothering me intensely. It led to a warped view of how I was interacting with said friends simply because I was seeing the worst/assuming the worst. It's possible that your friend is interested and was a good friend. She might be just very focused on the wedding.\n\nYou definitely should message and see what's up. I had a similar situation (though not a wedding), and I just grew way more distant from the friends due to a perceived slight rather than something else.",
            "[deleted]",
            "Slow fade here .\nPolite how are you and work related stuff is fine but just don't engage on a personal level",
            "You need to say something. Maybe she doesn't realize how she treats you. Self centered people are very unaware",
            "Is it possible that she made a mistake? Maybe another friend could verify that you aren't supposed to be invited.",
            "This is really sad to read. I understand being non confrontational, I am too, even with my closest friends and family. It’s uncomfortable. But honestly, you deserve to know. I think you should really try to ask. Maybe wait until after the wedding, or I would, at least. Even if you had the conversation and she invited you in last minute. You probably would still feel awkward and a bit unwanted there... but at some point I’d say “Listen, I am so thrilled for you. Watching you go through such a hard time, and seeing you genuinely happy again is so nice. But I have to ask, why wasn’t I invited? I know you invited so and so, and that it’s a big wedding. I really thought I was a close friend to you.” Do it over text if you’re nervous. Then put the phone down and have a drink. Either way, she does not sound like a good friend, she IS using you for emotional support.",
            "I'm totally non-confrontational to the point where I tend to let things slide where I shouldn't, so I understand where you're coming from. \n\nHowever I really think you should bring it up. What if it's just a misunderstanding? Like what if she's assuming that you being invited is a given so she didn't need to give you an invite? I know it's really hard to put yourself in an uncomfortable situation but at least if you ask then you'll know for sure.",
            "It's insane to me that you haven't asked her about it. \n\nIf you haven't inquired about it, I'm guessing you have a lot of anxiety. With that anxiety, is it possible you are reading into her behavior toward you?\n\nIf you don't have that kind of intense anxiety, you should've asked. The fact that you haven't asked could mean that the reason she didn't invite you (if that is the case) is because you aren't near as close as you think.",
            "Okay I was going to comment and say you’re just coworkers and maybe she only wanted outside friends and family there (reasonable), but then saw you were lifelong/childhood friends. That’s messed up.yeah I don’t think there’s much to salvage here. You could point blank ask why you didn’t get an invite just for your own closure but I don’t think she’s worth that. I had a friend of 8 years who ghosted me because she was “angry I spent too much time with my SO” and your ex friends behavior sounds. A lot like mine. They only care when it’s pertinent to them and no matter how awesome or caring you are you are either ignored or neglected in your time of need/when you offer advice. No use for people like that in my life anymore, sucks you still have to work with this person.",
            "I'm sorry you're going through this, it would be an unpleasant awakening. I'm going to echo the previous posters: I think you should ask her before the wedding and it can be very unconfrontational. It will be awkward but I think it will give you closure and you'll be able to confirm it's not a massive misunderstanding (though sure doesn't look like one). You're doing great on fading away though, you don't need to spend your emotional resources on someone who doesn't ever reciprocate.",
            "I think u should really ask her OP, first because u need peace of mind, and second that u deserve an answer, ask her the way u feel more comfortable with, message, email, in person, its up to u, but ask, u will regret not asking her later. Best of luck<3\nAnd dont feel bad about that, ive had to realize i had some shit friends too and cut them off my life, im better without these people.\nBtw, just out of curiosity what does ur hubby think about that and about her?",
            "Can you just ask her? You really have nothing to lose at this point.",
            "Ask her. Isn’t it possible your invitation was lost in the mail and now she’s wondering why her best friend is treating her like shit on the eve of her wedding?",
            "There is a chance your invitation did not get delivered. Did she send them through mail? Even sometimes electronic mails fail you. You could ask jokingly or make a joke about how you have to show up without invitation or something. By chance you have dated her future husband? Or anyone close to her/him?",
            "Why don’t you ask her? Maybe there was some mistake. Sounds silly she wouldn’t invite you.",
            "Are you completely totally 100% certain you’re not invited? There’s no chance she just assumes you’re coming and you don’t need an invite?? If not you really have to ask her.",
            "You could comment that you would mind to see the design she chose for the invitations. You'll get your answer right there. She will either show you one, which means you're not invited, or she will be surprised since you're got lost or whatever.",
            "Just a thought, maybe since you are so close she assumes you know you are invited and didn't bother to send an invite. It may be a bit of a stretch but it may be just that as well. \n\nIf you're nervous to confront her about it, make a joke about what you'll be wearing to the wedding or something and see how she addresses it. I think it's best to talk to her some way about it.",
            "Let this friend go. Sometimes after years you will find out that your loyalty was the only thing that kept you friends for so long. I had to go back and think about high school. We had all skipped school for the first time and got super drunk and not to mention took a Xanax. I was the one that did not take well to this. Hearing from other friends I was practically foaming at the mouth. I remember trying to reach for the phone to call my mom because I felt like I was going to die. She swooped in and snatched the phone from me saying “no ... you’re gonna call your mom and we’re all going to get in trouble” I had to eventually get rushed to the hospital to get my stomach pumped and this so called “best friend” was going to let me suffer. Years later I had a wedding and she made it known through her actions that she didn’t care about it at all. Sometimes you need to pay attention to friendships like this.",
            "I didn’t invite one of my closest friends from high school to my wedding even though I wanted to. My wife is Japanese and her parents are somewhat conservative and my buddy is filled to the brim with tattoos, piercings and a long unkempt beard — he also has a mouth like a sailor and tends to over-drink often. It was only a small wedding of thirteen people so it was a rough decision not to invite him, but in all honesty — I didn’t want him embarrassing me. I know it seems messed up, but first impressions are important and we were flying her family out from Japan for it. Now that I think about it, I should have invited him. He’s a good guy... just... different. 😉\n\nYou should discuss with her how you feel about this matter. Some people really *are* that oblivious.",
            "You should ask- it may be as simple as she has forgotten...especially if she has talked about inviting you previously, you don't have to be confrontational in your approach either-if you are afraid of confrontation",
            "Are you sure your invite didn't get lost? Can one of your coworkers ask on your behalf if you feel too uncomfortable? It seems weird that you wouldn't get one and she would be talking all about it to you",
            "To get closure, you need to ask her why she didn't invite you. I know It will be hard to do.",
            "I bet she just forgot or assumed you knew you were invited... ask her",
            "If you don't ask, your friendship is done for sure. If you do ask? You can maybe hear a reasonable explanation (unlikely) or, at least, move on in peace knowing for sure it was intentional.",
            "Maybe. Just maybe the inviation got lost in the mail and this is just one big misunderstanding? She thinks you're upset over her getting married and you will not be able to hang as often? I would straight up just talk to her about it.",
            "This has happened to me. A girl who I considered one of my best friends. We hung out a lot during college until she moved back home. Once I graduated and moved back home, we continued to hang out until I left for an internship over the summer. Her wedding was on the last day of my internship. I was driving back home (roughly 12hours) but made it back early. Made it in 10 hours instead of 12. I even told her that was the day I was driving back but maybe make it in time for after party. Never one invite. I was crushed. It really hurt my feelings. I'm still a little bitter about it. \nIt's better to say something up front than never know at all. Find friends who will go out of their way for you too.",
            "She possibly could have just assumed you would be coming because you two are close.  Invitations can be expensive as well, and I've had a few friends who didnt send me an actual invitation because they knew I'd be there regardless, and it helped them save that invite for another person/save a wee bit of money.  Just talk to her about it and see how it goes. Best of luck",
            "If she didn't invite you, then shes an utterly shitty person for talking about the event.   \n\nI think its worth confirming that she didn't invite you.  Mistakes happen, but this does seem like itd be hard to be an honest mistake.   So, confirm that you're not invited before giving up.  \n\nI don't know how best to do that.  Be blunt, be sneaky,  whatever.   You'll feel better in the long run knowing.",
            "I am planning my wedding and recently had a couple of friends flat out ask me if they were invited... they were, but their invites never made it to them. If they hadn’t said anything, I would have been none the wiser until later on when I’d inevitably wonder why they hadn’t RSVP’d. It sounds like you’ve uncovered a lot about your friendship but it might be worth asking if you feel like there’s any chance it was a mistake?",
            "Omfg what if she’s going to ask you to be her Bridesmaid of honor though???",
            "I'm sorry this happened to you. I definitely think you should ask her about it if you have any interest in fixing/preserving the friendship, but I have been in your place before. I had a friend that I met through work, and we became very close, hanging out all the time and it took me a long time to realize that the amount of care and attention I invested in her was not returned.",
            "Yea if I don’t get an invite to my friends wedding ima get angry like da hulk.",
            "As someone who is planning a wedding now, I find this so weird!! To give you're friend the benefit of the doubt, are you sure that she doesn't think she's invited you? She's told you every detail perhaps she is assuming you know you're invited and forgot to give you one/thought you didn't need one? For instance, I won't send one to my sister as she already knows all the details and invites are expensive!! Haha.\n\nI really think you should ask her OP...maybe she has stressed out bridezilla brain and has just forgotten!\n\nIf not, then what a shit friend and you deserve better!\n\nIt would be good to ask just for your own piece of mind, and then you can move on from this worry either way.",
            "Maybe have someone else ask her. Like say, what did \"Jane\" get you for the wedding. And see her response. Maybe she'll say she didn't invite u. And the person asking could say \"oh, you two seem so close I thought she was going\".. type of thing.\n\nBtw you are \"Jane\"",
            "I would take this as an opportunity to just say “fuck it” and ask her why she didn’t invite you.\n\nThis is one of those important communication moments in life, and they’re not always fun, but they’re necessary.\n\nAlso, who cares if it makes her uncomfortable, she’s been making you uncomfortable this entire time by talking about the wedding plans with you.",
            "Wow OP I feel for you, what an awkward situation.  I started to comment by saying you should ask her straight out why you weren't invited, but after learning she *hand delivered* the invitations and has a bachelorette party you also weren't invited to it's pretty clear this was a deliberate snub.  She sounds like a narcissist... \n\nI agree with the other comments that she obviously doesn't feel the need to return your friendship, and is probably hoping you will ask so she can have that power over you.  \n\nPersonally I would just try and ignore it and just be glad you've finally seen her true colours before she drains more of your time and energy.  Keep work conversations to business and when she talks about her wedding just say \"thats nice\" and change the subject. Shut her down and make like you have better things to do than worry about her or her wedding.",
            "No comment that i could find through slowly scrolling and barely paying attention has mentioned that she has done at least one thing for you when she got you the job",
            "First, are you sure she didn't invite you? Maybe the invite was lost in the mail. If You really thought you were that close, you should be able to outright ask.\nIf she didn't invite you and the whole relationship is so one sided, maybe you should step back for good. It is entirely possible that you viewed the relationship at work as much more important than it was too her.",
            "Your invite could have gotten lost in the mail! This happened to me last year. They asked why I hadn't RSVPed and I was like, I thought I wasn't invited!",
            "Maybe it was an oversight from someone else. Talk to her.",
            "You NEED to talk to her.  Adulting is hard.  Take a deep breath.  Think about what u r going to say beforehand.   And ask.  You.  Can. Do. This.",
            "The only thing I can possibly think of is that she already assumed you'd be going, invite or not. Why else would she share literally every detail with you? And given how one-sided this relationahip is, she very well might not have even thought that you'd appreciate one.\n\nI think asking her (or maybe even her fiancé) about this is definitely the right call, but given what this has helped you see in her, slowly separating may be a good addition as well.\n\nBut if it helps, I don't think she's intentionally hurting you, there's just a good chance her self-centeredness is so high she just didn't realize you needed/wanted one.",
            "Maybe you can say something indirect like, have a great wedding, I’m looking forward to seeing the pictures, and then gauge her reaction.",
            "Listen, I really think there’s a LARGE POSSIBILITY that you were intended to receive an invitation. You need to ask her because stuff gets lost in the mail, gets put in the wrong mailbox, gets lost in transport. It could be sitting underneath the couch at her place right now. You don’t know. People who don’t invite you, don’t talk about planning with you to this extent. I think you might actually be letting your emotions get the better of you and you need to ask, because odds are she assumes your going and hasn’t put second thought to not receiving your RSVP.",
            "I was in such a similar situation recently. You know what I really was surprised about regarding the while thing: it turned me into a cynical asshole. Co workers started banging, friends with both of them or so I thought. Gal was already engaged to a another guy. Guy and girl basically asked me to keep my mouth shut and I did. They are now married with a kid on the way. Was not invited to the wedding, realized when I saw on social media to RSVP if you got an invite. Looked back on my interactions with these people and realized they only reached out when they wanted something from me. Cut them out of my life. Wish them luck, but fuck that shit yo. Sorry about your situation OP.",
            "It's way more likely that your invitation got lost in the mail and SHE'S mad that you haven't RSVPed and haven't mentioned it. \n\nYou're both being ridiculous. Just ask her. \"This is really awkward, and I should have said something earlier, but I haven't received an invitation to your wedding. Should I take that to mean I'm not invited?\"\n\nIf she says yes, you can just say \"That's really hurtful. I've really been there for you and been listening to you talk about this wedding for a long time. It's making me rethink our friendship.\" (Which is what you're already thinking)\n\nThere is NO way that conversation is going to be more awkward than the first day of work after her wedding when neither of you have said anything. For the love of god, just ask her.",
            "It’s super possible the invite got lost in the mail.... I really can’t imagine someone talking nonstop about their wedding plans to someone who they didn’t invite. \n\nBut considering it sounds like you’re finding your friendship was totally unfounded to begin with, I’m not sure if you even see a point in that at this point. It’s okay to just cut ties and let toxic people go.",
            "Following. I wanna know what she says when you ask",
            "Just ask her if your invitation got lost in the mail. It probably was just that.",
            "Wow, that really sucks and it totally feels like they're using you to make themselves feel better. Reciprocating is a huge part of any relationship, and it just seems like this individual doesn't want to make the effort to have a deep connection with you. As someone who is an avid social dancer, and been to almost 30 weddings, you're not missing anything. People have lists and sometimes they just can't have everyone they want at their wedding.  Honestly, it hurts, but that shouldn't affect your friendship if you still want one with this person. The same thing has happened to me a few times with people that I would see once or twice a week for several years. IMO, if you're upset then bring up the invitation situation with the individual and see what they say. I'd be willing to bet, 1. They don't see you as a close friend and didn't think to have you at the wedding, or 2. They just couldn't accommodate any more friends at their wedding.",
            "There were two instances where I (F) was not invited to a friend’s wedding (both male).  One I asked straight up, the other I found out many years later.  Both were because the future wife didn’t like me / felt threatened by me.  Could that be your case?",
            "She's too selfish to have in your life.",
            "Just ask her, there's so many reasons why such a thing could happen. Just ask her so you know. I mean, she might be randomly mad at you, or perhaps it was just obvious to her that you're invited and didn't need an invite. Ask her directly, she's the only one with a proper answer.",
            "There's nothing else I can really say besides sorry. It sucks when you realize a close relationship is actually super one sided. I had one - we were childhood friends, but eventually we grew apart and then, suddenly, I realized we weren't even friends anymore. Broke my heart, but I have friends now that are REAL friends, not the type you out grow or need to talk to all the time to keep the friendship. \n\nI hope you can find friends who give as much as you do.",
            "OP if you can’t even ask your “friend” about the invitation then you’re right to get the idea that this isn’t much of a friendship. \n\nLife is too short to waste it on people like her. you need to take a stand for yourself even if it just means asking about the invitation. \n\nWe accept the love we think we deserve and if you keep acting like a doormat who doesn’t even have the maturity to ask when something upsets her then you’ll always get treated like this",
            "I would probably try asking her what happened in a non confrontational way. It's  \\*\\*possible\\*\\* that she didn't realize she overlooked inviting you. I accidentally forgot to invite one of my uncles to my wedding. Now, granted, it was an uncle I haven't talked to in years, but I truly felt bad about it when I realized I forgot to include him, and definitely did not intend it to be a slight. It just slipped my mind with all the other wedding planning stuff.  It's also possible that she likes you and would have liked to have had you there but the venue didn't allow for her to include everyone she wanted.\n\nHowever, it's also quite possible that the friendship meant more to you than it did to her or that she is a really self centered person. :(  I am sorry that you have been hurt by this. If you're still open to trying to work through this with her, I would try to have a calm discussion about it and give her a chance to explain at least. However, if you feel like you can't see yourself getting over this, maybe it's for the best to leave it alone and just distance yourself from her.",
            "Well it sounds like your not going to be friends anyway, so ask her why you weren't invited. Say you've been close for so long why didn't she invite you? She'll either be \"shocked\" that you didn't get your invitation, or she'll stammer and mumble something. Your friendship is basically over already. Theres only 2 ways this can end, she'll denie not inviting you, start an argument so she can tell everyone you were jealous, or you can pretend you believe her BS reason for not inviting you, and then you can continue your one way \"friendship\"  what you are is friend in need, when she needs something from you, she'll be your friend. Tell her you need something from her, a ride to the airport before work, or ask her to take on some of your work because you have to leave early for about 2 weeks for appointments. Ask her anything that requires her doing something for you, I'll bet she won't do one thing to help you. I've had \"friends\" like that before, sometimes we try to help the wrong people. For every one person who gives of themselves to help someone, there are 50 people who are happy to take, and give nothing back.",
            "She sounds like a narcissistic a hole don’t put too much effort into people who don’t care\nIt will only hurt you I have been there I get this.\nBut to me I would feel the same I wouldn’t bother with this woman she seems to be a user/drainer \nThose people are toxic and not worth it.\nI’m sorry this happened to you\nBut there are so many others out there who would be better friends/people. \nMove on and if she wants to reach out to you then balls in her court she can make the effort next time..,and every other time after that",
            "No. You are not overreacting or being dramatic. Your feelings are valid since you've invested so much time and effort for her. So whatever it is you are feeling, it's perfectly normal. However, silent treatment or not recognizing the issue is not going to help you either. You have to talk to her and ask her why did she not invite you on her wedding. Tell her what you really feel and let her know that it hurt you. \n\nPlease remember this. Whatever her response maybe, whether or not you are going to give her another shot in your life, you should always thank yourself for being brave. Being brave in a sense that, no matter how many times you've felt used (by your dear friend) or felt disregarded, you're still here.... Breathing. Functioning. You are still you and no one can take that away from you. So what if you've lost a friend? I'm sure you haven't met your \"bff's for life\" type of friend. So what if she didn't invite you to her wedding? Heck, do not invite her too in your wedding! So what if you are feeling lonely? Atleast you know who really are those people who you should/shouldn't make an effort into. Atleast now you know who really cares for you.",
            "I think I would have to ask, I know there are some mixed responses but I would wind myself up wondering why I didn’t get invited when she’s invited other coworkers who aren’t as close to her, and not me, the one who’s there for her and spends the most time with her.\n\nHave your colleagues who are invited aware that you aren’t invited? How have they reacted? Are they surprised? I wonder if one of them has mentioned it to her or asked her",
            "Next time you see her politely ask what happened to your invitation. Just drop it in a conversation like normal. Hey I still haven't got my invite maybe it's lost in the post? For example. Also you need to look into this friendship more. Try small things like asking for help with a project at work.  See how she responds. You may want to start cultivating more work based friends. Don't go full on stat with small things eg how was your day etc..  You will either make more friends or at least increase your happiness at work.  I know how deeply this has hurt you but it's given you a chance to look at this from an outsiders perspective. Yes she may have been using you but until now you didn't really see it.  You can reevaluate this friendship and see if it's worth saving.  If not then it's time to move on. She will find another person to vent to and you will find more friends that maybe you will even get along better with.",
            "A word of caution, OP. You are not only a friend but a colleague. As such you have been overly supportive of her, sharing her workload etc. People at the office must have noticed that, beside you eat lunch together and are/were openly friends. Now she openly disassociates from you, giving invitations to others but not you etc. Why suddenly she feels the need to do so? Are you no longer useful?",
            "Okay so, you asked if anyone had had a similar experience, and I have. I had a close knit group of girlfriends in high school, and we all stayed very much in touch through college/military for years. One of them, Danielle, started dating someone else we hung out with then. When they got engaged it was a big deal. At first, Danielle stated she didn't want to pick favorites, so we'd all just be part of the wedding party with no titles. Well, that didn't last. Shortly before the wedding I found out they asked my best friend Amanda to marry them, and some other outside friends to be the wedding party. What was I in all this? A guest. I was incredibly hurt. As i watched them plan and Amanda get her notary license I grew more angry, until one night Danielle called me and I let it all out. We had a huge fight, I told her how hurt I was that I wasn't involved when we had been close since 9th grade (there were 4 of us, we were inseparable for years). Lots of things were said and done that to this day I'm embarrassed by... But I don't regret telling her. We stopped talking after that for a couple months; I missed the wedding. Awhile later we reconnected and said our sorrys, and things went back to normal. We've since stopped talking for other reasons.\n\nI never really understood why I wasn't a part of it. She became a good friend again after but our closeness was never really the same. It's almost like a breakup--the same feelings of being betrayed and forgotten. I got over it but I never trusted her the dame way again.\n\nMy advice in your situation would be to ask. With the way you describe her behavior this could be a complete misunderstanding. But it could also be opposite. I'm hoping it's the former for you, and asking her why could relieve all the tension this has caused you. I know for me, knowing a reason helps me move on from whatever it is. I hope you two can discuss this, and I'd like to add please keep it civil. Friend fights can get dirty and cut deep since we know each other on a personal level others never see. Mine was years ago when I still went for the throat, and even though she and I no longer speak I hate the way I acted about it.",
            "You can just say \"hey, this is really awkward, but I didn't get an invite, and I just wanted to check that was intentional and it hasn't got lost or anything, because if you did invite me and thought I ghosted you I would seem rude\", that way you're asking because you don't want to hurt her feelings, not because you have had yours hurt. If she says she didn't want you there then you have to accept that she isn't your friend and let her go.",
            "I had a bundle of 40 invitations to my wedding returned to my parents address because of some mess up with the postage. They didn't show up until two weeks before the wedding even though I'd mailed them out long, long before then. Luckily for me they were all local and I could hand deliver and explain the situation, but there were several families who thought I was snubbing them. So much drama. \n\n\n\n\nBasically, your work environment is already awkward and you are a grown up who should use her words. If it's not a mistake then you can go full Ice Queen and not look back. If it is a mistake then maybe you're giving the bride a heads up that some of her invitations didn't get where the should.",
            "It would be quite fun to say something along the lines about how you're looking forward to going, especially if you know the location from one of the other coworkers who were invited or she let it slip. Make it awkward for her to have to outright say you aren't invited or just to see what she says. And if she does throw you a pity invite to try to save face, show up and have a good time with others so you actually get something from this relationship before you fade out on her. It's non-confrontational but still gets you that closure you might be wanting.",
            "I would DEFINITELY ask her if she'd sent me an invitation! She couldn't be that thick-skinned as to discuss the whole wedding with you, but not invite you.",
            "Many years ago one of my closest friends got married and a lot of her invites got lost in the post - mine included. It was quite a way from me, but I still would have gone. I didn't say anything for a long time because I didn't want a response that I may not have liked and in the end it was she who mentioned it, asking me why I hadn't sent an RSVP. Told her I hadn't got an invite and she was most apologetic. I didn't go to the wedding because I just couldn't make it, after all that, the wedding went ahead (a very stressful service, by all accounts - long story) and that's that. But 20 odd years later, we're still great friends and all is forgotten... (Also because they're no longer married & he's an arse!). \nIf you're as good friends as you suggest you are, you have to say something. For two reasons....\n\n1. Because good friends should be able to talk about these things. There could be a very good reason why you've not had an invite. It got lost in the post, it never got sent (by accident), or your *friend * really isn't such a good friend after-all. Either way, you need to know.\n2. Not saying anything gives this *friend * free licence to continue using you as their emotional crutch and the one to go to to tell the latest bit of news about this wedding. Especially if she is, in fact, pretending to be the friend you always thought she was, but may now not be. If you're non-confrontational, then you should be able to ask her without insinuating she's cheating at this friendship, or doesn't want you at the wedding. BUT you have to be prepared for the answer, which might be one you won't like. But at least you'd know for definite and you can make an informed choice as to whether you believe its a friendship worth continued investment. Good luck. Hugs X",
            " i understand this feeling completely as im going through something similar right now. It sucks realizing that someone you cared about and viewed as a best friend actually doesn’t give a fuck about you. I don’t have any advice bc i haven’t figured anything out in my own situation, but i thought i’d share anyway idk 😐",
            "If you consider her such a great friend, why aren’t you communicating your feelings to her? You’ll get your answer much more quickly and be able to move on with your life.",
            "My husband forgot to invite one of his good work friends to our wedding. When he was making the list, her name got lost in the shuffle. Everyone kept telling her it was obviously an oversight and to just *ask my husband about it*, but she wouldn’t and no one else did either, and she didn’t bring it up until after the wedding when she sadly asked my husband if she had offended him in some way. \n\nHe was absolutely horrified and apologised dozens of times, but also was a bit frustrated that she or someone else didn’t just SAY SOMETHING. It was obviously an accident—he didn’t invite literally all his other team members at work and then gleefully cackle in private while talking openly about the plans to throw them in her face. \n\nWedding planning is a messy process and someone always slips through the cracks somehow—envelope gets lost, person had the wrong address, whatever. \n\nI think it’s much less likely that your friend is some kind of sociopath who is rubbing her wedding in your face, and much more likely that a simple mistake happened somewhere. \n\nI get being non confrontational, OP, but you’re an adult and sometimes adults need to use their words and just talk about this stuff. She can’t read your mind and you don’t know what’s actually happening until you ask. I don’t mean to be harsh, but people are eventually going to stop sympathising with you if you consistently refuse to try to solve simple problems yourself before blowing them up into relationship-ending fireballs. \n\n“Hey, Kate? I’ve noticed everyone else has gotten their invitations, and I wasn’t invited. I’m a bit hurt by that; have I offended you somehow?”\n\nThat’s all you have to do. And do it before the wedding. It might be awkward, but it’s really the only way to handle this properly. If it turns out she *didn’t* invite you, then she’s clearly being beyond rude and you can politely pull away from the relationship and the wedding talk. Or you’ll find out she’s having a family-only wedding. Or whatever. Much more likely it was just an accident. Whatever the answer, you can’t know and respond to it until you ask."
        ]
    },
    {
        "post_id": "i8jgfi",
        "author": "crazyexroommate66",
        "title": "[UPDATE] My [22F] former roommate [30M] is freaking me out, what should I do?",
        "url": "https://www.reddit.com/r/relationships/comments/i8jgfi/update_my_22f_former_roommate_30m_is_freaking_me/",
        "score": 5395,
        "num_comments": 155,
        "created_utc": 1597257764.0,
        "selftext": "Link to previous post: https://www.reddit.com/r/relationships/comments/8efmq2/my_22f_former_roommate_30m_is_freaking_me_out/\n\nNo one asked for an update, but I thought I'd provide a short one.\n\n**TL;DR: I never have to see John again in my entire life. David and I broke up. I moved away and cut off contact with everyone. Also, turns out I'm gay. Life is good now.**\n\nShortly after this post, David and I had a sit-down talk in which I said I was no longer comfortable going over to his place. I showed him this post and how he was getting roasted in the comments. He agreed and started coming over to my place more. However, this became more lax with time and laziness and he started asking me to come over to his house, which I hesitatingly did. Basically, it backslid into how things were before, and he made no real effort to change anything. At no point did David consider moving out, and as far as I know, they're still roommates.\n\nIt's been a while now, so I honestly can't remember if John ever made an attempt at making an apology, but at any rate he never made an apology I deemed to be genuine and he always made me uneasy. No more serious incidents occurred. John never touched me physically. For this, I feel exceedingly fortunate.\n\nA few months after I made that post, I started wanting to move away for various reasons (mostly wanting a change of scenery and culture), and I realized that I didn't consider my relationship valuable enough to make me want to stay. That was over a year ago.\n\nWe broke up, I moved away, and in quarantine I've reconsidered my sexuality and am now dating a lovely, thoughtful, and supportive woman. My life is much better now and I see that that I was allowing myself to be treated in a very horrible and toxic way. I also see that everyone in that house was -- in a way -- gaslighting me into thinking that John's abuse wasn't so bad in an effort to not \"rock the boat\". No one, at any point, made any effort to stand up for me, including my supposed romantic partner (which, honestly, now disgusts me). I'm not in touch with anyone from that circle anymore and honestly, good riddance. I'm so relieved that I never have to see any of them again.\n\nAnyway, despite being in lockdown and living in a deep, existential anxiety, I'm very happy and life is drama-free (aside from the fact that I still have to come out to my family, lol). Thanks everyone for pushing me in the right direction.\n\n**EDIT:** I was not expecting this to blow up in the way that it has. \"David\", I know you have a reddit account, and if you're seeing this, I hope you're doing well. \"John\" is hella toxic. Good luck with everything.\n\n**EDIT 2: Seriously, this response is overwhelming. Thank you all so much for your support and well-wishes. I hope all of my future coming-outs go this well. <3**",
        "permalink": "/r/relationships/comments/i8jgfi/update_my_22f_former_roommate_30m_is_freaking_me/",
        "comments": [
            "I loved your tl;dr and thought you were making a joke. I'm glad your life is doing better.",
            "Congratulations on everything.   It was a bit frustrating in your last post seeing you constantly brush off the actions of your friends and partner.  It's great to see you realized you don't deserve that.",
            "Good riddance to any partner who refused to stand up for you. Glad you're out of that situation and safe! Good luck with your girlfriend",
            "[removed]",
            "I had pretty much the exact same situation as you in college. I had a really good friend group, but one of the guys liked me and took it REALLY badly when I rejected him. He proceeded to bully me mercilessly, and gaslight my friends to say I was causing drama/it wasn't that bad. Similar to you, I received zero support from them. I have also cut off every single person from that group and am better for it. Not only was the guy himself absolute trash, but my friends weren't real friends if they could stand by that behavior. Best of luck to you in your much improved life!",
            "Wow, a post-2yr update. Thanks for sharing your story and congrats on your current relationship.",
            "so what WAS John's deal? was he gay and in love with David?",
            "I hope everything goes well with your family! I'm glad you got out of it all 😊",
            "Honestly you realizing you're gay makes this update even better lol I'm glad u have a supportive partner now",
            "I remember your original post, so I'm so glad to see a positive update! Congratulations on your new relationship! I wish all the best for you! You deserve good things and good people in your life!",
            "Best TL;DR I've ever seen, I hope everything goes fantastic for you, it was rather depressing reading the first post and now this is surprising and very very good. Also, fuck you John",
            "I read through your original post.  It's pretty clear what the problem with John was.  I've seen this before (can't remember exactly where).  Anyway, I'm pretty certain that John is a vampire, and that he - at the same time - lusts after your blood and loves you deeply.  \n\nThis is a pretty serious conflict for him, and difficult to manage.  When he pushes you away, it's because his blood lust is in danger of overwhelming his deep love.\n\nYou're welcome.",
            "Wtf, I’m completely jealous you found a woman to date so quickly, during quarantine no less. I’ve been trying to find one for years 🤣",
            "Congrats on moving on to better things! I also dated a guy who didn’t stand up for me when toxic roommates were toxic (and sadly in my case that included unwanted physical contact). He’s an ex now for many reasons.",
            "hell fucking yeah!!! big upgrade!",
            "So happy you're doing better!",
            "This is one of the best updates I've ever read. I'm so happy you're finally happy.",
            "I love this update so much!!! I wish all the best for you and your awesome girlfriend. You deserve the best and to put your self first!",
            "I love reading happy updates, thanks for posting! Your original post was memorable to me because I had a person like John in life once. Those people, your ex included, were shitty to let you be bullied, you did nothing to deserve that, and it’s great you have found happiness during quarantine! Now that you know how wrong it was to be treated that way hopefully you won’t be in a situation like that again. Enjoy your new relationship!",
            "Look up the term “missing stairs” - very relevant to John’s behavior and the behavior of your former roommates. Glad you’re out of that mess!",
            "After 2 years. Congratulations! I hope you have a good life ahead of you. 🍺",
            "Good for you for knowing you deserve more ❤️",
            "I'm so happy for you. I never saw your original post until now, but it sounds John was hostile and hell and the whole situation toxic. So glad for you :)",
            "What a wonderful update! I'm so happy to hear you dumped that terrible ex and have found someone who values you and cares about your safety!",
            "That TL;DR was one hell of a rollercoaster.  I'm sorry no one stood up for you, but I'm glad you stood up for yourself and not only became stronger, but made a better life for yourself.",
            "I’m really sorry that nobody stood up for you, especially David. I hope others learn how much of a red flag that is. Happy you’re happy now though!",
            "I also came out this quarantine! At 32! I always knew I was gay and have dated women before but I thought I wanted the heteronormative life anyhow and dated men, planned on marrying a man, etc! Soooo much happier now. Yayyy! Congrats!",
            "Hey, if things don't go well with your coming out to your family I will be your mom. K? I will cook you food, tell you how proud I am of you and try to hook you up with every coworkers daughter I meet, even though I know they are straight and you're in a healthy relationship, and i even like your partner. It's just how us supportive moms of gay kids do it. It will be great. Need a hug and some reassurance? I got you booboo. Keep moving up kid, you're doing great.",
            "I dealt with some extremely idiot and mismatched boyfriends before I realized I was gay. It sort of comes with the comphet territory. \n\nI find it sort of funny rereading your OP in light of the new info. Everyone: How does this gal not realize her bf's roommate is completely ragingly in love with her? OP: do-do-do isn't this just SO normal? How do I straight.",
            "Oh my god dating someone of the same gender is such a relief after trying to develop relationships with men! I was like.... it can’t possibly be this easy?? But it is and it’s wonderful.\n\nGood luck with coming out too. I’m in the same boat, and we’ve got gender stuff on top, too (my partner is trans and my family knows them as my ‘boyfriend’ so it will certainly be interesting).",
            "welcome to lesbianism. it's fucking great\n\n\\-a bi woman who is NEVER going back to dating men after finding my girlfriend",
            "Thank goodness! Im so glad for you :3",
            "OP I remember you. All these years later I didn’t have to look at the original to guess it was you",
            "[removed]",
            "Good on ya for breaking free from a toxic/bleh friend group! I read the original post and was frustrated that none of your friends and boyfriend ever spoke up against John when he was obviously exhibiting dangerous behaviour.       \n  \n  \nI wish you and your new relationship well! It seems that you are doing far better now than you were two years ago. :D",
            "So happy for you! You truly deserve a partner (and friends) who will have your back. I wish you the very best, and good luck when you are ready to come out to your family!",
            "Im glad you seemed to find yourself through all of this and be happy! \nIn regards to your former “friends” who didnt stick up for you because they didnt want to “rock the boat”, never stay with people like that. I’ve always been that one to rock the boat and speak out about toxic behavior and it may lose me some friends but time and time again its been for the better because those friends are usually toxic.",
            "First of all, best of luck in talking to your parents. I hope they're as supportive as you deserve for them to be. Second of all, I'm happy to see what you've learned. When I read the original post the VERY first thing I honed in on was why in the actual fuck did no one stand up for you? That blows my mind. These people were not your friends. I'm glad you've seen them for what they are and understand what they were (or weren't) doing. Best of luck with your new lady friend!",
            "This is a great update, glad you're happy! I couldn't believe in your original post that noone was saying anything to him, even when he's muttering and swearing under his breath at you? What a bunch of clowns, the only was is up!",
            "Best result ever! Good for you, OP!",
            "I’ve been feeling pretty shitty this week from personal stuff, but then I stumbled across this gem.\n\nThis was very uplifting. I’m so happy to hear that you’re doing much better and it’s during quarantine too. Also it’s really awesome you found out more about yourself, figuring out your sexuality has its struggles. Are your parents aware of it? When I came out it was bad...but it’s better now.",
            "yeeeey, fantastic for you. we love to hear that you're doing well.\n\nyeah that roommate situation was not cool in any way. \n\nmany blessings ✨",
            "Aye congrats on things working out better this time! You have done the best you can't. Can't fault you for anything really. As for those people, good idea let's not speak of them. As for yourself. Hope you are doing alright overall due to the heat this month. It's blisteringly hot and I feel like I could melt..",
            "Good for you !! hope your coming out goes well :)",
            "Congrats on your new found freedom! I read your old post and it made me wonder if the creepy dude was in love with your ex. Before I realized that I was gay, I dated a guy who also ended up being gay. It happens a lot. Either way, I’m glad you found a healthier path.",
            "Thanks for the update and I’m so glad you’ve moved on and are happy. You deserve that! Oh and from a mom, I would never care which way my kids would swing. I’d love them no matter what. Good luck with the family and I pray nothing changes. ❤️",
            "My gosh! I remember reading your OP when you posted it. Glad to hear you got out generally unscathed and are happy! :)",
            "Yay for healthy choices!! 👏🏻😊 Congrats on your self-realisations too.",
            "I'm so glad you got away from your ex. He's a weak asf man. Ugh. I can't stand men like him.\n\nI'm glad you're okay overall and I'm glad you're happy and safe.",
            "I am glad you broke up. You're best off without a spineless bf like that",
            "Any story that ends with the OP realizing they're gay is a good story. Congrats on your new life, OP! :)",
            "honestly when i read that post i kinda hoped john was actually in love with david and they would eventually die very old by each other’s side",
            "You are such a child. First off, in your initial post you said John attempted to sit down and apologize to you via text, but you ignored it because you had zero interest in making things better. So for you to say he never attempted to apologize is pure bs and a lie. I'm not defending the guy, but you're full of bs yourself.\nSecond, how do you leave a relationship simply because you want a change of scenery and culture?? No one just leaves a committed relationship that easily. Very childish. Very. You shouldn't have been in the relationship in the first place if its that easy to end it over something so minor.\nThird, no one in that house gaslighted you. Lmao. Everyone loves to throw that word around nowadays when they don't understand the true meaning of it, or have even experienced it first hand. \nFourth, no disrespect to your personal choices regarding your sexuality, and no disrespect to anyone who identifies as homosexual, but how do you all of a sudden reconsider your sexuality so drastically? Doesn't seem genuine. Seems impulsive, maybe you think its \"trendy\" or there's some other reason behind it.\nThis is gonna sound very judgmental and harsh, but between this post and your last, you need to hear it. Sorry if this hurts your feelings:\nYou seem very attention seeking, impulsive, and whimsical. John was an awful person, but I think you're core is just the same as his, you're just good at being covert about it. Have you ever heard of narcissistic personality disorder? You might have it.\nI was quite surprised with the responses you received in your older post. While yes, the situation you were in was toxic and bad for you, there were so many red flags about your own self displayed by your writing and how you talk about people and situations.Toxic people often attract toxic people, and they balance each other out.\nSick of people's bs.",
            "Wow, how did over 5k people find that post interesting enough to give it an up vote? I heard it 9n YouTube and kept waiting for the good part. Still waiting. \nYeah you're lucky you escaped with your life from that situation.",
            "I'm a little worried how you pigeonhole yourself and your sexuality. The whole \"it's okay everyone, I'm just gay\" thing worries me. This is only because I am concerned that if you and your partner don't work out (which I absolutely hope you do, they sound supportive and lovely), it may send you into a bit of an existential spiral. You be you and love who you want to. As long as they treat you right and you treat them right, you'll be golden.",
            "Wow, guys are shitty and scary and shitty at relationships.  Now, I'm finally happy I'm dating a woman.  Fuck outta here with this fantasy bullshit post.",
            "I thought you were born gay",
            "Ah! His moves need work."
        ]
    },
    {
        "post_id": "3kkkcj",
        "author": "Familyheiress",
        "title": "Boyfriend (28m) found out how much money I (28f) have, he wants me to pay off for a house for us as well as a new car and fund a trip for him to go abroad, should I end it? UPDATE",
        "url": "https://www.reddit.com/r/relationships/comments/3kkkcj/boyfriend_28m_found_out_how_much_money_i_28f_have/",
        "score": 5343,
        "num_comments": 858,
        "created_utc": 1441994905.0,
        "selftext": "So I didn't automatically dump my boyfriend. I decided I'd have a talk with him, I told him that it was basically really damn inappropriate to find out I have money and start making demands. I told him I have no problems using my finances for our relationship but that he shouldn't automatically expect that I'm going to put out money on very expensive things for him, just because. He seemed very ashamed and agreed that it was a really crappy thing to do and he got carried away and a bit too excited. I told him I understood but to do that was very disrespectful to me and the time we've shared together because it made me feel like all of a sudden my money is what mattered.\n\n\n\n\n\n\n\nFor a little while it seemed all was well, then the other day we were having a minor argument over something that turned into a bigger argument and he said something along the lines of well you don't even want to use what you have for us so maybe you've never fucking cared about me. He got really quiet as though he knew that was a shitty thing to say and we didn't talk until 2 days later. I was really angry, I was going to talk things through with him.\n\n\n\n\n\n\nHowever this came the relationship fatality. He told a couple people we're good with, despite me asking him to keep the money quiet, that I was really rich and could afford tons of shit. How did I find out, Saturday we all went drinking together, he gets a bit too much in his system and orders an expensive bottle of wine, one of our friends was like who orders that shit, we're good with our beers and that's too expensive. Our other friend piped up and was like no it's good /u/FamilyHeiress is really rich, she can pick up our tab tonight, cue several other people who I've never told about my family's money suddenly grilling me on why I never trusted them enough to tell them about my money and oh, thought we were friends that kind of thing. \n\n\n\n\n\n\nI broke up with him the next day. He's been blowing up my phone all day but fuck him, I could have moved past what he said the other day when we were arguing but to tell people I specifically asked him not to something I trusted him so much with. Yeah, I've lost a 3 year relationship and am probably going to lose a few friends as well.\n\n\n\n\n\n\ntl;dr talked to my bf, he said he'd make an effort, he didn't, told some of our friends that I was wealthy, they were shocked I didn't trust them with this, I dumped him, may lose some friends soon as well\n\n\nEdit: for everyone asking the bottle was 460\n\n\n\n\nOP: https://www.reddit.com/r/relationships/comments/3j5fnj/boyfriend_28m_found_out_how_much_money_i_28f_have/",
        "permalink": "/r/relationships/comments/3kkkcj/boyfriend_28m_found_out_how_much_money_i_28f_have/",
        "comments": [
            "[deleted]",
            "Wow.  Money sure does bring out people's true colors.  Whatever your reasons for keeping your money quiet, his reaction was entirely not cool.  If you had married him and never told him about it and you were watching him struggle financially, ok sure, I can see how that would be a breach of trust.  But this?  Good grief!  Sorry OP, but it does look like he showed his true colors and you avoided a life of being mooched off of.",
            "[removed]",
            "I am really amazed he openly said that to your friends after your talk. I don't understand how he couldn't know that telling anyone would screw his relationship with you.\n\nHe kept his imbecility well hidden for 3 years :D",
            "I have a friend whom I met after he came into his money (from family) and he told me lots of stories of friends he lost because of the money. \n\nMainly they would ask for 10k here to help buy this and 20k there to help pay debt and after a little while he found they were avoiding him. He finally realized they didn't want to be asked to pay back the money so he said \"listen guys, I care more about our friendship than the money. Forget about and let's just be friends.\" \n\nAt most it took 3 months for them to ask him for more money. Shitty people will always be shitty people. You'll find good ones out there who don't care about your money. ",
            "[deleted]",
            "The easiest way to answer your friends (who don't really sound like friends, sorry about that) is to simply say, \"exbf was mistaken. My family has money. I do not.\" If they ask for expensive loans or whatever, you just say it's not in your budget. Talk about your budget enough and they'll get the hint. \"Oh, I sew this new Michael Kors purse/amazing 3d printer/rare book. Wish I could have it, but it's not in my budget.\"\n\nAll perfectly true. You set yourself a budget to live within, even if it's well below your means.\n\nOr get friends who understand that concept.",
            "This is an interesting cultural difference. \n\nIn my country everyone can really easily find out what the other person is making by simply asking from the tax office. They will give the information how much the person is paying tax from income and from other sources. It's all public information.\n\nEveryone in my workplace knows what the other guy is making and it's quite common to talk about it. Then I did the mistake of bringing up this topic with my US-colleagues. Their reaction was something akin to me kicking a puppy.\n\nThe other difference is that in my country, any kind of \"smooching\" of other peoples money is a very big no-no. If people go on a date, they usually pay their for their own food. Paying for other person's food is seen more as an insult (you *clearly* don't have enough money to pay for your food).\n\nI lost my point long ago, but it is very sad to find out this side of a person you've been with for a long time. But better now, than later.",
            "I was fortunate to learn this lesson when I was 15. \n\nI had a good part time job making $9 an hour when minimum wage was $4.25 in my state. I worked hard. I was smart. I feel I deserved it. \n\nMy hours sucked, so I'd get like 4 hours some weeks. This is what happens when you have an after school job at a place that closes at 5. It's especially complicated when you can't go to work because of sports. \n\nDespite this, my friends treated me like Mr. Moneybags. I was diligent on not paying for anything more than my fair share, but I was ridiculed for it. \n\n- One friend would buy pizza and share it with everyone but me...unless I paid him. He was happy to drink my soda, but refused to give me pizza like the others. All subsequent pizzas were BYO soda because fuck them. \n- Same friend was candid with others about what I made. Insert everyone hitting me up for a few bucks for lunch (so what - you weren't planning on eating lunch today so you brought none, but now you changed your mind?)\n- Whenever I didn't want to pay more than my fair share, I was called stingy. \n- No one ever paid me back when we were in a situation where someone only had a few bucks on them and I was smart enough to remember to bring a $20 (i.e. lunch at a cafe).\n\nI'm only friends with the one guy who bothered to make things fair for me, and he's on the other side of the country. The others can go fuck themselves. ",
            "People who react to learning something about you by grilling you about why you didn't tell them answer their own question.  You're not losing friends.  You're losing baggage.",
            "Ugh, totally sucks. When I read the original, it looked like it could have gone either way... it's a shame it went south. Silver lining? Bullet dodged!",
            "Kudos to you, OP. Ex-BF sounds like a dick. I realize it's one thing to not have money and want it all your life and not really have a clue how to get there. Frankly, mobility between economic classes is extremely difficult to accomplish. But (a) it wasn't his money, (b) he shouldn't have expected you to spend it on him, (c) he NEVER should have told people especially after you specifically asked him not to, (d) he ordered an expensive bottle of wine to show off like a dick, (e) your \"friend\" offered you to pay since you were loaded which is SO disrespectful and flat out preposterous, and (f) for any of your \"friends\" getting butt-hurt over not telling you how much money you have...it's none of their GD business. I have many very good close friends and they could all be broke or billionaires and I'd never know the difference. It doesn't concern me. God, the audacity of some people.\n\nGlad you didn't pay their stupid bar tab and glad you told your \"green-eyed\" ex to hit the road. He betrayed you and showed how little respect he has for you and now he just wants you back because you're wealthy. Blech.\n\n",
            "Wow, that is just beyond shitty. Good for you for not taking any of that crap!\n\nA few years ago I inherited quite a bit of land when my grandfather died, worth maybe half a mil USD. I did tell people but thankfully none of my friends ever expected anything from me. The only thing that ever happened was that a week after I sold some timber and got a nice lump sum of about 20k$, one of my friends dog got extremely sick, like she needed an operation the day after at the latest or she would die sick. My friends sister (also my friend) who knew about the money I just got came to me and informed me of the situation and I immediately offered the 900$ to get the dog the help she needed. That was over two years ago, my friend has payed me back in full in small, monthly payments and her dog is still alive and well. They never expected me to pay even though the sister knew I could, when I offereed my friend the money she had no idea I had it and almost refused. After that I've recieved a lot of thanks for helping but my remaining inheritance has never been brought up again. That's a more reasonable reaction in my world..",
            "People who respond like that around money (buying expensive things just for the heck of it, spending thoughtlessly just because they can) are often the *worst* to actually let get anywhere near it. \n\nAs unfortunate as this situation is honestly getting to see this side of things before you do consider something more permanent (that might involve sharing finances in any way) is probably good. This man sounds like he's going to drain that nest egg dry and honestly his reactions seem a little immature just in general. \n\nAs to your friends: I see some people are say to deny everything. Just to provide an alternative perspective: I'd say if they're really friends, come clean with both the situation and why you didn't feel it important/a good idea to bring up. You probably have emotional reasons for wanting to keep it private, and as they have an immediately recent example of your now-ex getting weird over the money situation, asking for things, and making situations awkward to reference.",
            "Those friends are not friends. You can afford to lose them - just like you can afford many other things they can't (sorry, I had to :P)\n\nI come from lower-middle class, but I was fortunate enough to land a scholarship to a rich private school in a very wealthy city. Many of my friends had multi-million dollar vacation houses, had parents who were European royalty or who owned major foreign companies, and owned at least 5 cars, most of which were luxury class, etc. \n\nI always shamelessly enjoyed the perks of having rich friends:\n\n* House parties that made the Great Gatsby pale in comparison\n\n* High-speed cruising on the freeway in a convertible Maserati\n\n* Underage invitations to privately owned clubs\n\n* Many more...\n\n**BUT**, unless I was offered, there was never a time I would get something around them that I couldn't afford. I would never dare ask them to pay for anything of mine without offering to pay them back if I was short on cash that day. And never would I expect anything from them that is related to finance. \n\nIf people find out you're rich and treat you differently because of it, they're just shitty. But that sad part, is it's most likely not their fault. Both my parents grew up in relative poverty, so their outlook on money is very different. I'm fairly certain that, had I not been exposed to wealthy friends, I would have shared their mentality: *we don't talk about money because it's a hindrance and it prevents us from doing what we want.*\n\nMy rich friends saw the opposite: *we don't keep money a secret because it's what gives us our freedom.*\n\nNaturally, if these friends of yours were only exposed to the former, jealousy would strain the relationship. It's simply a product of their upbringing, but you can't do much a bout it at this point :(\n\nGood of you to move on, and I hope you find friends who aren't as effected by a simple convenience of yours.",
            "lol honestly, I think the biggest issue here is that your ex is so, so terrible with money. Like, if I found out my fiancee was rich, I'd be like, \"great, we can save that for when we have a family and we'll have a good retirement\", not \"oh let's blow it all on total shit!\"\n\nI mean, seriously? Luxury cars, tours of Europe, $500 bottles of wine? That idiot has zero concept of money, if he had any he'd blow it within the year with nothing to show for it. You're 28 - you should be dating a responsible adult. ",
            "Could it be possible that he had some sort of inferiority complex after finding out? He may have taken realizing he wasn't able to afford as much as a shot to his self esteem and didn't know how to handle it. ",
            "[deleted]",
            "I'm sorry OP. Come join me for taco cabana happy hour $1.50 margaritas.  First ones on me. They're cheap, delicious,  and get the job done. . Seriously though, for a fast food chain,  these things are potent! ",
            "Congrats on eliminating leeches from your life. The less time you spend with them now, the better. They showed their true colors.",
            "This is one of the very few times, I've felt bad for someone with money. But being used is being used, rich or not. It's not fucking cool.",
            "Good on you for trying to salvage the relationship before he caused it to implode.  I know that there were several people on your original thread that wanted you to immediately break up with him without talking to him first.  ",
            "I just want to say what the fuck does anyone care you have money? I have rich friends and poor friends and it really doesn't matter as long as everyone is picking up their own drinks or whatever.\n\nI'm just appalled at everyone (except you) in this situation. Who acts this way? ",
            "That's so weird. My dad has money, but I've never really taken much. Just what I have needed to survive (ramen and such) while wallowing in depression. He was a bit of an enabler, I suppose, but at least I got through. Before I met my husband, I always struggled with whether or not to share this with the guys I dated. Some people were never able to understand that I didn't want to take something for nothing (actually, it's not nothing, my dad is kind of an asshole; sometimes the price is too high) and that just because the money was there didn't mean that I should abuse it. I'm sure he would have let me if I had chosen to do so. Thankfully my husband appreciates my work ethic and self-respect. There are more good ones out there, you'll find yours.",
            "460 dollars for a bottle of wine !? Holy fuck what an asshole, I wouldn't even break that out for a 10 year aniversary ",
            "Just gonna throw this out here- if I had dated someone for 3 years and presumably was struggling or held back financially, I'd be pretty hurt if all of a sudden I had found out they were rich. I'm not supporting what the guy ended up doing but still - after 3 years you're supposed to know everything about that person",
            "Sorry you had to go through this, but he's a dick and you're better off without him (and some 'friends')",
            "Sorry to hear some people you cared about valued possessions over your personality and relationship :( It's only up from here!",
            "I hope this doesn't scare you off from telling other friends/SOs about this. Not everyone will react so idiotically, but also, you might want to tell them sooner so you don't waste so much time with some one who can't handle it. ",
            "Wow OP, so sorry...people are so fucking clueless..but at least now you know who you can trust.\n\nGood luck in your future OP <3",
            "Sounds like you had a pretty damn good reason to keep your money from them, if *as soon as they find out about it* they're all, \"oh, OP, buy us this expensive shit.\"\n\nRich people don't get to be rich by letting people mooch off of them. And they sure don't stay rich by funding their moocher friends' desires for expensive wine, just because.",
            "God no! You're damn right to be conservative. That's **your** money. Especially as you're not married, that should stay as your money.\n\nI'd have dumped him on the basis of knowing he's been snooping into your finances alone - that's bang out of order. Ok, so he took it to heart - props to him for realising that was a bellend-move. Leave it at that.\n\n*TELLS HIS FRIENDS*?! That's kind of a niche form of blackmail if you ask me. Game of Thrones-ey shit. The more people he can wing-round to support his claim [to your cash, not the Throne], the more pressure you're going to feel in order to generously give it up.\n\nI'd usually support not breaking up. To be your boyfriend there must have been something there in which I cannot detect in a Reddit post - but by this post alone; he's a dickhead.  \n\nWouldn't worry about losing your friends either. True friends (and people with a decent level of common sense) would have recognise his arrogance in just peeping into your bank finances. Encouraging you to pay the bill?! They're as bad as he is by the sounds of it.",
            "Look some of the things he did were shitty yes... But three fucking years he was with you and he never knew about your finances? Have you ever thought that maybe he also feels VERY betrayed? He probably wonders what else you have been hiding from him?\n\nEveryone is jumping on the OMG MONEY GRABBING CUNT wagon and is overlooking that he might also be really hurt and feeling very untrusted.",
            "i never discuss what i make and prefer to live below my means regardless...i'm just more comfortable that way. i love giving and providing but only when it is because i want to. anytime i start to feel taken advantage of for whatever monetary purposes, if i feel you like my wallet more than me, it's the beginning of the end. you have to be with someone who loves you, not what you can do for them.",
            "Good riddance! And as for your friends that are willing to end a friendship over money, screw them, you're better off. I can't imagine being upset a friend didn't divulge they had a lot of money or something. It just doesn't matter.",
            "This is why money stays with money normally. It's tough to date that far below your income bracket and not be seen as a lottery win. ",
            "I come from  a bit of wealth. Though this will get buried, you hid something from him for years that was part of your history and who you are. \n\nIsn't that a bit strange?",
            "I agree with you, he was acting inappropriately. On another note, if I had been dating someone for 3 years and they hadn't been honest with me about their financial situation, I would feel very betrayed. We live in a capitalist system, despite what people like to tell themselves finances are a big part of what defines us. I would have broken it off with YOU on the spot, for your dishonesty, rather than trying to emotionally exhort you.",
            ">So I didn't automatically dump my boyfriend.\n\nbad move\n\n>However this came the relationship fatality. \n>I broke up with him the next day.\n\n\nGreat move. Be thankful you found out what he is really like before you married him. I have a family friend. They are worth upwards of 300 million. She married the guy and had two kids. Right after that his true nature came out. They finally divorced and he went for the money grab.",
            "If I found out that my gf of three years had been keepong a secret like this from me for years, I would develop trust issues and start to wonder why. Gradually, I suspect that I would reason that she never told me about her money, because she cares more about her money than she does about me. Then I would do some stupid things ina childish and frustrated way to prove this theory and eventually it would become a self-fulfilling prophecy and we would break up. ",
            "Any friends you lose over this werent your friends.\n\nAny friends who come knocking for a handout arent your friends.\n\nWhat a douchebag - just be glad you found out now and he didnt manage to keep it quiet till post-marriage.",
            "Well sense your single now...",
            "What an asshat. Not you, him.",
            "If money affects a relationship in either direction, they were never truly your friend to begin with.",
            "FOUR HUNDRED AND SIXTY DOLLARS?! what is wrong with that guy",
            "Jesus, any friends or partners that just decide on their own to help themselves to your money can just go kick rocks.",
            "First time I see this behavior in a Canadian... \n\nLosing few people here and there (in a scenario like this one) can prove a good thing, eventually. Stay strong! ",
            "You're ex was a shithead and by the sounds of it, your so called friends, are scummy people too. No decent person would EVER say something like that. People just assuming you pay for their stuff bc you have the money...that's freaking ridiculous. I would love to talk to these people for you, because screw that! That's awful. That kind of mentality, completely turns me off of people. ",
            ">ue several other people who I've never told about my family's money suddenly grilling me on why I never trusted them enough to tell them about my money and oh, thought we were friends that kind of thing.\n\nHow the hell would this come up in conversation anyway?  Even with friends that are obviously wealthy, I would never dream of talking to them about their finances and I most certainly wouldn't feel entitled to mooch off of them.",
            "It is kinda weird that you would hold something as important as financials from him for 3 years...",
            "I agree with everyone that the BF was a dick hole.  But, I  couldn't imagine being with someone 3 years and not really knowing their financial status.  Seems like the type if thing you find out after a few months of knowing someone.  ",
            "(((hugs)))\n\nHe was never on your side.\n\nAnyone who would say \"well you have XX so you don't care about me\" isn't a keeper.\n\nAnyone who would expect you to change who you are and the way you live because you revealed a secret about yourself isn't a keeper.\n\nAnyone who would give you the silent for 2 days isn't a keeper.\n\nAnd yes - anyone who would betray a confidence that you SPECIFICALLY asked him to keep - isn't a keeper.",
            "Honestly, if you lose friends over this, good riddance. A good friend shouldn't even think twice about your personal finances or whether or not you not disclosing them was an issue of trust.. I mean, what the damn hell?",
            "Wowww. I'm so so sorry. \n\nKeep strong love and block him :) ",
            "I'm glad that you gave him a chance to come correct - but then stuck to your guns when he did not  \n  \nit's a shame he could not live up to your expectations ",
            "What an unbelievable loser. Sounds like he resented you for having family money and was determined to take his anger out on you in really stupid, inappropriate ways. You're well rid of this selfish dick!",
            "So what you are saying is, you are single. Looking for a fat 40 something married man to sugar mommy? \n\nSeriously though, you made the right move.",
            "Wow shitty boyfriend AND shitty friends. Even if I know a friend is really well off, like my best friend, I never, ever ask her to pay for shit, not even drinks. What kind of friend does that? And what kind of friend thinks it's any of their damn business if you have money and didn't tell them? That's none of their business. Cut your losses on both ends, none of them are worth your time.",
            "I'm sorry you have to lose those relationships. But honestly, better now than later. You deserve better and I'm sure you will find people of character to replace the ones that obviously don't have any. ",
            "Sorry to hear OP but it's for the best.  Even if he didn't say anything to your friends you likely would have broken up later anyway.  His whole attitude towards you changed when he heard about the money, you don't need a man like that. ",
            "[deleted]",
            "What an asshole, I'm glad you ended things because it's not healthy to have someone like that around. I don't think couples need to share their finances when they're together, married or dating, and to feel entitled like that speaks volumes about his intentions. Sucks to lose some friends and a bf but it's worth it, I started making more money and one friend said 'Oh, miss money bags here can cover breakfast' which I ended fast. I don't like people leeching off me, friends shouldn't stick around for what you can buy.",
            "It's a bummer that their true colors are green and green. \n\nI had a friend in college who drove one of the junkiest cars around, lived in the crappiest dorm (no AC), and dressed like a bum. He told me a few months into the school year over some beers that he comes from hard core money, but hell, I would have never known. He sure didn't act like it. And I didn't treat him any differently, although I did make him chip in for gas when I had to drive his silly ass around because his car wouldn't start.\n\nAnyway, the point is, real friends don't care about money. If they do, they ain't your friends. ",
            "Sorry to hear that.  It's so rare that someone who inherited some money is actually responsible about not spending it all in one place.  It's a shame that your boyfriend couldn't understand that, even after a direct conversation about it.  Sounds like you did the right thing, it's just such a bummer that you might lose friends out of it too.",
            "'Friends were shocked I couldn't trust them with this'\n\nWhat a bullshit thing of them to say, it has nothing to do with trust. You just don't tell people around you what you are worth, it doesn't come up and it isn't some personal secret that should be told to your nearest and dearest..",
            "While not in the same income bracket as you are, I have a friend who ended up with quite a significant inheritance a few years ago. I knew she inherited money, but never asked how much. She is frugal and has been using the money when she needed it, but usually just keeps it in the hands of a stock broker.\n\nOne day we were talking finances and I found out how much she had. It was in the $300,000 range. Then I felt bad for her. Instead of a dad she had money. Her dad was really cool. I consider her fortunate that she was left with money, but I don't envy how she got it, or feel jealous that I don't have it, or ever ask her to pay for things just because. I want her to have that money to save for a rainy day. It's hers.\n\nI make about $50K/year, so it's literally 6 years' salary to me. I can see why it took her so long to tell me though, considering this story. I also pay her to watch my dogs when I leave town.  \n\n",
            "He betrayed your trust and your privacy.  He has low character.  One chance was enough,  good riddance.  He's trash",
            "Good job. I remember reading, probably here on Reddit that 70-80% of family inheritance is gone by the 3rd generation of it. Sit on it, and build it up to share with your kids someday. Use it for a rainy day, or when life really needs some spice. \n\nAs far as your ex, keep people like that away from your life. Find someone fiscally responsible who already has their life set, and enjoys life because of love and not materialistic shit. \n\nStay strong. Only the strength of the bonds of the best kind of friends are the ones who can handle money. I'm lucky to have found friends that don't see money as a caveat for friendship. ",
            "Fuck that guy, that fucking sucks.  Though it sounds like you might've dodged a Peter Griffen",
            "what an idiot",
            "Damn op, you dodged a bullet tho. He doesnt sem too bright. ",
            "The best people I've met with money act like everyone else and you would never guess.  They are generous, usually on the sly, cordial and never over the top.",
            "Way to go OP.  You did the right thing.",
            "I'm going to leave a comment on the other side.  I come from and am pretty wealthy, and relatively young (under 35). It's very difficult to meet women and balance being nice/thoughtful (with gifts or whatever) and not make it look like I'm just trying to show off.  Honestly I'd rather them not know till I get married but that's not exactly feasible.  So it does such because you'll always have that deep though of if this person likes you or your money.  And ironically finding girls that don't care about the money at all is just as bad because they can be overwhelmed or start thinking being from money makes you bad.  I can see why wealthy people find similar people to marry, it's a world you need to come from to understand. ",
            "Sooooo, what you're saying is, you're single!?",
            "You should post pictures of you going to europe to pick up your new luxury car.",
            "[deleted]",
            "I am sure plenty of other people have said it, but it is worth reiterating: you are better off without him/them.",
            "Can someone explain to me why someone personal wealth should be disclosed to friends. I don't see how your friends feel entitled to know how much money you have.",
            "Good Job! Good job trusting yourself to give him another chance and holding onto your boundaries when he blew it. Sorry you had to go through so much crap but you handled it the best one could hope!",
            "At least you got a pretty cool Reddit name from all of this. \n\nSeriously though, sorry this happened to you, but I am glad you found out before you got married or had kids together. ",
            "Finally, someone with some sense and backbone in /r/relationships. Well done, OP.",
            "Not sure what kind of people you hang around with buddy, but hopefully you find some friends and a partner that can look passed the money. If you're ever in Vancouver, fire me a message and I'll take you for drinks with my friends, people who could care less about money, and more about getting hammered and offending people.",
            "Any 'friends' you lose from this aren't really friends. You want to live your life your way, and they are appalled they weren't allowed to leech off you. Hopefully you find a way to surround yourself by people that like you and not the money. Sadly, reality tv and movies has ingrained 'cash is king' and people want to live large without realizing you either burn out or cash out on spendy lifestyles.",
            "Call bullshit. This isn't real. No one hides family wealth for 3 years, in which case that's weird of you, secondly, no one acts like this in public, unless you are literally dating wayyyy beneath your class level. This isn't real.",
            "You're right - the trust thing is killer. If you can't trust him to keep your secrets, he's not your true partner. I'm really sorry about that. I know the love doesn't stop just because the relationship is broken.  Good luck to you and kudos for taking care of business, even though it sucked. ",
            "You dated this guy for 3 years and pretended to be poor? I mean, what do you think rich is? If you have millions and didn't tell your boyfriend of 3 years then you suck and he's better off without you. If it's less than millions, you aren't rich, (just possibly arrogant) with a financially ignorant ex boyfriend that you are better off without.",
            "This is why people with money tend to only socialize with people who have money",
            "This is I'm sure partly why you kept things quiet. Money makes a lot of people ugly. These people weren't your friends and your now ex is a jerk. Move on! Gym and a spa day will help! ",
            "It's remarkable how childish a person can be. This shows how irresponsibility applies not just to one area of our lives, but to all of them. He couldn't handle the responsibility of knowing you had money and couldn't control his desires related to it. He couldn't keep it a secret because he's jealous. Immature across the board.\n\nDude is not mature enough to be in a relationship with someone as mature as you.\n\nI realize it's three years of your life, but think of it as: **only** three years of your life. Now you have a new criteria for finding a suitable mate. I recommend you figure out how to bring up the subject early in a relationship and then see how the guy reacts.\n\n",
            "Ooookay, first off, most of your friends and boyfriend acted like COMPLETE ASSHOLES. I don't care how much money you have; you don't spend it without even asking them. Seeing as you kept it under wraps like that, it's completely ridiculous that they just started gossiping about it and expecting you to pay. Don't even try to talk to them; I would heavily recommend looking into new friends. If they happen to figure out how much money you have, then make it abundantly clear that you're not paying for anything they want; that way, it's out of the way.",
            "I'm sorry, but when I saw how your \"friend\" reacted and said you could pick up the tab... Who the hell assumes that?! It's bad enough that your boyfriend (now ex) told everybody. He even assumed he could order the wine without even asking.\n\nI hope you just paid for your beers and left your ex hanging with the bottle of wine he ordered. ",
            "It's weird... I have a friend who makes a boatload of money and I'd never, ever in a million years expect him to pay anything for me. Why? I'm not a freeloader, I can pay for my own crap.  ",
            "You know, if your friends want to stop being your friend because of your money, then they were never really your friends. What do they expect you to have given them money? Helped them financially? Picked up the tab every time you went out? That's a crock of shit, and they wonder why you kept it a secret to begin with. Your money is no one's business but your own. Fuck them. ",
            "You don't STAY rich by buying new cars, big houses and expensive wine. You dodged a bullet, he's a dumb ass and would've pissed your money away.",
            "So what's the plan for next time, how do keep this secret as long as you can or date someone with a similar socioeconomic means.",
            "Apparently, you two didn't have the same dreams. \n\nDid he grow up lower or lower-middle class? He's probably dreamt of doing or having the things you take for granted. \n\nAfter reading this and the original, it seems to me as though you two initially weren't right for each other, and this is the issue that pressed it. \n\nI don't believe that his reaction was wrong, I think he just was shocked and felt sour and didn't know how to express it.\n\nPerhaps he was just overwhelmed with the idea that you could give the two of you a comfortable life, which is understandable. ",
            "Good job of breaking up with him especially after the way he has been acting.\n\nThat said, why do you keep your money a secret for so long? Like I could understand not telling a person right away but 3 years is a pretty long time...\n\nIf I was rich I definitely wouldn't be hiding it for that long and I certainly would spend some of it on fancy things(definitely not a luxury car but some of the nicer things in life).\n\nI am just generally curious why you wait/waited so long?",
            "Your better off. \n\n\nMoney is the biggest divider of people in my expeirence. I think you should ask your family of how to handle it. You did pretty well, but, people will find out and I guess they know how to handle it. ",
            "You made the right decision.  ",
            "Wow, your ex was shitty and any friends you lose over this are shitty as well. Not worth keeping around imo. Some people just care about money too much and get so greedy and entitled about it. Sorry about the breakup but you are better off!",
            "Nice work. It's hard to dump an SO when it's necessary. Some people seem so decent for so long.",
            "Children gonna be children.  Good riddance.",
            "It sounds like your x was resentful and felt \"entitled.\"  Even worse his friends too.  Block and don't look back. Be upfront about your position, rather then hiding it.  Best to know ones \"true colors\" before investing any time in a relationship.",
            "This is the 2nd of this type of post I've read lately. I don't get why knowing someone has a lot of money changes things for people. Some people...\n\nIt's like hey you're rich, waiiitt WE'RE RICH WOO HOO. ",
            "I've been waiting for this update- good for you and fuck him! ",
            "what an asshole",
            "Those with wealth: *\"He becomes suspicious of honest friendship—indeed honest friendship is rarely offered him; those who could have been his friends are too fastidious to be jostled by beggars, too proud to risk being mistaken for one.\"* (Robert Heinlein's  'Stranger in a Strange Land')\n\nI'm sorry for the loss of your relationship, but the ex has done you a bit of a favor by starting the 'weeding-out' process of finding out which of those 'friends' are people you want to keep in your life.",
            "Trust me OP, this is the best thing that could have happened to you.  They (boyfriend + \"friends\") feel entitled to your money.  Be grateful that they showed their true colours.  They started using you the second they found out you were well off, how do you think they will treat you a month from now, a year from now... \nIf he feels entitled to your money as a boyfriend, how much more entitled to your wealth will he feel once he's your husband?.. ",
            "=/ I'm sorry about your ex. Good riddance though, that is disrespectful.",
            "I'm really sorry for your disappointing experience. But I'm happy you're better off now, and I'm impressed by how you handled things. Good for you.",
            "that sucks. money does weird stuff to people. sorry that happened to you.",
            "Wow, was really rooting for this to work out. But to be completely honest, you're boyfriends sounds like a super big douche complete with complete social tard tendencies. I mean when he ordered that wine it was a vain (socially inappropriate and from a drinker perspective silly thing to order when there's plenty of expensive scotches that go well with beers) attempt to show off your cash and what he assumes is a huge windfall for himself. Avoid telling people about your money in the future, look for humble people who are comfortable in their own skin, and don't need to impress anyone. ",
            "what the hell is wrong with people",
            "Wow. Don't talk to those \"friends\" either. I can see why you didn't trust them to know about your fortune!",
            ">no it's good /u/FamilyHeiress [1] is really rich, she can pick up our tab tonight, \n\nYou were much nicer waiting until the next day to break up with him. I would have left right then and let them handle the tab. That is grossly inappropriate. Sorry for your situation, but good for your for ending a toxic relationship. Money changes people, you now see this man's true colors.",
            "Seriously, why would they be angry about you not telling them you have money? Who cares!?\n\nIf it turned out a friend of mine was rich it would only amount to \"holy shit, that's awesome bud! Good for you!\" and that's it. Other peoples' finances are of no business to others.",
            "OP, I can completely understand you not telling them about your wealth. When people find out about it they seem to treat you differently. Money shouldn't define who you are and I am glad to know you're not letting it. \n\nYour ex boyfriend had no right to tell them any of that information and you did the right thing to end it. Cheers! ",
            "So sorry it ended this way, sista. I've been wondering how it went for you and appreciate the update. Here's hoping the healing process is smooth & gentle. ",
            "Way to stick to your guns. You're amazing!! ",
            "Stories like this make me incredibly sad. For one, it brings back to light the reminder that in fact yes, money does matter. Quite a lot. For another, these are probably not friends you would have lost otherwise. Or worse, that you will find that a greater percentage of the populace acts like this and you will lose your faith in humanity.\n\nI'm sorry OP, it could be a really shitty road ahead. And people wonder why people with money all stick together. They're not separating themselves from the rest of us just to be dicks, they're avoiding our judgment and shitty attitudes as well.",
            ">cue several other people who I've never told about my family's money suddenly grilling me on why I never trusted them enough to tell them about my money and oh, thought we were friends that kind of thing.\n\nyour \"friends\" are upset because you don't discuss your finance with them...that's some real friends....",
            "I'm just... irrationally angry over this. Your boyfriend and apparently some of your friends are entitled bloodsucking assholes. I'm so glad you got out of that relationship.  Don't let him convince you to come back. Remember he's panicking at the loss of your money, not at losing you. He's a dick. \n\nI'm poor. My friends know this. A couple of them are very well off and we have an agreement where if they invite me someplace, they expect to cover my expenses unless I say otherwise (sometimes anyway because they're sweet).  When I go out with them to a restaurant, for example, I always ask what they're ordering and then I order something that costs no more than what they ordered.  If I ordered a $450 bottle of wine they'd probably ask if I'd gone off my meds. That's such a blatantly rude, entitled, and unreasonable thing to do.  It's inexcusable.  \n\nAnd without such an arrangement, who in the hell just assumes that anyone else will pay their tab just because their target is financially well-off?  \n\nI hope you find better friends, OP. You deserve better. No one deserves that kind of treatment. ",
            "Personal finances don't need become an open subject until you marry someone, IMO.  Shitty way for things to go down, but you don't need someone who's distracted and attracted to money instead of who you are.",
            "You did a good thing breaking it up! Your ex is a moron ",
            "I'm so glad 3 years is all you lost with this character. He fucked up. I would consider a prenuptial agreement in the future when/if you decide to marry someone. ",
            "Money sucks, people with a messed up relationship to it even more so",
            "Came here just to type \"yes\" as a response to the title.",
            "For the most part I don't know or care how much money my friends have or make. It's none of my business. I think you did the right thing by dumping him. They aren't your friends if they have attitudes. You aren't obligated to tell anyone your private business.",
            "Way to stand up for yourself! You will be better off. Just keeping working hard and do your best to stay positive. ",
            "He clearly had very little respect for you or your feelings. He would have been perfectly happy to mooch off of you if you had gotten married.\n\nYou dodged a bullet there.",
            "You made the right move OP! Good luck to you!",
            "Op, fuck him, if he reacts that way over some money rather than value your feelings then he's a shitty human being. It sucks that it took 3 years into your relationship to find out but not all guys out there are like him. Don't let something like this make you hesitant to trust people - not all people are shitty like your friends.",
            "Good for you",
            "Hey girl. =)\n\n\nSeriously, though, money is the thing that is most likely going to get fought about between a couple. It sucks he couldn't handle it. There were probably lots of issues around it, and the most important thing is to communicate (sounds like perhaps that was really the problem).\n",
            "Sounds like he felt a sense of entitlement. Pity how money can ruin relationships.",
            "Seriously? I can't believe your 'friends' acted that way. Your finances are none of their business. I am glad that don't have to deal with him anymore, sounds like he is just a gold digger. ",
            "People who care about money and not the person is fucking trash. You deserve so much better! You are a humble level headed person OP. You will go far. Fuck those who cant see past your richness. ",
            "YES",
            "Good for you.",
            "You stopped being his gf when he found out about the money, you became just a wallet for him. Good riddance.",
            "Good for you! ",
            "This is a good lesson to people that money isn't a panacea.  I'm sorry OP but I'm glad you found out about him.  Next time maybe you should tell them earlier and see how they treat you from the start.   ",
            "[deleted]",
            "I think you did the right thing. From what I understand the house for you two was something he wanted not something he had bought already and wanted you to pay for it. People should try to split stuff when they are in a relationship if they can but he clearly just wanted you to buy everything for him ",
            "Good job! Now you can find someone who doesn't care about you for you money, but cares about you as a person!",
            "I'm sorry you had to suffer that. You have the opportunity to find someone trustworthy and less self centered now.\n\nThis is why you find out if they love *you* before they find out about the money. You get to know how they feel about you, and see if the money revelation changes them. You did nothing wrong, and everything right. He broke your trust first by digging, then by breaking his word to you.",
            "The proper response to \"why didn't you trust us enough to tell us about your money?\" was to point to bf and then his douchey friend. That should be a pretty obvious answer to that question.",
            "Wow...\n\nYou did the right thing, and congrats on purging your life of people who value money more than relationships!",
            "It sounds like he didn't like the little talk you had. He still felt that you should be spoiling him so he went and told your friends about how much money you have too. Your real friends might be upset that you didn't share that info but they'll get over it.  I hope you didn't buy that expensive bottle! ",
            "Wow, what a dickhead! Good on you for trying. You'll be ok.  :)",
            "OP I'm really proud of you! It's not only hard to break up with someone when they haven't done anything SPECIFICALLY wrong (cheated, were physically abusive, etc). And for you to do it so efficiently (for lack of a better word) and to realize you need to cut those mooching friends out too, is really awesome.",
            "You did the right thing...  Better to lose 3 years than be stuck with a tool.  The only advice I have is next time, once you can trust your SO, you should have the baggage discussion... This is where you both lay of your baggage, wants, dreams and expectations on the table.  This clears it down to the reality and the mask is off.  That's when the shit gets real and you decide to go from there....   My future wife and I did this on our 3rd date... Married 9 months later... Celebrated 19th anniversary a month ago.   ",
            "If they're buying expensive as balls wine and expecting you to pay they're not your friends. OP, you don't need those bellends in your life.\nI wish you all the best!",
            "I can definitely see getting excited about finding out your SO is wealthy and overreacting, I could see that happening to myself. However it really crosses a line when you bring it up with people against their wishes. Money can cause some people to really change their behavior, and tap into some dark parts of their persona. That's why a lot of lottery winners are advised and often choose to remain anonymous. This situation is awful, but I can't imagine what it'd be like if strangers treated you like this.",
            "Money doesn't change people it just reveals their true nature.  Hell I had been with a girl for 3 years and she told me she was loaded first thought through my head would be, if we ever had kids I hopefully wouldn't have to worry about them being homeless or hungry even if the relationship deteriorated after the fact. I guess he doesn't know of the idea that the way you have so much money is you spend as little as possible.",
            "I'd say you're very validated in the approach that you took. You offered him an opportunity after he started making demands but now that he betrayed your trust and started venting his anger to your friends which is very fucked up. No reason to stay with someone who is so insecure and selfish. Good on you, take care.",
            "I caught this late. Your ex-boyfriend is a selfish and classless moron. I come from some money as well, I was taught from a very young age that people treat you differently if they know that. I was also taught to respect people regardless of the money that they have, judge them on their actions. \n\nMost of my friends never asked me for anything, even when they eventually figured out that I had money. I am pretty generous with my close friends but they never ask for anything outright, and they keep their mouth shut when talking about me to other people. They understand that I am the one that decides when/if someone gets to know about my situation.\n\nWhen it comes to relationships, I had a hard time trusting people so it took me a long time (I am 45) to find someone I trusted enough to let into my life (I had a disastrous LTR in my 20s that did not help as well, but $ were not a factor in that). My wife and I combine everything, I provide for most things but she would NEVER ask me to spend money on her. We have a great life and she loves me for who I am, not what is in my trust fund.\n\nYou learnt a harsh lesson but it will serve you well in the future. You may want to re-evaluate some of those friendships as well, they seem pretty shallow and untrustworthy.\n\nI feel for you and relate to your situation, most people think that everything is easy when you have money. They are wrong, stuff like this is really crappy to deal with.\n\nLike you said, fuck him. Zero Contact Plan and erase him (and some of those 'friend' perhaps) from your life.",
            "A guy like that, I don't care if he loves you or not, is not mature enough to handle finances. You would not want to be with a person who can't put his brain ahead but rather just keep on spending as it comes.",
            "Oh yeah, simple answer is to dump his ass.",
            "Please don't tell me you picked up the wine tab",
            "what a fucking asshole.\n\nnow you are on your way to finding a gentlemen. ",
            "did you pay the tab that night?\n\nbtw if i was to find out a close friend is rich i'd prolly ask as well how come you never told me. but i wouldn't make a big deal or get all aggressive. so if they simply said why didnt you tell us, or were (slightly) offended, i dont think that's a big deal. if they make a huge deal or dont want to be friends with you, that's kind of a not-friendship-material friend.",
            "I'm certainly not rich haha but this is just a lack of character on their part. I would never dream of acting like such a damned pirate. ",
            "He is a fool.  Its not his money.  Tell him to go get his own.\n\nThe only time it matters is if you are not sharing expenses fairly (and fairly does not always mean equally.)",
            "So sorry that happened to you. \n\nIt baffles me that your friends were offended that you didn't tell them how much money you have. And the fact that one friend assumed you would just pick up their tab after your ex wrongly ordered the bottle in the first place, is shockingly disrespectful to me.\n\nI an so sorry. ",
            "So...single now eh?  ",
            "Fuck yeah, good for you. It's not anyone's money but yours. You were very generous and he just wanted it for himself. Just sign a prenup before you get married to someone",
            "So you're single then...? Hello.",
            "Wow - there are so many better people out there, and you deserve better. I'm sorry your relationship ended like that, but it's great that you respect yourself enough to step out when someone treats you like that. ",
            "Soooo newly single and wealthy eh? You uh... Wanna go get a coffee and talk about it?\n\nHarr. I'm just kidding. I love my wife and kid. Sorry that money killed your relationship. Not everyone is like that. But I have no idea how one would find out that about someone without risking the entire relationship. Good luck.",
            "See... I'm the petty sort of asshole that, if I were in your shoes, would take that trip to Europe to visit family and friends, and take a shitload of pictures, and making sure he sees them. All the shit he thought of doing, like visiting the old Roman ruins or the Black Forests in Germany, just make sure he knows you're there. Rub that shit in nice and hard and deep. \n\nBut, also, 3 years was a hellova long time to spend with someone, and it really sucks it had to come to this. But in the end someone's true nature always comes out. Better now than before you had invested more financially and emotionally. ",
            "Bullet dodged.  I grew up in an area with a lot of people with money (I was one of the ones without it) and it's shitty how some people are.  As a kid I felt bad if a friend had to borrow a horse from someone at her barn so we could go trail riding together (I always brushed the horses and washed them if the weather was warm enough, so most people were fine with it), and I can't imagine WTF makes them think they should be entitled to you buying them things just because.  Eventually you will find good people, as long as you don't get offended at them offering you wine from Trader Joe's.",
            "Can I just say, what an idiot! My ex wife (nothing to do with the money) had quite a substantial amount of savings. In the 13 years we were together, I never once asked her for any financial help, nor did I ever assume that the money was now 'Ours' when we got married. As far as I was concerned 'That was her money'.\nEven when we divorced I never cited nor staked claim to her money.\n\nYour 'EX' sounds like a right knob!",
            "Sorry that happened to you. and fuck him glad you found out now. ",
            "That behavior is unfucking believable. I have friends that I barely know who always are very generous at the bar and buy a round on their turn without a single complaint. To expect somebody to buy a round is so incredibly disrespectful.\n\nTake when you are given but don't keep taking. That is called being rude.",
            "You dodged a bullet OP.  What you are going through now is infinitely easier than if you were married with children.  Good on you for moving on and you may wish to consider the following...\n\n'Where large sums of money are concerned, it is advisable to trust nobody.'  Agatha Christie",
            "You have a good head on your shoulders. It'll be rough for a little while but it will get better. Now you have time for that one activity you always wanted to try!",
            "Good choice. My ex was the same way except replace the word \"money\" with \"relationship that moves forward.\" Lol",
            "What a bunch of entitled morons. Do you know whether he even managed to pay his tab after you left? (460+ dollars??)\n\nYou handled this like a reasonable human being with healthy boundaries, keep it up OP. ",
            "You dodge a bullet",
            "That sucks, but it's good you found out now rather than years into marriage. ",
            "A large percentage of people with little to no money saved are in that situation because they can't manage their own money and live within their means and save. When these people find out their friends have money they want to extend their shitty habits to their friends money as it is all they know.  I want to believe anyone can change, but I know far too many stories of painful failed relationships where they didn't.  You made another good financial decision by dumping him, I hope it doesn't cost you too much in the emotional department. Best of luck. ",
            "If you haven't seen it, I recommend watching the movie \"Holiday\" with Katherine Hepburn. It wonderfully shows how someone *should* react to hearing their significant other has a ton of money. ",
            "You dodged a buckshot.",
            "Ohh well you tried.  He had a great opportunity to repair things but blew it.",
            "Glad you had the heart to do the right thing and dump those losers!\n\nGood luck on your new adventure!",
            "I've never been in your situation.. So, yeah... Grain of salt, and all that.\n\n\nOne thing I've always heard was that it's difficult for 'wealthy' people to find real friends (who aren't also wealthy). There's always a concern that people are treating them good because they want some '$'. Not because they really like you.\n\n\nFrom the sounds of what you said. Your Ex liked you before he knew... \n\n\nI can't help but wonder what the conversation would sound like if the gender roles were reversed? Which secrets are OK to keep from one another? Who gets to decide?\n\n\nIf you think he's trying to bully you into spending on him, kick him to the curb. If you think he's upset because you're keeping secrets... Well, that's up to you.\n\n\n Whatever your intentions were, keeping your '$' a secret, could it be argued that you were being deceitful? Not really the best foundation to build on.",
            "You're from Italy?  Your English is amazing. ",
            "Good riddance. Sensible girl",
            "Brovo, good for you! ",
            "Good job OP\n",
            "Your friends sound shitty, as well.",
            "Op, same age and same issue.  \n\nDrop him and do not have any relations with anyone he may be associated with.\n\nBest of luck",
            "Good for you, I'm glad you woke up and realized that there are some people who will use you for your money...\n\nScrew them, your friends and your future love will adore you broke or rich.",
            "Well he's an idiot.  ",
            "That's good of you to try and work it out, but you did the right thing in the long run, really. Try to keep how that made you feel. Don't like dwell on it, but just remember it, that way if you ever get that lonely urge to go back you can bring that back up and go, \"NAH, FUCK THAT!\" Also, so you know the same thing for future reference to recognize the signs in others.",
            "Don't look back, completely inappropriate and selfish among other things...as difficult as it's going to be to break clean and not wonder and as much as I hate this saying \"deuces\" to the 28  douche bag and the \"friends\" that don't get it.",
            "I am sorry you lost your bf and friends. Now come to think of it, do other rich people tell their friends or bt/gf how rich they are or is it something to keep a secret? Money really does bring out the worst in everyone.",
            "Goddamn, this is frustrating. At least it happened before marriage. Any friend who decides to be shitty to you because you don't want to spend your money on them, isn't worth being your friend in the first place. Fuck that. Good for you for cutting that dude out of your life quick-like. ",
            "I feel really blessed to have friends that have self-respect and don't *expect* handouts. They work hard for what they have, and when I pay for things they're always thankful. I would drop them SO quick if it was any other way.",
            "Dump his stupid ass and try again. Next time don't let anyone know what you are worth.\n\nHe will never stop thinking about it.Your relationship is ruined.",
            "Glad you're staying sucker free in 2015. Upward and onward.",
            "People become dicks so fast over money. Im glad you stood your ground. ",
            "Well at least he made it easier to bring down the hammer. Have a great life!",
            "What a shitbag",
            "That fucking sucks, it sucking fucks. It's shitty. ",
            "From the looks of it he must of had a talk with the \"friends\" which was why he came back with the second argument. ",
            "Do you mind me asking where the money is from? Did you earn it, or is it an inheritance/trust fund?",
            "It sucks but you should maybe try to find someone more like you next",
            "You did the right thing. This is exactly why you didn't tell many people about your money. \n\nYou're being responsible. Lots of people blow the inheritance that should have lasted them their whole lives on frivolous shit. ",
            ">I broke up with him the next day\n\nGood on you",
            "Considering it wasn't a one time thing on his part to bring that stuff up, you made the right decision.  Even if you lost some friends in the process you'll be better off in the long run.",
            "I'm here for you if you need a new friend, I don't need your money, jk yes i do i broke af. ;(",
            "Good for you.",
            "When this happens to a woman it's a bunch of drama. When it happens to a man its just a normal relationship.  ",
            "Being poor, I would of kept my mouth shut...rubbed her feet lol",
            "Are you a millionaire or just wealthy without being *that* wealthy?",
            "Everything has mostly been said and I know it sucks, but he was that guy whether you had money or not, knowing just brought out it out into the open.  The expensive bottle of wine was a passive-aggressive way to make your money an issue again.  Good riddance.\n\n",
            "Invest all the money wisely so then you don't have any more to give away. It will be all tied up. :)",
            "That was so inappropriate.  he will continue to bring up the topic of money and manipulate you about money. So glad you moved on, you don't need to deal with that.",
            "I see you've already dumped him so it means you didn't love him. You have your life ahead of you, get outta there. ",
            "Fuck him... The sooner you forget about him and move on - the better.\n\nSincerely hope you find your next love soon.",
            "Friendship necissitates equality.",
            "Yea you should end it immediately",
            "My ex and I were in a similar situation. She comes from a family of dentists, and despite having no concept of money, she still lives like an average 20 year old. \n\nIt felt weird with her offering to pay almost every time we went out, and she found it strange I wanted to pay for half of it. \n\nThe way I see it, it's nice having a SO with money, but by no means should it become something that the relationship is based around. \n\nYou made the right choice. It would've only gotten worse. "
        ]
    }
]