[
    {
        "post_id": "dab8yj",
        "author": "justanothertrwaway",
        "title": "Update: Not sure if I'm [27] overreacting to bf's [30] joking.",
        "url": "https://www.reddit.com/r/relationships/comments/dab8yj/update_not_sure_if_im_27_overreacting_to_bfs_30/",
        "score": 5321,
        "num_comments": 441,
        "created_utc": 1569643624.0,
        "selftext": "Original post for anyone interested: [https://www.reddit.com/r/relationships/comments/d864x4/not\\_sure\\_if\\_im\\_27\\_overreacting\\_to\\_bfs\\_30\\_joking/](https://www.reddit.com/r/relationships/comments/d864x4/not_sure_if_im_27_overreacting_to_bfs_30_joking/)\n\n&#x200B;\n\nI spoke to my bf the day after I responded to a lot of you. I decided I was going to talk to him one more time and set a boundary about these 'jokes' or tell him I wasn't moving in with him and that maybe we need to reevaluate the relationship. I told him I wanted to have a serious discussion and he immediately asked if I wanted to break up with him because he figured it was coming. I was taken back because I didn't expect that reaction. I didn't say anything at first, but then I told him that I wanted to talk to him about his jokes and, honestly, his behavior in general when it comes to people and making fun of them in such a mean way, especially when they ask him to stop. I also did a little reading on verbal abuse and abuse in general and things were a lot more clear. \n\nSo, he listened to me and then told me that he didn't like people trying to \"change him\" and that his last girlfriend had tried to do the same and she couldn't accept him for who he was; he thought I would be different because I was more understanding and fun. I'll admit, that is probably one of my flaws, that I try to understand everyone's position about most things and give them far too many chances, there are exceptions, but for the most part, I will try to understand someone and work with them on it. I asked him if she, his ex, and the overweight friend were the only ones who had left him over this behavior and he told me that he'd lost a lot of friends and dating was hard because women tended to cut out pretty quickly, again, in his words, because people are too sensitive and want him to change how he is. He seemed very stuck on being accepted as he is and angry about people trying to change him. I changed direction and asked him if he actually thought anything was wrong with what he said, I used my experiences, specifically, and told him about how I felt when we were looking at places and he said what he said to the potential landlords. He, of course, said they were jokes and that he'd never think less of me because of how much money I made because he kind of figured I didn't make a lot because of how I tended to do things. I asked him to elaborate and he said how I was always on things like Groupon or using coupons at stores or wanting to go out when places had specials or something and he was never around anyone who needed to do that type of thing. So, I told him that I did think he has a problem with people who earn less and don't live a similar lifestyle to him and that, maybe, he just didn't see it. That, sometimes, we are trying to be \"good\" because we have these thoughts of how we should be on the surface and we try to follow them, but when it's more close to home, our real feelings come out because we're faced with it more and I told him that was okay, but that I didn't think it would work for us, that he might be more comfortable with someone who makes the same amount as him and can contribute how he'd like. He interrupted me and told me he didn't want someone like that because he couldn't be himself around someone obsessed with money and material things (not what I said, btw); that they'd be too concerned with money and he liked me because I wasn't that way. I kind of ignored that, but it kind of told me that he either doesn't want someone who has as much \"power\" in the relationship as he has or he thinks women who want more/expect more of him are gold diggers or someone trying to take advantage in some way, I don't know. Anyway, I continued and told him that even if he felt they were just jokes, they were wearing on me and my self esteem and I couldn't live that way. I also told him that it's natural for people to not want to change when they've been a certain way for a long time and so it seems right to us, but that change can be good; that maybe therapy could be good at helping with that. I told him that it's wonderful to be accepted for who you are, but if who you are is, well, jerk-ish, people are a lot less likely to accept you unless they are also jerks and nothing good can come from a bunch of jerks getting together because they'll be toxic to other people, as well as to each other, and I told him I think he's better than that, that he deserves much better. That any woman he truly loves deserves much better than being verbally abused and made to feel like they aren't his equal or worthy.\n\nHe sat there and didn't say anything for a while, just looked at me and sighed a lot. He finally said he was disappointed in me for wanting to abandon him because he thought we were true soulmates and he couldn't believe I was saying such abusive stuff about him. I was shocked he was calling me abusive because I didn't think I was being abusive by telling him why I don't want to continue if this is how he will act and that the way he acts is not, well, good. Maybe I went a little far in saying anything about a future girlfriend, but I guess I wanted to impress on him that, if his friends and partners keep leaving because of this behavior, everyone will keep leaving. The only partners willing to stay will be someone who dishes it just as well as they take it, and he knows he's actually very sensitive and wouldn't like that or it'll be someone who lacks any self esteem and he'll make her feel even worse about herself until she breaks down. Like, I could feel myself getting to that point and that's why I'm so angry and frustrated. Not only with the fact that he was now turning all this around to me being abusive, but that he still didn't really seem to get what I was saying about my feelings; it made me realize, yes, I need to leave this situation and I do feel bad about it because I do feel like I'm abandoning him, but at the same time, it just doesn't seem like my feelings or anyone's, are important to him, so why should I stay with someone who doesn't seem to get that his behavior isn't exactly such that gets people to stay in his life? I realized I probably wasn't going to get to him and the conversation itself had me shaking because I was upset and disappointed, myself. However, looking back, I could see signs that this is who he is, other people's feelings just don't mean a lot to him and doing some soul searching, I realize that I, stupidly, thought he would change over time, but waiting on that is wearing on me and our last conversation tells me that he doesn't see anything wrong with what he does, so it's unlikely he will change. \n\nHe didn't seem interested in saying anything else besides that he was sorry I felt the way I did. I told him that I thought we needed to give up on things and find someone better for ourselves elsewhere. He didn't say anything, so I just left. A few hours later I got a confusing text from him telling me that he \"hadn't seen who I was and that I had abusive tendencies\". I didn't respond and just blocked him on everything. I'm sad things ended the way they did, but it was probably for the best. I'll either be good alone or I'll find someone who I work better with. And I want to give a huge thank you to everyone who commented on my last post and sorry if I didn't get back to anyone. I've been quite torn up over this, even though it was my decision. I miss him more as a friend than a partner, but I don't think being friends would work out too well, either, so I'm just leaving it. \n\n&#x200B;\n\nTL;DR: Tried to have a talk with my bf, didn't go well, so we broke up. Oh well.",
        "permalink": "/r/relationships/comments/dab8yj/update_not_sure_if_im_27_overreacting_to_bfs_30/",
        "comments": [
            "When he started saying *you* were the one being abusive, I got scared for a second that you'd believe him. \n\nI think he told himself you are the abusive one, so that he doesn't have to accept responsibility for the breakup in his own mind. \n\"She suddenly became abusive! I was just being myself!\"\n\nIn any case, good job on getting out of there. This guy had issues and wasn't willing to better himself.",
            "> he couldn't believe I was saying such abusive stuff about him.\n\nWooow. My jaw literally dropped. It’s amazing how far people can go in the rabbit hole of denial.\n\nI almost feel sorry for him, because he would rather drive everyone away than change. But, “almost”. You were brilliant, gave him the come-to-Jesus talk in a way that couldn’t be ignored, and he still found a way to ignore it.",
            "[deleted]",
            "This is gaslighting.\n\n>Gaslighting is a form of psychological manipulation in which a person seeks to sow seeds of doubt in a targeted individual or in members of a targeted group, making them question their own memory, perception, and sanity.\n\nA really common example of this is twisting what you've called them out for doing, and accusing you of doing that very thing. Making you question your memory of events, your perception of yourself & you sanity/judgement of the relationship.\n\nYou're doing the right thing, run.",
            "You handled this amazingly well and you’re going to be fine. I’ve rarely read such a level-headed post, you did all you could to gently point out where he’s going wrong without being nasty about it. Sadly, he will probably end up being a very lonely, bitter person if he doesn’t take your advice.",
            "Man... that was hard to read.. \n\nYour bf is a complete and utter idiot. He thinks the whole world is against him and he is too stubborn to realize that it is not and sometimes you have to work with yourself and your behavior because... you're an asshat and not everybody likes an asshat.\n\nYou deserve so much better.. you really do.",
            "Toxic people tend to victimize themselves and hence justify their actions.  \nI broke up with my ex because he thought I was too fat and too ugly for him (and with my low self-esteem, he never thought I would leave him). When I broke up, his excuse to what he said was that he cared for me and wanted me to take care of myself. \n\nYou handled it just fine. \nAnd truly,  it's better to be alone than being with a self-entitled jerk.",
            "You did the right thing. I hope you're okay and take time for yourself",
            "I think you dodged a bullet. Notice how he was making \"jokes\" and was calling you sensitive for asking him to stop but the moment you said something about him that he didn't like, you were suddenly abusive.  He dishes them out but can't it himself. These tend to be the worst kind of people.",
            "**A Narcissist's Prayer**\n\nThat didn't happen.\n\nAnd if it did, it wasn't that bad.\n\nAnd if it was, that's not a big deal.\n\nAnd if it is, that's not my fault.\n\nAnd if it was, I didn't mean it.\n\nAnd if I did...\n\nYou deserved it.",
            "Oh my god. I actually had a tough time finishing because I was getting so pissed off at what he was saying. \n\nHe's absolutely an asshole, and inconsiderate, and his last girlfriend probably couldn't fucking take it anymore. He needs to get over himself because he's literally delusional about himself. No one's trying to \"change\" him. He just refuses to acknowledge any of his flaws and try and work through them. That's the mark of someone extremely immature and definitely below your level. I mean he's literally acting like a 15 year old boy. \n\nLet him go find someone as shallow as he is. You're not abandoning anything, and throughout that whole conversation not ONCE did he acknowledge that he hurt you, or even talk about you! It was all about himself!! \"You're abusing ME, abandoning ME, trying to change ME, disappointing ME, not who I thought you were\". \n\nSeriously. You're out of his league.",
            "You approached everything exactly right! I was full of admiration for you while reading how you conducted the conversation. It sucks that he wasn't receptive to the idea of change even when the problems with his behaviour were explained to him so patiently and kindly.\n\nI'm glad you got yourself out of that situation and didn't stick around to have your self-esteem constantly eroded by his \"jokes\".\n\nBest of luck for the future, OP!",
            "Good to hear but jeez this man is thick in the head",
            "Oops. Just replied to your original post not realising there was an update. Anyway.,. Him accusing you of being abusive is classic abusive tendencies. Just so you know.\n\nIt’s the same thing as when they say things like “I didn’t want to hit you, you made me, why couldn’t you have just xyz “.\n\nIt’s blaming you for his bad behaviour because he will not see himself as wrong without some hard work in therapy. It’s also how he gets you apologising for his behaviour which means you won’t mention your feelings next time for fear that you will be seen as abusive. That’s the cycle, that’s how it happens.\n\nYou’ve done so well to get out of there. Keep it that way, keep him blocked, do not talk to him because intentionally or not he’s manipulating you emotionally . Good luck OP, on to the next!",
            "This guy is a master manipulator this one. I'm glad you got out of that, good for you. Now your self-care takes priority.",
            "this thirty year old child called you abusive for telling him people may not like him if he makes demeaning jokes about them... he pulled out the uno reverse card in real life....\n\ngood call on leaving him.",
            "\"He finally said he was disappointed in me for wanting to abandon him\"\n\nHoly Manipulation 101. Get the fuck outta there and fuck that guy. \n\nThis fight/break up reads like you two should be in your teens/early 20s.",
            "I needed this. My relationship is heading in a similar direction and I can't take much more of it. Everytime I criticise I get told to leave or accept her how she is. And if I ask what I can do better for her I get met with silence. I don't have much advice unfortunately.",
            "[removed]",
            "I am so proud of you. You handled it amazingly well.\nI know I'm only an Internet stranger, but I am still proud of the big step you just took.",
            "You have the patience of a saint. I wouldn’t stand for the attitude at all.\n\nFoundation of any relationship is to value the other person. To value their opinions, well being, values, dreams. He didn’t value anything about you or anyone else. Without it, you can’t have empathy, respect or trust. If something is important to you, it should be important to your partner, and visa versa.",
            "Oh God, I got so angry on your behalf when he ~~said~~ turned it on you and said you were being the abusive one. Well done for getting out of an emotionally abusive relationship. He clearly is too selfish to think about anyone else apart from himself and it all has to be about him.\n\nEdit: rogue word",
            "Great job, I am glad you got out of that situation. I really suggest reading Why Does He Do That by Lundy Bancroft I think it will help you have more clarity on the situation. Just Google the name, there's a free pdf of it online :)",
            "He sounds like a narcissist tbh. Constantly blaming everything on everyone else, incapable of seeing his own faults, hell he even tried to gaslight you at the end. Good for you for not putting up with it!",
            "Imagine for a moment that he wasn’t making jokes about your income. Imagine he was making jokes about... penguins.\n\nAnd for some reason jokes about penguins make you feel sad. I don’t know why. It’s not important. \n\nAnd for some other reason your boyfriend loved penguin jokes. And told penguin jokes ALL the time.\n\nHere’s the thing. If you said “penguin jokes make me feel SO sad and I wish you wouldn’t tell them to me or around me” he’d be a jerk for insisting that because they were jokes you weren’t allowed to get upset by them. \n\nI mean maybe you’d break up if he decided he needed to tell penguin jokes that badly. But... a decent guy would go “well the whole point of a joke is that it is funny and my girlfriend doesn’t find these jokes funny at all and they make her feel really upset. So I will tell different kind of jokes that make her laugh!”\n\nJokes are only jokes if they are funny. You weren’t laughing and he’s an asshole.",
            "This conversation sounded so familiar to me. You are so much better off not trying to walk on eggshells to please a person who has no empathy for you or others and shifts the ground under you constantly. Over time, with distance, it becomes clear that your actions were not the cause.",
            "> and I do feel bad about it because I do feel like I'm abandoning him, but at the same time, it just doesn't seem like my feelings or anyone's, are important to him, so why should I stay with someone who doesn't seem to get that his behavior isn't exactly such that gets people to stay in his life? \n\nThere he goes, pushing his narrative. \n\nYou didn’t “abandon” him. He *pushed* you away with his “jokes” that clearly show a lack of respect for you. It only became a problem when you didn’t want to be his verbal punching bag and stood up for yourself. \n\nIf wanting respect is abusive, there is a whole lot of mental gymnastics he has to do to see himself as the victim and everyone else as being in the wrong. If a pig is happiest wallowing in their own shit, just leave them there.",
            "He sounds exhausting, manipulative and horrible.  Congratulations on getting free!",
            "This guy reminds me of my BIL. Never takes responsibility, projects everything towards everyone else or anyone. People like that dont grasp the fact that they hurt others and they dont care. Im glad you are out, cz no matter how many times you talk to him or try to make him see things in a different prespective, its not gonna work. He cant face anything negative about himself so its better to leave before things get worse",
            "You stood up for yourself and he did not like that.\n\nYou did the right thing and I do not think you are abusive. You handled the situation well and expressed your needs, but ultimately he is unwilling to listen. Unfortunately, he will be told this repeatedly until he learns or gives up and lives alone. This is not about controlling him, this is about him realizing he needs to change by growing up and developing empathy. He is not husband material and he is not ready to be a father.\n\nGood call and good luck moving on,",
            "When he said you were abusive for essentially calling him out, that's when I knew things weren't right. I'm also a very understanding person like yourself, and I think it's hard for us to call someone out sometimes. I also came to realise that understanding why someone did something, why they are the way they are etc. does not mean that that's okay. Good on you for standing up to him! And I'm glad you ended things now, before you did actually move in, and that his abusive behaviour didn't escalate.",
            "Great to hear. As for saying you won’t be able to find someone because of your income source. My friend is on disability also and no one would be able to tell she can’t work from looking at her. She will never be able to hold down a full time job. \n\nShe had a very bad break up but was attempting to date again when my husband also happened to be told by a guy he works with that he was hoping to find someone. So we swapped their numbers and they have been together almost 2 years. She still lives with her parents also. \n\nRelationships are hard work and it’s not the most important thing in the world to have but I just want you to know it is possible.. without being treated horribly because you can’t work.",
            "Holy shit, he is a goddamn psycho, he is sorry for you feeling the way you do? Thats the worst kind of apology ever, i would rather someone tell me to fuck off than that. He is a moron who doesnt see what he truly is, and he is not sorry for anything that he has done.",
            "I sort of doubt that he actually felt like you were being abusive. I'm thinking the word 'abuse' only popped into his mind when you brought it up. He knows that you're empathetic and care about how other people feel. He knows that if you found out you were abusing someone, you would feel horrified and guilty and want to make amends. He only threw that word at you to manipulate you into staying. \n\nIf my read on his thought process is accurate, that's borderline psychotic. Either way, good on you for having the strength to fight through the manipulation and get out.",
            "This reminds me of an ex I had that also claimed I was abusive when I sat her down and tried to talk to her about something selfish she did that basically screwed over me and a mutual friend of ours. I was polite, clear and concise much like you were, but she immediately played the victim and said how \"she couldn't believe I was abusive like her last relationship, that I knew what it had done to her mentally.\" I've learned the hard way in life that the most toxic people will always try to turn your own insecurities against you so that they can keep up the manipulation. I'm glad you got out of that situation, because anyone who actually cares about you won't make jokes to complete strangers at your expense.",
            "Have you ever considered becoming a therapist? Your empathy and emotional intelligence is off the charts",
            "Well done, you can walk away with a clear concience. He's a jerk & will never learn from his mistakes because according to him he doesn't make any.\nMaybe when you are ready to date again bring up your income sooner to weed out the jerks. You will know sooner they aren't worth your time & move on.",
            "All of this hits so close to home. Except I'm divorcing the man who treated me, and still treats me like this after over 20 years. The joking, the projection, the gaslighting, the financial abuse, the \"what you do is never good enough.\" I'm in therapy now, trying to get my anxiety under wraps and find some semblance of my self esteem. He says \"I'm just an angry guy, always have been, always will be. People need to accept I'll never change.\" \n\nThis was hard to read, but I'm proud of you and I'm glad you didn't move in with him. Your life would end up a hell of a lot differently if you had.",
            "Hes always going to be like this, and people are always going to leave him. He will always blame the other people because hes not a person who sees fault in himself. Especially at this age he should, by now, have problem solved this out. You absolutely cannot be the first person in his 30 years that has told him this. He chooses not to accept it. That is just who he is, hes shown you that and thankfully you believed him.",
            "You did awesome.\n\nMost men in relationships don’t see “hey can you stop making those jokes to me” as as ask to change their personality, because it’s not. They can still be a jokester, they just can’t hurt their SO in the process.\n\nIt sucks that he’s the kind of guy to throw out dumb shit to come out “on top” which is exactly what he did when he called you abusive.\n\nI hope you don’t believe him. What you asked was so incredibly reasonable and was a request to be nicer to you.\n\nSpend some times doing all the things you love and when you’re ready get back out there, I have no doubt you’ll find a guy who, when you tell him, says “what’s wrong? Is there any way I can help? We’re in this together.” When it comes to your disability, whatever it might be.",
            "Abusers call you abusive when you stand up for yourself. Saying \"I'm sorry you feel this way\" ia such a cop out, not an apology and takes ZERO responsibility. It sucks but you made the right decision. He wants someone with less money, so that he can have the power. He wants to dominate, and be the \"man\" of the house. He doesn't want a partner.\n\nYou're better off and you can and will find someone who doesn't treat you this way.\n\nFor future, always observe how they treat others such as waiters, service workers, homeless people, what jokes they make about people with disabilities, of different races etc.",
            "You went above and beyond here, trying to help him grow as a human being. He is clearly not interested, and him trying to turn the talk into you being the abusive one is just further proof that you need be away from him. Look at how many people have left him, and he's not even vaguely entertaining the thought that maybe he should rethink his ways... It's very sad. Blocking and moving one is the right choice here, you've done more than enough, you didn't even owe him that thoughtful talk about what's making you leave, with such a soft touch. \n\nAnd while I think that always trying to put yourself in other peoples shoes and considering people's point of views is super important, giving people too many chances when they're actually being abusive to you is something to work on as well. It's a fine balance, and getting better at discerning what is and isn't abuse (abuse should be cut off your life right away in my opinion, no more chances given) is a great skill to develop. It's the difference between being understanding and being a doormat, and it's really hard to figure that one out.",
            "You seem awesome btw",
            "I'm proud of you. Also? \"I'm sorry you feel that way\" is a complete and total bullshit apology.",
            "This isn't about changing him, it's about having enough respect for you to not make you feel shitty.\n\nI am applying for disability and I know what you mean about not wanting to say anything. The last boyfriend I was honest with was a sick about it, making the same comments about how I \"sat around all day\", then it progressed to criticizing everything I hadn't done and ignoring everything I had.\n\nI started to dread when he was coming home because I knew there would be \"jokes\" that made me feel worthless. It progressed into a suicid attempt because he made me feel like money was all that mattered and since I couldn't offer that, I didn't matter. \n\nYou're right, your feelings don't matter because your feelings, to him, are silly. It's not him, it's you, for being too sensitive. Cut your losses and find someone who loves what you CAN contribute to the relationship. And don't feel bad for him, for a second. You aren't abandoning him, you are putting your mental health first. He is pushing you away.\n\nGood luck.",
            "He's a narcissist..\nDon't waste ur time",
            "It looks like you dodged a bullet.",
            "Congrats on losing 175lb of dead weight!",
            "He sounds INCREDIBLY egotistical and narcissistic. I’m so glad you got away",
            "It's far easier to accept that everyone else is the problem than to seriously consider the consequences of your own actions. Props to you for trying to explain but the man's 30 and already had a number of relationships fail for the same reason. He's determined to stick his head in the sand. He'll probably be having this same conversation with another girl in 9 months time.",
            "I'm so impressed by how well you dealt with this. You come across as very intelligent, caring, expressive, and patient. You've given this guy a gift that not many would or could do -- a thorough exploration and explanation of why he's pushing people away; maybe one day he'll digest it and it'll help him out, but even if not, you can walk away knowing you did everything you could. It's telling that he went straight to \"do you want to break up\" when you wanted to talk things out -- you'll take your maturity and openness on to the next relationship, and it'll make it all the better for it. I wish you well!",
            "It sounds like he was attempting to gaslight you, especially in the text after you broke up. Like he was trying to turn it around on you so you would question yourself and maybe even try to change your own behavior and give him another chance. \n\nI’m very, very glad that you ended things the way you did. You were mature about it and firmly stuck up for yourself and your feelings. Go you! \n\nHe honestly sounds extremely narcissistic and even maybe a little like a sociopath, as he can’t seem to empathize with anyone, and doesn’t care to try.",
            "Wow this was fulllllllll of red flags on his part.",
            "I’m so glad you didn’t let this clown gaslight you into staying in a relationship where you weren’t respected. Good on you OP.",
            "Honestly you were setting boundaries here and he couldn’t take it. You did such a good job btw!! This is NOT easy. And honestly you dodged a bullet with this guy.",
            "It blows my mind when people cannot separate who they are from what they do. Him trying to explain to you that him joking around as he called it and being abusive to you was who he was as opposed to what his behavior was is ridiculous. Behavior is a choice. He chooses to make fun of people. Be chooses to say those things to you. He chooses that. BEHAVIOR  IS A CHOICE. Who you are isn't what you're behavior is. It may drive what your behavior is but you can change that behavior. I work with emotionally disturbed and behavior disordered middle school students. They don't accept responsibility for their actions because they feel that people are trying to change them. No. We are trying to get you to change your behavior. That's what's turning people off to you. When you get that, that's when you've shown you've grown up.",
            "\"No matter how open, loving, and peaceful you attempt to be, you can only meet someone as deeply as they've met themselves. This is the heart of clarity\"",
            "I think this situation shows how wise you are, and how kept together you are. Although it may hurt for now, you made the right choice, I think. Good on you. :)",
            "Wow I can't believe all the traffic he used to turn it all on you. I've read about people who are like \"@accept me as I am!\" But I love how you said well if who you are is a jerk I can accept that is a fact but don't need to subject myself to it.\n\nYou are very perceptive and smart in seeing the meaning behind everything he said! Good job. Go forth and live your life!  :)",
            "You seem really empathetic and thoughtful, giving him every chance to talk things out and come to a mutual understanding.  You deserve a much, much better and happier relationship.  Something that is just *easy*.",
            "All of these were things my ex used to do before he started hitting me. You were smart to get out. You’re a strong person. ♥️",
            "You say that talk didn’t go well?  It was amazing!  You were so well spoken in a tough situation!  I’m never like that!",
            "Oh thank god, I remember you and this is exactly the update post I was hoping to see. You are a champ, you handled that amazing!  I hope you can see now how you deserve so much better than him! \nBest of luck moving forward!",
            "Great work standing up for yourself and standing your ground! That guy has a lot of stuff he needs to work through before he'll be a good partner to anyone. You deserve a lot better. \n\nMeanwhile, check out the book *Why Does He Do That?* by Lundy Bancroft. I found it pretty useful when I was leaving an abusive relationship.",
            "> he was sorry I felt the way I did. \n\nreddit boys and girls, arent we all familiar with this phrase?",
            "That was a conversation with a narcissist.",
            "I'm so glad you ignored his text, and blocked him completely! It can be hard, but definitely the best decision there. 😊",
            "He sounds like a gaslighter.",
            "He was gaslighting you and good for you for spotting it then getting the hell out. It's not hard to fall into a manipulator's trap.",
            "You sound like an incredibly nice, understanding and awesome person. I am indeed sure you will find the person for you, who will tolerate how emphatic and ready to accept and discuss you are and who will act the same way towards you.\n\nI assure you you will find a person like that and your replationship will be easy-peasy, if I may say :D\n\nI am a girl and I act jerk-ish and I think I do want to change, but it's so hard, since people tolerate me and it makes me think \"lel why should I change then?\" \n\nAfter reading your story, the things you said and why you said it and especially your thoughts about them I want to be so much like you, dude. You're an awesome human being, be sure about that.",
            "He’s borderline if not straight up abusive and sounds like a narcissist. I’m glad you’re free of that. You absolutely deserve to be treated properly and confronting him about it was fucking awesome of you. I’m sorry you took the time to try and educate him and he just threw it in your face like that, but at least you can’t waste any more time on him now!",
            "What a massive asshole.\nGood for you OP, you deserve better, I hope some day you find your special someone who treats you the way you deserve. I don't know you, but I'm so proud of the decision you took. You're worthy.",
            "Oh shit are you dating my ex? Wow the similarities are crazy! I just wish I had handled it like you did and not moved in with him. At least we are both free now :)",
            "Narcissists love to \"flip the script\" to try to garner as many \"feel sad for me!\" points as they can. That could be what you were seeing here. I will say right here, you completely did the right thing. You do not have any abusive tendencies, he heard that from a past partner and is now using it in his aresnal against you (or anyone else who won't bow down to the king).\n\nYou must love and value yourself before you love anyone else. But if that someone else can't love and value you, then you are wasting your time. Significant others aren't fixer uppers usually, if they show you who they are, you should believe them and act accordingly. In this case, he has no interest in being a partner, he wants a fan club, at best.\n\nYou will find someone who can love you and respect you and build a fruitful relationship with. This one will not fruit though, moving on is the best thing you can do, life is way too short to wait on other people to act right when they refuse to admit there even might be a problem.",
            "I see a lot of myself in you. I am a very adaptive, understanding, compromising, empathetic person. And I don’t say that to brag, I see it as a struggle because I ALWAYS want to see and uunderstand others. It is good for big picture things, like being open-minded about other views, but has been not so good for me with relationships. I don’t have an answer other than what you have already done - realize when you’re not getting what you deserve, even if it went on for too long.\n\nAll that to say, I’d like to offer a counter to your concern with income. I have a pretty good job, and probably a slightly above average income for someone my age in my area, and I have had men do the same thing as what happened to you, only flipped. They’ll make snide remarks about how I probably think I have more say, or can afford more, or throw my money around (I don’t, I’m actually a lot like you in that I look for deals, bargain shop, and like to have savings). Insecure people are just insecure people, and someone who won’t see his flaws or want to change or get better is NOT someone we want to spend our lives with. We are very accommodating people, and lots of men would  be lucky to have someone who can give and receive love in many ways, who may have our own love language, like many people say, but are grateful and accepting of love given to us in ANY language because we can see the intent. That is actually really rare.\n\nI have found everyone wants to love and be loved. But it’s fewer people who are truly well adjusted enough to be who we (all people) need. Don’t settle! You seem very kind, rational, open-minded, forgiving and adaptable. I guarantee there is someone great out there for you! 💚",
            "Well done. \n\nHe's a giant asshole. He will learn one day when he's on the receiving end of those kind of jokes.",
            "IM SO FUCKING PROUD OF YOU!!!!! This guy was HELLA abusive, sheesh. I'm glad you didn't let him sucker you back in. And he clearly has a pattern of abuse that he pins on everyone he subjects to it. Grossssss",
            "funny how he gets mad at you for \"trying to change him\" when he's the one being an asshole and harrassing people for things they CAN'T change",
            "This is a great update! You explained your boundaries and how you don't want to be talked down to. He said he didn't want to change anything, including the way he talks down to you ^^fuck ^^that . And so you parted ways! This is 100% the opposite of abusive and in fact a very admirable navigation of a relationship! Good for you and good luck in life!",
            "Time to say goodbye, with absolutely zero contact.",
            "Based on your writing here my take away is this: you're a healthy young woman with a good head on her shoulders and you are the kind of person healthy people want to spend time with.\n\nContinue to believe in yourself and a fantastic man will find you.",
            "Wow, nuclear warhead dodged, OP. Your ex's entire conversation with you around this was one giant attempt to deflect attention from his own behaviors including the one of throwing out the abusive accusation at you. Given that you never told him he was abusive I'm betting someone out there sure has before and so he decided he'd beat you to \"the punch\" of it and try to spin it back on you.\n\nI'm proud that you calmly made your points and stood up for yourself. And decided that this was the sign to end things and go. Because let's face facts, your ex knows his behavior is a problem. He knows it's why people keep leaving him. But it's the behavior he enjoys so much he's not willing to change or even accept  that this type of behavior is absolutely unacceptable. \n\nHe won't ever change, because he enjoys what he does to other people. It's not that he's not aware of other people's feelings. He very much is and he very much enjoys the power he has to hurt people through those feelings and emotions. And he's not about to give up his own enjoyment of that and that's really what he was saying to you. \n\nAnd this is the person you leave in your past, take note of the red flags he showed, and use as a blueprint of the \"If I see this in someone else I'm gone,\" varieyt. \n\nI'd almost pity the guy if his type wasn't such a slow poisonous stain on other people's happiness.\n\nAt any rate you are free of this. And I think the longer you stay free the more you're going to realize how much his behaviors affected you and how much better life is without him in it. Thank god he showed you this before you all moved in together. Or you'd be stuck in a much, much worse nightmare. Go live your life. Understand you were not abusive. That's a really common tactic abusers like to use to try and deflect from their own behavior. And his entire conversation with you was one giant deflection to try to get you to back down, so he could continue the behavior he enjoys.",
            "There are so many responses so I don't know if it's been said but I think it would greatly benefit you if you worked on accepting your disability. I've been disabled since I was 16, 13 years now. I tried to avoid questions about work but it was exhausting. I tell anyone that asks now that I'm disabled. I tell first dates that I'm disabled. It took me years to get here. I've dated martyrs who seem to get off on telling people they're dating a disabled woman.  \n I'm now in a great relationship where my partner pays the majority of our bills and doesn't need to be thanked. He does it out of love because he wants me to be comfortable. In return, I take care of our house as much as I'm physically able to.",
            "I’m pretty sure you dodged a few bullets there! Onwards and upwards.\nI am 37 and essentially medically retired. Too sick to work - it’s the worst! It makes my blood boil when people say they’d rather be home all day. And the sleep ins.. yeah, they are great! But seeing 4 doctors a week.. that’s not fun. My husband makes jokes about me being retired but we share money and he would never ever put me down in front of anybody. \n\nYou will meet someone that loves you for who you are. OR you may have a fulfilling life full of friends and family. Never settle because you’re afraid that no one will love you again. You sound very kind and caring and I’m sure you’ll find someone WORTHY of your time x",
            "Don't worry too much about the confusing text. That's a DARVO tactic: \"Deny, Attack, Reverse Victim and Offender\". \n\nIt sounds like he wasn't in a place to change his behavior, so you did the right thing by cutting it off there. You need to take care of yourself first and foremost, and the situation was not a healthy one for you.",
            "What a ridiculous child he is. I'm glad you saw that before investing any more time in him. Good for you for listening to your instincts and following through!",
            "Abusive people will often turn their abusive behavior around and accuse the abused person of being abusive. That was a huge red flag right there in that conversation. Be ware moving forward. I’m so glad that you got out of that relationship. You dodged a major problem. You will find another relationship with time, but take time to learn from this one and heal.",
            "He sounds insane tbh. He needs to see someone.",
            "I cant believe he tried to gaslight you into believing youre the abusive one. Wow. Good on you for not believing that. \n\nIm glad you got out of that situation. Youve opened yourself for better possibilities and 100% someone better who will understand you and NOT shit on you for who you are",
            "I had to double check the ages, because this sounded exactly like an ex-friend of mine. I couldn't tease or joke with him about anything or I was 'bullying' him, but he could say whatever cruel thing he wanted and if I had a problem with it I was 'trying to make him censor himself'. I lasted about 3 months before I just went scorched earth and blocked him everywhere, and he still mopes about how I abandoned him and am a snowflake to mutual friends. In the end, people like that are perfectly happy being exactly who they are, and are it seems incapable of actually caring how their actions effect anyone else. I just hope that guy's girlfriend realizes what a terrible person he is like you did, and gets out with her sanity in tact.",
            "Please don't ever second guess yourself, you did really well to get away from someone like that. He obviously had no respect for you or your feelings. Ultimately it doesn't matter if someone like that intends to be horrible to you or not, the fact is he *was* horrible and was unwilling to even consider your point of view or your feelings. That's plenty bad enough.\n\nIt's funny how quick he was to play the victim when he's totally unapologetic about his own actions, no matter how they hurt others.",
            "“I don’t like what you’re saying...”\n\n\n*pulls reverse UNO card out of pocket*\n\n\nSo glad he’s now your ex!!",
            "When we called you abusive, it's sounds like gaslighting.  He was avoiding the real problems.  He doesn't seem right for you.",
            "Good for you taking your mental health seriously and getting out of that relationship. \nSo many, men and women, stay in toxic relationships for far longer than they should for a whole lot of different reasons. \n\nFor me, it was because he was my first BF and I felt I had this sense of loyalty to keep trying and forgiving him/giving him another chance. Gave him waaaaaay more chances than he deserved. Was in the relationship for 2 and a half years :/ should have left at the 2 month mark honestly.\nBut it was a learning experiences, and I am still working though the damage it caused mentally for me, and I had left him back in 2014. \nEven my next relationship I kept putting my bfs needs before mine because he had so many mental issues. So when mine finally flaired up, he got upset with me because he didn't need my negativity atm. That one is also gone. I was with him for 3 years. The moment he got mad at me for not being bubbly 24/7, I realized I was already breaking up with him around the 2 year mark, but held on in hopes things would get better. \n It all made me realize once again I was being too patient and giving the guy too many chances, but in a different way. This one wasnt abusive, just other issues (hurtful and nonhurtful both).\nI had stayed in a dead end relationship for a whole year, because I didn't want to hurt him, and was hoping he would finally step up. \n\nBut I had still, even after learning from the first ex, made the mistake of giving them lots of chances.\nAnd I may still make that mistake in other relationships, because I always hope for the best out of my SOs. But here is to hoping I can learn to stand up for myself more lol.\n\nI wish you the best in working through any issues this may have caused you. Know you are worthy, you are NOT abusive, and have the right to look out for your health more than making a SO happy.",
            "Boy bye! Good riddance to bad rubbbish. 100% he would have continued to make you feel like shit until you started to think \"maybe i am shit.\" Sending you love and good vibes as you heal from this experience!",
            "As someone who has a horribly verbal abuse past relationship- I noticed when I eventually pointed out the things he said seemed abusive (followed by why and how it made me feel) he ALSO almost completely ignored it, then berated me constantly on ME being the abusive one over and over and over. It was like I taught him a new word. Run FAR away, he was desperately trying to knock you down and pull himself above you.",
            "Congratulations on leaving a sociopath. That man had no empathy and he is dangerous. I feel sorry for any person who comes into contact with him. \n\nYou did the right thing.",
            "So an asshole thinks everyone is an asshole for not letting him be an asshole to everyone.\n\nGood riddance.",
            "The fact that he's lost multiple friends and relationships because of this and still thinks it's other people's fault is incredible. It's a very good thing you got out, he's not going to change. \n\n\nAs a side note. I think some people (like your ex) get the wrong idea when people say you shouldn't change for anybody. It doesn't mean you shouldn't change as a person, and improve as a person from them. Actually I think that's one of the most important parts of relationships. I think I've learned something about myself and changed things about myself with every person I dated. And thats a good thing.",
            "You sound like a calm, reasonable person trying to communicate to someone who has a Jake Paul attitude. Good on you for leaving him, and remember that you're not the one at fault here.",
            "> He finally said he was disappointed in me for wanting to abandon him because he thought we were true soulmates and he couldn't believe I was saying such abusive stuff about him.\n\nThat is called DARVO (defend, attack, reverse victim and offender) and is a technique used by abusers to control the narrative. \n\nYou dodged a bullet by leaving this dude, he was escalating and doubled-down when confronted, which are all terrible signs. I'm sorry you were with him as long as you were, but I'm so proud of you for getting out and realising what a monster he is. \n\nGood on you OP, I hope things keep looking up for you.",
            ">he told me that he'd lost a lot of friends and dating was hard because women tended to cut out pretty quickly, again, in his words, because people are too sensitive and want him to change how he is.\n\nIt doesn't sound to me like anyone was trying to change him. Sounds like they got sick of him and ditched him. Telling him why they are ditching him isn't the same as trying to change him. And, he refuses to acknowledge that he is the common denominator in every situation. He doesn't have to change or be a decent person. But, he certainly shouldn't act angry and shocked that no one wants to be around his toxic behavior. Sounds like he wants to behave badly and still have people accept him. That's not how life works.",
            "Wait....wait... did he just gaslight you saying you were being verbally abusive towards him when it’s the other way around?",
            "You did great , now the key is to never speak to him again , don’t ever give him a venue to speak to you , he needs to hold onto the last things you said to him .",
            "Good for you! You are healthy and mature to recognize and react appropriately to someone running roughshod over your boundaries. Congratulations on being a top tier human being and looking out for yourself. Don't give assholes any leeway. <3",
            "I guess he probably hasn't heard the old saying, adjusted for context \"If you meet a jerk in the morning, you met a jerk. If you met jerks all day, you're the jerk.\"",
            "Good lord is he all about gaslighting and manipulation! That was hard to stomach. You DID NOT abandon him, nor were you abusing him. He was trying to get you to second guess yourself and turn you into the \"bad guy\" - his pattern of behavior speaks for itself. People are leaving his life for a reason (HIS choices and the way he CHOOSES to treat people), and I'm relieved you are now one of those people. I can tell he has made you uncertain of your worth on many occasions, so I just ask/encourage you - please spend some time reminding yourself of how great you are. People like him try to make you feel inadequate to keep you in a place of control - you were right on in your comment about him not wanting to be with a woman who made as much money, thus who has equal power. There are far better people in the world and you are worthy and deserving of a relationship that is loving and supportive. Rooting you on, girl!",
            "OP, you may never read this with so many comments already, but you absolutely did the right thing! I read your original post and this update and got chills, because I could have written these posts almost verbatim several years ago. Unlike you though, I didn't have the guts to leave at that point and that was one of the biggest mistakes I've ever made. \n\nThese are the warning signs of something much more toxic, that can eventually become much more dangerous. It always starts out slow and escalates, because no one would tolerate this kind of behavior early on. You are in no way, shape or form the abusive one here and people who gaslight like your (EX!) bf, are counting on you questioning yourself when they try to turn the tables and call you abusive. Don't fall for it! \n\nGood for you for leaving! Keep him blocked because he'll keep trying! You will be SO MUCH better off without this guy.",
            "He was trying to gaslight you. I'm glad you didn't fall for that.",
            "Wow, my husband and I make decent money and I still use Groupon and look for deals and discounts. There’s nothing wrong with being frugal, no matter how much you make. Actually, I feel like wealthy people are sometimes the “cheapest”. \n\n\nAnyway, he completely turned that around to make you the bad guy and I’m glad you didn’t fall for it. I’m glad this came up before you were stuck on a lease together.",
            "You did not abandon him. \n\nYou were truthful and the truth hurts and pisses people off. But because of your honesty and openness he’s hopefully looking at his behavior a little differently now. And good job blocking him! That was the right move.",
            "Wow you genuinely dodged a bullet. You should be proud of yourself for walking away from that and knowing your self worth. Seems like a person with a lot of mental issues that need to be sorted out. Good riddance.",
            "He said *you're* abusive? Holy projection, Batman!\n\nYou told him he was hurting your feelings and in response, he had the nerve to say that he was disappointed in you. He tried to manipulate you and make you feel bad for having a spine. \"I'm sorry you feel that way\" instead of actually apologizing. Doesn't understand the difference between people trying to change him, and his actions having consequences. Apparently prefers a doormat to an actual person. Not to mention all the verbal, emotional, and psychological abuse that preceded this conversation.\n\nYou did the right thing by breaking up with him. Good riddance. If you can, I highly recommend some therapy to get this guy's toxic BS out of your head.",
            "You dodged a nucular missile. Good on you girl",
            "Good on you bro. You went about the conversation with clarity and kindness. \n\nYou deserve a cupcake.",
            "You did the right thing, hopefully next time it won’t take you as long to realize someone is just not right for you.",
            "Omg. Such bullshit frm him. He is totally aware of being an asshole and no intention of changing for better. Definitely dodge a bullet here.",
            "Woooow all his red flags came out. Glad you managed to dodge a bullet there",
            "Op, beside how good things you've write, you also write them in a beautiful way. I hope you are into writing. Best wishes for your new single life, I hope you will find a beautiful soul like yourself💕",
            "Classic gaslighting technique. Glad you found out this early - it only would have gotten worse. Good luck OP.",
            "Hey op, I just want to chime in that I don't think you being an understanding person is a flaw. It shows that you are a compassionate and caring person. Someone who is worth it will very much appreciate that about you.\n\nAs everyone else said, you did the right thing here. He refused to look at himself and reflect on being a better person, and that's it. You deserve better, and i hope you find someone who loves you for you.",
            "Op, u dodged a bullet.",
            "If what you said was abusive hen by his own logic, he is also abusive. I grew up with a brother like this and it drives you INSANE. I’m SO glad you left this relationship! You will find your happy life one way or another.",
            "You are so well out of this. His behaviour was classically Passive Aggressive. Please google this and read up on it.\n\nI’m so sorry you got involved with someone who’s behaviour was so destructive and dysfunctional. You deserve someone who is able to listen to your feelings and reflect on his behaviour when an issue arises.\n\nA good rule of thumb,I’ve found, is that if my prospective partner blames the breakup solely on the other person, then that is a big red flag.\n\nApart from cases of abuse - which this relationship most definitely would have become had you stayed - mature people recognise it takes two people to make or break a relationship.",
            "I’m not a psychologist, but I’d be willing to bet big money that this guy is a narcissist. Or, at the very least, way far over on the spectrum of narcissistic tendencies. \n\nFuture You will thank yourself for moving on from him.",
            "Woooow!\n\nYou are so much better off that you got out of that situation. He was trying to manipulate you the entire time by somehow playing the victim, mimicking your words, gaslighting you, and shaming you all in the same breathe.\n\nThis guy never had respect for you and is a controlling, abusive, piece of shit. He was trying to get you in a situation where you had no say or self esteem. I'm sure he would eventually try to have you cut off contact with all the people that love you too.\n\nYou dodged a flaming bullet by avoiding moving in together and ending it. Good for you! Don't let anyone make you feel inferior, you are worth respect and love and honesty.",
            "I feel like I need to save this because you gave such a mature, well thought-out response and I’ll prob need to refer to it when I encounter any jerks in my life.\n\nThanks for sharing, sorry you had to go through this but you definitely did the right thing!",
            "It is a super classic abuse tactic to accuse the other person of being abusive while they are pointing out abusive behavior. Imo you have already wasted too much of your emotional energy on this abusive jerk who does not want to change! Cut your losses and enjoy your freedom!",
            "In your first post I thought the commenters calling him abusive were being ridiculous, and overreacting to a situation where your boyfriend probably just didn't realize he was hurting you. After reading this update, all I can say is wow. His abusive colors really came out during this conversation, everything from blaming the victims of his jokes for not accepting 'the way he is' to manipulating and trying to twist the conversation to make you believe you were the bad guy. I'm glad you're now free of this toxic human being, I hope your next relationship is as good as you thought this one could be.",
            "Good on you, OP!  That sounded like the seeds of something awful. Could have been so much worse.",
            "Clearly he is manipulative. You are so much better off without him.  I was married to someone similar for ten years. Biggest regret of my life.  \n\nAnd remember this: in all jest lies half truth.",
            "Wow...well that turned out bad...never expected him to blame YOU lol...i think you might have dated a narcissist...",
            "Glad he didnt get to gashlight you like he tried! You are amazing and did the right thing",
            "You showed amazing strength in this situation and absolutely did the right thing. I am 49. At your age, I never would have had the confidence and strength to do what you did - for yourself. Yes, you will probably miss some things about him. Breakups are hard, but you acted 100% appropriately here.",
            "Wow he totally tried to turn it in you as jerk to the end trying to find a way to hurt you.. \nNot the outcome you hoped for but still over all a good one.  \nYou are incredibly stronge and it's great that your esteem is still good enough that you could make this choice",
            "Good riddance. My cousin is like that as well, especially when he is drinking. He starts sounding off and taking shots at me/other people, but whenever I say something back he gets real angry (there is a lot to choose from with him). The guy sounds like he’s real toxic and no matter what, if something he says makes you feel x or y, then you have a chance to do something about it.",
            "Great job all the way through that conversation!  You have every right to be proud of how you handled that!  And to confirm, you were not abusive in that conversation.  You were kind and showed a lot of caring.  I wish you all the best!",
            "Projection, gaslighting, DARVO (defend argue reverse victim offender)...\n\nCongratulations. You saved yourself from a full blown Narcissist. Fucking yikes man. You dodged a bullet!",
            "Congrats on breaking up with your goldfish.  For real though, that's an impressive lack of intelligence in the most basic sense.  He literally can't understand, on a deep level, that other people are real and have feelings separate from his.  That's something you learn around age 7.  That just because YOU want a Barbie for Xmas, doesn't mean everyone wants one.  So when you're hurt and he's happy, it means you're defective.  Because he's happy, everything is perfect.  When he's hurt by you doing what's best for YOU, it's a crime.  \"I feel yucky!  Call the abuse police! I've been victimized!\" This guy never matured past age 6, throwing a tantrum with bigger words now.",
            "Wow it's good that you stood up for yourself honestly hes in deep denial he will never acknowledge hes in the wrong can't believe he doesn't realize how his actions don't contribute to his lost friendships and relationships hes never going to have a successful relationship at this point but good for you for leaving when you did not everyone can do that",
            "Op, you really seem incredibly sensitive and emotionally intelligent. I really like how thoughtfully you wrote all this out. I understand that you have a complicated career situation because of disability but you would probably make an excellent counselor or therapist. I wish you all the best.",
            "Sounds like you had a good, but difficult conversation and made a good, but difficult decision.  Good for you.  It sounds like your relationship would have eroded your self esteem over time.  Take care.",
            "Wow the nerve of this guys. Good riddance and good for you, you did the right thing and I hope you feel proud of sticking up for yourself because you should. Good job, for real.",
            "I'm glad you broke up with him! He's narsacisstic and gas lighting you! Narsacisstis will NEVER change.",
            "He wants to act like a child and damns anyone who tells him to grow up. Then he attempted to make you the bad guy so he didnt feel bad. What he did in that moment was justify his behaviour. I love you so much for seeing through his bullshit. You are amazing and you deserve better. So does he and I hope this is a wakeup call or he gets one that leads to him growing up.",
            "I'm proud of you for recognizing that he wasnt going to change and walk away, from past experiences that takes a lot",
            "Looks like you dodged a bullet with him. He was gaslighting you. You're better off.",
            "He seems to be displaying certain narcissistic traits tbh. Such as gaslighting, invalidating your feelings, being concerned with status, projecting his bad behaviors onto you etc. I’d look it up.",
            "Empathy is not a flaw! It's perfectly normal for you to give people a chance to prove themselves and to change their behavior.  \n\n\"I'm sorry you feel that way.\" Is a textbook misdirection. You have every right to feel however you want to. He needs to take responsibility for his actions. You've taken responsibility for yours. Now go out and live your life! Do take some time to really absorb what happened and keep it in mind for the next relationship. It's really easy to fall back into the same cycle. \n\nCongrats on being so brave!",
            "You have the patience of a saint! I wouldn't have spent so much time trying to make him reflect on his behavior. He needs to be dumped a few more times until he starts realizing the problem is not with others. If he ever does get it. Some people stay oblivious forever",
            "You sound like you've just very narrowly escaped a narcissist. You've been abused and when you stood up for yourself in the most gentle way possible, you were gaslit. Everything others in this thread are telling you about this guy and what he did to you are true.",
            "I’m really sorry you’ve had to go through this and also glad that you realized you had to get out.\n\nI really find it bizarre when someone is in a mindset of blaming everyone else.  I thought for sure it would hit him when he said he’s lost a lot of friends and girlfriends.  At some point, one needs to look around and realize, shit, I’m the asshole.\n\nMaybe one day he will realize the error of his ways, but who knows.",
            "You're a good person, OP. It's really easy to see from how you tried to be understanding in the face of his abuse, to how much worry it caused you when he tried to turn everything around on you. \n\nI've been right where you are with my ex. Some people genuinely can't see beyond themselves, and have no desire to change for the better. Don't do what I did - beating yourself up for the shortcomings in others helps no one.\n\nKeep being your kind, understanding self. Don't let anyone make you think less of yourself for how you do you. Don't set yourself on fire to keep others warm.",
            "This conversation reads exactly like conversations with my abusive ex-husband. It makes me so sad thinking about the women who are going to be emotionally worn down and have their self esteem weathered away by these men in the future  :(  But we were lucky to get out. Now you can start healing all the parts he was breaking in you.",
            "That was definitely some gaslighting. Fuck that guy.",
            "Wow. That dude is a narcissist. He also used DARVO and then with the icing on the cake, he made a non-apology. What a piece of work!! \n\n(DARVO - deny + attack, reverse victim + offender)",
            "I legit read close to 70% of this post but ultimately my Adult ADD took over. Good for you though. He will continue to learn his lesson the hardway. I wonder if he has been abandoned by family members?",
            "\"You have a tendency to make jokes that are really hurtful, could you please stop?\"  \n\n\n\"OMG HOW CAN YOU BE SO ABUSIVE!?\"  \n\n\nWhat a whiny, man-baby. Congrats though! You're now the latest on the long list of people who \"abandoned\" him for being a jerk.  \nHe won't make it far in life if he can't take any criticism, and unless he's the boss's son I can guarantee you it'll eventually effect how much money he makes.",
            "That's the proof that you deserve so much better than that, you'll find it, don't worry, sounds like you're a good person to me.",
            "People Apology language are different, some people thinks just saying Sorry will fix the problem, some people thinks giving a gift after they have wronged u will fix the problem, Some people will show you some act of service, that's their way of saying they are sorry while some will hold responsibilities. It all depends on the person.\n\nNo one can actually change anyone, they can only adjust with you and that is if they truly want to. It's good stood up since you can't cope with him again. They use to say, a Broken Relationship is better than a Broken Marriage.",
            ">it'll be someone who lacks any self esteem and he'll make her feel even worse about herself until she breaks down. \n\nHe wants someone he can control and feel power over. That's why he is the way he is. He's not interested in changing, and I feel so sorry for whoever he ends up with next. Glad you got out of there with your self respect intact!!",
            "Between him wanting people to just deal with him being an asshole and him calling you abusive when really he’s been the verbally abusive one throughout your relationship it’s clear that he’s just your classic emotionally abusive narcissist. Good on you for getting out of that toxic relationship.",
            "YIKES \n\nYou really dodged a bullet there, good on you for ending it.",
            "Guy literally understands that everybody leaves him for the same reason, still doesn't get that it's him who is the problem. Like if you want to not change being an arsehole, you can't then complain if people don't want to hang out with you.",
            "Honestly, it sounds like you had a lucky escape. Congrats on NOT being another poster on here who has gone through with moving in together & swallowed this stuff for years until it HAS worn them down.\n\nI have invisible disabilities too, featuring fatigue and a lot of chronic pain, I've also seen that as I age and have less energy to \"cope\", my previously  undiagnosed autism symptoms are finally raising their heads to the point they're impacting me too. The last thing we need is people undermining our self worth.\n\nIt's so hard to have the self respect you have shown here when sometimes it can feel like the whole world is side eyeing you and ...like seriously, how badass are you? I hope you never lose your fantastic grip on where healthy boundaries are because it sounds like you handled this like a BOSS. Maximum respect and I hope the sadness fades fast because you're clearly so much classier than your ex.",
            "He will continue to avoid self-knowing and self-awareness, so he can keep blaming others for his failed relationships (and friendships, apparently) and miserable existence. Maybe one day he'll get his head out of his arse, but in the meantime, good on you for knowing yourself and your needs so well. A relationship with people like him usually never leads anywhere good or long-term.",
            "You said all the right things, you conveyed both how you were hurt as well as your interest in helping him grow as a person. He simply refused to hear it, became defensive, and construed your honesty as “abuse.” \n\nThis is a common approach for people who don’t want to change, and specifically, who don’t want to give up on being dominant over others.\n\nYou will, without doubt, find someone who can match you. I can tell because you have such clarity in your heart.\n\nBe well!",
            "Your strength in this situation is inspiring!",
            "That's so unfortunate :( I hope you're Ok, but also after reading that I think it may be for the best, hopefully you can live your life happier now knowing you don't have to worry about him, wishing you the best and I hope you find someone who actually deserves you instead xx",
            "When you think everyone else has the problem, you’re the problem. That’s one life lesson your ex never learned op. Glad you got out of the situation OP.",
            "It's okay, as someone who use to make fun of my wife about certain things when we were younger, I eventually realized the reason I was doing it was to vent my frustrations on an easy target, and over time the jokes stopped and now after more than a decade, my jokes are just playful in nature and are no longer mean spirited b/c I understood how important my wife is to me (I didn't insult her like that this whole time btw, just the first couple years, then it stopped). So if he didn't see that, and started blaming his partner for being abusive, then you did the right thing. \n\nLife is hard enough. So you always need to be around positive people to survive.",
            "Your boyfriend was an abusive narcissist. You are one of a long line of people that have left his life because they are sick of his shit, and rightly so. You deserve better and now you can get it, even if that is being alone.  You did the right thing, you got this.",
            "Please please please add more paragraph breaks!",
            "I’m proud of you for getting out of that situation, OP. As someone who has been in your shoes, with a verbally and emotionally abusive partner, I know it isn’t always easy to walk away. But you will be so much happier because you did. And I promise you, someone who fully respects you and your feelings will come along. There is no reason you should ever feel like you need to settle for someone who constantly belittles you or tries to make everything seem like your fault or that you are not valid. Your feelings are valid!",
            "Were you dating my brother?",
            "That's such standard gaslighting, it made my skin crawl just to read it. I'm glad you stood your ground, and blocking him was the exact right thing to do when he tried to drag you into an argument about whether or not you were being abusive. Good for you for trying to have a real conversation with him, because it sounds like you had a lot more patience and understanding than I would have had. It sounds like a breakup needed to happen, so I'm glad you can at least walk away knowing you gave him a chance to improve.",
            "Holy shit I’m so glad you’re out of this relationship. What a manipulative and egotistical piece of shit.",
            "He’s in deep denial, turning it around and calling YOU the abusive one! Telling him to stop saying cruel things is not “trying to change him,” it is asking him to behave in kinder ways. You asked him to make better and kinder choices, not to alter a fundamental aspect of his being for you.\n\nYou dodged a bullet.",
            "I really admire that you even took the time to explain to him why the situation was not okay, and even approached it from different angles to help him break it down and understand it, but it doesn’t seem like he was willing to hear you out or admit his faults. That’s not a reflection of you, and you’re right, you DO deserve better. You seem really great, I hope you find that something better soon!",
            "You handled that super well. You deserve someone who makes you feel good and listens to you. I’m glad you were able to get out of that relationship",
            "I join everyone in saying how sorry I am that you’re hurting now, but you clearly dodged a bullet, and got your life back.  His behavior is a textbook case of emotional violence, manipulation and gaslighting.  Think of what  nightmare this guy would be with the millions of issues that come with marriage and parenting children or having pets if this is the (frankly, delusional) way he responds to being gently called out on his bullshit. Keep walking forward and don’t look back.",
            "Sociopath! Look it up... Because that is who you are dealing with. \n\nUnfortunately, no matter what you say, they will not get it. It will always be turned around on you. \n\nRun. Run fast. If you love yourself, RUN!",
            "Uhh he sounds like hes mentally not all there... he just takes what you said and says if back to you. I feel like hes thinks like that one saying kids would say...  \"I'm made of rubber and and you're made of glue, so whatever you say bounces off me and sticks to you\" \n\nI'm glad you left, he sounds crazy.",
            "Hes gaslighting you..I'm sorry.\n\nA partner who truly cared and valued your feelings would be sorry they hurt them and not want to do it again. \n\nMy ex used to do the same sort of deflection flipping the script thing when I brought up how something he was doing was hurting my feelings. I'm so so sorry you're going through this, it's so painful.\n\nHonestly, men like this just really cannot take accountability or responsibility for the way their behavior impacts their partners. I wouldn't expect him to change, especially since hes flat out saying he wont. Even the guys like this who say they will change rarely do...\n\nSo I think you have to ask yourself, do you think these sorts of jokes and the little bit of jealousy/resentment he has towards you is something you can tolerate potentially for the rest of your life ? Do you think you can get him to understand where you're coming from and stop?",
            "Honestly I'm really proud of OP for being strong and seeing that she deserved better. You deserve someone who makes you feel like your income isn't something to be ashamed of or belittled, and you don't deserve to live with someone who would be controlling like that. He sounds like he had a lot of narcissistic tendencies, especially when he turned the abuse accusation towards you instead when what you said was more than reasonable. You'll find someone who appreciates you for you and doesn't care about your income. People like that exist! Keep your head up, OP. You did a strong thing and you'll find someone who treats you better.",
            "I got stressed out just reading this because it reminded me of past relationships that were similar. I can see some of his perspective because growing up my family picked on each other as a form of affection and I kind of internalized that but the difference is when that’s the issue and you’re confronted, you feel bad and (usually) can acknowledge that it wasn’t okay and try to be more self aware. If you actually care about other people have just have unhealthy habits in relationships eventually you can look at yourself and say if a couple have said this to me then maybe I need to do some soul searching and try to understand why I do this and how to adjust because it’s not anyone’s responsibility to accept my flaws if they are hurtful and unhealthy. There is the alternative where the person knows enough about manipulation and tries to turn it around on you, as I had a physically and mentally abusive ex tell me that there was something that made men act a certain way towards me. Unfortunately this guy sounds like one of those and doesn’t seem like he will change.  Even if he can change, you are under no obligation to stick around and *help* him, he’s got to accept that whether he means it or not he hurts the people around him and then do the work himself, no one else can do that and it’s an excuse to keep someone in a bad situation to act as though you aren’t supporting them enough and excuse their behavior... you did the right thing and handled it better than most.",
            "There is a great book called “Why Does He Do That?” that another commenter mentioned, I cannot even begin to explain how it helped me realize what I had gone through was abuse, abusers aren’t all just terrible people even though they may be terrible to you so it’s not uncommon to question yourself in these situations, and it also shows situations where abusers (and the author clarifies this could be male or female despite the title btw!!) claim they don’t realize their behavior but in reality they know it’s affective and use it to get the results they want.",
            "I haven't read other comments, so maybe this had already been said, but I wanted to give you a perspective on why he was calling you abusive that may help.  When you call someone out on a behavior they have that is hurtful towards others, what you are doing is trying to create a sense of empathy within them, so that they can see their behaviour from the side of the victim and draw that connection.  This isn't news to you, I'm sure, but what is sometimes more difficult to appreciate is that we do this because we are projecting the expectation of empathy that we ourselves would have if the situation we're reversed.  It's great if this conversation works out and he has that side realization, but you hit the nail on the head by asking if others had pointed out this behavior to him, to which he confirmed.  This means that he's incapable of processing emotional empathy for the suffering of others.  This is not uncommon, believe it or not.  Humans have a wide variety of mental perspectives, and our flaw is that we run around thinking everyone thinks just like we do, but not everyone does. We recognize psychopaths and sociopaths because they are so obvious, but in the same respect as why those mental perspectives are possible, so it's everything in between.  Some people's ability to emotionally empathise with other's is limited to people they know and care about, while they cannot emotionally empathise with the suffering of strangers, and others have no emotional empathy for others whatsoever and process empathy in term of themselves being the victim.  He clearly is in the second camp.  Not to get political, but correlations have been made with these groups of people and leaning right wing, which over the last few decades has almost seemed to pander to this type of person, which could infer that there are enough of them out there to warrant political pandering.\n\nAnyway, the long story short of this is to say that you may find solace in the fact that while he is indeed a jerk, and I'm sure you connected in ways that will make it difficult for you to move on emotionally, that the reason this didn't work out for you is not a result of your financial position or disability, it's because you got stuck with someone of the wrong brain type.  There are people out there who do not think this way, you just have to keep searching, and believe it or not this example will help you find that person in the end, because now you know what to watch out for.",
            "(Not dissing OP at all) I'll never understand how women who are so introspective and caring end up with guys like this. It's why I sometimes understand where nice guys and incels are coming from. Like, he had to be super handsome or charismatic or something for you to ignore his bad tendencies to the point of being about to move in with him right? *Shrugs* I guess I'm just glad you said looking back you could see the signs as opposed to \"he just changed one day\" or \"it came out of nowhere\" like women say 75% of the time to, I suspect, make themselves feel better about the ignorance.",
            "This guy sounds like a moron with no self-awareness. Good riddance",
            "I’m super, SUPER SUPER proud of you! You handled this SO WELL and maturely, despite how hard it is to think of ending a relationship and/or recognizing someone who’s supposed to love and respect you is mistreating you. As I read the original post and this update, I kept stopping and thinking, damn she’s hitting the nail RIGHT on the head with this guy, about him switching the subjects, being disrespectful, not at all actually admitting his fault in any of this or even focussing on how you feel (EVER.) Tbh, from an outsiders prospective, he seems like he was babied and is super in his own head, wanting to be accepted but not being able to cope with personal responsibility is a big bad character flaw imo. He wasn’t even seeming to want to hear you out, immediately shutting you down or misdirecting the convo when you were bringing up your problems with the relationship or even your problems with his attitude in general. I think you did the absolute right thing!",
            "I have nothing but the utmost respect for how you handled this situation. I genuinely cannot imagine how it could have been handled better. I'm so sorry you lost what had seemed like a promising relationship, but I'm glad you gained the experience of having a strong moment like this.",
            "This guy is a \" taker \" he  likes to take your self esteem amoung other horrible personality flaws. Bottom line he's a taker. Find a nice, decent person who treats people kindly and respect when no one is looking...\n\nKeep it simple and give to the givers. Ditch the takers.\n:-)",
            "Sounds like a textbook narcissist.",
            "yea this is how he'll frame it to others, that you were abusive.  he'll get sympathy from the next girl until she sees his true self also.",
            "honestly, it seems like he just wants a doormat\n\ngood on you for not being his",
            "Proud of you. You’re my inspiration.",
            "Bullet dodged! Congrats!",
            "That's very unfortunate  but sounds like you did what's best for you in this  situation!",
            "I have nothing new to contribute; I'm a person with an invisible disability. Your situation is sadly not a rare one. I'm just glad you left before he was able to move in with you. He is the one with abusive tendencies, what he's doing is classic gaslighting. His talk about exes seals the deal for me. \n\nI'm so sorry, OP. It may hurt now, but even from the way you type, I can tell you're a reasonable and even person. It's okay to feel shame and panic, but as a person who has also been through this kind of toxicity with abled partners, you really do deserve better, and you have a lot to contribute to this world.",
            "Great job standing your ground! His behavior was absolutely inappropriate and hurtful, and it sounds like you explained your side very rationally and thoughtfully. Like really, it seems like you handled this difficult conversation really well. I hope you can find a more compassionate person who understands your situation better! ❤️",
            "Yo you dodged the biggest bullet\n\n\nBut also like very few people can do what you did. You are very strong.",
            "It sounds like your bf could potentially suffer from a personality disorder (borderline or even psychopathy: one of the symptoms is that they’ll often try to project whatever it is that they’re doing wrong, onto the other). I don’t want to jump to conclusions, but I will say that I think you’re handling it as best as you can!",
            "Man, what a *prince*. \n\nI wish there were \"self-awareness\" pills people could take. That would solve quite a few problems.",
            "Yup. He doesn’t care that how he is hurts other people....the cherry on top was him apologizing for YOUR feelings, framing your feelings as the problem instead of his actions.\n\nOn top of everything else here, whenever a guy pulls a “you’re not like *other* girls”, it’s a red flag. It puts you on a pedestal you can’t live up to and when you fall from that pedestal he gets to throw in your face that you ARE just like them and that’s bad and something you should be ashamed of...\n\nI’m glad you were able to recognize what was happening and were in a place to leave the relationship, and that you didn’t move in with him!",
            "Just like my ex, they do stupid shit and put the blame on you and don't take care responsibilities for their actions, but deep down they know it's their fault they just don't want to admit it, breaking up is the best solution.",
            "Did you break up with this guy over Reddit advice? To be honest, he doesn't sound all *that* bad. As a fellow jokester, I understand the phrase \"you know I'm totally kidding, right?\". He probably has some comedic defense mechanism. I joke around as if I'm a douchebag as well. Doing it with things like money, looks, religion, etc. Is taking it a little far, but for example, I call my friends nerds and losers a lot, and they know I'm just kidding around. I don't see that as a huge deal either. Once somebody knows you're just joking, they know you're just acting like a douchebag because that's what people ACTUALLY act like. It's satire. You're pointing out how ridiculous some people are. If you told him not to joke about money, and he still does it, that is a problem, but I'm not sure why you guys broke up over it. It sounds like you had a serious talk, and you ended it with him because his response wasn't 100% what you expected, maybe because Reddit had their pitchforks out, but these people don't know him and they don't know you. Sounded like he was honestly trying to understand. In your initial post, when he said \"you know I'm just kidding, right?\", I wouldn't take that as a dig at all, he was pointing out how douche some other people are for a laugh. Once you tell him THAT subject makes you uncomfortable, you're right, he should stop on the serious topics, but it sounded like you didn't even give him a chance to stop, you got so upset in the initial discussion that led to a full-on break up. I don't know him, or you, but it sounded like he didn't get the chance to change. To me, I sounds like he was obviously joking. Jokes don't convert well to text, so a Redditor reads that and thinks OMG, HE'S SO MEAN! But, I read it and thought \"you know I'm just joking,right?\", I really understand that phrase, because I've said it so much. When my GF and I started dating, we had a similar talk, but ours was more \"make sure STRANGERS know you're joking, before saying douchey thinks for a laugh\", so now I make sure I get to know someone, they get my vibe, before I start saying douchey things for a laugh. In my opinion, it really just sounds like satire. I'm not going to comment on the \"you're abusive\" stuff, that doesn't sound right, but people also say crazy things when they're upset. Sounds like he really cares about you, but I don't know him either.",
            "I’m so very sorry you dealt with that but so glad you got out! I had a sociopath ex JUST like that and he gaslit me the same way. You deserve so much better!",
            "He demands you accept him for who he is, but he won't accept you for who you are, as demonstrated by his persistent digs.\n\nHe's a tool. Either he'll learn, or he'll keep losing.",
            "Good riddance to bad rubbish",
            "he was deflecting blame rather than take responsibilities for his own actions.  But a credit to his stubborness, he won't change.. and it's not your job to change him either.  So glad to cut the cord with him\n\nHe likely has abandonment issues given his more advanced nature of trying to be \"accepted\" for how his is which is a total cop out for bad behaviour.  Consider yourself fortunate not to continue enduring his bs",
            "God....this sounds way too familiar.  I'm sorry that this has happened to you but just try to deflect any thoughts of blaming yourself for anything you know you weren't responsible for. I'm glad you're pursuing a better life which will naturally lead to a happier life. I wish you the best hun! We're all rooting for your future without that manipulative, insecure, ass crack",
            "HE IS A NARCISSIST. I’m so glad you left.",
            "Good for you. He needs to grow up",
            "You really handled this beautifully, I’m really proud of you.",
            "Sounds like he's a serious narcissist.",
            "*you need to understand that you did so much more than a lot of people would.  You sat down and addessed just what was causing you to loose connection with him.  Please dont feel bad for removing youself from what was a uncomfortable place to be.  Because he's aware that he has lost friends, dates and now you due to his dickness, and doesnt mind and will even make attempts to deflect the issue back to you, says that there is more going on then you bargained for and you being the well grounded, real person you are ought to be thankful you got away when you did.  The nacissistic personallity traits are glaring in the overall picture you painted.  I wont say hes a full blown bonafide narcissist,  but at the very least it would seem he is lacking empathy and the ability to recognize whats too much and whats too far.  The fact that those things alone dont seem to bother him indicates hes well on his way.  Realize too,  that had you remained and your relationship progressed, you would have become his number one target.  Through that process,  your life would have been altered in some really sad and terrible ways.  Thank yourself, for being who you are.  You saved you!*",
            "He hasn’t realized yet that when everybody has problems with him. The problem isn’t them, it’s him.",
            ">he thought I would be different\n\nManipulation 101\n\nI’m glad it didn’t work on you!",
            "He was gas-lighting you. Imagine the backwards world he wanted you to live in where you telling him to stop saying hurtful things is abusing him. \n\nI'm so proud of you for standing your ground!",
            "[deleted]",
            "My mom always told me to always make your money even in marriage, because some guys can really test you if they are the only breadwinners. You can be married but he will use that as an opportunity to do things just because he can. Count your losses and start to heal yourself. I pray you find someone who can respect you alot more than your ex.",
            "I actually sympathised with this guy for a little bit, until the obvious gas lighting.\n\nI used to be similar to him, I would make jokes that hurt people because I thought it was funny and resented people who tried to change me. \n\nThe whole changing thing in my life was in terms of gaming though, I hated girlfriends who tried to stop me enjoying what I love.\n\nI digress, the main issue he faces is taking responsibility for the things he says and does, a main component of this is empathy. I had to work on my lack of empathy and it's clear this guy needs to aswell. I sincerely hope he understands this at some point, although he is significantly older than me when I realised I had to change my behaviour.\n\nI'm glad you got away OP, he needs to work on himself and you need to get away from the toxicity.",
            "Unless he was using it as a way to try and guilt you at least he realized that he has a problem. But good on you for standing up for yourself and getting out while you could.",
            "You ex is an awful boyfriend and I think you're incredibly mature and level-headed about the way you handling things with him.\n\nI'm curious about your disability situation. You said that you won't work a full time job because it will stop the disability money from coming in. So as a result you work part time. If you are able to work full time, you should. I feel like it's dishonorable to work less just so you can receive a government handout you don't need. Working full time could give you so much more money than any part-time job. Or is there something about your disability that prevents you from working full time consistently? If that's the case than ignore everything I said.",
            "If I was him, and I truly wanted to be in an equal relationship with you. The next step after the talk would be to open a joint account and have both of your incomes directly deposited into it. That should prove that he's really joking and doesn't care about the income difference, no? (And obv stop joking about it because it's not really that funny)\n\nBut I am interested in what everyone thinks is fair. Let's fast forward and assume things worked out. If he had done what I stated and it came time for marriage. Would a prenuptial with a pre planned division of assets be fair? Assuming Party A made $300k per year and Party B made $40k per year. And the prenuptial said \"party B will get $50k per year of marriage or $750k, whichever is less, in case of divorce.\" Would that be fair? OP, would something like this be acceptable to you in the future if it did workout?",
            "[deleted]",
            "For me it's simple and I want to say little about this situation.   \n\n\nThe guy as I think don't know what love is. He just wanted girl with him but finally don't ready for it because it's not about only have girl near. It's about love each other, make decisions together and appreciates each other. The verbs sometimes more painful than actions. In this case guy did it with jokes. And why? If you want live with this girl why you make him weak? Agree with me it's not about true love, yes?"
        ]
    },
    {
        "post_id": "6pgxrs",
        "author": "Alwayswantedabeard",
        "title": "[UPDATE] I [25ftm] am about to come out to my parents [46m&49f] as transgender and I'm kinda freaking out.",
        "url": "https://www.reddit.com/r/relationships/comments/6pgxrs/update_i_25ftm_am_about_to_come_out_to_my_parents/",
        "score": 5294,
        "num_comments": 295,
        "created_utc": 1500997170.0,
        "selftext": "\n\n\n[Link to original post](https://www.reddit.com/r/relationships/comments/6nvhp4/i_25ftm_am_about_to_come_out_to_my_parents_46m49f/)\n\n\nHey Reddit, \n\nMy OP didn't get much of a response, but I appreciate those who offered support/advice and wanted to give an update in case anyone was wondering. \n\n\nOriginally, my weekend got a little more busy than I had planned, so I decided to move my coming out day until Tuesday. \n\nSo, on Sunday, I called my mom to set up dinner (if I hadn't, I knew I would back out and not tell them) and my mom was feeling impatient I guess, because she was just like \"let's talk about it now\" and put me on speaker phone with my dad right next to her. \n\n\nSo, I told them. And it went great. The first thing anyone said was when my dad immediately asked \"is that why you've been so damn weird the last three weeks?!\" Lol. Followed up immediately by a dad joke. \n\nWe are all going to talk to my little brother about it (probably today my sister, partner, and I are all still going for dinner.) And I asked my parents to pick out a new middle name for me (I've decided to stick with my given first name, it's androgynous). My dad's immediate response was \"Alwayswantedabeard Man Lastname\"\n\nSo I decided to let my mom have the final say in my middle name lol. \n\nI also set up an appointment to start hormone therapy in two weeks (and my insurance covers it!) So I'm pretty stoked about that. \n\nI hope you guys all have a great week!\n\n\nTl;Dr parents give no fucks, I feel like I just had 600 pounds lifted from my shoulders, I'm starting testosterone in a couple weeks!\n\n\n**Edit: to everyone PMing or leaving comments calling me a \"sick fuck\" or any other derogatory term, I hope you realize one day how hurtful and wrong you have been. Especially if you ever have kids that end up struggling the way I did.**\n\n\n**And to those of you (the vast majority in this post) who have been supportive and excited for me, I appreciate every single one of you, as well as your comments. Thank you.**\n\n**Edit 2: my first gold ever, thanks guys. You've been overwhelmingly supportive. Thank you all. You're wonderful humans.**",
        "permalink": "/r/relationships/comments/6pgxrs/update_i_25ftm_am_about_to_come_out_to_my_parents/",
        "comments": [
            "I think it's very sweet and thoughtful of you to include them in the process by offering them the chance to give you your middle name. I *absolutely understand* that is not an option for most people who are transitioning, but you seem to have a good relationship with your parents and you suggested it yourself, so I think it's really cool. You get to keep your autonomy and do what makes you thrive, but also let them know that they're an important part of your life and identity. Or at least that's what I get from it.\n\nCongratulations! :)",
            ">Edit: to everyone PMing or leaving comments calling me a \"sick fuck\" or any other derogatory term, I hope you realize one day how hurtful and wrong you have been. Especially if you ever have kids that end up struggling the way I did.\n\nTake a screen shot and send it to us. We want to know who they are. ",
            "my day was made while in the gym locker room I overheard a lady saying hey to a friend she hadnt seen in awhile lady asked \"how's your daughter\" and the friend replied \"my daughter is now my son\" in an enthusiastic and nonchalant way-- like matter of fact and it's all groovy and I felt so happy for that human child who would never know of the exchange but that his mom was so supportive and upfront even in \"private\" company",
            "Yay! Glad it went well! My parents were similarly jokey when I came out to them. It was a relief, but I was also a little mad, because it had SUCH BUILD-UP in my head that their reaction felt anti-climactic. (My mom said \"Oh, I thought so.\" But then whyyyy did you never talk to me about it? So many years of agonizing, lol.)",
            "[deleted]",
            "Awesome stuff, OP! Congratulations on your 600 lb weight loss!",
            "Glad it went well. Your dad's hilarious.",
            "Congrats! Also, I think it is very nice to let your parents (mom, lol) pick out your new middle name. One of the hardest things for me wasn't the name change but that I had no say in it. The name I originally picked was a gift (that didn't fit, and I am ok with that), but I didn't get to help pick a new one.",
            "Sorry to hear that people have been messaging you nasty things, I think you're very brave and I'm glad your parents are supportive. ",
            "I think it's so fantastic that you're allowing your family to help with the name.  I just do not know how I would feel if my kid decided they needed a new name, and like, I was stuck with whatever they picked. I get that THEY are stuck with what parents name them, but I feel that I would want some input. So from a Mama, it makes my heart so happy that you feel better, and you are living your best life, but that your folks get some input in your name.",
            "Welcome to manhood! \n\n\nSeriously dude congratulations and its awesome your folks were so supportive of you!\n",
            "I'm sooooo happy for you! My sister (mtf) is transitioned and came out at around 30 years old. I had never actually seen her happy until she finally started hormones and therapy. She would always tell me how much it means to her that my mom and I were so supportive of her which to us was a given, we just want her to be happy and herself. When she changed her name she asked if I would mind if she shared my middle name and I was happy to agree not that she needed my permission. We got our middle name from our late grandma. Our dad didn't have the same reaction not that we were suprised. He told my sister he didn't have a son and that I was his only daughter, but now whines and crys and uses the proper pronouns now that my sister moved away and doesn't talk to him anymore. Anyways. I just wanted to cheer you on and say I'm happy for you!",
            "Oh, that is great! Just great. I am so happy for you and the weight lifted from your shoulders! \nYour familly sounds amazing, specially your dad! \nThank you for updating us! Best wishes",
            "You are brave, and you are loved.",
            "That's just wonderful. Very happy for you!",
            "Fuck yeah dude! Always good to hear it went well. ",
            "Glad it went well for you.  Sorry for any hate messages.  I hope to be as good a parent.",
            "That's great. Sounds like you have lovely supportive parents.",
            "It takes a lot of guts to do something like that, glad it went well.",
            "nice! glad your parents were very welcoming and supportive.\n\ni have a serious question because i'm still not entirely sure how the pronouns and sexuality wording goes. this isn't exactly something they teach in school you know. now that you're out as transgender, does that still make a lesbian? or is there another term for it now or is offensive to call you straight? i'm genuinely interested in knowing the proper vernacular to use.",
            "> I feel like I just had 600 pounds lifted from my shoulders, I'm starting testosterone in a couple weeks!\n\nSoon you'll be lifting 600 pounds with your shoulders (well, maybe not quite that much)! Congrats.",
            "\"(and my insurance covers it!)\" \n\nThat is a damn good day. \n\nSounds like you hit the family jackpot! Congrats on the star aligning for a supportive transition. \n\nAs far as your transition itself, I give you this: \"okay.\" \n\nBecause when it comes down to it, all the good, bad, easy, and hard, the most important thing to remember is, being \"this\" or being \"that\" isn't the worst/best/what-have-you, it's that wherever you are in whatever moment you're in, everything is, was, and will be Okay. ",
            "Your family's existence makes the world a better place.",
            "That's really great! I didn't see your OP, but I'm glad to hear the conversation went well.",
            "I didn't see your original post, but I'm glad to read this update. I'm so happy for you, OP! Good luck on your journey!",
            "Yay!! I am so glad that this turned out the way it did for you. Too often we see stories that have the total opposite outcome. I wish you the very best during your transition. ",
            "Congrats! And as a mom, I wanted to commend your decision to include them in renaming you, I bet being included like that will be so helpful for them in the transition! Good luck!",
            "Don't know if this will just get buried but I felt it worth saying congratulations and I'm so excited for you, it's so lovely to hear a good story regarding this kind of thing! As for the degenerates who send you frightful messages don't give them time of day, bloody pigs.\n\nCongratulations again!",
            "Just wanted to say that for every person that writes you a shitty comment there's also other people on the other side of a computer somewhere in the world (in this case Australia) who read what you wrote and is smiling for you. \n\nBig hugs mate, I'm glad your parents are so on board. \n",
            "Hey there, I just wanted to say that I'm sorry that human beings exist that would send you such terrible comments. I don't know you at all but you should be proud of taking such a gigantic step forward in life and even without knowing you I can be happy for you and that your parents were accepting of who you are. More and more these days I'm so incredibly disappointed with my fellow human beings that are able to be so incredibly vile to each other without thinking twice about it and I just wanted to pop in an offer a stranger's complete and total support and happiness for you and your family. Your post brightened my day. Cheers. ",
            "OP I bet it is such a huge relief. I'm proud of you for being so strong and brave. I know it isn't easy to discuss such issues due to fear but you did it! And look at the awesome parents you have :) ! May your move forward as a transperson be a postive experience. ",
            "Bless you, young man.",
            "Dude your freaking folks rock. I hope that if that conversation is one that one of my children need/have/want to have with me that my reaction is as cool as your dad's, and the more I read about situations like yours the more I learn as to what a proper and acceptable response is.",
            "Congratulations!!! Your post made me all happy and smiling on the bus home. I'm so glad your parents are supportive. Big hugs (if you want) from this internet stranger! ",
            "So glad your parents are supportive!!!!  yay!!! \n\nCan we suggest middle names? ",
            "Great job! I have things I need to discuss with my parents and I can only hope to have the courage you do",
            "Wow! Picking a new middle name for you?! I've never heard that happening before. That must be so special for them, all jokes aside. That kinda makes it apart of them too. I love this.",
            "Coming late to this. I'm the mother of a trans child and just wanted to say I'm so happy for you and glad your family is supportive and that you have such a good support network. ❤️",
            "Your first edit reminds me that whilst there are people in this world that seek to hurt the things they don't understand, there are also people like you, often persecuted and treated poorly, that show far more compassion and understanding for their persecutors then they deserve. You don't speak of hate or pain for those judging you, only understanding. You act in a way that shows compassion and understanding and it is beautiful. It speaks strongly of your character and you should be proud of every part of who you are. Thankyou for being a kindhearted global citizen.",
            "I have no idea why the fuck someone would call you 'sick fuck' or any other derogatory term. Your time is quality, and they don't deserve any of that.\n\nI am so happy for you and for the support you're receiving from your parents. This is amazing, you are very lucky and strong at the same time :) I wish you all the best :)",
            "[removed]",
            "I am so happy for you!  Your parents sound like lovely people.",
            "You know you're ok when the first reply is a dad joke. Glad it went well. \n\nThat said. Dad had the right middle name ;)",
            "Awesome! And the people calling you sick fuck are just jealous they don't have your courage to do what you did!",
            "Didn't see the original but I love the update and your parents sound great. Really pleased for you and good luck with the hormone therapy!",
            "Such a sweet update. You are very lucky to have your parents, and they are lucky to have you. All the best, OP.",
            "Glad they were really accepting, even your dad tried making jokes to probably take a lot of stress off of you. Congrats and I hope the hormone treatment goes well!",
            "For some reason I don't think I can let my dad meet yours. It would be just an apocalypse.\n\nMost importantly, congratulations!",
            "It always warms my heart hearing a story like this.\n\nI'm so happy for you, and I wish only the best for you!\nFuck all those people calling you crude things, don't ever let them take your happiness and light away!",
            "I'm so happy for you!!!! ",
            "That's wonderful news.  I am glad it went so well.  You have awesome parents.",
            "I love the idea of your parents picking out your middle name. And so  happy it went over well. You deserve all the love in the world!",
            "Hey Welcome to Testi-meds club, have you decided which method of \"application\" you want to go with, the gels can get annoying sometimes because you have to take a shower before intimate times and you have to wait for it to dry, the injections are an option but some people cant do needles, or has your insurance made the decision for you, if not i would recommend trying the gels first, if you have any questions about side effects or other med stuff PM me.",
            "I'm glad it went great! I came out to my family 5 years ago, sorry I didn't see the original. The first person i told was my sister, and we had even planned for me to go stay at her place if i felt my parents needed the space (my therapist recommended it, just to have a plan B as safety), but everything was fine. Afterwards, actually, my sister kind of cringed/shrugged and said \"..we kind of all already knew?\" Oh. Well alright then.",
            "Oh, I'm so happy for you! Nice touch on letting them give you a new name. My 12 yo plans on transitioning and thankfully let me veto her (sticking with female pronouns for now) new name. She's going with the boy name I picked out when she was in utero. It stupidly means a lot to me. I would, of course, go with her wishes and was pretty delicate breaching the topic.",
            "Your parents are good. You have good parents.",
            "accepting and supportive parents are the best",
            "YAY! I'm so happy and glad that your parents are being supportive and wanting to be there for you. Internet hugs <3 <3 ",
            "Yay!!! I'm so happy that this went well for you!",
            "That is fantastic; I'm glad your family's got you!!!",
            "Congratulations to you! You are lucky to have such good support. Hope you can find the time to help out others that may be less fortunate. Good luck!",
            "I just wanted to say congratulations and I am so happy that it went splendidly. And for those calling names: you should be ashamed of yourselves. ",
            "How wonderful! Congratulations, dude!\n\nAlso thanks for posting this and bringing back a little of my faith in humanity.",
            "I just breathed a literal sigh of relief. I'm so happy about your family's reaction. Congratulations!!!",
            "That is AWESOME! Congrats ",
            "So happy for you this was the outcome!! I can't imagine how hard it must be to tell your family something like that. Good for you for getting it out there. \n\nAs for people saying hateful things to you, fuck them. There is NOTHING wrong with you. Live your life the way YOU want to and be who you are and screw anyone who doesn't support you. Big internet hugs!",
            "Congratulations! I can't imagine how relieving it must feel to have that weight lifted off your chest.",
            "Good for you, man, nice to hear families being supportive :) ",
            "> parents give no fucks, I feel like I just had 600 pounds lifted from my shoulders, I'm starting testosterone in a couple weeks!\n\nAwesome  :-))\n\nGlad everything worked out super for you! If only more parents were as awesome as yours...",
            "I glad you have such wonderful and supportive parents. I hope everything goes great in your transition. ",
            "Congratulations!  Glad they are so great.",
            "That's great, OP! I'm glad you have a supportive family and I wish you happiness.",
            "Congratulations. If your parents want a good 101 video for themselves or their friends,  I used this one on my folks and they share it all the time now: tiny.cc/stsTEDtalk\nWishing you all the best, man.",
            " So glad you got an awesome outcome!!!",
            "Congratulations!! Coming out feels like such a relief after it's done. I came out when I was like 13 but the feeling has stuck with me. \n",
            "As someone who's supporting an Aunt who is trans. I wish you all the best. A decent chunk of the family won't have much to do with her and so I feel bad for her. It's nice to read about your family being supportive!",
            "I never saw the original (until seeing this update), but I'm glad they were okay! That's cool you asked them to help pick out a middle name!",
            "I'm so happy it went well for you. Involving them in picking out your new middle name was sweet. Best of luck with everything.",
            "Cool OP. You live your life and do you as best you can! If it means gender transition, so be it! Don't worry too much about what others think, because what others think of you, yes, does affect you to an extent, but *you*, OP, have the final say to that. It's okay to care, and it's okay not to give two shits.\nYou make sure you put forth your personality and smile. Best wishes on your journey forward!",
            "I'm so glad it went well for you! I'm sure there will be challenges ahead, but it sounds like you have a fantastic support system. All the best to you, OP!",
            "I love your dad's response!  Thank you for sharing. I wish you the best of luck!",
            "Omg I love the dad jokes. Or, the one you shared. I can imagine others. Yay you!!!!",
            "I'm incredibly happy for you 💜",
            "Awesome. My favorite part of your journey was you asking your parents to pick a new middle name. So warm and special and so cool that they can pick a name knowing already who you are.\n\n(I don't even want to give trolls any attention but the internet is filled with garbage pail people. Those people are desperate and unhappy and aren't worthy of your thoughts.  Please waste no further energy on trash)",
            "Yay! I'm so happy for you. That's awesome. \nGlad it worked out so well! ",
            "That's really cool - it is great having supportive parents, especially if they can take it with a hint of humor! Good for you coming out with that and having such a great reply!\nI'm not really a trans supporter, but I'm happy for you being able to make such an important decision and i hope it makes you happy! All the best!",
            "I love you Dad's Dad joke, Dad of the year in my opinion. Also you are a wonderful person OP and so considerate. I am so happy for you (even though I am a stranger on the internet). Congratulations!",
            "Didn't see your previous post - but, just want to say, I AM SO HAPPY FOR YOU!!!! \n\nYou have been blessed with amazing parents, and as being transgender is still a struggle for many, this is the best thing that could have happened. \n\nHugs and all the best on your journey! ",
            "Lol what, people are PM'ing you 'sick fuck'? Why? Because you found out who you were at 25? *rolls eyes* Please don't spend another second on trolls.\n\nI'm so glad things are working out for you :)",
            "Congratulations! This is probably the most happy / excited I've been for someone on this sub! <3\n\nI'm so sorry for the few assholes you've encountered. Try to ignore the miserable trolls. They're unhappy and don't like seeing others be happy. ",
            "Im glad this worked out for you!!",
            "Your post(s) gave me shivers! I'm so happy for you to have the support you need. Congratulations on coming out as your true self and I hope that the the rest of the transition goes smoothly. ",
            "Really happy for you. I'm so glad you can be free to be who you are with your family, you're very lucky to have such a wonderful family. \nI hope though, that sometime in the future there didn't have to be any 'coming out' crap. I hope everyone becomes as accepting and enlightened as your family. I would never want my kids being scared to tell me things about themselves, whatever it is. \nGood luck with the hormones! ",
            "Woohoo what a great update! So glad everything went well :) ❤",
            "Great news! Glad you have such awesome parents. \nPlease ignore the bullies. Honestly every normal, open minded person in the world does not give a fuck that you are transgender, just live the life you want, and ignore close minded bullies! ❤️❤️",
            "I wasn't around for the original post, but I just stumbled upon this update, and I'm very happy for you. Also: fuck the people leaving hurtful comments. Currently, it's fashionable to hate on transgender people, and I can't wait until that trend is over. If ever. There's a long way to go.\n\nI've got one more thing to say, and I hope it'll help you although it might sound weird. Here goes: you're very lucky in two regards. One, your parents are supportive, and that's **awesome.** I'm happy for you that you have such great parents. And two, wherever you live: consider yourself incredibly lucky you can start HRT. Where I'm from, you have to jump through a million hoops just to get that chance, and the doctors you need to see are very rare and very overbooked. It's a pain in the ass - as if a transgender person needed **more** problems created for them. The fact that you can start in two weeks is a huge deal, and I hope knowing that can help you appreciate the support even more.\n\nGood luck on your journey! :)",
            "I think it's great.  I'm glad they surprised you in a good way.  Good luck with everything in the future!",
            "Your update made me cry! We would be living in such a wonderful world if your parents attitude was the norm. I wish you the best! ",
            "I'm so happy that it went well for you! Sounds like you have good parents. I'm sorry some people have said horrible things to you, I just want you to know that there's at least one more person here who supports you. ",
            "Congrats on the awesome parents and have a happy transition <3 im happy you can be yourself :*",
            "Congratulations! So happy for you and so happy that your insurance covers hormone therapy to receive testosterone!\n\nI wish insurance would cover testosterone therapy for non-transitioning men who suffer from low testosterone as well..",
            "I am so happy to hear it went well!  :)",
            "I'm so glad your parents took it as well as they did, and so glad you're able to have a deeper relationship with them without that issue standing between you.",
            "Excited for you! I'm happy to hear that your parents really care a lot about you and want you to be you. The idea of them picking out your middle name is very sweet and shows you're really working with them to keep them included in your journey :)",
            "Your parents sound like incredible people!  Best of luck on your journey. ",
            "Now enjoy it!\nGood luck with the testosterone!",
            "That's so great. My parents are very 'religious' and would never accept me coming out as trans. I wish they were as open minded as your parents.",
            "I love your dad. You have nice parents, OP. Congratulations!",
            "This is such a great update. Thank you so much for writing it and letting the community know! Congrats!!!",
            "Awesome. Your parents reacted pretty much as well as could be asked for! Good luck on your transition :)",
            "Happy stories like this bring a tear to my eye!",
            "That's so awesome. I'm glad your parents are supportive and your insurance covers the hormone therapy. :)",
            " Good luck on your journey, man. I got started about two years ago, and my life's been p great ever since c:",
            ">to everyone PMing or leaving comments calling me a \"sick fuck\" or any other derogatory term\n\nWhat sad, small-minded people. Take solice in the fact that you and your family are nothing like those hate-filled jerks.\n\nAnyway, I'm so happy for you! My sister (MtF) is trans as well and our family also was very supportive/happy for her. So I'm especially glad to hear things worked out for you!!!!",
            "Congrats on this! Fuck off to everyone giving you shit, this is wonderful and I'm happy for you as you carry on with your life!",
            "I didn't read the original but your update was so heart warming! I'm so happy for you. Best of luck!!",
            "That's awesome! I am so happy for you! :)",
            "Didn't see your original post, but wanted to chime in to congratulate you on having a supportive family and their reaction.\n\nHope all works out for you in the best way possible!",
            "I didn't see your original post previously, just want to offer my congratulations.  I'm happy it went so well for you!",
            "CONGRATS!! I am so glad your family is being supportive. Many well wishes for you and your future as you embark on this journey :) ",
            "congrats for being brave and letting them know who you are! it's a nice idea to ask them to help pick a new name. ",
            "Isn't the fear of the unknown a hell of a burden to carry?  Glad you got past that and everything went so swimmingly.",
            "Yay! I'm so happy it went well :) I'm sorry that people are posting and pming you transphobic messages. Just know that the people rooting for you outweigh the people who are ignorant. I wish you the best and I'm glad your family it rooting for you too! ",
            "Congrats! I hope everything goes well for you dude!",
            "That's awesome! I'm so proud of you, and I'm so happy that you have such wonderful parents!\n\nGood luck with your new life! :)",
            "I'm so happy it went well for you! Good luck on your transition!",
            "I'm so happy for you! I love that you're involving your parents in deciding a new middle name. This is heartwarming news.",
            "So glad it went well! It's really lovely to hear stories about these situations where people respond positively. I particularly love the way your dad reacted! It sounds like you have a wonderful, accepting family and I'm glad you can totally be yourself now. Good luck with the hormone therapy and enjoy!",
            "You are totally awesome. So glad to hear it went well!",
            "I am so excited and happy for you! Your family sounds lovely.",
            "I love hearing wonderful coming out stories, especially from those in the Trans community. You rock and so do your parents!",
            "I'm so glad it went well! And those hateful people have nothing better to do and obviously need to be angry at something so boo them, but I'm so glad your parents are so accepting!",
            "I'm so happy for you. Your parents sound like wonderful people and I'm glad you have them to take this journey with you. \n\nAnd ignore those who haven't got a good word to say about you. Their opinion is worthless in the grand scheme of things. ",
            "Awesome!  Sorry you're getting such awful PMs.  I'm really glad for you though, stranger.  Your parents sound awesome!",
            "Congratulations. I am glad everything went well for you. I cannot wait for the day when it doesn't have to be a coming out thing and it just \"is\". Hopefully in the generations to come it will just be as matter of fact as going to the dentist. I think it is really unfortunate that you had to go through all the stress of coming out to your family. I didn't have to come out as heterosexual. I think it is super unfair that people have to go through this. ",
            "I'm so proud of you, and glad it went well!!! My parents have always tried to make it clear they would love my sister and I regardless of our sexuality (or gender identity, I assume) but I was still terrified when I came out to them as bisexual. It's a difficult thing to do, even if you think they'll react well. ",
            "Good luck to you , I would accept my children's decision with hesitation. I hope your parents for the same. ",
            "I'm proud of you! I mean, who the hell CHOOSES to go through the stress and BS of being transgender! You are who you are, those people who are so small-minded and totally lacking in empathy, fuck their bullshit.\n\nI'm proud of you for being strong *hugs* And a huge shout out to your 'rents, that's awesome! Best of luck to you :)",
            "Congrats!! So happy it went well for you. As someone with friends who have gone through much worse with their families, stories like this just warm my heart",
            "I just read the original post and the update, I love this story, happy that it worked out for you , good luck",
            "This is great. I'm so happy for you!! :) ",
            "Congratulations and best of luck to you living your true self! ",
            "Dude (and I mean that in the literal way possible) congrats!!!!!!!! Having the guts to come out is amazing in itself and I'm beyond happy for you that your family deserves to have you in their lives!  ",
            "[removed]",
            "What insurance do you have?",
            "I'm so proud of you. Truly. Congrats on the transition. I grew up with my babysitter starting hormone therapy and slowly converting. Much later in life I was hired at a LGBT bar and lo and behold he was my boss. It took a few shifts working together before my mom told me \"yeah levi was linda when you were a kid. She changed your diapers. Now I guess he signs your paychecks\" it's funny how life keeps worthwhile people around. \nYour gonna be a handsome sir. I wish you the best !!!",
            "So happy things worked out for you! Best of luck ♥️",
            "SO HAPPY FOR YOU! Congratulations!",
            "Congratulations! Ignore the haters, you just keep being awesome!",
            "Dad jokes are what let you know that it's all going to be okay.",
            "I wasn't here for the original, but I feel so grateful that this went well, on your behalf. Props to your parents for being parents. I am so happy for you and wish you all the joy in the world as you transition and live your life!",
            "Good for you! You are so lucky to have supportive parents. That is so amazing! ",
            "You are not a \"sick fuck\".\nThe people calling you or pm'ing you with derogatory terms are the sick fucks. So happy for you. Your family sounds amazing!\n",
            "> I also set up an appointment to start hormone therapy in two weeks (and my insurance covers it!) So I'm pretty stoked about that.\n\nOut of curiosity, how did you go about arranging that? Is there much of a process to it or is it as simple as going to a doctor, saying you want to transition and then they arrange it for you?",
            "I am so happy for you. That is probably the best response I could imagine parents giving! You're lucky to have them, cherish it. :) \n\nAnd good luck with treatment!",
            "Awesome! I am so glad it went well.\nI hope everything goes well for you. Don't forget to always be completely honest with the doctor about everything and stay open with your parents. One question though, does this mean you will be better at playing pool?\nJust teasing. Seriously, good luck with it all.",
            "Gratz OP, glad it went well for you and you've got such groovy folks! Hope you get a luscious beard; they're worth it! :)",
            "The worst part is they can't send you to the military\n/s\n\nBest of luck, I believe in you",
            "I wish you had more caring parents that would want to help... ",
            "I'm new here and missed the original post, but WONDERFUL!  Your parents sound great and I am so so happy for the perfect response they had and wish you the best in the next steps.",
            "I am just now reading this but I wanted you to know that I am so happy for you and think it speaks volumes that you are so considerate of their feelings, especially including them in choosing your new name. Best of luck moving forward <3",
            "I am wondering if the plan the Senate will start debating today mess with your plans. Good luck!",
            "[removed]"
        ]
    },
    {
        "post_id": "ckccmq",
        "author": "None",
        "title": "[Update]: I [23F] have always had intense, toxic relationships. Finally in a healthy relationship with a great guy [26M] and no idea if what I’m feeling is normal.",
        "url": "https://www.reddit.com/r/relationships/comments/ckccmq/update_i_23f_have_always_had_intense_toxic/",
        "score": 5296,
        "num_comments": 146,
        "created_utc": 1564597541.0,
        "selftext": "[Previous post](https://www.reddit.com/r/relationships/comments/aiyf0c/i_23f_have_always_had_intense_toxic_relationships/)\n\nA few months ago I wrote about dating an actually stable guy after only having toxic relationships. The post got more traction than I expected so I figured it might be nice to do an update. Thank you so much to everyone who replied to my post, all the replies really helped. \n\nAs it turns out, the guy I was seeing found the Reddit post, clicked that it was me, and talked to me about it. Turns out he actually felt the same way in terms of low intensity but he liked that, and I decided to keep dating him for as long as we kept having fun together. \n\nWell, I’m happy to say that last week we celebrated being together for six months, and that we are quite madly in love with each other :) \n\nAfter we talked I took the advice of some of the commenters and tried to just enjoy my time with him instead of worrying about the depth of my feelings. I soon realised that he’s a kind, thoughtful, intelligent person and we totally get each other. He makes me laugh with the most inane stuff and he thinks my dumb jokes are funny too. We can talk for hours and hours about anything at all and I rarely feel like I have to justify or explain my point of view at all - he just understands me. One of the first times I knew I was really falling in love, we were chatting in bed, and suddenly it was 3 in the morning and I realised we’d been chatting for three hours without a single awkward pause. I’ve rarely had that with anyone else, and never with a previous boyfriend. \n\nI think most of the commenters were right. My other longest relationships were all built around toxic intensity and wild passion, and while this relationship definitely isn’t lacking in the bedroom, I’d say it’s much more built on a sort of close friendship and respect for each other. It’s certainly not as filled with longing and deep passion as other relationships I’ve had, but honestly I prefer being with him. I feel like I have not just someone to go out with or to cuddle up to, but a genuine life partner - somebody who supports me, who I can talk to about anything, someone who makes me want to be a better person. It just took me a while to realise how much better that calmer, more peaceful love is instead of the rollercoaster/intensely toxic relationships, and I almost made the mistake of thinking that it was boring and throwing it away. I really just needed time to get used to dating someone who doesn’t play games and displays his affection openly and frequently. \n\nWe did have some slight issues with communication to start with - mainly me being afraid to bring issues up/suggest things because of other boyfriends overreacting terribly in the past - but after we talked a lot he’s been very supportive and proven himself to be a mature enough adult that he can handle occasional criticism without getting super defensive. It’s been really refreshing to be in such a drama-free relationship where we can argue or talk about issues in a really healthy way. \n\nThank you to everyone who replied - you all helped a lot and I’m really glad I took your advice and didn’t just break up with him. I love him a lot and I can see us being together a long time. Thanks :) \n\n**TL;DR:** Turns out I just needed to adjust to a healthy relationship. Boyfriend is great and we love each other a lot. Everything is awesome, basically.",
        "permalink": "/r/relationships/comments/ckccmq/update_i_23f_have_always_had_intense_toxic/",
        "comments": [
            "5 years ago I started to date a guy and felt like you did in the beginning. 2 days from now we are getting married!\n\nThe thing is that the excitement it lacked in the beginning came later and I keep falling deeper and deeper in love him! Now I feel butterflies when he texts me and get all excited getting home from work to see him.",
            "I'm currently going through this whole issue myself and reading both of your posts and the comments has helped me see things differently. I've spent the last three weeks trying to decipher if I really have romantic feelings for this man or just seek his friendship. I've been waiting for the spark I usually chase after which has always ended horribly. \n\nThank you for sharing, you're helping so many other women and men in your position. Congrats girl!",
            "He sounds like a keeper, I'm so happy for you!",
            "Very happy for you! I can relate to how weird it feels to have a non-dysfunctional relationship for the first time, but boy is it worth it!",
            "So often the exciting highs can come from a comparison with very hurtful lows. The \"oh my gods this is incredible\" comes as an aftereffect of \"oh my gods why would you do this to me\" and it makes the good seem so much better. It's not, it's just comparatively better. Your brain says oh hell yes when it's been saying oh hell no for a while.\n\nAt least that's how it was for me. When I finally met people who wanted to be with me, it was boring. But in reality, my \"normal meter\" was broken. My sense of self was shattered. I didn't feel like I deserved the good feelings unless I had to work for them. Then I figured out that not everything had to be a fight and not every kiss had to be passionate. It took a bit to accept that.\n\nGood on you for figuring it out earlier than I. Life is both short and long. Finding a good partner is key. Best of luck to you and your person. May it be full of laughter, love, and long conversations without unnecessary drama.",
            "I’m super stoked for you! I just read both posts and I can tell by the way you talk that you sound happier. I’m currently in the same shoes, with someone where it’s so easy, and relaxed that it makes my anxiety go nuts lol. But you learn to grow, and after a year with my man I have grown from the trauma. And it looks as though you have grown into a wonderful partner. Happy anniversary!",
            "[deleted]",
            "So good to hear. I recently stumbled upon attachment theory and feel it explained my relationship woes. As an anxious type that dates avoidants... The book said a healthy attachment relationship would feel boring at first and to stick it out. Nice to see that reflected in your experience. Congrats!",
            "I'm sooo glad I've found your posts. I've been feeling the same way with my current bf of 2 years. I keep thinking about my previous relationships and how passionate I felt. I thought that me and my bf weren't right for each other or something. But then you pointed out that you knew your boyfriend would text back, you know he is always there for you and you know you can tell him anything. That \"passion\", that \"rush\", I was feeling when I was dating douchebags was from not knowing where the relationship going and if they really like me for ME.",
            "I’m really happy for you! Both of my past relationships have been toxic, and so your story has given me great insight into how to approach a healthy relationship. Best of luck to you two! ☺️💜",
            "This is so weird. This sounds like me and my gf word for word and we're celebrating our 6 month this week too! I'm so happy there are other people like me as my previous ones were toxic just like that and now this feels so chill.",
            "I could have written your original post, so thank you for posting that. I'm glad you guys resolved everything. Wishing you all the best.",
            "I'm so happy for you!\n\nMy ex was similarly worried about the feelings being very muted at the beginning. She decided we shouldn't be together.",
            "When I first started talking to my wife about us potentially dating, I told her that I wasn't interested in something that was \"white hot\" like my last relationship. It was toxic, codependent, and abusive but more than that it was... obsessive. Every second of every day required communication at a minimum. It was disgusting. \n\nOur love burned so fucking bright... and then it burned itself out and it was just gone. And we stayed together for another three years. Second biggest mistake of my life, that one.\n\n\nAnyway. my wife and I are about to celebrate our first wedding anniversary. I love her with my entire heart and soul. I've never loved someone so truly, so honestly. She's my best friend. And that's why I love her the way I do. I never had a honeymoon phase in this relationship. My love for her has been the same since the moment I fell in love with her. Never waxing, never waning. I love her as a person. Not as my fuck buddy, girlfriend, fiancee, or wife. Not for what she can do for me or give me, or because I don't want to be alone anymore. I respect her more than any person in the world. \n\n\n\nI'll never forget how happy I was when she stopped me one day and told me she had something to \"confess.\" She told me she was worried that something was wrong with our relationship because she didn't feel like she was \"in love with me the right way.\" She described it almost exactly like you did.\n\n\nWhen I told her I felt the same way, and then reminded her of the conversation we had over a year earlier, she felt much better. \n\n\nTL;DR: This is a good thing. It means you're maturing emotionally. Foster these feelings and make something wonderful together.",
            "Congratulations! If it's any help, you're not alone.\n\nI'm 34 and celebrated 1 year with my girlfriend this past April. Before her, I never had a relationship last longer than six months and I was usually miserable by month 3 or 4 at most.\n\nI'm still thrilled about this relationship, so is she, and it's been really great actually being in a wonderful relationship with a wonderful person for the first time in my life.\n\nGood job 👍",
            "When I first started dating my SO, I felt weird that it was so comfortable and normal. Now, I can’t imagine not having that in a relationship. We have problems...we’re not robots...but we talk about it and get over it",
            "I am in the same boat. Lots of toxic / abusive relationships in my past. Now I'm dating this super sweet, kind, loving, attentive guy. We started out kinda speedy, but from the first minute we met, we just clicked right away. We have similar interests without being the same person, we communicate, and we understand eachother. I've never had this with anyone else, and it's terrifying to experience because you're just waiting for the catch, or for them to do a total 180 on you. But I don't think he will. It's best to have fun with it.",
            "I didn't read your previous post but finding this and reading the other really felt like this was me and my girlfriend.\n\nWe're actually a year younger than you guys (she's 22, I'm 25) and for a while I was like, damn is this my GF? LMAO\n\nBoth of us have had some shitty relationships and we've been together for 5 months and she said a lot of things you did in the first post.\n\nI just hope you two keep on going strong as I hope that both me and my partner do.",
            "Aww I love a happy ending. Glad things are working out for you",
            "I really love this - thanks for sharing and I’m glad you’ve found a genuine life partner.",
            "So amazing reading this! I literally was in the exact same boat as you in your previous post. My boyfriend and I went on our first date six months ago tonight. It took me about a month (or more) before I realized how feeling this comfortable and at ease didn't mean it was boring - it meant I was in a healthy relationship. Healthy relationships filled with constant wanting and longing fueled by passion and heightened emotions and tears...simply don't exist. \n\nMutual respect, laughter, stability, and comfort are signs you've got a good thing. Hold onto it. Happy for you, OP! \n\nAnd also loving how many others have gone through this and given \"boring\" a chance. Easy love is the best. :)",
            "I often wonder if we are raised to have severely unrealistic ideas of what a loving relationship should *feel* like.  It also took me several years to figure out the the stronger the chemistry and intensity, the faster it fades.  Maybe Hollywood made those firework level relationships seem so enjoyable, but I too have come to prefer slow and steady. There is so much love, comfort, and consideration to be found in a consistent partner, then one that keeps you guessing. \n\nHappy for you, OP!",
            "The first time I ever talked to my husband on the phone we talked for seven hours. 15 years later and we still lose hours to conversation. 🙂",
            "Do you feel like the sexual chemistry is there?",
            "Did you end up going to therapy?",
            "I have honestly been in the same position as you are with my toxic exes. And after I have met my current boyfriend, we as well have communication problems due to me being scared (but we did sort it out and now about to celebrate a year soon!).\nBut I am honestly so so so happy for you that you have found a guy who treats you right. You deserve all of the love and happiness he gives you. \nAll the best to you!",
            "He sounds like a total peach...and so do you. \n\nWishing you both the best, it’s so nice to get updates like this!",
            "[deleted]",
            "Had this same issue in the beginning of my relationship with my now husband. I’m so happy you were able to get over the intensity hangover and see what you have!",
            "Your story is so heart warming. I'm so glad that you found someone who is a perfect fit! Best of luck to you!",
            "This is so lovely, I’m happy it’s working out for you. \n\nI went through a lot of crazy tumultuous relationships when I was younger too. I met a(n actual) nice guy nine years ago. I worried a lot about *settling* because I didn’t feel completely insane all the time—honestly it took a year for me to be deeply in love. We’ve been married for 4 years now and I feel like I’m living my best life with him. ♥️",
            "Yes to all of this! It took me 6 months to give him my number because I was so scared that it wouldn't work. Now a year and a half later we have a beautiful baby girl and I'm listening to them both snore in the bed beside me. Life is good! 💗",
            "Ahhh i feel this so hard!!! Ive been with this guy for a year and hes so healthy for me. I had lots of episodes where i felt like I HAD to argue over something or look for something BAD. Im in therapy to work on this, and other personal reasons. Slowly I have been getting better at controlling my urges and seeing things for what they are! A normal healthy relationship. :)",
            "After reading your last post, I’m so glad you shared this one.\n\nI’m in a very similar situation (horrible abusive exes with all that passion) and reading these was such a relief. Your words are so relatable as now I’m finally with someone I love deeply, who understand me on every level, but I initially almost walked away because I doubted our passion. \nI am so glad I didn’t give up because he now means the world and then some to me. Happy for you, OP. We deserve the good love!",
            "Are you actually me? This was exactly what I needed to read right now, as I am in a similar situation and had been feeling similar things. So happy for you and your partner, I hope everything continued to go well!",
            "So glad you finally found someone that makes you genuinely happy and that dosent bring negativity into your life! I can somewhat relate because I also had a very toxic relationship before my current bf. At first it was a bit scary at how peaceful I am in this relationship and how easy it is to talk to him about issues without having accusations thrown at me or just getting all these lies and angry responses. I started to think it was simply to good to be true but after 7 months now, a lot of learning to communicate without fear, and actually learning to trust my partner I can say I'm in the happiest relationship I've ever been, and I myself even without my partner, am greatly happy overall. He's my sunshine after the rain and I'm madly in love with him :)",
            "I'm really glad you're in a safe relationship. I've been there, and still struggle to this day feeling \"bored\" or \"uncertain,\" but all of this is helping to strengthen your internal compass.\n\nI hope you also looked into some form of therapy, or counselling! I think it would be enormously helpful for you.",
            "Oh man.  I've been wanting to post something similar for about a month.  I've been in the most toxic of toxic relationships.  It took me about a year to adjust to the amount of genuine love, trust and respect my current boyfriend showers me with. It's crazy how much dating a real man can change your view of yourself and what you deserve.  \n\nCongratulations girl!  I'm very happy you have found yourself a genuine man.  Good luck to you both ♥️",
            "Sounds like my relationship with my ex. Except she took me for granted and cheated on me with her ex. I'm not free of fault, but it was brought on because she kept entertaining her ex and brought up a lot of insecurities. Feels bad man, but I think I honestly dodged a bullet. Wish her the best.",
            "A slow burn turns into a passionate smolder that nothing can put out. And there’s nothing like it. Sparks last an instant, but a slow burn can get you through the night 😉 Enjoy your new relationship!",
            "Oh wow this is the best kind of update.\n\nAs a survivor of abuse who is also now in a happy healthy relationship (marriage now) I'm so thrilled for you OP!\n\n❤️❤️❤️❤️\n\nThis is pretty sad but I actually have a tear in my eye about an internet stranger finding a good relationship after so much bad.",
            "This is so lovely and gives me hope. 🙂 Congratulations on your healthy relationship!!",
            "This is really beautiful!  Happy for both of you!",
            "Wow I don’t think I have related to something more. I’m still trying to figure things out, but your post gives me hope.",
            "This really resonated with me! I just found someone like this about 9 months ago after being in numerous toxic relationships. It feels so good to actually be loved and respected! \n\nCongratulations!!",
            "Very happy to you! I feel like this is the sign of the great relationship!",
            "Glad everything is working out alright",
            "I was recently in the same boat. Instead of accepting these new feelings, my girlfriend dumped me, hoping to find that spark that comes from toxicity elsewhere. My ex has seriously fucked her life up in 3 weeks, destroying every source of stability she has. We still live with each other, and it's brutal to watch.\n\nGood for you for sticking with it. Love is a fire, not a firework. Sometimes it's just embers, but the flames are there if you're willing to work for it.",
            "Congratulations, really happy for you",
            "That's just wonderful. Thanks for brightening up my day, and enjoy your lives!",
            "I love this story so much",
            "Thank you for sharing this, OP. It has really helped me. I have some things to think about :)",
            "I feel like I'm the one writing this lol and like you're talking about my boyfriend. It's crazy just how similar it is to how my relationship was. I got passed that all and we have been together a year and 2 months now and we just moved in together:).",
            "That was my 1st marriage. I never completely opened up. He tried to change me into something i wasn't. Never really accepted me. Unfortunately, I wasted alot of years that way.  He also gave me plenty of reasons not to open up. My husband now is awesome and he knows everything and accepts me for me. It also helped that we knew each other since kids and we're we always said we were going to get married. Better late than never. My husband had taught me alot, most important he taught me how a husband is suppose to be. We are equal 100%.  I had alot of toxic relationships throughout my life until now. It feels good to have a wonderful person on the other end.  Be seeing you getting married.  Glad you finally found some happiness.",
            "I always tell my girlfriend,  you're my friend first,  and my girlfriend second. \n\nAnd it makes it so easy to address issues with that.",
            "After a long slew of terrible relationships I had one that was perfect but low intensity (but could happily spend every second of day with him)! And it was amazing. So amazing that I put up with the fact that he was asexual even though I wasn't. Unfortunately that did end up being the deal breaker, but definitely put me on the path of not searching for that crazy anymore! Best of luck to you both!",
            "I've had that doubt you had before and it sucks not being certain. I'm happy you found your answer.",
            "I feel so happy after reading this post. Everybody deserves to be loved.. u are no exception.. cheering you and ur relationship on!!",
            "What you are feeling is falling in love.",
            "I am so happy for you, nervousyounghumans. I am in a pretty similar situation at the moment. Also had difficulties rewriting my relationship patterns, wasn't sure if I was doing the right thing, lots of internal conflict and now 4 months happily together with my partner. I wish you the best of luck and feel free to pm if you want to talk about our similar experiences!",
            "How easy is it when you're with the one?",
            "Thank you so much for this post I feel like I'm in a similar situation but I'm the guy and my girlfriend is concerned her feelings aren't intense enough, I told her I loved her and she told me a few months later she just wasn't ready to say it back/wasn't sure if she loved me, and I said we should take it slower a little and just concentrate on enjoying each others company because we have an incredible time together, I hope my story ends the same as it has for you, very happy for you!! :)",
            "Respect. That is the key factor in preventing abuse. \n\nIt’s nearly impossible to abuse someone whom you respect. And he respects you.\n\nThis post was awesome!",
            "It'll take a while to get used to. Its like you cant be comfortable, and always on edge, or wondering what their hidden agenda is. Or when it's all going to go to shit like the rest. Idk if you really think he's a good guy with good intentions you'll find a way to make your mind right, and he'll be patient even when it feels like there's no patience left for your growing. It'll be ok. Juat get past the unhealthy habbits you created to protect yourself. They're not needed anymore right?",
            "I so related to your worries in the first post. I started dating a guy and I thought we lacked passion. But I realized what was missing was drama and toxic need. \n\nWe’ve been married for a year and a half now. He’s the love of my life. I feel in love with someone who made me see that love doesn’t have to be hard. I’m so happy you are too.",
            "Aww this made me so happy to hear. I do want to ask, how did you adjust to the healthy relationships? \n\nI read your previous post and have a similar history. I am now dating a great dude who I love and enjoy being around but sometimes I feel myself acting out. I know I'm acting out but as much as I'm aware of what I'm doing, I can't seem to stop the behavior. \n\nDo you just start to grow out of it? We've been dating about 3 months and I'm really trying not to fuck this up.",
            "I just want to say thank you from the bottom of my heart for sharing your story in both of these posts. I was in a toxic relationship for 9 years. I’ve been dating someone else for 6 months now. And this has really helped me realize the difference of being in a toxic versus healthy relationship, and helped me figure out my feelings for him.",
            "To play devil’s advocate, it sounds like you talked yourself into settling. It works for some people. However, whenever I’ve ignored my intuition, bigger issues have presented later. You can have passion and a healthy relationship; it doesn’t have to be one or the other. \n\nYou’re only 23. I’ve seen posts from people in LTRs who settled, then meet someone who actually fires them up and mourn never having had a proper honeymoon period with their current partner. Passion fades, but if it was never there, you may come to feel like you’re missing out.\n\nYes, you’ve had toxic relationships, but that’s part of becoming an adult. Don’t make the mistake that “nice, kind guy” means “I should tell my heart that this is all I can hope for, and forget about genuine love/romance”.\n\nEdit:\n\n>  It just took me a while to realise how much better that calmer, more peaceful love is instead of the rollercoaster/intensely toxic relationships, and I almost made the mistake of thinking that it was boring and throwing it away\n\nDude, you can have those feelings and be in a healthy relationship. I’ve experienced it. I’ve also experienced being in a healthy but passionless relationship with a constant underlying sense that things weren’t really right, but feeling guilty to break up because he was a great guy.",
            "I’m glad you are making progress away from valuing toxic relationships over healthy ones!\n\nI do have to ask if you’ve shared these feelings or even these posts with your current BF. Even in this update you talk about how the passion and sex isn’t quite what you want, but other things make up for it. I think you need to be honest with him about that, because it seems to leave the door open for a healthy relationship that *is* wildly passionate (these exist!) in your future... maybe with him, maybe with a different partner. And maybe he wants a partner who thinks of him that way. Maybe not! I think you should be honest with him, though - and it could lead to the passion increasing.",
            "So happy for you! \n\nHonestly, I think most (young) women seem to think they prefer these intense relationships more than peaceful/calm ones is because it's usually what we see in movies. And I believe if a relationship is ALWAYS intense and passionate, there's no real solid foundation there - it should always die down into a more calm, content state. Passion can still be there, and it should definitely be worked on, but I just personally love it when the relationship changes to something more calm and comfortable. Stability is what I look for the most, so I personally can't have a relationship that stays intense the entire time. I still want that passion, but I know after a while it's something you gotta work on for a bit.",
            "love will never be normal",
            "Wow. I feel as if it was me writing this post.",
            "I'm in the same place rn. I had a horrible, abusive realtionship prior. But now my current bf, I believe, is the best person for me. It was weird at first because he's so 'normal' compared to the people & chaos I was used to. I wouldn't change him for anything though, he's perfect to me. This makes me so happy to hear I'm not alone, thank u. I wish u nothing but happiness.",
            "I'm very glad you found the deep feelings.  \nI am in the toxic part of the relationship. Wild passion and intensity. Games and resentment. I don't know what to do. I don't know if I should care or not. \n\nYour posts just reminded me what long for. I will probably never find it.",
            "Hold up did you say you met on reddit?\n\nLol😂",
            "Look up Mark Groves. He has an insta account @createthelove and then he also had a podcast on iPhone",
            "I'm going through something similar. I have a great guy who loves me 5 years + now and I doubt my feelings for him. I'm recovering alcoholic, suffer from depression, anxiety, panic attacks and ADHD. IDK what \"nice and normal\" are. Thank you for posting this. It's given me a lot of insight and hope for my own future with this man",
            "Wow this was really nice to read, im still very stuck on the fact that i need intensity and passion.. hopefully ill grow to a place where you are and love / want that kind of relationship =/ im still so stuck on that intense connection. and when anyone comes along that doesnt provide that within the first few dates im out.. lol thanks for this post !",
            "Congratulations!! I'm incredibly happy for you. I've been through this myself, so I completely understand! Best of luck towards the future for you both ❤️",
            ">  It’s certainly not as filled with longing and deep passion as other relationships I’ve had, but honestly I prefer being with him. \n\nThis is a big red flag",
            "Daw. I love this. Thank you for posting and sharing a bit of your happiness with us! Made my day better. Wishing you all the kinds of beauty and love in the days ahead lol no pressure",
            "Congratulations! So happy for you both.",
            "I'm really happy for you! Gives me hope reading this. One day, I would love to be that guy for a lucky lady. Idk if I could hold it in if that person ever described me as you did for your person. \n\nI won't rush anything, but also don't be too passive and don't give up! Also, un-related but you get the honor of my first comment on this sub. 😊",
            "And he reads r/relationships!",
            "Lol let’s see how long this will last\n\n(Hint hint, probably not that long. Lol “getting adjusted to a healthy relationship” my ass)",
            "I had this concern in my relationship at first, I thought I was the only one!",
            "Congrats on everything being good!! I unds completely having been in that scenario. Always rmb to not let how you’ve been previously been conditioned to think and behave affect how your r/s is now cause he’s a different better man from your exes :) if he is who he says he is he will reassure you constantly never letting you doubt or worry anymore.",
            "No pls dump his ass and go look for mr motorcycle lover who is willing to smack you up and down every night.",
            "I bet he is not as good looking like the your previous boy friends. Avg looking guys learn to compensate with good behavior.",
            "As a guy that is the healthy relationship seeking a female that always runs into toxic females that have gone through a lot of bad shit, and met a lot of terrible men who only use, manipulate, and cheat on them, then they meet me and don't know what to do or can't except finally meeting a decent dude who just wants to treat them as a equal.  Give the guy a chance.  Don't let him buy your love with money or nice things he's doing for you obviously, but enjoy his company, be your own woman, and just enjoy each other.  I know I may seem out of your comfort zone to be treated like a person not a object, but go to a counselor if need be.  I've been told I'm too good, too many good traits, etc.  Men just want to be loved and have someone to give their love, and except that love.",
            "Saw your previous post, started crying out of nowhere, because it reminded me of how my ex was towards me. And how intensely I'd love her, even though she treated me like shit, but I tried to keep the relationship healthy for her, because I knew she had some traumatic past experience, loved her unconditionally. I was insanely in love with her, but she was toxic towards me, maybe because she knew like I would always stay by her, and come back towards her. \nI'm an agonist, I don't pray, but from the first day we were together, I would pray for her, and her betterment, I still want the best for her. Wherever she is, I want her to be happy, and loved.\nLater on I had to break up from her, against my heart's will, but due to my deteriorating mental health, I couldn't stand that no more, however, took all of that for about 3 months.\nWhen I broke up, I got to know that, she did all of that intentionally, because she wanted to break up, but won't do that.\nThanks for reading ❤",
            "I’ve dealt with this so much in my 2+ year healthy relationship after an intense & toxic 3 year relationship. I am so much happier now but I find myself missing him, even though my new SO has only pros & my ex has only cons"
        ]
    },
    {
        "post_id": "36j7ta",
        "author": "Nowwhat8989",
        "title": "UPDATE2: I (22M) just walked in on my girlfriend (21F) of 7 years having sex with my roommate (22M).",
        "url": "https://www.reddit.com/r/relationships/comments/36j7ta/update2_i_22m_just_walked_in_on_my_girlfriend_21f/",
        "score": 5290,
        "num_comments": 563,
        "created_utc": 1432065637.0,
        "selftext": "**Hope this isn't against the rules or anything...** But since I've gotten many requests asking for pictures of my new kitty, I've posted him where all the other cute pictures of animals go! If this is against the rules, let me know and I'll remove it!\n\n[Original Post](http://www.reddit.com/r/relationships/comments/32m5lj/i_22m_just_walked_in_on_my_girlfriend_21f_of_7/)\n\n[First Update](http://www.reddit.com/r/relationships/comments/33aypy/update_i_22m_just_walked_in_on_my_girlfriend_21f/)\n\nHey everybody. I've been asked multiple times for an update, but it's been super busy, and I actually have a little time today, so I thought I would update everybody on my situation.\n\nMy ex made a doctor's appointment for a couple of days after my last post. She sent me a text with the date and time, and asked me if I would be going with her; I told her that I wouldn't but that I wanted Emily to go with her. She straight up refused and said this was \"our baby\" and that if I didn't go, she would cancel the appointment and wait until I was ready to go. We argued for a little bit until I gave in. I told her that I would meet her there, and I would stay for the entire thing, but I was going to be stone silent the whole time unless the doctor asked me a question.\n\nHer appointment was at 9.15 that morning, I showed up at 9.10 and sat across from her in the waiting room. The doctor called her back a couple of minutes later. They talked for a couple of minutes, she asked her some questions, and then she had her go to the restroom to pee in a cup (I made sure that her purse and everything stayed in the room - somebody warned me she would be crazy enough to buy a pregnant woman's pee and use that instead). After she gave the cup to the doctor, the doctor left and then she tried to talk to me. I sat there and ignored her and texted my friends until the doctor came back and confirmed that she was pregnant. I started shaking and tried to control my breathing, but my ex was so excited, and the doctor was excited with her. Then came the ultrasound, and my ex was roughly 11 weeks pregnant. After a couple of minutes, I excused myself and left. I texted her as I was leaving that before anything else happens, we're having a paternity test.\n\nFirst off, Noninvasive Prenatal Testing is super expensive. I told her that I would pay for half, but that if the child wasn't mine, then she would have to pay me back for that. She told me that her parents were willing to pay for it. Her parents have more money than I would know what to do with. Like... millionaries money. I told her that my ex-roommate was taking the test as well. She said that he didn't need to and I snapped saying that, \"I guess I can wait another 6 months. Because they won't put my name on the birth certificate until they prove I'm the father.\" She finally agreed with me and made him take the test as well.\n\nThere's a place around here that actually specializes in DNA testing, so we were able to get in just a couple days later. SHE BROUGHT HER MOM WITH HER! They told us that they would have the results in 10 days and that we could come pick them up or they could mail them to us, we said we would pick them up in person.\n\nI was too nervous to go to the results. Emily and Trevor both went in place for me. According to them, my ex wasn't happy that I wasn't there and almost refused to let them see the results, but her mom told her that she could understand why I didn't want to be there.\n\nI'll never forget that phone call from Emily\n\nE (Emily): Hey!\n\nM (Me): Well...?\n\nE: You're not the dad! You should have seen the look on your ex-roommate's face though! **He's the dad, I didn't make this clear. Sorry!**\n\n*At this point I squealed like a little girl.*\n\nMy ex attempted to text me later and I just ignored all of them. Both of her parents did text me though saying that they wish me well with teaching. That really meant a lot to me.\n\nAs for other things in my personal life... I've gotten a new apartment over by Trevor and Emily. My ex doesn't know where I live at the moment, her number is blocked, she's blocked on facebook, and everything else that I could think of to block her on.\n\nI've joined a summer baseball league and I play for that 2 times a week. I'm volunteering in the preschool classrooms on campus in the mornings. My job is giving me more hours (requested). I'm taking 3 summer classes, and I'm the ASL tutor for the summer classes now that they have started. I also bought a bike, and now I ride that daily as well. I also got a kitty. His name is Jasper. And I read a lot more now. I realize that I wasn't reading as much as I normally did while I was with my ex, but I've gotten back to reading!\n\nMy friends are saying that I'm too busy now and that I have even less time than I did when I was with my ex. I like that. The busier I stay, the less I think about her, and the happier I am. There's a week between the summer classes that I'm tutoring this summer, and Emily, Trevor, Emily's best friend and I are going on a 5 day hiking/camping trip.\n\nI want to say thank you for everybody that helped me through this. The support that you've all given me has really helped me. There are still the people that are saying \"This isn't true\", but I'm receiving a lot more positive support than negative.\n\nNo, Emily and I are not going to date. For the many people that have asked, I'm sorry to disappoint you and say that we're not. I don't see her in a romantic way, and I plan on staying single for a while.\n\nI'll be finishing up my BS in Elementary Education this upcoming school year, and then I still need to decide whether to continue schooling and pursue my MS in Deaf Education and Deaf Studies, or whether I should start teaching.\n\n**I'm sorry, I had to take the link down of Jasper. I was reminded that you are not allowed to post links.**\n   \n**tl;dr: She is pregnant! But I'm NOT THE DAD! Now to move on with my life**",
        "permalink": "/r/relationships/comments/36j7ta/update2_i_22m_just_walked_in_on_my_girlfriend_21f/",
        "comments": [
            "would have been more fucked-up if your ex-roommate wasn't the father either... ( ͡° ͜ʖ ͡°)",
            "Wow, thank god. And it confirms that her sleeping with your roommate was not a one time thing, since she's 11 weeks and you only walked in on them about a month ago. I can't imagine the relief you must feel!! Wishing you a long and happy life :) ",
            "[removed]",
            "Dear lord man, you made me grip my armrests with the story. Good show.\n\nPictures of the kitty? ",
            "Happy Not a Father's day",
            "did you ever make the lasagna",
            "congrats on not being the dad.   I am guessing her parents were good with you before this madness?  \n\nI know this may sound weird but i am glad you found out about the cheating before this pregnancy stuff came out.  I have a feeling you would have never questioned it otherwise. \n\nYou mention the roommate left you a note that 'explained' it.  How do scumbags like him rationalize such behavior?  ",
            "I wonder how long before she cheats on the roommate.",
            "Reddit's own real life episode of Maury. Sorry for everything you've had to go through OP, but the way you've handled this shitty situation is inspiring. Congrats! ",
            ">and my ex was roughly 11 weeks pregnant.\n\n>You should have seen the look on your ex-roommate's face though! He's the dad\n\nA one time thing, she said? Mmmmhmmm.",
            ">E: You're not the dad! \n\n*GIANT SIGH OF RELIEF*",
            "So happy things are looking up for you! And good for you for taking time you focus on yourself, it sounds like you need it. I know it sounds hard to believe now, but in a few years you'll be reminded of your ex (since you hadn't thought about her in so long) and laugh at how lucky you are that your life turned out the way it did. I'm sure you're thinking you're lucky now, but in a few years it'll amaze you how much you *used to* think about her.",
            "[removed]",
            "I'm sorry that I didn't make it very clear in the update. But the child IS my old roommates child.",
            "Hey, I used to teach. The interest in masters for SPED TEACHERS varies by state/district. Some schools want the extra learning, and some want the lower salary requirement. I would advise you to look at some of the staff bios at local schools for post-grad levels. \n\nI personally think that you should get the teaching experience in first, just in case you en up going a different career path in a few years. ",
            "Dodging more bullets than Neo: congratulations!",
            "Man, that made my day!  Way to go on dodging a HUGE bullet!  Now, live your life and enjoy your future.  Have some fun and forget the pregnant ex and her new baby-daddy!",
            "It's great that you walked in on them when you did. Otherwise you would be engaged and painting the nursery for your roommates baby right now. ",
            "> I also got a kitty. His name is Jasper. \n\nBest part. Well, after you not being the dad and all. ",
            "Oh man. I've been following the posts and rooting for you dude. Just wanted to say congrats on dodging a bullet and taking great steps to move on!",
            "That is the best example of returning karma I've ever seen. I'm very glad the baby is not yours and you can now move on with your life. You have great friends and a great future ahead of you. Good luck!",
            "Man let's give it up for Emily and Trevor. True fucking friends. You don't get very many of those in life.",
            "What happened to the ring!?!?",
            "holy shit if you had never caught her you would have raised someone elses kid forever. yowzers! ",
            "\"It was only the one time!\"\n\nThe paternity test determined that was a lie.",
            "under the circumstances....walking in on your girl cheating is probably one of the luckiest things to ever happen to you",
            "WOW!\n\nI just stumbled onto your older threads today in a search, read them and now got your awesome update.  This is truly a great update.  You sound like you are doing as well as anyone possibly could since the tragedy of last month.  I can't imagine how nerve wracking the doctor's appointment, the finding, then the wait on the paternity test.  You really handled it amazing in your boundaries and decisions.  I'm immensely relieved for you on the DNA findings.  \n\n>Both of her parents did text me though saying that they wish me well with teaching. That really meant a lot to me.\n\nThis is also incredible.  They probably like you more than their daughter at the moment.  It is really amazing and rewarding that they have such healthy perspective through this all and I am glad they sent you those texts.  It would give me a bit of closure, for some indeterminable reason.\n\nIn a weird way, I almost feel like karma was watching your back big-time.  Not only is she caught in her lie of 'it just being a one-time thing', but (and I'm kind of torn on this) she is facing a life-long consequence of her stupidity and betrayal.  Now, I am a father and I can only pray she grows up and loves and does the absolute best she can for her child... clearly none of this was the child's fault, but it wasn't yours either.  I'm so glad you aren't saddled to someone like her through such circumstance as she very clearly was going to remain immature and try to leverage a human life into control over you... instead now I hope that innocent baby leverages her and her adulterous partner to open their eyes and grow up into decent human beings and adults instead of the immature assholes they acted as last month.  One can only hope.\n\nBack to you- man I am relieved and impressed by you and your steadfast climb over recent obstacles and struggles.  I am so glad that things worked out as they did (you had a BIG role in that).  Enjoy Jasper, cherish the time camping/hiking with amazing friends, keep going forward in the amazing life ahead of you- and we are all glad you can wave goodbye and part ways with the two people who showed their colors (on accident) and are suddenly snowballing into their own uncontrolled future.\n\nAs chaotic and stressful as this last month certainly was, I suspect in some regards the drama and way it unfolded might be able to offer you a quicker and deeper closure or processing of the emotions and decisions (at least I hope so).",
            "Mah Nigga!!! \n\nSo happy for you bro ",
            "Good on you man. ",
            "Also: she lied about it being a \"one time thing\". Of course, we all knew that it was a lie.",
            "I fucking love Happy Endings!",
            "YES. THE UNIVERSE CAME THROUGH! GO SPEND MONEY AND BEAT OFF!",
            "Maaaaannnnn.... I just read all 3 posts. Wow. I've had the \"I'm pregnant\" thing before so when I read it in your post I thought, bullshit! \n\nYou the doctors. Pregnancy confirmed. Paternity test... Paternity teeeessst.... \"Fucking spit it out Emily!\"\n\n\"Ex room mates the dad\". Shiiiiiiiiiitt. I was so happy for you bro. I guess it wasn't just a one time thing after all. You're better than that dude. Glad to hear you're doing alright. ",
            "Dear OP, \n\nMake a new post in /r/aww - pictures of Jasper.\n\nLove,\n\nAll of reddit.",
            "My ex was pregnant when I was much younger and she told me I was the dad and whatnot so I went to all of her appointments with her and after EACH appointment, I'm not even kidding, she told me she cheated on me. First appointment it was one time, second appointment it was 5 times and on and on. Because the prenatal test is really expensive I waited until March when the baby was due and swabbed my DNA and did the whole thing after birth. The DNA facility called me a few weeks later, the week before spring break no less, and said verbatim, \"in the case of aut0matix, you are NOT the father.\" It was the only time I ever cried because I was so happy - not that I wasn't going to be a dad per se, but that she was a shitty person to have one with. \n\n\nAll that being said, I know how you feel to a degree and I can empathize. Keep on keepin' on, man!",
            "This should have been on Maury or Jerry Springer or something...",
            "Link to originals?",
            "I literally fist pumped with joy when I read the text from emily. Congrats as fuck OP. you're on the road to recovery and soon you'll find the girl who'll will make this whole thing just a memory for you. Good luck buddy",
            "My goodness, you are a stone-cold badass. I wouldn't have been able to handle it nearly as well as you did. \n\nSo much for her \"it was a ONE TIME THING...\"\n\nHugs from me man. Lots of em'. I'm proud of you. ",
            "First post she claimed it was a one time thing. \n\nThe Ultrasound said she was 11 weeks along. \n\nIts been a one time thing for at least 2 months before you caught them. ",
            "Damn, what was the parent's response when they were basically told, \"Without a doubt, your daughter is a certified cheater.\"?",
            "I am completely taken and impressed with your maturity through this all. I can't say that when I was 22 I would have had half the brain that you have in a situation like this. Kudos (and karma) to you for not trash talking her, or her family. \nThis might be unsolicited advice, but I'm giving it anyways because I went through something very similar. My \"best friend\" slept with not one, but two if my boyfriends. I understand the feelings of betrayal are almost unbearable at times. Yes it is very important to continue moving forward and creating your new normal now with out her, but its just as important to allow your self to truly and fully process through those feelings completely. \nThere are things called small T trauma and big T trauma - both can be emotional. Work though it- even if you have to see someone to do it. I never realized what little spiderwebs creep in your brain and plant them selfs there until I had a second failed marriage at the age of 27. When I met my current husband, we both recognized that we were both a little broken obviously and decided to do couples counseling before we got married to make sure we didn't make the same mistake again. What it identified was that I had alot of small T trauma that was still running around (I like to picture it as a little gnome with a torch running through my brain pulling pages out of the drawers of \"shit I never want to think or feel again\" and scattering them about. Made it easier if I can laugh at it). Even though I felt that I had \"gotten over it\" and \"moved on\" there were little tendencies that I referred to as \"quirks\" or \"standards\" but were actually things more deep seeded. I realize that everyone is different, but please don't just try to forget it. Instead, try to remember how it felt not just emotionally but physically as well and while your brain is healing, associate those feelings with positive feelings. If you want to hear more about all this, or how to do it I can send you some helpful links if your interested. \nBut you're young, you obviously have a great head on your shoulders, and are going great places. Take measures to not let you feel like this again.. and not by not trusting. \n\n(SIDE NOTE: I'm sure I going to catch alot of shit for my grammar/punctuation... I'm a software developer.. english was never my strong suite and they don't expect it from us anyways. Please take it easy on me lol)",
            "Always paternity test. Standard!",
            ">I'll never forget that phone call from Emily\nE (Emily): Hey!\nM (Me): Well...?\nE: You're not the dad! You should have seen the look on your ex-roommate's face though! He's the dad, I didn't make this clear. Sorry!\n\n\n\nI think everyone that read this part was on the edge of their seats and when reading the last line jumped with some sort of excitement for you. Yes! Yes! Well done! Karma at its finest! ",
            "I'm really the only one who thinks this is fake? Sounds exactly like all the other fake /r/relationships posts that read like a creative writing assignment....too many pointless details.",
            "Sounds like you are dealing with this terrible situation really well , did you ever find out how long it had been going on .You are so lucky not to tied to the cheating bitch through the child .",
            "[removed]",
            "Happy Not-a-Father's day",
            ">tl;dr: She is pregnant! But I'm NOT THE DAD! Now to move on with my life\n\nI don't even know you but this brightened my day. Thanks!",
            "Dude, congratulations. Thanks for updating us! Good luck with everything from now on!",
            "That would kill me, is it that hard to stay faithful? There's a special place in hell for a girl like that (in you believe in that sorta thing) but hey, you were level headed and mature about it! Wishing you all the best!! ",
            "TLDR: Jasper has been posted in /r/aww - REJOICE",
            "Wow, now she's a 22-year-old pregnant college student. I hope she has fun with that!",
            "You've handled yourself amazingly throughout this ordeal just based on what you've shared with us (your parents did a great job raising you). You're going to make a fabulous teacher, too.  I'm so glad things worked out for you. \n\nThere's a book, Pronoia, the Antidote for Paranoia, that's a great read. Add that one to your list if your so inclined (it's one of my faves).",
            "Reading this, I was nervous right along with you. I was very worried for you she had managed to baby-trap you.\n\nCongratulations on the results and on your progress moving forward! I'm sure you'll do well.",
            "Ma nigga.",
            "God damn this is the happiest post I've read in a while, good for you man! She got what she deserved.",
            "Sorry bud, but I'm on the \"this is fake\"  wagon. No valid proof and an almost storybook narrative. Too fishy. ",
            "Delete Facebook, ~~lawyer up, hit the gym~~ DNA test, read more books.\n\nCongratulations!",
            "Jerry_Springer_Dance.gif",
            "So glad your not the father and she didn't rope you it into it. It just wouldn't have been a good situation. Enjoy your life man, it's just beginning!!!\nI wished, at that age, that I found out how to work on a cruiseship and see some of the world!!!",
            "Congrats!!\n\nPics of the kitten?",
            "Is she keeping it?",
            "Since you're not the father, it clearly was not a one time thing for them. My god the nerve of some people.\n\nBest of luck to ya! ",
            "Sir, can I just say you have done so well in dealing with this. When my ex of 5 years left me I lost it for a good year. If it were me I would have given anything to see the look on her face when she found out the father. You're a better man than I. Safe travels. ",
            "I just read all your posts. Wow. Very rarely do you get to see a story like that unfold. And the great thing is that shitty ass former roommate of yours is stuck with that shitty ass former ex of yours for at least 18 years financially speaking of course. And you get a fresh new start having cleanly cut away those shitty people from your life. Cheers to your new life",
            "Congrats OP. There was a camping story earlier I almost confused your post with. Paraphrasing-> boy and girl break up and boy goes camping with friends... meets new girl at friend outing. New girl puts the tip in, boy grabs condom, sexy time... boy got herpes from 5 seconds of no jimmy. don't be like the boy, it's a trap.",
            "Congratulations on not being the father and may good bones and calcium come to you",
            "Hey man, congrats on the good news (at least given the situation you were put in). You have some good friends, there. They both really stepped up in your time need. Make sure you do something nice for them as thanks, seems like they've earned it.",
            " You're a good person man. I wish you the best.",
            "Sorry for what happened to you, but good on you for moving the fuck on. If she finds a way to contact you in the future, never, *ever* reply.",
            "Dude, this is so sad. Yep, you should throw all these away and focus on your life ahead. You're still young :)",
            "It would have been better if OP and his friends went to find out the results. That way when he found out he wasn't the father he should have high five everyone except for his ex. ",
            "OP, this is fantastic.\n\nHappy not-a-father's day!",
            "go buy a fucking lotto ticket man, just to see how insane your luck is ! <3 :)",
            "Get an STD test if you haven't already.",
            "Good luck and carry on.",
            "Dude thats awesome news for you! If it had been yours what would you have done? I know what I would do... but I'm pretty evil when I'm angry.",
            "Is it confirmed that Ex-roommate is the father?  Or was it yet another guy's?\n\nAlso, unrelated, but \"millionaire\" isn't as meaningful as it was 30 years ago, Dr. Evil :P",
            "Got together too young and this was bound to happen eventually. Glad you arent the dad, have fun playing the field for a bit when you feel up to it. ",
            "So, what did your ex text you after the results?  Just wondering what she could even have to say?",
            "Protip: When on the campout with Trevor and Emily, don't have sex with Emily.\n\nAlso: I am so happy for you.  Have a great life kid.  You dodged a real bullet there.",
            "Oh man! I'm happy for you.  Now you get a chance to focus on yourself and everything you enjoy. One of these days, you'll meet a woman with her shit together and look back in relief.  Your ex and roommate will have a child that at least one of them probably doesn't want.  I wish you all the best.",
            "Damn man, so happy for you to comeback from this horrible situation! Hopefully you'll  enjoy your extra free time! Goodluck to you sir, may you actually find someone who loves you, remember that when she cheated on you she gave you away to someone else, someone better!",
            "Now we can focus on the truly important things in life:\n\n1) What position do you play in the baseball league? If you pitch, what is your arsenal?\n2) What have you been reading?",
            "Too bad Maury Povich wasn't there to announce the results. Happy for you. That's a huge bullet dodged. ",
            "I'm happy for you. You dodged a bullet and handled everything so well! I'm glad you had such a great support system too, that really makes all the difference. Just keep focusing on yourself. In time it won't seem like you're just trying to keep yourself busy, you'll just be doing things that make you happy. Also, Deaf Ed FTW! (And yay for getting Jasper!) ",
            "Oh my gawwwd you dodged a bullet! ",
            "Omg just wanted to say you dodged a HUGE bullet and you should be ecstatic. Everything happens for a reason and you'll find someone else better, sooner or later. It's pretty fucked up that she was excited when she heard about the pregnancy and hoped it was yours. I hope she enjoys taking care of a baby when she can barely take care of herself. I feel bad for the baby though.",
            "Post pictures of the kitty!",
            "Congrats man. You dodged that crazy bullet. You are also doing everything right to get \"over\" this relationship. \n\nKeep busy, stay strong brother. ",
            "You might not get this and my comment might get buried but I just wanted to say good for you, man. It makes me happy as a person to know you're doing really good especially after I saw your last post a while back. I'm really happy you are and i wish you alot of luck and happiness on your future endeavors!",
            "Holy crap, lm so excited for you man! Its the first time l have yelled in excitement for someone on reddit. Good luck, and lm sure you'll do well in life!",
            "Man, my heart sunk so many times during your updates.  What a damn horrible betrayal to experience.  I hope the wheel of time brings you an equal amount of joy in return for this.",
            "That's a long time for her to finally decide to do that shit. Good for you though. ",
            "Yeah, I'm gonna need to see that kitty. ",
            "Wow, what a ride.  A fantastic story though, in terms of the wonderful way you dealt with this, the incredible support of your friends, and sweet jesus what luck with the pregnancy turning out not to be yours.  ",
            "Love this update! You don't need that sort of negativity in your life and I'm happy to hear that you've started to move forward.\n\nCongratulations on a good outcome and best wishes to you for the future!",
            "Fuck yes. Dude I'm so happy for you. ",
            "Oh man I wish I could've seen the look on your ex's face. ",
            "Victory!\n\nWin!  This was an absolute WIN!\n\nThey thought they were having so much fun cheating behind your back.  Now they're stuck with each other for at LEAST the next 18 years whether their little love affair lasts or not.\n\nSweet, sweet justice.\n\nI am so happy for you, fellow redditor.  Good luck with everything.",
            "This is a classy Maury story. ",
            "Dude. I am so happy for you. Live your life man!",
            "Scariest shit ever never knowing if it's yours are not....by far some of the slowest and most gut wrenching hours to boot.  Good on you that it's not yours man, enjoy your life and lead a solid one, it's back in your hands now!  :-)",
            "This whole saga made me incredibly sad at first, but I'm so happy for you that you're not the father and have no reason to ever talk to this woman again. A somewhat happy ending to a fucking shitty situation. Good on you man. ",
            "Question, I had no idea dna tests exist while still pregnant. How does that work? ",
            "OP dodged a bullet",
            "Man this is some jerry springer shit",
            "This makes me so happy, I can imagine your joy must be tremendous. Congratulations, from one keeper of a cat named Jasper to another. ",
            "i'm not really one to talk about this sort of thing, and you may already know this, but you can't forget this happened. You can try and pretend it didn't happen, but you will always know the truth in the back of your mind. What i'm saying is that you need to accept what happened, and eventually get over it.\n\nIm not saying you need to face it now, but when you think you are ready, you need to mull this whole situation over. You need to look at this situation from different viewpoints and separate your thoughts from your emotions. When you do, it will hurt. Oh boy it will be painful! It will be as painful as it is necessary though. Almost like pulling an arrow from your chest. \n\nTime may heal all wounds, but we as people have very short lives, so in turn we must not run away from our problems. Right now you have an enormous chance to grow as a person. Absolutely incredible if you think about it. Many people never have this experience, and it may be the reason cheating threads are so popular here.\n\nI wish you the best, and although it may not seem like it, this cloud has a silver lining so take full advantage over it.\n\nsorry if this is old news.",
            "This is quite the life lesson and I appreciated that you shared your story. This was also quite the inspiring story that if you're down, always keep pushing forward. I hope you're doing well and good luck on your bright future!",
            "I just read all of your story. I am so happy for you to have dodged that bullet and you have all of your ducks in a row. I'm a fan of teachers and from your posts, you seem like a great person to be in front of students! I wish you the best!!!! :) ",
            "Wooo! Congrats! I'm so happy for you. I admire your strength. Good luck in all your future endeavors, man!",
            "Wow! Glad you got it all figured out before it turned into a future episode of Maury!",
            "This was an awesome recovery OP. Enjoy life like there's no tomorrow. Kudos to you and your future.",
            "[removed]",
            "Well I wish you the best of luck.",
            "Congrats on no kid.  Made me happy to read that.",
            "Poetic justice.\n\nI'm so happy for you. You're free!",
            "Dodged a bullet, OP. You live to see another day. :)",
            "Wow there's more drama on reddit than a soap opera, I love it ! so glad for you though, congrats on moving on and having so much support !:) ",
            "Wow - I'm sorry this happened to you man. I hadn't seen the other posts, but I'm super glad to hear you were mature and level-headed about the whole thing.\n\nI was honestly anxious as all hell, heartbeat increasing, and getting shaky reading the previous posts. Extremely happy to hear you're reached some closure and are moving on. \n\nWishing you all the best. :)\n",
            "Jesus, I can't even imagine the relief you felt! ",
            "I literally squealed with glee when I read you weren't the father. Congrats, OP!",
            "Holy shit, thank fucking god you're not the father. What a bitch!! Also I love how she was like \"oh it's a one time thing!\" yet now she's 3 months pregnant - obv her and your roommate have been fucking behind your back for a while. He's an asshole too",
            "Go, kid, go! Staying busy and working on yourself is absolutely the best thing to do in this situation. Yay, kitty! Yay, freedom from cheatin'-ass bitches!\n\nSource: had my heart ripped out by a cheatin'-ass bitch (ex-husband).",
            "Man. I am glad I kept up with this story! So happy for you man.",
            "Cheers bud! \n\nEnjoy the extra month of gold!! \n\nAnd congrats on NOT BEING THE FATHER!",
            "I had to read back through your stories and dillemmas after I saw this on my front page.\n\nGlad everything worked out. I know a bit how difficult it is and you seem to be handling it really well. Just think of it this way: she's now had a kid with another guy. There is no way in hell you should go back to that trash.\n\nGood for you standing your ground regarding g the situation and how awesome your friends are. You truly have it made, never lose that. I'm jelly regarding it. Stay awesome.",
            "Whoa! :)\n\nThat is quite an update /u/Nowwhat8989.\n\nDo you know if she kept the baby?",
            "Whew. You were lucky dude.",
            "This all turned out in the best possible way for you. I am glad that you aren't tethered to your ex for at least the next 18 miserable years.  Good luck to you and your future with Jasper.",
            "Im glad that things worked out for you! I am so glad you just dodged that gigantic life destroying bullet. ",
            "That was a great update. Glad you're not the father.",
            "Celebrate!!  I am so happy you're not the father and that things are looking up.  My husband and I have been together  the same amount of time you and your girlfriend had been.  I'm just a couple of years older than you.  I can't imagine how painful this must have been for you, and I can say there's no way I would have handled it as well as you did, even with an awesome support system.  I'm do happy the fetus isn't yours, that will make it so much easier to move on.",
            "Mate, your clear focus and drive had gotten you through this crap. As well as your friends, don't forget them!\nWell done, you're truly a resilient bloke!!!",
            "This thread only needs to be filled with Maury/Springer \"YOU ARE NOT THE FATHER\" gifs",
            "Hey, show us your kitty ;)) . And I really wish you the best man, focus on your carrer and best of luck!",
            "I'm in class and almost yelled in joy reading that your roommate got her pregnant. I know it sucks, but honestly this is the best way to get revenge without you yourself doing something. And you are handling it well. I am 21 so we are not far apart in life and I think you are in a great position to put this behind you and have an even better life than you imagined.",
            "Fucking yes. ",
            "You've got it good now. Keep focused and keep working towards your goals. Congrats, mate.",
            "11 weeks? Well, looks like what you walked in on wasn't \"a one time thing.\" Big surprise, I'm sure. \n\nI'm sorry you had to go through this hell. Now you can put this into your rearview mirror and (hopefully) eventually get to a point where you can go an entire day, and then week, and then month, and so on without thinking about this. Good luck.",
            "This isn't a loss. It's a success story. ~~Bullet~~ Canon ball fucking dodged. ",
            "Oh,  man. You went from shitting bricks to shitting rainbows. \n\n This is one of the best updates ever.  ",
            "When I read that you weren't the father, I literally yelled \"YES!\"\n\nThank god. I'm sorry this all happened to you but man you couldn't have had a better outcome. ",
            "I guess having good luck is the next best thing to having reproductive rights. Congratulations.",
            "Post the link of Jasper in the comments! And congrats on moving on dude, it's only gonna get better from here :)",
            "Congrats Man. Your story is the one that has caught my attention the most out of all the /r/relationships posts. I'm really happy things are working out for you. I wish you the best of luck in the future. ",
            "What can she say, she likes (22M)s",
            "Yay for reading more! Download goodreads app it's the best!",
            "Virtual HIGH FIVE",
            "Congratulations! I was wondering if you were going to ever give an update and this one was a great one. Glad to hear you are not the father and have moved on. Cheers!",
            "This was one of the very few times I've been searching a sub for a specific update. I'm glad you didn't get screwed over. Fuck yeah. \n\nGood luck with studies. ",
            "[removed]",
            "I was thinking there was no baby. Very glad it's not yours. You dodged all guy's worst nightmare. Yahtzee",
            "Jasper is the winner!",
            "Hey, I'm almost certain that I read the original story much earlier than in the middle of April... Is the whole thing really only 35 days old, or am I confusing dates?\n\nCan anybody confirm?",
            "Okay, I just read through all three and I have one thing to say:\n\nGood on you for cutting out that crazy. In your first post it sounded like she had only slept with him once. Not that it was an ongoing affair. Cheating once? I might be able to work through that, despite all the trust issues. But an ongoing affair? Bahaha no. Good on you for kicking her to the curb.",
            "The best advice my Dad ever gave me, \"don't stick your dick in crazy\"",
            "It sounds like you dealt with a  truly crappy situation as well as you possibly could. Good luck to you, good riddance to her. \nNow, where can I find a pic of this kitty? :)\n ",
            "I wish I could give you a celebratory hug right now; congrats!",
            "WAIT...but it was JUST ONE TIME...  I'm elated for you man!  You dodged a HUGE bullet and the Universe has smiled down on you with favor!  ",
            "You dodged a bullet like motherfucking Neo.\n",
            "PATERNITY TEST!!!",
            "Bro you just dodged a huge freaking cannon ball!!! Congratulations!!!!",
            "good for you dude",
            "Dude that is really great too hear! Been following your original post and the subsequent updates:)",
            "Shit man, can I buy you a beer? Are you anywhere near Michigan or Ontario? I'm serious.\n\nWhat a fucking rollercoaster. I'm glad you're not the dad. Maybe kids are in your future, but you want them to be with someone that you can count on every single day. You seem to be doing pretty alright. I hope you continue doing the same. Best of luck to you pal.",
            "Lol holy shit, op.",
            "OMG! So glad you're not the dad. Your Ex made her bed, now she has to lie it in.. She totally **lied** about it being a \"one-time thing\"..\n\nYou're a good man in the storm, OP! Best wishes going forward!!!",
            "Congrats on dodging a major bullet. You almost got stuck with this person between the proposal that never was and the baby that isn't yours",
            "This is the best post of all time. You rock op!",
            "I demand kitteh pictures.",
            "fake or real who the fuck cares youre not the dad",
            "Wow if you really wanted to get to her you could send her a picture of the ring you were going to ask her to marry with!",
            "wow. I hate that she put you through all that, but I'm glad you're moving on the bigger and better things.\n\non an unrelated note, that's really cool that your into Deaf education. Some of my friends are actors and were just in this play called *Tribes* by Nina Raines. I think as an educator, this play would speak to you and your students, a boy who's born deaf into a hearing family (family has no interest in learning any sign language) is introduced to the deaf community when he meets a girl, who can hear and was born into a deaf family but is losing her hearing. A lot of the local deaf community appreciated their story being told through this medium, and it sounds like something you might like.\n\nSorry for the tangent at the end- I get carried away when trying to pass on other pieces of literature to others. Have a good life man!",
            "It's so weird how she is so animated when informing you that it was the roommates kid. It's almost like she thought the whole thing was all humor to her. I guess when you're rich, everything is no big deal",
            "OP I'm so sorry this happened to you. Try to find happiness with the fact that if you hadn't come home early that day she would of claimed the child was yours.\n\nAlso be happy your ex-roommate is stuck with a child and a crazy bitch now.",
            "Some people are saying this is karma...but damn, that poor kid. She's excited now but she's only 21, she'll be in for a rude awakening once the kid is born and motherhood is a reality... Not that it's any of OP's business, he dodged a freaking missile, but still. "
        ]
    },
    {
        "post_id": "ap8ipb",
        "author": "goodnewley",
        "title": "Update: My [25 M] boyfriend’s [26 M] anxiety comes out severely during intimacy.",
        "url": "https://www.reddit.com/r/relationships/comments/ap8ipb/update_my_25_m_boyfriends_26_m_anxiety_comes_out/",
        "score": 5278,
        "num_comments": 60,
        "created_utc": 1549833310.0,
        "selftext": "Original post [here](https://www.reddit.com/r/relationships/comments/am3mwy/my_25_m_boyfriends_26_m_anxiety_comes_out/). \n\nI'd like to begin by thanking everyone who left some input; I was overwhelmed by the response. Just know that I did read every single comment.\n\nIt hasn't been very long at all; I know that. And I truly don't know what the future holds. But here's what has happened in the past ten days or so. \n\nI admit, I should have talked to Charlie earlier before heading \"to bed\" again, but I was embarrassed about broaching the subject and still ruminating over the advice. \n\nAnd so, his anxiety flared again during sexy time that night. Rather than immediately falling into comforting him, I began asking him why he was feeling like he was and resisting the instinct to \"make it all better.\"\n\nIt was a little more tough love than I've ever been with him (and we haven't been together all that long), but it got him to open up. \n\nI did flat-out tell him (in a nice way) that this was getting in the way, that we had to solve this sooner rather than later, and that I didn't like him accusing me of being untruthful in-bed. \n\nAnd he responded to that, apologized, and agreed that we could not go on like this.\n\nWhat actually started coming up as we talked were some things I hadn't considered. \n\nHe was tired at the end of work, distracted by stresses from earlier in the day, finding it challenging both physically and mentally to stay focused and creating this self-fulfilling prophecy, where the fear of being distracted and unable to be a satisfying partner was doing just that.\n\nHe was also very embarrassed to not be in the mood sometimes, and I do think that was tied in to the \"failure\" mindset. If he didn't feel like getting going, he was failing me as a partner. I asked him to be open with that.\n\nI also told him that we didn't have to go all the way every time if there were other ways to enjoy the moment. \n\nAnd then on to concrete solutions. \n\nLong story short, Charlie and I have spent the last ten days or so just relaxing together at night and reserving early mornings for intimacy (thanks, /u/NerdWithoutACause). Less stress, less fatigue, and it's been a rather amazing physical solution.\n\nNo anxiety flares yet on this revised schedule, when we can do it first-thing and not be under the stress of a long day. But time will tell if this will keep up, I suppose.\n\nCharlie did have therapy three days ago, and he allowed me to look at the notebook he had brought with him. \n\nHe'd brought this all up, and there were some more \"in the moment\" solutions for when his anxiety flared. He's been very open about making the greater effort to control his symptoms on his own without relying exclusively on me.\n\nWaking up to him this morning, he also rather bashfully told me he was feeling under the weather and would prefer if we just cuddled. So we did. And other PG-13 stuff eventually came. It was nice, and I think I have hope.\n\ntl;dr: Resolved to stop comforting boyfriend in bed when his anxiety flared, and realized that outside stressors were part of his flares. We do it in the morning now when there are less of those stressors, and he's working harder in therapy and being more vocal about what he's feeling in the moment. I'm a happy camper for now. \n\n\n",
        "permalink": "/r/relationships/comments/ap8ipb/update_my_25_m_boyfriends_26_m_anxiety_comes_out/",
        "comments": [
            "This is an excellent update. You're a great partner.",
            "I recall your original thread, and this update is wonderful! The ideas of how we *should* be sexually rarely help us. Here's to continued enjoyment for both of you!",
            "This is wonderful to read. Congratulations on making your needs known, congratulations to him for seeking professional help, and congratulations to you both for mutual open communication. If y'all continue to treat any issues down the road like this, then you'll be a very successful and happy couple. Best of luck to you both. ",
            "This is such a good update!! Great job, OP, and I'm proud of your BF for opening up and being willing to work on his anxiety too. ",
            "that sounds like an excellent resolution. I think there's a lot of toxic stuff around men's sexuality, about always being \"on\" that can cause people to put up unnecessary defensive barriers around their sexuality. Creating a space where honesty, pleasure, and intimacy come first is a great step. Keep up the open and honest communication, and make sure you don't accept him slipping back into using you as a sounding board for his insecurities.",
            "So nice to hear a positive outcome! This sounds like real progress. ",
            "The best sex comes from good communication and lots of listening. You guys seen like a great couple and I am sure Charlie feels really happy that he can be open with you about who he is and what he wants and needs in this relationship. Best of luck to you both. I wish you only love and happiness in the future.",
            "So happy for you guys!!",
            "I'm so happy you guys are figuring it out!  It might end up being a continuing issue, it is still with my husband and I, but we have a great relationship and it's worth the work.  You're a great partner.",
            "What a great update and example of positive communication in a relationship. Best of luck to you guys!",
            "That's awesome! Reddit is good like that sometimes.....",
            "You should both feel proud for overcoming that hurdle. It gives you a great base and you  two obviously have the skill sets to face any future issues in your relationship.  Kudos.",
            "Aww so happy for you guys! Keep it up!",
            "I am so proud of you guys.",
            "This is amazing progress! Kudos to both of you, and thank you for the update!",
            "So happy for you both!! ",
            "This is so beautiful to hear. You guys are really doing a great job addressing the problem and communicating. I’m sure his therapist already told him this, but he should look into meditation. There are so many great apps out there that you can download and then just put headphones on, shut the world out, and calm down in just 10mins. Blood pressure lowers, your mind clears, your nervous system resets...it’s really powerful stuff. This would be helpful not just with the sexy time stuff, but as a way to manage his anxiety during the day or when he comes home. The happiest and calmest people I know all use meditation/mindfulness techniques to deal with stress. It really changed my life in every aspect! ",
            "Well this is great to see! Hopefully it continues ",
            "10 points to  Gryffindor!!!",
            "This is wonderful - you both are doing such a good job of opening up communication, and doing the hard work. This will serve you well over the long term! Best of luck to you guys!",
            "This is so wholesome.",
            "Love great updates like this. ",
            "Congrats to Charlie and you both! You’re an amazing partner who understand a relationship doesn’t mean you two fit until you don’t, but rather we are all humans and have to work to mend our lives together sometimes. Amazing update, thank you!",
            "Reading a happy update always puts a smile on my face.",
            "This is encouragingly positive, and kudos to you for getting a grip on a difficult situation and applying positive solutions. \nIt’s stories like these that make me read this group so faithfully. ",
            "It sounds like you both handled this really maturely, nice work! I hope things continue to improve for you both :)",
            "I had some pretty bad ED in bed. Constantly worrying about everything and it just wouldn't work. My penis doctor gave me viagra so I used it a few times and got a lot more comfy in bed. Everything was fine after that.",
            "This is one of the best updates I’ve seen - I’m so happy things worked out for you two without there having to be a big breakup. ",
            "Good for you! I have a partner who copes with anxiety, and is only starting to learn about caring for it at twice the age...so good for your BF, too!\n\nI know exactly what you mean about walking the line between comforting, or tough love, too. It still feels like an in the moment judgement call, to me. You sound really astute and tuned in, but funny beat yourself up if you flub it sometimes. There is emotional workload in partnering people with mental health challenges, it can't be glossed over.\n\nMy own boundary surrounding this - after less successful previous relationships - is that he must be working on it everyday. Self care, always. I get pretty out of patience when that stuff starts too fall by the wayside, with predictable results. He knows this explicitly, and we review it when necessary.\n\nGood luck, your guy sounds genuine about improving this dynamic for himself and for it's impact on your relationship, and that's worth a LOT, truly.",
            "this is great you give him some space to figure this out and offering him support in the same. Wish to have an understanding partner like you. ",
            "This is awesome! Solutions are out there when you both want to work on them. So glad you're feeling hopeful. Sounds like going forward you have a path to tame anxiety. ",
            "Great solutions all around. \n\nI would keep an eye out to ensure that your libidos actually match. It's possible he has a really low libido and feels guilty about that. \n\nI also prefer sexy times in the mornings. I have way more energy and I'm not burnt out! ",
            "Such a nice read in the morning I'm crying",
            "I have PTSD from some child hood sexual abuse. Sometimes I would be afraid of whether my wife actually wanted me, and it would cause me lose confidence and be afraid to touch her due to being afraid of rejection. It took so many hours of therapy and one on one talks to get to where I understood a great loving relationship.\n\nOP, it's great people like you and my wife that can bring out the best in their significant other. ",
            "Nice work. However I fear that this is a sign of underlying sexual incompatibility. Good luck and so wish you the best. ",
            "Very wholesome and cute! ",
            "What I have learned from living with insecure people is that sometimes when you think they have solved some problem, another problem comes up. If he is willing to do therapy, it would be great if he could do it for some time.",
            "Big wholesome.\n\nGlad that y'all are working through this together, OP.",
            "That's awesome. My partner and I are still learning how to please each other with out the stress of finishing or not being in the moment. It's nice to see other couples working it out too and communicating. ",
            "Your understanding and willingness to try and figure this thing out and make it work is heartwarming. I've had tons of anxiety issues during sex in my life, that self-fulfilling prophecy as you called it can be infuriating, how the simple idea of not being able to perform in bed is the catalyst that ruins everything on a night to night basis. And then losing that battle in your own mind forces you to live that reality that was only in your head a second ago. \"See, you CAN'T get it up, you CAN'T perform, you're not a MAN.\"\n\n&#x200B;\n\nHopefully through time and effort this issue will subside more and more. You're a good girlfriend.",
            "I hope he will realize how lucky he is in having a person like you in his life.",
            "Maybe I'm just cynical but this still seems like an awful lot of conditions and emotional labor and hangups to navigate just to have sex with your partner. Charlie sounds like too much of a fixer upper. Probably a good person, but an exhausting partner. ",
            "[deleted]"
        ]
    }
]