[
    {
        "post_id": "3hw1jh",
        "author": "whenlifegivesyoushit",
        "title": "[UPDATE]My [26 F] with my husband [29 M] 1 year, he has been diagnosed with terminal cancer, how to make it count?",
        "url": "https://www.reddit.com/r/relationships/comments/3hw1jh/updatemy_26_f_with_my_husband_29_m_1_year_he_has/",
        "score": 11046,
        "num_comments": 878,
        "created_utc": 1440187622.0,
        "selftext": "[Original Post](https://www.reddit.com/r/relationships/comments/3dheie/my_26_f_with_my_husband_29_m_1_year_he_has_been/)\n\nSummary of Original Post- My husband was diagnosed with terminal cancer. After failure of chemo and other treatments, he was told he has about a month to live. I asked for advice on how to make this time count and all of you wonderful people gave some very good advice.\n\n\nLet me begin by saying that as much as I was day dreaming that I'll get to update everyone of a miraculous recovery my brave darling made, I had to wake up to the bitter reality. My husband passed away a few days ago. And just as a lot of you had warned me, with all the preparation in the world and a warning that not many are fortunate to receive, absolutely nothing about when it actually happened felt like I was at all ready. It may as easily have been sudden. He fought bravely to the end and I'm proud of his attitude. I'm happy he doesn't have to suffer and put on a brave face for me anymore.\n\nI'm here to thank all of you. Despite what I said above about not feeling prepared, I do feel blessed for having got that time. We may not have completely finished \"the list\" but we sure got to do some of the things that the busy preoccupations of life in all its cruelty snatches from a lot of people. We may not be completely without regrets but we managed to make our list of 'I wish I had's a lot shorter than it would have been before the warning. So here I am to thank everyone who commented/replied/PMed on that post. It meant a lot to both of us. A sincere thanks to all of you.\n\nA special shout to a few people:\nu/mistyranch for courage and sharing \nu/mcdie88 for making me feel like a 100 years old (covered that milestone too as he insisted I will live his share too!)\nu/tacofugitive for looking out for me\nu/aaoun responsible for some high quality home made porn\nu/dahlialia who irritated the hell out of my husband as I wanted answers to ALL the questions\nu/emalen thanks to whom I thought about this part, the coping\nu/whatsleftisrigh for instilling some pragmatism in me\nu/ianoftawa thanks to whom unfinished business won't be an issue\nu/brandyelf who made X'mas come early this year\nu/tenebrous1 who inspired a letter that I haven't been able to read past two lines of\nu/emlgsh whose words rung in my ears to keep me stronger on the bad days\nu/throwyourtoothbrush without whose advice I would have tried to do it all on my own and made a mess for sure\nu/tomyownrhythm who sure knows how to turn a good spin on the dark moments\nu/daivyjones for the immense support\nu/WeltallPrime for inspiring my very first novel\nand so many others for all the wonderful advice, support and most importantly for sharing your stories, I can't thank you enough. I'm sorry I can't mention all of you here. Please know how much every word meant to me.\n\nHere's an update of all the things we did end up doing (and I hope this will help someone else like us out there):\n1. As suggested by a lot of you, pictures and videos. I have loads of data of him doing his daily chores to just snoring away next to me. And I still don't think it's enough. Do this, you may not have a warning, you may regret it if you don't. A little background of me here, I've always been anti pictures, I would proudly say make memories not photo albums and that if something is important enough, you'll remember it. While I still stand by that to a certain extent, I do condone finding that balance. I would charge my tab, turn on the camera and put it in our room. So I could enjoy him and then re enjoy our moments later. And we made the heavily suggested naughty videos as well. Fair warning, getting closure is important so don't get drowned in these memories either. It's too soon for me but I do understand the risks and will look out for myself.\n2. Which brings me to my next point. Discussing the future. As much as one would want to avoid thinking about a life beyond the one they love the most, not thinking of it will make it that much harder when it inevitably comes. Here's where all the advice on being practical was executed. Practicality on financial and emotional fronts; financial being having ALL the financial information including account numbers, passwords, life insurance policy details, wills and any debts and the latter being arranging for a therapist and talking about expectations from a partner after one is gone and discussing the kids futures, if any. He documented all the financial information and verified it twice, taught me how to access his bank's site and wrote down a step by step guide on how to get the insurance money once he was gone. He wrote a letter addressed to my \"next spouse\" with all the not so easy to discover things about me that were wonderful and necessary, in his words. \n3. I wrote a book about him. I'm an aspiring author and I'm proud to say that the love of my life is the sole reader of my only book.\n4. Scrapbook. This was so fun! I collected screenshots of the best and meanest things we've ever said to each other, printed those, interspersed those with our pictures over the years in chronological order (starting with the cliched obligatory baby pictures), threw in a few lists I wrote out of top 9 dates, top 9 best sex, top 9 reasons I love him (both our birthdays fall on 9th) etc., mixed in a crossword puzzle he had to solve and our scrapbook was ready!\n5. I named a star after him. I know this is slightly silly but now I can look at him whenever I want.\n6. Needless to say, indefinite time off work, spent every waking moment in his arms and sleeping moment in his tightly wrapped arms. Yes, lots of cuddling and just being together.\n7. Balcony picnic. This was an excellent idea. Stars, candlelight, good food and some good old fashioned open air sex\n8. Speaking of which, lots of sex. \n9. We discussed with his doctors and freezing his sperm was not a possibility at this stage so that couldn't pan out. \n10. The last life party. I wanted to call it The party that never ends but he played the cancer card so I was shot down. All his friends and family came over, everyone said a few things about and to him, nobody was allowed to cry, I told them I was spending a lot on the funeral and he was stealing my thunder by being a tear hogger. It was actually pretty nice with gag jokes from his goofy friends, something like a Halloween with a ghost attending but he's friendly like Casper rather than being creepy/scary\n11. Told him I loved him, constantly. And anything else that came to my mind that I wanted him to know! He was quite a sport about it and returned the favor.\n12. We played cards together, watched football matches and his favorite shows together. Things he loves. Casually holding each other.\n13. Festival week- a day designated to all the festivals. Milestone birthdays- video recording for each with a message \n14. Cooked his favorite meals for him. He was my happy helper. He'd wash the tomatoes and I'd make the lasagna. He called me the food conjurer.\n15. Made him wear his favorite shirts for several days so now they'll smell like him for some time.\n16. Knit him a sweater, made a portrait of his\n17. Things very specific to him that he wanted to do- a small bucket list that I won't bore you with\n   \nI feel like I've lived a lifetime in the last month. The quote about living each day like your last got realized. I made a lot of memories I'll never forget. \n\nI want to say one more thing before I sign off. All those who have been patient enough to make it to this part of the post or impatient enough to skip to this part, thanks for reading. I have read a lot of things on this sub and unfortunately a majority of the things I read are escapist, overcautious and pessimistic. While I encourage the right of one to protect themselves from potential hurt, I do find the world hiding behind that right shying away from happiness and condemning others at the drop of a hat. Not meaning to sound preachy or claiming to know anyone's personal situation, I do wish to say this..believe in people, believe in goodness, believe in second chances. My husband and I didn't have it perfect, we had our rough patches and forgave each other for mistakes if the other truly showed repentance for them. I could have left him long back and I would have been in the same scenario I am today, leading a life without him. The difference is I would have chosen that in the former scenario whereas now I have to accept the situation. And being here I know I would give anything in the world for that choice right now, I'm so glad I was wise enough to look past his tiny flaws and  fill my life with moments of the absolutely wonderful loving man he is (was). Be vulnerable, take risks, get hurt, it's part of being a human and it's ok. As long as you're not being downright stupid, harming yourself or those around you irreparably and not being codependent enabling someone's flaws rather than accepting them, it's ok to make mistakes, that's how we learn and grow. And on the chance that it's not a mistake, the potential upside is limitless.\n\nIn the comments of my original post, a lot of you wrote that you cried and told your SO you loved them or gave them a random hug much to their surprise. I'll admit that those comments made me happier than anything else. That our story could inspire some bond somewhere to get stronger was the greatest compliment. So I request anyone reading this to do this today. Give your SO that surprise hug, tell them you love them. I wouldn't wish what we went through on my worst enemy and I'm still glad I got that time. But most of you won't. THIS time is that time for you. I'm sorry that for most of you, it will be sudden/painful and prolonged. Living your life like each day is your last is impractical. But living your relationship like each day is your last is the easiest and most comforting thing in the world. Hug them, hold them, tell them you love them... Cheers to all the love in the world.\n\nThank you all once again. \n\n**tl;dr**: My husband passed away, this update is to thank all of you for your wonderful advice and support\n\nEdit 1 : Thank you once again Reddit, for all the overwhelming response. Thanks for all the tears, all the hugs and all the support. Thanks for the PMs offering more support. And above all, thanks for our story helped make a difference in your life. I'm so grateful to each of you who's vowed to work on their relationships and love their partners more. I'm trying to reply to each one of you kindhearted folks, apologies if I have missed out on anyone. Thank you for being with me in this time. Your thoughts, prayers and support means a lot to me.\n",
        "permalink": "/r/relationships/comments/3hw1jh/updatemy_26_f_with_my_husband_29_m_1_year_he_has/",
        "comments": [
            "I cried reading this post. This update is so beautiful, thank you for sharing. I don't have the right words to say how I'm feeling after reading this, but I wish you the best. ",
            "Please never delete this post. I want to save it and re-read it again when bad times strike",
            "This is so beautiful, thank you so much for sharing this. Your husband got to live the last month of his life surrounded by so much love and happiness. The love the two of you shared and will continue to share, even after his passing, is a testament to all that is good and beautiful and magical in this world. \n\nI want you to know that your words about taking photos and videos really hit home for me. I'm not a big picture person either, but I'm going to go home and take photos of my husband sitting at his computer, eating ice cream in that adorable dopey way he does, cuddling with our protesting cats. \n\nI am so sorry for your loss, and thank you again for sharing this part of your life and love with your husband. ",
            "At work in tears right now.  Husband and I have had one hell of a tough year and sometimes it's left me wondering if all this pain is worth it.  I'm going home to take him to our favorite hole-in-the-wall Thai place and out for a night walk in the woods.  \n\nI'm so sorry for your loss.  Thank you for reminding me what's important.\n\nEdit:  followed through with my plans.  After eating we went to the trails that we first kissed at (I brought a flashlight) and we made love like desperate teenagers and laughed at the thought of getting an indecent exposure misdemeanor (we are both fairly respected professionals and way too old to be doing that; I'd highly recommend it). It was the best night either of us can remember in the last year.  Thanks again OP.",
            "[deleted]",
            " #5 made me smile =)\n\nI'm so sorry for your loss. It sounds like you made the best you could of your last month together. ",
            "wow...did this ever choke me up. Now I have people looking over my cube wondering why this grown man has tears in his eyes......stupid onions!",
            "Thank you OP.  ",
            "I am so sorry for your loss, but very happy you were able to have those moments together. \n\nWhen you're ready, you may want to visit /r/widowers.\n\n{hug}",
            "Again i post a favourite quote to comfort the bereaved.\n\n\"How lucky am i to have something that makes saying goodbye so hard?\" - A.A Milne (Winnie The Pooh)\n\nSo sorry for your loss.",
            "My boyfriend of three years is a cancer survivor, and more than anything I'm afraid his cancer will return. He's been through ten years of surveillance, at the end of which he was declared cancer free over five years ago, but I'm just so terrified it will somehow return and I'll lose him.\n\nYour post had me sobbing. If the worst should ever come to pass, I hope I can bear it with as much grace and love as you have. I wish you all the best for your life going forward; I hope you find happiness again after this dark time. My thoughts are with you.",
            "Wow, you are an inspiration of a human being.  Just everything you wrote was so beautiful, so strong, and so full of life.  It's great you got to do those things and can now cherish what you created together.  Best wishes for the future, make it the best you can.",
            "[deleted]",
            "I'm gonna go give my SO a hug right now. I'm so sorry for your loss.",
            "I just bawled like a baby. I'm sorry your time together was cut short, but I'm so happy that you had the time you had together was wonderful - especially that your last month was so memorable.",
            "I did not sign this permission slip for the feels trip I'm on right now! You are a wonderful human being and only deserve the best in your future.",
            "I've been having a rough time with my SO lately and one of my biggest fears is losing him before I'm ready....if someone could ever be ever ready. This post and your story helped me forget that fear and let the love in. It seemed that  \"what if\" was outweighing the \"what is\", but not anymore. Every moment is a gift. \n\nI'm so sorry for your loss. You sound so strong and incredibly grateful for every second spent with your husband. I wish you the best. ",
            "I'm sorry for your loss. It was very heartwarming to read that you accomplished all those things with him before he passed. You now have loving memories forever. I wish all the best to you from now on.",
            "This is simultaneously the saddest and most touching /r/relationships update I've ever read. Thank you so much for sharing.",
            "I think I've cried two times for the past five years. Once when my grandmother died and this one.\n\n\nSuddenly all my problems and trouble in life feels like nothing... I wishes you the best, and may your husband be in a better place. ",
            "I'm so sorry for your loss, OP. Glad to hear you made what time you had count.  One thing I wanted to throw out there about the stars (I did the same thing for my sister before she passed, because she and I used to joke about them) The place we went through offered things where you could have the name and star coordinates engraved. I know it's cheesy, but we did necklaces for the kids (my daughter and my nephew were 8 at the time) and my mom, and we did Christmas tree ornaments for all of us (because Christmas was her favorite). Well, the necklaces are long since gone, but the Christmas tree ornaments... There's a nice moment of quiet and reflection each year when we hang them.  That's not to say we don't think of her often, but it's been six years for us and it's not quite as in-the-forefront as it used to be, and we all seem to find that extra moment of thinking of her every Christmas comforting.\n\nI'll say a prayer for you (positive thoughts, if you prefer). Take care of yourself.",
            "Where am I supposed to hide all those feels?\n\nYou stay strong, good luck.",
            "I had to stop in the middle of reading and come back to finish because I started crying. You are a beautiful person, and I thank you for sharing the joy you experienced with your husband during his last days. I'm very sorry for your loss. I hope you take a tiny bit of comfort in knowing that you will inspire so many people to reevaluate the important things.",
            "[deleted]",
            "I cried. I cried a lot. And I am simultaneously so sorry you have had to (and will have to) endure such grief and anguish, and so glad you got the chance to live a short while with such love and acceptance. You have truly made the most of the life you were both given, and I can't tell you enough how amazing that makes you.\n\nAs a stranger on the internet you will probably never meet, I wish you only the best in your life to come. Keep living to the fullest, for him and for you. ::Internet hugs galore::",
            "this is absolutely beautiful.  I'm so sorry for your loss but thank you for sharing your story with all of us.  Publish that book!",
            ">Not meaning to sound preachy or claiming to know anyone's personal situation, I do wish to say this..believe in people, believe in goodness, believe in second chances. My husband and I didn't have it perfect, we had our rough patches and forgave each other for mistakes if the other truly showed repentance for them. I could have left him long back and I would have been in the same scenario I am today, leading a life without him. The difference is I would have chosen that in the former scenario whereas now I have to accept the situation. And being here I know I would give anything in the world for that choice right now, I'm so glad I was wise enough to look past his tiny flaws and fill my life with moments of the absolutely wonderful loving man he is (was). Be vulnerable, take risks, get hurt, it's part of being a human and it's ok. As long as you're not being downright stupid, harming yourself or those around you irreparably and not being codependent enabling someone's flaws rather than accepting them, it's ok to make mistakes, that's how we learn and grow. And on the chance that it's not a mistake, the potential upside is limitless.\n\nMy boyfriend and I just went through one of the roughest patches in our relationship. We almost broke up, twice. But we still came back to each other. I am so, so sorry for your loss. But just know that in going through this and sharing these wonderful words with us random people across the internet, you have made me (and I'm sure many others) so much more grateful for the man in my life, in spite of his flaws and mistakes. \n\nI watched my mother go through the death of my father and I can tell you that it's very difficult. But in her words, something good always comes from something bad. And I think one of those goods is that you have touched all of our hearts today with the love you have for your husband. Good luck on your journey and my sincerest condolences. <3",
            "Thank you for the post!  I'm in a similar situation and have been looking for more ideas of things I can do to comfort my partner and close family before I am gone. \n\nWhile I don't have a specific timeframe (such as a month, 2-months, etc.) I have been back on chemo which started in July 2014 and will remain on it until it stops working or my body can't handle it (it's really unpleasant to have to go in every other week and be out of commission for 5-6 days after each cycle for over a year). Recently it looks like it may be close to that point; although I'm hoping it isn't.  My diagnosis was a couple years ago and is stage-4 metastatic colorectal cancer (with a specific mutation which makes it particularly difficult to treat as it doesn't respond to targeted treatments that have been researched yet).  Following a major surgery and hospital stay, and after my first time on chemo a couple years back, things were good for a little until it continued to grow and spread to the point of having to go back on treatment last year. \n\nI really don't have a fear for myself when my time is up. My biggest worry is my loved ones I am leaving behind and making sure they are alright. It's really difficult seeing and knowing how difficult this is for my mom to see me going through this as well as my significant other and my mom's partner. We are all very close and I really want to make sure I can do things to help them before and after I'm gone. \n\nI've already been doing some of the ideas on this list and am continually looking for anything else that might help as well. ",
            "Keep writing, OP!  Whatever you do from here on out, just keep, keep writing!",
            "You are something else. I haven't lived because I never experienced a love like this. You taught me something today. Thank you.",
            "Beautifully written. I teared up big time. Good luck to you.",
            "I was able to hold it together until you listed keeping his shirts to smell him in the future. That image just kills me. I'll keep you in my thoughts, I'm so impressed at your strength in all this and will be joining everyone else in voicing my appreciation for my SO tonight. <3",
            "Your post made me cry and my SO asked me what happened. I wish I could give you a big hug. I wish you the very best. <3",
            "That was a hell of a read. I don't even know what to say; what the hell *does* someone say after reading this? Holy hell. \n\nWherever you go next in life, good luck OP. ",
            "I can't imagine any better way to honor your husband than what you did for him in his last month. The best part of this is you know that he passed an incredibly blessed and happy man because of you.\n\nAnddddd... now I'm crying at work. Thank you for writing this.",
            "> 15. Made him wear his favorite shirts for several days so now they'll smell like him for some time. \n\n**:(**\n",
            "As a woman near the same age as you, your perspective is inspiring and your courage seemingly unmatched.  Your talent as a writer is incredible, but I could feel the love coming from you and your husband.  \n\nIts interesting how fast this brought me to tears, but in such a positive way.  \n\nThank you for sharing this.",
            "In the bathroom crying at work because this is just simply, utterly beautiful and tragic all at once. Your words and memories here are just stunning to read and a perfect reminder to the fragility and perfection that is this mess called life. What you and your husband were able to create together in this time is really inspiring to how I want to live out my own life. I've thought many times about your first post these last few weeks and I hope you'll be able to find comfort as you grieve because of all you got to experience with him. Best of luck to you as you move forward, I know how proud your husband is of you now for all the good you've been able to give back to us through your story.",
            "Thank you for your update OP. MY face is streaming in tears. Your husband sounds like he was a wonderful man and i'm glad you were able to make so much of your remaining time together. Bless you.",
            "[deleted]",
            "I cried through all of this, and I keep having to assure everyone that I'm fine and just reading something sad and lovely. Damn this open office plan!\n\nI'm so sorry for your loss, but so happy that you two were able to have all of those wonderful moments together. The way you guys handle this with love and laughter is truly inspiring. \n\nThose last two paragraphs resonated with me so deeply. My boyfriend has been out of the country visiting family for a few weeks, and he's going to be slightly startled by how hard I'm going to hug him when he comes home tonight.\n\nThank you for sharing this with us, and I wish you the very very best.",
            "I'm sorry for your loss. This was touching to read and I'm glad you two spent such quality time together before his death. What stood out the most was his letter to your next spouse. I couldn't imagine doing something like that, let alone give my blessing for my partner to seek love after my passing. Good luck in the future.",
            "[deleted]",
            "Yep, count me among the people with a very wet face right now. I can't imagine what you must have gone through, but the love you both shared shines through and I'm glad you got to make his last days on Earth as special as possible. ",
            "I'm so sorry for your loss, but I am very happy that you had the time to spend with your spouse before he passed. I think it's wonderful that you made so many memories in such a short time, and very inspiring! \n\nI wish you the best in life OP :) take care of yourself. ",
            "You're a good wife, a good woman, a good person. You made it easy for him, you made it good, you made it happy.\n\nNo, you both did. <3 \n\nThank you, sincerely, for being so loyal and so loving to the one you found love with. When you do move on, you'll remember him for sure, and you've left quite a legacy behind with him now. SOmething to reflect upon in the future. It's a shame the sperm could not be frozen, but... Well, you more than made up for that. \n\nKeep the scrapbook, the videos, the photos safe. I cannot say enough how good of a person you are and... Damn. \n\nOne day you'll look back upon these things, as an old woman, and you'll have some damned good memories to get all nostalgic over. :)\n\nAs others have done, and if I may plagiarize! [Hug]\n\nHave a good day, a good year, a good decade, and beyond. :) \n\nIf you ever need anything again, we're all here for you. <3",
            "Thank you for sharing this. I admire your strength, and my heart hurts so bad for you right now. \n\nI'm off to be much nicer to my husband after taking an awful few weeks of work out on him. ",
            "Holy balls, you sure lived it up, didn't ya?\n\nVery, very nicely done.",
            ">He wrote a letter addressed to my \"next spouse\" with all the not so easy to discover things about me that were wonderful and necessary, in his words.\n\nGeeze, reading this felt like someone throat-punched me. Such and expression of his wisdom and selflessness, and the love he had for you.",
            "Make sure you make extra backups of everything. When that tab doesn't turn on, or a phone gets smashed, or a hard drive bites the dust, make sure you'll still have everything. \n\nI don't have good words for things like this, but I'm truly sorry. ",
            "We will all lose loved ones during our lives. Some sudden, others with warning, no matter how we receive the news it will rock us to our core. When that time comes for me, as I'm sure it will more than once, I hope to be even 1/10th as strong as you.\n\nThank you for this post. Thank you for being such an amazing and wonderful partner to your dear husband and, through your courage, reminding us all about what is important. My thoughts are with you.",
            "I'm very sorry for your loss. It's very nice to know that you made the best of it with time that was left. I'm sure that it helped him as much as it helped you. It's never easy to lose someone that you love, but as long as you remember them and keep them in your heart, they will always be with you. Thank you for the update, OP! Blessings and best wishes to you and your family!",
            "Thank you so much for sharing your story. It sounds like you guys made the most of your time together. I'm going to leave work and give my SO a big hug and kiss for you today, thanks for reminding me how lucky I am to have just one more day with him.\n\nYou sound like a strong person and I hope everything works out for you. I'm not religious or anything, but you'll be in my thoughts. ",
            "Glad to hear you guys were able to make his last few weeks as full of happiness as possible while still managing to take care of all the other things that will matter going forward. ",
            "> Living your life like each day is your last is impractical. But living your relationship like each day is your last is the easiest and most comforting thing in the world. Hug them, hold them, tell them you love them...\n\nSuch beautiful and poignant words. Thank you for sharing your story and for reminding me just how much I love there is in this world.",
            "My SO and I read (well I did and then he did) and cried together and hugged each other for a very long time. \n\nI cannot offer enough condolences, but, if it helps, I am resolved to make sure my SO knows how much I love him and how lucky I am to have whatever time we have together.\n\nThank you and I am so so sorry for your loss.",
            "Wow, what a post.  I've not been this moved by anything on the internet in a very long time.  You really made the most of what little time you had with each other, I have no idea how I would have coped in your situation.  You sound like a wonderful person and I'm so sorry for your loss.\n\nYou've also made me think long and hard about my life, I've not ventured into another relationship since my last break up about 9 years ago.  I'm not sure why I've avoided it, fear maybe, lack of faith in people possibly or maybe it's just a severe lack of motivation for a lot of things.  Your post has made me want to look for something meaningful again, I've just realised that I want someone to love, and to be loved again.\n\nThank you for sharing, and my thoughts are with you.",
            "Today is my parents 38th wedding anniversary. I read them your post and they wish you all the best and that the days will become easier for you. And then they hugged a lot. Thank you. ",
            "You seem like a truly wonderful person. I'm so sorry for your loss, but thank you for sharing so much positivity, and making the world a better place in doing so",
            "This is one of the most beautiful things I have ever read. \n\nI am thankful to have been given the opportunity to do so and the only regret I have is that it was borne of tragedy.\n\nIt's kind that you're thankful for peoples advice and support but what you and your husband did with it is truly phenomenal and very, very inspirational.\n\nThank you.\n\n",
            "This whole post I kept looking over at my SO through tears as he slept on the couch and wanted to go give him a hug. Then I got to that last part. I'm so sorry for your loss, I only hope that I can be as strong as you when I inevitably suffer the loss of the most important person in my life too. Thank you for this post. Like the top comment said, never delete it. Please. This is amazing and inspirational, and I don't want to ever forget how to be like you. ",
            "Thank you for sharing this. :(",
            "You are both incredible. Thank you for sharing your story and I hope that one day it becomes less overwhelming. ",
            "[deleted]",
            "[deleted]",
            "Beautiful words, I just saved them. Thank you for sharing this. ",
            "I'm happy that you had a month to do all of those things. I lost my fiancé on the 1st and I would do absolutely anything to have had any sort of warning about it happening. I hadn't seen him in a whole month because he was away at work. I'd do anything for even 5 minutes notice. I'd do anything to not be sleeping when he called me, 5 hours before he died.  Enjoy the memories you made... you are lucky to have them.",
            "My husband's sitting not 8 feet from me, swearing while playing a video game. I glanced over at him and immediately started to sob quietly. I did #5 for him on his birthday a few weeks ago.\n\nYou're so brave, and your words are so beautiful. I wish I could give you a hug. I'm sorry for your loss.",
            "<Internet hug> ",
            "[deleted]",
            "I don't have one, and never had an SO. But take this is a future promise, even though I am a hugger, I will increase the standard number of hugs I give her in your SO's spirit.",
            "This is beautiful and inspiring. Thank you.\n\nI wish you all the very best.",
            "Incredible, inspiring.\n\nI don't have a significant other but this still made me tearful.\n\nWhat a great message, and can be applied to family members as well.\n\nI wish you the best of luck. You are very young and still have a lot of life to live!",
            "I am at work and trying not to cry.  Thank you for the post, OP.  It was beautiful.",
            "[deleted]",
            "OP... this post is beautiful. I am glad that you guys got to do some pretty damn amazing things before he passed. I'm sorry that he's gone. If you ever need to talk about anything, happy or sad, you can PM me any time.",
            "Love. You're amazing. I can't really say anything except how much your story has impacted me. Thank you for sharing. You're an amazing woman.",
            "You both are amazing. I am drunk, but you made me cry. Best of luck ",
            "Better formatting of the lists:\n\n-----------------------------------------------------\n\nA special shout to a few people:\n\n - u/mistyranch for courage and sharing \n - u/mcdie88 for making me feel like a 100 years old (covered that milestone too as he insisted I will live his share   too!)\n - u/tacofugitive for looking out for me\n - u/aaoun responsible for some high quality home made porn\n - u/dahlialia who irritated the hell out of my husband as I wanted answers to ALL the questions\n - u/emalen thanks to whom I thought about this part, the coping\n - u/whatsleftisrigh for instilling some pragmatism in me\n - u/ianoftawa thanks to whom unfinished business won't be an issue\n - u/brrandyelf who made X'mas come early this year\n - u/tenebrous1 who inspired a letter that I haven't been able to read past two lines of\n - u/emlgsh whose words rung in my ears to keep me stronger on the bad days\n - u/throwyourtoothbrush without whose advice I would have tried to do it all on my own and made a mess for sure\n - u/tomyownrhythm who sure knows how to turn a good spin on the dark moments\n - u/daivyjones for the immense support\n - u/WeltallPrime for inspiring my very first novel\n\nand so many others for all the wonderful advice, support and most importantly for sharing your stories, I can't thank you enough. I'm sorry I can't mention all of you here. Please know how much every word meant to me.\n\n.\n\nHere's an update of all the things we did end up doing (and I hope this will help someone else like us out there):\n\n\n1. As suggested by a lot of you, **pictures and videos.** I have loads of data of him doing his daily chores to just snoring away next to me. And I still don't think it's enough. Do this, you may not have a warning, you may regret it if you don't. A little background of me here, I've always been anti pictures, I would proudly say make memories not photo albums and that if something is important enough, you'll remember it. While I still stand by that to a certain extent, I do condone finding that balance. I would charge my tab, turn on the camera and put it in our room. So I could enjoy him and then re enjoy our moments later. And we made the heavily suggested naughty videos as well. Fair warning, getting closure is important so don't get drowned in these memories either. It's too soon for me but I do understand the risks and will look out for myself. \n\n2. Which brings me to my next point. **Discussing the future.** As much as one would want to avoid thinking about a life beyond the one they love the most, not thinking of it will make it that much harder when it inevitably comes. Here's where all the advice on being practical was executed. Practicality on financial and emotional fronts; financial being having ALL the financial information including account numbers, passwords, life insurance policy details, wills and any debts and the latter being arranging for a therapist and talking about expectations from a partner after one is gone and discussing the kids futures, if any. He documented all the financial information and verified it twice, taught me how to access his bank's site and wrote down a step by step guide on how to get the insurance money once he was gone. He wrote a letter addressed to my \"next spouse\" with all the not so easy to discover things about me that were wonderful and necessary, in his words. \n\n3. **I wrote a book about him.** I'm an aspiring author and I'm proud to say that the love of my life is the sole reader of my only book. \n\n4. **Scrapbook.** This was so fun! I collected screenshots of the best and meanest things we've ever said to each other, printed those, interspersed those with our pictures over the years in chronological order (starting with the cliched obligatory baby pictures), threw in a few lists I wrote out of top 9 dates, top 9 best sex, top 9 reasons I love him (both our birthdays fall on 9th) etc., mixed in a crossword puzzle he had to solve and our scrapbook was ready! \n\n5. **I named a star after him.** I know this is slightly silly but now I can look at him whenever I want. \n\n6. Needless to say, **indefinite time off work**, spent every waking moment in his arms and sleeping moment in his tightly wrapped arms. Yes, lots of cuddling and just being together. \n\n7. **Balcony picnic.** This was an excellent idea. Stars, candlelight, good food and some good old fashioned open air sex \n\n8. Speaking of which, **lots of sex**. \n\n9. We discussed with his doctors and **freezing his sperm was not a possibility** at this stage so that couldn't pan out. \n\n10. **The last life party**. I wanted to call it The party that never ends but he played the cancer card so I was shot down. All his friends and family came over, everyone said a few things about and to him, nobody was allowed to cry, I told them I was spending a lot on the funeral and he was stealing my thunder by being a tear hogger. It was actually pretty nice with gag jokes from his goofy friends, something like a Halloween with a ghost attending but he's friendly like Casper rather than being creepy/scary \n\n11. **Told him I loved him, constantly**. And anything else that came to my mind that I wanted him to know! He was quite a sport about it and returned the favor. \n\n12. **We played cards together**, watched football matches and his favorite shows together. Things he loves. Casually holding each other. \n\n13. **Festival week**- a day designated to all the festivals. Milestone birthdays- video recording for each with a message \n\n14. **Cooked his favorite meals for him.** He was my happy helper. He'd wash the tomatoes and I'd make the lasagna. He called me the food conjurer. \n\n15. **Made him wear his favorite shirts** for several days so now they'll smell like him for some time. \n\n16. Knit him a sweater, made a portrait of his \n\n17. Things very specific to him that he wanted to do- a small bucket list that I won't bore you with\n\n-----------------------------------------------------",
            " May your memories of him be bright and true for the rest of your life. I feel for you and your heart-breaking loss. You made your last days together really count.\n\nYou reminded me what is important, my husband is going to get the biggest hug tonight. Thank you.\n\n",
            "Thank you for the update and the good cry, lots of prayers and hugs sent your way 💜 This was beautiful",
            "I never saw the original post, but I just wanted to say I'm so sorry for your loss. I cried reading this update.  You obviously had someone very special in your life and you always will. Even though he is gone, his presence in your life made you into the person you are today. We should all be so lucky to have someone who would be caring and loving enough to be willing to write a letter to the next spouse. Be well, I wish you a very happy life. ",
            "thank you so much for sharing this and i am so terribly sorry for your loss. its a harsh reminder to hold onto the dearest and most important things to us. I'm not sure i can say anything that anyone else hasn't, but this made me cry and the perhaps the text you made me send to my mum made her cry as well. ",
            "I didn't read your original post but thank you very much for updating. I am very glad that you got to share the time with your husband. I love you for your perspective and point of view, I am sure it was hard to conjure up but I am also sure it was worth it. \n\nYou are easily one of the strongest person I've ever encountered. I am sorry for your loss. Please feel free to reach out if you ever need to talk or anything. \n\nI am going to give my whole family a surprise hug and tell them I love them. ",
            "God, a good friend of ours lost her husband randomly last week. He was training for a marathon and just dropped dead during his run. They were so unprepared for this, and everyone is being strong, but she and their children and really fucked in a lot of ways. It was terrible to read your post and feel like you were lucky in some ways to have time, to know it was coming, and to prepare--but I do think you were lucky. Thank you for sharing. I'm going to start filming my wife doing little, inane things like sleeping and cooking because of this. Who knows? She could be gone tomorrow.",
            "[deleted]",
            "I can't wait to read your book.",
            "[deleted]",
            "Hey OP.  It sounds like you had a fantastic last month with a fantastic husband.  You really got a lot accomplished in that time, and have done many things to mitigate the pain of losing your partner.  Whenever I see posts such as this, I like to reference [this post by GSnow](https://np.reddit.com/r/Assistance/comments/hax0t/my_friend_just_died_i_dont_know_what_to_do/c1u0rx2) from a few years ago that has really stuck with me.  You've got a lot to hold onto to help you float through this sea of grief.  I wish you the best.",
            "I was widowed at the start of the year. 2 weeks prior he'd had a brain haemorrhage which put him into a coma he never awoke from. I have made friends with other young widows many who lost their spouses to known terminal illnesses. They had the chance to prepare and they didn't... I am so glad to hear that you did.\n\nThe next 6 to 12 months of your life are going to be hell... The best advice I ever got was just get through today, and if today feels too difficult then just get through this hour, and if that feels too difficult then just get through this minute, and if that's too difficult then just breathe and don't worry about anything else. \n\nHopefully because you had the chance to prepare with his support your journey will be that little bit easier. ",
            "My dad is on his last few days battling cancer now, he and my mum have had a year since his diagnosis but he was too unwell to do anything too exciting. He walked me down the aisle in March and I will always be so grateful that we had that time so he could be at my wedding. I am going to show my mum a screen shot of this post, the part about second chances and believing in people. She has been by his side for the last 5 weeks as he has gotten weaker and weaker, and she will be comforted by this posts wisdom in knowing it was either be with him while he slowly passes or have never known his love at all. Right now we are at his bedside while she reads his book to him. Thank you so much for sharing your story, I wish you all the best in your life with the wonderful memories your husband has left you with.",
            "Hope that you will have a rich and happy life!",
            "I damn right will give my SO that hug. Tears in my eyes. Thank you and I truly wish you all the best.",
            "[deleted]",
            "My brother went through this with his fiance. I'm so deeply sorry for your loss. In the end, all that mattered is they were together and she didn't suffer the pain anymore. ",
            "I am sorry for your loss.",
            "[deleted]",
            "Thank you. ",
            "[deleted]",
            "You are a beautiful person and gave your husband a true gift. \nhugs",
            "I love this. My father passed when I was 11 due to leukemia and what killed me the most was knowing my mom lost her true love and soulmate after a 2 year battle... You are SO lucky to have had this special time with him. Bless you <3",
            "You're a beautiful person and you have my deepest condolences. \n\nEta: I'm also happy though that you realized that this time could be a gift and then made it so. ",
            "My spouse walked in on me crying. I told him I loved him. ",
            "My Dad was my best friend, and mentor, neighbor, business partner, confidant, and buddy.   He got cancer 2 years ago and died 6 months ago. \n\nI did many things to help him and was there 149% through his chemo journey that was fruitless.  \n\nThe thing I did for him that he appreciated most was that we have a farm that is 100 acres, and he walked around it every day.   When he got so sick that he could not walk, I cleared a path around the farm wide enough for his little Toyota Rav4 to drive around, fixed all the mud holes that would get it stuck, and all the trees that would touch it.... I cut the limbs and cleared the path.  He drove it every day. \n\nWhen he could not drive any more I hauled him and his oxygen tank to the car and drove him around the farm to see the animals and the creek every day that he felt able. \n\nYou'll never look back with regret on the kind things that you do for a person that is sick and dying.  You are going to be here many more minutes or days than they are.  Giving them the best you have to offer is wonderful and when they are gone you can look back on those good things and it helps you heal. \n\nI'd pave a damned road around this farm if I could have him back for one more ride. ",
            "Good god you sound like a rockstar of a human being. You made the absolute best of a shitty situation and I’m sure your husband couldn’t have been happier (under the circumstances). Best of luck to you. ",
            "OP I've sadly been in your position. We weren't married but had plans to. I watched a beautiful woman wither away over 2 years battling cancer. It was the most heart wrenching fucked up experience in my life. I hope the best to you and just know no matter how hard it is it will get better, take it day by day and just keep going. (I'm at work now in tears :'(  )\n\nThis post was also very nice and heartwarming to read. Your points are spot on. I wish you the best of luck in the future. ",
            "I'm truly sorry for your loss.\n\nJe ne savais pas comment exprimer mon ressenti en anglais car ce n'est pas ma langue natale cependant les sentiments n'ont pas de barrières et ton message m'a profondément touché. Je pense que ton mari a eu de la chance de t'avoir a ses cotés et que tu as rendu ses derniers instants ici plus rayonnants et heureux. Tu ne pouvais pas lui faire de plus beau cadeau. Selon moi, l'âme est si complexe qu'elle est immortelle et grâce à la légèreté de ces derniers moments passés ensemble, l'âme de ton mari s'élèvera plus haut. \n\nOne last thing, you have to be happy because that's what your husband want. ",
            "[deleted]",
            "What I am most struck by is the dignity you and your husband showed in facing this crisis... it's there in every word you've written, and it's one of the most beautiful things I've seen in my life.\n\nI have children your age, and have spend a good portion of my life with a man I adore... and I'm not sure I could muster up even an 'nth of the dignity and composure you've shown were we to be in a similar circumstance.  I admire you both, so very much.\n\nYou and your husband have something rare and precious.  I say \"have,\" because even if he's gone, what you two created together lives on... not just in you, but in the people you've touched, including the 600-some Redditors with whom you've shared your story.  What you have has reached out and touched others in a ripple effect that just keeps spreading... you've set an example that others **will** follow, and they in turn will set that same example for still others.  It becomes a never-ending \"pay-it-forward\" effect.\n\nWhat you have survives.  I know that's small comfort in the wake of your loss, but I hope someday that knowing that... feeling that... believing that... lifts you up when you most need it.\n\n",
            "I cried reading this update as well, given that my mom died when I was 6 and can only imagine what my dad felt like, especially because she left him with a 6 year old and 4 year old. I'm scared that will be me a few years from now because cancer runs in my family, and even though I get checked annually, it still frightens me. I don't want to leave my boyfriend, or our kids ever. I want to be able to watch my 3 year old daughter grow up along with our son (to be born in Dec). I'm very sorry for your loss, but I am glad you have many beautiful memories to hold on to. I have been doing that with my little family just in case as well.",
            "There are two people, the people who stop in the face of adversity, and never move beyond it, and those who do.  Some are lucky and never have to face it until they're very old; others are not so lucky and get thrown straight into it from the moment they wake up.  I've seen how it affects those who don't process it well; those who do are amazing resources throughout our community in times of darkness and light.\n\nTo the very best on your journeys ahead!  Why can't we regenerate like tiny Groots when the curtains close?!",
            "I wish I had something more profound to say than I'm sorry and thank you. \n\nThe hardest part of loving someone, for me, is dealing with the reality that you will lose them someday. You've faced that reality with courage and grace. My heart goes out to you. ",
            "I just woke up doing my morning routine of checking reddit. This just went right through me to my deepest feels. \n\nOp, I am so sorry for your loss. I wasn't expecting to bawl so much in the morning. Thank you very much OP. I really appreciate this gift you are sharing with us all. \n",
            "My wife is going through stage 4 lung cancer and we were told she has less than a year to live.  Your post put me through a lot of tears here.  I'm saving it in hopes you don't ever delete it or the original one.  ",
            "This is how I want to go. Youre a great SO.",
            "[deleted]",
            "I fell in love with your story.\nIt felt as if, while reading your amazingly well composed post about the most lovable couple I have encountered in who knows how long, the world around me was locked by some mystical spell that kept me intrigued and made me deeply appreciate your generosity of sharing such a special moment in your life.\nI admire you, and your husband, though I envy both of you, as the joy and love your relationship was filled with seemed so strong that it would've been an understatement to call it anything but true love.\n\n\nI adored all alineas, and was impressed by how well you were able to write the part where you thanked other redditors, which was incredibly sweet.\n\n\nKeep us up to date when you publish another book. \nAs I hope that your first book will not be your only book, for very long atleast, since you wrote you're an aspiring author.\nIt would feel honoured to spend my hard earned money on something that is worth every penny.\n\n\nHave a blessed day my friend.",
            "I was directed to this post by a colleague who told me it was pertinent to what we do.\n\nI just want to say that this was a beautiful, amazing post and that I am so happy and proud that you were able to do this with your husband. \n\nI also want to tell you I am so sorry for your loss, and for our failures. I can't go into great detail, due to proprietary information, but I have worked nine years on a line of compounds, with the eventual goal of the defeat of cancer. \n\nWe have made great progress, but it is hard knowing every day more people slip away, so as I read this, I couldn't help but cry at my failure.\n\nI am sorry we failed you, but know we are trying. You will see the compounds that will defeat most cancers in your lifetime, I only ask that you can forgive us for not succeeding yet.\n\n\nYou are a wonderful person for what you did, a true hero, and it energises me to see people like you do what you do. Thank you for this post, and thank your for your actions.\n\n\n",
            "Hi hunny. First, know that I am here, always. My advise ce withstanding, I am also a good ear. I'd even be willing to chat via text or Skype. Let me know.\n\nSecond, you're so, so welcome. I'm living vicariously through your last month. I know it seems like shit, and it is. Sucks, I know.\n\nBut know that you have so many gifts now. And the burdens that may have occurred without planning are nonexistent and you can focus now, truly, on the emotions. \n\nI feel close to you, in a way. Reach out if you ever need anything.",
            "so sad--good luck to you in the future",
            "On my way home from work, going to wake my SO up with a big hug and tell him how much he means to me. \n\nThanks for making me cry on public transport OP, I wish you all the best. ",
            "I just stopped crying from reading this and started a drive folder for videos of silly and small stuff, in case anything ever happens without notice (I just recorded the dumbest video of myself lip-syncing our song to my husband). Hopefully they can be used for fun montages when my husband and I are old and healthy, but you never know when you won't have the kind of warning you did.  \n\nMy heart goes out to you, and I can't thank you for enough for sharing; it's given me a brand new perspective.",
            "this is beautiful. speechless at your optimism and spirit of acceptance. may you heal, and may you and your husband always continue to shine ",
            "I've been thinking of you and your husband. I'm so sorry that you two had to part so early.\n\nYou are an incredibly strong woman and I'm sure your husband was an equally strong man. I'm really sorry for your loss. \n\nIt's hard to find the right words in a situation like this but thank you for your heartfelt and inspiring update. I hope that your future shines just as bright as the star now bearing your husband's name. ",
            "Damn I'm sitting here with my friends playing the Call of Duty beta and I'm trying so bad to fight the tears.  Stay strong,  you're a good wife. ",
            "I'm crying at work reading this post. I am so sorry for your loss OP, it's unfortunate that it takes tragedies for us to be reminded just how special our loved ones are. Sending you a massive virtual hug, thank you for reminding me what is important. I wish you all the best in the rest of your life. xox",
            "I...I can't stop crying after reading this. My heart breaks for you, and it breaks for me, too. I know I take my husband for granted sometimes, but this was a real wake up call. \n\nThank you for sharing what is undoubtedly the hardest month of your life. ",
            "This is one of the those moments that I'm glad to be part of this digital community. I'm putting my phone down to hang with my ex and our children. \n\nI'm sorry for your loss ",
            "I'm not crying, you are!\n\nAs soon as my husband walks through that door, I am giving him the largest hug he has ever received. He is my world and he deserves to know that.\n\nI wish you a well recovery, and thank you for sharing your time with us.",
            "You are an amazing person and I wish you the absolute best in your future.",
            "I'm so sorry for your loss but this was a great update. I'm glad you made the most of it and have such a positive outlook on the situation. ",
            "This is the only post that's ever truly brought tears down my face. I am so sorry for your loss; I hope you can take all you did for his last days and always hold these memories so dear. I wish you all the best. I'm going to tell my SO that I love him right now.",
            "Bless you. You did the absolute best with the amount of time you had with him. Are you doing all right? Do you have a good support system?",
            "Your post moved me. I'm glad you were able to make the most of the time you had left together!\n\nI'm sending you good vibes from afar. ",
            "This is really, truly amazing. I'm sobbing over here, but this is probably the best post I've ever read on this sub. Thank you for sharing with us. I'm going to hug my husband and kiss him until he begs me to stop as soon as he gets home.\n\nI'm so sorry for your loss. You are such an amazing woman and I'm so glad you both had each other. May your husband's memory live on through your legacy. ",
            "People like you amaze me. You are so strong and brave it brings tears to my eyes. About 6 months ago my Dad was diagnosed with testicular cancer, I fell into a slump over this and embarrisingly tried to take my life over it. He is in the clear now luckly, I pray it never comes back. Your situation makes mine feel like nothing and I look at you and aspire to be as strong as you, you really are an amazing human both you and your husband. ",
            "Sorry for your loss op! I wouldn't know what todo if this thing happen to me , but now I do thanks to your post.\n\nI'm cutting onion now and I'm out of words ",
            "I'm crying into my wine, OP thank you for sharing this with us! ",
            "This is amazing. As a fellow human being, thank you for being so awesome. ",
            "Beautiful and sad update. Wish I had known this before my mother passed on.\n\nMy condolences for your loss and I hope life treats you kindly in the coming days.",
            "I cried while reading nearly all of it,  I'm sorry for your loss. Thank you so much for sharing your story, and for the reminder to not take loved ones for granted. I wish you the best",
            "My heart is with you.",
            "I remember reading your first post and thinking of the task ahead of you, how i'd feel in your shoes and what I'd do. Reading your update is bitter sweet. Thank you for sharing your thoughts and feelings with us. I'm so sorry that your husband has been taken from you, and far too soon. \n\nI think looking at his special star, whenever you want sounds lovely. All the best to you x",
            "> Be vulnerable, take risks, get hurt, it's part of being a human and it's ok.\n\nI just wrote this on my whiteboard across my bed, so I see it every time I wake up. I'll try to remember it. So sorry for your loss, OP. You're a good person.",
            "What a priceless gift you gave each other! Be very proud of what you accomplished - most people don't do this kind of thing, even when they know the end is coming. What a brave and valiant woman you are. \nNow comes the *really* hard part - The After. You've been running flat out for a while now and you've come to the wall of absence & stillness. Give your heart & head a break. The world will wait. \nPeace be with you, my friend. ",
            "This made me tear up, I'm so sorry for your loss. How wonderful to have been able to make so many beautiful memories with the time you had. Our loved ones are never truly gone as long as we hold on dearly to their memory. Stay strong!",
            "I lost my mother from cancer about 1.5 years ago. She was only 57. I have had such a hard time coping and I understand how you feel. When I was told she only had a year to live we did as much as we could. It still feels like we could have done more, but I cherish what we did do. ",
            "[deleted]",
            "I'm going to make sure to hug and kiss my husband and baby boy more every day.  Your strength is inspirational",
            "I shed so many tears reading this and hung on your every word. You shared magical experiences with each other in what some would have seen as darker times. You made your own light and that's beautiful. I'm sorry for your loss.",
            "[deleted]",
            "Sorry for your loss. ",
            "[deleted]",
            "I don't have an SO, but this post made me want to go out there and find the person who can love me (and I them) like you loved your husband. It is a truly beautiful love. \n\nThank you for sharing, I cried my eyes out, and it changed my life. ",
            "Well, I'll be saving this and sharing it with my SO later.\nI'm glad you got to share this time with yours, and I know the knowledge that you've influenced a little love in a far away place will be another boost.  \n\nThanks, a lot.\n\nFor sharing.  And caring!\n\nBut mostly for sharing.  <3",
            "Thank you, so so much. I'm in a puddle. It feels like I watched Ps. I love you all over again- where I cried the whole 2.5 hours. I'm going to go wipe my tears on my SO. You are an amazing person, so sorry for your loss but best of luck to the rest.",
            "Dammit I need to hug my wife but she's at work",
            "Jesus. My husband and I have had an incredibly difficult and trying year. I left him recently and moved to my sisters while I try to figure things out. I even spoke to an attorney about divorce. \n\nThis post really set things into perspective. I miss my husband and I want to go home. I LOVE my husband. Thank you for reminding me of this.\n\nI'm so sorry for your loss. I can't imagine the pain you are going through.",
            "[deleted]",
            "This is the only time I've cried reading a reddit post. I'm so sorry for what you're going through right now but I'm glad you were able to make the most out of his last days. This is truly one of the most beautiful things I have ever read and it's given me some new perspective on life. Thanks OP.",
            "Your husband was lucky to have such a wonderful woman as you to love him so well. Thank you for this post, I will never take my husband to be for granted ever again. Hugs being sent to you across the Internet. ",
            "OP, beautiful post. Maybe if you vacuum seal a couple shirts individually you can open one of them up when those hard to handle days hit. ",
            "[deleted]",
            "I'm so sorry for your loss. So so sorry. But I'm so happy you guys made the most of the time you had. You are an inspiration. \n\nYep, I'm hugging my girlfriend when I get in bed with her tonight. ",
            "I wasnt ready for all the feels!😢😢😢😢 😢😢😢😢 so many feels!",
            "OP, I've been lurking Relationships for a long time. I comment at times, but it's rare. Many a times have I read in the comments \"this made me cry\" , spoken by words of grown men.\n\nI never felt with those comments. I never cried. I never thought I could. But there's something so sincere and beautiful about your comment,I shed a tear.\n\nHere's to you and your story OP. I respect you for what you've done and I'm glad you had the time with your husband the last few weeks. You're awesome. Life might be tough, but don't ever forget that you're awesome.\n\nGood luck OP. I wish you all the best.",
            "I'm so sorry. ",
            "My condolences.\n\nYou'll probably don't read this, but I have always thought, that a good way to remember someone is to take what you loved about that person and make it your own. Take that part that made him special to you and ad it to you. That silly thing you loved, that sense of adventure, that tick he had etc. It's might be a small thing but you loved him for it. And if you take it, it will be yours and his forever.\n\n",
            "You really are something else. I hope your book does well and you continue to share your story.  This is all amazing.  I cried.  The power and the pain.",
            "I'm very sorry for your loss.  This is one of the most profound things I've ever read, and I want to thank you for writing about the time you spent with your husband over this last month.  Everyone should read this.  I'm saving it for myself.  I hope I remember it when times are tough.\n\nI hope you find this happiness again.  Take care, and best wishes.",
            "[deleted]",
            "This whole post is so beautiful. I'm so sorry your time was cut so short but I'm so pleased to read that you got time to do what counts. You sound so strong and brave and I hope when I'm in a hard place I can remember how strong you were. I wish you all the best and it sounds like you've touched a lot of lives here. What a fascinating world we live in",
            "Thank you for having the courage to share your experiences with Reddit.  As cliche as it sounds, you two seem to have lived more in the time given you than most people manage in their lifetimes. \n\nYour post reminded me of this poem by Elizabeth Barrett Browning : \n\n\nHow do I love thee? Let me count the ways.\n\nI love thee to the depth and breadth and height\n\nMy soul can reach, when feeling out of sight\n\nFor the ends of being and ideal grace.\n\nI love thee to the level of every day’s\n\nMost quiet need, by sun and candle-light.\n\nI love thee freely, as men strive for right.\n\nI love thee purely, as they turn from praise.\n\nI love thee with the passion put to use\n\nIn my old griefs, and with my childhood’s faith.\n\nI love thee with a love I seemed to lose\n\nWith my lost saints. I love thee with the breath,\n\nSmiles, tears, of all my life; and, if God choose,\n\nI shall but love thee better after death\n\n-\n\n\nI think your story is the most appropriate one I have ever seen for this poem. Thanks once again for sharing.\n\nAnd kudos to you for writing your novel, maybe its time I got around to mine too :)\n",
            "Wow! Thank you for taking the time to not only share your story but to show us all, how to start living.  In your pain, your stoicism shows us how to surrender our egos and love as if our days are running out.\n\nI'm moved by your kindness to remember those who touched you and to share their thoughts with us so that we too can grow from them.\n\nI'm taken by the joy that you receive in challenging another to love simply because you realise the importance of another hug.\n\nWow!!\n\nThank you for allowing your story to become part of our journey and for helping us realise how lucky we are that we get another day.\n\nI'm truly sorry for your great loss!",
            "I am so truly sorry for your loss. I must say that you have a wonderful outlook in the face of adversity.  Your post truly hit home for me when you said that you used to make memories and not photo albums.   After reading your post, i spent my evening filming my little family - thank you for the reminder to appreciate each day",
            "Why am I crying ",
            "I think sometimes, as probably all spouses do, about what life would be like without my husband. Sometimes I think this with fear and trepidation (why isn't he home yet, will I be alone forever?!) sometimes with evil glee (how dare he criticise me, I am a free fucking spirit!)... I doubt I've ever had the accurate reflection on it I have now, after reading your posts. I fear, sometimes, that I even love him properly yet I never know if I could really go on without him. Even  now, I'm not sure I could manage half of what you put together in a month but I do know that love is a strange slippery thing that is not always appreciated as it should be, until it is going or gone. That should help me put a little more into every moment with him and love him just a little bit more. I don't know how to thank you and your husband for putting something so essential and personal into perspective for me. I empathise, without maybe understanding fully your loss and I love you for sharing it and making me see a bit more clearly the precious nature of what I have.\n\nedited for some grammar and clarity\n",
            "Man I am sorry..\n\nStay strong, he was a lucky dude you know and so were you.",
            "Reading your list is the closest I've come to crying from reading something off this sub. Goddamn...\n\nI'm sorry for your loss.",
            "Usually I look forward to seeing updates here, but when I read your title I knew this was going to be emotionally painful to read. I don't have anything to say because you've said it so well. I think your words and experiences have deeply affected many people here. Thank you for sharing them. I wish you all the best in the future.  ",
            "Thank you for sharing such a personal, emotional part of your life!",
            "Holy shit. I don't even know what else to say.",
            "I don't know if I'll ever go through something as tough as you had to, but I hope that if/when I do, I can handle it as well as you and your husband.\n\nI wish you all the best in the future. I'm so sorry for your loss.",
            "this made me cry too. I hope you stay strong OP",
            "I am sorry for your loss. Your post has inspired me to not take my marriage or my husband for granted. \n\nI would like to make a donation in your husband's honor. Is there a charity he supported?",
            "I kind of understand how you feel. My mother married a man in 2013 and the day after their wedding they found out he had terminal cancer. She had a child with him and the baby was born premature. Unfortunately my baby sister had several surgeries and was unable to make it to her first birthday; Derrick, my step dad, passed away 2 weeks after she did.\n\nDon't let him do Chemo. That is my mothers one regret she would have rather had my step father alert and himself than get sicker and sicker with every meeting. \n\nIf you live somewhere cold take a vacation in a warm environment. It will leave you with good memories. We went to a resort in florida and we have nice memories of going out to eat, taking walks and enjoying the pools together with both of them.",
            "Darling heart, thanks for sharing this journey, I wish you didn't need to.  ",
            "I'm so sorry for your loss.  My deepest condolences.\n\n\nThank you for sharing your experience. It was absolutely beautiful.",
            "I'm sorry for your loss.",
            ":')\n\nLife is a risk, but hopefully we can all make the most of it like you did instead of shying away from challenges. Best of luck with everything and thank you for sharing your story--it's too often we (certainly including myself) forget to thank loved ones. ",
            "Far out, was not ready for this at a restaurant. Holding in the tears.\n\nThe letter he wrote to the next spouse broke me.",
            "This is just beautiful and devastating, and cancer is a fucking cunt. I wish you all the best. I hope your pain becomes bearable in time.",
            "Thank you. Thank you so much. I've been going through a rough time recently, and this post has affected me a lot. I wish you all the best. ",
            "If hes never been skydiving and is capable of doing so make it happen. It is my passion and everyone should try it once.",
            "cried like a baby at the last life party",
            "It's strange that as a 23-year-old who has never had a single health issue I often feel invincible, as though I've passed the dangerous phase. I can't even imagine facing something so huge a few years down the line.\n\nI hope that I never have to experience what you've been through, but if I do, I can only hope that I face it with even a small portion of the strength you have.\n\nIt sounds like you did everything as perfectly as you could have.",
            "I wish I had read this a week ago. My girlfriend broke up with me Wednesday night, and though we are both still alive, I am mourning the death of our relationship. Now I'm in the spot of wishing the last days of our relationship would at least have been spent doing more things together; things we loved, things we could remember. But I will keep this post saved as a reminder to live my life and enjoy my relationships to the fullest. \n\nThank you so much, and I'm so terribly sorry for your loss. Your strength is inspiring. Much love. ",
            "I read your first post when you first posted it, and I didn't say anything at the time but I'm glad for this update. Just want to share some love from a stranger on the internet. <3 I'm sorry for what you went through. It made me remember how much I love my boyfriend and I sent him a text (I'm away on vacation) telling him I love and miss him and he's getting cuddles when I get home. I hope in time you heal and find someone who makes you happy, when you're ready. Good luck. ",
            "Came to reddit for cat gifs and found something beautiful today.  Each word you wrote inspired me to love deeper and better than I do now. Not ashamed to say I'm a bit welled up in my eyes right now. Thank you for encouraging and reminding us to have the courage to live our lives every day.  ",
            "I saw this post in /r/all and I just wanted to say that you are very strong, and I hope you are recovering. Best wishes!",
            "You got to be with someone who loves you back. I wish I had that. I think I'm too afraid of losing someone, and I don't want to get hurt. So best to just not be with someone at all to save myself from heartbreak.",
            "I wish I had seen this before I let myself break up with my girlfriend a few weeks ago. Sometimes it might be embarrassing or corny but there are never any downsides to loving somebody.\n\nThanks OP, your post is the first bright spark I have had in my life for a long time. All the best x",
            "My sincere condolences, OP. Keep those memories as close as you can for as long as you can. ",
            "Man, this is such an amazing post. I have tears in my eyes. I had a fight last night with my SO but reading this really reminds me of the bigger picture, I'm going to go give him a hug. Thank you for sharing, OP. ",
            "Take care of yourself too! Say what you need to, and try to enjoy yourselves! ",
            "I'm about to get off my 6 hour bus ride to NYC to see my girlfriend for the weekend. We go back and forth enough that the bus driver waves me on disregarding the parts we play. When I arrive, everything is in its right place. When I leave, I part of me tires. I'm tired of feeling time pass by and only being able to spend a bit of it with her. We're trying to close the gap between us but work has kept us apart. Reading your story reminds me of why we do it all for this thing called love. I wish you the best redditor and know you made things clearer for one more person. Much love",
            "I am so sorry for your loss, and thank you for sharing your story. My fiancee and I are playing a video game online as I read this. I went in and told her how much I appreciate her in my life and enjoy the time we spend together. I will always do my best to keep your story in the back of my mind in the good and bad times. Thank you again.",
            "I am so sorry to hear all that has happened. I just read the original today as I had not seen it when it was posted. Best of luck, and remember to take your time - everyone's grieving process is different and takes different times. I am so glad to hear that you got to spend that time that you did with him and you were able to make it awesome. ",
            "Thank you for sharing.  I'm sorry for your loss and I wish you the best for this next chapter. ",
            "I don't have much to say apart from I am so sorry for your loss. You guys are about the same age as my husband and I and I just cannot imagine having to go through this, you sound very brave. I truly wish you all the best. ",
            "[deleted]",
            "I'm having trouble coming up with the right words to express how touching this is. I hope it's enough to simply say thank you for sharing and for reminding all of us to truly make the most of our days, when it's so easy to take our lives and love for granted.",
            "Tears here too.  It's so hard.  We're grieving a loss here too, but your post made me feel so much better.  What a wonderful life and you are a treasure.\n\nLet us all remember not to make a big deal out of truly little stuff.\n\n::Hugs::",
            "Thank you for inspiring me to try to get back to a relationship with my wife that is as loving as your final days with your spouse. We don't have a bad marriage and I'm not unhappy but over time we have maybe lost a little spark in our love for one another. You are both special people for allowing this community to share these moments",
            "Thank you for sharing your story.  It was beautiful and life changing for me.  I will hug him and tell him how much he means to me flaws and all.  I am sorry for you loss and wish you blessings during these tough times.",
            "I'm only 19, safe to say I haven't really had much experience with love. After reading this post (through tears) , I wish to someday have a relationship like yours. Sorry isn't enough, but I saved this post and now will remember the story of you two. Thank you so much for sharing this, and may your spouse rest easy. ",
            "The best thing that we can hope for in our life, is to love, truly love, and be loved in return. No matter how long or short that life might be, at the end of it I truly believe that finding love is what makes life worth it. I'm so sorry for your loss, it makes me scared and anxious to know and acknowledge that this can happen to anyone, that it can happen to me. I'm also so very happy that your husband knew love, felt it, and that you were both so lucky to have had the privilege of finding each other, and despite the problems and stepping stones, you toughed it out and made it work, and were able to live these last moments together in pure happiness. That's what relationships and love are all about. It's what any human being can hope for, and you two got that. You gave him that. Thank you so much for sharing your love story with us and inspiring us. That's a gift to the world, from the both of you. ❤️",
            "As a guy who really doesn't cry much anymore...This made me cry. Fucking amazing what love can do at the darkest of times. I am so sorry for you're loss. ",
            "Thank you for this",
            "I'm so sorry for your loss. I wish you nothing but eternal happiness! \nThank you for being so strong and sharing. <3",
            "I kind of jumped in here well after the fact I suppose, but I just wanted to say that you and your husband's story really touched me. \n\nI am getting married in a few months and I think of scenarios like this all the time. I'll get emotional thinking that I could suddenly be without her, and so I'll wrap my arms around her and say \"mmh lnnnff nnnyew\" into her hair while fighting back a few of tears.\n\nI wish the best for you. Your husband is(I say this as he lives now as a memory, and you honor that memory so thoroughly) a lucky man.",
            "> Be vulnerable, take risks, get hurt, it's part of being a human and it's ok. As long as you're not being downright stupid, harming yourself or those around you irreparably and not being codependent enabling someone's flaws rather than accepting them, it's ok to make mistakes, that's how we learn and grow. And on the chance that it's not a mistake, the potential upside is limitless.\n\nMan I have been trying to make a few of my close friends to understand this. I don't know if it's a maturity thing or what but it seems like everyone my age (young 20s) is so afraid of being vulnerable. I loved your post. Good luck with life :). ",
            "OP, my thoughts are with you. I'm glad you and your husband got to spend that time together, it sounds like you made the most of it.",
            "wow...im gonna tell my SO that i love her so much tomorrow. We celebrate 5 years a week ago btw. I'm so sorry...my mom had cancer to but she beat it and is fine today, but still... It sucks......thank you for sharing. it's just so uneccesary. i mean why? Im so sorry....\n\nFUCK CANCER",
            "I'm so sorry for your loss. I'm sure you gave your husband the best time of his life within his final month. My aunt passed away couple of weeks ago of cancer as well. Unfortunately she didn't have as marvelous or as planned of an ending that your husband had since her condition decline rapidly, so I'm glad to see that you both were able to make his final moments fantastic. ",
            "I'm sitting here with tears running down my face as my SO sleeps in the next room. We got into an (what I now realize was silly) argument about his work. I'm going to go lay down and hold him, even if he snores and hits me when he rolls over \n\nI don't even have the words to properly thank you for this. But thank you, I really wish you all the best in the world. Hugs and good thoughts sent your way from an Internet stranger. ",
            "This probably isn't what you want to hear, but ...\n\nI've thought about this before.  How life-affirming is it to hang around waiting to die?  The potential for agony seems much greater than for joy.  \n\nTake some time to have some fun together and share your love.  Then, when you both feel the time is right, find a sympathetic doctor, say your goodbyes, and be as kind to your husband as you'd be to a beloved, dying dog or cat.\n ",
            "Thank you...  ",
            "Crying at work. As soon as I get off I'm going to hug the important people in my life.",
            "This happened to me 18 months ago. If you want to talk to someone who has gone through exactly your situation just PM me anytime. Advice, vent, whatever you want. ",
            "I couldn't imagine. You are remarkably strong. I'm going to give my fiance a little extra attention from now on, and when I'm slacking on that I'll just re-read this post. Thank you for that, and I'm so sorry for the loss you and your loved ones are going through. ",
            "Man I am so sorry for your loss.  My thoughts and prayers are with you!  Please remember to take good care of yourself.  While the grief doesn't get better, your ability to cope does.  Know that your husband loves you very, very much, just in a different place now.",
            "This is what shows me that the problems in my life aren't as bad as sometimes made to be. For you to sit there day by day knowing any second he was going to die..I just don't understand how someone can be that strong because I feel I would be uncontrollably crying and be utterly hysterical. You are so strong, you have such a powerful love and are an amazing person. Cherish the memories and prepare yourself for the future. Go at your speed and remember that there are no wrong feelings.",
            "Thank you for updating. This is the first time a reddit post has made me cry.  I'm going to go remind my husband how much I love him.\n\nHugs from an internet stranger - I wish you comfort and healing.  ",
            "You're a good person. ",
            "Thank you for sharing that and for being so brave. I wish you all the best.",
            "One very big hug for you.  My wife and I have odd hours and work our asses off.  I'm taking some time off and we're gonna spend some time together after reading this.\n\nThank you for sharing and starting the 2nd baby boom.",
            "[removed]",
            "I've been trying to get through this update for over an hour.  I read a small portion, and then I text my husband that I love him, cry endlessly, and try to read more.  I am so incredibly sorry for your loss, even though that does nothing to make your pain any easier.  You ended your husband's life with many memories, memories that you'll have for the rest of your life.  It sounds like you guys had a beautiful life together.  ",
            "This was absolutely beautiful. I am so sorry for your loss but so happy you two got to make the last days so meaningful. Those are memories you will cherish for a lifetime. <<hugs>> ",
            "Oh God, the 'next spouse' bit made me tear up. I'm sorry for your loss OP, he was truly a gem of a guy.",
            "I'm very sorry for your loss, OP. But I'm so happy for you to have had that time together. That is so special.\n\nWhen I was in my teens, my stepfather was diagnosed with cancer and passed away four weeks later. We tried our best but it was so sudden and he fell ill so quickly that we didn't know what to do. We had time to get his legal and financial affairs in order, but I wish there had been more photos and videos taken, more time spent together, more last memories made, more of *him* left behind. The only thing worse than my grief and regret as a daughter was watching my mom lose the love of her life. That's a whole different world of pain that I wouldn't wish on anyone.\n\nFor that reason, I am really, truly happy that you were able to do this. I missed your first post, but it makes me feel better anyway to know someone out there benefited from experiences like my family's and was able to make the most of the time they had. You handled a horrifying situation with incredible grace. Your husband passed knowing that he was loved more than anything and that you had the tools and strength to face what laid ahead. It's a beautiful story and you are a beautiful person for taking all the steps you did. Thank you for sharing it with us.\n\nThe coming weeks will be tough. After the rush of the funeral and all the formalities, a quiet seeps in and the adrenaline that's been keeping you going will run out. I'm here if you need someone to talk to, and I'm sure there are plenty of others here who would be happy to do the same.",
            "I can't stop crying.  Anytime any of us gets into a fight or argument or say something stupid or mean, please remember this and treat it like this might be the final thing that happens to you.  Oh my god I'm freaking out.",
            "[deleted]",
            "Amazing. ",
            "I'm very sorry for your loss. I am glad that you got that amazing time with him though. ",
            "I'm having one of those days that seem to drag into weeks, and then into months. The sort of mentality where you don't feel like life is worth living, and you gain the twisted ability to turn anything negative.\n\nThis is an absolutely beautiful post that lets my brain have a few moments of bliss.\n\nThank you so much for writing about all of this to us. I don't feel it would have been easy.",
            "It's things like these that remind me to stop worrying about what's not important. Thank you for being such an amazing person and spreading hope. ",
            "Sorry for your loss, but I'm glad you made the best of it. \n\nMy marriage has been rough spots lately, and your situation makes me feel like an ass for ever thinking it was ever really bad... A great wake up... Thank you for putting this out there. \n\nI'll hug my wife. ",
            "I'm speechless.  I hope to never go through this, but you're courage and attitude is inspiring.  Thanks for sharing.",
            "You and your husband are so lucky to have been able to see your love for what it truly was.  love between human beings is unique in the universe.  Many of us have experienced it, but have not really seen it.  Your post has allowed me, and apparently many many others to finally appreciate the love we are capable of.  Never stop celebrating your marriage.",
            "I came here for the drama, not the feels.\n\nUrgh, that was so painful yet sweet to read. I'm so so sorry for your loss OP, wish you the best in the future.",
            "As a man who has not cried in years, you have my deepest sympathy and compassion. Sitting at work tearing freely in the break room. I wish you the best. ",
            "I don't know who you are OP, but I love you! I just read this at 8:30pm, still in my cube at work and started tearing up.\n\nI just texted my fiancee and told her how much I love her. Thank you for sharing this incomprehensibly difficult time with us. I've also saved this post to look back on it and reflect.",
            "Thank you for sharing this with us! ",
            "First, I am so sorry for your loss, I can only imagine how rough it must be to lose a spouse, and you are braver than most to reach out to everyone on the Reddit community, it truly is a great machine of people who are here to support you.  I wish you all the best in your endeavors and you can sleep knowing he passed as the strong, brave fighter he was, and that he's proud to have lived the last of his days with the woman he loved.  It's a truly honorable thing.  ",
            "I'm just sitting here covered in tears. I'm SO sorry for your loss and will immediately go hug my husband and children. I wish you SO much intense joy and love the world can provide you. ",
            "What was his small bucket list?",
            "[deleted]",
            "You are an amazing person. Don't ever forget how many hearts you've touched.",
            "this was NOT the post for a pregnant woman to read.  OMG, tears, everywhere.  ",
            "This is so beautiful and now I'm crying. I really want to see a lot of the photos you took with him.",
            "I'm extremely sorry for your loss. I saved this post like many others here. I also just gave my fiancée a kiss on her forehead. She's asleep, but I did it anyway. \n\nThank you for the inspiration. ",
            "Though I never wish to go through what you went through, I pray to some day have a love like you've experienced. Short or long, that is what life is about. Always cherish it. :)",
            "Damnit.  Sitting here crying, now.  Sorry for your loss :'(",
            "Thanks for loving with your whole heart. ",
            "I've never cried at a reddit post...til now. I'm so sorry. I can only hope to love someone like you loved your husband.",
            "This made me cry. It also had given me a real back seat to my relationship and think its time I shift down and slow the pace to really enjoy her life beside me.\n\nThank you.",
            "Beautiful. ",
            "And I'm crying.",
            "This post moved me to tears, I'm so sorry for your loss.",
            "[deleted]",
            "This is the utmost beautiful and heartfelt entry I think I've ever read. I cannot begin to express my condolences to you but am elated that you and your husband were able to share such an intense love for each other. Thank you sincerely for sharing this with us. ",
            "i'm a dude, single at that, haven't cried in years, ... just did.  i'm so sorry for your loss.  your post is inspirational.  i don't know what else to say.",
            "It's 12:41am and the day after my 6th anniversary. i'm laying next to my sleeping boyfriend in absolute tears because of this post. This submission is already 500 posts deep so this likely won't be seen, but I'm so sorry for your pain and sorrow. I'm sorry that the time with your love was cut short, but I'm so happy that you made your time with him wonderful. \n\nI promise to cherish the time I have with my partner. We take most moments for granted. I hope your future is a bright and happy one.",
            "I was 28 when my wife was diagnosed with cancer, 30 when she died.\n\nThere is nothing you can do. You can take tons of photos, go on trips, make videos. Thing is, if you really love him, after he's dead, that's all you'll have. And you'll get sick of seeing the same shit, with nothing new ever forthcoming. Always the same pictures that you memorized, same videos that you know like the back of your hand, same memories and no one to reminisce with.\n\nTake time to talk. Think about what matters in life and talk about it - family, children, humor, holidays - whatever matters you the two of you, and talk about it. You don't have to go anywhere, or do anything, or make \"epic\" memories, because the most epic memories, if you really love him, are memories of being together, at home, doing nothing. Memories of what you had that didn't *need* anything or anyone else are the only memories that matter, and you can't get those in your inbox. You can't make a meme out of those. You can't get fake internet points (karma) for those.\n\nGood luck.\n\n",
            "[deleted]",
            "i am a kid but i can send some candy bars i stole to you and your husband as a gift. well good luck to him. i hope he goes to heaven and i think he doesn't deserve cancer at all. i hope you are okay now too because this must be hard on you.",
            "My face hurts from crying. I admire your strength so much. I'm sending this to my boyfriend so that we can get started on our own bucket list.",
            "[deleted]",
            "Grown ass dude trying to hide my tears...onions ofcourse :/ \n\nSo Sorry for your loss OP. Stay strong! \n\nI couldn't read through the whole thing so I upvoted it. ",
            "I remember reading your original post when you made it. I choked up then and I choked up now. \n\nGrown ass man laying in bed with my SO with a tear down each cheek. \n\nGood luck, and I wish you nothing but happiness in this life. I have some cuddles to give. ",
            "[deleted]",
            "For anyone wondering how strong love can be, you proved you beyond a doubt a lifetime of love can be shed in a much shorter time frame.  I am so sorry for your loss.  I don't envy your road ahead - thank you so much for sharing and cherish ( as I know you will ) every second you made count for the rest of your life.  ",
            "Please make sure you create backups, and backups of backups, of any digital media you have of him.  Buy an external hard drive dedicated to just those files, copy them, and store the hard drive in a safe place.  Upload copies to a cloud service like Dropbox.  Create a private YouTube channel so you'll always be able to look at them, no matter where you are in the world; you'll just need an Internet connection.",
            "[deleted]",
            "My aunt is terminally ill with cancer. Just visited her, it was wonderful but tough. I am especially worried for my uncle once my aunt passes. Your post has given me a lot of strength. Thank you for that.",
            "Didn't need to read the first post to feel your emotions. I cried.",
            "God...This post got me teary-eyed. Honestly very, very little of what I read here on Reddit does that to me. I am an internet stranger, one of millions that will read this post. One of the many that will always remember your words and the positive attitude you held through these tough times.\n\nI am so sorry for your loss and I am so glad that those Redditors were able to help you and your husband enjoy your time together. I know it may be said over and over, but I am sorry for your loss. I hope you continue to celebrate the wonderful person that your husband was and I hope you find peace and happiness as you move forward in live. \n\nThank you for sharing this. ",
            "[removed]",
            "[deleted]",
            "My condolences. Fuck. This makes me sad to hear. God bless you, you're a good wife.",
            "I'm so sorry OP. My heart is breaking and I'm a sobbing mess. I'm glad you made the best of the time you guys had left together and thank you for making this post. It has really touched me. ",
            "You are amazing for sharing this with us. I don't have the words to express how I feel through my tears. Thank you. You are a strong woman and we can all learn from you. Take care of yourself. Big internet hugs ",
            "Cried my eyes out reading this, but it's not sad at all, it's lovely. When I read stuff like this I wonder how people can call reddit a cesspool. There's beauty all around if you look for it.",
            "Very nice. I hope you stay well I can't imagine how it'd be like if this happened to me. Next time I see my girlfriend I'm just going to pick her up and spin her around in circles and tell her that I love her :)",
            " The kids have woken me up early as usual, they're watching spongebob and I'm sat here with a leaky face. \n\nMaybe I don't need to build that gate today. I think we're all going to go and do something nice together. \n\nThanks for the beautifully worded reminder of what's important. You've lived a lot in this last month: Wear the experience with pride - you're a shining example of love and humanity. Thank you!! ",
            "Never has a post on reddit actually made me feel and think so hard that I started to cry... You inspire, and I wish you the best of luck, thank you for reminding us all of what is important!",
            "I don't really know what to say, but I want to hug you. I have horrible health anxiety (panic disorder) and regularly worry about dying, or my husband dying, and how I just wish/hope/pray we live until we are old. Meds help me not fixate on it so much, but it's still there, always in my mind, that I have to die.\n\nI know, deep down, that even though the average age of mortality is in the late 70's, there are always, always people at the lower end of the curve. I think about how so many people don't live a year and pass away as babies; I know that sounds morbid, but it reminds me that we are all on borrowed time, nothing guarantees a long life, and that we have to try and lead the best life possible since we only get one. So I hug my husband all the time. I smooch him all the time. Not passionate-sloppy-sex kisses, but kisses on his nose or neck or cheek. And he kisses me back. And we hug and hold each other. If I die tomorrow, I want to know I kissed him and told him I love him as much as I possibly could. And I want him to know that too. And if he doesn't make it until next month, I'll know we lived together as much as we could, and we got a month longer than some people. \n\nI hope you can heal from this, and find love again, and live a long life full of hugs and kisses. I am so sad for your loss but so happy you had that month. <3 ",
            "Sigh, I wish you the best of luck OP, my heartfelt condolences.",
            "Wow no words. Except very sorry for your loss.",
            "Inspiring, poignant, heartfelt, you have a true talent for writing. Are you holding up okay? How are you doing? \n\nThis post moved me. I needed to read this tonight. I have been going through a rough spot and needed some perspective and this gave me exactly what I needed. Take comfort in the fact that your husbands life touched me. \n\nThank you, and I am so deeply sorry for your loss. My thoughts are with you in this hard time. ",
            "Beautiful you are.  In time you will find normal joy  again without ever placing him second best.  You'll know.  He'll always be there while you're reconstructing the rest of life. ",
            "Haven't cried like that in a long time. Wow. Thank you so much for sharing. I'll be sure to hold my kylah as hard as I can the next time I see her. ",
            "Another one crying here... I am moved beyond words. \n\nI don't have a SO at present but I do have a beautiful daughter that I will make sure knows how much she is loved and how complete she's made my life. \n\nThank you for sharing your story - I wish you strength for the difficult times ahead. \n\n",
            "OP, I won't see my SO until about a week later or so. But thanks to you, I realised just how /much/ I love and treasure him. So when I finally get to see him, I'll treat him that way. Thank you OP. Best wishes and hugs from me! <3 ",
            "I am 19 and battling cancer. I did not respond well to my first round of chemo and my prognosis at this point is uncertain. I have been facing my mortality in a really scary way. Thank you so much for this post. I am taking screen shots of every bit of it. It has brought me some peace as I consider how I would leave my life should I need to soon.",
            "[deleted]",
            "You're such a fighter. Super proud and happy for you and your SO. Thank you for this post. Have a nice day OP! Cheers :)",
            "[deleted]",
            "I am so, so sorry for your loss. I'm lying here next to my love, crying so hard now. Before I happened upon this post I was lying here mad at him as he sleeps, which lately is a common occurence. Reading this made me realize how silly and petty I'm being and that I shouldn't waste a single minute being mad over unjustified disappointments. Tonight I will hold him as tight as I can and just be thankful to have him. My heart breaks for you and I hope that you can find peace.",
            "The feels on the bus go round and round",
            "I am sorry :(",
            "Wow. You truly have such a good heart. I wish and pray for you and just know that even through random Redditors, your husband will never be forgotten and he will always be watching over you. You truly have touched so many people's souls.",
            "I'm on the bus to work and this post has me fighting back tears! All I can say is that I'm sorry for your loss, and I think the way you two spent the last month together sounds beautiful. ",
            "You're such an amazing wife and thank you for sharing the life you guys had. I hope the best for you. Thanks again.",
            "I am so teary reading this post. What an incredible person you are. I can not even put in to words how sorry I am for your loss. I'm glad you got some time together and it sounds like you definitely made it count. I wish you all the happiness for the future. You truly deserve it.  X ",
            "[deleted]",
            "Thank you.",
            "I teared up a bit reading this. Don't usually cry at things, last time I cried was the season finale of Scrubs. The part about milestone birthdays was really touching and such a good idea. \n\nI am so sorry for your loss, and so glad that you had the opportunity and the presence of mind to do all these things. ",
            "God, where are all these tears coming from? Thank you for this post, I sometimes forget how lucky I am. Deepest condolences for your loss, sending you love and well wishes from Australia <3 xx",
            "You are amazing and I wish you only love and happiness in the future ",
            "You seem like a very strong and intelligent person. You have taken the pain of a tragedy and transformed it into love and happiness. It's clear from reading the comments here that you really have touched the lives of dozens, maybe hundreds of other people. They will now go out and create more love in their lives because of the words you shared. And that is a beautiful and marvellous thing. Thank you.",
            "BRB, going to the bedroom to give my SO a hug and kiss ",
            "Ah man this is beautiful",
            "I am very sorry to read this, and you and your husband are added to my prayers for the rest of the week.  \n\n\n",
            "[removed]",
            "This is so, so beautiful. I'm so sorry for your loss. You've helped so many people by posting this, and I hope the pain you are feeling eases.",
            "It sounds like you had a great last month together. It's obvious how much you cherish each other. I'm glad you got to make that time meaningful and you have set up all these things that will give you lasting memories. I wish I had more videos or pictures of my son before he died because I feel his memory fading over time, and it's only been 8 months since he died. Granted, he was a baby, so I only had 6 months of memories to work with and record. But I can't stress enough how important it is to document everything! With my next child I'll probably have a go pro on my head 24/7!",
            "Tagged so I can read it to my wife. Thank you for sharing and writing such a beautiful and heartfelt post. \n\nEventually everyone will lose the person they love. It can be anywhere from 1 month to 50 years from today. The time we spend with the people we love pales in comparison to HOW we spend that time. The memories we have of the people we hold dear in our hearts are based on quality, and their ability to make is feel alive. \n\n\nIt seems as though you made sure to live and create those memories in such a short amount of time.  To a quality that most people will never be able to match given 20 years. ",
            "[deleted]",
            "As someone who was diagnosed with a very aggressive (and very treatable) cancer 2 years ago, and met someone one year ago, who gave me fresh strength and perspective in life, someone I hope will stay my life-partner for a long, long time, this really hit home.\n\nIt's so weird how things become so clear, when one is confronted with the most natural - yet most pushed away - aspect of life.\n\nYou did very well, and through sharing this, you encouraged other to live their lives a little bit better, a little bit more conscious, as well. I, too, told him once more, that I love him. \n\nThank you.",
            "I am one THOUSAND percent going to start Taking many videos.  I have a charmed, amazing, happy life. I also have an amazing husband. I know everyone says that, but we truly are blessed. Sixteen years and we still snuggle and giggle and honest to god love eachother to the core. \n\nI'm going to get past him teasing me and telling me to stop it and will record him doing many mundane things :)Love this idea.\n\n\nEdited to add: many tears. I hope one day you can look back and easily smile at all your memories. Keep on truckin. I'm sure ill remember you for the rest of my life.",
            "Thank you so much for your update. I'm glad you were able to make such meaningful memories with your husband in the time he had left.\n\nTake care. <3",
            "I started bawling when I got to the part where you husband wrote a letter to your future spouse. There's something about that depth of love and understanding and acceptance that just hit me deeply. I'm so sorry for your loss. ",
            ">now I can look at him whenever I want.\n \nI don't cry about anything. But this made me weep like a little girl. You're amazing.",
            "My condolences. I hope you find solace, comfort, and ultimately hope in those memories.",
            "Wow. You're an incredible person and this is the most heartwarming and breaking posts I have ever read. Thank you for sharing this. \n\nI'm sorry for your loss.",
            "This is beautiful, thank you. I'm so sorry for your loss. <3 ",
            "😩",
            "I've never cried that much reading a post. Someone I love madly have had cancer, and is still in an high risk of having it again... Thank you for sharing your story, it is both sad and beautiful. I'm sorry for your loss. Good luck OP.",
            "Can i ask a very personal question that ive always wondered when someone is diagnosed with cancer? How did you find out? What made you decide to go to the doctor to get checked up? Did he see a doctor regularly and its someone you cant detect until its showing symptoms?  ",
            "I'm in tears all over my face. One of my aunts has cancer, and I can't imagine what will happen in the next months. \nLast two paragraphs were like the cherry in the pie, I always think of that way but most of the people don't. Being vulnerable, is what makes you a human. \nSorry for your lost and I'm sending you a big hug from Colombia. \n\nPD: do you have a blog or something? I'd like to continue reading you messages. ",
            "I hadn't read your previous post til I found this one...bless you, bless you both so much \n\nand bless the people who helped you through, strangers but not \n\nthank you for sharing this with us and for your strength and for your words and for your soul \n\nI'm crying but, in a sort-of-good way...I'm so happy you had that time, wish you could've had more...sending you love and comfort and goodness xx",
            "I'm young, but when I get married, I hope I can be with my wife like you were with your husband. You are truly an inspiration. Stay strong, God bless.",
            "Most beautiful post I've ever read. You are an inspiration <3",
            "[deleted]",
            "After reading your story I have no words that can describe how I am feeling. I am at loss for words. Your story will always remain with me to remind me just how important love is. You made his last days the best days of his life.",
            "I am going to remember this when I need it.  Thank you so much for sharing!",
            "Thanks, OP. Not only for making me cry like a stupid baby at work, but for reminding me to always cherish every moment you have with somebody you love. I'm going to go home and do something special for my SO today. I'm not sure what, but I'm going to film the hell out of us doing it to the point that she's gonna get irritated by it, then I'm gonna have her read this. \n\nYou have all my thoughts, prayers, and sympathies right now. PM me if you ever need somebody to talk to. Your words touched me deeply today and I hope maybe I can kind of return the favor. ",
            "oh my god. I didnt get through the first sentence without starting to tear up. What an amazing post, thank you so much for sharing this. I sobbed all the way through and am still sobbing just trying to put my thoughts down. \n\nI am so thankful you had this time with him, and that you were both so open to the ideas presented here, and how cool that you personally thanked so many contributors! So cool. You're a total inspiration, and I read your post with the visualizations of a really romantic but sad-ending movie, it was so beautiful. Thank you thank you thank you. \n\nReading everything you wrote makes me want to grab the one I love and never let go. If I get to experience half of what you guys were able to put together in the last month over the course of my lifetime, I will consider myself lucky. so much love to you.. ",
            "Like many others here, I cried reading your post as well. I am so sorry for your loss but I am so happy you got to spend your time with him in such an amazing way.\n\nThe letter he wrote to your next spouse is one of the sweetest things I have ever heard (obviously that isn't on the radar at this point).\n\nYou sound like an amazing person. Stay strong. ",
            "> 15. Made him wear his favorite shirts for several days so now they'll smell like him for some time. \n\nWrap one up in ziplock bag and store it away. It'll still smell like him when the others' have lost it.",
            "Thank you for sharing.  I hope you find peace soon.\n\nI've been through some pretty poor experiences of relationships and have been struggling with thinking that women see men in general , especially myself, as something that is valueless and disposable.\n\nI know that's a horrible thing to say but that's how I've been made to feel by certain women and it's so much easier to see what you fear is true in every day life.\n\nI just want to say thank you to you and all the women who have commented about their husbands and boyfriends.  It has gone a long way to helping me see that there good people out there and  that hopefully one day I'll be able to meet a woman like you guys and hopefully before that day I can make myself worthy of her love.\n\nI hope you all find peace and happiness.  Keep each other close.  It seems we will all loose the one we love eventually but I hope it's in many years during old age and that the pain of loss is a fair price for the happy lives you have had together\n\nSorry I've rambled a bit.  I'm really quite affected by your story\n\nPeace ",
            "My heart broke for you last night and nearly 15hrs later, my eyes continue to well-up. I am truly sorry for your loss. \n\nPlease know everything you've done, including coming back with your update and thank-you's, is a testament to your inner-strength. Then add in how you've touched and inspired so many others with your heartfelt words during a very dark time...you're truly an amazing woman. Much love and many hugs to you.",
            "Oh god why do the good ones always die young, I'm so sorry for your loss.. R.I.P ",
            "Sorry for your loss. There's so many bad things in this world I can feel for another on, but I've been blessed that the two people (only two) I've lost in my 29 years had their time and heard the bells ringing far in advance.\n\nI can't understand that pain but reading that you found yourself a heartwarming way to deal with it gives me hope. So thanks to you.",
            "Thank you. Stay strong. <3",
            "I don't know how you found the strength to go through all this so majestically but I admire it and wish you the best life ever after this.  I wish I never have to test myself the same way because I think I would fall apart. =(",
            "I'm so sorry for your loss, I'm a hard to cry type of guy, and my eyes are watering.  I'm sure others have said, but your writing is encapsulating.  You are CLEARLY an aspiring author.  This is easily the best written post I've ever read on reddit.",
            "I got with my fiancee while she had lymphoma. I was unemployed at the time so we got to spend 24/7 365 together learning about each other and caring for each other. Best thing to ever happen to me and her!\n\n\"Living your relationship like each day is the last day.\" is awesome so is \"learning and growing\".. It is common sense stuff that seems to get overlooked.\n\nAlso being in situations like these teach you to learn what is important and what is not... really quickly. Just communicate and be nice! Your life will be better and your relationship will be better. The person is already there for you! Be good to them! Love love love love!",
            "Hugs from California, You got this OP. ",
            "[deleted]",
            "Wow. This is so moving that I have nothing to say to your story directly. I can say that it expanded my empathy for some friends for mine who've lost their partners and reminded me of what's important. Thank you.",
            "Thank you for sharing, you have inspired me and many others.\n\nAlthough I could not comprehend all that you have been through, I wish you the very best in the future.  ",
            "I'm so sorry for your loss. I'm glad that you got to do so much with him before he passed, even if it wasn't close to being enough. Stay strong. :')",
            "Dangit, I finish work in like a minute - How'm I supposed to drive home when it's all blurry like this???",
            "I'm so sorry for your loss, OP. I am currently struggling with the same thing as you did in the past few months. My fiance has been diagnosed with terminal cancer in April 2014 and I am very lucky as he has been battling this war bravely till now. Things are getting worse and previously we had been in a long distance relationship where I was 9000 miles away from him. But I'm glad that I made the right choice, and temporarily dropped everything just to spend enough time with my fiance as every moment counts. \n\nWhen the day comes, I hope that I'll be able to cope with it gracefully like you did. This post was beautiful and your list did give me some ideas on what to do. \n\nAs I'm typing this, he's laying in bed with headphones connected to the TV while I'm typing away and having tears welling up in my eyes. I'm going to give him a good long hug. It's hard to not end up crying, but I'll try.\n\nMy prayers and thoughts are with you at this darkest time. Sending all my love to you. Take care OP."
        ]
    },
    {
        "post_id": "abxvly",
        "author": "AggressiveImpact7",
        "title": "update to: Husband and I are having our longest fight ever and I don't know what to do",
        "url": "https://www.reddit.com/r/relationships/comments/abxvly/update_to_husband_and_i_are_having_our_longest/",
        "score": 11022,
        "num_comments": 395,
        "created_utc": 1546464035.0,
        "selftext": "link to original post: [https://www.reddit.com/r/relationships/comments/abayxw/husband\\_and\\_i\\_are\\_having\\_our\\_longest\\_fight\\_ever/](https://www.reddit.com/r/relationships/comments/abayxw/husband_and_i_are_having_our_longest_fight_ever/)\n\nSoon after I made the post, my husband called me. He was babbling and I couldn't understand him, so I kept asking him to slow down. Then he started screaming (not yelling, literally just screaming). I freaked out because I thought he was being murdered or something. I tracked his phone to a park in town and called 911.\n\nTurns out he had a complete mental breakdown. He's in the process of being diagnosed with a mental illness that usually shows up in people's 20s but for some reason manifested later in him. He's currently in an inpatient mental health program and already doing a lot better.\n\nThank you all again for the responses and advice on my original post.\n\n&#x200B;",
        "permalink": "/r/relationships/comments/abxvly/update_to_husband_and_i_are_having_our_longest/",
        "comments": [
            "The onset of mental illness posts are the ones that I hate the most. \n\nOften nobody is really at fault, but its likely the start of a long and difficult road for all involved. ",
            "I'm so sorry. My husband had a break this past summer, and he was also 36. No other history of mental health problems except some mild depression. You are going to have a hard few months ahead of you. Call in all the help you can to help with the baby, and don't forget to take care of yourself.",
            "So happy for you that he's safe and so sorry about the circumstances. ",
            "I read your other post and can speak from experience. I had a baby shortly after losing my mother at a young age and combined with postpartum depression I went crazy. My husband thought I was suicidal and I had to go to an impatient facility and I was so angry. Angry and him for asking me to go, angry at the doctors, I was really convinced nothing was wrong with me, I hated being there. \n\nFor what it's worth I think going to a facility and getting on medication saved my life, I know now looking back how irrational I was behaving. Your husband is in a place right now that will be hard for you to relate to or understand but with the proper counseling and maybe medications you both will be in a better place.",
            "I remember your post. I hope he is able to get the care he needs. This whole situation is scary for you and for your daughter. My daughter is only one month younger than yours, and so I related to your story. \n\nBest of luck to you all.",
            "I wish the best for your family. ",
            "I had a bad feeling when I read the first post that something about him sounded like he wasn’t 100% mentally, especially when you commented that he’d never acted that way before. I’m glad you at least know what’s going on now and can take the next steps to move forward from this, and hope you and your family are doing as okay as you can right now.",
            "I'm so sorry you're going through this! You are a strong and brave woman. My husband has mental illness that, when unmedicated, would mean our relationship wouldn't stand a chance. However when he is on a proper medication, we are a nearly \"model\" relationship! Without knowing the specifics or complexities of your situation....I just wanted to say that with treatment and perhaps medication you can have your husband and partner back! \\*\\*hugs\\*\\*",
            "It's a hard road, I won't lie. I hope you can make it through. I was diagnosed bipolar at 27 and didn't stabilize until 33. I ruined a lot of relationships and people wont forgive me.",
            "Sorry to hear he is unwell. Hope things improve for him and you and your baby, and that he gets the help he needs. Sorry also for my reply to your earlier post suggesting he might be seeing someone else. His behaviour was so odd and out of line that that seemed like a possible explanation. Psychotic illness is a terrible frightening thing to go through, I hope you both can get some family support through his hospital stay and recovery. ",
            "I commented in your last post assuming like most that this was a relationship issue. I'm sorry it took this strange turn, and I'm sorry you have to now handle your husband's illness.\n\n&#x200B;\n\nI had a breakdown over the summer after several things in my life piled up and I never processed it entirely. It wasn't nearly as bad as what you're husband is likely going through, I didn't need inpatient care, but I was also aware how stressful and frustrating my problem was to my wife. She's now dealing with her own anxiety and depression that was brought on by feeling utterly helpless to do anything for me.\n\nWe're both getting better but it was a very hard time and you have my sympathy and support. Be strong for each other, don't ever feel lost and alone and hopeless, there's always a way forward.",
            "Oh my god, this is really terrifying. I hope for the best for your husband !!",
            "Glad he's in the right hands, I remembered reading your post. It's scary for you, but he's in the best place to get help. Best of luck to the pair of you. ",
            "Yeah, I read your original post and thought “that sounds like a man in a manic episode.” The good news is it was caught early. Be prepared for meds to take a while to kick in, though—most SSRIs/antipsychotics take a month at least to kick in. Still, you’ll get your husband back.",
            "The same type of thing happened to my boss and his wife (I’m friends with both of them, his wife is one of my best friends), in October of 2016.\n\nThings just kept getting more and more crazy until she had to get police involved and have him 51-50’d in the hospital. She was on the verge of divorcing him and taking custody of their kids because she feared him. He was threatening to kill himself whenever she COULD get ahold of him, he’d spent all their savings and announced via FB he was “moving to Paris”, etc..\n\nHe was diagnosed with bipolar at age 30. He eventually came down off his mania and went into a deep depression, it took many months to get back to even semi-normal.\n\nHe agreed to medication and therapy and has been doing fairly well since, with only a few minor issues since then.\n\n\nI hope you and your husband can work things out for him. He’s going to need a lot of help, patience, and support. Best of luck to you both.",
            "I'm very sorry this is happening to you guys.  I remember your post because I didn't like all the conclusions being drawn.  I hope with therapy and medication your husband can get back towards normal.  ",
            "I'm glad he's safe and accepting treatment. You might ask his treatment center if they have a support group for family members. Or your local chapter of NAMI would have resources.\n\nBest of luck to you both. I was in his place when I was 17. It's hard, but I have a good job and my husband and kid like me OK, so he can get to a place where he can be happy.",
            "I'm glad he's getting the care he needs. Best of wishes to you both.",
            "I went through a similar thing with my soon to be ex-husband. Thinking back his mental health had been declining over several years. I finally left him when he attacked me while I was holding our 6mo son. \n\nIt actually turned out he had a brain tumour, that had caused the erratic behavior and escalation. I just thought I’d mention this, please get your husband checked just in case it’s a physical problem that can be treated.",
            "I read your previous post yesterday and while people were saying he may be cheating on you, I honestly kept thinking it was a secret drug dependency or mental illness. I can’t imagine this is an easier road,  but I’m glad he is being seen by doctors! I really hope things get better from here for the both of you!",
            "Wow! I didn’t comment on the first post but I did read it. Kinda bittersweet update. I am glad he isn’t doing some shady shit but sad his diagnosis came in such an abrupt way. Good luck to you both in the future. ",
            "Glad you know what's going on now, which is an important first step. Wishing you the best and him a full recovery. ",
            "So sorry to hear about this but happy he is getting the help he needs. Wishing you all the best ",
            "Wow, I am so sorry OP, that must have been terrifying.  I hope that he and you all are able to get the help you need.  I am glad he is in a safe place now.",
            "Make sure he has brain scans done to rule out a tumor that could be affecting the part of his brain that could cause this. I’m pretty sure that’s a real thing/option I’ve read about it. \n\nSo sorry you’re going through this. That’s really sad. Fuck mental illness. Fuck it right in the a$$. ",
            "Gah...this happened to me.\n\nI was always kind of a sad person and then I went to law school and had a few breaks one after the other. Actually, the partner I was with at the time couldn't handle it and left.\n\nI was in and out of hospitals throughout my 20s. Eventually, I got on the right medication, worked my ass off, found a great husband, and I'm living a normal life now. I haven't had symptoms for over 4 years, maybe 5. I have to admit that I still come off as a little eccentric once you get to know me, and I'm a little self-conscious about it, but that and a bit of anxiety at night is really all that's left of the illness.\n\nI have bipolar disorder. In about 20% of cases people make a near-full recovery. I will probably be on medication for the rest of my life, but I'm a pretty happy person now. There's hope.",
            "It's updates like these that really show how toxic and dangerous this sub really is. \n\nWhen OP first shared her stories the number of people accusing the husband of having an affair was astonishing. Then there was the judging, the encouragement to get a divorce and so on.\n\nThis sub can really cause more harm than good at times. ",
            "Thanks for the update!",
            "I wish you and your husband the best and that he will be receptive to the help he needs",
            "Wow. I'm sorry you have so much to deal with along with a baby. I hope you and husband are surrounded by all the support you need.",
            "I am so sorry. I hope he gets better very soon with his treatment! It’s good that he is being diagnosed instead of pretending there is no issue. Much love to you both.\n\n(My little sister became manic schizophrenic at around 19. We had no idea it ran in our family.)",
            "I am so glad he is getting emergency and long-term help. His reaction in your last post was very scary. I hope you have help with your baby and help for you. ",
            "Please look at NAMI.org and find a local support group for yourself (and him). It is a difficult journey you both are about to embark on and there is so much information to process. NAMI can really help. ",
            "Holy smokes! That's big. My brother has paranoid schizophrenia so I know how hard that can be when they first start falling deep into the disease. All my best to everyone involved. 💚💜💙❤",
            "I’m so sorry OP. I really hope he’s doing better but I also really really hope you’re doing okay. What you experienced was incredibly stressful and this new news can’t be easy. I really hope you’re okay. ",
            "I'm so sorry that you are going through this crisis.  Whatever it is worth it's great that he's getting help that he needs and while it's not the best timing (I know that from experience) he will be getting his health condition under control and that is a huge help for not only himself but your family's future.   \n\n\n\nMy husband had his depression kick into overdrive after our daughter was born.  It was the worst.  He had few coping skills and I begged him to seek out professional support because I couldn't give him the tools he needed.",
            "I wish it was better news but at least you know where he is now. This is heartbreaking. My first husband's mental illness manifested in his late 20's. It was awful being witness to his downward spiral.",
            "I had a break when I was 29.  It was quite late as well for me too.  I’ll spare the details, but it was a hard time for me and my family.  I’m just telling you that there is always the possibility of recovery, but not to expect it.  With the right medications and the support from loved ones, it sounds like your husband has a good chance of recovery.  If anything, I’m proof that it is possible,  after my break, 5 years later, I got my RN license.  Hang in there, and if you have any questions, feel free to PM.",
            "Just to give you some advice from someone who has been exactly in your shoes. My Husband found it very difficult to bond with our Daughter when she was newborn. He was terrified but trying to hide it. He then wouldn’t emotionally bond with our Daughter or me for about 12 months. I just kept hoping it was temporary. We then had a huge row and he stormed out and took a mini break down at his mums house. He was in his 30s at this point. Looking back I can see all the signs and excuses, I even spoke to my brother in law in confidence because he was a mental health nurse, I told him I suspected there was more to his depression and anxiety, he started to see the signs too. My husband put down to mood swings or exhaustion. He was diagnosed with bipolar disorder.\nIt’s not easy but if they get the right help and support it can become well managed. At the slightest dip in mood or excitement building I immediately call his specialist. He’s really stable and his “ normal “ self again. One piece of advice as a family, discussing mental health is so important. If you broke your leg or had flu you would talk about it. Well mental health is a health issue so it should be openly discussed rather than the embarrassing secret that nobody talks about. Also you weren’t to know this was the problem so don’t hold any daft notion of guilt about it. Most importantly you need to look after yourself so you can be strong for him if he needs you. You need support too. \nI hope your Husband gets a diagnosis and gets a good treatment and team support. Most of all try not to project into a future you can’t predict. Take each day and each hour as it comes. Sending thoughts and prayers your way x",
            "I’m so sorry to hear this and can imagine how overwhelmed you must feel. Please rally and lean on your support group as much as you need. Also please be sure to have your husband checked out physically, if he hasn’t been already. Ask his doctor about a brain scan to rule out any brain abnormalities that could cause such a sudden onset of a mental illness (with psychosis) not usually seen in men his age.",
            "[deleted]",
            "yes, that is kinda late- onset. hope he improves quickly and all goes better for your little family. also, you are handling this quite well - good on you finding him & getting him the help he needs. ",
            "I am so sorry to hear this a day after having read your OP. Please do not forget to take a good care of yourself in this process— both for you and your family. Wishing you all the strength and happiness goong forward. ♥️",
            "Wow. I remember your original post. I'm glad hes getting the help he needs. Stay strong!",
            "That must have been so frightening (for both of you)! I'm glad to hear he's doing better already and that it sounds like he's in good hands; it's great that he's been able to access help so quickly. I hope you (and the kiddo) have some support as well; patients aren't the only people affected by mental illness and it's not always obvious how to cope, so definitely ask for whatever help you may need. ",
            "As someone with a partner with a psychiatric disorder I just want to let your know that it gets better! It’s hard and there will be ups and downs but he is getting the right care and that’s so so important. I wish you and your husband all the best. ",
            "I'm sorry to hear. I was completely off and it never occurred to me that he might going through an episode. As such accept my apologies and I wish you all the best. ",
            "Now that I think about it, your situation sounds a lot like my parent's - dad was diagnosed with Bipolar disorder when my mom was pregnant with me.\n\nIt's been 27 years since and, ngl, it's been a rough journey for my parents. They've made it work, but it's only because my mother is a literal saint. \n\nI'd suggest counseling if your budget allows for it, just so it can help you understand what your husband is going through and vice-versa. Have a good support system about you, especially with a baby on the way - my parents got a *lot* of help from their families when I was growing up.\n\nBest of luck and stay strong. Don't be afraid to ask for help.",
            "I’m sure you are completely overwhelmed right now. When you have the chance to take a breath, I recommend NAMI. They have loads of resources and many volunteers who will be able to help you. I’m so sorry this has happened. Things will be very hard, but there is hope. ",
            "I'm sorry to hear that. When I read the original post a mental break or brain tumor first came to mind.  I grew up with a mentally ill father and unfortunately my wife just got diagnosed with bipolar and is spiraling out of control. Mental illness isn't something I would wish on my worst enemy. I'm glad he is getting the help he needs and recognizes something is askew.  Good luck! I wish you the best. ",
            "If your husband is dealing with This, and I hate to say something mean here, but you might want to eventually have your kids tested to make sure they don't have this in future.",
            "Mental health issues always take their toll, even if they're manifesting in a loved one and not yourself. If I might make a suggestion, you may want to look into seeing a therapist yourself while you're working through this. It's going to be a long road ahead for both of you, and having a therapist may help you to work out how you're feeling about everything, since I know you're probably feeling a lot of different things right now. It just might be helpful to already be seeing a therapist and having them know the situation so when there are rough spots ahead, you have someone to talk to and get ideas for how to work through it.",
            "ok so I'm going to cop a lot of hate for this but, where was he for those 2 days? I've had friends who have had partners that have claimed a similar thing even going so far as to go to the dr only to later find out those days were spent at anothers womans house (then claimed that was during their \"breakdown\" so they cant be held responsible for that",
            "Can we stop with the armchair diagnosis, everyone?",
            "I’m so sorry to hear that.  I’m so glad he’s getting help.",
            "In some ways, this is one of the better possible outcomes (it’s not just that he’s a massive jerk; he’s sick and getting help). I hope you both do well in the future!",
            "Sad to hear about your husband's state of mental health. Hope you guys can move forward in wellness together.\n\n  \n\n\nJust goes to show all the \"he must be abusive\", \"you should divorce him\" posts, I know it's a relationship advice forum, but people really love to jump on the \"end it all\" option. This is people's lives you are talking about, everyone goes through tough times at some points.",
            "So sorry to hear and I hope he feels better. Sometimes we automatically react with anger without knowing what the bigger issue is.",
            "Thanks for the update. Hope you are well. ",
            "I am so sorry that you are going through this but I am happy that you now know what’s going on. I hope things get better for you and your family.   ",
            "I’m glad he is getting the help he needs. ",
            "Sending love to you and your family. ",
            "here’s to hoping it’s more “nervous breakdown” than lifetime illness, I sympathize with your struggle OP, good luck!  ",
            "I’m so sorry. I hope you are able to find an amazing doctor that can help you both through this. Please lean on family and friends to help you w your baby. ",
            "Well... didn’t think it would escalate into that. But at least he’s getting some help! I wish you and your bubba the best. He needs to go get help and you need to do what’s best for you and your LO while he gets better. I personally wouldn’t hold it over him but atm he’s a risk not only to himself but to you and your child. Good luck. :) ",
            "Wow. I wasn't expecting that. So so sorry to hear it. Take care.",
            "OP, I'm so sorry you're going through this. I can't imagine what these few days must have been like. \n\nMental illness does not need to be a hard road. Sometimes it is. Many times it's not. Many people have undiagnosed mental illness that affects them and their family for a lifetime. It's good that he is being treated. Whatever he's diagnosed with can be managed with patience (from him and you), the right medication, awareness, and therapy. \n\nI suggest you get a therapist, even if it's just to process these events and what your family is going through. This kind of sudden change is traumatic. You'll need support and a place to process everything and start building an understanding of your husbands diagnosis / symptoms. \n\nJust remember: it'll be okay. If your husband takes care of himself after discharge (staying on the right meds, for instance), and you take care of yourself as well, you can both lead a normal, happy life. What happened is scary, but it doesn't have to ruin you both!\n\nBest of luck! ",
            "Thank you so much for taking the time to update us. I'm so sorry you're going through this. I wish you all the best. ",
            "I know this is a difficult moment in the both of your lives. Mental illness comes with its challenges but it also has a hidden beauty not everyone sees. It brings you guys closer if you work together and remember to be kind to yourselves and to one another. I've been diagnosed with depression, and ocd. I've come to find stability in my flat has been my biggest help. Having a sanctuary and know there's love there. You can be part of that for him. Journaling is also extremely helpful in helping reduce stress when life feels overwhelming. I don't know what he's particularly dealing with but if you ever need an ear or some advice don't be shy. A quote that helps me personally is \n  \"Every day may not be good, but there's something good in everyday.\" \n Sending lovely vibes! \n",
            "As someone with a brother who has Schizoaffective disorder, I think it's common for the healthy family member(s) to be forgotten. So don't forget to put your mental health first! Of course be supportive etc, but perhaps talk to your own therapist, or a support group. Ask for help. There's no reason to throw your own health down the drain! (Not saying you are, it's just an easy trap to fall into). There's still stigma around mental illness so take it one day at a time! ",
            "I am so sorry, OP. I cannot even imagine how difficult this must be for you. I hope he is able to get the help he needs and that you are able to get the support you need too.",
            "I just want to say thank you for updating and bringing more mental health awareness to this sub. ",
            "Hmm sounds like a schizophrenia, or schizo-affective disorder. They can be super scary sounding.but with appropriate and carefully monitored medical care, patients can live relatively normal, productive lives. Good luck ",
            "[deleted]",
            "I hope you're able to take care of yourself! All the the best and love for you and your family! ",
            "Well wishes to both you and your husband, I hope he stabilizes as soon as possible, and that things go better for you guys from here on out.",
            "In your previous post, it could be perceived that your husband didn't seem like his usual self, as you described he never had a breakdown like that. Anyway, I think it's always best to try to understand what's going on with someone, as it's very difficult to know what's on their minds.\n\nPeople can be going through things we don't even imagine, no matter how close we are to them! Not an excuse to some behaviors, but sure something to think about. Especially now we know it's an ilness.\n\nNow that you're finding out what it is, I hope he can get the proper treatment and that he never does anything like that again. May you guys have a great life together! Good luck and God bless you!",
            "Oh my goodness. I wasn't expecting that outcome. I hope he is better soon. Hugs",
            "I won't be surprised. Where I work have a psychiatric hospital and the police pick up so many patients wondering on the streets without prior. I hope OP's husband will stay compliant with his treatments.",
            "There are some great medications for what I suspect is his problem. The challenge now will be to stay away from substances that trigger his condition. Your husband will soon be in the driver's seat. Try to relax and hold out. It'll be ok.",
            "Oh I'm so sorry to hear that - that is scary.   But the good news is he was diagnosed and hopefully can be managed.  I wish you and your husband the best.",
            "I’ll be praying for you and him❤️",
            "I hope he continues to improve. What a terrifying thing to happen (and honestly one of my worst fears) but it sounds like he has an amazing support system in you and is in a good place to improve. ",
            "I'm wishing your family the best, hope the doctors figure out his issues and treatment soon. ",
            "I’m so sorry this happened. At least he’s getting help so you can both build your family with this new element.",
            "Oh no. I'm so sorry. I'm glad he's in a safe place and getting the help he needs. How are you and your daughter doing? Do you have family and friends looking after you? ",
            "I'm sorry you have to deal with this. If you don't have a good support network of friends or family, please consider finding a support group.",
            "Yeah I’ve seen is happen before and it’s always crap. I’m glad to hear your dude is doing better. I hope for his speedy recovery and I wish you both better days going ahead.",
            "Well, I'm sorry that this has happened. I wish the best for you and your family. ♥ ",
            "Thank you for the update. I'm sorry you're husband is ill. I wish you two the best in the New Year.",
            "That's a terrible thing to have happen and I'm really sorry that it did.\n\nI read that post originally and I'm at least glad that he's not just an asshole. I suppose that's not much consultation, but hopefully the two of you can get your loves back to normal with proper treatment.\n\nBest of luck to you.",
            "I remember seeing your last post. I'm sorry he has to go through this right now (and you too). I'm glad that the cause was found and I hope your both have a happy and healthy future now that you know what's going on ❤️",
            "Good luck and best blessings for you and your family OP. You can get through this.",
            "I'm so sorry OP--although I guess its good that you have some idea what's going on? He's lucky to have you. Good luck to the three of you.",
            "Hey there. I’m really sorry about what happened to your husband and for what you’re going through. ",
            "Thank you for following up, Iwere glad to hear he's safe. There's a long road ahead and we're glad he's getting the help he needs.",
            "Is this in usa or uk. I am glad police Don't just tazed him and put him in solitary.\n",
            "I wish you strength. Your husband has become ill but you're going to be okay, he's getting help.",
            "There's a lot of stigma with mental illness. I want you to know that it should be thought of and cared about no differently than Alzheimer's or dementia. We don't get to choose what happens to us. We don't get to choose if our mind stays intact, or if it falls apart. And we don't get to choose if that happens in old age or youth.",
            "Wow.. never expected that..??\n\nTake care..",
            "Oh so sorry, wish he gets better soon",
            "Oh my goodness, stay strong through this scary time . Best of luck to the both of you in this diagnosis. You can make it through together, be patient and you will both adjust and learn how to manage . make sure he knows you love him every day. ",
            "OP IM SO GLAD. Not about your husband but that there was something other than an affair. I'm sorry you are going through this. Really wish you guys the best of luck",
            "I’m glad he’s getting help. I wish you both the best. ",
            "I am happy he is already getting well. HEART.",
            "wow, so glad that you got some answers as to why he acted the way he did. i’m sorry he isn’t well, but it’s great that he’s now getting the help he needs. i’m sure you’re feeling a bit lost now as well, so please take care of yourself too. sending well wishes and good vibes to you and your family. hang in there and i’m sure you guys will get through this. “in sickness and in health” can be a really difficult piece of marriage, but it will make you stronger as a couple in the end. big hugs, mama. ",
            "I remember your original post. \n\nMy heart goes out to you and your husband. This will be a difficult road to walk, but with the proper support and care, it definitely is not impossible. Best wishes to both of you, together and separate <3",
            "I had two friends who were dating each other. One had a breakdown exactly how you are describing - he got irrationally angry and started demanding sex, then demanding they adopt a dog (!?) then full blown panic attack. My girl friend was terrified of him but managed to drive him to a psychiatric hospital and he was admitted for 10 days. During that time it came out that he had previously been admitted unbeknownst to any of our friend group. He also refused all help and medication as he was convinced people at the hospital were out to get him. \n\nMy story doesn't have a happy ending, but I write this to say to you that it is amazing that your husband is accepting help! It sounds like he is taking medication and this isn't a small thing. I bet getting back to you and your child is motivating him to get better. This is a great sign and I really hope you can all recover from this and find some normalcy together. \n\n",
            "I'm so sorry for what you are going thru. I'm currently in a similar situation with my husband. We have a very large and very blended family of 6 kids and it's been so hard balancing the daily responsibilities with him away plus trying to be there for him while he is getting the help he needs. Stay strong, this is only temporary and once he is receiving the proper treatment for his disease things will be better. For your own good, only include people who are supportive of your husband getting the help he needs. ",
            "I’m so sorry for you and his situation. Mental illness is a disease and one that tragically isn’t taken as serious as it needs to be. I truly hope you guys have the best of luck as you go down this road together ",
            "Oh gosh, don't forget to take care of yourself while taking care of your husband during this time. I remember my dad going through my moms first few intense bi-polar cycles and holy crap- he needed a break and was way, way, way too wrapped up in her to let himself. He wasn't doing himself or her or, my brother and myself any favors by not giving himself a chance to breath. Even one night out of every month to just eat a meal alone, to go to the bookstore and relax, to remember life is still going and that you are doing the absolute best you can in this difficult situation. ",
            "I hope you are doing ok ",
            "Can you have someone come stay with you when he comes home? I worry with a baby in the house. ",
            "You are an amazing supportive wife, I'm sorry you are going through this. ",
            "You are aware a rock. Stand sturdy and help him through this. I have high hopes for success!",
            "After reading your first post I kind of wondered if something like this might have happened. I'm sorry to hear that you are all going through this but hopefully he will get the help he needs. \n\nYou need to be prepared for the fact that he might not be the same person. I am not trying to scare you, but unfortunately I speak from experience. In those two days he could have done any number of things that normally he would never do. He might not remember them. He might endanger you and your child. This is not to say that's the case, merely that you need to take those possibilities very seriously. I would urge you not to fall back in to comfortable routines when he returns, even if that feels most helpful in getting back to normal. He needs to get tested and be seeing a psychiatrist and adjusting meds very regularly, and you need to come up with a plan together for how to identify symptoms and work together as a team to keep him well, if that's the best for all of you.",
            "[deleted]",
            "I'm really sorry if this is the case, but you should go through an evaluation to see if he has Huntingtons disease. I worked with a woman last summer with that illness and how it started for her reminds me of this story. Be safe. Sending love to you and your daughter. ",
            "Could it be do to a medication he was put on? It’s often not told to patients that the medication can make psychoses much worse ",
            "Remeber all the people who advised divorce on original post? good job to you'all.",
            "Please be careful. If he's mentally unstable then it may not be safe for you and the baby to be around him.",
            "Bipolar schizophrenia often shows up in a persons 20s. ",
            "So just curious, what kind of mental illness is it? ",
            "I don’t know all the medical knowledge on this but my friend experienced similar with her husband. If you’re speaking about schizophrenia, there is a temporary condition of it that is caused by immense stress. Perhaps the newborn baby and all that entails broke something in his brain and perhaps it is temporary. I’m only saying this as it happened to a friend of mine (husband was stressed from work) and he was in the late 30- early 40’s age as well. It lasted a good few months but he recovered. \n\nMaybe someone with more knowledge can add to this or someone with more energy to google. ",
            "Called it!  \nI hope he gets all the right treatment and you two can work through it and come out smiling.  \nGodspeed and all that.  \n",
            "I see the future, and in the future, things are fine. ",
            "You need to either get in line with the reality of your situation or not.\n\n\nYour husbands needs someone or something, you can choose to be reassuring to that of not.\n\nHelp him no matter what is my vote, kindness doesn't mean complacently, help, helps. ",
            "What was the illness out of curiosity?",
            "Hmmmm something ain't right...",
            "He could be pulling a Walter White.  I still wouldn't rule out cheating.",
            "[deleted]",
            "[removed]"
        ]
    },
    {
        "post_id": "f9ue25",
        "author": "loveiscoolyay",
        "title": "UPDATE: I (26F) want to propose to my boyfriend (25M) but just found out he plans to propose as well",
        "url": "https://www.reddit.com/r/relationships/comments/f9ue25/update_i_26f_want_to_propose_to_my_boyfriend_25m/",
        "score": 10879,
        "num_comments": 257,
        "created_utc": 1582728897.0,
        "selftext": "Link to my original post: \n\nhttps://www.reddit.com/r/relationships/comments/exp0i0/i_26f_want_to_propose_to_my_boyfriend_25m_but/?utm_medium=android_app&utm_source=share\n\nSo yesterday he took me to run errands but he \"randomly\" decided to we should just have fun instead. He took me around the city, we tried all kinds of food, had honestly the most fun I've had since I was a kid, made memories off of little moments, I didn't think that much of it. I realized that the whole day had basically been an all day-date, I knew it had to be coming and I had the ring with me and I was going to try and propose at the same time (someone suggested this in my original post and I thought it would be cute) \n\nHe opened my door, walked me down a beautiful pathway and just looked me in the eyes and I said yes. He laughed and dropped down to one knee and I started crying and forgot that I was supposed to be proposing too. I don't even remember what he said, he was on his knee for a while saying what I'm sure were the sweetest things, but I was too busy crying. I'd already said yes before he even got down on one knee so he put the ring on my finger.\n\nWe went home and and I realized I didn't propose, he wanted to shower and we sometimes shower together so I proposed to him in there. He smiled and said “I wonder if when our first kid is born will it top this moment” then because I was on my knees in the shower he had to make a sex joke 😂\n\nAfter we got out he held me while we called his parents (I'd already called my whole family in car ride home) \n\nYesterday was amazing and now I'm laying next to him while he plays video games and he's talking about our engagement to his friends and I couldn't be happier and I don't know how to contain all this and just ugh! I love you Nathan!❤️\n\nEdit: Thank you to everyone congratulating us! I appreciate it very much 😊\n\nTL;DR: He took me on a romantic all day date and popped the question. I was supposed to propose at the same time but was too busy crying form happiness, I proposed to him in the shower when we got home😂 I'm overjoyed right now!",
        "permalink": "/r/relationships/comments/f9ue25/update_i_26f_want_to_propose_to_my_boyfriend_25m/",
        "comments": [
            "Congratulations! Sounds like a beautiful day, very happy for you both!",
            "Yes, bragging to the boys!",
            "Congratulations! My name is also Nathan and I too am planning on proposing soon, hopefully it goes as well as yours",
            "This is so disgustingly wholesome and it's melting my cold heart :') Congrats!!",
            "You guys sound like you’re made for each other! Have a great life together and don’t forget the good times because you’ll need them to get you through the not so good times!",
            "These are the updates we love!! Congrats! ❤️",
            "Please write all this down, and send it to a movie producer! \n\nA thousand times congratulations!",
            "This is the best! My SO and I both planned surprise proposals, but he did his first. I'm not mad though. Congrats!!",
            "Congratulations! \n\nWe expect to be seeing you in the weekly love fest posts. No pressure!",
            "What a lovely update! congrats to you both!",
            "This is so wholesome it brightened my day! Congratulations on your engagement, you sound like you have an amazing relationship!!",
            "I'm not crying, you're crying! Srsly one of the sweetest things I've read on Reddit recently. Congrats, OP!",
            "Aw congratulations! I hope everything works out wonderfully ☺",
            "This is so freaking cute! Congratulations! ❤",
            "Monica and Chandler call back! \"This is why women don't propose!!\" Through sobs haha. Congratulations you two",
            "Ok this made me smile right in the middle of my office :’) this is adorable!",
            "OP you had no right to make me cry like this, this is the sweetest and most cutest thing I’ve ever read in my life 😭💕💕💕",
            "Omg you guys are so cuuuuuute!! 😘 Congrats!",
            "Best wishes to you both .Enjoy the hell out of it as couple",
            "This is just what I needed today, such a wonderful story. I wish you many happy years together! Congrats!",
            "woah this was really weird to read... my boyfriends name is nathan!! wish he was the one proposing too lmao \n\ncongrats so much !!!",
            "I love happy posts on this reddit. Congrats!",
            "Congratulations,  I would of done same thing !",
            "Both of you! Work to keep the romance alive...",
            "Gahhhhhhh this is so cute",
            "IM SO HAPPY FOR YOU!!!! THAT is just so ADORABLE and thank you so much for the update!!! Ahhhh how cute!!! Thank you fir sharing all the happy!!!",
            "this was so sweet, wish you two all the best and many beautiful days together",
            "That is so sweet it made me cry sitting on the bus! I’m very sensitive lol. Congratulations! ❤️",
            "Well this brightened my day immensely, been having a horrible time lately. Thank you for sharing your story and wish you both the best!",
            "This is such a refreshingly happy post that just made me smile. Best to you and your fiancé ... what a great story to share with your family and friends... and maybe  some kids down the line. Congrats and enjoy this blissful time!",
            "Congratulations, what a beautiful story. Best of luck to both of you.",
            "Wait until he proposes. Get real serious look. And say “nah cuz u marrying me beeyatch”",
            "this is such a sweet story, I'm so happy I started by day reading this. congratulations to the both of you 💕",
            "Congratulations! God bless you guys",
            "Aww this is sweet to read, wish you guys the best :) congratulations!",
            "If I could upvote this more than once I would. Congrats, you guys are so sweet!",
            "This is so cute and wholesome. Congratulations!",
            "Well, this is fuckin' cute. Thanks for the smile.",
            "Ugh, it's so cute I'm gonna vomit.\n\nSeriously, though, congratulations!",
            "Oh gosh that's so cute, so happy for you!!",
            "what a great story to wake up two - i wish y’all a lifetime of joy, happiness, and good vibes <3",
            "This just made me so happy aw how wholesome",
            "That’s some wholesome shit, it’s making me uneasy",
            "Congrats!!! My heart is filled with such joy for you guys!!",
            "Derdini sikeyim! It means Congratulations in my native language ❤",
            "And no matter what struggles come your ways remember this moment and how much you love each other!  People have these awesome moments and when times get hard or the relationship gets rough forget these moments!  I wish you guys the best of luck and a long happy marriage!  Congratz!",
            "This is the most romantic story ever. What a beautiful couple. Hope you are this happy for the rest of your lives :-)",
            "Omg, this is so beautiful. Im tearing up. Congrats girl. Have a lovely ever after.",
            "You guys are #relationshipgoals I swear.  I hope one day I find a relationship with this much love in it.",
            "AWWWWW so incredibly happy for you both! 💗",
            "Cuteeeeeeeeeeeeeeee :') Makes me so happy!",
            "This definitely made me smile. Congrats!",
            "So happy for you! I wish one day this happens to me too x.x",
            "I'm dying at how cute this is, congratulations to you both!",
            "What a wonderful proposal! I am so glad I am not the only one who had NO IDEA what my fiancé said when he proposed. My internal monologue was like, \"Ooooh, that's a pretty ring on my dessert, I wonder why it's there? Is it a birthday present? Why is he kneeling? Oh, shit, what did he just say? Fuck, did he just ask me a question?!?!! What do I say?!!!!\"\n\nThe world's most wavery, questioning \"Ye-e-es?\" came out of my mouth because I could not tell you for the life of me tell you what he said when he proposed.",
            "Aren't we meant to say dump him and move on? That's what we usually do here.\n\n\nI'm hard pressed to actually say it now. He sounds great.\n\n\nCongratulations",
            "Can we just pin this or something?  I want to see it all the time.",
            "This is the good stuff that I come to reddit for.",
            "i am so insanely jealous! and so happy for a random stranger!       \nkeep up enjoying the little moments and dont let the bad moments turn into bad days. remember, in the end, it probably doesn't matter.",
            "This is so wholesome and beautiful. Congratulations to the both of you. May your life be filled with love and understanding. Congrats.",
            "\"I'm laying next to him while he's playing video games\" so there's still hope in the world for me :)",
            " “I wonder if when our first kid is born will it top this moment” \n\nDA'AWWWWWWW. \n\nI can't imagine a better confirmation that both of you are all-in than the fact that you were both ready to propose at the same time! Congratulations!",
            "What did he say when you explained you WERE gong to ask him at the same time but you forgot ? :P",
            "Congratulations! I decided to forgo social convention and I proposed to my (F26) partner (M30) at a book convention he loves! Naturally mine is my favourite proposal, but this is a close second!! \n\nHe clearly knows you well, as you know him, and I wish you happiness!",
            "This is the sweetest and cutest thing I've read today. Congratulations to you two! Marriage is a wonderful thing ❤",
            "That awesomeness will add a pep to my step as I go about my usual day.  So happy for you both.",
            "Love this :) wholesome material",
            "|  He smiled and said “I wonder if when our first kid is born will it top this moment” then because I was on my knees in the shower he had to make a sex joke\n\nCongrats to you! I just wanted to note that this is a hilarious reversal of the old joke where the guy gets down on one knee, pauses... then ties his shoe or something.\n\nIn this case, guy thinks \"oh boy, oh boy! awwww... she's just proposing marriage\"",
            "Congratulations!! I love updates like these ❤️",
            "Congrats! This is so cute",
            "This made me smile. I want this someday. Good on you, and congratulations :)",
            "Congratulations! Your story made me really happy. I hope the years treat you both well.",
            "Made me cry lol congratulations",
            "I'm so happy for you! Congrats!",
            "This is so beautiful 😭. I'm so lonelyyyyy.",
            "Oh wow that is so romantic!! So happy for you",
            "That sounds epic!  I love this story!  Well structured too!",
            "this is so cute i'm gonna get a cavity. congrats!!! ♥",
            "Why am i in tears smiling like an idiot lol, congratulations ❤❤❤❤❤ such a happy coincidence ❤",
            "Its the cutest thing I ever read on this sub! Congratulations !",
            "Didn't see the original post, saw the title, knew it would be good.\n\nDid not disappoint. :) Congrats OP!",
            "Congratulations!!!  I know the paralysis you felt!  I always planned to get down on one knee during my proposal, just like Holly in The Office, but when it happened, I was just so shocked and moved that it flew out of my head.\n\nWishing you many happy years together!",
            "ADORABLE! Best of luck to you both.",
            "Thank you, I really needed a sweet, positive story like this. It's been a rough week and you seriously just perked up my day. Congratulations and may you both have a long, loving life together!",
            "Awww. Congratulations! When my husband proposed to me, I didn't hear a single word either. And he had a big speech prepared because we were in Harry Potter World at Universal and he was wearing a sorting hat. lol....",
            "My heart! Congratulations!!!",
            "Congrats!! What a sweet story.\n\nMy fiancé proposed to me on our morning walk just about a month ago and I surprised him with a ring, too. :) We called it \"the counterproposal.\" Added a real surprise to it all and now he has a pretty engagement ring, too!",
            "Congratulations to you both 💛💛💛",
            "This is so so so cute and you seem so in love. Congrats <3",
            "Your plan to propose to your bf reminds me of the movie Leap Year with amy adams! BecUse apparently there’s a tradition where girls can propose during the leap year.",
            "Always love seeing happy updates and positive relationship stories on this subreddit. Congrats!!",
            "Ohmygod this is so cute",
            "Wow!!! That sounds like a movie...that's so beautiful. Congratulations!",
            "Congratulations! Wish you a very happy life together, health and many kids",
            "This is adorable and gives me hope!",
            "Grats!! Enjoy your love!",
            "I was reading through this, and saw the name Nathan (your fiancee and I share the same name). Honestly, this seems like something my girlfriend would do too.",
            "If I could upvote this 1,000 times I would!  Congratulations!",
            "I’m a dude and I love this story!! I’m happy for you both\n\nI love how u hang out with him when he’s playing video games; I wish my gf did that T.T",
            "LITERALLY I'M CRYING, SO BEAUTIFUL!!",
            "Absolutely vomit inducing and adorably wholesome. Sounds like you're in for a successful and happy marriage. Already so in sync and on the same page. Wish you nothing but the best ♥️",
            "[deleted]",
            "Omg 😍\n\nIt's really cool your switching the norm and were gonna purpose to him!",
            "Aww, congratulations!",
            "Don't you get freezing cos like only part of one of you gets the water at any given point?",
            "My boyfriend made me cry too, but not for the same reason. Congrats! He did it right!",
            "So much positive envy for you.",
            "This is what DREAAAAAAMS ARE MADE OFFFF!",
            "😭😭😭😭😭😭😭😭😭😭😭\n\nJust crying tears of absolute joy about your story in a busy restaurant, nothing to see here. Congratulations!",
            "Gahhh, so sappy. I hate how much I love this. Congrats!",
            "I'm really happy to hear this positive story. Thank you for sharing. \n\nThe internet can be a negative place sometimes and I was quite calm and accidentally went down a very negative rabbit-hole. \n\nThis is taking me out of it, feeling good in my heart, feeling hopeful for the future. \n\nYou are kind and I wish you well. \n\nThank you. (:",
            "That is so amazing! Congratulations to you both!",
            "Sounds like you're both winning at life",
            "This is so fucking cute",
            "Well this is delightful! Congratulations!",
            "Haha I can confirm that blanking out during proposal is real! At the time I had an eloquent speech planned for my girlfriend but all I could get to come out of my mouth was \"let's be together\"\n\nCongratulations!",
            "Just so I have some cool date ideas for the future, can you please tell me what activities you done on your all day date",
            "Ugh now I want to propose to my husband of 18 years. Congratulations to both of you. You’ll have a great story to tell your kids someday.",
            "I love this story! Congratulations!!",
            "Super cute story! Congrats to you both!!",
            "The proposal in the shower is the cutest thing ever and such a great story to tell! Love it. Best of luck to you two!",
            "This wholesomeness is what i can one day hope for. Can I have that relationship overlords?",
            "I’m happily married, but I’m jelly. :) but good jelly.\nHaha. You guys are too cute! So happy for you two!",
            "this is the kind of quality content i sign on for",
            "This 😭😭😭😭 congrats. This made my day!!!",
            "This is the content I like to see 😭 congratulations!",
            "I’m so happy for you!!!! This is the sweetest story and it’s great you have it documented to save for memories too 😊",
            "Congratulations to the two of you!\nWhat an uplifting story!",
            "Oh my gosh so cute. My heart 😭♥️",
            "Man everyone needs to read this. That's a lot of good energy, and congrats OP!",
            "Very sweet. Congrats to you guys!",
            "More wholesome than 9 grain wheat bread 🥰 Congratulations and good luck",
            "Omg this is too cute! Congrats! I’m so dam excited for you and was jumping around like a damn fool like I know you. But seriously so cute! Be happy and I hope you love each other more with each passing day",
            "Congratulations!! That was so amazing!",
            "I can’t wait to share this kind of love and happiness with someone. So incredibly happy for you, good luck on your journey together",
            "Congrats! So happy for you!",
            "This is so freaking wholesome. Happy for you both.",
            "I'm not weird, I just find this as extraordinarily wholesome, and will now save this story.",
            "I feel like if you both had plans to propose it must really cement the relationship even more for yourselves.",
            "Thank you for sharing this.  It's the sweetest.  ❤",
            "This is so perfect it makes me sick",
            "This is adorable.  Congratulations!",
            "Awwww! This is so sweet!",
            "This was so so nice to read. Congratulations op💗",
            "This was the BEST update I’ve read so far!! Congrats to you both!",
            "The day one proposes is so so nerve-wracking for the first chunk, but amazing afterwards.",
            "Omg!!! So happy to know there are love like yours. I wish the best to you two ❤️❤️❤️❤️❤️❤️❤️❤️",
            "This is so sweet. I also remember reading your original post! Congratulations! It sounds like your life is full of love and thank you for brightening my day by sharing it!",
            "I wish you all the best, you sound like your living your most perfect life right now so enjoy it! ❤️",
            "GURLLLLL\n\nCONGRATULATIONSSSS!!!!!!!",
            "Um excuse me, ring tax?",
            "JFC This is disgustingly adorable. I wanna be your kid. Interested in adopting a 30 yr. Old?",
            "Congratulations!!!!! My wife completely changed my life. May you have many decades building a beautiful thing together.",
            "What a cute story. Congratulations! You may wish to propose again on the 29th of February. It’s a traditional reversal day for marriage proposals",
            "who is chopping the onions??\n\n&#x200B;\n\ncongrats OP!",
            "Reading this makes me so genuinely happy. Congratulations!",
            "My friends proposed to each-other",
            "Wasn’t prepared to cry rn 😭",
            "What a great story to hear! Congratulations!",
            "Congratulations to you both and the best wishes to a beautiful future together!",
            "No question on what the answer will be.",
            "im melting this is too cute",
            "This is the cutest story I've read on here so far! I'm so happy for you guys!!",
            "That makes me smile! Wishing you a long happy life together 💛",
            "Congratulations OP!!! May you have a lifetime of happiness together. :')",
            "As long as you both care deeply for each other, there will always be moments that top the last (from what I've experienced with my person.) Good luck on your journey, I hope it lasts a life time!",
            "Congratulations,  happy for you  both.. love is the most beautiful thing.....",
            "Congratulations! Recently I heard about dual proposals... somewhere, just can’t remember where exactly! I’m sure he’d feel the same way if YOU surprised him right back. Doesn’t matter if you’re already engaged, it just really solidifies the commitment! Wishing you both the best!",
            "Congratulations and really happy for both of you from the bottom of my heart :) \n\nStay happy and grow old and strong together :)",
            "Funny, as I'm reading your post (and I also read the 1st one) the song Nickelback: what are you waiting for? Is playing. But what I'm really saying is CONGRATULATIONS girl!!! Just reading your post you got me all happy and excited!! Congratulations! ❤❤❤❤❤",
            "At least you too are on the same page. My gf broke up with me as a tactic to force me to propose to her.",
            "Wow if thats not love",
            "I'm.single any interested to message me direct",
            "Please never Propose to a man, respect yourself.",
            "You two are the epitome of couple goals. Congratulations!",
            "In today's time very few relationships reach this stage. When I see relationships getting stronger with a lifetime commitment, I feel very happy. Congratulations to you both.",
            "You both are blessed. Stay happy forever. ❤",
            "This was so wholesome omg I love it🥺 congratulations!!",
            "🥺🥺🥺 I love love. Congratulations!!!!",
            "Grr that is the best story. Congratulations.",
            "****GASP**** SEX BEFORE MARRIAGE BUT DURNG THE PROPOSAL SINNER",
            "Reminds me of Spider-Man meeting Spider-Man.",
            "This post just made my day ❤️",
            "Dont get married . All my are liars and cheaters.\nThey will all eventually neglect you.",
            "I think you should wait for him to propose and the say something along the lines of \"well that funny *whips out ring or something* that was my plan all along!\" And basically have a counter proposal. And if it does become a fight of who says yes to who you settle it with rock paper scissors.",
            "I think you should concentrate on ur proposal, it would be really amazing if you guys proposed at the same time. Best of luck.",
            "I really don’t see the reason for this or the original posts existence.",
            "I've never heard of a woman proposing",
            "TIL my life is shit and nobody loves me.",
            "Thank God you didn't propose first .I find women proposing  very thirsty and desperate. Let the man lead and let him propose nevertheless Congrats.",
            "Oh poor you. Must suck.",
            "Wait till he proposes and then respond to him going onto one knee by also going onto one knee. It will require you to carry the ring around often but the gag is well worth it haha"
        ]
    },
    {
        "post_id": "cxgnob",
        "author": "Gerrrrtty",
        "title": "My (30F) husband (32M) impulse bought a dog. [update]",
        "url": "https://www.reddit.com/r/relationships/comments/cxgnob/my_30f_husband_32m_impulse_bought_a_dog_update/",
        "score": 10387,
        "num_comments": 176,
        "created_utc": 1567170329.0,
        "selftext": "Update to https://www.reddit.com/r/relationships/comments/cmu75w/my_30f_husband_32m_impulse_bought_a_dog/\n\nThank you all for the thorough responses. I read every comment you guys sent.\n\nA few months ago I read a post where a woman sat down with her husband and outlined everything she takes care of at home in a list format. Like, kitchen: trash, dishes, wipe counters down. Etc. That way of communicating really stuck with me and when we went to see our therapist, I used the same format to express how much I do for the dog.\n\nMy husband told me that owning a dog was a joint effort and since I’m home all day it shouldn’t be a problem.\n\nWhich is when I realized that has been his excuse for everything. Cooking, chores, cleaning. I’m not sure how I became blind to it. I don’t know when I started bending over backwards to accommodate him.\n\nWe used to be a solid couple who helped each other out. I remember when I was still in school he’d come over to my apartment and clean the whole thing for me during finals. Or he took care of my elderly cat when I was away for a week and a half. He used to help me dry the dishes and it was always fun. We used to have so much fun and laugh all the time. At some point it all stopped.\n\nI started crying right there in the middle of a sentence and he got concerned. I’m not a cryer the only time he’s ever seen me cry was when I had to put my beloved cat down a few years ago. But he held me for the first time in what felt like months and we had a serious heart to heart about how he made me feel. Not only with the dog but how stressed I’ve been with my job, how lonely I am, I don’t feel important and how we don’t feel like a team anymore, that I’m worried about us.\n\nI guess it clicked for him because he really stepped up taking care of the dog. He started going into work earlier so he can come home early and hang out and make me dinner. It happened slowly over the course of the last few weeks and the routine suits us a lot better. We hired a trainer to make sure we can understand the dog’s boundaries together and the dog sleeps in a dog bed. Our bedroom life has slowly gotten back to where it was when we got married. We’re watching our favorite shows again and going out more. I’ve been putting my foot down more about my feelings and he has been receptive. We are still going to therapy for now. \n\nAs for the dog, we’re going to keep him. Is he a No List dog? Yes. But is he a good puppy with a big heart? Yes. We have the money to afford him and he took off after training. It’s nice having a dog again.\n\nTL;DR: husband and I went to therapy, we talked through our problems, we are giving our marriage the time and attention it needs to mend. We’re keeping the dog.",
        "permalink": "/r/relationships/comments/cxgnob/my_30f_husband_32m_impulse_bought_a_dog_update/",
        "comments": [
            "Good job on the communication. Things can sneak up on people and unfair routines can creep in. I'm glad that you two seem to be correcting course for your relationship and it's a big positive that he's putting in a lot more effort now.",
            "This is a wholesome update. :)",
            "Congrats on the progress!! \n\nPro tip: clean Puppy’s skin folds with a baby wipe every other day or so... they start building up yeast in them, which is why so many bulldogs smell funky.",
            "This is awesome. \n\nYour story about the dishes made me think - my dad used to always say that the rising divorce rate was caused by the invention of the automatic dishwasher.  When he was growing up, many couples would stand at the sink and wash up the dishes together - one washes, the other dries/puts them away.  That was a time for talking and connecting in the evenings.\n\nI know that's an over-simplified idea, but it made me smile to think of him telling that story.",
            "I got teary reading this, so happy for you guys (and the dog!).",
            "Glad that things worked out with you guys. But you have to pay the dog tax. :)",
            "I wish more endings happened this way, usually not the case. I hope things work out with the pup! I advise on getting him insurance now while he’s young so any health issues that arise are covered.",
            "This made me so incredibly happy to read. I’m so happy for you guys and that this experience with the dog was able to open both your eyes to the larger issues at hand. I’m a huge dog person myself and I see all the issues the bulldogs but omg are they cute and super friendly. Good luck and I wish your puppy a long and happy life with you two.",
            "Hello, I’m so happy with the update! \n\nI am the owner of a bulldog. They are hard work and the health problems can be overwhelming, but there is a lot you can do to help their quality of life. Frequent walks, lots of exercise, wiping out wrinkles, etc. If you are worried about breathing, there is a surgery you can have on them to open up the nostrils and help them breath better. My parents had a bulldog before I was born and she was a happy and healthy dog who lived to be twelve. Good luck!",
            "It's amazing when you find the exact thing that you have been trying to put your finger on to say \"this is what is bothering me\" and suddenly the other person gets it.  It doesn't make one a winner and one a loser. It makes both a unit again united against this hurdle that is an obstacle for both of you now.  I am so glad you posted this.  It makes me realize how much I take for granted in my relationship.  Thank you!",
            "Glad you’re keeping him!! As a vet tech who has seen the medical bills of bulldogs I would highly recommend getting pet insurance for him while he is still a puppy and has no pre-existing conditions, it will save you a lot down the line",
            "It’s nice to see a positive ending! It’s crazy how relationship dynamics can change without realizing it like you mentioned. You guys worked through it together, as adults should. Thanks for sharing!",
            "I'm glad that you realised what was happening, and I'm super glad that he realised he needed to step up his part to not lose you. And while I agree on the no-list-dog thing (not a fan of unhealthy breeds, like you!), I'm happy that the pup at least has a happy home now. Thanks for the update!",
            "I'm so happy for you! Just remember not to make excuses for him when he starts going back to his old habits.",
            "OP, you're not allowed to make a post like this without posting a picture of your puppy",
            "I just stumbled upon this thread and I'm dying to know, what did you name your dog?\n\n\n\nI'm also not only glad for you to patch things with your husband, but glad you kept the puppy if you can afford to tend to his needs. It's never cool to spring a huge (living and snorting) responsibility on someone like that, but it would be sad to think of him going to a home where the folks aren't prepared financially or have the time to take care of a pet with needs outside of food and poop baggies. I hope he rewards you with many years of love!",
            "I'm glad it worked out for you ! and despite the health issues the dog will have it's better living with a family who cares and will allow for surgeries to make life easier for the dog. just please make sure he sticks to his word ! and also, you gotta pay the puppy tax !",
            "It's nice to see a positive update.\n\nAnd welcome to Bulldog ownership.  They are certainly not low-maintenance dogs, but they do know how to get right into your heart and stay there.",
            "we need to see picture of dog!",
            "Tbh I’d still be pretty livid about the dog and not able to trust that your husband will actually be there for you, if I were in your shoes.  But it sounds like good steps have been made. Just make sure you all keep on the right path!",
            "Great update . Good job on getting things in your relationship back in good working order . Also bravo on the continued therapy , it’s a great way to keep things on track .",
            "This update made me tear up :’) I’m so happy that you were able to have a real conversation with your husband and that he was receptive and has stepped up to the plate. Every relationship has ups and downs, good on you guys for communicating together and rekindling your love, that’s what a good relationship is all about.",
            "Thats great! Sometimes insensitivity and selfishness isn’t from being a horrible person, it can just be from being in your own world a little too long. Its great that he started to understand his actions and words and is doing what he can to make things better.",
            "Not gonna lie, was a bit worried the first half of this. Good for you OP, I’m glad everything’s working out for all three of you.",
            "This is a wonderful update. Thank you so much for coming back and letting us all know.\n\nI'm so happy for you that you found a way to communicate all your problems and potentially over come them. It is a huge step. It sounds like you're doing really well!",
            "This is amazing to hear. You were able to communicate and he was receptive. You guys got this.",
            "I am so very happy to hear that everything is working out for you and husband is putting in an effort.\n\nPlus happy well adjusted dog story as well. You were so smart to bring in a trainer and learn techniques on how best to care for and interact with dog and help him understand his place in the home and be happy with consistent interactions with you both.\n\nI think I can stop reading reddit for today and just be happy for you, your husband and dog.  Your story put a big smile on my face.",
            "Glad to hear!\n  \nCommunication is the first step!",
            "This makes me so happy!!!",
            "This is what I needed to read this morning.  Good for you",
            "What is a \"No List\" dog?",
            "This is awesome to hear. I know exactly how you feel about working from home and being expected to take care of everything. Even the surprise dog (sigh). Every couple of months I have to remind my husband that he lives here too. Also I put my foot down on a house cleaner, took so much stress off. Good luck with the new pup :)",
            "Thank you for posting this, it was so refreshing and heartwarming to read. You've found a husband who is willing to acknowledge his failings and work on them which honestly is amazing and you don't hear enough of on Reddit. You're lucky to have each other and I'm happy you're getting back on track :)",
            "What am amazing update. Good luck to you.",
            "Congratulations on a wonderful update!  You are moving in the right direction.",
            "Awesome update! I wish my (ex) SO had done the same when we adopted our pup. Instead of stepping up or going to therapy with me he got defensive and it was the reason we broke up. Very painful. \n\nI recommend Pets Best Insurance for your pup (no affiliated) because they cover examination fees which are a good $80-$100 at my vet excluding the cost of care! Plus I’ve never had an issue getting reimbursed. \n\nAlso would suggest getting an Embark DNA test done as it comes with an extensive health panel. It give me a lot of peace of mind when I got it done for my rescue pup!",
            "Just some advice, I highly recommend pet insurance. I have a company called Trupanion for my family's pets, including a few who are brachycephalic breeds. Its been invaluable, I. E. they paid for 2 brachycephalic syndrome surgeries once those issues became apparent, cancer treatment for a cat.",
            "Your communication skills are stellar and he REALLY loves you. It takes a lot of effort and desire to change for someone else's happiness. Happy for you.",
            "In this sub we are constantly saying \"Dump him\" or \"leave, this is a red flag\" so easily that we forget that humans are complex and not always bad. That relationships are not black or white, and sometimes therapy and communication help A LOT.\n\nI'm glad this worked out for you two! \nI wish you both (and the doggo) the best.",
            "This sub needs more updates like this and less of the \"I took the advice of strangers and dumped his ass\" updates. In long term relationships you're gonna hit roadblocks--sometimes big ones--and you're gonna have to have tough conversations. Good for you, OP.",
            "the problem is that the dog will always be your priority and not his, hes stepping up for now, but this wont last more than a couple of months...",
            "[removed]",
            "I feel for you. My wife bought a puppy without discussing it with me. It nearly ended our marriage because I work and she sleeps in. So the dog had to be fed, let out twice, and still had accidents for me to clean up while I was rushing to work. It crapped in the house all the time, ate furniture, and was generally a pain. We finally had to give it away.  I don't know what she was thinking.",
            "This makes me so happy :) I hope your little family is happy for many years!",
            "What a great update. Thanks for sharing!",
            "Relationships should be balanced!",
            "Such a wholesome update :)",
            "good happy resolution",
            "I'm glad that everything worked out for both of you. You sound like a good team.",
            "This update makes me so, so happy for you and your husband.",
            "Quality update OP, I'm very happy for you.",
            "That’s great!  Good luck to you both.",
            "Communication can get you through the most simple shit, and the hardest. I view it as owning a company. Cooking, cleaning, laundry, work, entertainment, spending is all ran past the co-owner so nobody is left in the dark, left hurt, etc. \n\nGood for you guys. Sometimes a partner will insinuate how you will feel or will react that they feel allowed to act on impulse based on what they think they know. Your husband sounds like a genuine dude. \n\nHave a long happy life together",
            "Thanks for sharing this update. Unfortunately, I think positive outcome are pretty rare on this sub, so it's always nice to read one.",
            "I just want to say I also work from home (we also got a puppy 6 months ago, in addition to our elderly dog) and I do the brunt of the work and I FEEL YOU. There is a misconception that just because you’re home, you’re supposed to do most of the housework/errands etc. I’ve started putting my foot down. \n\nI used to bend over backwards and not say anything and bottle it up, and then explode. Your approach was much better!",
            "What is a no list dog?",
            "i'm glad that everything worked out for the best.",
            "This is a great post I'm so happy for you three.",
            "Thank you , I really needed to read something positive right now and I am so happy for you.",
            "i’m really glad everything worked out for you (: maybe the pup was the universe’s way of making you realize the things you needed to work out with your husband. i hope all of his health issues work out, i know bullies have some challenges, but i’m sure he is happy knowing he’s loved!",
            "Fantastic update,  so happy for all three of you",
            "Such a beautiful update! \n\nPlease let me share my experience with my dog with health problems.\n\nI too had a list of \"off limit dog breeds\" due to health problems found in pure bred dogs. We got the muttiest mutt you could find. She's a little bit of everything. Six months in she started limping, and licking herself, and chewing herself and having belly problems... My dear mutt has severe allergies, both skin and stomach are affected, and congenital luxating patellas. \nWe had been taking her to our regular family vet but after two years of trying to get a handle on her health we finally sought out some specialists. \nNow our girl has her own allergy/dermatology doctor and an orthopedic surgeon. It's not cheap like the family vet but it's been game changing in regard to her overall health and well being. \nThe dermatologist switched her food to a salmon based diet. Her skin, ears and belly have never been better. The ortho said our girl DOESN'T need patella surgery. She was born with the deformity and she's living with it okay. Unfortunately we did discover she has a torn ACL in the right knee so she's going to have that fixed on the 9th. \nI could've saved my family so much time, grief and in the long run, money if we had just sought out specialists first. Thankfully everything is settled for her finally and we're on the road to a full recovery.\nGood luck with your baby, it's rough but my goodness is it fulfilling 💙💙💙",
            "Yay you have a dog now!",
            "I’m so glad this had a good outcome! ❤️",
            "This is by far the best update I've read in quite a while.",
            "what’s a no list dog?",
            "This is my favorite update of all time.",
            "I'm so happy for you both. And puppy. Be well!",
            "I love these updates. OP, I'm so happy for all three of you.",
            "Nice work, OP. I don't know you, but I'm proud of you.",
            "BEST update. Thrilled for you, hubs, and the pup. I am hopeful this trend will continue. Good for y’all for going to therapy and working it out. I wish you all nothing but the best!!",
            "Yay! So happy that things got better with you and your husband. Even if the dog isn't your favourite breed, you'll learn to love him over time. I'm glad your husband decided to step up and take care of both the dog and his marriage :)",
            "I hope he isn't acting like this to save you back, and then slip back into his old habits :'(. That is sadly a commen thing on these Reddit post. If you see him slipping back into it, please call him out on it.",
            "...I was hoping for a picture of the dog. I’m glad things have started to get better, though. I think this might be a good example of dogs making lives better.",
            "It's nice to read about a situation in which a partner talked openly and honestly about their feelings, and the other party actually listened and they worked it out together. Glad everything worked out for you!",
            "This is a great, wholesome update and I’m glad things worked out for you. Thanks for sharing! Do you have pictures of the pupper too?",
            "OP, I’m so glad he’s recommitting to the relationship and things are looking up. The line about “you being home all the time” was really striking because you are working. It might help to try to continually make it clear that you are working  just as he is.",
            "Yay happy for you! A nice reminder that not everything is a deal breaker and good communication can work through a lot",
            "i feel like update posts are rarely good news. this is refreshing. so happy for you and your husband OP <3 and your dog, too : )",
            "No dog tax??\nYou're required to show a pic of the dog on dog related posts 😊",
            "This is great and the fact that it happened gradually is very reassuring. Rapid, drastic changes never last. He sounds like a good person who just stopped paying attention and has really started thinking about how to fix that.",
            "I have a pug. I had his soft palate shortened and his nostrils widened and it was the best thing I've ever done. Highly recommended.",
            "Great for you two and yeah that bulldog is extremely lucky to have you guys as I believe a lot people have no idea that genetically they are screwed from the get go.",
            "Wish we could see pics of the pupper",
            "So wonderful to hear a happy ending! He's got a good inner self.  Sometimes we need to remind each other of the \"pieces\" of why we fell in love.",
            "Am I the only one who came here looking for pictures of said dog??",
            "It sounds like your husband getting that dog has been a blessing in disguise.  Well done to him for listening to you AND stepping up.  Glad to hear of such an awesome outcome",
            "Wow,this was so not what I expected! It sounds like the dog was a blessing in disguise! Good for you guys!",
            "Awesome update! (Also I’d love to read that post you referred to if you have the link)",
            "Way to go! You handled this like a champ! :)",
            "Appreciate the update. So happy for you!",
            "I'm crying happy tears with this update. What a wonderful response from him, I'm so glad to hear your family is thriving. \n\nRehoming the dog because of health issues removes your responsibility, but doesn't help the dog. You're doing a great thing taking care of this little guy, and it's so generous to realize you're in a position to take this on right now ❤️",
            "Just because he wont help you with chores, he isnt helping out? He makes the money and you're a housewife. Sounds like a team effort to me. Do your part.",
            "This story had me teary-eyed for you 😭 I'm so glad that puppy is well and your relationship is getting better! I'm happy for you in that not only did he take your concerns to heart and act on them, that you guys are both going beyond that and still doing therapy. I think everything will be just fine for you now 🙂",
            "Communication wins again!",
            "That's so wonderful to hear, rarely people these days try to make a marriage work.",
            "What a wonderful update.",
            "This is a bittersweet update.\n\nI'm glad you have worked on your relationship, but your husband has also learned that he can push his selfishness upon you with no consequences.",
            "Happy for both of you, and the puppy too, best of lucks in keeping the three of you happy",
            "At this point fighting is futile. Dog ALWAYS wins!",
            "If you get one from a good breeder most dogs are very healthy. I have a bulldog that’s 7 and he hasn’t had any health issuers other then some ear infections. Mostly on pure breed dogs will have some tho. Better of having a mutt",
            "May I suggest a second dog? It might be nice to get a dog-friendly adult dog from a shelter or rescue that is more of a breed/health status you would prefer. It's good socialization for the bulldog, it's nice for each of you to have your own dog, and in my experience its nice to have a lazy home-body dog and an active dog. My little mutt is my velcro right hand man, and he would go anywhere with me. My boyfriends dog is an old chow mix we got recently with a heart condition so she cant run fast or far, but the pups love each other. They cuddle and wrestle. They also both love my cat!",
            "[deleted]"
        ]
    },
    {
        "post_id": "a1ta8x",
        "author": "AbandonedTraveler",
        "title": "[UPDATE] I [29F] am traveling overseas to meet my online \"boyfriend\" [38M] in a week. He just said he had to cancel",
        "url": "https://www.reddit.com/r/relationships/comments/a1ta8x/update_i_29f_am_traveling_overseas_to_meet_my/",
        "score": 10255,
        "num_comments": 277,
        "created_utc": 1543591023.0,
        "selftext": "So many through comments and PMs requested an update from my previous [post](https://www.reddit.com/r/relationships/comments/9vlueu/i_29f_am_traveling_overseas_to_meet_my_online/) and so I thought I'd do one!\n\nAfter my post I FaceTimed him to say my what I wanted to say and end things. He tried to get me to post-pone my trip and even tried to give me money to make me less mad at him. I told him whatever we had was over as I could no longer trust him. He cried which made me feel weird. I wished him and his ex the best and ended the call. \n\nI went on my trip and had a top class time. The Reddit community really astounds me sometimes. I received a lot of PMs of suggestions of things to do and see and the trip to Ireland became a trip of a lifetime. In Dublin I did meet up with a very kind Redditor who showed me around the city and came with me to a bunch of museums during my stay. I saw amazing sights, met a bunch of really cool people through my travels, and met a few really cute Irish boys. (;\n\nI learned a lot about myself on my first solo trip abroad. I am pretty self reliant and I did a lot of self reflection. This \"relationship\" was my first \"serious\" one after my ex and I split up. I think in my desire for closeness with someone I ignored a lot of red flags and downplayed my self worth. I am now focusing on making real connections with people I meet in real life and have decided to stay away from anything long distance indefinitely. \n\nMy first night in Belfast I did message him after I had had a what was probably too many beers (damn you delicious Irish beers!) and he said he was sorry but it was what it had to be. It didn't really seem sincere and it extinguished any romantic notions I had. \n\nThank you to everyone who commented and PM'd me. It really made me excited for my trip and it was the best time!\n\nTLDR; Online BF backed out but after some logistical rearranging I still went on my trip and had the best time ever. Glad I cancelled the bf and not the trip. ",
        "permalink": "/r/relationships/comments/a1ta8x/update_i_29f_am_traveling_overseas_to_meet_my/",
        "comments": [
            "\"*My first night in Belfast I did message him after I had had a what was probably too many beers (damn you delicious Irish beers!) \"*\n\nFrom Belfast! I have texted many unworthy Irishmen after drinking our delicious Irish beers - I feel you!",
            "> Glad I cancelled the bf and not the trip. \n\nI love this, lol! I'm glad I caught the update post, and am so happy that you went through with the trip! Wishing you oodles of happiness and success in the future, OP. ♥",
            "As an Irish person, I am really delighted to hear that you had an amazing time even if the circumstances that brought you here sucked.\nWell done you for following through and making the best out of the situation! :)",
            "Well done! Glad it was a good experience in the end 😁",
            "[deleted]",
            "As another person who lives in Belfast (hi everyone else) I'm really glad you had a great time! I wanted to reply in your original thread (when you said you'd be travelling solo) that you'll never be solo anywhere in Ireland if you don't want to be, but I guess you've found that out by now!   \n\n\nG'wan ye girl ye! (You have to read that in a really thick Norn Irish accent)",
            "> I learned a lot about myself on my first solo trip abroad. \n\nJoin us at /r/solotravel !! \n\nAnd happy future travels :)",
            "Dollars to donuts says there was no car accident.  She's his wife.",
            "That was your rebound guy: a safe online and long distance relationship, fantasized more than lived.\n\nAnd bonus point for the happy ending that taught you a lot about yourself! ",
            "r/solotravel\n\nIt’s really underrated, traveling alone can be great \n",
            "Yay! I’m so glad you went and had an amazing time! ",
            "Hell. Yes. So glad you went! I love solo-tripping, and actually really prefer to travel alone. I hope this excursion opened some new doors for you!",
            "That's a great update, well done to you!",
            "What a happy ending and sounds like such a great opportunity for personal growth. I'm so glad you had the balls to end things, as it sounds like he was trying to serve one of the classic Catfish excuses (I've watched every episode of Catfish haha). Its always cancer or a car accident!",
            "As an Irish person I'm delighted you had a good time there and I really hope someone you told this story to there taught you the wondeful Irish term 'gobshite' for someone like this who is all talk and no action....\n\n",
            "Glad you had a good trip!",
            "I’m curious about why he didn’t make any attempt to meet up even though OP was right there. It confirms any suspicions that he was lying and hiding stuff because no matter what kind of horrible, serious stuff was going on at that moment after having the kind of relationship that the two of them had he should have had _at least_ enough time to meet up and say hi and maybe have a beer. \n\nIt’s crazy to me that anyone who was telling the truth about their situation wouldn’t have at least stopped by to say hi considering they had been so close emotionally, and now literally and physically! What a scumbag liar he is.",
            "Great update, glad you had a blast! Don't worry about Ireland Catfish - he wasn't worth your time anyway.",
            "Girl, I am so happy to read this update.  I'm really sorry this guy did this, but I'm so glad you didn't cancel the trip, and had what seems like an incredible time!  I wish you all the best. <3 ",
            "fucking good for you!",
            " Maybe an weird question to ask but did you guys discuss the costs of the trip (Flight, transport in the city etc)? Did you have to pay for everything yourself or did he pay for everything or did you guys split?",
            "I used a trip to get over my long time relationship. I was stuck in an emotionally abusive relationship and got the chance to go to australia for a month... I found out I didn't miss him, didn't need him, got home and packed up after a week back. Cheers to solo traveling!!!",
            "I travelled to Ireland solo after being dumped twice in one year. I went when I was 29. My mom also went when she was 29 on an exchange. When she came back she met my dad and the rest is history. I hoped Ireland would do the same for me. When I came home I met my future husband a month later. I took him back to Ireland for our honeymoon. Basically I wanted to say Ireland is an amazing place for solo travel. Glad you enjoyed it!!!",
            "I think Ireland is a fantastic destination to do your first solo trip. Amazing! Glad it worked out :) And yes Irish boys are...great. They are so friendly and easy to talk to.",
            "\"Glad I cancelled my bf, not the trip\" Honestly, you go lol ",
            "Hi, from Belfast! \n\nI'm glad you had a great time and met some decent folk here to have the craic with! Really love seeing success stories from tourists to our shores - please do come back sometime! I'm sure you've plenty more to see, and plenty more pints to neck! ",
            "Girl YAAAAAS!!!  I don’t know you but I’m so proud of you!!!",
            "I just have to say that your first post is incredibily simmilar to how I met my boyfriend. I met him last year on Reddit and we started skyping really intensely and snapchatting and stuff. After two months of talking I booked a flight to Ireland (he lives in Ireland too) and we met up. I told eeeveeeeryone i was going to meet someone, and everyone, both friends and family, knew exactly where I was going, who I was seeing, and I had my own car and knew hostels in the area if i needed to bolt. Also the trip was not as big, as I live in europe too so the flight was like 2 hours maybe. \n\nAnyway, we've been together for a little over a year now and I'm currently living here in Ireland and going to school here! :D Just thought it was sooo crazy how simmillar our stories were, even though they ended a bit differently :) I'm glad you enjoyed Ireland! If you get past the rain, there's some really cool stuff here! ",
            "Real question:  can someone please ELI5 why it's so clear that ex-bf was lying?  \n\nLike, he was spending hours talking to her each day which is hard when you're in a relationship, she saw his house.  Also he was in a relationship with his ex for 4 years, so her getting into an accident would be a genuine big deal?  What is the red flag?",
            "glad you went and had a great time!",
            "I was in Ireland this past summer. What a beautiful country with some of the nicest people I've ever met. Sounds like you had a great time. I'm glad it all worked out and that you got to spend the time learning more about yourself as opposed to wasting it with someone that doesn't have your best interests at heart. Go you!",
            "Your ex must be related to my ex! When I texted her to say how I felt and if this was what being friends was like then I couldn't just be friends anymore. She texted back she was sorry to hear that but it's what it has to be. ",
            "this honestly made me so happy?? I'm glad you had a good time girl- you deserve it! ",
            "I had this exact shit happen to me just this last month. Booked the flight to England, booked the hotel, less than two months before I came out? “I’m seeing my ex and that time off I told you I would have? I don’t have it.”\n\nI ended up not going which maybe I should have, but I did what you did and made my own vacation! I’m so happy you moved on and that you had an excellent time in Ireland! ",
            "This just gave me hope. I've been in a similar situation recently thinking that someone (in the same country) had the same feelings but I was shot down fast. It's my fault, I misread the signs. I had been arranging my entire life to he moved north so I could be closer to her. Those plans have been cancelled but the holidays we planned are still on my list. \nIt seemed pointless going to these places without her but I think a solo travel is just that I need.  \n\nGlad to hear it has all come up roses for you.  ",
            "I'm from just outside Belfast. I wish I'd known about this and I would've made a throwaway account and arranged for me and my friends to meet you for a drink. What an awful thing to do to someone, I can't believe he wouldn't even take some time to go and meet you for a few hours or something after you came all that way. Send me his address and I'll get the boys on him lol.\n\n\nI'm glad you had a good time anyway. I don't like to boast about my country, but I'd imagine Ireland is quite a good place for a solo traveller because we're very friendly (we're nosy and we'd speak to the devil lol). \n\n\nI see you tried Buckfast too, what did you make of it? And where were your favourite spots in Belfast? I love hearing from people who've been here because they see it in a way I never will. ",
            "That’s so sweet to hear another redditor met up with you and took you around, that must’ve been a really memorable experience good on whoever did that ",
            "You made the right decision to continue with your travel plans to have an amazing solo trip in a beautiful country, but I find it super weird that the reddit community so easily convinced you that this guy was lying and/or catfishing you. Like....life happens and his ex very well could have gotten into a serious car accident. Why assume he was lying? It’s extremely plausible that he cared more about the well-being of his ex of 4 years than he did about a chick he never met in a different hemisphere. ",
            "This makes me want to take a trip overseas my myself. Been to afraid to since I’m a woman. ",
            "It sounds like you had an amazing time! I love when these updates end on a good note. ",
            "I’m so happy for you, OP, for being so independent and going on the trip alone! I’m also so proud of reddit and all the strangers who stepped up to help her out and make the trip great for her! It’s really one of those nice moments online where you see the strength and good in people. Really made me happy to read this!",
            "I was going to suggest you go on the trip anyway but you already did.  Good for you!\n\nIt's not often that we can find the time and money to make an international trip. Sometimes we want to combine it with meeting someone, friends or family, but other times, we just have to go out there and enjoy ourselves, or else we'll never make it there.\n\nSo I'm very happy you broke up with that guy, who probably was catfishing you anyway, and made the trip.\n\nEmergencies can crop up, certainly, but even if you end up sitting with him at the hospital for days at a time, waiting for some relative or friend of his to recover, that should still be valuable time for you two if...if he was also as interested in you as you are in him.\n\n\n",
            "I'm confused, did he end up getting back with his ex? Why didn't he even make the effort to see you once for an hour? ",
            "Hey! I’d totally love to go to Ireland solo someday in the near future. Could you tell me all about your trip and highlights?! I’d love to hear about it :)",
            "Ended a relationship, started a relationship with self. Beautiful.",
            "I'm so glad you ended up going and having a good time! It's his loss if he couldn't make time for you. It's a huge red flag because he should have been over the moon that you were coming! Instead he tries to get you to cancel? WTF?\n\nBut glad that there are some thoughtful people out there who stepped in and helped make your trip a good one! :)",
            "Ireland is the best! I was there for 6 months this year and would take any chance I could get to go back, so I'm glad you went and enjoyed it!",
            "Love your courage to end things and take that trip anyway! What an inspiration!",
            "This isn't the first time I've seen Redditors meet up with each other and I'm honestly relieved that most of the community are genuinely nice people <3 Wish I had joined earlier on!",
            "This happened to an acquaintance. She had been talking to him for a good year I think before heading to Ireland for him to cancel during her entire 2 week trip. Imagine if it was the same person.. ",
            "What IS IT with Irish men? I dated one long distance from England for 3.5 years. I'm sharing this hoping you might feel better about dodging his fuckery and doing exactly the right thing - how awesome is travelling alone!? It's just the BEST I hope you manage loads more fun trips. Congrats congrats congrats!!\n\n\nSo we'd meet up multiple times a year, every couple months. He was the first person I texted with anything, we were in constant daily contact. Ok, there were some really unusual aspects to it as we weren't monogamous, but when whatever changed he just decided to ...ghost. Only did it really badly.\n\nLike I had a trip booked, and he kept insisting he was depressed and just not feeling up to replying, which was totally plausible as it was a big issue for him but obviously made me really really worried. I was checking for obituaries and news stories, as he lost a friend to suicide during our relationship and we were together when he got the news - so yeah, I believed it. \n\nI didn't want to put pressure on him, tho I usually stayed in the house with him & his mom so I booked hostels in Dublin to hang out with a friend there instead (and got trashed, went to one of my favourite museums, took a day trip to Newgrange & Tara and it was great fun - COS WE ARE SMART AND AWESOOOOOMMMEEE). \n\nWhen I landed he was still swearing he would meet up but I haven't heard from him since I said I'd be passing his town on a certain day and if he wanted to meet, I loved him & was available.\n\nYeah. A lot of British men are similar, never talking about their feelings, but I thought I deserved a bit better after 3.5 years. Not even a goodbye! I tell myself the kindest thing, if he was so messed up he froze (it was how he handled stressful things he didn't wanna face, just shut down, didn't think I'd become one of them) then i should just carry on.\n\nKeep him blocked too, I got a weird phone call about 10 months later which I could narrow down to his region. Yeah, if you were wondering? I'm ok without you.",
            "Okay, so let me get this straight. You've been in contact with this guy for 5 months, you fell for him and he fell for you. A week before you were supposed to meet him he canceled because his ex-GF was in a horrible car accident. Though without knowing whether this is true or not, you make a post on Reddit in which you ask for advice from strangers.\n\nNow you say you've tried being supportive to him, but in the end you care about that you will be alone in a new country? You care about the arrangements you made and the money you've spent? You think he betrayed your trust while he clearly has not. And you made a decision based on some assumptions and advice of complete strangers.\n\nSince you don't know whether he is lying or not, let's assume he is speaking the truth. So imagine that this guy just heard that his ex-GF, a woman which he shared 4 years of his life with, just had a horrific car accident. She might be his ex, but maybe he still cares about her? Maybe she is dying or might be dying so he wants to be there for her? Do you have like zero empathy?\n\nHonestly, what kind of human being are you? You clearly care more about yourself than the guy. You also assumed he is lying, but you expect him to put trust in you while it is clear you have put no trust in him. It's just utterly disgusting behavior from your side. He definitely dodged a bullet, because I am pretty sure you would have made him miserable.",
            "Congratulations on travelling alone and having a great time! You deserve better than that guy.",
            "So glad you ended up going and enjoying the hell out of it!!! :) ",
            "Outstanding! Nicely done, fellow bopper! ",
            "As a Dublin person I am delighted to hear you still went ahead with your trip! Fair play to you!\n\nJust wish saw your original post so could of arranged to meet up with you! ",
            "I'm so happy for you!!\n\nI love traveling by myself! ",
            "This is a really great update. I am proud of you for standing up for yourself from the beginning and going on a soul-searching adventure in one of the most beautiful countries there is. That must feel so empowering!",
            "I remember you. I am so happy that you did decide to go on that trip! Travel is so fun.  I am also happy to hear that it gave you a chance to reflect on yourself.  Cheers! :)",
            "I'm glad you enjoyed your trip to my country, OP! ",
            "Solo traveling is awesome! It’s great that you had a good time and did some taking care of yourself. The trip definitely sounds better than the boy!",
            "Congrats on dumping this dead weight and having and amazing time!",
            "Go to Ireland.  Go to a pub and people will talk to you, you'll make friends.  I'm sorry this happened, to go from so happy to so confused is awful. Tell yourself to be strong.  ",
            "Glad you went on the trip anyway! And glad you got to experience Belfast, it's lovely here :)",
            "Fuck yeah. You won in this situation. So many people would have canceled their flight. Traveling alone is the most liberating thing. Good for your for not letting him shit on your parade.",
            "Thank you so much for posting an update. I was wondering what had happened.",
            "Im so glad you saw cute Irish boys! and that you had a wonderful time. Sometimes ya just gotta bite the bullet and go with the flow. If you have your favorite spots id love to know. Im currently saving to go on a trip there. it may take me a while but id love to research it all. ",
            "I'm so glad you had a good time! Did he ever give a solid explanation for cancelling? ",
            "What a delightful update, good for you 😊",
            "I was about your age when I went on my first solo trip abroad, and it was AMAZING and really impacted the way I saw myself and the world in general.  I am so glad you got to go and had a great time!",
            "I love this, so proud of you redditor! This is the best!!!!! ",
            "What a great story. I'm so glad to hear that you had a blast on your trip and are now in a better place mentally. ",
            "I didn’t see your original post at the time, but I really wanted to tell you that you should go & have an amazing solo adventure. I’m so glad to see that you did just that! ",
            "This was just wonderful. I don’t know you but I’m proud of you. ",
            "Good for you! Your trip sounds amazing and I am so glad that you were able to enjoy yourself. ",
            "Sounds like you had great fun! In glad you did and that you enjoyed your time in there & didnt let what happend affect it ❤",
            "If you suddenly find yourself in a situation where you have to travel by yourself, I can't imagine anywhere better than Ireland. It's a beautiful place filled with the friendliest people I've ever met anywhere. All the pubs and live music don't hurt either!",
            "Dutch courage in Irish lands. Glad you seemed to have moved passed this. They don’t say “million of fish in the sea” for no reason 💚 ",
            "That’s amazing! Good for you!",
            "Traveling alone is the BEST!! Good job girl!!!",
            "Almost this exact thing happened to my SO once. I wonder how common it is. Glad you had a good time ultimately.",
            "Good decision girl. Ex's has nothing to do with both of you anymore and this is why we let our partners cut off all the ties with an ex tbh. Even if friends? Nah-uh for me. At least you had a nice vacation, he just lost a person who was willing to exert so much effort for him, you deserve better than that. ",
            "I am so proud of you! I had gone through a similar situation about 3 years ago, although it was just across states and not countries. \n\nThe immense growth and worth you’re going to find within yourself is going to be amazing. I am so proud. :-)",
            "best update possible!!! Congrats on finding yourself again. Sometimes we find ourselves in the darkest moments",
            "Fucking best update ever",
            "I’m so happy for you that you ended up having an amazing trip, yay.",
            "This was unfortunate, and awesome at the same time. It's wonderful you were able to enjoy the trip still.",
            "Good for you! Happy you had such a good adventure! Solo traveling is the best! :) ",
            "Bord Fáilte are really on their game with this. Good to see the all island cooperation too.",
            "I would drop him like a bad habit",
            "Possibly the most underated comment ever. 🤣🤣",
            "I wish you’d taken the money even though you ended it. What a jag off.",
            "This is so wholesome and I am excited for your future. Remind Me5 years!",
            "Gurlllllllllllllllll ya did it",
            "This is what I never personally got by these types of long distance relationships. Like how can you trust someone so far away when you don’t even know them personally?\n\nMaybe I’ve just watched way to much cat fish and have read way to many posts on here about these kinds of things. Maybe I’m just being cynical, but I just don’t understand. They just never seem to end well.",
            "WE LOVE AN INDEPENDENT QUEEN! you’re THRIVING without a man honey! GO YOU! ",
            "You! You are amazing! Congratulations on being brave and pushing your comfort zone and discovering more about yourself. Well done, fabulous human, let me know if you ever get to Australia be happy to show you around my home city 😊",
            "Soon you'll realize never to travel more than 20 miles for a date",
            "Good for you for making the most of it! ❤️ you’re better off with in- person relationships. ",
            "I never read the initial post but this one just made me want to do a little dance. Im proud of you complete stranger. ",
            "This is fantastic and I am so happy for you!",
            "This is such an awesome post. Thanks for sharing OP...you gave this 40yr old man a big ol grin and a laugh. I'm happy for you",
            "This was such an uplifting & fun post to read! I’m so glad you shared it! I haven’t read all the comments on this post, but did the original post & was curious; how old are you? \nHappy Holidays to you! What a neat experience 😊",
            "So glad you had a great time! This post makes me so, so, so happy! :) ",
            "YES! Love it!\n\nI had this happen with a girl once. She pestered me about booking flights to come see her only to cancel days later. I didn't go ahead with my trip or the girl. If you can't trust them on that then things are doomed!",
            "This story reminds me so much of a trip I took back in 1998. I am sooo glad that I didn’t derail my awesome trip because of a stupid boy.  One of my proudest moments even after 20 years :) GOOD FOR YOU ",
            "I just want you to know that reading this post has inspired me to seriously look in to planning a solo trip to Ireland and live my dream. My ancestors are Irish and my dream trip is to take a horseback tour of the island and the castles. Looking in to it I found it more affordable than I anticipated and while it will still take me several years to make the dream come true I am feeling inspired! \n\nI’ve been going through a horrible time (on leave from work, severely depressed, etc) and looking at the pictures online of my dream trip makes my heart ache with wanting. I have to make it happen, and I wanted you to know that reading this helped to inspire me to really reach for my goal ",
            "That sounds like a brilliant trip! Good on you! ",
            "I have a map of Ireland on the wall next to my bed (I love it so much: county, poster, and my bed). I got it on my second trip from the US! I’m so happy you decided to go! ",
            "Love it OP. Much respect to you! ",
            "This update makes me so happy!",
            "I'm so glad you discovered traveling alone, but sorry it had to happen through this situation. I hope it leads to many more trips abroad!",
            "some one told me your story. because I have situation like you. I may travel alone in the America. ",
            "I'm sorry I didn't see this earlier and I would've offered you a place to stay and enjoy more of Ireland (the west coast is amazing) and myself and my boyfriend would've only loved to have a guest. I hope you had a wonderful time anyway and if you are ever back don't hesitate to get in contact with me and I'll show you the real Ireland. ",
            "It feels strange reading this post because I'm in a long distance relationship with someone who lives in the same general area as your ex that evolved very similarly. Sorry to hear yours didn't end so well but I'm glad you're making the best of it.",
            "“He cried which made me feel weird”\n\nThis did it for me hahaha 😂",
            "> I think in my desire for closeness with someone I ignored a lot of red flags and downplayed my self worth.\n\nThis is me lol glad it worked out for you",
            "[removed]",
            "Fucking Irish know how to live, one of the most interesting people I've ever met was Irish. Glad you had a good time op",
            "Go on withcha bad self! Glad you had a great time. ",
            "The things we all do based on our poor opinion of ourselves and our self worth....it's really tragic in hindsight. The things we'll settle for or the red flags we'll ignore simply because we don't think we can do any better....it's....it's just so wrong.",
            "Screw him. That is awful...ex gf or no ex gf and that's an extra stab in the heart. But bravo for you for going anyways! I hope to visit Ireland in the near future- I'm half Irish so it is a must for me",
            "aw I'm so glad you ended up going ! Sorry about  the creepy guy but at least you got a nice experience out of it!",
            "That’s awesome. I’m glad I went on my trip and am now living with my ld bf",
            "Yay!!! This has made me so happy to see. So glad you had a kickass trip and didn’t let that waste of skin ruin it for you ",
            "It was a dog guising himself as human on the internet 😱",
            "[deleted]",
            "[removed]",
            "[removed]",
            "1) if you’ve never met you’re not in a relationship \n2) why does everyone have to create throwaway accounts to actually post on here? It makes the believability of the story much lower \n3) dude sounds like a catfish (or OP is full of 💩)",
            "Listen, you gotta get therapy. You should not be online-dating anyone."
        ]
    }
]