[
    {
        "post_id": "cmrrhv",
        "author": "itsathrowaway9474",
        "title": "[UPDATE] My (20M) friend (22M) wants me to “step aside” so he can date my not-girlfriend (18F)",
        "url": "https://www.reddit.com/r/relationships/comments/cmrrhv/update_my_20m_friend_22m_wants_me_to_step_aside/",
        "score": 5264,
        "num_comments": 265,
        "created_utc": 1565104052.0,
        "selftext": "Original post summary: I have been in an exclusive relationship with (called “L” in post) for over 3 years, but we didn’t use titles (bf/gf). Friend (“K” in post) that knows the history of our relationship asked me to “step aside” so he could try to date L.\n\n[link to original post](https://www.reddit.com/r/relationships/comments/ckqgjc/repost_my_20m_friends_22m_wants_me_to_step_aside/?utm_source=share&utm_medium=ios_app)\n\nI wanted to thank everyone that took the time to respond to my post and update anyone who might be interested in the outcome.\n\nI have been staying with L for about a week now, since the initial confrontation with K and thanks to people here, I was sure I wanted to ask her if she wanted to make things more official. She ended up making things even easier for me, as luck would have it. L asked me if it might make things easier if I just told K that she was my girlfriend. I jumped on that opportunity and asked if I could tell everyone she is my girlfriend, and she said yes! She and I are going to look at a few apartments this week, since I obviously need a new living situation, and we want to move in together.\n\nK and I had a few brief discussions after he told me he wanted to be with L. I had told her everything K had said to me, and she was not the least bit interested in him, which I had assumed. I also told him that she is officially my girlfriend now, so that should satisfy his concerns about me not committing to her. He refused to believe any of it without confirmation from her, in person, without me around. She initially agreed to meet with him on Sunday, with the plan that they would meet at her house (since she lives with her mom and stepdad), but he rejected that, saying he wanted to meet at the apartment, without me there. She told him she wasn’t comfortable with that, if he wanted to meet up without me or her parents there they at least had to be somewhere public. He got pissed that his threatening behavior made her feel threatened and went on a tirade, called her every name in the book. She told him she wasn’t going to see him again at all and blocked his number. He has tried reaching out to me a few times ranging from sad to aggressive, and I’m about a text or 2 away from blocking him as well. Hopefully he’ll just move on and it won’t come to that.\nAgain, thank you to the posters who helped me navigate this situation!\n\nTL;DR- L is now officially my girlfriend and we are going to move in together. K made unreasonable requests when L agreed to discuss their friendship, then blew up at her, so she ended up blocking him.\n\nEDIT:  To clarify, we both wish him well, but neither of us want to continue a friendship with him under any circumstances. Since posting this I have also blocked him. I agree with posters that there is no point in keeping any lines of communication open anymore. I have also reached out to some friends to help get the rest of my stuff out, but I was already able to get everything important when I first left. He can make a shrine out of my old shirts if he really wants.",
        "permalink": "/r/relationships/comments/cmrrhv/update_my_20m_friend_22m_wants_me_to_step_aside/",
        "comments": [
            "Dude, this guy is a creep and it sounds like he wanted to do something bad to L when they were alone tbh. Just cut him out of your life.",
            "Gained girlfriend. \n\nNew exciting living together stage of life planned. \n\nIdentified deadweight weirdo for removal from life. \n\nI mean, it has been stressful but the outcomes are all actually long term positives. If it hadn't been this, K's nasty side would have shown up some other way.",
            "r/niceguy \n\n Your friend  is a creepy and asking to meet her in private gave me some abuse/rape vibes because he can't take a no",
            "[deleted]",
            "Start documenting every single interaction you have with K, every time he tries to reach out to either one of you or your family members or whatever. Seriously. He doesn't strike me as the kind of guy who is going to go away easily.",
            "Okay K is a fucking asshole excuse my language, but there’s no other way to describe it. I wouldn’t physically fight K, but I would let him know straight up what he said to L is uncalled for. As for your relationship, congratulations for taking it to the next level. It seems like L has genuinely been wanting this for a while and you had the courage to make it official. As for K after you have told him your piece, neither of you should ever get in contact with that douchebag again. He’s not even a friend, look at his behavior towards you and L. He has no respect. That’s not a friend or a person you should be around. Be happy with the lovely lady you’re with and build great memories. Wish you two the best. :)",
            "You need to cut K out of your life immediately. It sounds like he wanted to force himself on your girlfriend to prove something. He sounds dangerous, unhinged and 100% not friend material.",
            "> He got pissed that his threatening behavior made her feel threatened\n\nThis made me lol\n\nCongrats on moving forward with your life and leaving that deadbeat behind! Hopefully this prompts him to take a serious look at his life and his choices",
            ">He got pissed that his threatening behavior made her feel threatened and went on a tirade, called her every name in the book. She told him she wasn’t going to see him again at all and blocked his number. He has tried reaching out to me a few times ranging from sad to aggressive, and I’m about a text or 2 away from blocking him as well. Hopefully he’ll just move on and it won’t come to that.  \n\nHell hath no fury like an entitled man who gets rejected. JFC, what an asshat.",
            "Sounds like he's one of those \"nice guys\" who was never her friend, but was waiting for \"his turn\". You should block him, he sounds like a stalker",
            "Congratudolences. \n\n\n\n\nCongratulations on the girlfriend. Condolences on the friend.",
            "\\> He got pissed that his threatening behavior made her feel threatened\n\nSeriously.",
            "I want to throw out there too that this premise of \"step aside so I can date your girl\" is hella gross. His entire worldview portrays women as some kind of tradable possession. If I had seen the first post, I would have said to not bother L with any of this at all; and tell K he can go eff himself with that gross nonsense. Glad she's okay. It doesn't surprise me at all he was capable of that type of tirade based on his initial request of you.",
            "Wow it really sounds like K really wanted to corner L and do something really bad since he refused to meet in public or with anyone else around.  He's a huge predatory creep, glad he showed his true colors now before he got super drunk and was alone with L.",
            "\"He got pissed that his threatening behavior made her feel threatened\" thank you for giving me a description for these kind of creeps, I'm totally stealing this",
            ">saying he wanted to meet at the apartment, without me there\n\nI don't know about anyone else, but this to me screams ***RAPIST ALERT***",
            "I would talk to your landlord about this ASAP, by the way. Don't want to be on the hook to damages to the apartment your exroommate does in your absence.",
            "I get some bad vibes from what seemed to be his true intentions with her. It’s always a red flag when you have to be alone and in private just to accept rejection. I don’t think he was going accept the rejection without getting something out of it first. I’m glad she blocked him. I’d block him too if I were you. He’s not your friend. Friends don’t do those things to each other.",
            "Congratulations on the girlfriend dude! I was a bit teary-eyed when I read that part. I love when relationships work out like that. It’s just so rare so I’m very happy for you. Also, sorry to hear about your deadweight friend. Hopefully he will figure his life out.",
            "I'm super glad that she didn't meet with him alone at the apartment and I hope she never meets alone with him. He sounds predatory af and I'd be crazy scared for your girlfriend knowing she was alone with him. She blocked him for good reason and I honestly suggest you do too. That's no friend.",
            ">He refused to believe any of it without confirmation from her, in person, without me around.  \n\nUh.. WHAT? That's creepy and possessive as hell. Normal healthy people don't ever act that way.",
            "Time to eject this guy from your life completely. If not respecting your relationship wasn’t enough of a sign that this guy isn’t really your friend, this escalation is.",
            "WTF is this?! This is medieval stuff. You claim your wife, the Xerife of Nothigham wants to take her to his castle and make her his. She retreats to her parents looking for a safe place to hide. He wants to take her by force and will not accept this affront. \n\nCrazy people out there.",
            "> He refused to believe any of it without confirmation from her, in person, without me around. \n\nWhat an entitled douche.",
            "I don't understand why they have to meet at all? Why does she owe him anything???",
            "Block him now and support your girlfriend OP. Because... he disrespected both of you multiple times, you and L are both reading him 100 percent correctly that he sees her as an object and is threatening to her and he yelled at her and called her names?\n\n\nHe’s not your friend. Block and move on",
            "I just wanted to comment on the ages involved. You say that you've been dating on and off for three years, which would make L 15 at the time that K met her, while he was 19. Your own age gap is questionable, although two years is nothing between adults, when you're dealing with people under 18 it's a very different story. \n\nMy main issue is with K, because quite simply a man who is 19 should not want after a 15 year old. There's a reason that that's illegal. You need to be very careful with this dude, because there's a reason that he's not seeking a relationship with somebody who is 20+, and I've no doubt that part of that reason has to do with him wanting to see L while she is completely alone and vulnerable. He would have assaulted her, and will do if given the chance. You need to steer clear of him completely. Make a paper trail documenting every attempt at contact he makes, and be vigilant.",
            "Are yall not in the US? Cause the explanation insinuates that you've beem with L as an underaged girl. So 3 years ago she would have been 15/16 and you 19/20. Those are red flags where I come from.\n\nEdit: I reread the title and can confirm I am an Idiot. I fucked up thinking you were 22 and your friend was 20.  This makes your friend seem more of a creep since it looks like he basically waited around for her to be legal. Yikes.",
            "Def dodged a bullet with K.",
            "r/niceguy lost his shit. \n\nGood luck to you two and your new relationship!",
            "> He got pissed that his threatening behavior made her feel threatened and went on a tirade, called her every name in the book.\n\n...and he will be to the end of time absolutely **gobsmacked** that she did not respond positively to his \"rough wooing.\"\n\nAlso?  I bet he can't understand women and is a perpetual victim to their weird inability to communicate clearly.\n\nAlso, also?  All of his ex-girlfriends were kRaZy and so, so *angry* for truly inexplicable reasons.  Probably because they were always on their periods, ammirite?\n\nJesus Christ.",
            "This guy is trouble, I can’t see a scenario where you’re not better off cutting him out of your lives...",
            "Long story short, he's not your friend. Anyone that is willing to betray you as such to your face has done far worse behind your back.",
            "He's an asshole who built up a belief in his head that she would fall for him the moment he professed his love.\n\nYou've said you might leave your stuff in the old apartment.  I wouldn't.  Go to the local police station talk to a few cops, explain what's going on.  Ask if any are off duty insert day.  Ask them to \"help you move\" you'll provide beer and pizza.  \n\nOff duty they can do what ever they want and it's not an official police matter.  But if he tries anything or says anything... they are off duty police officers and their word in court or to a judge about a restraining order carries a shit ton of weight.  \n\nI'd say for the beer and pizza you'll get a couple takers.  And you might even make a couple new friends.",
            "This experience is a good life lesson, womene are often exposed to this sort of behavior. its far less common for men to see this sort of regressive emotional meltdown from other men. \n\ni suspect he will return to 'normal' in a few days and assume forgiveness, or repress some of his more unbecomming actions. I suspect he will want to bury it, accept the reality, and move on. were i in your shoes, i'd refuse to allow this to be burried. His behavior shows a complete lack of self control and self awareness. this makes him dangerous for everyone around him. Were i in your shoes i'd confront him privately, lay out the facts, and show him the opportunity for a continued friendship if he is willing to meet some basic needs around self awareness and self control. \n\nif this person is not interested in exerting themselves in this way, you have a responsibility to make it known so that folks around him are aware of the risks they assume with him.",
            "Glad you made it official and all but it sounds like you only realized her importance bc of another man became interested in her. If you really liked her so much then why didn't you want to be known to be with her officially without a threat of her being with someone else?",
            "K: *gets death note out and writes L's real name on it*",
            "Okay, so my stuff is out, thanks to 2 of my friends, who are also friends of K. Friend A tried ahead of time to convince K to leave so we could get everything out without him, but it wasn’t happening. K said he wanted to make sure I didn’t “mess with his stuff” which is ironic, since he tried messing with my relationship. Friend A then offered to act as a buffer so friend B and I could get my stuff out. \n\nWhen we first got to the apartment, K was obviously drunk but calm and seemed almost apologetic. I had already decided I wasn’t going to engage with him at all, because I don’t see the point anymore. He did not like being ignored apparently and started going off, gradually saying worse and worse shit. He started saying shit about L, but I was able to ignore him and let it roll off my back until he told me I “might need to fuck her up and get her in line.” He knows her ex before me was abusive. I’m very thankful my friends were able to get me out of there quickly, because I have never been so angry like that in my life.",
            "The friend sounds hella creepy. Maybe you should block him too lol",
            "You need to block him right now. It's extremely obvious why he wanted to meet her alone. Then all the threatening messages, kind of a huge red flag.",
            "He doesn't get to make demands and set conditions like that. She can tell him no however she wants and he has to accept it.",
            "Dump your friend dude.",
            "I don’t think you even need to wait. The guy has proven to be an ass, just cut him out.",
            "What a weird dude. He is very entitled. He feels she owes him to clarify her relationship status wtf? Also, block him, and maybe your gf should be extra careful about going home alone for a while. He sounds unhinged.",
            "Good job, OP.  You'll find in relationships that it's always best to be candid and upfront, even about \"labels.\"  I've straight up asked girlfriends to be \"exclusive\" because, after enough bad experiences, you learn that you have to ask straight up questions in order to be on the same page.\n\nRegarding K, he's a bad friend for disrespecting your relationship with L in the first place, though the silver lining to this is his actions stimulated a growing point in your relationship with L.  It's fair if he asked \\[your permission to pursue L romantically\\], but since you weren't okay with it and he pressed forth regardless shows he's a bad friend.  To follow, he greatly disrespected your partner, so he has disrespected you (he's also lucky you didn't punch him in the face).  I think you should be straight up with him as well: \"K, you are one text message away from me blocking you.  I value our friendship, and though it's been under strain in recent time, I'm willing to try to retain what friendship still remains...but your behavior is rapidly burning that bridge.\"  Most likely, you'll have to block him, but good riddance since his behavior plainly ~~said~~ shows that he ~~didn't~~ doesn't value your friendship, anyway.\n\nedited",
            "Man, K needs pushing down a fucking well or something.\n\nNeither of you should have him in your life.",
            "K is a dirtbag. You’re both lucky that this happened and you were able to see his true colors and distance yourselves from him",
            "I'm going to put it bluntly: your friend is a trash can that wants to rape L",
            "This dude is r/niceguys material",
            "Wow, lucky her. He could have been abusive and possessive.",
            "\nYour friend's response to rejection is one of the reasons women don't want to outwardly reject someone's interest.\n\nHopefully he'll learn a lesson from it and act better in the future.",
            "If he has any female friends, please let them know about this. He’s fucking creepy",
            "Dude L is a keeper. In a world of cheats I am glad u found something true. All the best for both of ur future.",
            "Ok get a restraining order. Now.",
            ">\"He got pissed that his threatening behavior made her feel threatened and went on a tirade, called her every name in the book.\"\n\nHe sounds so entitled LMAO. He seems like those \"nice guys\" who only act as your friend with the goal that you'll eventually be with them romantically. The fact that he also demanded for L to meet him alone at the apartment instead of anywhere public or at her parent's house sets off so many red flags...possible sexual assault case honestly. Wanting to hear her reject him in his face? =-= please",
            "I have to hand it to you.  You are much more tolerant than I would have been.  A true friend would never act this way.",
            "All i can say is: YAY. Awesome, awesome, awesome.   \n\nGlad to hear you guys made things official :)",
            "Oh my! It definitely sounds like he was planning something evil for your GF. \n\n It's weird and alarming that he was demanding that they be completely alone. Almost like he was planning something. Like assault. Or worse. To punish her for not choosing him. There's a whole lot of people that have gotten jail time and even death for just this situation.  And there's a whole lot who have probably gotten off Scot free, from bad policing, or an expensive lawyer, or whatever else.\n\nI wouldn't be surprised​ at all to find out that he's bought duck tape, bungee cords, roofies, and a saw in the past week.\n\nCongratulations on the new BF GF labels!",
            "K was already braking brocode to begin with dude is not a friend.",
            "So no one is going to point out that OP started dating his now-gf L when she was only 15? that is very creepy!!!!\n\nEdit: misread the title and mixed up the ages. My apologies!",
            "Damn, that guy just be giving off every kind of red flag. K is a psycho and he needs to be gone from both your lives! Kid lives in a fantasy land.",
            "It makes me super happy that you have someone that was that committed to you even though you hadn't used labels. I cannot think of one person I know (friend or not) who would be that committed to a person after discussing not using labels. I think you two have something seriously special.\n\nBut yea fuck the other guy, the fact that he wouldn't meet her in public was super weird and worrying",
            "Some massive red flags for your friend here. I'd just cut him out since there's no reason he'd want to meet with your girlfriend alone to hear her confirm what you already said unless he has some sinister motives. What's wrong with just hearing it from her in a text or phone call? Cut this guy out of your life, he seems like a massive asshole and potentially dangerous.",
            "Sounds like he is a 'niceguy'.",
            "sounds like you and your lady-love are chasing your happily ever after, while K (a potential abuser by the sounds of it) is probably better off left in the past  \n\n\nGoodluck to you two, and never let that level of communication break down!",
            "Dude has testosterone poisoning.",
            "Holy cats, what a nutter! I’m glad she had the good sense not to let him bully her into a private meet up.",
            "K is not your friend. Nothing about his behavior to you or L is friendly. I'm glad L has blocked K, and I encourage you to do the same. Acknowledge that he is not your friend.\n\nWhat are you looking for in a friendship? Respect, compassion, mutual interests, vulnerability, fun, humor? Cultivate friendships with people who treat you this way and let go of people who don't.\n\nIt sounds like L is mature, respectful, and thoughtful about her own boundaries. From your post she sounds like a great girlfriend. Congratulations!",
            "Everyone's given you great advice and you're making the right decisions so far so let me just say, thank you for the FANTASTIC line, \"He got pissed that his threatening behavior made her feel threatened,\" which I am going to remember forever.",
            "Lol. \n\n\"He got pissed that his threatening behaviour made her feel threatened...\"\n\nFYI - On mobile - can't quote properly.",
            "Congratulations that’s a great outcome",
            "r/niceguys right there. K, not OP.",
            "your friend is r/niceguys material",
            "Just be wary that K could come and hurt you two. NEVER meet with him alone.",
            "Dude, block him. He's a fucking creep and when your \\*girlfriend\\* told him no, he started being aggressive to her. Why the hell did you not sever ties then?",
            "Wtf that guy is scary af",
            "What a creep. Watch your back, this guy could become toxic and seek physical harm.",
            "That is absolutely not your friend. Friends do not ever do that to each other.",
            "> He got pissed that his threatening behavior made her feel threatened\n\nHahaha holy shit what an asshole\n\nI'm glad everything's working with you and L!",
            "Power to you. Good on you for standing up for someone you care about and straightening things out in that relationship. takes a strong man to hold it together with a strong woman. I applaud that, bro.",
            "In case someone hasn't already said it... Please take all appropriate steps to ensure your (especially Ls) safety. Record all contact on a Google doc with when and what happens (so it's time stamped effectively), ensure you're locking your doors/windows, let her parents know what's going on, buy a baseball bat, and talk about what you should each do if someone tried to break into your place. \n\nIf he doesn't disappear from your life in the next week or so, file a police report and take to a lawyer about the steps for getting a restraining order. Probably he's just a dumbass and will look back on this and be embarrassed, but he might be a little not right and have developed some crazy possession issues with her. Better safe than sorry",
            "So basically, you've been datimg this girl for ages and your friend knows this, and HE says it's unfair and YOU should back off? He's the one who should've backed off in the first place, friends don't go for their friends girlfriends.\nAnd honestly, I feel like if they met up alone in her apartment, something horrible would've happened. He definetly would've tried something.",
            " Just stand aside and let the obviously superior male have her bro! \n/s\n\nFor real that is some alarming behavior. Weird to think you guys have just been hanging out with him harboring spite for you because of it... some people man.",
            "I'm surprised that she even agreed to meet at all under any circumstances in the first place! You both need to cut him out of your lives for good and move on.",
            "Point in the direction of the sub r/niceguys -thats more his cup of tea",
            "Good god he's creepy. I'm glad she didn't agree to the conversation in the apartment without you. I'd have seen assault in your future.",
            "Sounds like he planned to get his way with her in your appartment, as a last resort. Don't waste your time on that guy. Good luck appartment hunting.",
            "This dude is acting like a disgruntled ex without ever having been her actual bf lol",
            "I know I'm super late to the party, homie, but it sounds like that dude wanted to hurt her or worse. She/you guys made the right call in cutting him off.",
            "Strange that you even agreed to let him meet her one on one. Wtf were you thinking? He’s not king of the world where he needs to meet alone with a women to ensure she is single lol",
            "\n\nTook you guys long enough to make it official, if you don’t put a ring on it someone else will. \n\nThat’s exactly what he was trying to do. You gotta stop letting time fly man and seal the deal when it’s right in front of you .\n\nAnd to add you’ve been on and off for 3 years.\nYour buddy has been sitting there in the friend zone while you’re fucking around . I can’t blame him for how he acted.",
            "Right off the bat, very suspicious of any person over 20 dating an 18 year old. That’s weird.",
            "How about the dude is on the ass end of the stick; the woman caters to the pressures, fears, and assumptions of domestic disturbances, and the guy has begged the chick to leave him alone, but he couldn't beat her off with a stick and she still panders to the domestic threat, and manipulates every tenet of chivalry that she can bend to her evil design.",
            "Very surprise to see your friend demanding you to step aside.  May be it were a request ? You have all the rights to tell your friend to back off.  She is your girl, she picked you.  If he tries to get in between, that is the same as asking for a baseball bat on the head.  Want to talk to the girl?  You are her boyfriend now.  Talk to you first. If you are not OK then that is that.  Just how I feel.  May be I am too hard ?",
            "I don’t think he wanted to do anything bad tbh, I think he wanted a fair chance to profess his love for her and she didn’t give him the venue to do that . That’s her decision anyway , but I can see how it looks for sure ."
        ]
    },
    {
        "post_id": "n21e9c",
        "author": "ThrowRA_heather",
        "title": "I(17f) told dad about mom's affair to save him from a terrible marriage, now he wants a paternity test and I don't know what to do.",
        "url": "https://www.reddit.com/r/relationships/comments/n21e9c/i17f_told_dad_about_moms_affair_to_save_him_from/",
        "score": 5269,
        "num_comments": 356,
        "created_utc": 1619810788.0,
        "selftext": "When I was about 9 years old, I realized my mom was having an affair for years on my military dad.  I did not say anything as I was really worried what would happen if I said anything. When I was about 12 years old, I found my dad looking at pictures of our family and tearing up and I couldn't take it and I told him about moms affair. Fastforward 5 years and I live full time with dad and his new wife and step sister and our lives have improved so much since leaving mom. \n\nWell grandpa on dad's side has been pressuring my dad to get a paternity test as he wants to make sure that \"I am his grand daughter\". This is getting really intense as grandpa may pass away soon and he says he doesn't know if he should leave us anything if he doesn't even know...\n\nWell my dad has resisted this for years and saying it doesn't matter. But now things have changed as I have half sibling on the way. I am totally happy and fine with this, but for some reason my dad has started to change his mind about the paternity dna test thing. He says he is worried that I won't receive help with my college or anything, but im worried he is wondering if he should care about me or just my new sibling.\n\nI am not sure how much money my grandpa has, but he does have a big house and a lot of property so I guess it's important. I would rather just continue with our relationship how it is... but I don't know what to do now and i haven't been able to sleep over this.\n\nWhat do you think I should do?\n\nTlDR: dad says we should get paternity test for me, but im worried he won't love me if it goes wrong.",
        "permalink": "/r/relationships/comments/n21e9c/i17f_told_dad_about_moms_affair_to_save_him_from/",
        "comments": [
            "Before you do anything I think you need to sit down and talk with your dad. Tell him exactly what you are feeling and exactly what you fear. Be open and communicate with him.",
            "Oh babe, this must be really hard for you and I'm sorry you're going through this. \n\nThere is nothing you can do, this is your father's decision. It sounds to me as though your father didn't care about the test and loves you unconditionally. It sounds like your grandfather on the other hand may have some other, dated, notions.\n\nSit down with your father and tell him exactly what is on your mind - read him your tl/dr. Express your love for him, stepmom, step- and half-siblings. Just tell him you're scared and ask what he thinks. \n\nGood luck, OP. It's going to be ok 💛",
            "[deleted]",
            "I'll say it. Grandpa is taking a real asshole approach in an already heart-wrenching situation.  So sorry the situation is causing you such heartache.",
            "It sounds to me, like others have said, your father really cares about you. My ex cheated on me and i have our two children full time now. I've considered dna tests before but same as your dad decided it doesn't matter.\n\nI want to get them done someday, but more because i just feel like everybody deserves to know. I can tell you from a fathers perspective it would not change anything.\n\nIt sounds like it is mostly due to your grandfather and your dad wants you to get something in will.\n\nYou should 100% talk to your dad about this. Just tell him how this is making you feel and ask him how he feels about it. I think it would make you feel better",
            "Your father had years to do a paternity test on you, he decided not to because whether it’s positive or not you’re his daughter no matter what. \n\nHowever, you should probably get it in case you have a parent that’s carrying something genetic and might affect you/pass down to your future children.",
            ">im worried he won't love me if it goes wrong.\n\nYou need to talk to your dad about this because based on your post, I think your fears will come true, at least in regards to your grandfather.\n\n>he wants to make sure that \"I am his grand daughter\"\n\nThis is a really shitty thing to say to you.  Talk to your dad about how this has hurt you and that you're worried you won't be his granddaughter if it comes back.  Grandpa can be spoken to later if your talk with Dad goes well.  Side question, is stepsister considered a granddaughter?  If she is, you can point out she isn't bio and still a granddaughter so why would your DNA matter?  Especially since he always considered you a granddaughter before.\n\n>but im worried he is wondering if he should care about me or just my new sibling\n\nWhile your father hasn't been as... direct as your grandfather, bring up you are concerned about him too.  Point out it that it has been 5 years since the affair was found out and the brand new, definitely his child combined with your grandfather's statements make you think he now wants you to not be his and to get out of his new, definitely his family.  Why is he so concerned with this NOW vs 5 years ago?  What has changed about how he feels about you?  Ask him what he WANTS the results to be and what happens if it comes back the other way?\n\n\nI really hope your father is genuinely concerned about college, but unless you are no longer legally his child, something feels...off.  If he is legally your parent, fafsa should consider his income (if you're US), so does he plan on helping you with college?\n\n\n\nYou need to have a serious talk with him about your very legitimate fears.  I am not sure if they can force you to take the test, but they can still kick you out at 18 regardless of whether you do or not.  I really hope this just turns out to be fears and they love you anyway, but you might want to start preparing for the worst case scenario.",
            "Its sucks, but as a father I wouldn't get it done because it wouldn't matter. You've been his daughter all your life. He'll still be your dad.",
            "As a dad raising a kid that's not \"mine\" and one that likely is but could not be....... it doesn't matter.  At all. I love them both and my paternity doesn't change that in any way.     \n\nBut.   You don't know what's being said behind closed doors.  Remember, that just like you don't want your relationship to change with your dad,  he likely doesn't want his to change(or end badly) with his dad.   That very well may mean nothing between you two would change at all, but he may just be trying to keep a relationship with his father.   \n\nI know honesty can be hard and awkward. But it sounds like your dad is trying to keep your best interests at heart and please his dying father at the same time.  I would sit him down and reassure him that you love him and appreciate the relationship that you have and don't want it to change,  but that you also appreciate his situation with his father.   Let him know you're there to help and support him as well.  \n\nBest of luck.",
            "> He says he is worried that I won't receive help with my college or anything, but im worried he is wondering if he should care about me or just my new sibling.\n\nYour dad didn’t want the test for years.  I don’t see any reason to think he has changed his mind just because you have a half-sibling in the way.  I would believe him when he said he’s concerned about the inheritance.\n\nHOWEVER: even though he believes he doesn’t care, he may find that he has changed his mind  if the result comes back negative.  He may go into this with the best of intentions to not let the answer change his feelings, and then discover that his feelings changed anyway.\n\nTalk to your dad about this concern.  Unless the inheritance is a life changing amount of money, I would say skip the test unless your dad really does want it for himself. Your dad does have a right to know.\n\nIf your grandpa wants to make sure his inheritance only goes to blood relatives, then he can leave the money in a trust to your brother.",
            "I don’t think your dad cares what the DNA test will say. You are and always will be his little girl. I think what he’s worried about is how his fathers actions or lack of actions will affect you. Your father is trying to protect you because he loves you.",
            "I have 4 kids, only 2 of them are biologically mine. \n\nDo not worry, it makes no difference. If he is a good Dad it is because he loves you not because of DNA.",
            "If I was in your dad's position and my ass-backwards old man wanted proof that my child was his biological grandchild, lest he withhold her future educational fund, I'd definitely be writing and delivering a fake paternity test. I just assume that anyone who thinks DNA determines family membership would be too dense to see through the ruse.\n\nI would also be honest with your dad about your feelings. Tell him it's your wish that a paternity test is not done because you are already feeling a bit insecure that he will see you as equally important to his new baby, and throwing a DNA test into that mix would not be good for you right now. You're more worried what he will think than your grandpa. Given that he's never wanted to do one before and he's always had you living with him, it seems likely that he sees you as his daughter either way and he will be able to reassure you more than we can on reddit. \n\nNew babies and youngest kids get a lot of attention, especially in new relationships, but remember - you were his first child and that's a *very* special place in his life to have too. You will probably still be all his \"firsts\", his first kid to go off on their own, first kid he had a legal beer with, first kid he walked down the aisle, first kid to give him a grandchild, etc.",
            "Hi! As an adopted person (23F) I’ll just say that whether or not you’re biologically related shouldn’t matter here. He’s still your dad no matter what. It sounds to me like grandpa is pressuring here and your dad doesn’t share that view. I’m sorry you’re going through this, and I hope you can share how you feel with your dad and get some reassurance there. Much love to you in this challenging situation but blood doesn’t mean love and I am very hopeful that your dad will continue to stand up for u.",
            "I would tell Grandpa that the paternity test came back that you are 110% his daughter.\n\nI think this is a justifiable lie.",
            "I don’t think it’s about your dad loving you as much as your grandpa’s threats. \n\nObviously, it hasn’t mattered to your dad up to this point. It’s probably your grandpa threatening to write him out COMPLETELY if he doesn’t agree to this. I don’t think your dad is planning to toss you out, even if it does turn out you’re not his bio kid.\n\nI would talk to your dad about your fears, he loves you, and you need to be able to trust that he has your best interests at heart. Give him the chance to explain himself.",
            "I wouldn’t do a paternity test until you’re out of your father’s house and to a place in your life where, if your dad reacts badly, the harm is only emotional and not financial. As much as it seems like he would understand, it’s rough, people don’t always react how you’d expect, and there’s a new sibling on the way, which changes the dynamic.\n\nAlso, what happens if the paternity test comes back negative with regards to your grandfather? You wouldn’t get the money anyway.\n\nI’d frame it as “I’ll love you no matter what, but I just can’t deal with even the smidgeon of a possibility you’re not my dad right now. Maybe one day, I’ll feel different.”\n\nI’m sorry you’re in this situation.",
            "I am sorry that you are going through this. On a practical note, do you feel that you resemble your father? He will always love you, I would take the test just to get rid of the stain of this question in your life.",
            "Sounds like grandpas a bit of a twat",
            "What a strangely relevant post to my life. I don't know if my mom ever cheated on my dad after they were married, but my dad was concerned enough that when I was 17 he made my brother and I both get paternity tests. There was also a family inheritance at stake, although not half-siblings. OP, I know some of what you must be feeling, and I'm so sorry. I remember being so terrified that if I wasn't my dad's kid that he wouldn't love me anymore, or would throw me out. I was afraid that our extended family would find out, and that they wouldn't see me as a real member of their family. I don't think he ever knew how heartbreaking the whole situation was for me, even though both my brother and I turned out to be his children. It's been 15 years and it still haunts me that I don't know what he would have done if I'd turned out not to be his child. The wound is just unbelievable. I think that if you have similar fears, you should talk through them with your dad, and make a plan in case you turn out to not be his bio-kid. Who will know the results, besides your dad and grandfather? What role is your stepmother playing in this, since I presume she feels she has a stake in it? Do you actually *want* to know for sure? I would also suggest that you tell your dad/grandfather that if they want you to consider this at all, they need to get you a therapist *right now* so that you can have an uninvolved adult whose primary concern is your well-being, not their own money or potential money. All of the adults involved here have a financial stake, which means that their advise will be biased and not necessarily in your best interest, as much as they love you. Hugs, OP. No matter what you decide to do, you haven't done anything wrong.",
            "I feel like it’s really crappy of them to want the test. If YOU wanted it, then ok. But denying you an inheritance based on your DNA would be really awful. Are you able to refuse the test? They need your DNA, right?",
            "Wow your grandpa basing if you should be given an inheritance based on guaranteeing you’re his biological grandkid is fked up. You’ve been his grand daughter since you were born. Genetics don’t change that. A lifetime of memories and love is what matters. It’s like is an adopted child any less than?? That’s so so sad. Since your dad has resisted the paternity test I’m not really worried about him loving you less but you know him, I don’t.",
            ">This is getting really intense as grandpa may pass away soon and he says he doesn't know if he should leave us anything if he doesn't even know.\n\nWhy is your father not protecting you? Even if paternity is challenged you essentially are his adopted and actual family.\n\nThat's messed up.\n\nThe clear solution is just to have him lie to your grandfather. He's going to be dead soon and his backwards horrific, abusive standards are dying off with that generation. He essentially is subscribing to the bastard child idea which is like 500 years out of date.\n\nIf things change definitely talk to a lawyer as you have rights within the family. Go very public as well after verifying if this is smart with the lawyer.",
            "Low-key, just get the test done and make it a painless process. We all live our own lives and if he deems a stick of information is more important than his relationship with you then you can establish he's an a\"\"\"h\"\"\" anyways.",
            "I am always curious and hope no one read this comment. Isn't it kind of easy for the dad to get ops DNA? A few strands of hair (probably from the hair brush or pillow case), some siliva (probably from a spoon). I read a similar post before and I thought how easy it is to obtain someone's DNA inside the same house.",
            "Tell your grandfather that you love him and even if it turned out you were not his natural granddaughter u would love him anyway. Maybe you can shame him into Evolving past the Neanderthal  age that he is in. But honestly I think it is probably your mother your grandfather is mad at and not you.",
            "[deleted]",
            "What a fucker your grandpa is. God.",
            "I am sorry to say this, but your grandfather sounds like a terrible, petty person. He either loves you as his grandchild or he doesn't. Who cares about DNA? I have no advice, but I am sorry that you are in such a terrible situation by no fault of your own.",
            "You know, I try to advocate for honesty. But, the fact of the matter is, sometimes lying is the better route to go. In my opinion, this is one of those instances. It shouldn't matter to your Grandpa if it doesn't matter to your Dad. And, unless he has done a really good job of hiding it, it hasn't mattered to him for however many years. So, if his only concern truly is his inheritance (and you getting help with school), suggest to your Dad that he lie to your Grandpa, and tell him that you guys did a DNA test, and you are without a shadow of a doubt biologically his. I am very sorry your mother has put you in this situation. And what everyone involved needs to realize, is that none of it is your fault. He raised you as his kid, so even on the very slight off chance that you aren't his biological daughter, you are still his daughter. And he is your Dad. Like I said, honesty is usually the best policy. But this is one of those very unique situations, and honestly,  why should it matter after all these yeats?",
            "[deleted]",
            "Ask your mom and tell her why. Maybe she has enough decency to tell the truth. If not, then I suggest the test. Your dad is still your dad. You stood by him and he should stand by you no matter the result of the tezt.",
            "The fact that you're the one that spilled the beans in the first place, and stuck with your father should automatically secure your place as a beneficiary of any inheritance. You didn't choose who your parents are. \nYour question is, what should you do?\n\n Well, there's not really anything you can do at this point, but accept whatever comes.",
            "Read your TL;DR to him.",
            "I think you should get the test done. I know there’s a possible outcome that may suck but you should know too.",
            "I wouldn't take the test tbh\nI truly think your dad would love you the same no matter what results came back, but I also think that those little weasels in your brain trying to convince you that he doesn't would get a WHOLE lot of ammunition.\nEither way, have an honest discussion with your dad about it and find out straight from his mouth the pros and cons he sees the test as having",
            "At this point you should be considered family regardless of any test results. It shouldn't even matter. Only true monsters would use that result to judge whether or not you're worthy of being considered true family. After building relationships and/or being cared for for 17 years, what difference does it make? It's not your fault one way or the other.\n\nIf I were in your place I might just take the test and if it turns out you are, in fact, related I'd tell the grandfather you're not and if that has any bearing on the decision tell him to go f\\*\\*k himself.",
            "Kind of shitty of grandpa. Like he can throw all those memories away based on a technicality? Just stop talking to you?",
            "I agree with several other responses that say talking to your dad is the most important thing you can do here. Express all your fears and hopefully he can share with you his.\n\nMy guess, based on the context given (and it may be totally wrong but this is the impression I get), is that he fears that grandpa is considering removing him entirely from the will and allocating what would have been for your father to your step-brother. Previously, I would guess that the situation was not significant enough to completely cut your father out of his will, but now given the context with grandpa and that possibility, I think your father just wants to be able to see you taken care. \n\nI could be totally off base, but if I were you, I would share my concerns with him and in plain language request an earnest and blunt response from him of his fears and motivations.",
            "I would agree to take the test, but then use the dna of your half sister, who is for sure biologically related to your father. That way it is a guarantee positive match, and no worries about being left out of the will or adverse reactions.",
            "Your dad wants a paternity test probably for closure, he will treat you then same regardless of the results.\n\nAs for your grandpa's will, not wanting a test to maximise your chances of getting inheritance is frankly, not your call - Neither can  anyone force you to take the test. However, your grandpa deserves to have the information as the assets are his to decide, and from the looks of it he rather not name you in his will simply because he doesn't know for sure?\n\nTaking the test may result in showing you are in fact his biological offspring and change things in your favor.",
            "From an evolutionary psychology perspective, you're bang on thinking he's trying to decide whether to care about you or the new baby. Don't get the test.",
            "Your dad had previously refused your grandpas wishes because your dad understands, whether you’re born by him or not, you’re his kid. He’s raised you, he’s invested in your future and your success. He loves you.\n\n\nYour grandpa has put him in a situation where if this isn’t done, he’s not going to leave him, and by extension, you, anything. When you’re an adult, sometimes you have to suck it up and go against your morals if you believe it’s truly what’s best for the people who depend on you.\n\n\nAs someone without a dad, this reads like he’s only wanting this test to shut your granddad up, and he could give two shits less about what the results are going to be.",
            "Your grandad will probably still love you regardless, family is much more than blood\nTake the test to put an old man's mind at rest, he probably just wants to meet his end knowing the extent of your mothers deception",
            "Your father has the right to know if you are his biological daughter or not. It is neither of your faults that your mum might have cheated. It might or might not change the relationship between the two of you. However, it is also not right for him to be in the dark about it just in case \"it goes wrong\".   \n\n\nAnd your grandpa has the right to decide where his property goes. If you aren't his biological granddaughter he might decide to leave you out of his will.",
            "I can't prove any guarantees but it sounds like your father loves you regardless.  I have several children around your age and if I were to find out they were not biologically mine it wouldn't change how I felt about them.",
            "It sounds like the grandpa is a terrible person. If I were you I would consider letting him know that you no longer consider him to be your grandfather so no DNA test will be needed.",
            "Fake test results for grandpa. He won’t know the difference. You and your dad can decide for yourselves if you *really* want to know or not.",
            "This is simple (to me anyway). Tell you dad that yo udon't care what the paternity test will reveal. Regardles if he is or isn't your father, his is and always will be your DAD. There is a BIG difference. Any guy can be a father (aka sperm donor). It takes a REAL MAN to be a dad.",
            "Blood should mean absolutely nothing in this context.  My grandfather and I don't share a drop of blood but he's been there for me more than almost anyone.  It would be fucking sad if your dad left your life because of that.",
            "> I realized my mom was having an affair for years on my military dad.\n\nThat's pretty standard for military marriages. \n\n> dad says we should get paternity test for me, but im worried he won't love me if it goes wrong.\n\nI'd want one too.  And look, even if you aren't his I bet money he'll still love you every bit as much.  Your mother on the other hand, that's a different story.  If you aren't his, she'll be out for good.",
            "If I were in his shoes I'd have sneaked some DNA from you after you told me. This kind of stuff is sadly common place.",
            "Your grandfather is a monster",
            "Wouldn't you want to know as well? It's just a paternity test and no matter how it comes out, he is the man that raised you, so he is still your father, but I'd want to know the truth if it was me.",
            "It’s shitty you have to go through it.  It’s super shitty of your grandfather to want it just to decide if you’re his granddaughter and tie it to an inheritance.  And finally...it’s shitty of your dad to even be mildly curious.  \n\nYou’re his daughter.  Period.  No matter what the test says.  He should forget about the test and tell his dad to fuck off.  Or, if nothing else, lie to the old fucker and tell him the results say you’re his.   Either way, I’m sorry.",
            "Well it doesn't matter what the results are. The main issue your dad has is with your mum. He raised you, so you are his daughter. The biology is not what makes a dad. It is the raising and being there. He won't stop loving you. It is just the grudge with your mum for the lies.",
            "Talk to your dad. It sounds like nothing will change for him. You're always going to be his daughter. He is concerned that you might lose inheritance from his side of the family. In my mind that means he has your best interest at heart. Make a deal with him that if he gets a paternity test, he will only share it if it is positive. If it is negative you both deny to everyone that you ever took one.",
            "Your grandfather seems like the one who is wrong in this situation. If he loved you he would leave you stuff regardless of your DNA. You dad seems to love you regardless and only wants the test so your grandpa can leave you money. He wants you to use that money for college and to be secure. It sounds like even if you aren’t his he will love you regardless, but if you are concerned you can sit down and talk about it seriously with him. \n\nAs a bonus story my dad is not my father biologically but he has a biological daughter from a previous relationship who is a drug addict with a criminal record. He’s decided to avoid giving her any money (not that he has much prob just life insurance and his cars) by giving everything to my mom. It’s kind of petty but I get it.",
            "Even if you aren’t genetically ‘his’ I can PROMISE he loves you. Why else would he take care of you all this time? Now. He might have some internal rejection about what’s going on, and there’s a chance it may extend to you. While that’s not fair, and I really hope that doesn’t happy- you gotta understand it’s not a reflection of YOU but of the situation and I’d like to think in time (if he becomes distant) he will get closer with you again. \n\nJust as this is a lot for you, it is for him too. So so so sorry this is happening.",
            "Holy Cow.  People can be so horrifying!",
            "There is nothing you can do kiddo except talk to your father. Tell him how you feel, I think your feelings are warranted in this issue, as that's exactly how it looks. Like he's trying to get you off his plate to make room for the new baby. But don't jump to conclusions, talk to your father first.",
            "Grandpa is an old man. This implies paranoia and stinginess has kicked in. Grandpa wants his wealth to go to true blood. (This is not my opinion, just pointing out how old people can get.)\nGrandpa already questions whether you are legit. Dad wants you to get a piece of the pie. So he has to prove to Gramps you are legit. If the test comes back positive then you get the inheritance. If not, you get cut from the will. This means you may just have to take out loans or score high on SAT for scholarships. Do not sweat it, take the test. Meanwhile, you could write up a letter for your Dad to sign. This will really get him... Write that if the test is negative you are to remain in the household and be treated like you have been, because you feel you are his daughter no matter what. Write that you do not want to be his financial burden and will look for scholarships to get you through college or learn a trade. Write You only want to be his daughter and not a financial burden, regardless of results and promise to make him proud. At the bottom Write his name, do solemnly swear that no matter the test results ..... will always be my daughter and remain here as my daughter. Have him sign and date. Not only is this legally binding, it will make him understand a few things. \nDo this... because it seems like you will be taking the test. So you might as well. Also, when you take the test, I do not know if it is saliva, but if it is ... be sure not to get any DNA from someone else in your mouth. Like using the wrong tooth brush etc. Good luck.",
            "You already know why he’s doing it.\n\nAsk him how would life be different for you and him if he finds out you are not his biological child.\n\nAsk him how your relationship will change if you’re not his biological child.\n\nAsk him if he plans to end his relationship with you if he finds out you are not his biological child.\n\nTell him how you feel. Tell him he’s been your dad for 17 years and even if the test comes back to show he is not your biological father he is still your dad and for you that won’t change.\n\nTell him you trust him to make the right decision.",
            "Do you want the test, is the real question. You are a legal adult and it shouldn’t matter. Talk to your grandpa and ask him why he suddenly cares, because if he truly loves you, he shouldn’t.",
            "I think you should just do it. Obviously, your dad raised you, and you love each other, and I don't think anything can change real love. If a negative DNA test or a new sibling makes your dad stop loving you, then, it wasn't real love. Plenty of people have biological children, but don't really love them. If they don't really love you, you might as well know now, and not waste your time. \n\nI think you should tell them that you love them, and you understand that your grandpa wants to know. But tell them, that you are not your mother, and you don't condone her cheating on your dad, or telling them that a child is theirs, when it might not be. \n\nBut ask them, please, not to take it out on you, what she has done. Remind him, that he is the only father you have ever known, and you will always consider him your real father, even if it turns out he's not your bio dad.\n\nThen do the test, and try to forgive your Grandfather, and put it behind you. If you act like you you want the advsntages of being their bio child/ grandchild, while refusing to reveal the truth, you are in danger of appearing to be like your mother. You might as well align yourself with and be on the side of the truth. Good people will respect that.\n\nYou might as well do the test, because as Buddha said: There are 3 things that will not long be hidden: the sun, the moon, and the truth.\n\nPlease do an update",
            "I can't believe your grandfather is stuck on this when you--as a *child*--saved your father years of misery. And potentially more children of unknown origin.\n\nLike even if you weren't your father's genetic daughter, you were your father's daughter. Through your actions. You risked everything when you were 12. You should have never, ever, ever had to worry about your place after that.\n\nIt's so unclassy that you should have to worry about your inheritance now, as you're *still* a child.\n\nThis shouldn't be your problem, but maybe the idea could be floated that your grandfather leaves his inheritance to his son, who he knows is his genetically, and be happy that it's going to his family. And stop giving his own son grief over affairs that should be in his past?\n\nI'm so sorry your grandfather sucks. Way to pick at scabs on his way out over DNA.",
            "What do you usually do when you're worried about an upcoming test? \n\nStudy!",
            "Just do it your self and if he's your father that will be a great father's day gift",
            "Paternity has nothing to do with the attachment and love that family has one another. Paternity should not change anything at all concerning if you are family or not.  It is estimated that one in twenty five  (4%) children do not belong to the unaware dad.  And it is never even revealed.  The dna tests are devastating families everywhere. Some people think dna matters more than any single other thing concerning families.  Dna is not what bonds us to others like parents and children. If your granddad would cut you out over dna and give zero credence to you as a grandchild, a good person, then so be it.  He is dead wrong. Love ve is not hiding in proof of the genes, it is all within the brains or us all.\n\nThe actual test may not be necessary, just mention to bio mom about the test and gauge her reaction.   Her reaction will give you your answer.  But do the test regardless, get it over with. You are still your fathers child, he is and always will be your dad, no matter what.",
            "Say you will take the test as long as he promises not to change weather your biology related to him or not. This man raised you for 17 years so weather your dna matches or if it doesn't HE IS YOUR DAD",
            "Do Drugs , Have lots of sex , Find a pimp !\n\n.... Then guilt trip your family into leaving money because its there fault!\n\n- I'm Doctor Phil and I approve this message!",
            "Well u,should do it..he can do it without u as well",
            "Your dad has loved you for 17 years. He’s not going to just stop loving you. He’s going to learn the truth that your mom did something horrible to him. It’s very catastrophic thinking and if you have a good enough relationship with your dad you need to logically question what actual reason he would have for not being your dad. I bet you won’t come up with much because you shouldn’t be able to.",
            "Your dad still loves you, and the important thing to remember is this isn't your fault and you're not a bad person.  IDK that I would get one now if I was him.  My son is my son, it's too late for that sort of thing now.",
            "What would your grandfather be saying right now if you had been adopted by your dad?",
            "I'm sorry your going through this but it sounds like he really loves you and is doing what's best for you and your family.",
            "Tell your father to lie to your grandfather and say you got a paternity test and that you are his bio granddaughter.  Tell your father if he wants to get a paternity test, you would consider it but you would prefer not to. And if he chooses to go forward (and you consent) to not share the results with anyone since he’s your dad and it doesn’t matter if it’s bio or not.",
            "He could just tell his father he did it and leave it at that. Doctor one up if he needs proof. No one will have to know but you and your dad.",
            "Why can't the grandfather bestow his wealth on your father and let him handle it when its his time?",
            "> What do you think I should do?\n\nI think you should go to your father, give him a big hug and tell him everything you're feeling, and how afraid you are of how a paternity result would change your relationship. \n\nAlso, your grandfather is a complete asshole.",
            "Youve been given some good advice.\n\nI just want to say im sorry.\n\nPeople make shitty choices and the ones who are innocent get caught in the cross fire.\n\nits not fair its not right and you shouldnt be in this situation\n\nGood luck",
            "If your grandfather hasn't figured out that after 17 years you're his granddaughter no matter what some damn test says, he's a gigantic asshole",
            "Take the test,  nothing to lose and lots to gain",
            "Dad is the one who raise not the one who makes.",
            "This breaks my heart, but let me tell you that I've been in your dad's shoes. Especially after waiting this long, nothing is going to change for him. He won't love you any less, but that doesn't mean he isn't scared that he would. He might also be worried about how you'll think of him, like you might not love him the same way.\n\nMy best advice is to talk to him. Maybe it would be easier on everyone if you could get the test and keep it away from him unless you want to share. Same goes for your grandfather. Or even talk to your grandfather and just give the test to him (without reading it unless your ready), and ask him to keep it secret until you two are ready to know the answer.\n\nI just want to reassure you, he will still love you. Honestly, I bet your grandfather will too. Being a \"father\" isn't about genetics, it's about raising you and loving you the whole way. Just try to reassure eachother of that.",
            "For all intents and purposes your father is your father and you his daughter. If I was your dad, If gdad wants a paternity test have him pay for it and pocket the money forge a fake one. \nIf I were you though, I wouldn’t want to know either way. What if I wasn’t, what if the man I whole heartedly believed was my dad wasn’t biologically my dad. What if this change him or our relationship? I would tell him this if this was how I truly felt.",
            "He’s your father either way and I’m sure he’ll love you no matter what.  \nBut he does deserve to know if it’s wrongful paternity. Even if it is he’ll still be your father.  \nBut you both have to know not just because you deserve to, but also because it might be a medical necessity to know among other things like benefits. \nFor example traits you could have inherited or conditions you have inherited.",
            "This is so sad and it’s not fair at all. You and your father are the victims here. Keep your head high. No matter what happens you’re a good person because you told the truth. Your dad sounds like a decent man and like he will love you and take care of you no matter what. You’re the reason he got away from your mom and has a new life!",
            "If her dad signed her birth certificate even if the DNA test doesn’t line up, the grandfathers estate is still technically hers after he passes until otherwise contested in court, unless of course he writes her out of the will. But if her dad signed her birth certificate he’s legally her dad, amirite?",
            "That’s awful I’m so sorry. I wish your dad and grandfather hadn’t even brought this up with you. As a family therapist I know I’m biased but I really think you and dad would benefit from seeing someone together. Hopefully he would be willing to do something like that but it’s not your job to tell him how to be your parent. If you need any help finding someone in your area feel free to PM me",
            "I bet you could pay someone to photoshop a bullshit DNA test result to shut grandpa up",
            "What your father needs to do is tell your grandpa that you’re his daughter one way or another, and that if he needs to see a paternity test to decide if he gives a shit about you, then you already have your answer.",
            "It sounds to me like your dad knows he now has 3 kids to put through university and he wants to make sure grandpa’s money is part of that equation. I don’t think this has anything to do with his feelings for you at all (and if he really doubted you were his, he wouldn’t volunteer to do the test).",
            "Op do you have any traits that you take after your father. I have two sons one has toes like my ex husband's toes, and one has toes like mine. Perhaps your eyes or nose shape. Do you have any similarities to any aunts on your dads side. That might help to answer before a test.",
            "There is not much you can do. Don't blame yourself. This is the crap of your parents.",
            "Get it, he'll still love u if it goes wrong, but no more fortune.",
            "If your dad's love for you was conditional, only if you were his biologically, I really think he would have pushed for a paternity test when he found out. It sounds like he is just worried about making sure both of his children have the best leg up in life and knows that if the DNA matches, it will make that a little easier. Without it, there's a very solid chance that your awful grandpa won't leave you an inheritance that could give you a great start in your adult life but with it, there's at least a 50/50 chance. Please talk to your dad. I think it will make both of you feel much better.",
            "is there some reason your dad won't just... lie to your grandfather? tell him the paternity test was positive?",
            "I'm so sorry that you are having to deal with this.\n\nI would sit down with your dad and tell him you concerns. Don't hold anything back, let him see how much this is hurting you.\n\nI'd also ask your grandpa why it even matters. I mean, all this time he has treated you as a member of his family, why does it matter if you are related by blood? If he will all of a sudden not want to love you or help provide for you future because of the results of a test, he never really loved you. Your family are the people that have raised you and cared for you. Tell him (grandpa) that you would still love him no matter the results of a test, why wouldn't he love you the same?\n\nI'm a much more confrontational person though, so maybe you aren't up for that. At the very least talk to your dad and tell him that you are scared if the test comes back and you aren't his blood daughter that he will check out of the relationship and not love you anymore, just like grandpa is showing through his asking for the test.",
            "Your dad seems like a strong, smart man. Whatever the answer is, he will get it right and make the best decision for your fam. Stay blessed, youre dad isn't leaving you or going anywhere. He loves you.",
            "I doubt he'll stop loving you if it turns out you aren't his. I mean, he did refuse every time his dad told him to get a paternity test. It's seems like your dad really cares about you no matter what. If you feel worried, then tell him your feelings.",
            "I am sorry that your grandpa is so blindsided by whatever bs he’s got going on that he can’t prioritize the really important thing. He’s got an amazing grandkid who obviously cares about her family a great deal. He’s a lucky man and it’s his loss that he can’t see it.",
            "I'm not gonna get into the relationship advice, everyone did a fantastic job. I will say that you have every right to not take that test. Nobody has the right to lord that over you.",
            "Don't you want to know? If I were you, I would. Not knowing doesn't change the reality of the situation.",
            "First of all fuck your grandpa for holding threatening to withhold inheritance unless he gets his way. He should realize how hard it is on you and your dad and if you and your dad love each other it shouldn’t matter. Maybe have him get the test to get remain in the will and hopefully it comes back as you are his child, then bide your time and pull the plug on gramps",
            "If that’s how Grandpa is talking to you, you don’t need him in your life.",
            "Well op I would just get the test and tell him that no matter what you still love him and wouldn't want it to affect your relationship with your dad because even if you aren't his biological daughter he still raised you and tell him that you'll always be his little girl no matter what. I have a cousin who was raised by another guy and when he turned 18 years old the guy adopted him as his own son, he's doing the same thing with his son even though he's not the biological father he's still raising his son as his own kid. What I'm getting at is that blood doesn't always have to be family it's the bonds that you have with someone that does make you family. So don't stress about all that much because your still a kid and you got your life ahead of you. Hope to see an update about this one op because I'm rooting for you guys.",
            "As someone who is looking forward to being a parent hopefully sometime soon and who has been an aunt and honorary aunt for a long time and some of the kids are are now older than you, I can promise you that when you watch a kid grow up and are close with them you just love them. It doesn't matter if they're biologically related. That doesn't change that you watched them grow from a baby into the amazing teenager you are. Your dad has been clear that he loves you no matter what. He raised you. He is your Dad whether or not he is your biological father.\n\nHe probably just feels weird because your grandpa isn't doing well and it's not his choice to make for your grandpa and he feels caught in the middle. I'm sorry your grandpa is being like that. Please talk to your dad about your fears about how your relationship might change. He seems like a good man and I think you will feel better if you talk to him, no matter what any possible DNA test ends up saying.",
            "It’s something where you’re gonna have to be honest and just look your dad in the eyes and say, “no matter what happens.. you are my dad and I need you”",
            "Here's the problem:\n\nYou're worried that if you get the DNA test and it comes back negative, that when he looks at you he's just going to think about his ex-wife cheating on him, and eventually it will chip away and destroy all the love he has for you.\n\nBUT\n\nIf you don't get the test, he's going to be wondering the same thing, and that's going to constantly remind him of the ex-wife's cheating, and thus chip away at his love for you.\n\nERGO\n\nBy taking the test you *might* lose, but by not taking the test you *will* lose.\n\nIt sucks for you because (in game theory terms) the payoff matrix is a net negative.  However there's one strategy that has a better average payoff (because it might be bad but it also might not be bad - vs. all bad)",
            "OP your gramps is a real crotch bag. I’m sorry, the thought of someone treating their granddaughter like that regardless of blood relation is incredibly heinous to me. What happens when the test comes back and you are his granddaughter? Man’s going to hell for sure. Your dad seems like an honest man who honors his commitments and he clearly loves you very much since he was crying at your picture. Regardless of blood, this man held you when you were fist born and he’s been there for you regardless of his job, his relationship with your mom and he’s clearly being strong armed into this decision and it’s eating him up. Regardless of the test results you are strong and you are smart and you have a moral compass that will always point you in the right direction as long as you trust yourself. Be honest with your dad tell him your concerns and that you don’t want to lose him and never sell your soul for money even if it pays for your college. Tbh college is overrated anyways I’d rather have my dad.\n\nIdk if this helps but you can always steal a hair off your dads brush and check for yourself before you give your consent to have an official paternity test done. Order a paternity test online with your dads help or an adult you trust. \"A mindful mind knows no fear\" live in the present, don’t think about what happens if the test in negative and don’t think about the past because you had nothing to do with any of this. Right now tho, you are his daughter and if you know before you have to take an official test it will be much less scary. And if it does show negative tell your gramps to be buried with his money and don’t consent to the test.",
            "Your father has shown you how much he loves you regardless for these last 5 years. I’m sure this change has happened due to your grandfathers increasing pressure (he’s probably worrying about dying more and more) and the new baby means the will might change. This isn’t about your dad deciding who to prioritize, it sounds like it’s all about his dad obsessing over grandchildren, inheritance and genetics. And with a new baby coming we likely worrying more about money and futures for all you kids. Definitely open up to your dad. It sounds SO hurtful that your grandfather is questioning whether to call you a grandchild or whether you “deserve” an inheritance. Blood is meaningless, these people raised you and should love you regardless! Just because your grandfather is an AH don’t mean your dad will follow suit. And it sounds like therapy could really help you work through everything that your mother, and now your grandfather have put you through.",
            "I’m sorry you’re even in this position, girlie. Adults can really suck.",
            "You can spend $100 on 23andme and find out yourself if you're related to your dad's side of the family. If you are related to your dad, you will see distant relatives with his surname. Knowing the answer ahead of time can help you decide how to proceed with a formal test.",
            "I just want to point out, being a parent does not have to mean that you share DNA with a child. Your grandfather wants to let your mother's decisions dictate *your* life. Your dad has raised you as his child, and you've been a loyal, loving daughter your whole life. This DNA test idea is messed up and implies that somehow you're guilty of something, or that you're not worthy of inheritance or help from your grandfather if you're not related by blood. What about your step sister? Has your dad adopted her? Is your grandfather leaving her out of his will because she's not a blood relative? The whole thing is ludicrous.",
            "Make your dad have a paternity test to prove he's your grandads child. Say you won't do any until they have their results. Let your dad question his worth based on his parentage.",
            "Talk to your dad . Tell your feelings. That's the main solution.",
            "Your family should love you whether or not you're biologically related. The test results are irrelevant. I'm afraid that you should distance yourself from your grandfather. He doesn't sound like a good person. I'm really sorry.",
            "I havent read everything above.  You are loved.  Life is freaking hard.  Request a therapist, so you can speak rationally, because you need a trusted adult, this is ALOT. It sounds like your grandpa is in alot of pain.  He is unable to process this, nor does he have the tools.  They need to hear your feelings after you have practiced with a professional how to talk to people who arent the best at communicating, and maybe emotionally unavailable?  If money is a thing, they should at least pay for community college and a state college?  Having a wonderful, hard working \"kid\" is worth the investment.   Most states have what's called a 'warm' line.  They give 20 minutes of free counseling, and can possibly give you more low cost/free resources at your age.  NY has a nation wide warm line, they just ask everytime if your suicidal lol. But it's free:)  Your grandpa is oldschool, he does/ does not relieze how he sounds to a young person.  Please dont take it to heart, they know not what they do.",
            "From a dad's point of view, I can see where he's coming from in wanting to get money for you and your sister. If he's raised you for essentially all of your life, he's not going anywhere. That said, his main priority should be taking your feelings into account. If you're not comfortable with it, tell him that and explain why.",
            "Take the test. Let the truth come out. But before you do that you must speak to your father and explain to him how you feel, especially the part that you think he won't love you the same way if the results are negative. Honesty is all.",
            "Grandpa is an asshole, I’m so sorry. Even if you aren’t genetically his child, you ARE his child- you’ve loved him unconditionally and chose him over your garbage mom. That should speak volumes to grandpa.",
            "That’s what you get for meddling. Now you deal with the consequences.\n\nGood luck!",
            "You've been his daughter your whole life. He's not going to stop loving you if for some reason the paternity test reveals that he isn't the biological father.\n\nIf it turned out your dad isn't your biological dad, then it sounds like your grandfather may alter his will and any inheritance. You can't control that.\n\nSit down with your dad and talk to him what you posted here.",
            "I think you should sit down with both of them and tell them how hurtful this all is. That they are the only family you've ever known and something as benign as DNA shouldn't change that.",
            "Just talk to your dad about what you're thinking. For the most part he probably just wants your grandfather to leave you with some inheritance because if you're siblings get something and you didn't that would kinda suck. Unless you don't care about the money, but in the case of free money where you might receive nothing, I would just view it as no lose situation",
            "I'm going to be harsh for a sec.\n\nIf your grandpa doesn't love you now as you are, then it's a little moot. A paternity test doesn't determine anything more than biological data. You are your father's child and your grandfather's grandchild. What are they going to do, boot you immediately if you aren't related? How is that fair? That's not something within your control. They raised you, and they don't need a sheet of paper to tell them how much they should love you. \n\nBut I agree with the others, definitely talk to your dad.",
            "What if you were legally adopted? Would grandpa want to leave you out if the will?",
            "Tell your grandpa you don't want anything from him. Not his money, a phone call or a birthday card.\nTell your Dad it doesn't change anything between you two.",
            "Your dad seems to be caving under the pressure but if I were in his shoes I'd tell you he has your back 1000%. If you are worried he might be changing his feelings maybe you should talk to him about it. I could guess with almost full certainty he's not changed one bit about him being your father. Blood or no blood. By your words he's done everything he can to keep you in his life. I think they'd have to kill him to sever that bond. Ask him straight up what he's planning and thinking of because laws dealing with Inheritance are tricky and differ from country to country.\n\nYour grandfather must be one of those types although I don't like to assume anything but if your grandfather has been pressuring your father for years he might have given him an ultimatum. Your dad might be navigating the situation with finesse and a little worried that you might be left out of your grandfather's estate.",
            "You need to understand that your grandfather is a bad person. Even if you weren't family, it's your relationship with your dad and grandfather that matters. He sounds like an ice cold, terrible person.",
            "Talk with him, it doesn’t sound like he would stop loving you, maybe its just the money and honestly I understand that in some way.\n\nBut for the test there are always possibilities to fake these, if that would be the only problem.\n\nFor everything else I wish you the best and hope on a good end:)",
            "It's disgusting that your grandfather's love relies on wether you are biologically his grandchild or not.",
            "Type up an official looking document saying your his daughter and show grandpa. Why does grandpa even care?",
            "When I discovered my mom wasn’t faithful to my father she retaliated by suggesting (on Facebook mind you) that I wasn’t my fathers biological daughter. For my own peace of mind I wanted to get a paternity test. Before we took the test my father and I had a long conversation about what it would mean and how our lives would look if the results showed I wasn’t his biologically. Do the same with your father (because DNA doesn’t make a father, the person who raised you does).",
            ">Well grandpa on dad's side has been pressuring my dad to get a paternity test as he wants to make sure that \"I am his grand daughter\". This is getting really intense as grandpa may pass away soon and he says he doesn't know if he should leave us anything if he doesn't even know...\n\nSo your grandpa is going to cut his own definite son out because there's a question mark over that son's daughter?\n\nSomething isn't quite right there, tbh. Does your grandpa often act in controlling ways?",
            "If I were in your shoes, (I had a job at 17, so I'm assuming that you do too)?\n\nI would secretly do a test without telling my dad. Give a friend the results and have my friend either tell me \"yes or it was inconclusive\". If it's yes, then I'll just give it to my grandpa and demand a refund. \n\nIf it's \"in conclusive\" well then, I would just hysterically cry everytime it would be brought up. \n\n\nAs an adult. I would say \"this is beyond fucked to ask of me. How about if I take the test then you are both out of my life regardless of the results because apparently love means nothing to you guys. I don't have time for people like you in my life.\"\n\nChances are the need to keep blood would be higher then losing someone you love that's not blood. Which is definitely backwards.\n\nBut you don't need to lie, manipulate, or hide things, once you understand people's motives. You just have to call them out on their bullshit. And they panic because often they did not even understand their bullshit. \n\nBest case scenario your cruel grandfather thinks he is protecting his son from a crazy ex wife and her child. Worst case, your dad doesn't want to invest any more time in someone who might leave him for a different dad, which is probably silly for you but based in his fear. \n\nIf you're grandfather is just an idiot, your terrified dad would beg him to back off if you threaten to leave over it.\n\nIf it backfired I would take the test for financial gains and play my exit strategy as I personally don't want people like that in my life. Cash pay for the risk of truama if I wasn't related. \n\nEither way you don't need your grandfather's money. Just learn how to graduate college early, save money during college, and pay off loans as much as possible. Read Rich Dad Poor Dad and you'll escape the rat race eventually.",
            "The moment a man finds out his wife is unfaithful, he is going to at least think about verifying every sector of his existence (as a comedian once said, there's no bigger than lie than, 'its your baby'), because everything about the relationship has been called into question, especially his legacy (children and grandchildren). \n\nPeace of mind, is everything.",
            "It sucks, but your dad seems to love the same as he raised you as his own. Your granddad's love seems to be conditional on dna/ and maybe its not love at all. he saw your growing up as his grandkid yet he would happily leave with no inheritance if your dna doesnt match one - dont care much for this guy and his opinions. his love is superficial. and about inheritance many ppl live without it and happy/ you have your family, your dad, you can get a loan or scholarship.   get a paternity test if you want certaintly, its good to know whos genes you have  . Dad is who raised and spent years and energy and money raising you. i doubt he would change his opinion since he was doing it out of his will and nt under pressure of obligation being dad. He was resisting the paternity test.\n\n&#x200B;\n\nyou can also resist the test and don't mind this situation at all. let your grandfather deal with his problem and inheritance by himself. since both of you dont want it. you are almost grown up and your dads responsibiilty to you almost over and anyway now your relationships is mainly based on mutual love and care for each other. So being his daughter or not , this should not affect much your relatioshhip if it wont get in your head. Be ready tha tif you have a half sibling  on a way your family would have to give him lots of their attention and time and it would be happen regardless the dna test. that's normal.",
            "Should make this into a movie, maybe make something the at box office cuz ur fam is screwed",
            "You ARE your grandpas grandaughter. Its about LOVE and TIME not blood. fxxc him and the test.",
            "What if you are his daughter? wouldn't this test give you and all the parties involved a reassurance in case you are his daughter?  Everybody here is assuming she is not his bio daughter, but what IF SHE IS ACTUALLY HIS DAUGHER?\n\nThere is the possibility of walking in eggshells for years and ending up taking the test down the road. Personally I think I would prefer to know now.\n\n&#x200B;\n\nI was raised by my stepdad and he was more kind, loving and in my life that many in my bio family.  I love him more because he did not have to love me, and he did!",
            "I would refuse the paternity test, and tell him that if you're really his daughter, then he shouldn't care. He already knows the affair was a thing, so there is no need for you to submit to this in order to prove anything. That he would ask you for a paternity test is very upsetting and beyond insulting.\n\n\\> grandpa on dad's side has been pressuring my dad to get a paternity test\n\nYour grandfather is a horrible person--I think we can agree there--and whatever his opinion is should have NO bearing on how your father treats you. And should have no bearing on whether you submit to this totally unnecessary and demoralising paternity test. Your father should be telling his father that this is none of his affair, and that should be the end of it.",
            "Blood does NOT equal family... FUCK. Your grandpa is a bit of an ass...",
            "Your very young but many parents realize that your grand parents very often aren’t right about many things but we sometimes humor them even if it’s the wrong thing to do since they are old. \n\nFuck your mom, sorry, but here’s a life lesson don’t cheat.\n\nSecond, I say trust your dad. Seems he loves you like his own and if your honest with him and tell him you love him being your dad it’ll be fine",
            "Okay, some offense. Screw your grandpa. He waited until he was dying to really Lord it over your dad in the guise of being able to take care of the things you need for your future. Screw him. This sucks for your dad and for you. I'm sure you're both afraid of finding out something you don't want to find out. I can only hope that if it does come to that, your dad still does what he's supposed to do and makes sure he let's you know how much he loves you whether your his biological child or not.",
            "No advice either way on the paternity test, but if this were me, regardless of the results, “grandpa” would move to the BOTTOM of my “family I care about” list.  What a jerk!",
            "Your grandfather is an asshole.\n\nYou are his granddaughter whether you share 1/4 of his genes or not. The idea of having a relationship with a child then suddenly cutting them off due to genes is appalling. What sort of person thinks like that?",
            "As a dad who isn't 100% about my kids paternity (coincidentally also military and similar circumstances) I've also considered getting paternity tests.\n\nI love my son and my daughter.  They will ALWAYS be the loves of my life. \n\nI cherish them and the circumstances of their birth will NEVER change that.\n\nBut...  There's this lingering uncertainty in the air...  Part of me just wants to KNOW so that I don't have that question pop in my head every time I notice my son's eyes and hair are light while my ex's and mine are dark...\n\nIt's like this itch that never *quite* goes away.\n\nNo matter what though, he is my son and I will always love him.\n\nI raised him, I changed his diapers, I taught him to walk and how to be a good person.  I taught him to stand up for himself and others.  I taught him the right way to peel a banana and that peanut butter honey banana sandwiches on toast is the greatest food ever created.  \n\nHe is my son.\n\nI just want that lingering annoyance in the air to stop bugging me so that I can just get over it and move on.\n\nSorry for the ramble, just thought I'd share my thoughts as I can kinda relate to your dad.  If he loves you then it won't matter, but it might scratch an itch that keeps bugging him... Or maybe your gramps is loaded and he's just trying to set you up for success with a good college fund?  \n\nEither way, I hope it works out well for you.",
            "You need to talk to your Dad and tell him what you told us here. He's loved and cared for you for 17 years, I doubt a new sibling will change that. But I understand as a teen with a lot of stress that that is what you are assuming. I think your Dad is honestly just worried about paying for your college as he won't receive the help from Grandpa. But that won't make him stop loving you.",
            "This is awful. I had similar situation with my father. Parents got divorced when I was 9 (no affairs though) and my father wanted a DNA test once I was close to 18. The court said it’s too late to test the DNA, he could have done it when I was little, not when I’m almost an adult. Long story short, he passed away couple of months ago and left everything that he owned to his sister. So on one hand it’s better if you just do the test but I’d first talk to your mother to see if there is even a small chance the test may confirm that you’re not his daughter.",
            "That sounds soo crazy, must be hard to deal with",
            "Fake it. Fuck gramps.\n\nEdit: did no one else suggest this? It’s easiest way to handle this by far.",
            "Tell him if it doesn't matter, then there's no reason to do it.\n\nAlso tell him that he and his dad shouldn't \"punish\" you on account of what your mom did or didn't do.\n\nAlso let him know that he has you as daughter, and his dad has you as granddaughter, and that testing might cause them to lose you.\n\nSo, yes, it *does* matter - and tell him the answer is no!  You're not to be judged by the actions of your mom.",
            "Man, as a product of divorce myself, get yourself some therapy as soon as you can. Watching your guardian start to choose their spouse and his new family over you is a harsh drama to watch slowly unfold and it can really affect your self-worth. Try to get some help even if you think you're fine. Don't be like me and wait until you're 40 and look back at all the asshole decisions your parents made deliberately or sometimes subconsciously. I know I'm probably projecting here but I see you questioning your Dad's love for you and it kinda hits some nerves.",
            "As an adoptee who’s mother had commitment issues, I don’t blame your father",
            ">\tbut im worried he is wondering if he should care about me or just my new sibling.\n\nI highly doubt this.\n\nI had a step daughter for 7 years until my wife and I had a baby. I was basically her only dad as her bio-dad is out of the picture.\n\nEven after having my own child, I love them the exact same. Step-daughter isn’t any less mine because she’s not my blood.\n\nI think he’s honestly just worried about you not getting help with money.\n\nIf my dad did this I would resist too and once he put his foot down and wasn’t gonna budge on giving money if he didn’t know. Then I would try to get the paternity test. Because at worse I still love\nmy kid the same. Blood or not. But if it shows paternity now my kid gets some help feom grandpa. \n\nI’ll take that",
            "that man raised you and clearly cares about you. you looked out for him and he will look out for you in return. that’s it.",
            "Call an ambulance call an ambulance, « but not for me »",
            "I'm surprised that nobody has considered the other side.\n\nHate me, I don't care. I must be honest. It's *extremely* emasculating and embaressing if your child is not born from your sperm, or your kids. They are simply not your kin, and dont share your physical features. Another man unknowingly impregnating your wife and you raising that kid? Big fat NO. I'd feel like a loser for the rest of my life. Your grandpa wanting a paternity test on you is justified.\nException: being a stepdad. That's different though. At least you're not fooled about them being your biological kid.\n\nDw however, I'm not a \"repulsive\" person IRL as I'm socially aware enough to downplay my harsh opinions.\n\nSidenote: I never check my replies, so don't bother. Far too many people deluded from the truth, it's pathetic.",
            "Definitely get the test. And your father both deserve to know the truth no matter what the result is your still going to be his daughter and that will never change. And if it happens to come back negative grandpa doesn't need to know that. But if you and your father both have no intrest in finding out then definitely don't do it just because grandpa wants it done. Do it for yourselves if you do decide to get the test don't do it for anyone else.",
            "You don't know the pain of feeling immasculated and knowing you are raising someone's child . It's the most immasculating thing for a man . Your dad and his dad has the right . Moreover you have the right to know who's your real dad .",
            "it’s just a paternity test. i had to do it. just get it done. or do you think you’re actually not related? is that the problem? also your grandpa is shit"
        ]
    },
    {
        "post_id": "c9dg8e",
        "author": "biyfriendnovel",
        "title": "My birth parents (60s?m, 60s f) who bailed on me (30sf) are flaunting my success around town. How do I get these fools to shut their traps without bringing attention to it or sounding like a drama queen?",
        "url": "https://www.reddit.com/r/relationships/comments/c9dg8e/my_birth_parents_60sm_60s_f_who_bailed_on_me_30sf/",
        "score": 5219,
        "num_comments": 422,
        "created_utc": 1562314552.0,
        "selftext": "Hi, my brother (a year older) and myself were products of an affair. They wanted my brother. \n\nMy father stayed married and my mother took off with my brother leaving me with friends as a toddler. She says it was because I was ugly. Father informed but not interested when I went into foster care and I stayed there until I found out who they were at 18. I've read the court papers as to my foster care.  They just didn't want me. My childhood was horrific. My father maintained contact with my mother and brother. \n\nI have always lived 30 minutes away at most from my birth parents in the same area. \n\nMy grandmother was coincidentally my neighbour. She found out who I was through gossip and would send photos of me growing to my birth parents as a joke. She knew about the abuse and did nothing. She's dead. \n\nI left 'home' at 17 was homeless and have done everything myself. My full and half siblings from both sides have been well looked after by my parents. \n\nAt 18+ I reached out to them and my father was remarried and made plans to see me repeatedly he never showed up for. He said it would upset his new family.  My mother had a lot more children and had forgotten about me really. I contacted them when I had my son and that was it and I heard nothing back.  \n\nUNTIL. I've been in the media a fair bit and my friends have told me that my parents have been bragging about me and taking credit for how I look and my successes.  My mother's side of the story is now that I was cruelly ripped from her breast and forced into foster care. She compares herself to the irish homes of unwed mothers and forced adoptions. Oh WOE IS HER. My father is now an example of the injustice of the court system against fathers and how this is just further proof!  Oh WOE IS HIM. \n\nThey talk about how I look like so and so and that I wouldn't be here without them. That my nieces and nephews Ive never met are 'just like me' and how I should give them the same opportunities I have had in my career. How that's what we do for 'family'. How I need to 'grow up' and get past it. \n\nI blocked contact after they wanted things, but this nonsense spreads easily and I am sick of being whispered about.  I don't want anything off them, I want to be left alone. They want me to meet their other grandkids at parties and they've apologised for the govt/family/god possibly/ the great spaghetti monster keeping us apart.\n\nIf I contact them it is further fuel for the fire. If I don't stand up for myself I look heartless and cruel. \n\nI don't want to leave just yet as my son is finishing school soon, I just want them to stop. \n\nAny advice?\n\ntl:dr parents terrible taking advantage of my successes how to stop them.",
        "permalink": "/r/relationships/comments/c9dg8e/my_birth_parents_60sm_60s_f_who_bailed_on_me_30sf/",
        "comments": [
            "Do a Mariah: \"I don't know them.\"\n\nYou wouldn't be lying, you only share genetic material with these people, that's about it. If you are asked for your opinion, you can honestly state that you were raised through foster care, because your biological parents made different choices and you worked your way up from a disadvantaged position alone. Be factual. They can share their perspective, you can share your own. He said/she said, but you're the owner of your side. As the person who's achieving things in the media, your story will be more emphasized.",
            "You can't control their actions, only your own. Block and ignore, and if someone you talk to (either at work, a friend's house, the grocery store) mentions something your parents etc may have said, you can just say: \"I'm really surprised that this is their version of the story since that is not at all what I experienced and know happened.\" and then move on.",
            "Hmmm if you’re big enough maybe get into a charity for foster kids and when asked why, say that your experience with parents who didn’t want you influenced you to help kids who are also stuck in the system.",
            "I had a similar issue, my parents taking credit for something they actually blocked and set me back 10 years. I had so many plans to expose them, but ultmately the answer is ignore them. Ask yourself: what do you *really* care what people think about them? Sure, it's annoying but it can only annoy you *if you give it head space*\n\nThat said, when a TV interviewer asked me if my parents helped me to achieve my goals, I simply said \"no, they actively blocked me\" and declined to expand on that.",
            "don't involve yourself in a ”he said she said” situation because, trust me, people will pile up the dirt even more onto you, and YOU will look like the trouble maker. \n\ncarry on doing your thing, stay in your lane, focus on your life and success, and continue cutting them off.\n\nyou cannot win with the people. and those outside the circle won't be convinced of you put things in perspective.",
            "I am not sure the type of city/ town you live in (guessing it’s a small one where everyone knows everyone). \n\nSomething I have seen before (might not apply to you) - is local newspapers do write up about personal stories of achievement. Perhaps you would like to tell your story in a local article about your experience growing up, the moment you found out how your parents abandon you, your struggles, your ability to overcome adversity, where you are now and how people previously shunted you are now trying to get into your life. That, would shut them up for good.\n\n\nDon’t contact them ever again. The friends that know both you and them, tell them straight up you don’t want anything to do with your family and never to speak about them to you. They are toxic to you and hearing about them all the time are just continual cuts into you soul.",
            "You owe them nothing.\nBe certain that they get it.",
            "If you are well known enough maybe an interview about your experiences in the system, and casually mention how it was made worse by finding the court documents about how your parents did not want you, etc!\n\nThey do not deserve to even speak your name nevermind brag about your success!",
            "Just ignore them.  Nothing good will come from engaging any further.  To quote the movie WarGames, \"the only winning move is not to play.\"",
            "[deleted]",
            "You'd save yourself a lot of heartache by blocking them all on social media and cutting  contact. Just because you share DNA doesn't mean you owe these assholes anything. Also, you do not owe them explanations for your actions.",
            "How old is your son?  You should move out of the area.   There really is no good reason to keep this pain going.",
            "I would do it indirectly, by publicly thanking , let's say your son, for giving you the strength to be the person you are the day and that he is the only reason you were able to where you are. But in a subtle fuck you kind of way to your parents",
            "Don't engage with them. You can't control what they say about you unfortunately. The people who genuinely care about you will come to you for your side of things.",
            "my heart is in pain and i can only hope that life will be kinder to you!",
            "r/raisedbynarcissists has good strategies to deal with irrational egg donors. Hopefully you'll find it useful.",
            "I would use your time in the media to clear the air when possible? Not sure how you've been gaining coverage. But if you have to introduce yourself, say that you rose from a difficult childhood from being an unwanted child and ward of the state to your current status of whatever you do.",
            "The best thing you can do is live your life and not get bogged down in their drama. They never cared about you, so why should you care about them. People will always talk, treat them as just other people who talk.",
            "First, I am so sorry you have gone through that. You didn’t deserve shitty, selfish parents. \n\nSecond; congrats on your success. The success you did all on your own despite the adversity thrown at you.  Your ‘cousins’ have the same opportunity and do not need your help.  \n\nWith all that said, a personal philosophy of mine, “those with the loudest voice often have the most to hide”. Let them spew, let them escalate and sit back sat and do nothing. \n\nLive your life. Maybe tell a few close friends who you know will have your back. If needed,  maybe a small press release stating you have been on your own most of your life and do not know who those people are past their names. Have an attorney do it. You don’t care enough to do it yourself as they are not worth the time of day. \n\nEnjoy your success and enjoy them self-destructing. \n\nThese are horrible, toxic people. Do not engage. They are the type of people who play victim and make every word or every action some kind of crime against their well-being.  There is no fighting that. Everything and anything you do will be their fuel. \n\nKeep a diary with any contact or rumor you hear, keep up to date but ignore the shit out of their existence. If they reach out to you in anyway, text, email, smoke signals- note it and ignore it. That’s what they did to you until they felt you were of value to them.  \n\nBe PROUD OF YOURSELF. please.",
            "You don’t know these people. Blood means NOTHING.",
            "I'd humiliate them by saying it's sad that these strange people have decided to pretend to be my parents for attention and money. I'd lay it on thick that I don't know who they are, and they're trying to get money",
            "Treat them like the fame stalkers they are.\n\nIf you are getting media attention right now, slip this into your next interview - since you became famous, your biological parents have been taking credit for your success but you've never actually known them.  You had a tough childhood in foster care, and you don't understand why your biological parents are reaching out to you at this point in your life. \n\nMaybe even just write out a public statement/ press release and give it to the media. Put the press release on your website, so it is there for reference whenever you attract attention again. You don't need to interact with these people directly. They're stalkers. Make it clear publicly that they have no reason to claim that they have any connection with you. \n\nYou've done so well for yourself, maybe there is someone else in your life you could publicly credit with supporting you to success.",
            "Can you talk about your experiences in a positive light? Maybe get involved in a foster care reform organization or charity for abandoned kids? It would help you get the real story out there while also helping you heal from your childhood.",
            "I’m an adoptee as well and I understand how awful it feels when adults who failed you as a kid try to take control of the narrative. You can’t change their behavior, but you can validate your own experience. \n\nIt’s proven to be very therapeutic to write out the whole story from your side. Write it as if you are telling a third party who has no idea what happened. It will be helpful even if you never share it with anyone, but I would say it’s perfectly fair if you ever did want to share it publicly. Or just keep it in your back pocket if things ever escalated so much that you felt compelled to share. \n\nI saw you express a hesitance to seem petty or “he said/she said,” but this circumstance is so specifically horrific— not many people will experience in life. For many of us adoptees, our origin story is the main thing we have to keep us anchored to reality. You have a *right* to truth. It’s not petty in the slightest.",
            "You could write a book about your life. Keep mentions of your parents to one page or less, stating the facts of the case which you have proof of unemotionally. Don't even list their names. \n\nRun that page by people. Like a lot of people.\n\nPeople eat that shit up. Inspiring tales of being abandoned and growing up in foster care and succeeding? That bookll do great.\n\nAnd frankly it's a story that needs to be shared.\n\nAs long as you keep your mention of your parents brief and unemotional, no one will call you out for smearing them (because its literally not smearing them) and it will shut them the fuck up!",
            "Open letter in the local paper.",
            "If it continues and starts to impact your reputation, release the court papers which prove who your birth parents really are.",
            "May I ask what you do for work? I'm just very curious/nosy...\n\nAlso, my jaw was on the floor while reading your story. Those people sound horrific. The first thing I did when I started reading was notice the ages... Putting a child up for adoption at the age of 30 sounds inexcusable (depending on individual circumstances, I suppose). I was expecting to see like a \"teen parents\" kind of situation... Nope. They were fucking 30.",
            "I would just go with honesty whenever it is brought up, without being excessive or bitter about it. \"It's unfortunate that they rejected all attempts at meeting myself and my family up until my appearance on television, it sadly makes me question their motivation for saying these things now.\" \n\nYou're not saying your parents are shallow, horrible people, you're just stating the facts and letting other people draw their own conclusions. \n\nI'd also strongly urge you to contact a lawyer for wills and advice, because if you die for any reason, these people are still legally part of your family. If you and your wife die at the same time, they could get custody of your son and waste any inheritance he has from you.",
            "Megan markle is that you",
            "Why don’t you write a book? Even if anonymous, I’m sure a publisher would love to hear your story!",
            "Fuck them! My dad walked away when I was young and only played dad when he wanted to. I grew up with a severely mentally ill mother and a teenage sister trying to raise me. I can tell you stories about getting screamed at till 2 in the morning or sitting in the hospital with my mom telling she wanted to die when the doctors were trying to find the right drug combination to make her a functional member of society. While all of this was happening my dad had other kids he was raising. \n\nAt about 16 I chose to have a relationship with my dad and some days I regret it. I hear him brag about how successful his daughter is she has a big job with a fancy title and shes in grad school. Everytime I hear him brag about me I think about the kids he chose to raise instead of me and how they are now doing heroin and living on welfare, but he thinks he can take credit for my accomplishments. \n\nYour situation is much different than mine, but my heart hurts for you. I hope that you can find the answers you are looking for.",
            "Do a Mariah and get a lawyer just in case.",
            "A cease and desist letter from a lawyer\nOr use grey rock",
            "You have got to stop caring what these people think. Anyone who is important to you knows the truth. Just stay away from these people. Eventually, the furor will die down.",
            "Major props to you for being so level headed about this. I would of gone off a long time ago. Just reading that made me angry and I dont even know them! I hope it all works out for the best though.",
            "Just block and ignore them. People that feel entitled because of DNA are a danger to forward progression. Those are the people when someone asks about you they'll retell your story being sure to leave out the hurt they caused you.",
            "Perhaps the best solution for your issue is to get your story out there. Tell people of your struggles. It will surely inspire people to keep moving forward. Act like this is your only reason behind sharing it and you should completely ignore your parents. Sooner or later the stories will get around town and people will notice the conflicting accounts then people who witnessed it happen will weigh in on which version (yours) is the truth and your parents will seem like the liars they are.",
            "Open letter/AMA, about how you overcome hardship from birth, no names because then that's close to \"slander\", but how both biological parents never wanted and willingly dumped in foster care. You can also advocate for improvement for the foster care system in your area.",
            "Honestly , they forgot about you , you should forget about them. If anyone asks you tell your story and let that be it.",
            "I'd show people the court papers. But I'm petty.",
            "How fucking enraging.  I'm sorry for the raw deal you got, and congrats on moving on to a successful life despite it.",
            "Fuuuuuuck that.\n\nBe cold and cruel then, who cares, it's not inherently wrong to be the one to ice people who are toxic.  You know damn well the truth, and they don't deserve your attention at all.",
            "So this might only work in a small town, but after my dad died I found out where he had been living under the guise of a childless, family-less nice guy. Instead of ya know the abusive drunk child molester he actually was... He had a long term girlfriend who was helping him maintain the lie. So I went to that town under the guise of being his only heir needing to make sure his affairs were settled, and I subtly and calmly told people why I hadn’t spoken to him in 11 years. I spoke with the gossipy ladies at the bank, the police office, the dmv, etc. Pretty sure word got around. \n\nIf it were me I would just calmly be like, “That’s weird that they’d say that since (here’s what really happened).” And maybe, “That’s kind of sad that they need to lie about that.”",
            "I love the advice that has been given here and hope it either inspires you or strengthens your resolve.  As they say, you didn’t push them away to hurt them, you pushed them away to protect yourself. \nLook forward to reading your update.",
            "Is there anyone who was there for you growing up? Maybe a really cool teacher or your case worker or a mentor was really there for you and helped you become who you are. I wouldn’t even mention your parents, but I’d attribute that person’s support to helping you succeed, despite not having any parental figures to look up to. People will listen to the successful person’s story much more than that flakey bs your “parents” are spewing.",
            "I'd totally 'new phone, who dis?' their asses and wouldn't skip a heartbeat doing so.",
            "Boo, I am so sorry. Honestly, that whole family sounds toxic, and I would completely cut all ties. I mean, your grandmother even went as far as sending updates as JOKES??? Boo. Cut. These. MFers. Off.\n\nIf anyone asks about them, I'd straight up say, \"They never wanted me. The proof is in the documents/receipts. I don't know them and I dont want to anymore.\"",
            "If they contact you or talk about you and someone asks say \"I've been in Foster care most of my life. If they ARE my parents, I've read my paperwork, they didn't want me.\"",
            "The high road would be to just block and ignore them and Mariah the connections in person whenever someone else brings it up.\n\nThat being said, they may make problems for you given the facts you laid out as they seem to be pretty self serving trash. I would suggest you contact a PR agent and ask how best to downplay the connections publicly should the worst occur.  They may seek jobs or loans dropping your name. \n\nPetty me says write a book with receipts for proof. You and I have such a similar past and have gone out of my way to be anonymous in my work so I dont have any of my blood relatives seeking me out for money or connections. Since that anonymity ship has sailed for you I would consider this option as well depending on advice from a PR agent.",
            "Maybe its because I just came from /r/ProRevenge but.... man.... I'd sit down with your local paper and offer up to them the story of how you went from unwanted foster kid to local success. Newspapers eat that kind of shit up. And you can tell the story of the family that lived 30 minutes away, the nan that was a neighbor, and how they never wanted you until you were a success.\n\n&#x200B;\n\nIf they want the glory for your accomplishments.... give it to them. But the true version. The version that states that because you were unwanted by them, it drove you to succeed.",
            "Do a \"Who are they?\" Or if you want to be total f off. Get an article about your story published",
            "First:  I am so sorry that the ppl who should have protected you as a child did not.  Second:  You have every right to be bitter, however, It sounds like you have come to terms with the life choices of your \"parents\" (loosely used term) and make some amazing life decisions of your own and overcome all the BS of your childhood.  These people do not deserve the blessing of you or your beautiful child/children in their lives.  They made their decision long ago and they clearly have no shame popping out of the woodwork years later to hop on your train of success.  YOU.OWE.THOSE.PEOPLE.NOTHING!!!\n\nNo one would think you were being dramatic should you feel the need to tell your side of the story.  It truly is NO ONE'S business and you owe no one an explanation of your decision but I also understand the need to have a story set straight.  \n\nPeople will be horrified at the behavior of the \"parents\" who shoved you in foster care instead of protecting you as you deserved.  No one will fault you for your decision to not be a part of their uglyness or the drama THEY created.\n\nI am so pleased that you have found succeed and happiness in your life.  This is a very tragic and sad story that is heard all to often with very different endings.  I wish you the best if luck in your career and I wish you so many more years of continued happiness!",
            "You're wanting to engage with their gossip and drama without gossiping or being dramatic? You can't fight petty with petty. Don't acknowledge it, or them, unless they're actually profiting at your expense. Sounds like they just want attention, so don't give it to them.",
            "Well you said you have the Foster care papers and they stated motive behind the abandonment. \n\nReleasing them on social media would destroy both their stories.",
            "I don't know you but your story really inspires me and others, I am sure. I have no right to be proud of a success that is not mine but I cannot deny that knowing you are a success story really does make me proud. Bravo to you and may you have more triumphs for yourself and your son!",
            "> f I don't stand up for myself I look heartless and cruel.\n\nyou don't but even if this was the case, WHO CARES?",
            "Write a book about your childhood, sell it and send them a copy each",
            "You should write an article or even a book about your life. Tell the truth. Hardships you encountered in foster care. Spread word to other foster kids to never give up and keep on going. \nPeople will read it and your parents lies will be in the spotlight. But use your position.",
            "I agree with the Mariah comment. They ignored you, you ignore them. Someone asks you, act like these random weirdos have just latched onto you, bizarre really.",
            "[deleted]",
            "If I gave you 10 million dollars and someone stole 100 dollars from you, would you go through the effort of hiring lawyers, going to court, paying lawyers and court fees, essentially losing days of your time and significantly more than 100 dollars to get it back?\n\nThese people are the 100 dollars.",
            "They are horrible people!!! Don't ever speak to them again. They are opportunistic. If you weren't in the media they wouldn't reach out to you. They don't deserve a chance to be in your presence. Just because they are responsible for your birth doesn't mean they are owed anything. It takes no effort to plop out a baby if your reproductive organs work properly, so your mom is the worst of all. She didn't do her job as a parent.",
            "Family drama is the worst! It sounds like you have had more than your fair share of it. Honestly, it’s better to cut them all out and avoid any direct communication. That includes the nephews and nieces- because the parents might try to meddle through them (especially if they are too naive).  \n\nIt sounds like you worked on yourself from the ground up. It so tempting to want to salvage a relationship with certain family members, but trust me, it’s not worth it.  They’re going to lie and manipulate you. They’ll start asking for money and resources. They’re going to expect you to take care of them because you have been successful. \n\nIt’s a blessing in disguise that you are free from them. The best thing you can do- is keep building on what you have already done. Having a better life than you would have had with them. \n\nI’m so proud of you. You’ve beat the odds and it sounds like you are a caring and loving parent. I’m sure your son will be okay- I was a late bloomer myself and made most of my friends after university. I think it came down to confidence and developing better judgement for making better friends (in my case).  Have 2 awesome friends is better than 10 mediocre ones :)",
            "You either stay silent and they think you're an uppity person or you go full diarrhea mouth and share the truth which has its own consequences. You could be passive aggressive and when people bring them up you could say, \"If only all the things they say we're true.\" It will get people thinking and you just keep your head up and move on. You really just need to do what your heart tells you to do. Screw what everyone else thinks. The best revenge is success. Don't bat and eye to their drama. Karma can be a real B!",
            "Funny how life turns out - you spent years begging for their attention, then, when you get it, it is hollow. I'm not sure you can shut them up but I wouldn't respond to anything. So what if you appear to be an A-hole? You certainly do not owe them anything.\n\n&#x200B;\n\nAnd btw - good for you for making something of yourself. I had nowhere near your hurdles and I'm really only \"successful\" because of my husband. Of course, my skills/talents/hard work are necessary too - I'm not counting myself short - but I probably would have just fallen into despair in your shoes. I'm sure it was extremely hard and you had your moments. I have known a woman whose experience was much like yours - parents gave her up to the system but kept the others. She is all kinds of messed up.",
            "Write about it. Publically. Put their shit on blast.",
            "Send a cease and desist letter",
            "I know you will feel bad about not being family, and they will use it against you. You'll feel bad ablut your nieces and nephews because you are a good person and honestly care about family. But they do not. Do not jump at their bait and then get sucked in. You think this is bad? Imagine when you do start to see them and then they start crossing boundaries and making you feel like shit. You're gonna put your foot down and it's going to be a whole lot worse. Dont even waste your breath commenting about them. If you ABSOLUTELY MUST publicly talk about them or whatever, just say there are always two sides to every story and you're just focusing on the awesome story you've built for yourself now! Avoid it from then on. You dont need to open yourself up to more drama, or criticism from anyone who doesnt know your story. Be strong and remember that family is more than blood. You can choose sometimes the people who you get to love as family and dont forget how they chose to leave you behind. Real family love leaves no one behind.  Stay strong and you got this!!",
            "You have the right to be pissed at them!  Because they have no right in saying that  they had a hand in your success!consult a lawyer.",
            "if you are a good speaker you could do a Moth story. they air on PBS and the podcast. it's a good way to get things out there and it seems therapeutic.",
            "Honestly write a memoir and publish it for free on your social media. Maybe make some money and tell the world the truth about those selfish shits.",
            "You’ve already gotten all the advice needed but: a lion doesn’t concern itself with the opinion of sheep.",
            "Can you show everyone the foster care court papers?",
            "You are getting a lot of media attention and must be successful in some way.\n\nI'd start adding the story of your struggle and how you over came parents who didn't want you to your story.\n\nYou have read the court documents so assume you have them.  \n\nRemember you won't name names about who your birth parents are....\n\nThey have already done that for you and set themselves up to be painted in this bad light.",
            "I'll marry your mom and ruin her life if you want. I could definitely pull it off.",
            "I’m so sorry you had lived through such a garbage childhood. But congrats on your successes and hope for even more in the future.",
            "Some people are just shitty, trying to stop them from being shitty is just going to frustrate you...trust me, its best to just let them continue to be shitty because the people they try to fool will see them for what they are.",
            "Leak the court documents to a journalist. Stay classy when the story comes out",
            "I won't address the content of what you should say, I just want to suggest that the less you acknowledge their nonsense the better. If you're in the media and you're connected to anyone who has the slightest inclination to say negative or untrue about you, some shit will get said and believed and whispered about...there's no way to completely avoid that. But \"not dignifying such nonsense with a response\" can do more to shut people up than anything you say.",
            "[deleted]",
            "Tell them exactly that you don’t know them. Two can play that game. Also, what do you do?",
            "If the court records say it all then maybe just put em out there?",
            "Enjoy your success and ignore their distress. Rise above their shitpool. Let them post etc. and ignore them. If you have persons in common let it go...",
            "\"Yes, they made me what I am. The abandoned me to the foster care system and I had to build my life from nothing with no support. It's given me a skillset I wouldn't wish on my worst enemy, and it's all thanks to them.\"",
            "I don't have any extra advice to give but just wanted to say well done for being a good person and successful despite your upbringing - that's so amazing!",
            "Fuck those people, change your phone number and make your social media private. You can always call them and say we have no relationship with each other, I've tried for years and now that I'm successful you want to act like you know me and my children. You know you didn't want anything to do with me during my childhood and young adulthood, my success isn't yours so stop acting like you some how know when u gossip with family and friends because you dont. Etc",
            "I'd consider publishing on medium something about being successful with a horrendous family who abandoned you at birth.",
            "Local paper for sure you can chalk it up to media being nosy. Plus no one loves a better story than someone that was given nothing overcomes their struggles to success. Then lay it out for EVERYONE what really happened.",
            "I agree with a lot of the other opinions.  Just tell people you really don't know them and you were raised in the foster system.  Sometimes just keeping answers easy and to the point does more than trying to explain everything.",
            "Facts are. You don't know them. At all. \nYou tried to. But they were awful and turned you away. \nOnly now when you built a life of success do they want anything?? \n\nThey're awful people who dont deserve to know you. They only care about what they can get from you. You tried to know them. They didnt care when it counted. All they want is whatever they can bleed from you.",
            "Ghost them. Same as they did to you. Out of sight out of mind. You tried your hardest and it was met with more abuse. Tbh I wouldn't want to even give them the privilege to meet their biological grandson simply because I wouldn't want him to be exposed to such shit humans.",
            "Wow. You lived though such a difficult upbringing and shown hate by people who should have protected you. I hope you fully and truly heal from that. I sincerely do. ❤\n\nMaybe write or type it all out. You didn't know them then. You didn't know them growing up, and you certainly do not know them now. You found out about them. You tried to create a relationship with them. They weren't receptive. That's your truth. They will have to live with theirs. Remind them of that. \nFind those court records again. Make copies. Simply send them the copies of the records. Their records. In their words. \nThey don't get to ride off on your successes. They don't get to claim that you are a reflection of them. You are You by your own making. They could NEVER be on your level. EVER. You owe them NOTHING.\n\nOf course, all of that is said with love, matter of factly. They should stop talking about their relationship with you on their own.\n\nI hope you find peace and happiness.",
            "Public relations rule #1: Never complain, never explain. Doing either gives power to your parents.\n\nGet some therapy to help you detach yourself from your concerns about them. Unless they're paying rent, shitty people don't deserve to occupy your headspace.",
            "You don't owe them anything. They are piggy backing on your success. Is there any way for you to move? And you're not a drama queen at all.",
            "As an adopted kid... Is this not just so exhausting for you? Ignore them, move on, if you want to tell the media the truth then do it, let people know they didn't raise you. But try to let it go eventually or it's just going to make you angrier ever second. Idk about you, but I am too tired to deal with my bio parents bullshit nor does it really matter to me. Good luck.",
            "The truth is cathartic.  Say: \"I don't have anything to do with them and don't know any of them. They are my birth parents, but they put me into the foster care system as a child and shunned me until recently, when they decided I might be useful to them.\"",
            "Ignore ignore ignore ignore.\n\nThe more lavish their lies become the more people will start to question why they're never seen with you. They will escalate their lies and that's where ignoring them plus the truth come in handy.\n\n\"I haven't seen them for 15 years and I care not to.\"\n\n\"I have no idea why they would say that\"\n\nA few roundtrips of those and they're in it. Just keep actively ignoring them and telling everyone nothing but the truth, and only those bits you're comfortable with sharing. Don't let people guilt you into anything and if you start to run into stuff in social media just block and ignore or correct as you see fit.\n\nRemember, they're the ones with the problem, not you.",
            "I can only imagine. But clearly you are incredibly strong and amazing!! If anything, I would tell your story, on a video or something, to shut it down. Just as you did here. If they want to spread nonsense around town, share your story clear as day in a way that is final. They'll see it. The town will see it. Any further relatives will see it. You can choose whether to respond to any attempts to meet you by family who didn't make the decisions, such as siblings, cousins, nephews/nieces. You've already taken charge of your life, don't let their BS trip you up on your mission. 💖💖💖 So proud of you!",
            "Tell the media, or anyone else who brings it up: \"My parents abandoned me into foster care when I was a baby. They refused to take me in and did not attempt to even meet me until I became visible in the media.\" It's the truth; the truth doesn't make you look horrible, it makes your parents look horrible.",
            "I a way, they're right. You wouldn't be where you are  without them. You would probably just be one of us average joes if you stayed with them so be thankful to them that they didn't bring you down for the rest of you're life and know that even though you had a shitty childhood, it would probably still be better than being brought up by those good for nothings and maybe turning into one of them.",
            "They aren’t family. Just sperm and egg donors",
            "I’ve hung around some grimey bars where deadbeat patrons come in hearing about the success of their child, and suddenly becoming parent of the year. All their bar friends are like “oh yeah? Congrats bud. Good for you” and then as soon as they leave, the same friends tell the truth “can you believe he spent all his money here when that kid needed diapers, and now he’s gonna pretend like he contributed to her success?”  So, I think most people are aware of the real situation.",
            "If they're just talking around town, ignore it. If they ever take it to the media, absolutely release a statement telling the truth! They deserve to be outed for that.",
            "Can I just say how proud I am of you for coming from what sounds like an awful up bringing and into the sucsessful person  you are now.",
            "Basically, you should tell them to eat shit and die. But, you can do it nicely, if you prefer, by starting with a ‘please’.\n\nDon’t have anything to do with them. People like these use and abuse others to elevate themselves. You’re doing fine without them. Don’t let them back in your life.\n\nAnd, it shouldn’t matter what they say. They don’t matter.\n\nGood luck!",
            "I'm sorry this isn't an advice.. but just wanted to chip in\n\nThis makes me so angry but I'm so happy for you for your success\n\nAll the best!",
            "so curious what line of work you're in..",
            "\"Who? Oh, I don't really know them.\"",
            "Just casually reading this, would love to know what you do and how it turns out. Best of luck to you",
            "Beat them to the punch!\n\nGet a publicist to have your true story talked about in your local media, that way they (and others in your area who are interested) will have to deal with the truth from your own point of view. There's no way they will take credit for your upcomings if your true story is out there.",
            "There is absolutely no excuse for parents to abandon, or disown their kids, no matter what. Kids are not \"things\" for parents to keep, or toss, due to their selfish whim. You owe them nothing, because that is what you received from them. That being said, it is rarely advisable to never say never when it come to family, but THEY have amends to make to you because you are the victim of their selfishness and lack of decency.\n\n&#x200B;\n\nI think you should move forward knowing you are the one empowered due to your life experiences, and do what feels right for you and your own child. If you do decide to try to \"normalize\" relations with your family, never forget that you have the right to set your own boundaries and set the tone of any future relationship. Also, remember your accomplishments are your own, and don't hesitate to reiterate that if our parents try to take credit for how you turned out.\n\n&#x200B;\n\nI really wish the best of luck to you, because family strife can be a difficult and painful journey.",
            "Who cares.\n\nI mean no offense, but that's how I would treat it if I were you. I mean who cares what they say?",
            "Cut all contact and move",
            "I would block them(I notice you already have), don't bother contacting them or anything, if you see them in the street, walk to other side, be polite, but that is it. Just carry on with your life, and forget about them, what they are doing, if they are \"bragging\" or whatever... Don't get pulled into their crap. If someone pulls it up with you(not them, but a friend or someone) then tell them they where never their for you, and that is the end of it etc... And just enjoy your life mate! Don't get sucked into crap, for no good reason. I would not contact them, but just ignore all this crap srsly.",
            "I'm surprised you weren't adopted as a toddler.  Did they not sign away their parental rights?  Just abandoned you to foster care?  You might have gotten a family otherwise.  And no, do not help your bio family, nieces and nephews.  They will forever treat you like their personal ATM.  Don't expose your son to them either.  Move as soon as he is done with school, as you planned.  And I agree with the posts that just state something like I was raised in foster care.",
            "Just come out and tell everyone who they really are big pieces of crap",
            "Credit the hardship you went through as a kid as an impulse to your success. By abandoning you they did you a favor and allowed your path to cross with some wonderful people that you are lucky to have as friends, mentors etc",
            "I agree with taking the higher road and let your actions speak loud and clear. Become a patron of a foster care support service and go as public as you can talking about helping out our most vulnerable people in society. Use your profile to shine a light on those people, not your family, and let this come full circle to empower tomorrow’s “you”. Don’t ever address your parents situation directly in public. Let them have their narrative. Anyone who knows them would be well aware of their failings and why you would stay away. Let your voice be only for those that need it.",
            "I wonder if you could give a well spun juicy interview discussing the serious side of parental neglect and foster care, to the most serious local paper or other media outlet you can find. Basing it on what you've said here. This will, at first, result in spending more time on the issue, which I know you want to avoid. However, if the true narrative sticks, literally nobody will believe a word they say (about you) ever again. The well earned discredit op may earn you some quiet, in time.",
            "You can be up front and honest about your experience to the media, as you've been with this post but in a more concise and professional way.\n\nOr, you can do as others here have said and say \"I dont know them\" and brush it off, leaving it to other's imaginations.\n\nFrankly I would go with option 2, then if it continues resort to option 1 when you're ready.\n\nThe thing is, you cant be honest without some people saying you're overreacting. That's just how they'll view it. Others will see it as sincere honesty, and that's what matters. \n\nBut you have proof of not knowing them. You have proof of planned visits that never happened. There is even proof of your mother being capable of raising children yet not choosing you.\n\nYou have the proof. You just cant choose who believes it.",
            "OP, I suggest you look at how Oprah handled her success after her family all came out of the woodwork trying to capitalize on her fame. She grew up suffering extensive abuse and speaks very openly about her past. She remains focused on the people who helped her, how her experiences have shaped her, and her hope that her story can inspire others. She also donates to related charities.\n\nI would otherwise leave the issue alone up to the point that they try to accept money for things like interviews or sell their story to someone.",
            "Rent a billboard; put their faces on it + a very short, succinct statement about them and your \n past. It ain't libel if it's true, and they can't do shit about it. :)",
            "Provide an update soon when you decide what to do?",
            "Cut off contact with the “family” members and cut contact with any “friends” who talk about you to them.  These aren’t people who can form deep emotional bonds and you aren’t required to try because you share genetic material with them.  Build yourself a new family out of friends you can trust and who support you, maybe get married and adopt your partners family (assuming they are good people).",
            "[deleted]",
            "i was in a similar position and it really annoyed me that they were running around like they knew me when they don't even deserve to know my relationship status. . In one magazine article , and several social media posts I made it very public how I couldn't have made it without the support of my mentor who helped me so much since I had no support at home, and/or how I wanted those without parents to know that life gets so much better and you make your own family,etc.  Nothing specific or defamating, but just enough to drop the hint that my parents aren't in my life.",
            "As far as your birth family is concerned, block/ignore. You have nothing to say to them and, I assure you, they have nothing worth your time. \n\nFor everyone else, short, true, and sweet does it. Dont worry about how the listener will percieve it. Anything you say is going to sound bad because what they did WAS BAD.\n\n\"Im not sure why they would day that. By their own choice, they had no part in my upbringing.\"\n\n\"I don't really know them, actually. They chose not to be involved in my childhood.\" \n\n\"I havent been a part of that family since childhood, when they put me in foster care.\" \n\n\"I don't know why they would say that.\" \n\nOr the good ol, \"I don't know those people.\"",
            "You’re no drama queen, your trauma is real and I can’t imagine such an upbringing.\nFind it in yourself to separate. Go away from them. Stop listening to people who tell you what they’re saying about you. \nImmerse yourself in a new life... if you’re successful as they’re saying, take care of yourself and the rest will follow. They are your example in life that you never needed them. Doesn’t seem like they’ve done anything but hurt you.\nTurn away from them without any words or interaction.\nProtect yourself and your chest will feel lighter. You will come across people in life who truly feel like your family. Best of luck.💗",
            "pop on over to /r/raisedbynarcissists and see if it resonates with your situation.\n\nIf it does, it might shine a light on how to tackle this problem.",
            "Since you're in the media, why not publicly voice your opinion about foster care system? And all the abuses you went/they go through.  This may your time to shine a light.  I can image they'll probably want to hide.  I am sorry you went through this. Just know that God will be judge & jury!   I think you sound like someone very fierce and strong 💪! And I think it's ok to be angry.  But don't let it consume you. Voice it, so you can be done with those people. Using your popularity could some good.  You have come so far, I hope you try not to let those people interfere with you continuing to be best person that you truly are! And only you can credit yourself because you actually had to do it on your own!",
            "What a cruel and unjust way to enter the world, you were a baby without any defence and they just left you alone.\n\nI’m so horrified that anyone would treat a child like that. Yet here we are.\n\nYou say you have a profile now, in the media? That means you have an enormous voice, you speak of whispers in your town about you from people who might share the same genes but they were never your family. \n\nUse that voice to quieten every tiny little whisper that is out there, flatten it all by making a statement about what you have endured and what you will not tolerate. Because right now you’re tolerating the lies that people are speaking. Nobody who left you behind can take any credit from who you are today. \n\nYou’re an incredibly strong and powerful woman, you made that for yourself out of the most awful circumstance. Not a single other person on this planet gets to say they assisted you with that, this was all you. \n\nYou don’t need to legally emancipate from these people, but you do need to do it emotionally and make it loud. \n\nDon’t ever let these evil people make you feel hurt or obligated to them, nobody deserves your love or your kindness unless you choose that for yourself.\n\nStay strong, I am in awe of you.",
            ">She compares herself to the irish homes of unwed mothers and forced adoptions\n\nAre you guys Irish? I am. Just curious, because I didnt think anyone outside would have heard of those kind of homes 😬",
            "[removed]",
            "Tbh i think you should plan a sweet sweet plan for revenge. Leave them hurt like they hurt you.\nDon't forgive them. Trash human beings like those deserve to be punished and humiliated and  deserve to die a painful disgusting death.",
            "I was neglected and abandoned as a kid by my birth parents too. I feel for you. A coup of years ago I made contact with most everyone on social media and while I’d say I have a good relationship with one of my brothers and my sister, I stopped communicating with my birth mom because she still thinks she’s the victim and I’m believing lies. She’s tried to contact me since I cut her off, but I just ignore it.",
            "Can you hire a publicist?  Let a paid professional deal with that shit.  There are people who’ve  trained for years just to make you look classy.",
            "[deleted]",
            "If you're in the media already, and if I was you, I'd do some kind of exclusive feel good interview about your upbringing, what went down, essentially everything you wrote here, and spin it into a \"you can achieve your goals/get a good life/be somebody no matter your start in life/childhood/abuse/being discarded\" story. It's a win/win, as you get to make it very public that they are liars and bad people, and you also get to be an inspiration and an example for people who grew up the same way you did. But it depends on what you're comfortable with, not everyone wants to share things like these, and that's OK too.",
            "Since you said you have been in the news quite frequently, I would make it public that your parents are scumbags, they have contributed nothing to your success and they should shut up about that already. Call them out publicly on their bullshit!",
            "You really sound like an excellent mother. I applaud you, and hope you get to enjoy your success and life without these leeches. Just keep ignoring, don't grace them with a minute of your time.",
            "They may talk for the rest of your life. Just ignore it and focus on what's most important to you. Giving them any attention at all will only distract you from more important goals and as you said add fuel to the fire. See a therapist if you need to, but please don't lower yourself to playing their petty games.",
            "I think you should be honest if people besides your family ever bring this up around you. I read Dear Prudence a lot, and his recommendations when folks are trying to say stuff that isn't true is just to respond with something like, \"What an odd thing for them to say! I was raised in foster care and don't know my birth parents well.\" and then change the subject to something more impersonal.  \n\n\nAlso, I'm sure that this is not the first time your parents have tried to take credit for something that wasn't really their accomplishment/presenting themselves as victims, and I'm sure people who know them are accustomed to this attitude by now and take what they say with a grain of salt.   \n\n\nAbove all, I'm sorry about all of this - it sounds like you've been through a lot. I do hope you can get out of your town eventually - it sounds like some space might be beneficial for you and your son.",
            "Hire a PR firm while you have the exposure. They’ll likely have you donate to orphanages, volunteer with kids, talking openly how it was through the good people in orphanages that you got where you are today.  You have a lot bigger reach than them, and you have truth on your side.  You’ll never convince everyone, but you don’t have to.",
            "This would work where I live (less educated bon vivante ish part of the US). \n\nCall a couple media outlets. See who will listen to your side of the story. Everyone loves a rags-to-riches story and nobody likes the foster care system).",
            "Ignore them. And get yourself into therapy because it sounds like you (rightfully and understandably) have unresolved anger towards them. You may be able to move away from them at some point, but that anger will not go away unless you deal with it.",
            "You can't control what they say. You can control what you say.\n\nWhen you say \"I don't know them\" or \"I don't speak with them\" - that tells a pretty compelling story without having to say much.\n\nAlso, don't let this spoil your success.\n\nYour parents are not good people, this is just another example of them being not good people. A leopard can't change its spots, so don't waste your energy and hard-earned happiness trying to make them understand. They never will.",
            "Those aren't your parents. To be a parent means they raised you. Sharing genetic material does not mean anything when there is no relationship. I'm sorry just how selfish they are towards you still is a problem. Suddenly you're becoming successful and now you're the child who got away? The pain you must have experienced being abandoned. So happy you have been able to make a life for yourself! No contact and never be afraid to share your story. You have an inspirng story. Much love.",
            "This reminds me of Joe Dirts parents when they heard him on Xander Kelly",
            "So, you know they are willing to lie/rewrite history. What makes you think that if you give them what they want, they won't just keep lying about you? That's what I see happening if you engage at all.",
            "Amazing how certain family members remember you when you become a success or do well. It's like those family members who dog you behind your back and always make you the laugh of every event or party but when you win the lottery, you're their best friend and want everything to do with you. Have a friend who had a similar situation growing up as you did. He was the product of an affair, then fostered out, then informed who his birth parents were when he turned 18. He'd been better off never knowing IMO. He won a fairly large lottery winning and that's when they wanted to get to know him, even after previously shunning his existence at the age of 18. Now they brag to others that he's their parents and how bad circumstances back then was the reason they gave him up for adoption etc. All the bullshit reasons one could think of. There's really nothing you can do about their actions other shunning them, the same way they shunned you. Then it just causes more problems of course.",
            "Are they trying to use your name to get things?",
            "Just tell everyone the truth. Who cares how you sound to others peoplw but if they see you ina light that looks negative. Why not shine the ligjt the right way. I would tell people what really happen and finally control to story. Family is those who look out for you no matter what. Not when they need you the most. Take control of this like you have with your life. You're not being a drama queen when you speak the truth. If anything keep questioning them about what happened to you when you were little. Things the missed.",
            "I was just reminded how some people enjoy being barnacles to other people's success.",
            "Im not sure how involved in the media you are but is there a way to publically say what they’ve actually put you through? I think they deserve no type of credit for your well being and the fact that they are acting as if they helped just re instates the fact that they are evil and have no remorse.\n\nIf not, block them and never talk to them again. They have no right to guilt trip you. Peoples’ nerve blows my mind",
            "Show up to a family function, let their kids, nieces, nephews, family, friends know just how deeply scummy these people are and then sue them. I'm sorry for your childhood mate but I'm glad you seem like you pulled through.",
            "\"You're not in the will. Have a nice life.\"\n\nIt's better to appear heartless and cruel (seriously, whoever believes them isn't worth knowing, anyways) than subject yourself to a co-dependent relationship with people who sound really awful.",
            "I'm so happy I got to read this because your self-awareness is god given and you gave others and myself hope on how to move forward privately and graciously...no wonder you made it, you are strong (even anonymously) and you deserve your success on your own!",
            "No you should lie about wanting to meet. Go there and make a big ass scene about telling them to stop spreading lies. Tell them that they fucking left you on your own and wanted nothing to do with you and that all of your success is all on you. And tell them they can fuck themselves and never speak to them again. Then everyone knows the truth and they look like the heartless monsters that left a child for no damn reason.",
            "Make a film. In all honesty I do wish you the best in the future fellow human",
            "There's no way she can sully me if I out sully her. I'll slowly but brilliantly convince her it's a good idea to get a Swatstika tattoo on her face, I'll get her drunk and convince her that loaning a meth lab owner all her money is a sound financial investment, then I'll pay everyone I know to deny I ever existed, knock down my house overnight until it's an empty lot, eliminate all photos of me, and she'll be driven insane as she questions if I was ever real at all.",
            "In response to their claims you were cruelly taken, simply respond, that's not what the court records show. Respond the same way to anything you have physical evidence of, it's pretty hard to deny documentation.",
            "Completley block them form ever contacting you or seeing your social media. Stop following them on social media. have a stock response prepared inc are anyone ever mentions them to you. \"Oh, I dont really consider them my parents. They abandoned me, forced me into foster care, did nothing when they learned that I was abused and rejected me when I tried to contact them. Its all thoroughly documented. They only acknowledge me now that I have become successful. Im not interested in establishing any contact\"",
            "Get over this normal",
            "You could always get a lawyer and send a cease and desist",
            "Make a commercial explaining how they are trash and have it played in their area.  Billboards to",
            "Talk to people one by one and don’t do something stupid and  tell it to like 15 people at once. Do it to their closest friends so they can really lose something. Make sure their not nearby and make sure to do it fast so it’s too big deny.",
            "[removed]",
            "I was just talking about something along these lines. It sucks because they are full of crap BUT the more adamant you are the crazier YOU look. Sometimes you just have to let people do their thing and you just dont engage in it. Just say, ‘ohh interesting’ if anyone ever tells you about their version of events. Thing is... as annoying as they are.... no one is giving them royalties or something for your accomplishments so if they want to make up some bat shit crazy story so they sleep better at night. They are still crazy, they are sleeping and you are still successful. \n\nIt’s hard. Even if the story is wrong, sometimes you say so much more by not saying anything. The right people will know what’s up.",
            "Unfortunately the qualifications to be a parent are 'have unprotected sex once'. I'm sorry your family are such monsters, I'd never help or see any of them again.",
            "If you step back into this family, you're the one causing the drama further. Step away and live your life. No regrets!",
            "You ignore it and move on with your life.",
            "Call me weird, but I keep having the idea of charging them for your attention. Figure out how much normal parents spend on a child, subtract a reasonable estimate of what they did spend on you, write them a letter giving them permission to brag about you for a price to be negotiated, then add, “effective once parenting arrears are paid up” and present them with your accounting. \n\nMake it clear that any taking credit for your accomplishments before paying up will be considered a violation and will add $100 per mention to what they owe you. \n\nThank them for continuing to add to the amount you are owed. Then send them updated letters adding on the prices for the additional brags. \n\nMight work.",
            "My sperm donor left me when I was young and I don't remember him, and my stepfather, whom I call Dad and is more of a father than SD will ever be. I would do a public callout post to be petty tbh.",
            "No publicity is bad publicity.\n\nMore seriously, it's really hard to not get angry and have a grudge in situations like.this. What I've found works is to go lie down with the lights off and imagine what's happening to you blown up to the biggest proportions possible. Imagine that your parents.chained you in the basement and fed you only saltines and.dog food and now you're a celebrity and they're making piles of cash off of pretending they were great parents and that society sees them as heroes and you as the villain. \n\nImagine all.that and.then accept.it, come.to.be totally ok.with it. Realize that it doesn't.have to effect your daily life at all.\n\nDeeper than that realize that your parents were faulty people deserving of love and that raising a kid is super hard. Is there any responsibility you have ever bailed on because you couldn't deal.woth it? Imagine that x20 that's what raising a kid is. I know it's really hard and that's a shitty thing to hear but it's true. \nIf you can come to love them and want the best for them despite how they have legitimately wronged you\n*You will feel infinitely better*. Your life will become a brighter, happier, funnier, more successful.plaxe. \n\nI truly believe that the best thing that you can do in your entire life is come to love the people who make you want to hold an oft times legitimate grudge against them. It doesn't mean you don't set boundaries and it doesn't mean you have to hang out with them, but wish for the best for them and be glad they are happy for you even if they didn't earn it. \nThat's what I've found works in my own situations of frustration and anger.",
            "Is there anyway you can organize a meetup with all of your family members other that your mother and father? Purposefully exclude them from the event, just as they did to you."
        ]
    },
    {
        "post_id": "msx4sa",
        "author": "Revolutionary_Exam45",
        "title": "UPDATE: My Girlfriend wants to take a stressful job and I foolishly set an ultimatum against it",
        "url": "https://www.reddit.com/r/relationships/comments/msx4sa/update_my_girlfriend_wants_to_take_a_stressful/",
        "score": 5183,
        "num_comments": 121,
        "created_utc": 1618687162.0,
        "selftext": " [Original post](https://www.reddit.com/r/relationships/comments/mrah04/my_girlfriend_wants_to_take_a_stressful_job_and_i/)\n\nI (27M) would like to thank everyone who took time to give me valuable advice, it helped me realize I was going about it the wrong way and possibly ruined a relationship of 7 years . Yesterday, we sat down and had a proper conversation. I apologized to her for lashing out with an ultimatum, I explained how scared I was of things sliding back. She (28F) was able to understand it and she also pointed out how hurtful me setting down and ultimatum was. I talked about mapping out a plan so that we don't slid into the mess we had created.\n\nI think me being open to the idea of her working allowed her to be vulnerable and reveal why she wanted to chase money. She wants to put down roots in the city and buy a house here. she grow up in pretty unstable circumstance and moved around a lot. She is adamant that we own a house before we get married/have kids and the home market here is booming. She also thought that it was a bit embarrassing to be so fixated on owning a house and wanted to take the whole burden on herself. I really love this woman. I know that her actions in the past has not been great but even after that I trust her to be kind.\n\nI think, this perspective is not something I could have ever thought of , I come from a more privileged background and even though my parents raised us to be independent but we always knew that if things got ugly, we had a safety net. She never had that and I understand her need to create one. After we stopped crying and talking. we went through the budget and talked about areas where we could cut expenses.\n\nShe really doesn't want to change jobs, so we are planning on her asking for a raise and I think I will start looking for a new job. I am pretty indifferent about my workplace and I don't mind jumping ship to increase my salary. She is happy and would have disliked to move to another company.\n\nI have to really thank the people here for helping us talk this out. I am planning on bringing up counselling on a later date. we have a lingering issue on communication that we need to sort out.\n\nTl;DR: we talked it out and I found out what she wanted and she was worried about money. We made a plan to fix it.",
        "permalink": "/r/relationships/comments/msx4sa/update_my_girlfriend_wants_to_take_a_stressful/",
        "comments": [
            "So happy the two of you were able to be open and communicate with each other about this! \n\nPlease make sure you continue this communication and have an action plan in case your lives take a separate turn from each other as you pursue this serious joint purchase.",
            "Congratulations on y'all having a difficult conversation to mend bad feelings and begin finding solutions. I hope y'all are able to alter things in a way that gives you both what you want without sacrificing healthy behaviors and respectful communication tactics. It sounds to me like y'all are back on track or at least getting there. It can be hard at times to swallow your pride and admit fault (ie your ultimatum as well as her lashing out at you), but these actions are great investments in your relationship. Best wishes to both of you. I hope y'all find ways to continue to improve your communication as you each grow and change. Cheers again on this breakthrough!\n\nEdited to add: I really think it could help for her to seek professional guidance on managing stress as well as couple's counseling, and maybe you speaking to someone to deal with your unresolved pain of her having lashed out in the past. \n\nY'all avoided a potential issue with her taking on a stressful job, but relationships, transition into marriage, wedding planning, purchasing a home, having children, and many other life changes (or lack of change like stagnation, boredom, or the feeling of being unfulfilled) will eventually occur. It is normal to be stressed sometimes and have occasional anxiety, but it is not acceptable for anyone to resort to emotional and verbal abuse as a way of dealing with those emotions.\n\nYou both deserve to be respected and to be in a safe environment: emotionally, physically, and sexually. To prevent a relapse of her behavior it is a good idea to seriously consider professional assistance in order to find the root cause of her bad coping strategies and to replace them with healthy strategies. I have multiple anxiety disorders, and I have intermittently sought out therapy when I find I am utilizing unhealthy coping skills.",
            "Good communication; nice work!\n\nDon’t buy a house together without being married. \n\nBest of luck!\n\nEdit: if you live in the US, don’t buy a house together without being married. Cannot make legal recommendations for other countries!",
            "Good for you guys. I've always said, the cornerstone to any successful and happy marriage is communication.",
            "Did you mention to her that you will not tolerate being her personal punching bag this time around?",
            "Hey, I'm glad you guys worked things out. But...did she acknowledge the severity of the abuse she put you through during her last stint at a stressful job? You describe that time as \"the worst years of your life\" and say that even now, years down the line, you feel \"fear and panic\" at the thought of repeating that to the extent that you felt the need to lash out the way you did. Was lashing out wrong? Yes, technically. But you didn't do that as some manipulative tactic because you wanted to get your way. You did that because you were traumatized from her behavior and it caused you to respond impulsively. She may deserve some sort of apology for that, but *you* deserve a huge apology from her for the way that she treated you when she was under stress. Stress is not a good enough excuse to yell at someone consistently for three years. Life contains stressful events, and at some point, everyone has to learn how to deal with stress without abusing the people around us. Most people can manage that, even when they are under considerable stress. I'm very concerned that you don't mention your girlfriend acknowledging the pain that she caused you. I'm very concerned that you appear to be taking full blame for lashing out this one time, when your girlfriend lashed out consistently for a very long time and gave meaningless apologies only to continue the behavior. This is all very concerning, honestly. Please take care of yourself.",
            "I'm glad you got this issue settled. Please go to counseling BEFORE you get married or have children. You two need to build a solid foundation of communication skills and handling lifes stresses TOGETHER. Most people try to rebuild the relationship by going to relationship therapy after everything is falling down. Imagine how bullet proof you two will be if you build it up before all the really hard stuff hits you.\n\n Also, if you will have a pattern of working things out with your counselor, it won't be a big red flag if one of you says \"we need a session to deal with such and such.\" Use the opportunity to get deeper into next stage of life planning. I've seen marriages break up because of parenting styles being different, one person going back to their religious upbringing, not wanting kids after all, huge differences on spending habits...on and on.",
            "She lashed out at you for 3 years and she refuses therapy/counseling but obviously you are the one who has to apologize. Ok. Let's hope she changes her mind this time around",
            "/r/BestofRedditorUpdates",
            "I always feel very happy when there is conflict in posts here, but things work out well after good communication.",
            "Buying a home with someone you aren't married to is a very bad idea. If she wants to buy it that's fine, but don't buy a house together with someone you aren't married to.",
            "I fail to see how this is a happy ending. Your girlfriend being stressed isn't an excuse for abuse. Constantly putting more work on yourself so she doesn't lash out at you when things get tough for her is not the solution. Her learning self control is. Life isn't going to get easier and I doubt she can't handle overtime but can deal with the pitfalls of home ownership.",
            "I would recommend that you tell her to break up with you. This is not going to end well.",
            "[deleted]",
            "I absolutely LOVE updates like this where people communicate with their partner and solve the issue at hand like proper adults. Great work!",
            "Really glad this has a positive outcome but you should seriously rethink buying a house together before being married.\n\nUnless she just wants to buy the house and have you pay rent or something it can get REAL messy if you two aren't married and you both own the house and then split up.",
            "This is a heartwarming result. Yeah, as smart and experienced as we are in our lives, there's always a chance that the other person has a perspective or motivation that you could never have guessed, and the only way to get through these conflicts and missteps is to provide a safe space for each other to talk and get the answers. Also why it's helpful to have that outside counselling perspective, too. Even as just a friend of couples, I've been able to see and then explain each partner's point of view to the other when they were too wound up to explain it clearly themselves. Best of luck to the two of you, and I hope your partner can find that happy, stable feeling safety with you in the future.",
            "Well what do you know. Reddits favorite suggestion actually WORKED!",
            "The fact that the two of you are so good at and open to communication bodes really well for your future happiness. Well done!",
            "This warmed my whole heart. Such great communication",
            "The two of you are blossoming in maturity. Kudos!",
            "I’m so glad this turned out well, all the best to the both of you.",
            "So happy you two worked it out by communicating! Taking notes so I can apply this to my own relationship.",
            "Good for you both that you talked it thru, revealed the reasons for the concerns, and came to a possible working solution.\n\nAwesome communication",
            "Glad it went really well!",
            "This is r/relationships .   Break up with her.",
            "Housing bubble is going to burst - stock market will collapse within the next few weeks, sooner rather than later.",
            "Glad you two were able to work it out!",
            "I’m happy that you’re happy but while I’m sure someone has probably said this, I’ll say it myself as well...\n\nIf she lashes out when she is stressed and refuses to get help for that unhealthy coping strategy, then what is she going to do when kids come along? She can claim things will be different and the only difference is that she will either be dealing with the kids 24/7 or be dealing with them after work, which still means she is going to basically be “on the clock” 24/7 while it is a baby and not yet in school. She will be stressed, so what is she going to do? Lash out at the child? You? What about the wedding? Is she going to be a complete “bridezilla” and throw a tantrum when something doesn’t turn out exactly the way she imagined? What about when an important family member to her passed away? Is she just going to lash out for a year or more until she eventually deals with the grief on her own in this unhealthy way?\n\nYou were abused for 3 years. She needs to see a professional otherwise you are setting yourself up for a cycle that will continue for the rest of your life.\n\nPart of the “action plan” needs to be that she goes to therapy. You need to re-address this and explain that while you’re sorry she misunderstood what you were saying, when you issued the “ultimatum” you meant that if she starts this high stress job or really gets stressed out over ANYTHING to the point where she decides to use you as a verbal and/or physical punching bag, then you WILL have to re-evaluate this relationship due to you needing to put your mental health first, and YOUR mental health SHOULD come first cause guess what? You’re the one who has to put up with that 24/7.",
            "I’m gonna give you some of the best relationship advice I’ve ever gotten - you don’t need to trust her, you need to trust yourself enough to leave. Worrying about the future and how she may treat you does not serve you, so don’t. Work through it, talk to her and encourage yourself and her to do the work required to keep your relationship healthy. If it doesn’t work out, and it returns to a place of emotional abuse you have to trust yourself to know when it’s time to through in the towel. Cast your worries aside. I’m glad you guys had a good talk. When I saw your first post it was locked already but I was going to suggest just sitting down and telling her everything you told us."
        ]
    },
    {
        "post_id": "ovxp6n",
        "author": "ThrowRAfast8945",
        "title": "Update : I (26F) realized I have a crush on my roommate (24F)",
        "url": "https://www.reddit.com/r/relationships/comments/ovxp6n/update_i_26f_realized_i_have_a_crush_on_my/",
        "score": 5170,
        "num_comments": 109,
        "created_utc": 1627843262.0,
        "selftext": "[Original post](https://www.reddit.com/r/relationships/comments/nb9n69/i_26f_realized_i_have_a_crush_on_my_roommate_24f/)\n\nMy post didn't get a lot of attention but some people did provide me with really good feedback and this is a happy update!\n\nI decided to to keep my feelings to myself and understand if it was just my gratitude and learn about myself in that time. I read a few books and I did some introspection. I have always liked girls. In hindsight, it is pretty obvious why I hated seeing my best friend with her boyfriend. haha. I brushed those feelings aside as just jealousy for how good their relationship was. Teenage me was pretty dumb.\n\nI also realized that my roommate was probably asexual. I have know her for a long time and she has not dated one single person. Never brought a person home. It made me feel hopeless about my feelings for her.\n\nI came out to her about a month ago. I had left one of my books laying around and she handed it back to me. I made a bad joke. I ended up explaining that I think I am bi. It was pretty awkward. She told me she was into girls but she thinks she is a demisexual and it takes her lot to form the emotional bond needed to be ready to have sex. I probably made a mess of the conversation. I thought there was no way she would for such bond with me.\n\nShe ended up asking me out while we were cooking dinner last week. I was pretty surprised honestly. It is scary and a bit awkward moving from being roommates to girlfriend. Scary as hell but even with all the uncertainty about if we could work. I feel incredibly comfortable around her. I can be myself and I know she won't judge me and she loves it.\n\nTLDR: I came out. she asked me out. starting a new relationship.",
        "permalink": "/r/relationships/comments/ovxp6n/update_i_26f_realized_i_have_a_crush_on_my/",
        "comments": [
            "*and they were roommates!*\n\n\ncongrats op!!",
            "alright...this is taking the old joke \"what do lesbians bring on their second date?...a moving truck!\" too far!  You moved in before you even knew you were bi!\n\nCongratulations!  This is lovely.  Go get em!",
            "Good luck and happy wishes for you both!",
            "That's awesome, good luck and whatever happens it's great that you're learning about yourself!",
            "Thats really good. Sounds like you are going forward slowly and correctly. Good luck to you both. It must have been tough living with someone you admire.",
            "Awwww, this is so wonderfully awkward and sweet. I'm so glad it worked out for you (and her too). :)",
            "Awww! That’s great! Omg that’s so sweet I’m so happy for you! My best advice when starting a new relationship is to communicate openly and constantly, never be scared to talk about your feelings, don’t obsess and try to keep your insecurity demons at bay.",
            "Good luck!! I am now two years into a relationship with my girlfriend who I met as a roommate — living together so fast can be intimidating but it’s been really amazing having a relationship built on such a personal understanding\nIt also made moving houses together more exciting! So good luck to you and remember to be open with each other as it’ll only make things easier",
            "And realize she feels the same nervousness as you but took a step forward- go through this one day at a time- there is NO rush for anything, congratulations :)) also being roommates I've learned some tips about like spending alone time even if you live in the same space and still going out on dates even if you can have a comfortable one at home so ye hope that helps a bit too",
            "I Commend you for having the courage to come out. Congratulations on your new relationship.. Rooting for you both 🏳️‍🌈❤",
            "This ... is SO cute. Congrats!",
            "I remember reading your orginal post, I didn't comment though as my advice was in the comments. This is such a lovely update! I wish both of you the best of luck!!",
            "This is adorable. Congratulations! I’m sure you didn’t make nearly the mess of those conversations that you think you did. She’s likely just as nervous as you. Take it slow, and make sure that y’all each have things outside of living together/spending time together that you do separately!",
            "My girlfriend moved across the country for me (Virginia to California) after we met in person for two weeks. We met on a fanfiction website. Please take our very gay congratulations!!!",
            "I love this so much! Congratulations! ❤",
            "I went back and read the original first. Then, I read this. It made my heart happy. Thank you for sharing, sorry you had to go through all of that. However, sometimes the best things happen at the end of something terrible. Best of luck to you too.",
            "They were roommates!\n\nCongratulations and happiness to both of u",
            "This has to be made into a tv series. With all the trials and tribulations.",
            "\"Every time someone steps up and say who they are, the world becomes a better, more interesting place.\"",
            "Wow! Hey I'm demi sexual too. Although I am Grey ace in this life if I wasn't I'd still be demi. U know u are special when she's ready to take that step with u. If it hasn't happened I hope ur OK waiting.",
            "Okay universe, my turn please 😭😭 Joking aside, I'm super happy for you!! You've got this!!",
            ">She ended up asking me out while we were cooking dinner last week. I was pretty surprised honestly. It is scary and a bit awkward moving from **being roommates to girlfriend**\n\nI like what I was reading until that. Just one date and op thinks they are girlfriends? Let's hope for smooth sailing.",
            "[deleted]",
            "This could either turn out good or bad.",
            "Very cute, love this story, hope y'all have fun n fall in love n stuff! <3",
            "I'm so glad that this turned out well for the both of you.",
            "This is beautiful! Congrats to you both!!",
            "Thank you for the update! Reading stories like this warms my heart and give me hope.",
            "Good luck, sounds great!",
            "congrats!!! continue to update us",
            "Good luck! Enjoy the time.",
            "This is so sweet and I’m so happy for you.",
            "Congratulations, have fun with your relationship going forward.",
            "Literally the dream. Best of luck!!",
            "I’m glad it worked out for you <3",
            "I missed out on the first post, but this story/ending (beginning?) made me smile. Best of luck to you both in the future :)",
            "Haha I have a crush on my housemate too but I feel kind of stuck with it.  I'm glad it worked out for you though",
            "Awe 💙 I hope it works out :)",
            "That's kind of miraculous; I hope it goes well and you two are both very happy :)",
            "This post makes me so happy! Love it!",
            "this is so cute!! congrats OP!!!",
            "EEEEEEEEE!!!!! this makes my heart happy",
            "So great, and thanks for the update.",
            "Someone please write a movie script on both\nThis is so wholesome dude",
            "This is awesome, congrats OP 👏",
            "Awwwww!!! Wishing you two all the happiness!",
            "This is cute 🥰 Hope it goes well OP!",
            "this is so goddamn sweet it’s like romcom shit awh, i hope you guys have a happy and fulfilling relationship <3",
            "If this were a show I'd watch every minute of it!\n\nCongratulations!!",
            "Sounds like congratulations are in order. Good stuff. 🙂",
            "This is adorable!!!!  I have friends who started in a similar way.  They were roommates and one realized she hated seeing the other date other girls.  They have been together for 24 years and have a son.   Congrats and may this work out happily for you both.",
            "I'm so happy for y'all!",
            "With the amount of build-up to that last paragraph, I was worried this was going to have a bittersweet ending, but color me surprised! Positively adorable! Congratulations, and best of luck to the both of you. :)",
            "This is the best thing.\n\nI hope.you both have a long and happy relationship.",
            "According to historians.......",
            "Hope it goes well for you",
            "Awwww!!! This is the really, really happy endings I love to see!!!. Congratulations, Op!!. I love it.",
            "Congrats. May the two of you find happiness together!",
            "\"And that kids is how I met your mother\"",
            "Rollercoaster of emotions with that post.....best of luck, go for it!!!!",
            "It's nice to see that people accept people on the asexual spectrum sometimes (I do see it, but I see/experience heartbreak more). Congratulations to you, *and* your girlfriend, as it can be very hard for us to find partners. It sounds like you two already saved yourselves a step by already being moved in, so I wish you the best of luck in your relationship.",
            "Look at the bright side - neither of you needs to U-Haul\\[tm\\] anything!",
            "Ok but it’s better if you move out.  Living together in early dating is too much pressure for most relationships.",
            "Good to see this story had a happy ending. It looks \"teenage\" level of awkward, but everything worked out in the end lol",
            "You have accomplished this relationship with great tac. I am glad to find a story that ends well. Best wishes to you and yours in the future.",
            "Istg I've read atleast fifty Clexa fics with this plot. OP lives inside a fanfiction (also congratulations!)",
            "This is amazing! The whole ups and downs of this story and the \"Am I crazy\" feeling and her bringing you flowers. Congratulations :)",
            "Congrats on coming out, as well as your new relationship. All the best to the both of you!",
            "Fact I think it's cute",
            "Felt happy reading this. Haha. Goodluck! 💕💕",
            "Well, god damn. Good for you. I wish y'all the best."
        ]
    }
]