[
    {
        "post_id": "a58tbs",
        "author": "GlitterSchnitzel",
        "title": "[UPDATE] I (30f) had pneumonia and my ex-fiance (28m) refused to help me.",
        "url": "https://www.reddit.com/r/relationships/comments/a58tbs/update_i_30f_had_pneumonia_and_my_exfiance_28m/",
        "score": 5120,
        "num_comments": 157,
        "created_utc": 1544548884.0,
        "selftext": "[OP can be found here.](https://www.reddit.com/r/relationships/comments/92qtys/i_30f_have_pneumonia_and_my_fiance_28m_is/)\n\nFirst and foremost, I'm alive! I want to thank you all from the bottom of my heart. You guys really helped me see just how cruel and unreasonable he was being.\n\nIt took four months but I finally worked up the courage to break it off. He has moved out and my children and I are moving on with our lives.\n\nAgain, thank you all so much for opening my eyes.\n\nTL;DR - My ex-fiance treated me cruelly when I had pneumonia. Turned to r/relationships for advice. Got great advice. Broke it off. Feeling better about life. :) ",
        "permalink": "/r/relationships/comments/a58tbs/update_i_30f_had_pneumonia_and_my_exfiance_28m/",
        "comments": [
            "I don't know you, but jfc, I'm so relieved for you and your kids that you left your awful ex.",
            "I’m glad you dumped him.\n\nPneumonia can kill healthy adults, so he was gambling with your life. Not to mention your children’s welfare. You absolutely shouldn’t have been driving.\n\nHe was probably a huge baby about the mildest splinter, too.",
            "[deleted]",
            "Glad you decided to break it off with someone so selfish and that you are feeling better. Hopefully you’ll meet someone who truly cares for you and your children like his own. ",
            "I'm very glad for you but especially for your children. Having a person like that as a primary figure in your life can be extremely scarring.",
            "Good for you. GOOD FOR YOU. This is great news!\n\nMy ex was a medic in the marines and touted his bedside manor from time to time. But the two times I saw it up close and personal, I doubted everything he ever told me (or realized he was totally delusional). \n\nOnce, I had terrible cramps and couldn't walk to the corner store to get Advil. When I pleaded for a hot water bottle or pills, he finally lobbed a bottle of aspirin at me then turned around and left the room without even bringing me water (any medic will know that aspirin is the wrong tool for that job). The second time I slipped on ice and cut my knee. I sat on the side of the tub while he cleaned my wound and put a bandage over it, admonishing me for how it happened, then slapped my hurt knee \"to get the band-aid to stick\". We broke up not too long after. He was a bad person, and those were the ways it came out, among others.\n\nIf you get a pit in your stomach thinking about how your mate will behave when the worst parts of life come up like cancer, job loss, tragedy, etc, move on. Move. On.",
            "I remember that post! Congratulations!!!\n\nYou have done a wonderful thing for yourself and your children!",
            "just read the OP and what an absolute shithead. I'm glad you had the courage to leave him. Congrats on moving on with your life. You may find a better man, you may not but your life is clearly better without that waste of oxygen around. ",
            "I'm glad it worked out. My coworker told me that a man needs to not only love you, but he needs to like you. \n\nWhen someone is sick and unable to get food or meds for themselves, you as a friend, someone who LIKES them, would do that for them. \n\nSo he could lay in your bed and share your space, and make love to you, but he did not like you. \n\nHe's a selfish, horrible person.",
            "oh wow i just read the original post.. i didn't realize he was ur actual fiance at the time.. what a low life human being. on the bright side, super glad you are feeling better now and ur children have their supermom back.. may life come with blessings.\n",
            "[removed]",
            "i am actually happy this happened because you were able to dodge a bullet by not marrying this guy. I could not even conceive acting so bad to someone i supposedly love (fiance). hope all goes well for you in the future and am happy to see that you feel better. pneumonia is no joke.",
            "Man. I'm happy you cut that shit off. \n\nI can relate, my placenta was left in my body and  I almost died from infection a week after I came home. I got worse and worse every day, I begged him to take me to the doctor, I couldn't even walk or sit up to feed my baby, and then one night I hit a fever of 104 and called myself an ambulance. When the paramedics got there I couldn't see anything, but I could hear him telling them I was faking it because the baby took all my attention.\n\n Took me a few weeks but I finally cut that shit off. Fuck people who lack basic human empathy. You deserve so much better. ",
            "Really glad you had the courage to leave! \n\nI had a similar thing happen to me. I had Pneumonia and was pretty much dying from coughing and my now ex bf refused to drive me to the hospital because he was \"tired\"....\n\nSelfish men suck!\n",
            "I remember your post. I'm super proud of you for managing to stand up for yourself. You deserve better!",
            "I'm glad you are well again and I'm also glad you found out your ex couldn't be counted on before you got married.\n\nAll the best for the future for you and your family.",
            "Wow, I remember your post, reading it made me so angry, aaargh! This is such a fantastic update, I'm so happy for you and your kids!! Take care ❤",
            "I remember your post and I’m so glad you found the strength to leave that relationship! You deserve to be cared about.",
            "So glad you're healthy and he's gone. I'm sorry it took illness that could have killed you to see what a toolbag he was to you. ",
            "So glad you left that abusive asshat. You are worth someone who cares about you **and** your children. Good, decent, kind, loving men are out there. I'm glad you didn't settle for less. ",
            "Curious if he was this big of a douche when you first started dating? ",
            "I feel you and am glad you’re ok now. I had a similar situation when an injury left me immobile.  The wife wasn’t feeling great that day so she took a 3 hour drive to the beach to feel better. I was stuck with nothing but a glass of water and the tv on the 700 club all day. (remote was out of my reach) \n\nThat and a long list of buildup got me to tell her I wanted a new life the next week.",
            "I'm so glad you ended your relationship with that monster. I had pneumonia in April, legionnaires, actually and it was literally hell. I was hospitalized for 2 weeks and I can't imagine my partner or loved one not being there to help. He was straight up cruel and selfish. You dodged a major bullet. ",
            "I am so happy to hear this! I remember your post and how angry I was on your behalf. Good for you.",
            "Pneumonia is no joke. I had it but kept getting misdiagnosed so wasn't getting enough antibiotics long enough to make it go away. They said I had a cold or allergies. I ended up in the hospital with quadruple pneumonia then went into a coma for a month. They had my family tell me goodbye several times. ",
            "I’m so glad you broke that off! I got meningitis last spring and have never been so sick in my life. My fiancé made sure I stayed in bed, that I ate, and that I had plenty of fluids. Because that is what you deserve! Thank god you didn’t marry that man! ",
            "I remember this post! Thank you so much for updating us. I'm SO glad this asshole is out of your life!",
            "op, your first post was heartbreaking. Maybe I'm a little emotional from the gym and emotions, but it honestly made me want to tear up. What a despicable human being he was. I'm SO GLAD you got out of it. To take care of a person when their sick and vulnerable and watching them get strong is one of the greatest gifts of life. The fact that he didn't even care is just so wrong. Hope you and your kids are well! ",
            "So glad you’re doing better! I just wanted to add, last time I was sick recently, my millennial daughter introduced me to Instacart. I was able to medicine, tissues, and stuff delivered to my house. I left a note asking the driver to leave it on porch and just ring the bell. So amazing!! Combined with Chinese delivery of wonton soup, I had what I needed without needing too much help.",
            "I read you OP, I literally winced reading it because that sounds truly horrible... I was trying to find an explanation for his behaviour in the comments but couldn’t see any reasons? It goes without saying that there is no justification or rationale, whatsoever, I’m just wondering why he acted so cruel? What was his issue?! Did he understand the state you were in? Hopefully he’s out of your life permanently... and gets serious help before he hurts anyone else.",
            "Wow. Pneumonia almost killed me two years ago. I was admitted to hospital on Christmas Day  after I started coughing up blood and what looked like chunks of flesh. I couldn’t sleep or eat because I couldn’t breathe through it. It was agonising and took me a long time to recover. It was a traumatic experience.\n\nYou have been remarkable.",
            "This internet stranger is proud of you :)",
            "Wow what an ass. Glad you saved yourself from marrying him",
            "Ive had pneumonia. Its a really fucked up thing to have. You can barely breathe. I was 16 when i had it. Most fucked up part was i was still smoking over it.",
            "I just read the original post.  What an asshole that guy is!!!  What a monster!\n\nUgh!  How could you have even considered marrying someone like that?!\n\nThe nerve--the complete lack of empathy or decency... wow.  It's disgusting.  Yuck.\n\nI'm so glad you're away from him and I hope the separating wasn't very difficult.",
            "What did he say when you broke it off? ",
            "Congrats, OP! That is great to hear. I remember you. What was the straw that broke the camel's back at four months? ",
            "I am really proud of you.  \nI know that does not amount to much, from a random internet stranger, but it stands.  You did the right thing for you and your children. \n\nGood job, Glitter.",
            "I'm so glad you're okay. I had really bad bronchitis earlier this year and I don't know how I would've survived it with kids AND an unhelpful jerk of a partner, so you're amazing for doing it.\n\nCongrats on taking the trash to the curb. :D",
            "My very healthy neighbor caught pneumonia and within two weeks was gone.  I still cannot believe it.  That shit is nothing to mess with.  Good riddance to useless trash.",
            "I never read your original post but congrats OP! Sounds like you dodged a real bullet. There is something very disturbing about a person treating sick people cruelly, especially when it's a loved one. ",
            "If he really was that cold to you at your sickest, I can’t imagine how cold he was to your kids.  I bet they are happy he’s gone as well. ",
            "“And sickness and in health”. Yeah he couldn’t even be bothered to help. Good on you OP. Glad you threw out the douchebag.\n\nSo happy you’re doing better!",
            "OP- So glad you managed to shake pneumonia and that useless trash. I hope you and your children have a bright & happy future!",
            "I had pnemonia 8 times as a child and nearly died.  Was in the hospital for over a month. One hell of an illness that can be lethal.  Glad you kicked him to the curb",
            "\" You guys really helped me see just how cruel and unreasonable he was being. \"\n\nYou are telling me that a guy that calls your kids \"fucking kids\" and refuses to pick them up when you had pneumonia was great otherwise? ",
            "Well done and I'm glad your health is back in order.",
            "I am so glad you updated us that you're now free of that absolute walnut. You and your children deserve so much better. <3 We are proud of you OP!",
            "I'm so glad you had the courage to break it off. I can't imagine it would have been easy dealing with being terribly sick and looking after your family while dealing with emotional stresses too.\nThis random internet stranger is very proud of you",
            "Just read the original post.  He was a piece of work!  Wow!  I am glad you were able to move on.  If he can't be there for you when you are that sick, he is not worth the time.  \n\nI hope life is moving forward and in a good way.  *hugs*  you deserve better.... heck a rock would be better.",
            "Good. He isn’t a good person to go through the challenges of life with.",
            "Good job!!!! You did the right thing for yourself and your kids.",
            "What a wonderful update. I'm so happy you have ended things and are seeking a much better life for you and your kids.",
            "Kudos and congratulations!",
            "I remember too! Omg I am so happy that you are out. Good for you my friend. Merry Christmas!",
            "Wow- it's really sad to think that some people don't realize that they're being treated so terribly when it's so obvious to everyone else :(. So glad you finally realized that you deserve to be treated better than that (even if you didn't have pneumonia, the way he talked to you alone is ridiculous).",
            "I’m really glad you’re alive and doing better. Your ex was just so much trash. Hope he went relatively quietly and didn’t cause even more hassle on his way to the trash ",
            "I just recently had pneumonia and the flu before thx giving. I’m glad you’re okay. I had to go to my parents for help since I was home alone.",
            "Good for you!  You are a stronger person now.  Congratulations!",
            "Good on you.\nHe sounds like a total shit.",
            "I remember your post. I'm so glad you are feeling better. Do take care of yourself a lot! Sometimes it can take months to recover completely. You are worth so much more, and so are your kids. <3",
            "I just read your last post, I’m glad you sorted it out!!! I have pneumonia right now and can’t imagine how you got through everything you did.",
            "I am glad you got out of that mess. You need a partner who cares about you AND your kids more than that douche did. ",
            "Know that you’re both strong and brave. I’m so glad you’re doing better.",
            "Didn't see your original post but wishing you the best. Breaking off a bad relationship is never as easy as we think it should be. You are courageous and the best is yet to come. Sending you much love. ",
            "Glad you are doing well. I had pneumonia in highschool and my girlfriend then did more for me than your \"adult\" fiance did. ",
            "I had a friend who died from pneumonia, so I'm really happy that you are okay.",
            "Seems similar to the guy who’s gf (who had hypochondriac parents) left him to fend for himself while suffering from a severe kidney stone.",
            "Oh how I wish I could have been a fly on the wall when that went down. Congrats on your freedom!",
            "I am proud of you for being strong and wish you the best. ",
            "So cool! You all can be happy now.  Congrats!",
            "So glad you decided to kick him to the curb. I recently had a kidney stone that put me out of commission for about 2 months, and my partner basically waited on me hand and foot with no complaint. You deserve better. ",
            "I am so glad you were able to see his true colors BEFORE you tied the knot. ",
            "Congratulations on being strong enough and smart enough to make the best decision for yourself and your children! Be strong mama!!!",
            "Yeah, that was stupid of them. At least be supportive of you when you needed a partner to act like an actual partner. Good for you. I hope the next person you find yourself in a relationship with has more sense.",
            "I was wondering how you were doing. I’m glad things are going better for you.",
            "Once my dad got pneumonia but he didn't want to see a doctor because he thought he would be fine. However, my mom would constantly nag him to see the doctor. After weeks of incessant nagging, he finally went to see the doctor. Turns out he went just in time before his pneumonia became fatal. My mom's nagging saved my dad's life. I'm sure that if your husband got pneumonia, you would do the same for him. He doesn't deserve you. ",
            "Honey I'm so proud of you. I had the exact same thing with a different condition and my wife. It was so bad that even though it out me in tears she still demanded so much of me and I couldn't leave the couch or the bath. Souks have left her right there. Now I'm a single lady and lonely, but at least I won't get abused while sick. Good for you girl. ",
            "Well, this is a lesson for life. Don't look back never again, just walk. Sky's the limit.\n\nI wish you a happy life forever. ",
            "Love it! Stay well, hope the best for you! ",
            "Oh man. I didn’t see your first post until now but I’m baffled by this!\n\nI had chlamydia several years ago and I’m one of the lucky people who got weird symptoms in my throat that no one in the ER could identify. My throat was covered with cold sores - I couldn’t eat or drink and I was sick like this for two weeks. All I had was ice. \n\nWhile I was effectively dying, my friend with benefits made me come to his house. He put me up in his room and nursed me. We found out his ex gave him the STI and he took me to a doctor to get the pill I needed. We weren’t even that close! He was just a decent human being. \n\nIt’s crazy someone who was supposed to love you couldn’t be there to take care of you when what was essentially a fuck buddy did that for me. ",
            "I have had pneumonia and had to deal with it on my own. It’s definitely not easy to recover without assistance from friends and family. Your fortunate to have seen what he was before getting married. I am glad that your decision has been vindicated and you are better, and better for it.",
            "And what made you attracted to him in the first place? He sounds like an incredibly selfish person. Good for you and I hope you are 100% healthy!",
            "I'm so glad you got away from him. Twice in the past I was admitted to the ER for bronchitis. Both times I was dating a different guy. Both times I asked that guy to come to the hospital because I didn't want to be alone and I was tired/sick/don't like hospitals. \n\nNeither of them came. \n\nSo I went. ",
            "So glad!! My boss had pneumonia and she literally couldnt breathe and went into some kind of lung arrest? Like her body wasnt getting enough oxygen and she was dying. Serious shit. Glad you were able to survive that. Also glad you walked away from a shitty man. Sounded pretty toxic to you & your kids. Best of luck in the future!",
            "Man I wish I could fight that guy for you OP, what a giant tool.",
            "Congratulations to you and your family but most of all you're healthy and that's the best news! :)",
            "I'm glad he doesn't have to be asked to look up for kids that aren't his anymore! Congrats for feeing both of you. ",
            "Untagged spoiler in the title!",
            "[deleted]",
            "I don't want to come across as heartless but - don't look to ex-partners for help.\n\nAlso, complaining to social media & Reddit??\n\n",
            "Everyone is gay except for me s/"
        ]
    },
    {
        "post_id": "i4jkl6",
        "author": "Practical-Branch2231",
        "title": "I (36f) have had my head in the sand but I've finally realized that my husband (37m) has never been \"into me\"",
        "url": "https://www.reddit.com/r/relationships/comments/i4jkl6/i_36f_have_had_my_head_in_the_sand_but_ive/",
        "score": 5104,
        "num_comments": 729,
        "created_utc": 1596681688.0,
        "selftext": "I'm not sure how I ended up in this horrible place in my life but I guess it's because I believed what I wanted to believe rather than what was obviously right in front of me.\n\n&#x200B;\n\nI won't bore you with all the details but suffice to say he's 100% my type and I've always been gaga over him. When we met 7 years ago I had very limited sexual experience. He had plenty. Right from the beginning, he was very take-it-or-leave it towards sex. I asked him several times if he was attracted to me. He always said yes, but that he just was on medication that dampened desire / exhausted from work. We had very little sex and I was insecure and never initiated. I figured he'd had SO much experience that if he wanted sex he'd initiate.\n\n&#x200B;\n\nWe were like best friends who had sex sometimes (like maybe every 6 weeks). This was not enough for me but I accepted it because I loved him so much and I was too shy to have a really frank discussion. Nor did I want to make him feel bad. I also was always there for him in every way (emotionally, practically, etc). He really grew to rely on me because he suffers from ADHD and depression and often needed my support in many ways (which I was happy to give).\n\n&#x200B;\n\nThere were many hiccups. I caught him texting other women a few times. He watched porn a lot. I figured he was intimacy avoidant or something. But I truly loved him.\n\n&#x200B;\n\nWe got married. Once we had a huge fight and during it our lack of sex came up. He was always suggesting it was my fault but I didn't think it was. He'd call me a prude but I honestly couldn't understand what he was talking about. He cited the fact that I never got on top. I always feel awkward on top and it doesn't feel good and he never told me he liked it so I didn't think it mattered. I brought up the fact that he always wanted oral but never once had returned the favour (still hasn't...not once). We were fighting and it was escalating and he told me \"*if you want to know why I've never given you oral it's because you disgust me sexually*\". I was hurt and shocked but he later told me he didn't mean that.\n\n&#x200B;\n\nWe've had several more fights over the years and once he told me he loved me deeply but wasn't attracted to me. He took that back too and said he didn't mean it. But our sex life never improved at all.\n\n&#x200B;\n\nRecently he got angry at me and called me fat. Later I asked him why he called me that and he said he was sorry for being rude, but that I have to admit that I'm fat. I am overweight (BMI of 27) but so is he. I honestly didn't think he viewed me as \"fat\". We talked a lot and he said he loved me very much and I was perfect for him because he fell in love with me, but that no, my body type is not his type at all. He has always preferred petite athletic women.\n\n&#x200B;\n\nIt just all hit me. Our sex life has always sucked not because of medication or depression, but because he never was very attracted to me at all. He was with me because I provided companionship and love and support and he grew to rely on me and love me. But he's never felt any passion towards me.\n\n&#x200B;\n\nHe says it doesn't really matter because he truly loves me and he's willing to work on having a better sex life with me. He says when we grow old we'll be unattractive anyway and love is all that matters.\n\n&#x200B;\n\nI'm just hurt and freaked out because I've been living this lie thinking we both felt the same way about each other when we clearly do not. \n\n&#x200B;\n\nI'm wondering.....does it even really matter? Does \"lust\" matter? Does it matter if I'm not his physical ideal? Can we still have a happy marriage if we are both in love and committed to each other even if he apparently doesn't have any real sexual feelings towards me? \n\n&#x200B;\n\nI'm so confused and I'd hate to make a mistake and get divorced from someone I really love just because he doesn't find me hot. Can anyone help me view this more clearly?\n\n&#x200B;\n\ntldr: husband has never been \"into\" me and I'm unsure if I should continue the marriage.",
        "permalink": "/r/relationships/comments/i4jkl6/i_36f_have_had_my_head_in_the_sand_but_ive/",
        "comments": [
            "These are words that can never be unheard or apologized for enough that I would ever be able to let them go. And you shouldn’t want to be with someone who throws around statements like “sexually disgusting” and expects those words not to have a life-long impact. I don’t see how you could forgive and forget that. \n\nAnd even setting aside that statement for a second, he’s also heaped other choice sentiments on you. He is cutting you down so you think you don’t deserve better than this, but you sure do. It’s not love if it’s one-sided. This marriage doesn’t seem to have a solid foundation to even fall back on to rebuild. You can build something better with someone else.",
            "So your husband has called you a prude, fat, and \"disgusting sexually\"? \n\nForget the whole 'is it a big deal if he's not physically attracted to me?' thing. Do you *really* want to be with a guy who says those kinds of things to you?",
            "I don’t understand how you can claim to be in love and be such good “friends”...when he insults you the way he does.  I’d never say something like that to a friend in anger.\n\nI feel like there is more you aren’t telling us.  I can’t see this being an otherwise picture perfect relationship if this is how fights go between you!",
            "So I’m asexual, meaning I’m not into *anyone* sexually. I’ve dated people who weren’t asexual, and so there was a sexual incompatibility. These can be solved with patience and communication (or at the very least, a amicable breakup if the issue’s insurmountable).\n\nYou have a very different problem, though. Your husband *doesn’t respect you*. He belittles you. It sounds like he *literally* cheats on you. You’re afraid to communicate with him (likely because of the issues above). The foundation of the relationship is broken, so there’s no way you can try to work out the compatibility.\n\nI’m not a saint or something, but I literally *hate* looking at genitalia. Hate it. But I would *never* call a partner disgusting, *because I care about them*. Some of my partners have been bigger people, but I wouldn’t call them fat, because again, *I love them*. It’s a basic form of respect. I think you need to do some soul searching around if you want to stay in this relationship, because it’s not good.",
            "“Can we still have a happy marriage if we are both in love”\n\nGirl...he said you disgust him and called you a fat prude\n\n“And committed to each other”\n\n...He cheated on you...multiple times...\n\n“Just because he doesn’t find you hot”\n\nHe doesn’t find you worthy, respectable, or loveable either. You disgust him, in fact!\n\nSex is a very important part of marriage. He refuses to work on it, leaving you feeling frustrated, unloved and terrible. Do you want to spend the rest of your life feeling terrible about yourself while he sexts other women and jacks off to porn?",
            "People can be happy in a relationship without lust if there is genuine affection, respect, friendship and care between them and if sex is not a huge deal to either party. You and your husband seem to argue quite a bit, he has insulted you multiple times and that is disrespectful towards you and the relationship.\n\nI don't think you should continue in this marriage. His behavior is cruel.",
            ">but never once had returned the favour (still hasn't...not once).\n\nOh hun. \n\nI just don't see the point of staying in this relationship. Your partner doesn't respect you, and I want to say he doesn't love you but I don't know if you'll believe me. \n\nHe has cheated. The texts to other women. I suspect it's gone further but still, that's enough.\n\nI was in a passionless marriage. The issues where slightly different from yours but I still see myself in you. I'm better divorced. I had a very sexually filling relationship after my marriage ended. I experienced what it was to be desired and to desire. I'm single now and it does really suck to a certain extent but I'm very happy to not be married to man that did not respect me. You deserve better.",
            "But he’s fat too? Maybe you prefer lean athletic men! What a fucking idiot.",
            "Oh my god please leave him. He purposefully says things that hurt you when he’s upset. He’s insulted you in a plethora of ways. \n\nThis is weird, but you should watch Shrill on Hulu. It’s about a fat girl learning to love and stand up for herself. You might not be fat but it will put things into perspective. There is someone out there who will love ALL of you and will want you as much as you want them. Don’t settle for a subpar, sexless marriage. Don’t settle for anything less than someone who will enthusiastically dive headfirst into your clamburger.",
            "Ok. So I was my ex husband's \"type\" but then I guess I got too old or too regular human without an eating disorder anymore sized. And he almost immediately started cheating. And he blamed it all on me. I did EVERYTHING for him. Everything. And there ain't no one who could EVER call me a prude 😆. I took care of him in the self sacrificing loving way it seems you care for your husband. He still completely abandoned me in every way for another woman (\"woman\" may be a stretch since she was barely more than legal) \n\nMy point here is: you can't keep taking someone's crap and giving back love believing they will one day see how much you do and appreciate you. They won't. They just get worse. They just find someone to fulfill what they CHOOSE not to get from you, and keep taking more and more. Get couple's therapy at the very least. But also start building up your \"get out\" fund. When I found proof of his 2 year affair (in a 3 year marriage) I was SO UNBELIEVABLY GRATEFUL I had saved GTFO money",
            "You're not sexually compatible and that's why this will never ever work. He also can't really love you or care about you all that much since he's been treating you like crap, not satisfying you and texting other women aka cheating.\n\nWhy's he gonna change now?? He lied to you from day one and most likely got with you bc you're a safety net. He's so selfish he's never even put the effort in pleasuring you. He's been caught cheating. He just doesn't care and that's not love.",
            "Oh, he has got to go. You deserve to feel better in your own relationship. Please, for the love of god, do yourself a favor and lay this shit out for him. Call a lawyer, get your affairs in order. People are DYING, don’t waste the life you have with this idiot.",
            "He loves the life you give him and he loves your companionship, but he’s selfish and doesn’t really love you. He’s not been honest with you and has not shown you consideration and respect. He’s said horrifyingly cruel things to you, repeateduly. He’s not interested in your needs if they don’t match what he wants. He‘s not loving you back the way you love him. Don’t confuse him being desperate to hold onto you because you give him a great life and endless, thoughtful support, with him actually committing to be a loving partner to you, one who makes you feel treasured.",
            "It really depends on you. Can you see yourself feeling this way for the rest of your life? You won’t lose your desires to feel wanted and attractive to your partner. \n\nMy ex and I were together for 8+ years, and I lost my attraction to him. Not because I wasn’t ever attracted to him, but for other reasons like he wasn’t taking care of himself and didn’t make much of an effort in the relationship. \n\nTbh, breaking up with him was one of the hardest things I had to do, but I knew it was for the best. I couldn’t see myself marrying him and feeling the same way for the rest of my life. \n\nMy current bf and I are very attracted to each other and have a great sex life. I’m 10x happier than I was. \n\nI do think it’s possible for a relationship to get better through communication and effort, but that requires both people to do it. I would recommend that you guys go to couples counseling and also meet with a sex therapist. But if he chooses not to take any action to make things better for both of you, I don’t think it’ll be a good idea to stay. Good luck, OP.",
            "He’s verbally insulted you for several years and can’t have a mature conversation with you about sex? Hell nah.\n\nOP, this isn’t a healthy relationship. This is not something that you can change, either. You both need to go to individual therapy: he needs to go so he learns how to not be an abusive asshole, and you need to go to learn what healthy boundaries are.\n\nIf you have somewhere else to go, I would recommend leaving. You deserve to be happy.",
            "Yes, you’ll get old and generally sex may be less important due to age and/or infirmity.  But that’s for WHEN you’re old, decades from now.  You’re 36 & I don’t give a flying F if your BMI is 27, it doesn’t disqualify you from living a full and happy life. \n\nIs sex important? In the sense that it’s the only thing that binds you, no it isn’t.  But in the sense that intimacy and sexual contact bridges the things that words can’t, that companionship can’t, that regular activities can’t - YES IT’S IMPORTANT.  \n\nAnd just to be clear that this is not a “he’s a crap husband” post, people of all shapes, sizes and orientation are sexual. You as an individual are sexual with or without him.  Just because you’re inexperienced before doesn’t mean your sexual preferences and instinct is tied solely to him - so that end, I would suggest you explore yourself sexually.  Not cheating, but just knowing what you need and want.  And if you already do know that, then I guess my next question is are you ok giving up your prime sexual years to someone who’s expressed disgust ?  This isn’t even a situation where he does want to have sex and is either physically or mentally prevented by some illness.  Granted ADHD can make sexual cycles unpredictable but it does not abscond him of the responsibility to take care of his wife.  Porn does act like rot to an already sensitive sexual appetite, cheating is worst.  And I would consider texting as cheating. \n\nPassion isn’t something that can be sustained at the same level as when it started, but to have experienced it to begin with and to see it burst occasionally is part of what makes all the shitty things about dealing with a partner worth it, it’s this knowledge that you do it for each other and that you want/ accept each other on a cellular level. \n\nIf he doesn’t find you hot, has he articulated if this is a situation where that hotness can be created ? If it’s clear to you that it can’t be, then staying means you’ll live with someone who sees you as furniture.  \n\nThat when it comes time for your needs and your desires, he won’t be capable of fulfilling them because it sounds like this has been you powering this relationship for the most part.\n\nSo please consider this: when you’re old and looking back at your life, are you ok saying to yourself I don’t mind having missed that, it was my choice ? Or not?",
            "Someone who truly loves you won't angrily call you fat or say they are disgusted by you sexually.\n\nYou two got comfortable in this relationship where you do all the emotional work, where you love and support him and he only takes.\n\nI know we all fear the unknown, but there's something better for you out there. Don't settle for someone who doesn't feel the same for you.",
            "You remind me so much of myself. You know what you want—you even deluded yourself into believing you had it in your relationship—but you’re asking for validation for your wants. Do you also live in a world where you’re always having to decide what’s acceptable to feel or think? Do you accept something you don’t truly want because others tell you that’s how it should be? \n\nYou *want* to be sexually and physically desired as you desire your husband. You want your husband to see you as 100% his type as he is yours. Please don’t ask for society (the small sample of it here in this subreddit) to tell you to compromise on your wants to settle for a relationship that makes you feel small...maybe I’m projecting but I can’t help but think you’re submitting yourself to your ball-and-chain of a husband. I’m sorry for characterizing your husband so harshly but I really hope you come to realize and clearly see that he is *using* you as a barely acceptable stand-in. He’s lonely and extremely insecure. It doesn’t sound like he loves himself at all. What’s that about everyone will become ugly anyway when they get old?? That’s the mindset of someone who’s *afraid* of being alone so they attach themselves to any living female body that’s willing rather than getting into a relationship because it’s with someone they love, regard as beautiful and with whom they would walk to the ends\nof the earth.\n\nAlso, don’t be afraid of trekking on with the hope that one day you will meet the man who sees you as the most beautiful woman in the whole wide world. Time was not wasted. You learned some things about yourself and life with your current husband. But, he doesn’t deserve you because he just doesn’t see how beautiful you are. If life’s a journey, your time with your current husband is just one stop of many. If there’s a chance that the man who sees you as 100% his type is up at the next few stops on your journey, why would you not continue on your journey to meet him? \n\nThe sexual and physical part of a romantic relationship pervades all other facets of the relationship. It’s super important. Sexual satisfaction sets the tone for how you two get along in other areas of life. Those who say otherwise must not enjoy sex or romance.",
            "It sounds like there are issues that go further than him not being \"into you\" sexually. He insults you and belittles you and has also been caught texting other women? I'm sorry to be so blunt, but it doesn't sound like he's planning on staying loyal to you in the long run regardless..\n\nThrow the whole man away. No partner should be insulting you or making you feel inferior.",
            "There must be an agreement (with therapy if necessary) to help him understand his angry lashings are no longer acceptable.\n\nHe says he loves you, however he also believes he can insult you for his own, what? Anger release? Because he feels superior? Because he’s insecure? Because he’s hoping to get you to admit you are ok being his second choice?\n\nThere needs to be a heavy conversation, and reality needs to be brought to your house.\n\nYour relationship may be saved, however this road may be rocky as he may not be open to full honesty. There probably needs to be several big conversations with consequences if he can’t or will not behave like a true partner in all aspects of your relationship, (sexually, financially, emotionally and in all aspects of a healthy relationship). \n\nGood luck.",
            "Can you have a happy marriage without lust? Yeah, I guess so. But with someone calling you disgusting? No. Nope, you can't.",
            "You deserve to be loved completely! Being someone's consolation prize is something no one deserves. Respect, love, trust, passion.... you deserve them all. Everyone does!",
            "This is up to what you will accept from someone who really loves you. He has insulted you many times, has refused before now to try and work on your sex life, and refuses to work with you on making sure you are pleasured as much as he is during sex. If he doesn’t find you sexually attractive now, it won’t change, and you need to ask yourself if you’re really okay being someone who doesn’t find you attractive and who you will mostly likely be a glorified roommate for. \n\nIn my opinion you deserve to be with someone who loves all of you and finds you attractive no matter what. My husband and I have been together for 15 years. We have had some issues in the bedroom (because of different issues) but despite me gaining a fair amount of weight, he still finds me attractive. He tells me that all the time. I don’t think I could be with someone who wasn’t physically attracted to me. I’m not his “fantasy woman” but he doesn’t expect me to be. But if he ever insulted me in the ways your husband has, we would either be in marriage counseling or not together. There’s no excuse for being so cruel during a fight. We’ve had big fights but we’ve never treated each other that way. You deserve so much more.",
            "TBH everything you've said just screams dysfunction and codependency. I've been there myself. It was helpful for me to see a therapist, get involved with Codependents Anonymous (there are meeting in the US and across the world), and get out of that relationship. Maybe talking with a professional would help.",
            ">he's never felt any passion towards me.\n\nI'm just curious... do you guys kiss each other frequently or cuddle? Sex isn't the only way to show your passion for someone, and there are some times when your SO may be so stressed that they won't have a high sex drive. Although that doesn't seem to be the case here, given all the evidence you've provided. \n\n>I'm wondering.....does it even really matter?\n\nI do not speak for all people by any means, but babe..  oh my God. Don't you remember what it's like to be sexually desired? To make hot, passionate, sweet love to someone who just can't seem to get enough of you? \n\nDon't you think you deserve to have that feeling again, after 7 years of your boring, uninspired, entitled SO? I cannot believe in that amount of time he has not given you oral once...",
            "Love that he is fat and out of shape but likes petite, athletic women. I can tell you at least that they DONT like him.",
            "The attraction issue is moot when your husband is a giant asshole to you. Those comments were so awful, I wouldn't be able to get it on with someone who said that shit to me. Forget about finding out why he's not attracted to you, I want to know what the hell you see in this man. Doesn't his behavior gross you out? Life is too short to spend it like this. You could be out there in a passionate romance with someone who adores you.",
            "He's never gone down on you??\n\nThat's unacceptable. Aside from everything else in this post that's totally unacceptable (insulting you, being cruel and withholding). You can do better. You really can.",
            "Oh hun, it’s not that your husband isn’t “into you.” It’s that your husband is a shitty and immature narcissist who cares about no one bit himself. This person is terrible. Please get away from him and take back your power. You deserve so much better than this.",
            "Would you be okay with a relationship that was never sexually satisfying for you? Because based on what you’ve said, this relationship will never improve in that department. Are you okay living the rest of your life like that?\n\nAt the very least, he needs to stop blaming you for the lack of sex in your relationship. If he’s not attracted to you and choose to marry you anyway, that’s entirely on him. Lashing out to hurt you is not appropriate and it needs to stop.",
            "Drop the husband.  Move on. Get some therapy. Find someone better. \n\nEven if someone is arguing with you, they would never put you down or say something to hurt you if they truly love you.",
            "He relies on you for his emotional support and companionship. He tells you explicitly that he finds you \"sexually disgusting\", that while he loves you \"your not his type, and also hypocritically calls you \"fat\", then explains he just prefers an ideal body type. While you've also explained that you never had a satisfying sex life with him,  and have not explored your own likes/dislikes.\n\nThis man is a damn leech. I know bc I dated one too. For one you are worth WAY more than you give yourself credit for. Secondly, he knows that you are crazy for him & that you'll never leave because of it. He's got you wrapped around his little finger, while you try your damndest to make him happy. Him happy- but never yourself. He takes it all for granted because he knows its safe to not give a damn- your gaga over him and taught him you'll never leave. This man does not value you. This man does not give you what you truly need OR want, and instead he is sucking the youth from your bones as you waste years with him.  \n\nThere are people out there you can pour your hole heart into, and they'll do the same right back. There are people that will love you even if you put 20lbs (or more!) on RIGHT NOW. There are people that will go gaga over you, while offering you a sex life where you are comfortable. What I am saying is there are people out there that will value you as you deserve. However you need to start asking yourself some difficult questions; why do you feel the need to love someone into staying with you, how do you feel to see these efforts go unnoticed, how have you responded to people & taught them how to treat you, and lastly what traits do you actually want in a relationship. Take some time for yourself, speak to a professional about the things I've mentioned & health from this encounter. You are strong. You can use this horrible experience as a means to grow stronger and learn to love yourself. You are strong,  and you can get through this.",
            "Not that it matters to know the answer, but I would want to know if he had the ideal body type partner and everything else remained the same, work, domestic dynamic, etc., how often he would actually be having sex? Would it be the same? \n\nI find it hard to believe for someone to stay with someone if they find them sexually repulsive. He clearly said those things to hurt you.\n\nI think sex isn’t the issue here at all. You can tell if you have a good partner based on whether they fight clean. He is not. \n\nOn top of that I think your sexual insecurities are exacerbated because you don’t feel safe. Who would want to be vulnerable to someone they don’t trust or feel safe with. \n\nIt’s up to you whether you want to work on this, but I didn’t really read anything in your post about what he does for you. You seem to be giving and giving to bottomless pit. \n\nWhy?",
            "Yea this whole “saying really really shitty things when you’re angry” thing? \n\nIt’s not a thing. \n\nYou should never have to feel like that’s par for the course. That it’s something normal or something to be tolerated. It absolutely doesn’t have to be like that. It absolutely shouldn’t be like that.\n\nLife’s too short to waste your time with people who aren’t clearing that relatively low bar of respect and emotional intelligence",
            "You have wasted 7 years on this passionless relationship. You absolutely deserve someone who is obsessed with you. You have two options, leave and flourish, or stay and be miserable knowing you are not what he wants.",
            "If your husband wasn't an asshole, I'd say you could do some sport and diet together, so you'll be more healthy and you'd attract sexually each other more. But since he's an asshole, you better start doing some sport and diet on your own and look for someone that treats you well.",
            "Normally I give both partners the benefit of the doubt in this subreddit because so many people provide knee-jerk reactions in the comments screaming 'dump him/her!'. But honestly, in this case, I think you really should leave.\n\n1. He has said some horrible things to you to HURT YOU. If he had a problem with his attraction to you, he should have said this earlier in a kinder way. If he didn't like your weight he should have supported you and encouraged you to get fit. If he didn't like going down on you, he should have gently said so, and worked with you to find other ways to meet your needs. The fact that he decided to bring this stuff up the way he did shows that he only wanted to said it to hurt you. It's ok to lose attraction to your partner and it's ok to bring it up, but you never - EVER - make them feel ugly or unattractive about it. That's horrible. ):\n2. You aren't happy in the relationship. You aren't having enough sex for your liking. And you know what? That's a PERFECTLY LEGITIMATE reason to leave. You have tried to bring this up with him multiple times and he shows no sign of changing. Don't trap yourself with someone who is sexually incompatible with you.\n3. He flirted with other women. You know this for a fact. That is unacceptable, and *so* disrespectful towards you. I know how much it hurts and I'm sorry. I also understand why you stayed. I've done that myself. But on top of everything else, that's too much.\n\nIt sounds like he really doesn't love you. Not the way that you deserve.\n\nI'm really proud of you for building up the courage to face these flaws in your relationship and to put them into words. I know how fucking hard that is. Moving forward, it's probably a good idea to contact a counsellor or a therapist to help you work out your own emotions about the whole relationship. Counselling could help you to logically sort through your emotions and break down the blocking and 'blindness' to problems you've had throughout the relationship. It sucks, but it helps. If you are worried about making the 'wrong choice', counselling can help you work out the right one.\n\nI just want to talk about his mental health for a bit here too. I have severe depression. I attempted suicide earlier this month. So please take my word for it when I say I'm a little bit of an authority figure on mental health and I say **DROP HIM**. The way he treats you isn't ok. He doesn't get a free pass for not being a good partner to you just because he's tired from work or because his serotonin levels have plummeted. I've been that partner and I know how unfair it was on my boyfriend at the time and it's my biggest regret. Fuck that. Do not baby him. Do not continue to support him if it is a drain on your own mental health. It's ok to stay friends and it's ok to stay together if that's what you want, so of course it's ok to support him. But please, PLEASE do not put his wellbeing above your own. YOU deserve some TLC for once. That means putting your foot down and saying 'fuck you, don't talk to me like that' instead of letting things slide.",
            "Woah woah woah, you caught him texting other girls? He has a porn addiction? He has a “take-it-or-leave-it” attitude towards sex? Lmao and this all occurred at the beginning of the relationship and yet you still chose to marry this douche? Why did you marry him? This guy was clearly not into you and showed you so many red flags?",
            "Sweetie you want a man who finds you irresistible, inside and out. This guy is clearly not that person. Men say stupid stuff all the time. I am dieting I am not overweight at all and my boyfriend unknowingly says things sometimes and doesnt mean the way it sounds alot of guys can be like that but your husband is just cruel. You can do much better",
            "I’m never one to just tell people to break up but god dammit dump this man and go get some dick girl!!",
            "This guy is intentionally f*cking with you mentally. He is f*cking with your self confidence and self esteem. He cant even discuss your concerns without blaming everything on you. He says things then takes them back knowing full well the seeds he has planted into your mind. This is very cruel. There are lines in all kinds of relationships and this is a very, very big one that a partner should NEVER cross. He has crossed it multiple times. All you can do now is decide in what regard you are going to hold yourself. The lust view is out the window because his cruelty to you is the most pressing issue that I've seen in this post. Please dont let this man beat you down mentally. Please dont let him take anymore from you.",
            "Hey OP idk if you’ll get to this comment but I can’t recommend the podcast “just break up” enough! I think it would really serve you well listening to them! And it’s not always about breaking up but they cover so many issues and forms of abuse as well as give you the advice you don’t always want to hear. I’ve learned so much about myself and respecting myself and boundaries just from listening to them. Such good stuff! They have a way of connecting to their listeners in such a profound way. I think it would benefit you a lot plus help you feel connected and start a rebuilding journey of self love and care. \n\nI also want to say that You are deserving of love and respect! You are deserving of desire! Last but not least you are deserving of good fucking oral. \n\nYou got this. Good love is out there and it’s not always with someone else, sometimes it starts with loving ourselves good.",
            "When someone tells you who they are, believe them. He 100% meant what he said and I am so horrifically sorry. I know what it’s like to be absolutely head over heels love at first sight with someone, only for them to be complacent and looking else where. You don’t deserve it. You are ALWAYS going to hear the word “disgusting” in the back of your mind when you have sex with him now. You do not need to settle for someone who would EVER describe you as disgusting in any sort of respect.",
            "I think he's blaming his issues on you.\nHe's clearly a porn addict and quite a few lose interest in real women and avoid as they are unable to perform.\nHe is disrespectful and talks to you with contempt.\nHis words may say he loves you but his actions don't.\nHis issues are the kind that need professional help. It's unlikely he'll do that.\nSeek out counselling just for you. It'll help you out whether you stay or not.",
            "You married a man who doesn’t give oral omg OP please love yourself. Leave him just for that lol",
            "I very very rarely comment on posts in this sub but I couldn’t hold back on this one. I think there’s something critical you’re missing here. \n\nIt seems the main point of your post is that you completely head-over-heels adore your husband but he doesn’t find you sexually attractive. \n\nWhat the content of your post *should* be is “my husband verbally abuses me”\n\nNow, I’m not one to claim abuse left and right like some folks here because I know that couples fight and occasionally *occasionally* you say something you don’t mean but it should be something like “you suck at cleaning the house!”\n\nYou never, ever, EVER say to a person you claim to love “you disgust me sexually.”\n\nRead that again, you never, EVER tell the person you love that they fucking disgust you sexually. Even if that’s how you felt inside - if that’s how HE feels inside, he could have found a better way to explain it to you so you can figure it out. Something softer and it as hurtful like “It’s hard because somewhere along the way I realized you didn’t have a body type that I’m typically attracted to” and then figure out where to go from there.\n\nYou’re really quick to excuse the awful things he says to you, and I think that’s what you need to evaluate. You focused a lot on how much you adore him so I’ll add this - I adore my wife the same way, I think she’s sweet and gorgeous and smart and incredible but if she EVER screamed that I disgust her sexually during a fight about intimacy, I would be packing her bags before she was finished with her sentence. That part literally made me say “holy shit” out loud and cringe my face up because it was so freaking awful.\n\nJust because you love someone doesn’t mean you should be their doormat. Everything in your post can be distilled down to a couple main points: you are crazy about him, he doesn’t feel the same about you, he doesn’t like being confronted about it and verbally abuses you because you’re shy and he knows it will deter you from bringing it up again, you completely forgive him - rinse and repeat. \n\nSeems like you’re kind of excusing this, love. He’s gonna keep doing it. I’m also not one to say “he’s cheating on you!” At the drop of a hat like most of this sub, but i think you should prepare yourself to find that information out soon enough. It’s hard to believe someone went from being very sexual and a lot of partners to having a wife they aren’t attracted to and having begrudging sex with once every 6 weeks or so and isn’t actually finding it elsewhere. That’s a bit of a stretch.  \n\nGood luck on this one, I hope you figure it out because there are a lot of better guys out there that won’t call you disgusting.",
            "Look, you are still young and you deserve someone that really wants you. Yes, loves matters, but so does a healthy sexual life. \n\nYou give him all that support and he only calls you names and makes you feel less and insecure!? :/ \n\nMaybe it’s time for you to move on...",
            "Oh my god. All of this was horrible. I am so sorry. You deserve to be with someone who wants to rip your clothes off and makes you feel worthy. Marriage isn’t all about sex but it sure is a good chunk of it.",
            "My partner and I have had issues sexually. It’s part of relationships. \n\nBut we have never, and would never, say the things your husband has said. \n\nI have gained weight, but my partner has never called me fat or sexually disgusting. \n\nYou have one life. You get to spend it physically with someone if that’s your thing. There are lots of options for how sex lives can be for a couple. But I don’t know that I could ever be comfortable with someone who said those things.",
            "Once you get out and meet someone who's crazy about you, you'll see the difference and it'll feel like night and day. You only have one life, don't waste it being unhappy, undesired and insulted",
            "For some couples, a lack of sexual intimacy is not a problem. Those couples are not posting in reddit asking if it's a problem, because it doesnt bother them. You are clearly bothered  and that's ok. There is this pervasive idea that women are not supposed to be sexual and its bullshit. If you want to be married to someone who thinks you're hot, you deserve that. You deserve to have frequent, hot sex with someone. And it's ok if you need to walk away from this relationship to find it. If he hadnt lied to you all those years, would you have married him?   My husband has always said \"love is not enough\" and he is 1000% correct.",
            "If his lack of attraction to you didn't actually matter to him, then he wouldn't be calling you fat and disgusting. He's an asshole, op. You can find someone who WILL be sexually attracted to you, and treat you with respect. Those men exist, and you deserve better.",
            "Don't settle. The only real reason you want to stay with him is because you believe you can't find someone you love as much as you love this guy who will also make you feel desirable and want to have sex with you often. You can definitely find that! You deserve to have everything you want in a partner. And you deserve a partner who won't say cruel insults to you like your husband does. \n\nI say, divorce this leech who is basically using you. Work on your self esteem in therapy since he's done a number on you. Focus on making yourself happy. Educate yourself on how to have standards in dating, there are lots of good resources to help women get everything they want in a relationship eg. Matthew Hussey's books.",
            "Sometimes you just have to see the situation for what it is and to do what’s best for yourself. If this is how you want the rest of your life to be by all means stay. If you want to be respected and sexually fulfilled you need to find a different partner. He will never give you what you need.",
            "I havent read this in the comments, so my stance:\n\nHe does not love you for you. You said it, but maybe this will help you see it better. He settled for you. He loves being loved by you. He loves that you care for him and that you always support him. He loves what you do for him. If you stopped, he wouldnt stay, because there is nothing more there for him.\n\nHe loves to have somebody and that somebody is you, but it really could be anyone who would be there. \n\nThis is NOT sexual incompatibility. He does his own thing but doesnt wanna do you, because he feels no desire, even less than that, sometimes he feels disgust. He apologizes because he needs someone like you in his life, but that is all there is to it. Someone like you. Not particularly you. And I bet you had great times, but you can have great times with friends. You maybe also had very intimate moments. But that is the exception and it shouldnt be.\n\nMy advice is leave him. There is someone out there who will love you so so much, if you give them the chance. If you settle for him like he did for you, you will not be truly happy and probably wondering what you missed out on. He may be your love, but you are not his and that will forever hurt you if you stay.",
            "This is going to be very hard to hear, but you need to accept that you love him, but he does not love you. I’m not even sure from your story that he likes you.\n\nNot having your love and attraction returned is devastating I know. But you don’t deserve to lavish your time, devotion and love on a person who clearly does not want it or appreciate it. You need to separate from your husband. If necessary, go and get some counseling because there is something inside of you making you believe that you deserve to be treated this way.\n\nAlso? You can heap all of the love on him in the world and it won’t make him love you. Losing weight won’t either. You’re going to try and bargain with yourself and him to make this work if you don’t accept the facts as he’s explained them. You sound like a really lovely person who would make a great partner for someone who treats you the way you deserve. You’re still very young.  I don’t want you to turn around at 50 and realize how much time you wasted. You deserve better. Good luck!",
            "I think you love each other. I also think it’s been so long that the thought of being single is inconceivable, and on top of that he has really reinforced in you the belief that you aren’t attractive. Then putting your age into the equation, I get how you’d feel it’s better to just settle. \n\nIt’s hard to make hard decisions. \n\nI couldn’t live with knowing my person didn’t find me attractive. I would become wildly jealous and insecure. I’d check their phone, and my heart would crush a million times over with everything I’d find. I’d compare, and I’d hate myself. He’s the one doing all the things that hurt me, but for some reason I’d only hate myself. Keeping that bottled eventually would turn into a pure rage that lives in me and spurts out at everyone, including him. Until I’m nothing, and then he wouldn’t even like (what’s left of) my personality anymore. So I’d become desperate, begging for his love bc WE LOVE EACH OTHER, and no one else will ever love me. Just look at me. Then comes the resentment on both sides. Probably more micro-cheating, more fights, more desperation. And all the while I’d be thinking “Is this worth it? Is this love? I mean, when it’s good it’s SO good, and besides these *little* things I really think we were meant for each other” \n\nI couldn’t do it. \nBut idk friend, that’s just me.",
            "Your sex life has been shot because you married a dude who is shit in bed. Go find someone passionate. Don’t live your life thinking that’s normal. Find a partner who quivers for you and gets off on giving you pleasure. Some men are just terrible. I’ve had a lot of sexual partners but once I found my husband I knew we would last because he is such a sexual person who enjoys getting me off. You’re just inexperienced. Your weight has nothing to do with it, find a man who looks at you with fire in his eyes. Life is too short to stay with people like your husband.",
            "Wow, your husband sucks lol. Please leave this man! You deserve all the oral!\n\nI'd say you *can* have love without attraction. It's called platonic love. A great thing to have, but not in marriage. \n\nI personally wouldn't want to be friends with someone who said they found me disgusting and fat, though. Let alone married to him. He keeps saying he doesn't mean all these things, which means he's saying them specifically to hurt you. That's really really shitty behaviour.",
            "Any man who watches porn and talks to other women is not having sex only once every 6 weeks. My husband works 7 days a week, has a low sex drive and we still have sex at least once a week. He's definitely having sex more often, just not with you. I bet if you do a little investigating you will find times that he's not where he says he is. Those overtime hours don't add up and stuff like that. My ex was a cheater. We had sex maybe once a month or less. Women at work are a cheaters dream. I'd look into it.",
            "He lost me at fat. Nope.",
            "Girrl, being a bit overweight don't makes you unattractive and it's not the most important to be your partner's type, because when you love someone it's kind of hard to not feel attraction you know types are just a shallow preference",
            "The things he says to you make me wonder if you’re really such good friends. You seem to think so, so I won’t comment on that any further except to say you should really think about it.\n\nNow, if you really are good friends and have a happy life together, consider what you stand to lose and gain by ending things. I think the ideal situation would be an amicable divorce and a close friendship after. Is that possible? \n\nIf not, do you enjoy each other’s company without the sexual attraction? If you enjoy being part of the others life, it may make sense to continue the marriage. \n\nI would also consider relationship counselling if I were you.",
            "He sounds really unkind. If I were in your place I might think about how lovely it would be to be single and not have someone I love saying cruel things to me.",
            "Iffffff Ahem,\n\nIF IT MATTERS TO YOU IT MATTERS.",
            "OMG. Please get out of this toxic marriage and stop wasting your time on someone who does not honor and worship you. There are so many men out there who would adore you, treat you like a queen and give you what you deserve. \n\nThis guy has issues. He will never step up and when you are \"old and ugly\",  you will be very angry and bitter that you wasted your time on someone so selfish and uncaring. \n\nI speak from experience.",
            "I don’t think it always matters about your spouse not being your physical ideal, because that’s not always the most important thing for people, *but* in the cases where it doesn’t, they don’t say things like their spouse disgusts them sexually, they’re fat, and degrading them for not being their ideal, among other horrible, abusive things, along with a history of texting other women and replacing real intimacy with porn and fantasy. So, in your case, it’s a big problem because he’s expressed that he’s not attracted, and has treated you like he isn’t. People can still be together with their “not ideal” partner and have and show plenty of attraction toward them.",
            "It’s not just that ‘he doesn’t find you hot’. He doesn’t respect or care for you. He treats you appallingly. He’s openly told you that he’s not attracted to you. You have to ask what each of you are getting out of this? Clearly he’s getting convenience and a punching bag. What are you getting? Abuse and maybe scraps of attention every now and again. \n\nThis is not a happy marriage. If you think this is love then I’m sorry you have a really really warped sense of love and have no idea what a healthy loving relationship looks like. And I hate to tell you but eventually something ‘better’ (to him) will come along and he’ll leave without a second thought which will absolutely destroy you because you are so invested in him when he is not invested in you as a person or you as a couple. \n\nFWIW - you should have no doubt here, this marriage should not continue. You will need therapy to recover from this and recover some semblance of self worth and self love after the way he’s ground you down over the years.",
            "What do you get out of this relationship? You do an awful lot of taking care of him, but what do you get in return?\n\nHurt. Disappointment. Betrayal. How many more years of this are you going to endure?",
            "You ask if it matters. Well it matters IF IT MATTERS TO YOU. I read between the lines in your post that you don't seem to be in touch with your own needs at all, and you do not value what you want yourself. You seem to derive your worth from being useful/needed by him,  but where are your needs? Why don't you honor those? Why does anyone have to confirm if something matters or not, where is your opinion, the only one that matters when you make your own life choices?  \n\n\nI congratulate you for your awakening. Next step: start interogating yourself what you truly want. And then open your eyes and see if this guy is it. With his insults and his contempt, I hope this is not what you want. And then start making your life changes for yourself. Nobody else will. You are not a victim, you have the power to stop or change this marriage, but it is time you start not accepting less than what you want, with the risk of \"losing\" the husband (read: getting rid of the negative element and actually winning).",
            "I was in a very similar relationship up until a year ago. I always felt insecure, but never supported to lose weight and live a healthier lifestyle - it was just pressure all the time. He would play with my stomach and point it out in front of others, and we would say the exact same things; “oh sex life isn’t that important when we get along so well”, “we are just like best friends that sleep together”. \n\nAnd that’s all it was supposed to be! Just friends. \n\nHe had cheated on my throughout our 6 year relationship without me ever knowing and finally decided to come clean about it when we were settling down and planning on getting married.\n\nI have to say this break up was the best thing that ever happened to me. I am now in a relationship full of love, passion, and affection. It feels SO good. I was honestly convinced that love meant being best friends but it’s SO much more than that. I know every situation is different BUT in my experience, you deserve so much more and you deserve to feel attractive and sexy with your partner.",
            "There's a saying I always hear that goes \"When someone shows you who they really are, believe them\" and I've always thought it was tosh but that was the first thing that sprang to my mind when I was reading this. \n\nYou deserve to have a fulfilling sex life and you deserve to be with someone who finds you attractive. You've already caught him texting other women and, even if he couldn't keep his hands off of you, this would already be a massive no no. \n\nI hope, whatever choice you make, you end up being happy and never get spoken to like that again.",
            "To answer your actual question, yes you *could* have a happy marriage even if you have mismatching libidos or if one of you isn't as passionate as the other. My husband and I have been married six years today, and we have never been happier. He is not my physical ideal, and I am also on an SSRI for PPD that makes my libido almost nonexistent.\n\nBut here's the thing that we have that you don't have: open communication and respect. My husband knew I loved his personality way more than his body when we were dating, that sex for me was more about intimacy than physical release. We have had ups and downs in our sex life, often related to how much childcare I have to do daily and what medication I'm on. But I've always made it clear that I enjoy being with him because I like to make him happy, and we're both open about our needs and expectations. \n\nYour husband says cruel things to you whenever he's angry. He treats you as less than. His needs are more important than yours. I'm sure oral isn't the only thing he doesn't reciprocate. \n\nEdit: Upon rereading, its clear that this guy is a manipulative ass. I don't know if he can change but he doesn't deserve you, and you should find someone who actually cares about you.. But also, you need counseling because you need to know that this is not normal or okay behavior in a relationship.",
            "I used to have a long term boyfriend who was like this ~ we were both really thin but he would talk about how “fit” and muscular he was hahaha\nHe would always say I don’t have a “fresh” look and that I “didn’t have the requirements for him to find me attractive” ~ called me names like parasite *completely* out of the blue, always cut me down, would make a big show to pretend to want to vomit when I was naked in front of him ~ (he said it was because my ass wasn’t big enough) \n\nDude would look at porn for hours upon hours every single day, and was crazy about it. He did all the things your guy is doing.  \n\nIt was over 7 years ago but I hear his words in my head every day, and never recovered the joy and freedom I felt in love and intimacy where I felt ok to be naked in front of a partner. \n\nThe sad thing is - I look back on pictures of myself back then (I thought i was like a freak, monstrously hideous) - but I honestly was very beautiful - it was all a manipulation.  He stole those years from me. He’s stealing them even now. \n\nWhile it’s totally ok and a thing that happens to become unattracted to your partner and to have partnerships that aren’t sex focused, fetishes, being attracted to something you’re not, etc etc - \n\nIt’s not normal the way he’s saying you sexually disgust him and the dishonest way he’s acting... he’s not being kind to you. And he sounds like he has a very immature, selfish, unrealistic, and under developed sense of intimacy ~ \n\nI also think he’s just selfishly projecting his own feelings about his own body into you. \n\nYou may be overweight - but it doesn’t mean a person can’t totally be head over heels for you, or that you can’t be beautiful/desirable.  \nAnd what kind of environment is that to even be in- to love yourself and your body or lose weight if you wanted to? It would be so fucking oppressive and traumatic. \n\nI bet in years later you’ll look back and say - wow, he stole the best years from me and made me hate myself.  \nYou should be loved and cherished.",
            "Personally, I could never be in a relationship with someone I’m not sexually compatible and most of all calls me “disgusting sexually”. However, if that’s something you can and want to put up with then don’t divorce him.",
            "Maybe if you just start working on yourself, only make changes about you that would make you feel good about yourself, get a hobby or go with friends,if you feel like you need to loose weight, nows a good motivation  period. Start feeling good about you,i think once you start really liking you and respecting yourself, you will not want him in your life..wish you well..",
            "There is so much going on here.\n\nI am going to focus on what you can do, as your husband is dependent on you, and a complete asshole.\n\nYour self esteem is low and that bleeds into the other parts of your relationship. \n\n>I won't bore you with all the details\n\nWe are here to help, and you want help, you should try be more assertive, to get what you want.\n\n>he's 100% my type and I've always been gaga over him.\n\nWhat about him is this 100% your type. He seems emotionally distant. Why is he your choice?\n\n>We had very little sex and I was insecure and never initiated.\n\nAgain being more assertive would help. Its okay to have bad sex, what is important is that you have fun trying.\n\n>. I also was always there for him in every way (emotionally, practically, etc). He really grew to rely on me because he suffers from ADHD and depression and often needed my support in many ways (which I was happy to give).\n\nThis screams co-dependence. I want to recommend therapy, but you need to make that choice.\n\n>There were many hiccups. I caught him texting other women a few times. He watched porn a lot.\n\nTexting how? Emotionally cheating? Is porn of the table for you? Porn can be a part of a healthy relationship as long as neither gets addicted, this is something you have to decide if you want him to get help.\n\n>He'd call me a prude but I honestly couldn't understand what he was talking about. He cited the fact that I never got on top.\n\nThis is probably something you want to listen to, he is describing what he wants, but not in the correct way. It also ties in with your lack of self esteem.\n\n>\"if you want to know why I've never given you oral it's because you disgust me sexually\".\n\nThis is the biggest red flag a sexual relationship can have. Thats why I think he is co-dependent on you. He wants you for something other than sex.\n\n>I'm wondering.....does it even really matter? Does \"lust\" matter? Does it matter if I'm not his physical ideal? Can we still have a happy marriage if we are both in love and committed to each other even if he apparently doesn't have any real sexual feelings towards me? \n\nThese are very real questions that only you can answer. And your answers can change as you grow.\n\nI recommend seeing a therapist, help you get your mind straight. A therapist is not there to give you the answers, they are there to help you find your answers.",
            "I can provide somewhat of an insight to the other side of this, ( although I'd absolutely never dream of telling my girlfriend that she disgusts me sexually) that's just simply not something you say to someone you love!\nI have to admit though that I'm only with my girlfriend for her personality and just for the type of person she is. \nPhysically, I'm not very attracted to her, but I'm very happy with her because she possesses traits that I've never discovered in any other person before her.\nLooks fade, but personality and character stay consistent.\nSo I can kind of sympathize with his side of things, but definitely not with how he expresses or handles it....\nIf he as lost all love for you as a result of this and you've become the better than nothing option then holy shit get the hell out of there!\nYou've still got your whole life ahead of you and plenty of opportunities to find the love and respect you deserve!",
            "I’m sorry to break this to you but he doesn’t love you, you sound like a nice person, I’m pretty sure you could do better, don’t settle for someone that treats you like that, life is too short for you to be with someone who doesn’t love you and treats you like shit, you’re settling by being with someone like him but there’s so much I’m sure you haven’t done, being in love feels good but being in love with someone that’s in love with you is even better, you should feel loved and appreciated, respected as well which is super important, take care of yourself and prioritize you well being, he’s not worth it",
            "Even if he just liked you as a friend, he wouldn't be talking to you like that. He sounds like someone who thrives on feeling superior to others, and he's getting a kick out of undermining your confidence so you feel grateful to be with him. You know what? You're actually better off being alone. I hope you can gather the strength to walk away from him, as the first step to getting your self confidence back.",
            "honestly, i dont believe he loves you truly. that might be hurtful to say, and it might hurt to hear, but personally i think its the truth. him not being sexually attracted to you might not be a big deal in some relationships (in other relationships it might be necessary, it is for me) but i think if he really loved you, he would not say hurtful things to you and about you. i think he loves that youre in love with him, i think he loves the support you give him, i think he loves the way you treat him and the companionship you give him, but i dont think he loves YOU, as a human being, because if he did he would take care to not hurt your feelings purposefully. if i were you, id leave.",
            "There is NO way that someone loves you, really loves you and does not WANT you. These are not two different things they’re one and the same. You deserve to experience what making live to a person who loves and wants you and who you love and want feels like because I promise you NOTHING will ever compare to that, you’ll see the stars. Do yourself a favor and make a decision that will allow you to not miss out on one of the most beautiful experiences of being alive.",
            "I wouldn’t want someone who say that stuff as a ‘good friend’ so I would def not want that in a husband. Maybe look at the definition of friendship, love, trust, caring, compassionate, partner and then compare to see if that’s what you have with this man. Maybe  you are just those things to him and it’s not reflected back to you. You deserve better. You deserve someone who  no matter how mad or how hard things get knows that’s it’s you and him against the problem, not him vs you.",
            "I may be younger and not married but I know that sexual attraction is really one of the pillars of a good relationship. When that's lacking, it opens a door for cheating, unwanted open relationships, and just general unhappiness (it does depend on the relationship and the people involved, but it does seem important to you at least). You deserve to be with somebody who loves every inch of you, and who admires you as a person as well as your body, and trust me, there's someone out there who will feel that way. \n\nI think since you and your husband (at least from what you said in your post) don't seem to have any other major fallouts you can end this marriage amicably and stay friends. Part of feeling appreciated in a relationship is feeling loved AND wanted, if one isn't there, you're in trouble.\n\nI quite honestly don't understand how people marry someone they're not into physically, you should end this and continue with your life, get back into dating, find someone who'll show you what a good sex life really looks like because you deserve it.",
            "oh my god.  honey, he's not worth it.",
            "I will be very honest.\n\nI think you both are together because you ended up together and don’t want to lose a relationship.\n\nNow this is only based on the little information you have given but it seems like you both have insecurities that have led to you both settling for one another. In addition, issues with communication but they have never been resolved because you both don’t want to lose the perceived benefits of being in a relationship - even if that relationship isn’t what you want or beneficial to you. E.g. fear of loss.\n\nNow don’t get me wrong a lot of people have these types of relationships where it’s mainly companionship and that’s fine - do you. The problem I see however is there is an imbalance. Essentially you want more than he is willing to give and even though you’re suppressing it clearly it’s been affecting you negatively. Additionally someone who loves and respects you should not ever speak to you this way not even in the heat of the moment.\n\nIf you’re both willing to work on communication and attraction then so be it. Go to therapy, maybe a sex therapist and work on yourselves as a couple as well as individually. I’d never say change yourself for someone but some gym workouts could help with the going on top and BMI - if YOU want to make that improvement. He also needs to work on reciprocity.\n\nOtherwise if you don’t take these steps you need to decide if you’re happy to continue like this or if it’s best to break free from such a relationship.",
            "So I’ve been in a relationship with a man with ADHD (and, I believe, probably other undiagnosed things) before. We were in a relationship for 5 years and much like you, we didn’t have much sex. I think every 6 weeks was probably our standard too. \n\nI ended our relationship because for 5 years, I had voiced my need for intimacy but also general support and help around the house. None of which ever happened. \n\nWhat I concluded was that I was just his Security blanket - he might have loved me, but more like a friend. People with ADHD needs structure and stability, and I helped him in that - I helped him get up in the morning for work, made him dinner and cleaned the house for him. \n\nWhen I broke up, my theory of me only being his security blanket made more sense. He was mad and hurt at first, but after a few weeks, he begged me to come back because he “... couldn’t do all of this alone” (referring to managing a household and his own life). \n\nI think sometimes it’s hard being in a relationship with people with diagnoses, because you don’t really know if they love you or just the structure and stability you help them achieve. \n\nAnyways, long story short - you have to put him aside and ask yourself “What do I need in a relationship, and is this being met by my partner?”. Once I asked myself that and broke up with my ex, I have never been happier.",
            "If you don’t have kids just leave. If you do, think about it and then leave with the kids.",
            "It matters if it matters to you. Of course a marriage can be happy without lust, but only if it is a true partnership. The lack of sex is less worrying than the lack of respect he has for you. He is using you! He's not providing what you are in return. He is selfish. I think individual therapy for you would be more beneficial than couple's therapy so you can figure out your next step. IMO you deserve better. Feeling unwanted, undesired in a relationship is a terrible feeling and all I wish for you is to find a partner who is more compatible with you, who respects you, loves you, is affectionate, loving and NEVER EVER insults you no matter how angry he is.",
            "r/deadbedrooms might be a good place to start to get some inspiration and motivation to dump him. Do you really want to spend another 30-40+ years putting up with this?",
            "I’m so sorry for you. I’ve just been through a horrendously similar experience. I’d look up narcissism and see if your husband has any other traits that match, apart from devaluing. If my instincts are serving me, he will be on the lookout for another woman from the safety of your “comfortable” relationship and discard as soon as he’s ready to fly.",
            "Sounds like it's time for divorce. If he insults you and isn't attracted to you then you don't have to waste your entire life over him",
            "Things are going to get worst from here,i know you are afraid you won’t find someone,but he is basically using you.You can either stay and play it safe, or try finding someone that actually likes you.He is not your best friend, he is the crazy girl that hangs with you because you have a car and talks shit behind your back.",
            "Oh honey. You deserve a life so much more fulfilling than this. Life can be better for you. Love can be better for you! \nYou don't have to be settled for! Which is exactly what he's doing. You loved unconditionally and that's not wrong I'd you. However he loves you conditionally and I don't think either of you deserve that type of relationship. He has made several different remarks about how you look, and about how he feels. You should know that you don't need to put up with that. It seems like he's okay with being gross or however he puts it but leaves it all to the woman to keep up appearances?\nThis is probably more deep seeded than you may know. Also hasn't given oral once? Oh honey the disrespect. \n\nOnly you can really do anything from here on out, However it seems like you are already distant, and he's already checking out emotionally. It will be very hard, but I feel you will be so much happier once you leave and find that you are worth so much more than what he says. You don't even need to find another person to tell you that. All you need is you. I would recommend splitting up for a while. Taking a break if you will, and see how you feel a few weeks or months down the line. \n\nCan you honestly see yourself being happy with him for the rest of your life? That comment he made about being unnatractive when your old anyway would have killed me. I personally would start taking steps to leave. I'm worth more than what he has to offer me, which isn't much to begin with. I don't deserve to be settled for.  You don't either. First loves are tough, but you gotta love yourself to girlfriend.",
            "Re:  “Does it even matter? Is lust mandatory?”\n\nNot *necessarily*, though it can help.\n\nWhen people talk about lust being the “secret” to a good relationship, try to put it in the same box as advice you get from different types of people who say “humor” is the secret as well as wholly different sects who say “mutual respect” or “common interests” or wait no!, “*separate* interests” are the secret.\n\nThe point is that there are a lot of things that a relationship can offer you. Some of these qualities will be more important to you than others. And, some will be more important to your partner than others. It’s possible that you are more sexually motivated than your partner. He, in turn, might appreciate you for your humor, honesty, generosity, or any number of other things. As long as you are both getting what you need out of the relationship and there is some type of balance, that’s all that matters. It doesn’t have to be a symmetrical one-for-one balance. And, you don’t have to value or need the same things. Most couples don’t. They tend to be complimentary rather than identical.\n\nIf you can set aside the new agey preachiness qualities and not put it on too much of a pedastle (no self help book should ever be elevated to philosophical or theological levels), the Five Love Languages is a decent albeit simplistic framework describing this.",
            "He’s verbally hurting you and has expressed his thoughts when he called you fat or disgusting. That is really hurtful and mean, and even though he says he didn’t mean it, I truly believe he did. You’re not happy with the lack of intimacy either. You’re wasting your time with someone who isn’t even reciprocating for you and doesn’t find you attractive. It’s not going to improve and you’re just going to keep getting hurt. I say everything that you’re sad about does matter and is valid. There’s someone else out there who will find you attractive and treat you better!",
            "Dump him. And see if his fat ass is able to find a \"petite, athletic\" woman.",
            "Some people can have happy, successful relationships without physical and sexual attraction.\n\nBut nobody has a happy, successful relationship when their spouse is an abusive POS.",
            "Oh my God leave the shit out of him. You don't tell someone you're in love with that you disgust them sexually. Being sexually incompatible in relationship is a deal-breaker for most people and it sounds like it's one for him because he's texting other women. It's okay to watch porn but that's something a couple has to talk about and also a huge issue if you're not already having sex. I think you might just be a turd sandwich and that's the nicest way I can put it. You can 100% find someone who is sexually attracted to you and emotionally and romantically attracted to you. I wouldn't waste your time on him any more than you already have you sound like a well-spoken intelligent young woman.",
            "Well, on the one hand, sex frequency really tends to decrease in a long-term, stable relationship. Not for everyone, but that is common. But at that point, you are supposed to have a core love and understanding for each other that helps to bridge those times of less physical connection until it swings back around again.\n\nOn the other hand, there is NO WAY I could continue to be in a relationship with someone who said those things to me. Specifically, when he said \"you disgust me sexually\"--I just don't think I could ever get past that. I might not end it right then but later I know I would look back and that would be the moment that the relationship ended in my heart.\n\nI think you should walk away from this man. Both of you deserve to be seen as sexy and desirable and I promise you there are many men who will see you that way.\n\nWhen you have left him and met someone you have fun with I guarantee you that you will look back on this and marvel at how little you were willing to accept.\n\nBest of luck to you, you can do it!",
            "He sounds abusive to me and convincing you with words and not actions. He sounds like he puts all the blame and responsibility on you. You shouldn't be into him after how he treated you. That's not love. I could never EVER tell my partner whom I love such terrible hurtful words. \n\nI had a boyfriend just like that, he wanted oral from me and for me to do all the work and he only wanted to receive. Fing leeches. RUN! You absolutely deserve a wonderful joyful life not to sit around waiting to get old and die.",
            "I think it’s fair to say that when you’ll actually get old and sick, that husband of yours will not stay by your side. He’ll leave. Emotionally or physically but he’ll check out. He’ll be distant. He will whine that you’ve changed. That you’re ugly and sickly. Fat? Thin? Sloppy? That you let yourself go and that you repulse him. You’ll go alone to most doctors appointments. He will then let you figure out your treatments alone. You would be scare without the support of the most important person in your life. He won’t stay with you and comfort you through your illness. He will half ass everything. \n\nThat’s not the kind of man you want as a husband now and that certainly not the type of husband you will want as you get older or when things get rougher.  \n\nYou deserve better than this. Life is so hard already, don’t make it harder on yourself by being so unhappy and lonely with him.",
            "Sex isn’t everything in a relationship, but how do you feel about the relationship in general? Has it been what you’ve wanted out of a partner? If it isn’t, and then you consider all this stuff, then yah you should leave.",
            "You deserve so much better than this :( you are a crutch for him and no more.",
            "Take care of yourself and take time to think before making decisions. Perhaps you could take the time to find out about your own feelings. Do you love him? Are you just invested? Is it hoping for a relationship that you actually never had? Comfort maybe? I asked myself all these questions before i ended my 8 year marriage. When i left i knew it was the right thing and never looked back. It was difficult and it took me a good couple of years to learn what i wanted and make a decision i would not regret. So my advice to you is find your real place in this man’s life and make peace with whatever that place may be and move on with or without him. You need to be happy!",
            "Love matters; love matters a lot. However, love is not ALL that matters.   \nCan you wake up in the morning for the rest of your life next to someone who finds you disgusting? Not \"less attractive\", not \"chubby\" but disgusting. I could never.",
            "You know, there is a difference between not being his type of body and not being a sexual target at all. \n\nMy boyfriend also prefers petite girls, and I'm a lot of things, but not that. He was clear about that from the very start, and we still have sex, he claims to like it, and even though I am a bit overweight, which can be changed, and my posture is rather massive, and I can do nothing about that, he is capable of accepting my body, desiring it, or complementing me sometimes about my looks, because he wants the whole me, not just the bod. \n\nI think your husband don't see you as a whole. There are ways to change things and solve problems bothering partners if both are willing to work on this. Have he ever brought your weight up as a thing that bothers him? Didn't he know you are not a small woman from the start? \n\nThere is one more thing I want to point out, I think that unless you argue with a person capable of saying lies just to harm the other side, hurtful things said during a fight count as the ones said in peaceful convos. In most situations people do mean it, just wish they put it in some lighter words.",
            "People act like things said in the heat of arguments are an exaggeration of the truth. They are still tied to the truth in some way. I have been with my SO for much shorter than you (3 and a half years) but when arguments start we never target each other. The argument is always about disagreements with how we deal with something - not just how the other person is!\n\nIn the heat of an argument, my mother would disown me, call me all sorts of derogatory names. It never mattered to me that she apologized in the morning - words can be harmful, and people need to be held accountable for them, whether they were said in an argument or not. Otherwise, it feels like the person who calls you all those things is secretly hiding their disgust, their negative emotion from you, and so when it finally pours out it doesn't come out as a little stream but like a fucking tsunami.\n\nSo, I would confront your husband directly with this insecurity. See how he responds. This is a very difficult situation, and I am so sorry you have to go through it. But you absolutely will.",
            "This is going to sound harsh but Simone who treats you like this doesn't love you. At least not in the way he claims. \n\nHe says things in anger and instead of talking about why he would say something like that (it doesn't need to be true but there is a reason why you shout stuff when angry) he says that isn't true and he loves you. It seems like he's unwilling to communicate.",
            "Why are you talking about lust when you have much bigger problems to address? Like him insulting you all the time? Like his complete lack of respect towards you? You’re gonna let that slide and concentrate on the superficial? \n\nFine. Yes, being attracted to each other matters, it’s one of the most important building blocks that separates people being “best friends” and “romantic partners”. Aside from sex, intimacy is a huge factor that seems to be completely lacking. You’re not a good fit. He needs someone to mommy him and be his nurse and therapist, and you need someone to make you feel like a desired woman.",
            "It’s not even a problem of lust and sexual attraction anymore, he doesn’t respect you and without that I don’t think there’s much more to do. You deserve so much better than being the moral companion of someone who doesn’t respect you.",
            "Him calling you “fat” and “sexually disgusting” isn’t ok. Not in a relationship and not in a friendship. He depends on you for emotional support but that’s not the same thing as him loving you. And sure he might not have cheated yet but what’s to stop him when he finds someone he finds attractive? Since as you said he already texts other women. I don’t think you should continue with the relationship cause the break up is inevitable in my opinion. You can just choose to end it now before you end up more hurt or let a few years pass and let him hurt you constantly.",
            "It looks to me like you both have had issues communicating with each other, you both have had issues opening up and then you both have issues with the truth. If you want to have more sex, trying js at very least what you should do. You complain about him never giving oral but then moan about him never initiating see while not initiating it. Maybe he's not comfortable with oral, like you arent with going on top?\n\nHe's right when he says love triumphs over all, but is this relationship that you want to have? Communicate to him your issues and fix them, otherwise you're in for a shit life, and if it doesn't get fixed to a satisfactory standard, then leave. Don't fuck around and don't worry about him - you need to worry about you, and if he doesn't see that or know that you know its a dead relationship and is unfulfilling",
            "I'm so sorry but this is not a healthy relationship and you need both individual and couples therapy to work through this and figure out if this is enough for you for the rest of your life. Don't you want to experience someone wanting you passionately? Don't you deserve that?",
            "You two need to get couple's therapy. This is deeper than a post on Reddit and you both need to decide a) if you want to work on the issues together or b) can it completely.",
            "He’s not your friend. Not in any way.",
            "You deserve a lot better.",
            "I was in a similar marriage, although my ex wasn't cruel. (Yours is a jackass, no matter if he is sweet in between.)\n\nI'm now married to someone who finds every bit of me attractive- even my feet are lovely to him, although he finds feet in general disgusting and unacceptable! I'm fat as hell and he loves me exactly the way I am. I've changed in weight due to health issues and circumstances and his attraction to me has not wavered. He's attracted to *me*. I feel the same way about him.\n\nIt is *so freeing* being with someone who just loves you and wants you, up and down and in and out, who celebrates your successes as their own, who loves your loves, who has your back, who wants to have sex with you even when you're in your chipped polish, flubby, stained tee, slouching around, quarantine self- *especially* then, because nobody else gets that comfortable part of you, that laughing, ridiculous part of you.\n\nYou've got a guy who recognised what a great catch you were. That's something. Now go find a guy who's a great catch, too, and moreover adores you.",
            "Dude these are your prime fucking years. Go find a man that wants to fuck you, it’s better than settling for some psychopath who demeans you and destroys your self esteem.",
            "Even if you were comfortable being in a marriage with a friend, a friend does not treat you like that. You deserve better, truly.",
            "The things your HUSBAND said to you my closest friends wouldn't say to me. I think it's time to reevaluate the situation and ask yourself if this is something you want to deal with for the rest of your life.",
            "I never understood why someone would during a fight bring up what the person you are fighting with look like. It has nothing to do with the discussion (probably) and he uses it just to hurt you. Even during an argument you shouldn't have any desire to hurt your SO. That's just beyond me.\n\nAlso, I would recommend being more open and communicative about sex - your likes and dislikes. It seems to me that you both find this topic uncomfortable to talk about, but it's really important to have the discussion",
            "Physical attraction is an important component of a good relationship as is a happy sex life. He’ll be happier with someone he’s attracted to and she’ll be happier with someone who’s really into her. Don’t settle for a so-so relationship because you think it’s the best you can do.",
            "There's a few things to unpack here that I can tell (not a professional but we're on reddit so here's my perspective):\n\n1. He's got problems he needs sorted out: hurting you and insulting you is not something a \"partner\" should do. Also, he really sucks at communication, which is needed to be improved so that you both truly are on the same page.\n\n2. I agree that in the end, love and companionship is what matters most, even though sex is very important early on and throughout most of the time though.\n\n3. I wouldnt take the \"not into me physically\" as heavy as if he doesn't resonate with you mentally or spiritually. Unless you have a medical issue, then with some work and your own dedication, you can try to be what he wants/needs, so I think this point is more superficial in the landscape of a relationship, AND HE DEFINITELY SHOULD ASPIRE TO BE WHAT YOU WANT/NEED TOO. The same exact way. If it's one sided effort, then no, it's not right.\n\n4. Ultimately, you have to decide, with clear mind and heart, if the person you are with, the relationship you're in, is sustainable for *the rest of your life*, and what your deal breakers are, regardless of what the problem is.\n\nIf the sex and physical attraction is the only real problem, are you willing to work to improve it? Or want to find someone to accept you for who you are? Is it physically possible to attain this change, and if it's not, can you stay with him when he doesn't make you feel sexually desirable? What if you got into the best shape of your life, and he didnt? Would you feel things are one sided or that you deserve better because you believe in yourself more?",
            "So, I don't know if this helps op, but I just burned some bridges with my parents, and it's seriously been one of the most painful things in my adult life. But I'm so glad I did it. I didn't realize how much of my energy was going into maintaining that relationship. I knew it was hurting me, but it wasn't until I made it clear that I'm not going to take any responsibility for their happiness anymore that I figured out how much I was letting them hold me back. \n\nIt should be noted that this moment had been built up to and backed up by months of therapy, which I highly recommend for you. It's not just about getting him to stop hurting you. It's about learning to be your own protector and champion in positive and healthy ways. \n\nIf you can't afford therapy, read books by experienced therapists and PhDs. I'd also recommend that you do some research on narcissistic relationships to see if that fits your situation. My favorite therapy self help book is Feeling Good by David Burns. There are a lot of layers to your situation, and the more you understand all of those layers, the more comfortable and confident you'll be in making decisions for yourself. \n\nForgive me for saying so, but you seem like you might be most comfortable when someone tells you what to do, and whether you stay with your husband or not, you've got to work on that. A common side effect of narcissistic abuse is not having a very firm grasp of your own identity and worth. \n\nI wish you the best.",
            "Someone who loves you doesn't say things like that and most definitely wouldn't lie to you for years. He's been using you for stability.",
            "You'll find someone else to be madly in love with as soon as you drop that turd.",
            "The truth is that you're not always you're type's type. Of course, this in no way excuses his behaviors such as degrading you and name calling. But I'm just mentioning this because just yesterday I was watching a YouTube video about it and the people in it were saying that most men would leave a good woman who isn't exactly their type for a woman who is even if they aren't so good/kind etc. \n\nYou deserve to be with someone who loves you and makes you feel appreciated, not someone like this. \n\nI wish you all the best in the future.",
            ">He says it doesn't really matter because he truly loves me and he's willing to work on having a better sex life with me. He says when we grow old we'll be unattractive anyway and love is all that matters.\n\nHe's not wrong. You can have a perfectly happy marriage even without sexual attraction - if both parties are okay with that. He's okay with it. You don't seem to be.\n\nThe answer of whether or not you can have a happy marriage going forward is up to whether you can be personally satisfied with having someone who loves you as you are even if he doesn't find you attractive.",
            "Your husband is looking for a long term caregiver and maybe an enabler.   You are looking for a true partner and spouse.   You will never get what you need from this man.  The cycle you hate will repeat as long as you are with him.  He’ll say horrible things and treat you badly, then realize he might lose his caregiver and try to make up.  You deserve better than this.",
            "Your husband routinely insults and demeans you. No this is more than he just doesn’t find you hot. Why would you want to be married to someone who find you disgusting?\nAlso you’re meeting his sexual needs by frequently providing oral and looking the other way while he texts other women. Don’t you think you should have your sexual needs met too?\n\nYou should see a therapist to figure out why you’re ok with the scraps your husband gives you.",
            "I stopped reading at 'disgust me sexually'.\n\nThat phrase alone made me feel sick. It's a really nasty, vicious thing to say and if my partner had said that to me, I don't even know how I'd move forward.\n\nGenuinely sending you love and hugs xx",
            "You're asking if lust really matters or that you are not his physical ideal.\n\nYou're right, in a way these things are not super important but the thing is, when you're with someone who loves and respects you, they'll lust after you and will come to find you physically attractive.\n\nThis guy sounds like a leech.",
            "He doesn't love you, he leans on you. If he loved you,the wouldn't call you disgusting, even if he felt that way, because he'd care about your feelings.\n\nHe doesn't love or respect you. This relationship is making you unhappy and leaving you unfulfilled. Love yourself enough to escape and find true happiness with someone who will care for and be attracted to you for who you are, not because he's forcing himself because you don't meet a narrow and idealised body type.",
            "This man is a shove and sex is just one component of how it’s toxic",
            "My own best friends don't call me fat or anything if anything he should be lifting you up and giving you the confidence to be yourself and if you want improve on anything giving the support you need. He sounds resentful and is emotionally mooching off of you because he is afraid to be alone. If my husband called me fat and said he was never attracted to me  I think that would be the end of it. There are a million other kind and encouraging ways to get your partner to loose weight. Op I think you are better off with out him. Passion is important in a relationship to feel desired is wonderful. It keeps the relationship flowing.",
            "I don’t think it’s because you’re unattractive, it’s because he seems like a self-cantered idiotic man in general. A cheating one on top of that!! Why would you stay in this relationship? I wouldn’t even call him a friend in your place.\n\nEdit: I hope you get tested for STDs regularly if you stay. One more reason why he didn’t initiate. Many cheating men don’t. Also you ignored many red flags even from the start that would make other women run the opposite direction from him.",
            "He is awful to you. He doesn't love you. He's afraid of being alone.",
            "I was married to someone who turned out to be asexual, we didn't know prior to marriage because he wanted to wait for marriage to have sex. However, we were best friends, but he never ever called me fat, or unattractive. We ended our relationship after 6 years of being in a dead bedroom, and we managed to end things rather amicably. My point is this, you deserve someone who not only desires you but respects you.  He clearly doesn't do either, I mean he is texting other girls etc. He is trash, and you aren't meant to be a garbage collector. Best friends don't do this to one another.",
            "I would have divorced him the minute he said you disgust him sexually.",
            "It matters.\n\nBeyond the attraction though.... He doesn't respect you. That is enough to say g'bye over.\n\nGo, find someone who IS that into you. I guarantee he's out there. Give him a chance to find you.",
            "Yes sex matters. Why do women put up with shitty partners?",
            "This makes me so sad. I truly am so sorry you had to go through all before you saw his true colors. If I could offer you any advice (preface: I’m 23 so take my word with a grain of salt because I’m a delinquent)- it would be to really, truly dig deep & decide whether or not you can spend the rest of your life living the way you are now. Your husband essentially lied to you for your entire relationship for the purpose of ‘comfort’ & you’re the one reaping the consequences of HIS actions. \n\nI don’t think he’s worth trying for, personally. I’m a pretty co-dependent/dependent girlfriend (something I’ve had to actively work on) & I’ve done some pathetic things in order to keep a man around. Hindsight is always 20/20- your life is spiraling downhill & either way I feel like you’ll hit a rock bottom either way. I guess the question is, would you rather prolong the downward spiral into rock bottom or demand some respect from him & hit ‘rock bottom’ when you mourn the loss of your relationship & previous life. The best part about rock bottom is the only other way to go is up. \n\nThis is off topic & just a suggestion if you had previously been considering this: if you plan on trying to get down to a more ‘petite’ size in order to get him to be more attracted to you- put all of that energy into becoming healthier for yourself. Become your own dream woman & love yourself the way you wished he’d loved you. It’s all easier said than done of course & I’m one of the biggest offenders but I would never tolerate a man lying to me about the way he feels sexually about me for our entire relationship. I don’t know how I’d even get past that. You deserve so much better than that. I’d call it quits if I were you. \n\nRegardless, if it’s on your agenda to work on weight (not implying anything), use that journey to remember who you are now without him to constantly walk on eggshells around. & get hot(ter) as fuck which will just be a plus when he comes crawling back because he’s never had to be a grown man before.",
            "I get the feeling that the fights are a very small fraction of the relationship. The worst of the worst, but part of her journey to this realization. Who knows maybe not? Hard to say.\n\nOP, just be careful about which advice you take. Look for success stories and best practices as much as the red flag waving. There's a way through this. Honestly, we all have little red flags, but the true measure of a relationship is both of your abilities to invest into each other and improving. Everyone has different lines where enough is enough, but I hope between better communication, some research, and maybe counseling you can wildly improve your sex life. \n\nBe more confident! Be proactive about asking what he likes. Try new things. Ask Reddit for sex tips and source material. Get a little freaky. Sometimes it takes one of you to take the initiative (for months even) to warm the other's heart and encourage lasting change. If this is what you want, go for it. Everyone is able to learn to develop their sexuality. \n\nThe Act of Marriage is an interesting read. If talking about sex is confronting, then there's definitely something you need to look at within yourself too. Not sure if it is confronting or not, but thought I'd toss that in. Good luck! Things can get better!",
            "He sounds borderline psychopathic, please end it OP.\n\n You'll be much happier.",
            "I got out of a bad sex relationship about a year ago.  Yes, it matters.  It matters a huge amount.  \n\nYou've been carrying your husband emotionally.  I don't think he supports you in the same way.",
            "Seconding all the other comments!\n\nAnother thing to add here is that he said \"we won't be attractive when were old anyway\"\n\nBut life is happening now! Right now! Don't wait until you're old for it not to matter, go LIVE A LIFE right now.\n\nJust like food is for eating and clothes are for wearing, life is for *living*!\n\nYou clearly have such a lovely pure heart, and there is someone out there who will fucking worship you <3 be empowered - you are allowed to occupy your own space, your body carries you through life and that's fucking cool x",
            "It's a difficult situation which I will describe from my POV as I've been in the situation, as your boyfriend, but I'm a female. \n\nWe've meet innocently through high school, but only started going out after. Now, I really wanted to have someone close to me. It felt like my best friend would sorta drop me for first better friend she got the attention of most of the time. I was very vulnerable as I didn't have many close people who I found comfort in, and my family had its own alcohol problems and the likes. I enjoyed my time with him mostly, we did fight, and sometimes we didn't understand each other. He did turn out to be abusive which I only found out/realised much later into the relationship and towards its end, but sexually I felt incompatible with him. I tried to make up for it and work on it, but Ive only done it when I felt least stress, but it was generally difficult since I was basically also cleaning after both of us (thats not all there was to abuse but that was also it). \n\nNow, I was all up for trying to work through our sexual incompatibility, but I don't think I would ever be able to see him as more arousing for me even without him being essentially like a messed up child once we moved in. I liked his face and stuff, but I found myself thinking about how I wish we didn't have sex this week, because I didn't enjoy it at all. He was extremely lazy during sex and the amount of sweat was a turn off. But trust me I did love him as a person and all that mean talk your boyfriend said is an escape from the sexual incompatibility of your relationship. Im sad he said that to you but it is always going to happen without sexual compatibility, its normal and human to want a compatible partner but we can live off just being content with what we have. \n\nI did found out that being with someone more compatible is worth it, it makes me much more happy inside. I think what he has said to you is a cry for help to be honest. You should separate and start again looking for someone who sees the same in you as you do. Too bad he couldn't break up with you like he should have, but sometimes people can behave cowardly. I think its okay to make it amicable, you should be sad but don't be sad for anything else than being two different people, ever.",
            "I’m going to say some hard truths that I’ve personally experienced. When I’m with a woman and she’s self conscious about herself/won’t initiate sex it’s a major tune off and after a while I build resentment. I also suffer with depression as well. Manic or bipolar depression really makes me angry and lash out at my significant others. While I do my best to hold it back and relax there are times where I can’t hold it in anymore and I get angry. I then proceed to get mad at myself and spiral into guilt furthering the hatred for myself. Depression is a wicked cycle. I’ll say that all these arm chair physiatrists don’t know a thing about depression or the effects it has on ones brain. While you may not be getting treated perfectly you’re also not perfect in how you treat your significant other. It’s something you need to remember.",
            "I dated a guy for years who was like this. He never outright insulted me, but he was always talking about other women, watching porn, and we almost never had sex. \n\nThere were other glaring issues too, so I broke up with him. I figured I'd just be alone forever because he made me feel super undesirable and ugly.\n\nShortly after, I found out a friend of mine (who I had developed a HUGE crush on) also had a huge crush on me - and let me tell you, the difference between dating someone who is \"meh\" and someone who is super into you is night and day.\n\nDon't waste your time with someone who is lukewarm and shitty.",
            "Yea you are not realizing all this. \n\nHe is not attracted to you ( he has admitted  this) \n\nHe texted other women I would imagine he still does \n\nHe watches too much porn \n\nWhen you try to tell him your feelings he flips the Blaim on you and insults your body and self esteem.\n\n\nHe doesn’t love you. If your friend was in this situation and you heard this info what would you tel her? \n\nSounds like he sees you as a housekeeper he fucks when he is desperate and you are Gaga over him so he used that as an advantage to manipulate you. \n\nHe’s not depressed he’s a narcissist who doesn’t want to do any emotional labor.\n\nEdit : admitted*",
            "Sounds like he’s manipulative. He hurts you, tries to break you, and then apologize and tries to look like a good guy. He’s slowly breaking you until you’re too broken to leave. My dad did the same to my mom. He broke her so much mentally that she isn’t able to leave, she’s just a toy for him. And he told her the same things that your husband says. He doesn’t love you. He’s playing with you and looking for your breaking point. Leave before it’s too late. I don’t want you to live what my mom lived.",
            "I've never insulted *anyone's* appearance when angry, not my shitty coworker, not an acquaintance, not my best friend, and *certainly* not the person I claim to to love and cherish until death do us part.\n\n\n\nIt's not just about him not being into you. It's also the fact that your husband doesn't seem to be a very good person in general, and he's fine with using you for his own needs. But it sounds like you've finally realized it.\n\n\n\nThis is the part where you head over to /r/legaladvice and find out how you can get divorced as quickly and painless as possible so you can live happily ever after without this douche.\n\n\n\nDo you have a hole inside you that you never can fill? (this is not a sex joke). Do you crave something you can't put into words? Do you feel empty and lonely, even when you're with the people who are closest to you? If yes, it's time to get yourself into therapy. Some people use food, some alcohol or gambling or online games or drugs or sex to null the pain.\n\n\nYou must be so exhausted. Bending over backwards for *years* for a guy who has you convinced you don't deserve to happy. I really hope you'll refuse to accept this anymore.\n\n\n\n#[MOTHERF*CKING DUMP-WORTHY STAMP OF APPROVAL]\n\n❌ 🔚 🚫\n\n[*goddamnit*]",
            "I've never commented here before but there's a good bit to unpack and I'd like to try. First, physicality doesn't HAVE to matter. The caveat is you have to be on the same page about it and one person can't be completely bent by the sexually desires or lack thereof by their partner. So marriage can totally work without \"lust\" as you called it, but that does not seem to be what you want. \n\nAdditionally, he's insulting you, pretty plain and simple there. That's not constructive, it's only damaging your self worth. There are so many more ways to effectively communicate what he's trying to say than that, and if he meant what he said, you might be past the point where your relationship will feel \"normal\" again. At the same time, he can't take back what he said.",
            "Hello I am going to put it blunt no you cannot live like that I did for 40 yrs was unhappy depressed and looked in to affairs but finally found true love after 40 yrs divorced he remarried 9 months after divorce and I am happy where I am at. Get out know I can tell you you might even loose weight when your not happy you gain and your Heath is at risk. I know. Mine was",
            "He seems just...mean. And immature. When partners fight, there are lines we don’t cross because it would fundamentally attack or hurt the person we love. His “jokes” or heat of the moment insults are not clean fighting.\n\nHe might not be attracted to you sexually, but he never communicated that or tried to work on it. He has NEVER gone down on you?! What?! \n\nI don’t particularly find all of sex enjoyable (hair in teeth, blech) but taking pleasure in your partner’s pleasure is rewarding and reaffirming in a sexual, longterm relationship. \n\nFrom this post, I was struck by the fact that your husband does not see you as deserving of a relationship that satisfies or fulfills you. And you do deserve that. He decided he could deal with his lack of sexual attraction for you without allowing you the choice of being with someone with mismatched sexuality. \n\nThis isn’t a happy marriage. It is a marriage where you have to nag/beg/threaten your mean husband to get him to try to work on it with you. \n\nYou deserve better. You deserve sex!",
            "He seems just...mean. And immature. When partners fight, there are lines we don’t cross because it would fundamentally attack or hurt the person we love. His “jokes” or heat of the moment insults are not clean fighting.\n\nHe might not be attracted to you sexually, but he never communicated that or tried to work on it. He has NEVER gone down on you?! What?! \n\nI don’t particularly find all of sex enjoyable (hair in teeth, blech) but taking pleasure in your partner’s pleasure is rewarding and reaffirming in a sexual, longterm relationship. \n\nFrom this post, I was struck by the fact that your husband does not see you as deserving of a relationship that satisfies or fulfills you. And you do deserve that. He decided he could deal with his lack of sexual attraction for you without allowing you the choice of being with someone with mismatched sexuality. \n\nThis isn’t a happy marriage. It is a marriage where you have to nag/beg/threaten your mean husband to get him to try to work on it with you. \n\nYou deserve better. You deserve sex!",
            "My partner has never once called me a name or called me fat.... because he loves me and doesn’t want to hurt me.  \nWhy does he want to hurt you? Why are you okay taking it?",
            "People can make relationships work when sexual needs differ. But this isn't about lack of attraction, it's lack of respect, and that can't work. You deserve to be with someone who treats you with kindness and care. I hope you find them. You need to free yourself from this guy first because he's pulling you down.",
            "I could have written this post only the words that were said to me were far more detailed and harsh. But they were honest. I have no advice and really am here to see what answers you get from others, but I am with you, experiencing the same confusion and hurt and self loathing and questioning and also as directionless.",
            "Yes, if it matters to you, it matters. I've had relationships with lust, and I would not replace them with those without it, because I'd feel robbed and deprived of something I need. If physical touch is anything but the bottom love language for you, you want to look for a partner who can meet those needs.\n\nAs to love, if someone loves you, they don't say spiteful mean things in arguments, just to hurt you.\n\nMy top suggestion, before making rash decisions, is get a therapist and talk it all out. Self-esteem, boundaries, sex drive, needs in relationship... it sounds like there's a lot to uncover and discuss that exceeds the scope of a reddit post.\n\nIf you stay, you may end up missing out on life. But if you leave without addressing your self-esteem and knowing what you deserve, you might as well end up with another person who treats you like a doormat.",
            "So....you are in a domestic abuse relationship.\n\nYour issue is way, way more than his attraction to you. He is abusing you. \n\nThat's what you have your head in the sand about.",
            "If a friend told you this was happening to them, what advice would you give them?",
            "Please put yourself and your happiness first and leave this man. You deserve someone who treats you so so so so much better than this. I know it's hard. And scary. And terrifying. But you don't deserve how poorly he treats you and makes you feel about yourself. Please, love YOU. YOU CAN DO IT.",
            "He sucks and the adhd and depression aren't excuses for being abusive.\n\nI wouldn't continue,  you deserve more than this selfish sad attempt of guilting and hurting you.",
            "I think the rest of the comments will direct the point to the fact that no one who you love and who loves you should be saying things like calling you disgusting, and that that is unacceptable. \n\nIn the same vein, however, i understand your feelings of loving each other and being loyal to one another. I also understand sexual incompatibility. It's a lengthy and difficult subject, though, and it has so many gray areas and gradations- because even though at the same time as the fact that he shouldn't be insulting you exists, there are ways to coexist with each other in relationships where sex is not frequent. The best I've seen this is described by Dan Savage (his podcast, Savage Love, is awesome, I recommend it) as how to 'stay married and stay sane,' as well the the enm (ethical nonmonogamy) idea, which he proposes. It's not for everyone, but it could be something for you to try- if, as i say, you work on the issues of him insulting you/and you not pushing back.",
            "Leave him. That’s what I would do. \n\nThere are plenty of great men out there. It would seem to me that he used you from the very beginning. Perhaps he does love you, in his own way, but not in a marriage way.\n\nMeet someone else, when you feel what it is like to be truly loved and cherished, only then you will realise on what you have been denied for so long. Be true to yourself.  \n\nI wish you well",
            "I was in this same relationship recently.  Almost as tho I had written this myself\n  I left that man.  He didn't love me.  Or himself.  As it turns out i didn't love me either because I let someone else tear me down.  Advice? Love you.  Own your responsibility in this mess and grow and find someone who sees you.",
            "The problem with all modern relationships is the same problem we are having with our relationship with our planet, they are unnatural. This problem is probably something that most people do not understand or want to follow. No one person will ever be perfect for any other person. You'll relate in some areas but not in others, and that is OK. However, when this unrelating comes to sexuality, it is a significant problem that is at the core of why people couple in the first place. The drive, the natural drive for coupling, is to have children, not merely friendship. You don't need to marry a friend; the whole idea of marriage is doomed to failure because natural desires are forever changing, and the inherent need to help many species, including ours, evolve is rooted in diversity.",
            "My partner and I have sex VERY seldomly. I am talking like, once every couple of months (just as you). Whenever I do try to initiate, he declines. The difference for us though, is that he dotes on me. He calls me during the day just to tell me how wonderful he thinks I am, how much he loves and values and appreciates me and everything I do... etc. This is some of what makes a seemingly sexless relationship something that I can live with for the rest of my life (there are many other wonderful aspects of being with him that add value beyond what sex can offer for me). Sex is not everything, but it is definitely *something*. For some, no sex is a no go. I have learned, however, that before sex must come respect.\n\nIt is not just about him \"not finding you hot\" OP. This is about his complete disrespect towards you as a person. Texting other women? Saying those horrible things to you? (Yes, we ALL have said shit we didnt mean to in the heat of the moment so forgiveness would be an option were this not one piece of a larger picture).\n\nSomeone else in the comments said that the way he is towards you is not how a \"best friend\" treats you... this is absolutely true. Honestly, this is not how any person should treat another.\n\nThere is always the option of couples therapy but the issue there is that therapy wont fix a lack of sexual attraction if the issue is that you are \"not his type\" (whatever the hell that means)\n\nOP, you are going to have to make a decision. You are both in your prime. His sentiment about \"getting old and ugly so all that really matters is love when you get to that age\" is correct, IMO. Do you want to be with this man, in this relationship, for the rest of your life? When we die, non of the physical or material things go with us. Everything tangible is gone. I believe that the only thing that matters when we die is, did we live a good life? Were we happy?  Did we have fun?\n\n*OP, are you truly happy?*",
            "My heart is breaking as I read your post. Do not stay for comfort. If you are strong enough to leave I would. You are worthy of being adored and worshiped. That is not far fetched. You are still young and have a lot of time left. You deserve to have butterflies and see someone eyes light up to see you. Never settle for less then you deserve. If this guy is supposed to be right for you perhaps a break would help where he could see the impact of life without you and maybe adjust. But you can not change anyone. I think you’re writing this because you already know it shouldn’t be this way. I’ve felt this way in relationships as well and it  continually hurts—- these feelings will always remain. Take a chance on you. Love yourself a fraction of how you love him. Be brave. Put yourself first. I’m so sorry you’re dealing with this. It is not a reflection of your worth. Breaking a heart is never easy. But you can’t wait around for it to be broken every day or every week. Big big hug. I’m proud of you for coming this far. Most people can’t admit that maybe they made a mistake. If it’s meant to be he will be there a year from now. I believe in you . Whatever you desire is waiting for you.",
            "Believe people when they show their real selves. He didn't bring up lack of attraction to you lovingly - he uses it to hurt you when he is angry at you. Someone who hurts you on purpose doesn't care about you, no matter how much they claim to love you.",
            "This isn't really an issue of whether he is sexually attracted to you, this is a modern porn problem. Classic. Please do some research, you will find out this is so completely NOT your fault. These things are becoming textbook, and your situation fits the bill.",
            "The biggest problem is a complete lack of communication for you both. The second problem is your deep insecurity. You have to work on those things or you won't be successful either as a couple, or with anyone else. \n\n\nSex is a skill like everything else. It's not hard to learn, and it's fun trying. Don't be intimidated. If he loves you, then try to make it happen. Maybe that will cause a better relationship to happen. But I do suspect that the damage has already been done. He has hurt you, and you continue to allow it.",
            "If you want to put more into this relationship than you already have,I'm going to recommend couples counseling.  I don't like that he calls you fat, says you disgust him sexually, etc. \n\nIf he won't go to counseling, go on your own.  Have the counselor help you reclaim your self worth, because this guy is slowly taking it away from you. \n\nI can't imagine what it would be like to have a husband who said things like that to me. It's demeaning and flat rude. This isn't a picture of a great relationship. I think you really need to examine if you want to put up with this behavior any longer.  Don't focus on time investment...that's pointless when it comes to your happiness in life.  \n\nYou deserve someone who values you in ALL ways. You deserve to be happy in all facets of the relationship.  There are always disagreement here and there in relationships, but they should not involve name calling.",
            "I'm going to give a benefit of the doubt and assume your husband has had his own struggles. As someone who understands what it's like to have ADHD, getting bored and having childish emotional outbursts isn't uncommon. It could explain a lot of his hurtful comments and depression.\n\nBut what he said and how he treats you is undeniably cruel. So I'm obviously unsure if this relationship is worth saving.\n\nIf you still love him after all this and if he is willing to do what it takes to work things out with you, I think you both should try couple's therapy. The issues here are clearly above reddits pay grade. I know this because I recognise myself in your husband and have similar issues with my own relationship.\n\nI hope you do read this and feel free to DM me because I have some experience with a very similar relationship issues.",
            "Do you really want to spend the rest of your life knowing that your partner isn’t attracted to you sexually? That your partner disregards your feelings? That he blatantly puts you down when there is an argument? \n\nYou can love someone very much, and not spend the rest of your life with them. You are not stuck to this person. It’s your choice from here. \n\nYou can either stay and live the rest of your life knowing the person you are bound to does not respect and appreciate you entirely, or you can move on and find someone who would treat you the way you deserve. Because there are millions of men who would find you incredibly desirable. I guarantee you that. \n\n\nI hope this doesn’t come off harsh, I just have been in your shoes. I (F/23) found out the man I had been with for almost two years was cheating with transgender females. When confronted, he admitted that that is what he is attracted to. He was just too embarrassed to ever act on that. It explained a lot, and regardless of how painful it was for me, I could never be that for him. I’m now in the happiest, healthiest relationship I’ve ever been in. I want that for you too.",
            "Look up narcissism with the dude. Not saying he has it. But you mention some red flags in here that make me think he’s really mentally cruel to you as well.",
            "If you both struggle this much communicating about sex after years of being together, there is no way everything is rosy outside the bedroom. This is a symptom of a broader problem. \n\nYou didn't mention anything he brings to the table. Does he provide you support? All we can see from your post shows is relies on you a lot emotionally and he's mean when you guys are fighting. I don't understand how he makes you happy other than providing minimal companionship. If he can't reciprocate oral, he probably doesn't pull his weight in terms of chores, being romantic, etc. He just doesn't even sound like a nice person.\n\nLoving partners intuitively know each other's physical insecurities and never hurt each other by pointing them out even in the heat of an argument and certainly not in the way he did. \n\nHe could say something like, \"I care about you a lot and want you to live a long healthy life and I also want to improve myself for you, so I got us a membership to this beginner level fitness app. We can do the exercises together!\" He doesn't want to work on himself, but criticizes you? Wtf? Also, never reciprocating oral is very selfish. I really struggle to see what redeeming qualities he has! \n\nHow is communication outside the bedroom? Do you guys have shared hobbies? Do you go on dates? Snuggle and hug a lot? Is he affectionate? Do you have long, meaningful conversations that aren't just about his day and how he's stressed out?",
            "Even if he's not attracted to you, it doesn't sound like he treats you decently when you have fights.  For example, when my wife and I have a fight and I feel the urge to say something mean, I excuse myself to go calm down and collect myself rather than blurting out whatever comes into my head.  The things he is saying to you aren't constructive, they are cruel.",
            "Sounds to me like your husband has been lying to you the entire time you've known each other and he's stolen years of your life away from you when you could have been having great sex and finding actual love. Your marriage is a lie.",
            "Why would you want to stay married to someone who treats you with such disdain, and insults you during arguments? You've settled for his shit long enough. You deserve, and can have, so much better, if only you'd not be tied to this jerk.",
            "OP, I’m so sorry, but you need to get out. It might seem scary to do it now but it’ll be harder if you drag it out. He’s not healthy for you, and he seems like an unkind person. None of what he’s said is ok. In fact, it’s emotionally abusive.",
            "Check out r/dead bedrooms. There are lots of people with experience in your situation. It's helpful to know you're not alone.",
            "My brother married a nice gal in 1976. She worshipped him. Before her however, he dated beautiful girls- but those girls expected partnerships, and had opinions of their own. Throughout these years- she’s stuck with him. Through his affairs (and through an employee’s child that we all think is his) she’s continued to think he is wonderful or she’s quietly learned to live in denial. It’s her choice. I always thought that she should dump him, but it’s her life.",
            "That's a big cup of nope. Cut him loose or cheat on him and get your needs met.",
            "You need to ask yourself if what you have is good enough for you! You love him, you are attracted to him but can you be ok with the fact that you are not his type? \n\nHe shouldn’t be dogging you like that but I guess when he’s mad is the only time he feels comfortable enough to tell you the truth. Telling you that you disgust him is really harsh tho, so clearly y’all have problems communicating. \n\nGood luck! If you decide this is what you want, the both of you need to put in a lot of work but I’m telling you now, the feeling of knowing your significant other is sexually attracted to you just adds so much more to the relationship. In the back of your mind you will always feel like you aren’t good enough and no one should feel that way, especially not with the one person you choose to spend your life with.",
            "This reminds me of my sociopathic ex - how he’d say just enough to keep me hooked but proceed with life without any real care in the world \n\nStrongly recommend you look up symptoms of sociopaths, narcissists, abusers \n\nIt’s possible he has a mental problem or is one of the above and it’s just convenient for him to have someone who dotes on him take care of him\n\nI’m so sorry but there is so much more out there if you think you can’t get past this\n\nYou deserve someone who doesn’t lie",
            "I think him lying to you your whole relationship matters.",
            "Throw the whole man away girl.",
            "This sounds exactly like my first marriage. \n\nAfter I left and he realized life would be harder without me around and wanted me back. He cofessed that he started watching porn with morbidly obese women because if he could get off to that he would be able to find me attractive. \n\nI'm not thin but I am nowhere near morbidly obese. This is the same man that told me that his ex-wife was the prettiest woman he had ever been with.\n\n He wanted the comfort that I brought to his life and somehow thought that would be enough to make me stay. I wanted to be loved and happy.\n\nI left and found a man who truly loves me for me and we are expecting our first child this year. \n\nOP, you deserve someone who loves all of you, not just your love and the attention you give them.",
            "I'm not great with advice or anything, but I seriously couldn't imagine being in a relationship with someone who doesn't find me attractive or whom I'm not attracted to. That's the defining part that makes it different from just being roommates...",
            "It’s genuinely not fair that he kept this from you. If he felt this way, a discussion needed to happen. You need to ask yourself if you’re okay with not being attractive (only in his standards). \n\nPersonally, I believe attraction is a big part of the relationship. Your sex life is going to continue to suffer and you’ll only get more insecure.",
            "Move on now!! Never be with anyone that is disrespectful. Degrading comments are not acceptable. Go find a loving, accepting, happy and hungry for your body Man ❤️",
            "Op, People who care about you don’t exploit your insecurities even when in an argument!! \n\nMy spouse is super insecure about his intelligence, he was stuck in special needs classes instead of English as a second language which in the 80’s in my country kept you away from the general population of students and gave you the bare minimum of learning which ostracized him/others from the rest of the kids at school. (This no longer happens thankfully) We were joking around one day and I joked about him being stupid  and it crushed him even though it was a joke, I spent a month making it up to him, pointing out all the languages he speaks (I speak one), what a skilled Carpenter & painter and such because I love him and never want him to feel like he’s stupid.\n\nI can’t even imagine saying that to him in an argument, that’d be unforgivable.",
            "Its never too late to start getting in shape. Reel him into it and it can be a way to improve your lives massively",
            "Sorry to be so blunt OP but the chances of him not cheating under the circumstances you've described are absolutely miniscule in my own humble opinion.\n\nI mean no disrespect but would hate that to happen and hit you out of the blue like it can because that shit turns your world upside down.\n\nHe's been very disrespectful and hurtful towards you which doesn't tally up with the fairytale true love and friendship relationship that you describe either.\n\nIt's a horrible situation to be in and I understand how much easier this is to say than to do in your shoes. This isn't going to end well OP and you'd be better getting ahead of it and taking control rather than waiting for it to ruin you emotionally and losing the strength to cope when it all lands on you.\n\nSorry for the bluntness but you asked a question and this is my honest opinion. Good luck to you OP, whatever road you choose. You seem like a good person.",
            "He sounds more like he’s abusive than not attracted to you. And if he’s not attracted to you at this point, it’s because he’s abusive.\n\nLemme explain.\n\nThere was an initial attraction. You wouldn’t have started dating if there wasn’t, right? \n\nAlso, abusers love to tell the abusee that they are unattractive, because it keeps them down. It keeps them feeling inadequate, and vulnerable to the abuser. It’s a control tactic. \n\nAnd at this point, if he isn’t attracted to you, it’s not because he chose to be with someone he isn’t attracted to. It’s because he has so little respect for you, after years of putting you through abuse, that he isn’t attracted to you. Which, by the way, isn’t your fault. People don’t know when they’re being manipulated, for the most part, that’s why it works. \n\nAnyway, I think you should leave him. Seriously. You’ll be surprised by how hard he fights for you. Even if he doesn’t, you’re better off. But he probably will. You’ll learn that he needs you much more than you ever needed him. You’ll come to learn that, this wasn’t you. It was him controlling you, by making you feel like you aren’t enough for him. \n\nYou’ve already spent 7 years with this garbage, get out and find someone who appreciates you. You’ll find it. And you deserve so much better than someone like *him,* who is so insecure, they have to make their partner feel like they’re less than good enough.",
            "I happened to leave my ex-wife(36 at the time) when I was 37. We had a good relationship in so far as there was love and intimacy and friendship but there was definitely a spark missing as time went on. It sounds to me like you both have just allowed yourselves to enable each others comfort and complacency. There are always excuses for this - i'm too busy or tired for sex, i don't have enough money to do this/that, why go out and talk when we can just watch tv all night. Being content and being complacent are very close cousins and one is very toxic for the relationship. \n\n&#x200B;\n\nI do believe someone had to be honest and if he says hes not attracted to you overweight gain - its harsh but at least he's not hiding things from you or perhaps looking for something thats missing in other women. But this is an opportunity for you both. My ex-wife and I both had unhealthy habits for a while but I started to exercise and improve my health and she didn't. As my habits changed, we grew apart and ultimately met our end. You two should both take this opportunity to start meaningful investments/changes in your relationship. I did lose attraction to my ex as I started to improve myself internally and externally. I would start to get attention from women I didn't expect and it was certainly one of the many wedges that drove me and my ex apart. I have honestly wondered if she just joined me on my quest to self-improvement, would we have ever broken up......but all of these issues are chances for you to start to make the changes that will help you. It will be slow and it won't always be easy but when you start seeing those results, you'll be in a better position to figure out if what you're doing together as a team is still working or not.\n\n&#x200B;\n\nI do believe that \"lust\" matters and that your partner should absolutely *want* you because intimacy is incredibly important. Even as our relationship was souring, I still managed to have sex with my ex-wife at least once a week. In my current relationship I love my girlfriend so much that we had sex almost every day at the start and almost two years in, we still have sex multiple times a week.  He will want you more in time if you invest in things that matter and if you do them together.",
            "this man is not acting like a partner or even a friend in any way.",
            "There is a LOT going on here. The smallest of which is actual physical attraction. Your husband has a lot of signs of a sex addict. Which can include porn addiction. It could help provide some framework for why he lashes out when you bring up the lack of sex. Or perhaps he’s just an emotionally abusive jerk.\n\nIt’s not okay to call names. Love doesn’t include shaming, blaming, or name calling. It sounds like when you two have conversations where you attempt to address your needs that he becomes verbally abusive. That’s not love.\n\nOn a more personal note, so much of this sounds exactly like my marriage. Perhaps so much so that it could be clouding my judgment but it’s just spot on. Except the verbal abuse. My spouse was/is a sex addict. As I got healthier emotionally it became impossible to have a healthy marriage. It didn’t work out. \n\nI think the bigger question isn’t about how to have a relationship with a man who isn’t attracted to you or is unable to love you fully but rather WHY YOU WOULD WANT TO BE WITH SOMEONE THAT CAN’T LOVE YOU? My heart hurts for you and I wish you the best. It might be time to do some soul searching and maybe some therapy.",
            "The real question you're asking is not \"does this matter\", but \"does this matter to me?\". Every relationship is different. Only you know what's right for you. Having said that, sex is such a part of our lives. There's a difference between accepting imperfections and being outright disgusted. That's... quite extreme. Are you ok with that?\n\nAm I'm very sorry you're going through all this. That's fucking terrible.",
            "He's not your friend. Friends don't say shit like that to each other.",
            "He is not a good person. You have to make a choice. Do you feel the way he does? Is your love for him, and vice versa, enough for you? Or do you need more? Do you think you will be able to continue like this without being hurt? You may have to keep killing your desire. If yes, then continue in this marriage. If no, then leave him and look for love and desire both. \nIf he is not attracted to you, he will not be unless you fit into his idea of ideal body type. Do you want to do that? If you too want to do that then you can work towards. But if you don't want to, please do not do so for his sake.",
            " \"*if you want to know why I've never given you oral it's because you disgust me sexually*\".\n\nI'm sorry, you're STILL married to him after he said this to you?",
            "Oh Op, you deserve to find someone who love you back truly 100%, who doesn't call you horrible names but who does communicate and who does try. You know he won't work on your sex life, just the way he hasnt in all of your time together. You deserve to be loved.",
            "Leave him! You deserve a love life filled to the brim with passion, and there is someone out there who can revel in lust with you!! I’m sorry this man has been so shitty, but the problem is not you at all. Leave him and rediscover yourself, and have alllll the wonderful life experiences.",
            "Very few people end up with their \"physical ideal\". He's not attracted to you and you're not okay with that. You know what you need to do. There's people out there who would find you irresistible and treat you right. Go find them.",
            "He's an emotional vampire, he sucked out everything he needed out of you, but gave nothing in return. And on top of that, he denied you of emotional and sexual needs for years!  \n\n\nI've been in similar situation like yourself, except the sex was good, but that wasn't enough. I avoided to treat my depression because I had feared my sex drive would've suffered, so I lost myself and self-respect. I gained a lot of weight, my life was a mess, and my ex ditched me as soon as he found a suitable replacement for his ego boost. Fast forward to present, I've never felt better in my life, lost all the weight and getting close to my ideal size. Life is good again.  \n\n\nThe best advice I got, and it has been my mantra past two years: take care of yourself; you and your needs are the most important things for your well-being. Sex is important, and you shouldn't sacrifice it! You are important.",
            "Love you deserve someone that is loves all of you. Body, mind and soul. Settling for this kind of relationship is doing yourself an injustice. I promise there is someone there who is going to not only appreciate you as a companion, but also as a woman, whether you're overweight or thing. Coming from a woman who is heavy (BMI 35) My fiance has never been as cruel as your husband is and always treats me with respect. You, and every other person out there, deserves that. I hope you find someone who loves and appeciates you and that you don't settle for less than what you truly need, on every level of a relationship.",
            "Lust matters...if it matters. It sounds like it matters to you, therefore his lack of lust does matter when you're evaluating whether you want to stay with him. But I think the more immediate problem is how he speaks to you when you're fighting. He says awful, super hurtful things and then later claims he didn't mean it. Whether he meant it or not he's saying it to hurt you. That's unacceptable. If you want to work it out with him you're both going to need to learn how to argue in a productive way that doesn't involve saying harmful things to each other in the heat of the moment with the sole intent to hurt each other. \n\nIt sounds to me like he's consistently ignoring your feelings, not just when arguing, but when you're trying to talk to him about your sex life. \n\nI think you need to talk this out with a professional to parse out what you want and if not getting that means you leave him. And if you decide to stick around I think the two of you could benefit from talking to someone together, at least to learn the proper way to argue with someone you love and want to be in a relationship with.",
            "i was in this position before but i was your husband. first of all i grew very resentful and i constantly had a wandering eye. i NEVER wanted to be intimate and saw it as a chore that i was grossed out by. i broke up with him after only a few months though. i cant imagine MARRYING someone im not attracted to. you deserve WAY better than this.",
            "I....barely have any words for this. I am so truly sorry, OP. Do you have self esteem issues or have you grappled with abandonment issues in the past? I don’t know you could have existed in this relationship for seven years when he clearly doesn’t treat you well and has said vile things to you in the past. Also the whole “we’ll be old and unattractive anyways” comment!? You’re a 36 year old woman! People have sex very late in life. You should drop him like a hot potato. Find someone who is worthy of the love you are so clearly capable of holding for someone!",
            "So I think the real question here is: Does it matter to *you*?\n\nIf you want to be with someone who wants you and tells you all the time that you're sexy and buries his head between your legs because he loves giving you pleasure- it's out there for you, babe. You might have to get back in the dating scene, and that's going to be its own sort of learning curve, especially after being married for so long, but if you want lust and passion and sweaty ball slappy monkey sex, you can absolutely go find that.\n\nIf you want to be with someone because you're comfortable and he makes you feel safe (though because of what you've said, I find that hard to believe) and you want to make it work, then I encourage you to invest in a nice vibrator, and then communicate clearly about y'all's sex life (birthdays, anniversaries?) and quit fighting about it. \n\nIt doesn't sound like you're happy. And if you're not happy you need to decide if it's worth it to you to go out and find that. \n\nMy fiance tells me all the time that I'm his kink, and he wants me all the time. It makes me feel sexy and empowered and powerful. We have a beautiful, intimate, sweet sex life and I feel like it adds so much to our relationship- we have entire conversations through touch sometimes because we want to be in each other's space. My dad made a point to let me know he was still having sex when I was an adult. Supes gross. And it's not like you get old and wrinkly and unattractive when you get old (Josh Brolin? Helen Mirrin? Streisand is almost 80.) I want to be with someone that digs me, not someone who tolerates me physically til he gets too gross to be with anyone else. \n\nIt sounds like you guys need to do some real assessments about what you want out of a relationship, and what you're willing to tolerate from your partner. If you want passion, you can go find it. If you want safety, I encourage you to do some counseling with your partner.\n\nAlso, I know that objectifying women is gross- but to give you some context, I encourage you to check out r/chubby to see what it looks like when a man is into you v. doing you a favor.",
            "> I'm so confused and I'd hate to make a mistake and get divorced from someone I really love just because he doesn't find me hot. \n\nInstead of looking into whether you are his type or not, I'd say you should look into why are you two married in the first place. Attractiveness can only hold for so long as beauty fades eventually for both people. There should be some other qualities that keep you both to stay together.",
            "I learned much later in life that we can't never ever let anyone disrespect us like this, let alone a partner. The way he treats, just calling you disgusting sexually is already enough to know how little he cares about your feelings. Words like these have a long lasting if not permanent damage to the self steem. When I argue with my fiance, no matter how mad I am, I always have in the back of my mind that I love him and that we are a team. Do yourself a favor and leave him. There is so much more to a relationship than what you're getting.",
            "Wow. The man that's supposed to love you is using your body as an insult.",
            "Please read your post again, but pretend it’s someone else who wrote it, someone you love, a future daughter, whatever works. \n\nHe belittles you, insults you, and has texted other girls (cheated on you, even if only emotionally). \n\nYou don’t deserve this. \n\nI know you love him, and friendship, I’d argue, *is* more important than lust in marriage—but friends don’t talk to friends this way. I promise, they don’t.",
            "He’s not your friend. Friends don’t call you fat. Friends don’t say disgusting things they later apologize for. The apologies are bullshit because he never should have said those things in the first place. \n\nDivorce him. Find a man who’s just as into you as you are to them. They exist. You don’t deserve this life.",
            "Go to marriage counseling and get some professional perspectives and insights. If it is not healthy for either one of you to continue then you can certainly come to this conclusion together with the help of a professional guiding you and helping to avoid extra drama, ideally.",
            "Just my 2 cents.... Leave. You know this is not what you want. I will go so far as to say you KNOW this is not what you DESERVE. You deserve to be lusted after and desired by your partner. The real question is can you live the rest of your ‘precious’ life not feeling beautiful/desired by your husband with little to no sex? That doesn’t sound like a very fun time to me. You can find someone who is willing to give you what you want, because frankly what you want is not unreasonable and any man who loves and desires you, will be happy to give it to you. If you feel you need to lose weight or maybe get a new makeup/hair routine then go for it. That may fix the issue or it may not... If it doesn’t please realize you need more out of a partner and put in the work to get what you really want. It’s worth it in the end, and you’ll be happy you did. You can do it. Xoxo",
            "wow, you really answered your own questions. of course sexual attractiveness matters.\n\n it's time to let this guy go.  He's one of these guys who can't break up people and he let this relationship go too far. it's incumbent on you to take action",
            "This is why I disagree with people who downplay the importance of attraction because they don't want to be shallow. But in the end it can often hurt the people we love. \n\nI am fat, I am a BBW, but I have sex almost daily and my husband finds me hot and sexy because I am his type. What if he married an athletic skinny girl. She wouldn't feel sexy to him and that can hurt. So let people be with those who find them sexy as it creates an overall better life to get the friendship and to get the sexual romance. \n\n\nAlso, discuss sex! Talk about your insecurities, your desires, your fantasies. That is healthy between adults. If someone makes you feel bad about your sexuality, then they probably are not the right match for you.\n\n\nOP, I see two options. A. Dump him, B. Explore polyamory. \n\nIf your life is otherwise good and he treats you well (be demanding to yourself and expect actual good, don't settle), but the only thing lacking is the sex, then maybe an open relationship could work. You can build your life together financially and emotionally, but at the same time find space to explore your sexuality. It is not fair to you that your partner lied to you and prevented you from exploring your sexuality. Find a boyfriend who finds you sexy. Read books on polyamory to find out the best ways to approach it healthily.",
            "It sounds like he’s projecting a lot of his sexual frustration and insecurities onto you in a really fucked up way. Of course everyone is going to suggest you leave him because his behavior sounds manipulative, narcissistic, and just plain mean. But if you’re in love with him and are already married...easier said than done. I would go see a couple’s therapist at least.",
            "My marriage was like that, my husband always blamed me for our awful sex life, I could never figure out why it was so bad, he was “into me”\nOr so he said, I was cute, sexy, funny, an all round good package, he initiated sex a lot but was really selfish, he would tell me I was the prettiest girl he’d ever seen, then compare me unfavourably to other women, lean beach babe types, I’m a redhead with porcelain skin & freckles, cute freckles sweetly plump like Marilyn. \n\nI would try to talk to him about our sex life, about how it should be a shared pleasure not just all one way (his) he would get angry, accuse me of wanting to cheat, I lost interest in sex, it was So unsatisfying for me. I was 21 when we married, He was 6 years older than me & claimed to have lots of experience.\n\nI was young & naive when we met, I had just moved to the city, I still had hay stalks in my hair.\nDuring our marriage he became verbally then physically abusive, blamed me for everything that went wrong, refused to accept that our sex life sucked because he was, selfish & lazy. He would watch porn & expect me to behave like the girls in the videos. That was a hard no.\n\nWe eventually divorced , & I found a nice man , a man who DID care about my pleasure, he was 5 years younger than me, we had an awesome sex life, it was lust & it was wonderful.\n\nI would Never again tolerate a relationship with awful sex. \n\nYou did not sign up for a marriage devoid of sexual pleasure for yourself. He’s a jackass, a selfish jackass.\nTime for the two card deal, tell him he comes to marriage/ sex therapy with you or you’re walking out the door.",
            "I don’t think the lack of sex is a problem. However, just like many other pointed out the way he talks to you definitely is not okay.",
            "You think the problem is that he isn't attracted to you. The problem is that he doesn't respect you.",
            "Sounds like he’s settling and complacent, and instead of being honest with you, he lied constantly so he can have you and be comfortable and happy with you, than talk to other women and use porn to get satisfaction on that end. \n\nIt’s extremely dishonest of him to do this. Its fine if that’s what you both wanted. But. Not if he’s lying to you and pretending it’s something it’s not.",
            "Honey. You deserve so much better than this. I’m sorry. I’ve said this story before but my ex gained 50 pounds within 6 months of our relationship. Two years in he forced me to get on birth control and I gained 30 pounds. He went on and on about how my weight was unacceptable and he wasn’t attracted to me anymore. As you can tell the relationship didn’t work out. The double standard is gross. The fact he strung you on for several years and through a marriage is gross. You deserved to be loved and adored as a whole person, not to be with someone who makes you feel inadequate and less than because of your weight.",
            "This is not love, not even close.",
            "These are not the actions and words of someone that loves and respects you.",
            "Obviously the things he said, even if he didn’t mean them, cannot be taken back. But this sounds like a desensitizing pattern that he’s gotten himself stuck into that sadly many women (and men actually) can’t wrap their mind around unless they’ve experienced and recovered from it. I can almost guarantee if he stopped watching porn and spoke w a sex therapist his sex problems would improve. Men will flail at a reason why their dick isn’t working appropriately and the frustration will cause them to lash out at their partner, thinking they’re a contributing factor to the dick problems. I doubt he’s cheated physically. He’s probably attempted attracting some new new in hopes that the novelty would turn him on, but it won’t work. \n\nThe bigger issue is of course never performing oral on you. That’s terrible. And I’m not anti-porn at all, but there’s no getting around the fact that the constant novelty of trillions of videos of strangers banging can desensitize your body to ACTUAL intimacy. Imagine conditioning your brain to feel turned on by just sitting there staring at a screen and then orgasming, and then trying to mix in sex where you have to actually physically do something to ejaculate. The human body is obviously going to be like, no, fuck that, where’s the strangers having sex on a screen. What’s worse is that when dudes have this issue, their partners will almost always bend over backwards to blame themselves.\n\nAnyway, hopefully he sorts that out and hopefully you leave him.",
            "That's a lot of horrible things for someone, who is supposed to love and support you, to say. You can do far better than him.",
            "Does your husband use porn? I'm a counselor and I see this happening in other relationships on a regular basis.",
            "I was with a guy for two years who was very similar. He was heavily addicted to porn and had ED. He never really initiated sex and we would only have sex when I initiated that would last 1-5 minutes.\n\nHe was a very intelligent and romantic man. He always blew me away with grandiose gifts and compliments.\n\nEventually I tried talking to him about taking viagra or cutting the porn addiction. He would always get offended and act like he didn’t have a problem.\n\nI also found messages from him to other woman and customized porn content from women off of reddit. :(\n\nWhen we broke up I told him it was only because our sex was nonexistent and I needed to feel wanted.\n\nHe said that I stopped sucking his dick and climbing on top. That was the only way I could get him to have sex and I decided that I wasn’t going to put up with it any longer.\n\nHe was my best friend and it still hurts to this day because I do miss all of our deep conversations about life. But it really isn’t fair for you to have to pine after a man. The attraction should feel equal.\n\nThe shitty thing is that all the porn he watched was of tiny white chicks and I am a very curvaceous Latina. \n\nHis new girlfriend fits his preference and I sometimes wish he would’ve just told me he wasn’t that attracted to me from the beginning.\n\nI would get out of this situation while you can, either that or give him a hands down approach to what you need out of the relationship and give him a time frame. If he doesn’t comply then you need to cut ties and find someone that wants you as much as you want them.",
            "Honey run and work on yourself and on your own happiness, why are you keep trying to make it work when is obviously that it never will. To many years lost already, take it as a learning experience and run",
            "Honestly, so many of your words remind me of a past relationship. \n\nThe hurtful words when he was mad, the “not my usual” type, the depression. \n\nIf you’re anything like me, separating will be a weight lifted.",
            "Attraction issues aside, this dude is frequently pulling your appearance into fights in order to tear you down, then love bombing you afterwards when you call him out on it. Personally, I'd never tolerate this kind of behavior from a partner. As soon as he pulled that shit he'd be out of there. He called you disgusting? Who the hell does that? You deserve so much better.",
            "PLEASE leave. You will spend the rest of your life unsatisfied and feeling terrible about yourself. You deserve so much better. Leave and seek counseling to help you heal, and try to keep your head held high. You are wonderful and someone will love you and be attracted to you, and care about your pleasure and happiness.",
            "Reading your post was like looking into a mirror of my past... my relationship with my ex had a lot of the same symptoms as your current one: me being head over heels while he was relatively cool, an extremely short \"honeymoon\" period followed by a nearly dead bedroom, me putting all of my needs on the line to support him fully, and him being sexually greedy when we did do anything, and me willing because it was the only time I felt we were being intimate.\n\nHe also texted this other girl and watched a bunch of porn and tried using porn techniques on me... all while claiming he was never in the mood to account for his supposed low sex drive!\n\nPlease, for the love of god leave. You deserve so much better. I hate reliving the nightmare of my memories but I'm coming out of the woodwork to give you support and reaffirm you. I also used to think things would get better with age, but it really hit me when we were talking about kids that I did NOT want to raise children in an environment devoid of healthy love and happiness.",
            "I was in a similar situation years ago. My (now) ex and I had moved in together in our early 20s and we would rarely have sex, maybe once every two weeks, if I was lucky. I, too, brushed this off because he reassured me that he loved me & told me it was, in a way, my fault because I liked sex too much. \n\n\nOver the years I caught him on cam sites, watching porn after turning me down for sex, and finally cheating. All the women were not the same body type as I am-and I mean there was a BIG difference in my body type vs. what he was seeking out.\n\n\n\nMy confidence & insecurity plummeted during that relationship. And it has taken me years to rebuild it. Something I am still working on. But I’m in a great relationship now & I feel so loved AND lusted after. You absolutely can and should have both. Don’t sell yourself short, there really are plenty of fish in the sea. It will be hard, but I promise you, you will be so much happier than having to worry and be put down by this guy. \n\n\n\nSending hugs & positivity your way (:",
            "Someone who loves you but has no sexual or romantic interest in you is called “a friend”.",
            "All i see is lack of communication, now you gotta see the pros and cons and decide if you want a divorce and what that would implicate for your life from now on!!",
            "> When we met 7 years ago I had very limited sexual experience. He had plenty. \n\n>Our sex life has always sucked not because of medication or depression, but because he never was very attracted to me at all. \n\nYou're mostly going to get one kind of answer because this sub is visited by almost entirely women.  Those lines right here are why you're wrong.  Why would he want to sacrifice his sex life in the beginning when you should progress to his level?  From there you both fell in a rut because of your own sexual hangups.  If you think this is \"his fault\" then just do him a favor and separate.",
            "Someone who truly loved you would not call you “sexually disgusting.” You deserve better, sexually but also emotionally and practically. Your current husband’s verdict on your attractiveness or sexuality is not some kind of absolute- he sounds, frankly, extremely immature, cruel, and however many partners he may have had, his “sexual experience” has clearly not gone very far in making him a good overall partner or a good lay.",
            "I may be wrong but it sound more like he thinks he loves you because you're like his own personal caring nurse.  \nHe belittle you frequently, doesn't bother with how his words make you feel, have no desire for you...  \n   \nAsk yourself, would he be in a relationship with you if you weren't his mental helper during all this time ?  \nI think you deserve to be with someone who will truly consider you and your feelings in a real relationship based on communication and mutual respect, with someone you can build a future together",
            "You’ve gotten so many comments at this point that have said everything that I would have said, but I need reiterate this:\n\nFights with your significant other are normal. Occasional heated fights where hurtful things are said happen. But never, in the years of relationships that I’ve been in, have I been tempted to say the things your husband has said to you. Even when I’ve been at my absolute angriest!!! Attacking someone’s physical appearance and saying something as hurtful as “you disgust me sexually” is dirty, low, and just flat out sickening. You don’t say things like that to someone you love. End of.\n\nAnd the things that he’s said don’t just slip out. He’s obviously been harboring these feelings about you for some time. In all honesty, no matter how infatuated I were with someone, I don’t think I’d be able to accept an apology over those comments. What he said would sit in the back of my mind and terrorize me from then on. Doesn’t it do that to you? \n\nPlease take a look at your relationship with him and really think about whether or not he’s worth it. Just because you’re married and in your late thirties doesn’t mean shit. It’s never too late to start over and have a shot at an amazing relationship that you’re potentially missing. If he doesn’t value you, someone else will.",
            "He's said a lot of things to you that are not acceptable. Please take note of that. \n\nThat being said, my wife is also an insecure lover, and I am the experienced one. I will be honest, she is boring in bed, so no, I don't go out of my way to initiate. Masturbating is often more \"fun\". We have sex like every 2 weeks.\n\nAnd this is okay for us. She will never be aggressive and adventurous in bed, and That's okay. I love her 100% anyway, and I absolutely enjoy the connection when we make love. \n\nBut when I feel kinky, she's not what I go to for that.\n\nIt is possible that he enjoys making love to you, but knows you won't fulfill the more adventurous part of his mind.\n\nEdit: oh shit, I missed the part where he called you sexually disgusting. Oh man. Yea, you deserve someone that loves your body. My wife may be very vanilla in bed, but I am very attracted to her.\n\nI hope you find happiness",
            "Leave him. You deserve someone who gives it all to you and you can do the same for them. Of course sex isn't everything but it feels like he settled, and you shouldn't settle either.\nI know it's not easy because you love him, but it sounds like this is a relationship that takes a lot of work. Sometimes, love isn't enough. \nPlus, he's disrespectful and kind of an ass.",
            "It's not just the sex and not just physical attraction. It simply isnt. \n\nIt takes love, trust and respect for a great relationship. If those, love is probably the least important because it's the one that can most easily be built up.  Does he respect you?  Do you trust him? If your answer is no or you're hesitant to say yes, do you feel you're both willing to put in the work?",
            "He’s mean and only a mean person would marry someone they weren’t attracted to. There is nothing wrong with you and someone out there loves your body. You deserve to find that person. Why would you want to be with someone who talks about your body like that?",
            "This is sad. If he hasn’t been attracted to you for the past seven years, he never will be.",
            "My petty advice would be revenge bod divorce! But honestly I don’t see how he can make you feel bad about yourself when he isn’t in the best shape either. Sometimes I think it’s easier to blame the other person in the relationship but it comes down to you as well. He should ask himself how he feels about himself and you should take some time to reflect on the same. Clearly you’re not happy and it’s weighing on your confidence. Personally it’s not way to live a marriage life I think you deserve better regardless of shape, size, or type of beauty no one deserves to feel unloved for who they are. You should feel loved by your partner regardless of your flaws.",
            "there are so many more problems in this entire marriage then sex and physical attraction. you wouldn’t get divorced just because he doesn’t find you hot, that would be one out of literally hundreds of reasons you two shouldn’t be together. sorry but how can you be so blind? your description paints the picture of a terrible relationship with a HUGE lack of communication and mistreatment. Girl, honey.. he doesn’t care about you. if he did he you would know. how can you possibly stay in a relationship or marriage like this?",
            "If you're here asking us if \"lust\" matters, it matters to you. So it also matters to your relationship. Sex is a part of intimacy and you feel it's lacking. \n\nI think you're in a position that a lot of people find themselves in. You love your partner and your relationship isn't completely awful, so you kind of want to stick with what you have. \n\nIf you leave, there's no guarantee you'll find true happiness, but if you stay it's guaranteed that you won't. I you're still in your 30's so you still have time if you leave. Personally, I always think having a chance at real love is worth the risk and you're never going to be about to turn your current relationship into that because it was never there.",
            "I say this as someone with anxiety, depression,ADHD,and OCD... He is dependent on you. He is codependent and that's it. He doesn't love you,he's not passionate,nothing. \nI had a relationship like that and it took them becoming abusive for me to realize I was codependent. \n\nI'm in an actual,loving relationship with someone I love and they love me back. They're passionate about me and I'm passionate about them. We help each other out but we aren't codependent. We have medication and therapists to rely on. \n\n\nYou have all the power here my dude. You would lose nothing but he would lose everything... He will tell you whatever you want to keep you locked in tight.",
            "My opinion. Great sex that passion and desire are amazing things to feel and experience. It’s probably the desire for this that has people wandering on each other. The thing I’ve experienced is those that seem to be able to offer those extreme highs in the intimacy dept also experience lows in other departments. Again my experience. At 39 I found my self single again after a long marriage with a manipulative borderline disorder wife. Her highs faded and the damage had been done. But after having some fun with women in the younger side what I wanted was life long companionship. A friend  and some one that likes to be intimate as well but not the thing that drives the relationship. I realized that many things in life made me happy and liking upon one human to be the sole provider of happiness does not exist nor should it.  Love means something different for everyone. Above all things I just wanted to be treated nicely. Loved for me and how I am. I remarried a women and we mesh really well. Sex is good and regular but not the driving force of us. We have freedoms to do the things we want that don’t include each other. There is one thing that’s an issue for me on your situation is some of the mean things said in arguments. Those are bottled up feelings he has and that’s an issue. Personally I don’t think he’s your best match. At least he has remorse or says it. You can’t just discount people for feeling what they feel. They are allowed to feel how they want. But it should never be used as a weapon and you don’t have to accept it. Maybe it’s time to really consider the relationship. Good luck.",
            "You deserve someone that the very thought of you drives them wild, your husband used you to cope with his depression and is now codependent on you",
            "I just want to say, neither me nor my SO fit the other's type. But that we grew to love each other, and that includes loving the other's body. \n\nYou don't have to be someone's \"type\" to be sexually attractive to them. Just because your body isn't the initial attraction doesn't mean they can't grow to love your body too.\n\nIf he uses your body as a reason not to be attracted to you, that is a problem. \n\nBody types do effect who you are attracted to INITIALLY but if you grow to love the person that should include their body in my opinion.\n\nAlso, he sounds really shallow. \n\n>He says when we grow old we'll be unattractive anyway and love is all that matters.\n\n\nWtf? Old doesn't equal unattractive unless you are only attracted by looks. If you love someone they don't grow ugly with age. I have family members I love no where near as much as I do my SO, and I still don't think of them as ugly. And yes I'm using ugly instead of unattractive, because that's how that comes off.\n\nAlso people's looks and body change over time, do you think of your husband as fat even though he gained weight? No? Then why does he unless it is an extreme? And gaining weight doesn't effect everyone's attraction, some people it does and those are not people I want to be in a relationship but it is their call. If my SO gained weight to the point where it effected my attraction, I would be more worried about his health than the weight.\n\nTldr: Initial attraction is dictated by looks. Once you have a relationship past that he should love your body if he loves you. Sounds like he loves what you provide, not you.\n\nEdit: Also people don't say things in anger that they don't think. Just because they'd never say it out loud isn't enough in my opinion. I've gone years without insulting my SO when angry, or Visa versa. You don't magically think different ways when you're angry. If you can think that way when angry, that's bad enough for me.",
            "I think just cause you have love doesn’t mean you couldn’t go back to being friends, marriage requires intimacy. Intimacy requires sexual attraction, emotional bondage, trust, do you think you still have these things after all he has said and done?",
            "A sexually unsatisfying monogamous marriage is a poor excuse for a marriage.  Don't settle.  You don't have to divorce, necessarily (but there are some huge red flags about the way he's spoken to you and the clear lack of respect he has for you as a life partner that other commenters have addressed thoroughly)--but if you both want sex, just not with each other, you should not be forced to be celibate just for the sake of societal expectation.  You can write your own rules.",
            "Wow. This is exactly what happened to me with my ex, on lying we didn't get married. We were the same ages and same years together. My ex was exactly the the same way and our previous sexual experiences were the same as yours.\n\nMy cousin ex also said not to worry and that he loved me... Right up to the day he bumped me to try to get with my friend who also didn't want him. \n\nHe's not into you and you deserve better. He's already shown signs of cheating when he texted other women. And he's interested in sex, the porn shows that, he's just not into it with you. My ex had so many excuses as to why he wasn't in the mood but then he'd go jerk off and hide the tissues around like I wouldn't have find them while cleaning... Gross... And the moron had no idea how to clear his browser history. I always wondered why I was thinking enough. It was hell on my self esteem. \n\nThis isn't the recipe for a happy life. I completely understand how deep your love is, but you can also find someone who will love back just as much. And it's so worth it.",
            "Wow this guy sounds extremely abusive. You need out. For some people sex doesn’t matter but clearly it matters to both of you and he shouldn’t treat you like that. Fat or not you deserve someone who doesn’t make you feel bad about yourself. If he wasn’t attracted to you he shouldn’t have married you and lead you on. I’m so sorry he talks to you like this. A common sign of emotional/mental abusers is saying extremely hurtful things to take them back and be all apologetic. My great grandmother always said to not say hurtful things because you can’t take them back.",
            "I had a boyfriend that was addicted to porn, never went down on me, never initiated sex, and always made rude remarks about my body (I’m quite petite and don’t have many curves). I always faulted myself for this, tried to change, tried to do things he liked, but it was never enough. \nYou need to find someone that loves you for who you are, physically, emotionally, and all of the above. I got out of that crappy situation and am now with someone who loves every inch of me. You deserve that kind of love.",
            "It matters. YOU MATTER!  When you leave him, and you will... you’ll find love and desire that overwhelms you. You’ll look at back at this piece of shit husband and realize how much of a sad person he is. He’s using you. Fucking duck and run.",
            "I think it’s time to bounce from that relationship, especially if he’s now resorting to talking down to you and places all the blame on you, a relationship is about compromises and being each other’s support but if not then it’s like building a house with straw",
            "It's also possible that he has such a low sex drive that nobody can really turn him on. He may feel the urge to blame you because he's deeply ashamed that he's not very sexual. Watching porn doesn't mean much in this context. It may be just one way or even the only way he gets his kicks for many different possible reasons. \n\nWhatever is true, there aren't really any good excuses for the hurtful things he said.",
            "The OPs husband is in an incredibly fortunate positions in life - in this case a wife who is \"gaga\" over him and only to willing to help him navigate through life with ADHD and depression - but he is in danger of throwing it all away through self-absorption and insensitivity. It's legitimate to be concerned if your spouse is obviously overweight - it's bad for their health after all - but there are ways to express this in a constructive and encouraging way and ways to be an insensitive ass. It's a completely fixable problem - being overweight is not an immutable \"body type\", it's just a temporary state of being",
            "Unfortunately you will never get a supporting husband and you deserve that and the longer you stay the more your denying yourself that. Be your best ali and love yourself. Be who you are and take pride. Let this debilitating time in your life give you enough rage to put towards your own life and grow into who you want to be. I've been there. Please make yourself independent financially and emotionally and you will be a force to be reckoned with. You deserve a great life.",
            "\"Can we still have a happy marriage if we are both in love and committed to each other even if he apparently doesn't have any real sexual feelings towards me?\"\n\nOkay, now think about this. I'm not going to even bring up the fact that he verbally abused you and was caught texting other women, which on their own would cause me to leave. But you are willing to stay in a relationship with a man who doesn't want you sexually, and completely push your sexual wants and needs in the trash essentially. I don't see a loving relationship when I read this. He is not sexually attracted to you. I dont even think he loves you. He is just dependent on you and sometimes enjoys your company. When you're clothed. But also thinks youre fat. Why are you with this man? What are you doing? Do you have no self worth?",
            "Whether he means the awful things he says or not, just the fact he's saying them is wrong and abusive.\n\nPart of finding someone \"hot\" is the love you have for them and if he's not finding you \"hot,\" well, that's on him.\n\nYou definitely deserve better than what he's been feeding you and I'm seeing gas lighting all over the place here, where he's making you the one at fault for this dysfunction in the relationship.\n\nThis:  *He cited the fact that I never got on top.* You're not a mind reader, for Pete's sake! He never told you but you're somehow supposed to magically glean this information. Gas lighting...\n\nThis:  *I caught him texting other women a few times. He watched porn a lot. I figured he was intimacy avoidant or something.* That's exactly what he wants you to think. He's off doing his porn and doing anything BUT being with his wife, but he's got you convinced it's really not him/that he can't help it. Gas lighting...\n\nThis:  \"*if you want to know why I've never given you oral it's because you disgust me sexually*\".  This was said solely to hurt you and make you feel badly about yourself. This is an abuser's tactic to make you rely completely on them, that no one else will want you.\n\nThis:  *he said he was sorry for being rude, but that I have to admit that I'm fat.* This isn't an apology, but a backhanded way of keeping you under his thumb. Again, he wants to make sure you think you're ugly and undesirable so you will think no one else wants you, thus ensuring you'll never leave him, no matter how abusive he gets.\n\nI could go on, but you seem like an extremely intelligent person so I'm sure you get the gist of this.\n\nIt's time to go. Even WITH a great sex life, the verbal abuse is no bueno... He's shown you who he inherently is and nothing in the world is going to change that. When someone shows you who they are, believe them.",
            "Passion absolutely matters and you deserves someone who feels it for you as much as you do for them. You deserve someone who is passionate about you, not just your body. He wants to keep you because you're familiar and comfortable, and he probably does love you or at least he believes he does, but that's not being fair to you, you deserve to be loved mind, body, and soul.",
            "I have ADHD and struggle greatly with depression and anxiety. It got severe enough that I had to go on short term disability because of my mental state.\n\nI also have been struggling with my partner and we've been having fights, not having sex, etc. We started couples therapy and that's been going great though. \n\nEven at my lowest point I never attacked my partner by calling them \"fat\" or \"disgusting\", nor have I ever been debased or insulted like that.\n\nThis is a long way of saying that his mental health struggles are NO EXCUSE for these attacks on you. If you think your relationship can be salvaged, I highly recommend couples therapy. It's honestly been life changing.",
            "I just wanted to reach out to you and tell you that my heart aches for you. I was in a very similar situation, but we were unmarried. I was ready to settle for friendship and companionship with him because I believed 1. that the sexual relationship part was not important because 2. you couldn't really have both passion and compassion in a single person. I thought living together and the stress of everyday life just naturally sucked the passion away. \nThings ended with this man, for different reasons, and I met a new man. \n\nI was wrong. You can have both and they are equally important. Connecting as friends and as lovers, both, bonds you together and makes all the difference. \n\nYou are worthy of both passion and compassion. You deserve a full partnership with someone who adores you just as much as you adore them. \nDon't continue to settle.",
            "Maybe he's gay. Even if I had a hard time getting aroused by my wife, I would still be asking for head all the time (this whole sentence is a train wreck)",
            "\"If he makes your eyes wet more often than your panties, Thank You, Next\"",
            "You need marriage counseling. And probably some for yoir own self worth. I don't know how to tell you this but old people have sex to.",
            "If “being unattractive when we’re older anyway” won’t matter, then why doesn’t it now?\n\nI’ve been in your position, to the T. You are correct in your inferences. He’s not attracted to you, and “saying he didn’t mean it” is a lie. He’s scared to leave you for some reason, whether it be for his own reasons, or because he’s worried about hurting you. To divorce, it would be purely out of self respect. But sometimes self-respect isn’t any real objective when you’re very in love, and that’s just true. If you got in shape and your sex life improved, it would likely make you very happy and that’s fine. I think some people will say that I’m unethical for suggesting this. \n\nHe says he’s willing to work on it, but unless he suddenly unearths his entire mental/emotional/psychological experienced definitions of sexual attraction, it’s not going to happen. It would be no different from, like, conversion therapy. Learning to value devotion, to value sex because it’s healthy for you, for your marriage, for your partner is a more feasible step. Who knows how dedicated he could really be. \n\nSee what you can do. I hope you find a path of least resistance to something satisfying and of value.\n\nEdit: level the playing field and stop giving him oral.",
            " Check out r/deadbedrooms and read about your possible future",
            "I’m so sorry you have to go through this... but he does not love you. From the way he talks to you he does not even respect you. You cannot keep living with a man who calls you names. You cannot live with a man who doesn’t like you sexually. You’ve caught him talk to other women. You have to leave.",
            "Lust matter to some people and others are fine without it. However, basic respect and trust is essential in a relationship. Does he show you a lot of affection and appreciation? Do you receive the same amount of support as you give? Need to ask yourself the tough questions now, only you can know the answer.",
            "I love my boyfriend to *death*, but god have we had some blazing rows. But neither of us have ever, or will ever insult the others appearance or anything of the sort. How can he claim to love you so deeply, but be perfectly happy to trample your feelings and self esteem? He’s happy to have what sounds like an emotional affair via text with other women? Girl, wake up and smell the coffee.\n\nSorry, but your husband seems like a pig. You deserve more than this.",
            "My bf of 7 years and I broke up during COVID for similar reasons with neither of us disrespecting each other. Love is still not enough. You have to leave. You will be happy. I never thought I could be again but I'd give anything to have not wasted so much time on someone who was not right for me. Please don't make the same mistake I did. Leave him.",
            "Reminds me of my ex boyfriend /fiancé.. We almost got married and thankfully something entirely unrelated happened that made me leave the relationship.. It took me a while to admit to myself he was never into me. I was a very self confident person but those 7 years really did a number on my self esteem and brought up all sorts of insecurities in me. I am now trying to rebuild myself. I am terribly sorry for the situation you are in and I wish I could offer more advice but I think everything has already been said.",
            "Honestly to me this echoes almost exactly what I went through.  Same ages even.  Except I found out that he had a porn addiction.  .... that was very well hidden and affected our physical relationship 100%. That is all.",
            "I think you both have to agree about the norms you'd like in your relationship. It sounds like maybe he's blurted out these horribly insulting things because he's not comfortable admitting what he feels, and he'd rather say things to please you (in general) than admit the truth. And clearly he's not sensitive when he does share his truth. \n\nCommunication will definitely have to be worked on, but the rest is up to you. What do you value in your relationship? What does he value? What would improved intimacy look like for both of you? How would you feel if the current situation continues for the rest of your lives? I think there's a lot to explore in what you both value, expect, and agree to work on in your relationship.",
            "The point is, you can’t un-know what you already know. You’re right, he’s not attracted to you and that’s why he doesn’t want to have sex with you. \n\nHe is unable to meet your needs - he’s NEVER gone down on you but expects oral? Selfish. \n\nAlso, he’s a hypocrite - he expects you to be in shape but he is overweight? It’s a 2 - way street. \n\nThese issues aren’t going to go away. He’s not going to magically become attracted to you. You either accept that this is the nature of your relationship, or you move on. \n\nPersonally, I would move on. Love is too good to pass up. Telling someone they’re fat, refusing to fulfill their needs, lying to them doesn’t equal love in my book.",
            "Please divorce him. He clearly has never appreciated you for the good person you are and just wants to mooch off a wife for the rest of his days.",
            "He probably has some self-hatred. You mentioned that he’s depressed, yeah? Don’t take it personally please.",
            "Wow, that really sucks. I’m so sorry. He’s right that you’ll be old and unattractive one day anyways, but happily married old couples ARE attracted to each other because of their love. They are respectful towards each other, and it’s not respectful to speak poorly of your partner’s appearance. I’m not saying love cures all and is all you need. I’m saying that when you genuinely love someone and they’re right for you, you are not focused on their imperfections. The things you LOVE about them overpower those imperfections.  And when you notice imperfections your love makes you gracious enough to not be a hurtful asshole about them.   I’ve seen this many times- in relationships that others have, and once in my own. I dated and was head over heels with someone with the same issue. Ultimately I realized I couldn’t be happy with our lack of sex and how unattractive he inexplicably made me feel and broke it off after a year. It was incredibly hurtful to learn I just didn’t do it for him. But you know what? There are PLENTY of men that are physically attracted to all sorts of women- large, small, curvy, straight-figured, and everything in between.\n\nIt is really hurtful to figure out what you’ve figured out. Ultimately it’s up to you to decide whether that’s a big deal to you or not. If you were to lose weight and become more his type would your hurt feelings fade away? Probably not, the problem is less that you’re not his type and more that he’s let that affect your intimacy and his view of you, which affects the relationship. I generally urge people to try and work things out but there needs to be a baseline of attraction and respect- those seem to be lacking here.",
            "Go to a marriage councilor for help on your marriage not Reddit. Everyone here is “leave him” happy. These are not professionals, just jugemental unhappy people that pretend to be perfect and can’t understand that people are unique individuals that actually need care and understanding.",
            "Well if you do decide to work this out, and y'all are truely in love and genuinely companions, go to therapy, and maybe consider opening the relationship up on the sexual aspect. Talk about that in therapy too. Sex is important.",
            "It comes off like he sort of misled you by telling you what you want to hear.  He’s “settling” for you, because he knows deep down you’re by far the best he can hope for or deserves, but still not good enough for his shallow, narcissistic fantasies that will never be quenched.  I had a boyfriend years ago like this.  He did what he had to to hold onto me, but was always still looking, flirting, and fantasizing.  He also kind of kept me down to a certain level, so that I would not feel independent enough to leave.   Turns out, I was out of his league by miles and he’s been lonely since.  \n\nYou sound like such an amazing, loyal partner and too good for him.  So sorry that you have to deal with someone like that.  You deserve to be cherished for your beauty inside and out.  You don’t need anyone to view you as something they are settling for.  Bet if you start letting go of the dependency, he suddenly finds you more attractive, but it sounds like a problem he would have with anyone and something that is not about you or your actual worth at all.",
            "There are so many things you don't share with him that you should be able to share with your spouse.\n\nIt also seems like you knew that there was a level of trust and companionship missing.\n\nI'm not sure if things will be better apart but I suspect you will benefit from getting experience outside of the relationship.\n\nForce him into an open relationship first if you're scared to quit it all at once.",
            "If you are wondering if sex really is that important, then you never actually had good sex. In a relationship, good sex is not everything, but it definitely needs to be included in the combo. You need a partner that makes you feel gorgeous, loved and desired. You owe that yourself! You only live once, don't waste it on someone that doesn't make you feel happy and doesn't make you cum 😁",
            "I can't imagine treating someone I dislike the way you've said he treats you, let alone a friend or lover or spouse.",
            ">Can we still have a happy marriage if we are both in love and committed to each other even if he apparently doesn't have any real sexual feelings towards me? \n\nDo you truly feel like you have a happy marriage now? You've cited a number of fights and name-calling. He has texted other women. From an outside perspective, it doesn't seem like a happy, in love, committed relationship to me",
            "Bruh... you’re 36. It’s honestly like the BEST age to be. The only thing better is probably 46! \n\nFind someone who lusts after you the way you lust after them. Life is too short, and you just get ONE shot at it.",
            "Aww, this all makes me very sad to read. Relationships are supposed to add to your life, not detract. They’re supposed to leave you feeling fulfilled, sexually and emotionally. And the way that he talks to you regarding sensitive topics... you honestly deserve so much better. Rather than dwell on him not wanting you the way that you need and deserve, remember that you are the prize here, not him, and it’s his loss for not seeing that. I can’t tell you what to do, but what I do know is that there are many other men out there who will value you and treat you so much better.",
            "Leave him sweetie.. you can definitely do better. This isn’t a marriage for him, it’s a insurance policy. Good luck.",
            "If you send me your birth date and you know your birth time and place of birth I could do an astrological natal chart reading on you both. This can give us a lot of info on relationships based upon planets at birth. Let me know. I also do tarot. These tools really opened my eyes on many issues within myself and in others that were in my life. It is my definitely something I love, and I have helped many people heal by doing shadow work. Not trying to push but I will give deals to first time clients! Send a msg if interested :) have a great day!",
            "He needs to stop watching porn. That stuff is toxic on reality. \n\nI personaly believe you can have a great marriage without \"lust\". Our attractions change as we age, so that isn't a great indication of a good marriage. I think every marriage has strengths and weaknesses. You guys might be a 10/10 on having fun together, but you might be a 3/10 on sexual compatability. To me, focusing too much on the weaknesses can take away from our strengths. \n\nI am not trying to tell you what you should do. What he said to you is inappropriate and he should know that what he said was hurtful and not appropriate.\n\nSex is important, but so is friendship and laughter and trust, etc.",
            "Your husband might have been a sexual assault survivor. This happens a lot when men are kids that they are abused and ashamed to talk about it. They want sex but they can't participate fully with a real person, it scares them. I think you need to go to marriage counseling around this. He is not going to admit it to anyone at first if he was abused, it's going to need a professional to get him to talk about it. They act like that, the men when things have happened to them. It's not you at all, something is going on with him something very serious. He calls you a prude but he had issues with giving you oral. All red flags that something happened to him and he is scared and unable to have real intimacy.",
            "He's obviously a monumental asshole, based on both his words to you and his incongruent sexual expectations (wants oral, won't give oral). If no kids, divorce seems like an obvious solution.\n\nAlso kind of weird of you that you won't ever be on top during sex. That seems pretty standard fare.\n\nAgain, based on your description, though, he is largely the problem.",
            "I’m stunned at the fact that he’s never gone down on you. To me, that’s insulting. In my opinion I think you should focus on bettering yourself and making yourself happy. We are supposed to be there for our partners and love and support them unconditionally, but sometimes we forget about ourselves. \n\nStart a new hobby. Try eating new foods. Create and execute a workout routine that works for you. Dye your hair. Read a new book. Focus on you. \n\nI don’t think this in itself is necessarily means for divorce, especially if there’s love there, but perhaps you’re looking for something he just isn’t able to give to you right now. So with that being the case, find it on your own. \nSex is so important in a relationship, but you don’t have to be miserable. Have fun with some toys. Watch porn or read some erotic stories. Find pleasure and satisfaction within yourself.",
            "Woah. He said you disgust him sexually. RUN ffs",
            "I feel like we are married to the same man. We have had the exact same arguments. It's been exactly 7 years. I'm shocked by how similar and familiar this post is. \n\nI eventually asked for a divorce. Do I think I could live complacently indefinitely? Yes. Do I want to? No. \n\n<hugs>",
            "Take a little trip over to /r/deadbedrooms and take a look at similar relationships. Read it from an outside perspective, think about what advice you would give those people and then apply it to yourself.",
            "You guys need couple’s therapy. I’d say consider separation too if he’s being that rude and inconsiderate since you’ve went out of your way to talk about it. \n\nCouples have hiccups, but it’s very much possible for it to be so rare it’s not an aspect of your relationship. You guys sound like y’all have struggled with communicating needs. Definitely more on his side. But in your case, you definitely needed to put your foot down because you are a person. You deserve to have a fruitful relationship. You don’t deserve to be questioning your body or your relationship 24/7. You deserve someone that you have no worries with talking about these types of things. No relationship is gonna be 100% perfect, but a great relationship has to come out of both being in the light to tackle these adult issues. You’ve been doing what you can, but he’s being quite resistant making it so you’re running out of options on how to deal with this. \n\nWhat I want to also point out is the insults are not okay. He’s targeting your insecurities. If you go along with a couple’s therapist, they’ll tell you the same thing. I do genuinely believe people have room to change or there is a chance he needs to find a way to redirect his anger. To me, it sounds like he’s deflecting since he seems to be the prude or he’s too stubborn to try admit that he needs to work on his side of the relationship. Again, something that needs to be brought up in therapy. To me, if he tries to avoid getting this help, it shows that he holds no value to you which means you can go ahead and gift him with a nice old divorce paper. If he genuinely wants to move on in this marriage whether he thinks he’s right or knows he’s wrong, there is a good start. In most cases, I’d be already telling people to pack their shit and go. But I do empathize with him very little (definitely not with the insulting and one sided aspect) that it gets hard to communicate. And sometimes I express my feelings in ways that I shouldn’t out of fear of discontent from my partner or having to accept responsibility. With that said however, it still isn’t an excuse to not self reflect to do right by those that care about you. I can say he’s taking half a step to work on this and that’s expressing emotions; nonetheless in a way that will not make things any better. \n\nSo with that said, there is no shame and it’s not overreactive to at the very least throw separation or even divorce on the table. I do think this issue majorly lies on a lack of communication which created frustrations on both ends. Talking to a therapist will allow you to pinpoint if this marriage can be salvage or if it’s time for you to find someone that can actually discuss status of the relationship as a grown ass adult. If he cannot take therapy to heart and utilize it to make the marriage more positive, you’ve got divorce on the table. If he can actually respond as an empathetic, human being and attempt to move forward out of love, then y’all will be on the right track. At that point, the ball is in his court. This situation is too heavy for you to take on alone so it’s definitely useful to seek professional help."
        ]
    },
    {
        "post_id": "d4gz6q",
        "author": "One_last_time1713",
        "title": "UPDATE:My step sister (20F) texted me (21M) last night asking why we aren't close anymore and I said its because how bad we treated each other growing up, should I feel bad for not wanting to be close with her?",
        "url": "https://www.reddit.com/r/relationships/comments/d4gz6q/updatemy_step_sister_20f_texted_me_21m_last_night/",
        "score": 5090,
        "num_comments": 175,
        "created_utc": 1568529269.0,
        "selftext": "After our text convo that led to my dad calling me asking whats wrong between us I texted her about a meet up at my place.  This was the first time we actually met/hung out outside of a family gathering.  Before she came over that realization gave me a new look on our relationship.  The whole sit down went well, we actually got along and there wasn't any name calling or anything \"mean\", we talked about how we treated each other and this was the first time I've ever heard her apologize for how she treated me growing up and I did the same.  We talked about how the text convo went, and I came to the conclusion that I still had the old image of how she was when I last saw her at 17 and was using that to picture her now.  She still kinda acts the same (kinda moody but can hold it in so much better now) but its a lot better.  We talked it out and spent about half the day together just hanging out and I will admit I enjoyed it.  I don't think we will be super duper close but its a step in the right direction and there isn't a wall of tension between us anymore.\n\nThank you all for the advice and comments it really came in handy and I appreciate it!\n\nTL;DR: Me and my sister talked it out and it went pretty well.\n\nLink to original:[https://www.reddit.com/r/relationships/comments/d123s6/my\\_step\\_sister\\_20f\\_texted\\_me\\_21m\\_last\\_night/](https://www.reddit.com/r/relationships/comments/d123s6/my_step_sister_20f_texted_me_21m_last_night/)",
        "permalink": "/r/relationships/comments/d4gz6q/updatemy_step_sister_20f_texted_me_21m_last_night/",
        "comments": [
            "Aw that's so good to hear. My brother and I treated each other like absolute garbage when we were kids. One day I was thinking about how my friends and their siblings were so nice to each other and thought to myself \"why can't we get along like that?\". So I went into his room and said \"hey, I'd really love to be friends, do you wanna not treat each other like shit?\"  We called a truce and from then on we got on like a house on fire. Now we're best friends. Siblings are weird, they're horrible to each other for no reason. I dont know why but it's normal, and normal to grow out of it. Hopefully that's what's happening for you guys.",
            "I hated my sister growing up with a passion. I used to toss and turn at night and every morning wishing I had had literally any other sibling. The last straw for me was when she threw her high heels at me in a screaming fit for borrowing them without asking right after she'd been freely using my car for months, sometimes without asking. She got a punch in the face for that and we didn't speak or see each other for five years, only reuniting the first time for our mother's 50th birthday. \n\nEleven years later and we are each other's closest confidant and best friend. When I understood that certain aspects of our chronic, psychological nightmare of a family dynamic were what directly drove her behaviour from the age of 2 to 24, all the apprehension, old resentment, and desperate rage I still held for her which I could not previously resolve internally melted away and was replaced with overwhelming love and acceptance for who she was and is today.",
            "[deleted]",
            "That's awesome that you guys gave each other a chance! As an evil older sister, I'm so thankful my younger siblings have forgiven me. We had a big age difference and I was a depressed, moody teenager that hated life and they were obnoxious, normal kids. We are all 3 super close now that we are older but it did take time and effort to get here. For us, our bond is unbreakable and I will forever be so thankful to have them. It took a long time to get here but it was worth it.",
            "I'm so happy for you, OP! I admit, I was a little harsh on you in the last thread (the thought of cutting off a sibling because of the way they acted in their teenage years was absolutely absurd to me, and the fact that so many in the thread were actively encouraging it really confused me), but I'm genuinely glad you're working towards a positive relationship with your sister. Remember, it's a marathon not a sprint - don't put yourself in situations you don't feel comfortable in yet because you feel you need to rush the 'closeness' process\n\nGenuinely wishing you the best :)",
            "Same. My sister and I are 6 years apart and were not close growing up bc of the age difference. For some reason I was really mean to her when I was in middle school and high school. In hindsight it’s bc I was a moody teenager. Our best story is when I kept telling her she was fat when she was in 2nd grade (she was not at all fat, I was just projecting my insecurities and was jealous of her.) She rode her bike a few miles to the store and bought Slim Fast. In 2nd grade. I was not nice. We’ve lived together as roommates in our 20’s/30’s, had some fights and didn’t talk once for 6 months. Today she is my absolute best friend in the whole world. Our parents suck, brother had major issues, and we’ve barely seen our extended family in years, so we have an outlook of “You are my only family and my best friend.” She’s married to a great guy now, and I’m included with his family’s holidays.",
            "So glad to read this. My sister and I didn’t get along either until I left for college, and it was me who was the mean one. I was just an emotional mess and made her my verbal punching bag. I’ve been trying to make up for it since then, so much. I’m her strongest supporter in the family, I always ask her opinion before deciding family trips (I’m the designated family organizer), always call her with my news first, text and FaceTime her every week just to make an effort.... I think we’ve become pretty close now. In fact I’m the first one she told she was gay when she came out earlier this year and you bet I supported the crap out of her. If your sister actually apologized then she knows she has to change that dynamic between you two. And don’t think that there won’t be steps back - there will be because childhood patterns are so hard to fall back into. But keep being there for eXh other and you might find a new best friend at the end.",
            "So cool you did this. Happy for you. Don’t feel\nBad for not wanting to be close to her it’s a natural process. Your brain can’t forget easy. It takes getting to see her and talking to her a bit more to see if the change is permanent. Take your time, there’s no rush. But now you are in a good spot.",
            "It took my sister and I 34 years to be \"civil\". You might get there, you might not. Just take the relationship with your sister as it is and don't try to look too far in the future. Also, you'll realize as you grow up, not everyone else is close to their siblings either.",
            "Yes I agree good to hear.\nBaby steps. Give her another chance to make ammends. It's the right thing to do.",
            "So glad you ended up going this way, OP. It shows a lot of maturity on both your parts.  I commented on your last post- my sister was a holy terror as a teenager but now we’re friends. It’s really rewarding. Family isn’t the *most* important thing in life, but if you can make it work life is a lot easier.",
            "I feel like.. If people actually able to hang out with someone for a day and enjoy it, it's possible to be super duper close (granted that trust between each other grows and both parties make a genuine effort to spend time with each other).",
            "My sister and I were never near the level you two were, but there were a lot of times that we never got along. I was just the typical older brother that was annoyed by the little sister. She'd pick on me, is pick on her, etc.  But I want to say around junior/senior year (8th -9th grade for her), we started getting close. But the time I started college, we were pretty much best friends. \n\nNow at 30, her at 27, we are extremely close. Same sense of humor, text each other every day, despite being in different states. Even though I'm older, she's 100% the older sister I never had.",
            "Im really envious but extremely proud of ya!!! Up til now i still cant make things right between my big sis and me :( but thats okay maybe we just need to mature and talk it out.",
            "Don't forget that she is still growing even at 20. I'm only 24 and I'm vastly different than I was at 20 and at 20 I was very different than at 17. Our brains don't stop growing until we're 25 so I think her personality won't really be set until she's almost 30. \n\nI'm glad you're able to solve and forgive your past issues! I wish I could do the same with my sister but she's mentally ill so she'll never change.",
            "My brothers and I don't speak., And I do not believe we will ever again. Please keep working on it. Don't give up on each other. You're still young, and have a chance to connect as adults. I'm really happy for you!",
            "I'm glad it went well.  <3. Hopefully the next time goes well too.",
            "My sister and I had a very rocky relationship when we were younger; Screaming at each other, slap fights, generally being mean to one another. It didn't help that as I hit my teen years my role became more of a fatherly role since her dad wasn't around and my mom went through a string of men who weren't around long enough to do anything. I had this dual mindset of protecting her while also being super jealous of the things she had. My mom spent a ton of time with her doing pageants and things and she got special treatment from her dad's side of the family. I was always the odd child out. Then when I was an adult and she was still in high school we had a huge fight over a boy she was dating. It was a big wedge between us for a long time and we didn't really talk about it for years.\n\nOnce we were both settled into adulthood and had kids and perspective it really made it easier for us to relate to one another. It also gave us that time to understand that there were things that weren't about us coloring how we saw one another. I saw her as spoiled, but that wasn't her fault; She didn't invite that, it was what the adults around her did. She felt like I was distant, but again that wasn't my fault it was the constantly shifting ability of my mother to take care of me and abandoning me with different family members (while keeping my sisters). So I was gone here and there at key points in her life. \n\nTime helps heal old wounds, but communication is so vital to really moving forward and understanding that who you were then isn't who you are today.",
            "Good to hear your getting sorted. Good luck",
            "Thank you for sharing this, and the original post. I’m in a similar situation with all my sisters. I don’t want to be close to them for the same reason. We don’t know how to respect each other. And it’s always nice to know that other people have similar stories. Then I don’t feel so bad!",
            "Not gonna lie I got really nervous when this started with “my step sister texted me last night”.   Thank god it didn’t take a dark turn.",
            "That’s what happened with my actual brother and me. We used to argue and bicker all the time .... ALL THE TIME. To the point where we would get into physical fights  and really hurt each other. Mind you I’m a female and two years older than him. \n\nSince he was 7/8 he has abused me verbally calling me all sorts of insults and comments. When he was 12 he was at the height of his anger issues and he stabbed me (pretty badly) with a pen on my arm. \n\nAfter that day I stopped speaking to him, made no effort at all to speak or make any notice of him. Like dead ass acted like he didn’t exist.\n\nI didn’t want him to get that angry at me ever again (in case he ever found his way to a Knife or worse) and I figured the best way to do that was to avoid him at all costs. \n\nThis only made him more angry and in his teen years he would constantly try to start fights and call me names all the time. I still avoided him as much as I could in a small house, and attempted to never ever ensue any arguments. My dad is a pretty condescending asshole who was also violent and that’s also how I dealt with him most of the time.\n\nHe calmed down a lot , almost shockingly well and matured a lot in the past few years (we are both in our 20s now) \n\none day recently he said to my mum “it hurt me so much that she stopped speaking to me and we don’t talk anymore why is she so cold and distant”. Every time I go home to visit my mum comments something like that to me and pressures me about it.\n\nI felt scared for my life that time and for a long time believed he was actually capable of causing serious harm. He was a very angry little boy and now I cannot seem to hold a conversation with him no matter how grown or different he might be now. I hold severe resentment for how he’s treated me in the past. \n\nAnd as terrible as it seems because he’s family but that’s just how some things are.",
            "That's really nice.  Sometimes it's not possible to mend the relationship, hopefully you will find a way to continue forward.",
            "I think you should try and see if you can become close, spend time hanging out and all that and see where it goes :)",
            "It's a good thing to forgive someone and move forward with your life. That doesn't mean you have to be around them especially if you feel uncomfortable. Don't feel bad",
            "My sister's and I were pretty horrible to each other growing up, particularly in our teen years. We're all so different personality-wise and we were developing into our own people at the time. Our household also had some emotional toxicity going on. But now, we're literally best friends. They're the first people I called when I got engaged a few months ago, and if I have a formal wedding ceremony they would be my bridesmaids. We tell each other everything. This didn't happen over night, and it might be different for you, but it's also not out of the realm of reality.",
            "My brother and I used to fight like cat and dog. Then one day about 3 years ago, we had a long late night talk in the car. Tears shed, words said. But we now communicate with each other properly. We console each other and it’s helped our parents understand us more too.",
            "Please count yourself lucky that you did this while you are still young! My brother is seven years older than I. He Joined the Army at 18. It wasn't until I was in my forties that we started to get close.",
            "I say it depends on how much you both have grown as people. To be honest.",
            "That's so good to hear! After my mom passed, myself and my siblings  relationship with our dad, already was not so great to begin with, just got worse it seemed. Now it seems like he's trying as hard as he can to build it up again. It took us years, but it's a start. Reading this gives me hope for him. Hearing about you and your step sister is so wonderful.",
            "Take your time this is not a race.  Give yourself and her time to adjust to your new interactions.  If you feel like you can't trust her after you have some time to actually get to know each other again then decide from there.  You were both struggling so much to identify yourselves within family roles, school roles, and just generally making friends.  You had a few years on her in terms of dealing with other people and empathy than she did and unfortunately I think you became to focus of her anger toward her bio dad who was no longer in the picture.  You were to closest safest person to lash out at and you bore the brunt of it.  But she is becoming able to see and have some insight into her own issues and might want to rectify what happened without really realizing how much of a role she played in your discord.  Be gentle with the relationship and see where it leads but don't put yourself in harmful situations to do so. Take care and I hope things go well for both of you.",
            "Thats really good to hear",
            "I am going to admit I was a shit sister. Once I hit 19/20 years old, I really started to look retrospectively and realized I was the person causing pain and anguish because of personal medical problems. From 22 on I started rekindling my relationships with my family, my brother and sister in particular. Now after a few years of; therapy, apologizing and showing them I'm not going to be an ass hole out of no where really helped get our relationship to a more loving nature. I think things like this just happen to siblings (full and half related). Just keep being you and showing her you're both more mature, the love and bond will grow.",
            "Well! Ain't that nice; happy for you.",
            "My sister and I didn't get along until I was 30. We just have always been two different people. But now I think we can recognize that and appreciate each other's good qualities and enjoy spending time together",
            "I'm really glad to read this. I personally also grew up hating my sister with everything in my soul when we were little, until I realized the reason I hated her was because of how my parents made me feel when they compared us literally all the time and bottom line I was extremely jealous and envious of her. Also she had the worst personality and said a lot of shit but it wasn't things that came from her but rather her biological father that manipulated her to say all that fucked up stuff and act mean towards me. At some point I was done with my way of acting towards her and we tried to fix the relationship, now we are each others best friends and I think being friends with your siblings is something really special because we grew up together so we know everything about each other and our personalities so we know how to deal with each other, we have a lot in common and I don't know what would I do with my life without her in it. I hope you really give your relationship with her a good try and hopefully you guys can experience what I experience with my sister. Good luck!",
            "I actually got along with my sister growing up and throughout college. It’s only been within the past few years that I’ve began to hate her and hate spending time with her. It takes a lot for me to say the words “I hate her,” and I’m really sad it’s gotten to this point. But I’m also pretty desensitized to it now because she’s not worth my fucking effort.\n\nThe problem is that she’s become the most selfish and critical person I know. She gave up her dog, who I adopted because she wanted to go be homeless for a while because she wanted to put herself “in a risky situation and see what happens.” Those are exact words. She blames my parents for having too good of a life. She wished she struggled more because she doesn’t like the fact that she has to lie to all of her friend about her upbringing. We were very fortunate growing up and she hates it. She lies to her friends about it because she wants to seem like she’s struggled and lived a hard, but good life. She told my mom that my mom treats her like a pet because she calls her “sweetie.” She told my parents that they have nothing to live for except for my sister and me and that she needs them to get a life. This is not true. My parents have friends, hobbies, and jobs. They love their life irregardless of my sister and me. She made my mom cry. My mom is the sweetest most loving person I know. She made my mom cry. I hate her for this the most.\n\nBecause she gave up her dog and I adopted him, she wants to visit him every so often. She planned a trip to visit the dog and stay with me. But she neglected to tell me that she was planning this. She didn’t know it was over my birthday. She didn’t even tell me this was her plan until a week before, but I heard from my parents 2 months prior that she wanted to visit the dog and stay with me. I waited for her to bring it up because it’s her responsibility to ask to stay at my place. She didn’t ask if she could stay with me until a week prior (about a month after she bought the tickets) saying she was coming to visit and was soooooo happy it was right around my birthday so she could celebrate with me. Yeah right.\n\nShe gets here and she criticizes my whole life. She tells me I shouldn’t go to med school because she rarely gets to see her friends who are doctors. She told me she’s worried about me because I’m infatuated with my girlfriend. Because after two days of constant nagging and lecturing from my sister about all the bad things in my life... I was *really* excited to see my girlfriend. She met her for 1 hour and decided she knew our whole relationship and that as my big sis, it’s her responsibility to tell me when she thinks it’s not a good relationship. Meanwhile, we have since moved in and she is everything to me. I love her so dearly, more than I’ve ever loved anyone before. It hurt so badly that my sister could disregard my feelings to tell me that she thinks it’s not love, it’s infatuation, when in fact this is truly the deepest and most true love I’ve ever had. Then she whines and bitches when I wanted to spend my birthday with my girlfriend... which I had planned out for 2/3ish months. I said fuck it and left her to hang out with her abandoned dog. But boy oh boy did I hear about how it made her feel when I left her alone on my birthday when she flew all the way out here just to be with me.\n\nMy parents keep asking me if I think we will ever repair our relationship. I tell them it’s on her. But I’m done with her at this point. No more staying with me. No more accommodating to her. I won’t take her abuse. If she wants to repair the relationship then she can get off her high horse and treat me like a person, not some young sister she needs to teach the way. She can respect me and my life choices or she can gtfo.",
            "[deleted]",
            "[removed]",
            "I'm glad to hear you are heading towards forgiveness. It always makes me sad when I read about adult siblings who can't forgive each other for things that happened when they were kids.",
            "I'm glad you gave it a chance! Communication and understanding can go a long way.",
            "There is no sarcasm behind that, but I have to tell you: Congratz, you behaved like an adult should behave (sadly, most people still behave like little idiots). Talk about stuff that bothers you and work on things that bother others, put some effort in a relationship and when it comes to family: try to get a blind eye for thing you wouldn't tolerate with strangers.",
            "This makes me want to re-connect with my stepbrother",
            "I can understand this for sure. All my siblings(including me) had problems with each other. Once we slowly moved out from our mom's place, everyone grew it and was nice to each other. Except my one brother, he and I still have issues. I try to make amends, but he wants to say stuff to me to make feel mad about and the way he deals with stuff is \"putting on the gloves\". He thinks fighting solves problems.\n\nMaybe one day we will figure out our issues, but for now, it is not the case.",
            "People like to say this kind of behavior is common with kids growing up and I don't know if I disagree with that statement or not. Growing up with my half sister we would have some rows here or there, but never anything super terrible.   \n\n\nI read your entire post and the follow-up. I think the thing that would've bothered me the most is the fact they texted you out of the blue and asked why you weren't closer. They were absolutely avoiding the topic of their behavior when they were growing up. The first thing they should have said was, \"I know we fought a lot growing up and I'm sorry, I'd like to be closer.\"  \n\n\nSometimes it's hard to admit when you are wrong and it can feel like doing so is tearing you apart, but it's important that you do so. I remember, looking back, at one point my sister and I had a massive fight growing up and I laid my sister out. One night I was sitting at home, watching TV and it just popped in to my head.  \n\n\nI called my sister up and I apologized on the spot for all the shitty things I did, she apologized for being a unbearable asshole to me and that was the end of it. We always got along as adults, but my behavior as a child still embarasses me to this day.",
            "I’m glad you guys were able to sit and talk :) my brother and i (full siblings) basically hated each other our whole childhood. he took karate and use it on me, i threw rocks at him... well into our teens. when we moved out i was sure i’d only ever see him at family events. but once we lived on our own a bit - we ended up in the same group of friends. and seeing him as a person rather than an obnoxious and angry younger brother, really changed us. we moved in together and our parent thought we were NUTS. frankly, i was worried too! but it was the most awesome three years! that was in our late 20s early 30s, and we’re both in our 40s now. we’re best friends and i can’t imagine not talking to him and skyping and visiting (he and his wife live a few states away)\n\nall that to say, this is a great jumping off point. you don’t have to be besties or super close, but don’t write that off just yet either. :)",
            "I think it’s important to move on from the past. When you’re young and living together relationships can easily get broken, but with a little bit of space and effort to keep the relationship going I think things should be fine. It’s also important to know that with time people slowly mature and grow out of old habit and or straighten out certain ways.\n\nEnjoy this relationship while it’s available. Make the best memories and enjoy eachother.",
            "She’s your family bro. You only get one. Try and be close with her because one of these days one of you will be gone and the other will be left wondering “what if?”. Don’t let bullshit between you when you were teenagers get in the way of your adult life. Hang out with her and be closer to her. You guys must have some kind of love for each other to reach out and talk and hang out. Keep it up.",
            "i love OPs with good hearts who make rational decisions.",
            "I am so glad to hear that. I wish my brother and I could get along just like OP and her sis.",
            "My brother and I are 2 years apart (I’m older) and over the past several years we’ve become a lot closer. I’m almost 32 and his friendship is so special to me. I love being able to text him “Hi brother bear” and he responds, and it’s gotten to be a really sweet relationship. It took time and o didn’t really see it coming. But I’m so glad it did.",
            "This is a great update!",
            "Life is too short to deal with shitty people, family or not, no fucks given.",
            "That’s great to hear! I have 2 bio brothers (17 and 9) and I’m 15 I love my little brother to death \n\nBut for the longest time me and my brother didn’t get along but we started to really get on recently \n\nHope the best for you and your step sis :)",
            "You don’t have to be besties right away. Just take things slow & see how they go.",
            "People can change! My brother was a monster growing up. Even brought a gun to school! Now he has 3 kids and is a big family guy and I genuinely enjoy his company. There’s a reason why juveniles have a different court system.",
            "No. My blood sister was an asshole to me growing up made me not want to be close to her.",
            "You did a tough thing, but made your life easier. Good for you. A lot of human relations are tough and require these awkward or even painful conversations.",
            "This keep showing up on my feed. Please.",
            "I haven't talked to my brother in over a decade. Some relationships aren't meant to be, and that's okay.",
            "This is awesome to hear.\n\nI grew up the oldest brother to 3 younger sisters (big age gaps between all of them) but I knew that in my early-mid teens I was not a good brother to my oldest younger sister (she's 7 years younger than me). I was pretty bossy to her and anytime parents would lecture her on anything I'd jump on their side and continue to lecture her (my parents definitely did a good job at shutting that down ASAP, but I knew I still did it for a bit). \n\nI think the biggest wake up call was when my sister called me out, and I realized it too, that I treated our 2 youngest sisters better than I did to her. And that made me realized I was being garbage and I knew that as the older sibling I had to grow up and be better. So I started showing her my favorite movies and TV shows that I grew up with, basically rewatching all the greats. And from that simple thing of rewatching and making our own commentaries, she's become so much more than a good sister, but a legit friend that I talk and share pretty much everything with and even as one of my main movie watching people.\n\nReflecting on my relationship with the oldest sister, I'm so happy that we're in a good place now. I encourage any siblings that are going through rough patches and want to be better, start with the little things, then you can make into the big conversations you've always wanted.",
            "Don’t feel bad. My sister hated me for a while because I was horrible as a kid. Didn’t know any better.",
            "I’m about to have some children who will have step brothers or sisters, what were some reasons for your conflict in Your childhood so maybe I can try to resolve those issues that will arise in my family?",
            "This will be buried, but I think that sometimes you have to consider what your responsibilities are to your siblings. There are a lot of reasons to put effort into getting along with your parents as long they are not abusive. But, if a friendship doesn't happen with your sibling, I think that it's not necessarily something to spend too much energy on. A parent has a responsibility to their kids, for sure. And some other people have been commenting that part of that responsibility is to teach their kids how to get along with their siblings. But, again, if those siblings don't click as adults, why waste time trying to mend a friendship that never had a solid foundation? I'm not advocating cutting family out of your life. I'm saying that trying to be friends with your sibling simply because it's \"the right thing to do\" is absurd. Especially because false pretenses make for terrible relationships. Of course, if there is some love there between siblings, then that's absolutely worth preserving. But, you need to ask yourself how much love there is. If your relationship with your sibling doesn't positively impact your life in any way, maybe it's better to let go of the desire to have that positive relationship with them, like the ones your friends seem to have with their siblings. But, it doesn't need to be some dramatic ultimatum, either. You are simply allowed to stop caring so much about the health and quality and epic-ness of the love between you two.",
            "This sounds like the start of a good porno",
            "You can bang her, there's a lot of research that says that's a good idea",
            "Just wanted to say that I feel that I agree with your parents and that it's normal sibling rivalry. My brother and I were the same way growing up. We did alot of things together but we also fought like crazy, fists and everything. Now we aren't the closest, but our relationship is alot better than it used to be.",
            "What’re you doing step bro?",
            "Its your decision. You should rather ask yourself what her personality is like and if she is using people. \nIf, yes then you shouldnt be close with her.\nIf, no and she changed then go for it.\nBut dont let other people decide for you. :)",
            "[removed]"
        ]
    },
    {
        "post_id": "a67rsj",
        "author": "TAPJMA",
        "title": "Me [35F] found out my mother contacted the family that adopted my son, to ask for money",
        "url": "https://www.reddit.com/r/relationships/comments/a67rsj/me_35f_found_out_my_mother_contacted_the_family/",
        "score": 5046,
        "num_comments": 127,
        "created_utc": 1544814246.0,
        "selftext": "I placed my son up for adoption almost 16 years ago. It was a decision I came to on my own but it did come with the added pressure of my mom specifically telling me I would no longer be her daughter if I choose to keep my baby. This was huge for me because I am an only child. It was the most difficult thing to do and I struggle with the emotions of it daily. \n\nIt was an open adoption and I have the ability to reach out and get pictures/updates whenever I like. I did that for a few years but then it just became easier to move on by not knowing. I knew I had made the right decision and the family taking my son was amazing. \n\nI also ended up not speaking to my mother for six years after because of the way she treated me during my pregnancy. It took years of therapy and a lot of forgiveness to even be in the same room as her. I made peace with her for the sake of the rest of our family (i.e. cousins, aunts, grandma's).   \n\n\nAt the same time my mothers health was deteriorating and I found out through some family she wasn't working, had divorced her second husband and was homeless living in her car.  \n\nI had moved away and was doing well enough financially. I succumbed to the guilt provided by my family and agreed to move her in with me and help her get the proper care. It wasn't ideal but I made it work. Got her healthy and got her into some housing and our relationship has been ok. \n\nFast forward to July of 2018. I had lost my job, and in general things weren't working in my favor. Mid-life crisis status but with all things I knew this too would pass and a year from now this would not matter.  I had a plan of action and knew things would get better I just needed time. \n\nThings did get better, got a new job, moved to a new city, celebrated my birthday and on vacation until January 2nd. Things were great up until this morning. \n\nI'm visiting out of town with some family, which includes my mother. My mom approached me about having issues with her computer/phone I paid for/bought and asked if I could help. \n\nShe handed them over and I started troubleshooting. As I'm going through I notice her computer has several tabs open and I start closing things and un-cluttering the mess. Next thing I see is an open email from August between the man who adopted my child and my mother. She is basically telling him how bad my life is because of her and her health issues and I lost my job and she needs to speak with him to ask for any kind of help. The last email is them exchanging phone numbers. \n\n\nI'm beyond upset now and don't even know what to do or say going forward. I've locked myself in the bedroom and trying to wrap my head around this. Thanks for reading.\n\ntl;dr: mom went behind my back and contacted the family who adopted my son telling them how poorly I'm doing in life (which is not true) asking for money.\n",
        "permalink": "/r/relationships/comments/a67rsj/me_35f_found_out_my_mother_contacted_the_family/",
        "comments": [
            "I would contact the family first personally. Your mother isn’t able to be honest or tell the truth, and what she did was a huge breach of trust. I would just apologize for your mother’s behavior and tell them that her contacting them was not you. That way you can still have that pathway open for you in case future contact with your child is wanted. ",
            "Since your mom has been telling lies to solicit money, check on other ways she may have done this, for example opening credit cards or loans in your name. Get your credit reports and lock down your credit. Ask around your family and friends to see if anyone else has heard a sad tale of misfortune from her which required cash to fix. Has anything of value gone missing?\n\nTo stoop this low for money could indicate either a drug or gambling addiction; or could be plain old greed. Either way I'd consider she's burned all her chances for this lifetime and if you choose to have anything further to do with her it should be on a tough love basis.",
            "Wow.\n\nOk, so first of all, you should reach out to the couple that adopted your child and tell them that you just found out your mother reached out and was asking them for money.  Tell them you hope they didn't send her anything because this was done entirely without your knowledge, under false pretenses, and that they should never feel they have to give you OR your family any money, ever.\n\nSecond, have it out with your mom.  She has some fucking nerve trying to capitalize on your pregnancy after how she treated you.  And all of her apologies are called completely into question now that you know she did this.  ",
            "Reach out to the family personally, apologize for your mother's manipulation, offer to repay anything they sent to her (if you are able), request that they dismiss/ignore any further requests from your mother, and then go no contact with your mother.    \n   \nThis individual sounds toxic. Any involvement you have with her will be opening yourself up for stuff like this.  ",
            "Your mother threatened to cut you out of her life because of the child and now she's using that same connection for financial gain. Completely disgusting thing to do and I really don't think I could forgive my mother for that. \n\n&#x200B;\n\nIf I were you, I would contact the family and apologize for your mother. Explain how she's being manipulative and that they shouldn't be supporting her financially. If you are able, I would consider trying to pay back some of the money your mother accepted and try to handle this with as much as as possible.\n\n&#x200B;\n\nIf you never want a relationship with your son, that's perfectly fine and something most people would understand. If you ever change your mind, you want to keep that door open but regardless, you wouldn't want that family to be financially strained by your mother. That's not fair to them and that strain certainly is not fair to a 16 year old who's probably planning on going to college in a few years. ",
            "Well, first I would pack my bags and leave, after telling her what sick POS she is. Then I'd email the man from my personal email address so that they know it's not from my mother, and tell them the truth, and not to give her any money. Then I'd block her from my life, and I'd never look back. ",
            "You're mom is a manipulative lunatic. I'd take this over to /r/raisedbynarcissists\n\nYour mom doesn't deserve forgiveness. Someone has to be sorry for you to forgive them. It sounds like she's never changed.",
            "Contact the family to set the record straight. She is a reflection on you unfortunately. If she did take money pay it back if you can. Sever ties with her. To basically force you to give up a child and then only want to take from him is atrocious. I can see why you stopped speaking to her for 6 years. Looks like it’ll be another 6 at least. Please cut ties. She can only think of herself",
            "Send him an email. \"This is Tapjama, I just came across an exchange that my mother initiated with you where she seemed to be asking you for money. My mom is completely wrong to have done that, even if I was in a bad place, which I wasn't. I wasn't aware she was going around using my name and lies to try to get money off anyone.\"\n\nNow, you can either try to get some details out of them, which I'd suggest doing through some sort of \"I have no idea how her correspondence with you went after you exchanged phone numbers over email, but I'd like to offer whatever I can do to make right what she did\" and see what they tell you. Or you can confront your mom right now, before you sent the email, about what she did and figure out what she actually did so you know specifically if she got money from them. If she says they didn't give her money, inform her you'll be contacting them and confirming her story considering the exchange itself proves she's willing to lie for money, so if she's lying you'll know soon enough. Don't give her time between asking her and contacting them if you get a story at all. If she says she did get any money at all, tell them, \"I've confronted my mother and she said you gave her money. I want to offer you that money back. How much did she take and how do you want me to return it? Cheque, paypal, cash, ect?\" \n\nYou could also try to do this over the phone with the number she got, though depending on how her contact with them went, you might find the number disconnected (worse case scenario, you can know she burned them bad if you find this) or that they won't give you the chance to say your piece if she really hurt them in your name. Emailing gives you the chance to get all your apologies and \"I had nothing to do with this I can't believe she did that what can I do to fix its\" out where they can read it before they respond. Your call. ",
            "if you found the open tab, she was probably looking up the phone number in order to call them to ask for more money. Call them right away tell them you don't need anything and to disregard any communication from her.",
            "**CUT CONTACT**. Why do you think you deserve this kind of person in your life? You realize that you don't owe her anything for giving birth to you, right? Your family is toxic, cut anyone else who tries to guilt you about this out too. They do not care about your needs. ",
            "I gave up my baby for adoption and mtyparents were shit about it too, if you need to talk to someone who understands you can feel free to pm me",
            "Your mother is a despicable person. Cut and run, contact the family and apologize on your mother's behalf, make sure that fence doesn't need to be mended.",
            "Contact them personally and explain that your mom is mentally ill/manipulative and to stop all contact with her for the well-being of their son/you/them. Then kick your mom out and change the locks. \n\n I’m sorry you have to go through that ",
            "[deleted]",
            "[deleted]",
            ">I'm beyond upset now and don't even know what to do or say going forward. I've locked myself in the bedroom and trying to wrap my head around this. Thanks for reading.\n\nEveryone has already covered how you should deal with the adoptive family, so I won't address that. Regarding your mother and the extended family:\n\nSend yourself the evidence of what she did, just so you have it. You might need it in the future, it's hard to say. If you don't know what to do right now, I would advise not doing *anything* until you're able to get away from her and the family that you're visiting. It's OK to take some time to think about all of this before you confront her. It's OK to just cut her off without confronting her. It's OK to publish the email she sent that family on Facebook if you really want to (though I would personally advise against it). My point is that you don't need to make decisions about anything right now, but obviously, I would advise that you take the time to grieve the fact that your mother is who she is. It's a terrible misfortune to be saddled with a parent like this, and I'm so sorry.",
            "Wow. Your mother is a real .... piece of work. I have more uncharitable words to describe her but thats neither here nor there.\n\nSo first off, you've already moved on from any relationship with the adoptive parents, so technically there's nothing for you to do here. However, two things. First off your mother is tarnishing your reputation. Second, Im sure the adoptive parents would have been quite fine to not hear from you or your mom ever again. Im sure they're quite sincere in wanting to support you keeping involved in your child's life... but as an adoptive child myself whose bio parents remained unknown to me, I could imagine the shock on my adoptive parents if my birth mother (or grandmother) showed up one day, blamed ME and my existance for their shitty lot in life, and demanded money. Thats some gall. The word unmitigated comes to mind. My mom, if she were still alive, would punch that person in the face. Like, I don't even understand how she thinks that should work? What do the adoptive parents owe her OR you? Bonkers.\n\nSo, if I were you I'd get out in front of this one. Use your contacts with the adoptive parents and explain (Not in much detail) the situation, explain this your mom and NOT you, you have nothing to do with this, and that any demands or requests from your mom can and should be safely ignored, or referred to their lawyer. p.s. thanks for giving my child a wonderful life and give them a big hug for me.\n\nThen confront your mom. Explain what you did. \"Were you snooping on my phone?\" \"No, mom. <bioparents> still have my contact info from long ago, they said you reached out to them, they got concerned and reached out to me. Needless to say I was a bit shocked at what they had to tell me. Mom, do not contact them again and stay out of it!\"\n",
            "Yikes, OP. That's truly terrible and inappropriate of your mother. Interesting that she had an email open from August. Makes me wonder how much non-email contact they've had since then, or if she was getting the phone number again. \n\nI agree with the other commenters: get in touch with the family ASAP. Explain the situation openly and honestly.\n\nIt was great of you to help out your mom in her time of need, and great of you to help her find housing. Now she's not only abusing _your_ relationship with her, but the relationship you maintain with your child's family. She's leveraging a fake bad situation with you for her financial gain. Unacceptable. If you're actively staying with your mother now, it may be wise to cut that visit short. If she's willing to go to those lengths, there could be other bad behavior afoot. I'd recommend pulling your credit report to ensure there's nothing else going wrong, at least there.\n\nOnce you're done with your visit and have heard the full story from the family, it's time to calmly, simply explain to your mom what you found, and that you will be not be in touch with her again.",
            "One time, when I was in my early 20's, I had moved to a new area and had a new job.  I had just recently made a few acquaintances but no one I would have called a friend yet.  And that's fine, I'm not really social anyway so that was fine.  But my birthday rolls around and I get a shit ton of texts from the new acquaintances.  I find it kinda weird and mention to my now ex-wife and she tells me that she got numbers from my phone and texted everyone to tell them it was my birthday and to ask them to text.  I understand she wasn't trying to be malicious, but as someone who, as I said isn't too social anyway, I was absolutely mortified.  Totally fucking embarrassed.\n\n&#x200B;\n\nMy point here is that my story is a fraction as mortifying as yours and my head was spinning from that alone.  I couldn't handle the embarrassment you must be dealing with right now.  I'd change my name and movie to Scandinavia.",
            "I beg you to update OP",
            "Tell your mother if she ever contacts them again you will cut her out of your life completely.",
            "I am a recent birth mom. I gave birth to my daughter 3 yrs ago, and we did adoption. The first thing I would do is apologize on behalf of my mother, and let them know they should consider blocking her email address just in case she sends more. \n\nI don't know how open you all are with each other, but if you feel comfortable with it, and they're anything like my APs (adoptive parents that adopted my daughter): They will appreciate you confiding in them enough to let them know about the strained relationship with your mum. ",
            "No more forgiveness for her, *ever*. She doesn’t deserve it and a person like her is incapable of change.\n\nContact the family, apologise and make clear that they should ignore any and all communications from your mother. Be honest; let them know that she is manipulative and you are considering/going to cut contact with her. Let them know that you consider this unforgivable. Give them an email address (set one up especially) that your mother doesn’t know and couldn’t guess the password to. Tell them that if you do contact them, it will be from that email address or via a phone call. \n\nI’m so sorry that she’s the mother you got. You don’t owe her a damn thing. Personally, I’d keep copies of those emails so that down the line, if people start pressuring you to be in touch with her again,  you can show them what she did and tell them to back the hell off.",
            "Totally get on front of this. Contact the family, say you have nothing to do with your mother's initiative. Apologize on her behalf and make sure they know never to trust her. Furthermore stress the fact that you don't want her actions getting in the way of any future relationship you and their/your son may have. You're afraid he may think you stuck around for money and that's not the case. \n\nSecond,  call your mother out. Tell her it was extremely disrespectful and out of line.  A huge breach of trust and to fuck off. Toxic will always be toxic. Cut it out for your own sake... ",
            "You should head over to r/justnomil, your mom is a doozy.\n\nTo echo others: make sure the family knows that they do not and will never owe you or your family *anything* and that anyone who says otherwise *does not* speak on your behalf. Solid wtf on your mother.\n\nHow to proceed with your relationship with her: don't? If that's not an option, gray rock the shit out of her (be boring and give no details), and if she says anything about your living/working situation let her know firmly that she's shown she can't be trusted with that kind of information then continue to gray rock the shit out of her. Personally, I wouldn't be fixing her computer nor doing her any other favors.",
            "Everything I would have said has already been said, so I just want to take a moment to say something else.  \n\nI can't believe he didn't tell her to get lost in his first reply to her.   He certainly would have been justified in doing so.  But, to me, the fact that he let it progress to exchanging phone numbers demonstrates he is truly concerned for you.  He must be a very kind and generous man.  If any good can come out of this awful situation it must be knowing that the child you gave birth to so many years ago has such a man for a father.  I think you chose very well.",
            "Firstly, tell the family that you don't need the help. Next, confront the fuck out of her.",
            "You should share this on r/raisedbynarcissists to help you through the emotions and to know other people have gone through things like this.\n\nBut as all the other comments have said, you need to contact the addoptees.\n\nAll the best *hugs*",
            "A few thoughts come to mind:\n\n1. Forgiveness does not require the other person to be sorry. Forgiveness is for yourself and is a totally personal choice, either way. If you choose to forgive your mother for her past and present poor behaviors and treatment of you, more power to you! It, however, does not mean that you need to maintain a relationship with her, if you so choose. *I have no contact with my own mother but, I do forgive her for her past and how it has impacted my life over the years. It makes me feel better knowing I bear her no ill-will but, I also don't need her in my life - I have a full family, having been raised by my aunt and uncle - and, after years of therapy, I know that my choice is not only valid but reasonable.* If you choose to cut ties with your mother after this incident, you would likely be doing yourself a major favor. You also, might incur the upset of the rest of your family but, ultimately, it is your choice and your choice, alone.\n2. As others have said, if you have not done so already, reach out to the adoptive family and assure them of your lack of knowledge regarding your mother contacting them. If they did send money, I'd offer to pay it back (if you're able to) even if it means in payments; they should not have had to bear the brunt of your mother's financial struggles any more than you should be having to deal with this at all! \n3. I would suggest that you encourage the adoptive family to not have contact with your mother unless Son wants to have contact. That should be his choice.\n4. I hope all the best for you. You sound like you've tried your best to do what's right by everyone. Now it's time to do what's right for you - whatever that looks like. Live well.",
            "Ever considered that your mother is a narcissist?",
            "Lying to get money & coming up with scams to get money are red flags that your mom may have an addiction.  Recently experiencing major life stressors like health problems, unemployment, homelessness, and the end of a marriage are all also risk factors for developing a substance abuse problem.  They could even be directly related - for example it could be the reason why she lost her job and/or her marriage ended, or she may have become reliant on medications prescribed for the health issues.  People often go to great lengths to deny and hide it when this is the case, so you might or might not get anywhere by asking or confronting her.  But do look for other warning signs, like mood swings, lack of energy, etc - you can easily google lists of warning signs & behavioral red flags.    \n\n\nYou have to confront her about the emails regardless, and I would make sure to ask her \"what led you to do such a thing\" and let her flounder a bit to answer that.  If she says that she really needed money, press her on what she needed it for, and depending how cagey her response to that is, you could directly ask her if she's using to gauge her reaction (eg \"Mom, are you using any drugs? I'm concerned about you\"). ",
            "If your mother has been shaking these people down for money under the pretext of you asking her to do this, could their be legal repercussions?  Like extortion?  Bc if I were the adoptive parents and this started happening I would feel threatened.  Who knows what she has been subtly hinting at?  \n\nYes, you need to contact the adoptive parents and tell them to ignore any further contact from your mother, and if she has already taken money try to return it. Perhaps by selling the lap top you bought her.",
            "I’m a birth mother as well, also had a falling out with my mother for a few years— so I can relate on those points. I would be pretty upset if I found out my mom had done that. I personally would confront your mother and tell her she acted inappropriately. If you don’t feel comfortable reaching out to the adoptive family then by all means don’t! That could open a weird door and I know I have a lot of anxiety surrounding the relationship I have with my daughter’s adoptive family. But if you do have an interest in telling them how your life is really going and to explain your mom stepped out of line then that would be ok too. Either way, your mom needs to know she absolutely crossed a line and disrespected you. I’m wishing you well! ",
            "Agree with the advice saying reach out to the family first specifying this is not a stable family relationship, and not only will you never ask them for money, make sure you tell them that you understand continued contact with your mother will not be appropriate or beneficial to your child. ie lGNORE HER MESSAGES going forward. They need to know that this isn’t contact they should maintain. ",
            "Sounds like your mom might have borderline personality disorder. I wonder if she was planning to keep the money for herself? I would contact the family to find out what she said. Sorry this happened, sounds tough. My mom is a little similar ",
            "Your mother is a piece of shit. You've made enough of a (one-sided) effort with her, the only way to protect yourself from future hurt is to cut ties with her completely. I'm sorry you have to deal with what she's put on you.",
            "Cut your mom off and move on with your life.  ",
            "Your mother is an awful person. ",
            "Do you have an update? I hope you're doing well",
            "The most important thing that you must do is contact the family and explain what just happened.",
            "Contact the family and explain that unless they hear from you they should disregard contact.... but just be aware that this is likely to damage somewhat the relationship with the adopted family. Your mums crazy behaviour stinks.\n\nThat aside, a lot of your post is you doing things in part because your family or your mum or someone else wanted you to. Your 35, cut that influence they have over you. Not least because it seems they make decisions for them and their own interests, not yours ",
            "Contact the family that adopted your son and explain this whole situation, I’m sure they’ll understand. Best of luck",
            "Well from what I been through my parents robbing me of everything untill I had nothing life is hard anytime we think it’s ok to trust someone it comes right back to haunt you untill it gets so bad it’s hard to function. Everyone in my life is toxic on some level but lucky u your not stuck somewhere bec they robbed you of every dime u had. My father took everything I had every dime in my bank account now I struggle trying to get into school even having somewhere to live is hard. I ran off to someone I been talking to for a year, it’s so hard to keep him happy. My mate gets really drunk n angry at me for things I can’t help like how poor I am right now from living with the man I am suppose to call father",
            "Coming from a family where my father is a raging alcoholic and mom is extremely dependent on having a relationship, I commend you for your decision to give your son to a family that could love him. As far as your “mother” is concerned, I would cut her out completely. Don’t let the word guilt define what this really is, which is her being a manipulative user. She knows you and that you’d never leave her hanging, but you have to be strong for yourself. Ask the family of your son to block any and all avenues of communication with her and to possibly change their phone numbers so that she doesn’t go lurking anymore. You’re strong and have a great head on your shoulders, you can make it through!",
            "I just want to tell you I have great respect for you. You adult better than most adults.",
            "Your mother is very wrong with this and you need to say to her. Any money talk for children needs to happen in the original negotiation. ",
            "Is your mother ever not a colossal piece of shit? Old and sick pieces of shit are still pieces of shit.\n\n> I made peace with her for the sake of the rest of our family\n\nThe only sake you need to be worrying about is yours, and it sounds like nobody is.\n\n> I succumbed to the guilt provided by my family\n\nThey’re quite shit too, sounds like.\n\nSo you wanted to keep the kid in the first place? And your mother forced you to give it up for adoption so she could save face or whatever? ... and now she’s trying to profit from the family that took him?\n\nYou know you don’t have to have contact with this person? You don’t *have* to be in the same room as her, ever. Your needs, wants and bodily autonomy matter, and they matter much more than “family drama” that was caused by your shit mother. Oh she’s all alone because she treated everyone around her like garbage? You should have left her in the damn street.",
            "It might be time to cut her out of your life - she sounds manipulative and a total nightmare.",
            "[deleted]",
            "[removed]",
            "This is some really sad situation you have in your past and whilst not knowing the details I sincerely feel sorry about having to adopt your son and what unfolded with your mother, no one deserves the way your mother treated you.\n\nThat being sad, whilst not at all agreeing with what she has done; I want you to stop for a second and try to see the intention behind her actions, which was ultimately coming from a point of guilt on how she has treated you in the past as well as motherly love trying to help her daughter.\n\nAgain, not agreeing at all about how she went around doing things, do take in the fact that you guys have spent 6 years not talking. That shit doesnt just disappear... perhaps not knowing how to ask you to let her help her/ coming from a place of powerness unable to help you out of a rough patch drove her to make these decisions.\n\n\nI would have you try to be the better person about this, have that honest conversation with her about boundaries and be the better person forgiving her. Ultimately you will be better off in that mindset.",
            "Your mom is older forgive her for what she did, don't tell her that you are aware of this. In 2nd place meet the family and clarify the things. You don't have to feel bad about all this matter."
        ]
    },
    {
        "post_id": "8q157i",
        "author": "Partythrowaway6",
        "title": "UPDATE Dad (50M) wants me (24F) to change the location of my son's(1m) party.",
        "url": "https://www.reddit.com/r/relationships/comments/8q157i/update_dad_50m_wants_me_24f_to_change_the/",
        "score": 5022,
        "num_comments": 73,
        "created_utc": 1528641026.0,
        "selftext": "Previous post is [here](https://www.reddit.com/r/relationships/comments/8jv0jy/dad50m_wants_me24f_to_change_the_location_of_my/). \n\nThanks to everyone for their advice and sharing their personal stories. It really helped assure me that I wasn't crazy. \n\nI decided to call my dad's bluff and not change the location of the party. They text me a week ago saying I hadn't updated them on the location of the party. I simply said \"Son's party will be on this date and time at our house.\" The reply was \"well maybe you all can come by the day after\". I didn't reply and just went about my business. \n\nThe party was yesterday and surprise surprise they still showed up. My dad decided to sit on the back porch the whole time and kept trying to get me to move the cake and sing happy birthday outside (which I did not do) and wanted to get the song out of the way as soon as possible. I was too busy talking to guests and hosting to even entertain him. His wife stayed in the house most of the time and even offered to help with setting things up. \n\nAt the end of the day, it was all about my son and everyone had a good time. My son even slept through the night which he never does, so win for me. \n\nTl;dr Didn't budge on location, dad showed up anyway\n\n\n",
        "permalink": "/r/relationships/comments/8q157i/update_dad_50m_wants_me_24f_to_change_the/",
        "comments": [
            "> dad showed up anyway\n\nHah!\n\nCongratulations on getting through this one. Hopefully it gets easier for you to deal with his behavior now that you know you can set good boundaries. I rather love it that he still decided to have a token protest and everyone ignored him.\n",
            "Excellent update!\n\nI enjoy how you were graciously immovable with your father, and then to have your son sleep through the night is the cherry on the sundae of his birthday.\n\nWell done OP :)",
            "Sounds like your Step-Mom is a nice human, and behaves like an adult. Glad you at least have that in the paternal family unit. ",
            "Your dad is such a baby. I scoffed out loud when reading about how he pouted outside the whole time and still tried to control things. That is definitely something that needs to be shut down forever and always. You did everything perfectly!\n\nAnd happy birthday to your little guy!",
            "GIRL yes! Nicely done. Way to prioritize you and your family. Congrats for the night sleeping. ",
            "Ha! Well fine, I’ll come, but I’ll sulk in the back porch! You can’t make me have fun! \n\nYou’re well prepared for your son’s toddlerhood, because you’ve already dealt with that behavior from your dad. ",
            "Congrats, sounds like your son had a good party and your spine got stronger as well. ",
            "Sounds like your step-mom is nice :)",
            "Yay, what a happy ending! When my husband and I got married, we had eight parents between us (all four had divorced/remarried) and pretty much none of them got along with any others. (Including several of the couples who were CURRENTLY MARRIED TO EACH OTHER.) Parent politics are no joke. Take your wins where you can get them. Haha.",
            "Cherish that stepmom! A lot of step parents would have sat outside bitterly with your dad so kudos to her for being a good sport & supportive ",
            "I remember the first time my son slept theough the night. It was so magical...\n\nHad similar problems with parties and my in-laws. They eventually got the message that it was our family, not theirs.",
            "You handled this so well. Nicely done calling your father's bluff and then not giving in when he sat outside moping. \n\nHopefully this sets a new tone where he knows you won't be pushed around. ",
            "Yeah I can understand a little what it’s like for your dad to act that way. My dad will separate himself from the rest of the family if I stand my ground or prove him wrong on something he was adamant about. Good ok you for not caving!",
            "I'm glad to hear your step mom was able to separate herself from your dad's issues and socialized and made an effort. She sounds like a good person (she tried at least). Glad your son's party went well!",
            "That etiquette remark about 'neutral ground' really pissed me off. The etiquette on divorce is that you treat divorced people like grown adults who can act like normal people that can be in the same room with each other during family celebrations. ",
            "It sounds like the baby didn't cry too much and spoil the party.\n\nYour son behaved himself, too.",
            "Good job hun! I hope this is the beginning of you developing strong boundaries with your dad, sounds like your stepmom will be a support with that.\n\nBelated happy birthday to your little human as well. ",
            "Okay, so your dad is baby and this was a tantrum. *However* it is nice (and a change for this subreddit) that he cares enough about you and baby to still attend. \n\n\n\nI read so many stories like this where the parent is having a spit and to spite the op they refuse to attend the wedding/ graduation/ birthday /huge life milestone. So they miss out over pride and everyone ends up hurt.",
            "Good job! You just taught your dad a very valuable lesson. Where your family is concerned, you do not give in to tantrums. I only saw this post so had to go back and read the first one. Proper etiquette?!? He got that one wrong. Actual proper etiquette says that you don’t make other people carry the weight of your past choices, and you either learn to behave like an adult in uncomfortable social situations or you keep your ass at home. ",
            "oh this is a satisfying update. I remember your original post and I was JONESING to hear back from you. You handled his tantrum perfectly!",
            "I’m always amazed at parents who teach children things like “be the bigger person” or “forgive and forget” and then come up with stuff like “it’s customary to accommodate your parents because they made mistakes years prior and refuse to be the bigger person or forgive and forget.” \n\nGood on you for making your child’s birthday party about your child and prioritizing the comfort of your son above and beyond the expectations of your father. You’re setting the tone for the future of your relationship with your father where he knows he can’t bend you to his will. ",
            "lol your step-mom behaving better than your dad and being a nice non-drama person. glad that it all worked well!",
            "Dad was trying to pull a power move and then came to sulk for a bit when he didn't get his way (by nitpicking about the birthday cake and song). Good on you for not budging! Hopefully he respects you and your decisions more from now on. Maybe step-mom can/has talked some sense into him?",
            "Woo! Glad you stood your ground & that the party went so well! ",
            "This is Mom level 600. Excellent job, op",
            "You're awesome and your kid is lucky to have you as a parent. So glad you stood your ground!",
            "Some adults just act like toddlers and you have to treat them like toddlers. Good job.",
            "Great boundary work! It’s hard work but it gets easier. ",
            "Good for you for going ahead with the party as planned. If he hadn't have shown up, it doesn't sound like it would have been a loss, anyway. Keep setting healthy boundaries with Demanding Daddy. ",
            "\"Way to go, Dad. Make your grandkid's party all about you.\" ugh.\n\nI'm sorry you had to go through this. Your dad sounds like a child. I hope he makes more adult decisions regarding his relationships with you and your son in the future.",
            "Congratulations, Now you know the kind of person your dad is.... I totally agree.\n",
            "\\>  My son even slept through the night which he never does, so win for me. \n\n#parentingwin\n\nOn a separate issue, it sounds like his new wife is a decent human being, which is always helpful.",
            "Good for you! It's not your job to keep him from pouting. The one year old is the only baby you're responsible for! \n\nStepmom sounds like a reasonable person. I bet she told him to stop being a fool and go or miss out on the grandbaby. ",
            "Be proud of yourself. You did a great job managing the situation.",
            "Nice job! He moped outside the entire time? What a baby. You should call him out the next time he lets his adult baggage get in between him and his grandchild. ",
            "I love it, way to be a badass and handle the situation well. ",
            "Sleep training your child seems eerily similar to assertion training your parents. Nice work. ",
            "mfw dad's a tsundere",
            "Why are you having a party for a one month old? :/",
            "[deleted]"
        ]
    }
]