[
    {
        "post_id": "j9skka",
        "author": "trashcanroamntic",
        "title": "UPDATE - Boyfriend has stopped being romantic completely",
        "url": "https://www.reddit.com/r/relationships/comments/j9skka/update_boyfriend_has_stopped_being_romantic/",
        "score": 4997,
        "num_comments": 156,
        "created_utc": 1602515283.0,
        "selftext": " \n\nHere's the link to my original post here : [Original](https://www.reddit.com/r/relationships/comments/j7ftmw/boyfriend_has_stopped_being_romantic_completely/)   \nBut the TL:DR : Boyfriend (18M) has completely stopped flirting with me(18F) and I'm not sure if I'm being needy while he's at school and how I should approach him about the issue.\n\nI just want to say thank you to the original people who commented and reached out to me, I was very emotional at the time and needed some sense talked into me.\n\nThat day I made the post, I was supposed to hang out with my friend and her friends, so I had sat down with them and asked for advice. They basically said the same thing everyone here did and I guess seeing their in-person reaction to me explaining everything that had happened made it click that something was really wrong. After getting over my fears of me being right, I asked him if he still wanted to be with me. While he didn't say no, he said he enjoyed his newfound independence from school and not having to worry about anyone else. This confirmed what I already knew and I knew he wouldn't directly say he didn't want to be with me anymore, but I still got my answer in a way. While I'm hurt, I think I had already grieved the relationship during it, since I spent a lot of time crying and wondering what had happened between us. At least now I can move on instead of holding onto every small sign that he might still like me.\n\nI wish he could have just been up front sooner, and just told me he didn't want a relationship when I kept trying to flirt or be romantic instead of just ignoring those moments, as it just left me confused, and I wish I could have avoided this completely but I suppose it's a lesson learned. I deserve someone who's going to reciprocate my feelings and affection, so I'm excited to see what happens now. Thank you guys for the kind words and advice.",
        "permalink": "/r/relationships/comments/j9skka/update_boyfriend_has_stopped_being_romantic/",
        "comments": [
            "This will be a huge weight lifted from your heart before you know it. Being direct is so important and saves so much pain in the long run, even if the experience isn’t pleasant (aka is devastatingly sad) when it’s happening. You’re better off and you’ll be just fine. Be gentle with yourself and focus on self-care and having talks with friends or finding little distractions.",
            "One lesson I wish I had learned earlier in life (I’m 36 and happily married now) was that if a relationship is “confusing” it’s not working. When in a happy functional relationship you won’t feel confused. People are often cowards when it comes to breakups. They are afraid to hurt your feelings so instead they lie and conceal how they feel which ends up being even more painful. That’s why you feel confused. Realizing this will make it a lot easier to know when to move on in the future and probably save a lot of heartache <3",
            "It's a coward's breakup. Act distant and unavailable until she breaks up with you. I've definitely been on the receiving end of it, and it shows someone way too immature to be in a relationship.",
            "Something that's helped me in times like what you're going through, is remembering that even the bad times/bad relationships teach us about who and what we want in a partner/relationship. \n\nIf you learn something from a mistake, it stops being a mistake and becomes a lesson.\n\nI'm sorry you're going through this OP, it really sucks. I hope you reach out to your support system during this time, and you might even want to seek a few sessions of counseling, just to help you work through it. ❤️ Hang in there.",
            "Hugs xoxo good on you for being brave and upfront.",
            "I'm so proud of you for choosing what is best for yourself and your well being (◍•ᴗ•◍)❤",
            "I want to validate your feelings completely but also let you know you are 18 and there is so much more time to find someone who values you as a person. Never settle for any less than that!",
            "Oh my goodness, I’ve just gone through the exact same thing. They barely talked to me for a month, and after weeks of having to beg for basic attention and constantly worrying that I was being too needy, they dumped me over text :/ \n\nIt really hurts to not get even basic respect at the end of a relationship, but don’t let it mess with your self esteem. You can and will do better! Go enjoy your new freedom now that this coward isn’t holding you back 💜",
            "You are super brave and at only 18. Plenty of people who are old enough to know better stay in relationships where one person has clearly lost interest.\n\nI hope you know that you are better off without this boi, and you'll eventually meet someone awesome who really deserves you. In the meantime enjoy being single, and keep being awesome.",
            "Reading your post, I really want to tell you — this type of “coward’s breakup” has hurt a lot of people in the past. Your grief over being treated like that is completely valid.\n\nI did want to say that getting to a place in my life where I was with someone who I could trust not to do that to me was an amazing feeling. I promise you will come out of this stronger. I’m so sorry that it happened to you.",
            "We’ve all run across those types of people. Emotionally immature. When you start a relationship with someone that has communication skills, it’s going to feel like a breath of fresh air.",
            "I'm around the same age as you are and I had a similar experience as well last year. I'm glad that you were able to talk to him about it and figure out what his true feelings are. It must have hurt, but it's for the best. As least you don't have to suffer from his mixed signals anymore. Stay strong! It might not be easy, considering you've done so much for him, but you can get through it and move on. Don't be too hard on yourself,, it's not your fault. Do what makes you feel better, like eat tubs of ice cream or something hahaha. I hope you overcome this like a queen!! Take care!!",
            "Boys never know what they want and what they have until its gone. Good for you for getting out of that relationship, you don't deserve to be treated that way. Please don't be hurt over why he did the 180 flip on you, it's not because you're not good enough. It's because he's not mature enough to realize you are. \n\nEvery single guy I've dated under 23 has done a 180 flip on me after being extremely sweet to me for a period of time. Some dudes just can't deal with commitment and usually they happen to be younger- sorry but it's true :( I'm sure there are genuinely nice and mature boys out there, but I haven't met one and don't plan on dating boys ever again as I have luckily met someone who truly loves me and hasn't suddenly woke up one day and told me that commiting to a relationship is too much.",
            "Seems like I need to take all these advices.",
            "This is what men do instead of actually breaking up with someone. It’s like ghosting but they think they aren’t being an jerk because they are still technically talking to you. He is hoping you will just stop messaging him because then it will\nBe like you broke up with him. Some men. Not all of course.",
            "Oh man I wish I saw your original post. I was in a relationship like yours for far too long. He started ignoring me on anniversaries but I thought it was just him being depressed or something. Turns out he was as checked out as I was, so we split. After 2 days of crying about being on my own again u began embracing it. I was liberated and traveled with friends and made time to care for myself, not do another person's laundry. Now I'm dating the man I plan to marry and we're currently looking at houses. Everything will work itself out. Stay strong and lean on your friends if you need to.",
            "good for you. you’re still young and have all the opportunity in the world to find someone worth your while. he sounds very immature if he can’t even handle being upfront and honest about how he feels in a relationship. you dodged a bullet hun , best of luck ❤️",
            "In my experience this is how guys in high school break up with you. Some guys never really mature emotionally and you DO NOT want a relationship with those guys, trust me (I married one)!",
            "Put yourself first. Always.",
            "Girl, you deserve way better. I read your original post and him telling you “you should just kill yourself” - WTF??? Never settle for someone who treats you the way he does - find a man who supports you and loves you for who you are (and vice versa).\n\nAlso glad to hear you are working out; I find it to be truly a great confidence booster! Keep building that confidence and practicing self-love! Your future is bright!",
            "He's a coward. Anybody that does the bad boyfriend/girlfriend routine hoping that their partner will do the hard task of initiating the break up is a coward.",
            "You are SO much better off. Hugs. Don’t give yourself away.",
            "At least now you know where you stand. All the best for the future.",
            ">I wish he could have just been up front sooner, and just told me he didn't want a relationship when I kept trying to flirt or be romantic instead of just ignoring those moments,\n\nGirl, I have SO been there! It’s easy to give yourself permission to keep trying when they don’t explicitly tell you to stop. A better man would probably have handled the situation better. But he’s young and still learning, too. The bottom line is that you must take responsibility for your own wellbeing.",
            "1.  \"I spent a lot of time crying and wondering what had happened between us\" -  sometimes things don't work out. It's nothing you or he did wrong. it's just not right.  This is really hard when both people are good people and it needs to end as neither one want to hurt the other.  It is important to reflect on it, to learn, and to grow.\n2. I was in a similar relationship where he'd be very active on the phone and sending me silly memes and then when we'd hang out he'd refuse to touch me, hug me and basically acted weird.  This got progressively worse and then he started bailing on dates and plans...the worst being one time when he went gambling and missed a dinner with my parents....he wanted to stay over when he was finished and said something like \"if you wanted something, you should have shown up when you promised, not 6 hours after a game of poker.\"  Later on, it turned out that he'd been video chatting another woman (who he's no married too, no joke) but it all started with lack of affection. To this day, he still tries to pull sway with me and many of my close friends.   \n3. Be assertive moving forward and make you sentiments vocal.  You deserve a relationship where you can be honest about your feelings and needs and vice versa.",
            "Ugh. People like this are awful for not just wasting your time but wasting your heart and affection. Onto bigger and better things!",
            "I’m sorry. Y’all are still so young and it takes a lot of time to get the communication thing right. You deserve better. Some good lessons I learned were: Don’t settle for anything. If things start feeling wrong speak up and if the other person dismisses your feelings, leave that’s a red flag. Even if they don’t agree you can still talk about it together.",
            "Sending virtual hugs. It’s so tough being that age and being involved that way. I am so proud of you for coming to this realization and being mature enough to walk away and know you deserve better. YOU GO GIRL <3",
            "If you're not his \"hell yes!\" Then he is your \"hell no!\"",
            "One of my guy friends explained this type of break up strategy to me where one party does what your (ex)bf was doing to you. I immediately understood how often this had happened to me. Pretty sure I told him how fucked up that was. Pretty sure he still does it to people.",
            "Holy cow he's a coward and to just let you do all the labor of worrying is so trashy. Good riddance. Take care of yourself, and congrats on losing the deadweight 💗",
            "that’s a red flag and honestly your bf is a coward for not talking to you about anything he is feeling or not feeling. flirting should never stop in either end it keeps the romance alive, and if he doesn’t feel the “spark” in the relationship anymore he should simply talk to you and maybe the 2 of you break up OR work on things to fix things. regardless communication and talking to one another is key.",
            "you’re better than me because i would’ve just moved on as if he never existed, since he wanted to ignore you whenever he was in town. you were quite generous to give him the privilege of closure & talking it out.\n\nmight sound childish, but indifference is a drink best serviced ice fucking cold. nothing hurts worse than being ignored & uncared for.",
            "Lots of guys are like this. While the truth sucks it’s so much easier to get it.",
            "I'm so sorry the outcome wasn't what you were hoping for, I wish I'd had even an ounce of the emotional maturity you appear to have at 18.\nYou deserve so much better, your former boyfriend didn't have the decency to be upfront with you and probably hoped things would just fizzle out.\nYou are going to make an amazing partner to whoever is lucky enough to come into your life. As the old saying goes 'you have to kiss a few frogs until you find your prince'\nBest of luck to you.",
            "This happened to me two years ago when I was your age too and I'm now happier than I've ever been in a relationship with a wonderful guy. Know that you've got so many years ahead of you and you sound lovely. I'm sure guys will be falling head over heels for you so yes girl get excited for the future!",
            "Being direct and open is absolutely crucial. As a guy I can vouch that most of us are idiots and will never pick up on and sorts of hints. Odds are he isn’t doing this on purpose but rather he’s just busy and his energy is being distributed to a lot of different places rn.",
            "Sounds like ghosting.  When I was 21, I did worse in a relationship by outright cheating (which I regret), but it seems like he wants to be single but wants you to break up with him.  Sounds like he just wants out but wants you to dump him first.  Spring the trap and dump him, he obviously is neither attracted nor respectful.  You deserve someone who will be more mature than that.",
            "you also deserve someone with the emotional maturity to be able to say when they want to break up, to continue the vibe from your last paragraph. \n\nthanks for posting your update and hang in there! i heard on a podcast once that only 15% of humanity (at most, since not everyone would admit it in a survey) manages to avoid heartbreak - and most of those are people who are in one serious relationship their whole life. think of all the love songs you've ever heard - and realize that even rock stars get their heart broken. it feels inevitable for us ordinary folks. \n\nwhen i got older and looked back on my relationships i remembered them almost entirely positively - even the ones that ended poorly.",
            "Can I ask a completely irrelevant and off topic question? You mentioned he was nasty and discouraging regarding what you are going to school for. May I ask what it is you are going for? \n\nI'm just curious. \n\nI'm glad you are able to now move on! No one deserves to feel unwanted or undesired!",
            "Sometimes... guys are really dumb. I had a similar experience when I was in High School, I was dating this guy for about a year when he ended up changing close to out 1 year anniversary. He didn't want to be in a relationship with me anymore, and he stopped being affectionate and romantic as well. And it left me in a bad spot emotionally. We finally broke up about 2 months after our first year anniversary, and when we were both in a better place I asked him why he didn't just be upfront with me about it, he said that he didn't want to hurt me, so he didn't want to break up because that's what it would do. I told him it hurt much more that he was essentially forcing himself to stay with me and he apologized. Sometimes guys just kinda think like that. Idk why",
            "User name checks out",
            "What a coward!! I’m glad you got your answers and can finally move on from his silly ass",
            "I stumbled upon this thread by accident and I was so incensed by this asshole thankfully ex boyfriend that I signed up. Never get into anything again with someone like this- his initial personality wasn't his true self- his real side came out with the withdrawal and destructive comments. As soon as you see that- run! Someone like this will eventually break your spirit. He is disgusting with the kill yourself comment-I wouldn't say that to an enemy- feel sorry for the next person he cons. Only ever go for someone who you have chemistry with who is kind, fun, mutually supportive and be in a relationship where you genuinely try to make eachother happy.",
            "This happened to me a few years ago. My first real relationship lasted about two and a half years. And for the last 4 months he didn't really want anything to do with me. Not mention he knew he didn't want to be with me but he had my buy a $400 plane ticket from WA to PA so we could visit his family and then told me he didn't want me to come a few days before and that he would not refund my money. We were both assholes, mainly I just hope both of us have grown up more since then.",
            "Stay strong , we're proud of you sis",
            "When you’re reflecting on this, PLEASE be your biggest champion for continuing to put yourself out there with him and making the effort. I feel like so many people do this, get burned and then close themselves off in the next relationship. You continued to put forth the effort and for that you should be proud of yourself. When you find that special person soon, you’ll know it will be worth it.",
            "Hun that boy ain’t shit \n\nI’m only a few years older than you but you got a lot of the world to see especially if you’re still in high school. \n\nTo be honest, when I got to college I was still taking to my highschool summer fling and one week into school I told him I didn’t have the same feelings anymore. \n\nHe was wrong for beating around the bush and telling you to off yourself. \n\nHe couldn’t grow a pair and break up with you. He’s trash babe\n\nI wish you the best!",
            "Good riddance to him. He was trash. Girl, you deserve better. Much better than that.",
            "I'm glad you got your answer, I'm kinda annoyed at how indirect he was tho",
            "You do deserve better op seriously! That was not the best way for him to break up with you quite cowardly tbh but look everything happens for a reason, also look on the bright side you're finally free from the torment and the anguish you had due to this, just know that it's not gonna rain forever, if you need to go get therapy go for it, but yeah just know you are valuable and worth it op, don't ever let anyone make you feel like you aren't. Hope in time your wounds heal take all the time you need before you find someone else. Best of luck!",
            "Girl, good for you.  I stayed in a relationship similar to this for 6 months.  We hung out, but only because I asked. He  said multiple times to my face he rather be somewhere else.  I always thought something was wrong with me, but there wasn't.  It was him.",
            "Are you literally me omg this happened to me too!!! I spent so many times crying too but it gets better once you don’t have to care about what someone is thinking anymore. Boys are such terrible communicators, but once you find one that wants to, it’ll be so great :) hope you’re doing well!",
            "Mine was up to no good and the more I searched the more devastated I was. Ended up getting rescued by the cops due to a life insurance policy he and a friend of mine were going to cash in on upon my demise. Kinda puts a damper on my self worth when the man who I was in love with wanted me dead. I was disposable like garbage.We often do things without thinking about the outcome. Once it's done no do overs. Think about the consequences before acting out.🌡️ [Sunshine 🌞](http://Rescue Me From Myself)",
            "Just want to wish you to have a better guy, person in your next relationship.",
            "I mean I have never been in a relationship and won't know how I will act in it. But to me if don't feel any emotional or physical connection to my partner it feels like a waste of time to string them along when they can be with someone better who can appreciate them. This is coming from a 16 year old that has no real life experiences so my opinion does not matter.",
            "Sigh OP, I know this all too well and was the reason of my last break up with my college boyfriend of two years. I wasn’t as strong as you were to end things and I admit I let the relationship drag on too long  to the point where it has really fucked up my self esteem and view of love. It really does get better - that much is true. Can’t promise less heartbreaks in the future but one thing is for sure- you are much wiser and stronger person now. I wish you all the best.",
            "Op, I am sorry. We've all been there. This is just not the right time. You are good person. Promise us though. If he ever gravels back, don't take him back.",
            "I was in a relationship for three years I thought it was my dream man I thought it was the mr Right I was looking for until he slept with two of my best friends and they have been doing there shit together for months before I know about it. It saddens me every time I think about it but it really made me strong and independent.",
            "I'm so sorry, I know your pain, my soon to be ex wife spent all this year with another man while I have been serving in korea, it is easily the most painful thing I've faced since I've never opened up to someone as much as her and I thought we had a great connection, I've been struggling with my self confidence and havent been eating or working out as much and just kinda shut myself in my barracks room, I understand your pain and it will get better",
            "Wow, I never thought this would blow up like this. I just wanna thank everyone again, as it's been hard for me. I thought I would get over it quickly due to knowing something was wrong, but that's not how it works obviously. I really appreciate all of the kind words, as I truly thought I was being dramatic at the time, but I can't express how much this has helped. I really hope this helped someone else with their own relationship and thank you guys for sharing your experiences with heartbreak like this. I can't express that enough.",
            "Dam so you won't be sad brake up with him before he dose",
            "You seem like a sweet young lady, anyone would be lucky to have you as their partner. There's always a lot to learn in life lol stay up ✌️",
            "Im happy for you, he didnt want to hurt your feelings and its clear you know that hopefully you guys can still be friends",
            "good attitude my dear keep that attitude and when youy get another man be sure to be flirty with and romantic with him for me i would and do eat that up dont be discouraged about it because this dude didnt have the common decency to talk to you about his intensions its really cowardly if you ask me. Just ready what you have written i see a very brit cheerful sunny day by your attitude it is very refreshing i sense you are devoted and loyal that makes the picture of you even brighter thank you because you have brighten my day",
            "Learn more to trust in yourself and what you see other than throwing your eggs headlong into one basket and looking for validation in others/him. Best of luck!",
            "I feel like it’s time to breakup. If he doesn’t want to be with you & isn’t putting in work into your relationship, it’s a dead relationship. Best to cut losses & leave immediately.",
            "[deleted]",
            "tbh 18 is an weird age! mind changes in a minute in a second.  i cant really blame this age!",
            "No, girl! Don't let him go! Dating sucks.",
            "Because he got what he wanted"
        ]
    },
    {
        "post_id": "7jfdqt",
        "author": "iCantEmpathize",
        "title": "[Update] My [23/M] girlfriend [21/F] of 1 year is going through the loss of her brother, but I have a hard time empathizing with people. I can't give her the emotional support she needs and I feel like an asshole.",
        "url": "https://www.reddit.com/r/relationships/comments/7jfdqt/update_my_23m_girlfriend_21f_of_1_year_is_going/",
        "score": 4986,
        "num_comments": 121,
        "created_utc": 1513125320.0,
        "selftext": "[Original](https://www.reddit.com/r/relationships/comments/7iwjca/my_23m_girlfriend_21f_of_1_year_is_going_through/)\n\nMy girlfriend and I were sitting on the couch together. Randomly, she said “I love you”, and explained how grateful she was to be with me. She told me I was making it a lot easier to grieve her brother’s death, and she wouldn’t know what to do without me. She said I was the best boyfriend she could ever wish for and my company alone was helping her tremendously.\n\nI couldn’t believe my girlfriend. She'd witnessed her brother die, was still grieving his death and yet could still find the strength in herself to make my day a little better.\n\nI turned soft -- I felt something inside of me… something I’d never felt before. My eyes started to water. I couldn’t believe it. I was going to cry. My girlfriend saw this, and she couldn't believe it either. That was my trigger. I started bawling. For the first time in my life, I cried. I was embarrassed.\n\nShe started crying too, we embraced each other. I cried with her until my tears ran dry. I told her how much I missed my brother. I told my girlfriend how afraid I was of losing her because of my lack of empathy. I told her how unfair it was for me to put my emotional distress on her. \n\nMy girlfriend was very receptive. She said it was okay for me to be emotional around her. She said helping me find my lost emotions was the most meaningful thing for her in the world.\n\nMy understanding of life has changed for the better ever since that day. I feel like a *real* human being. I’m able to understand what my girlfriend is going through. It took me 8 months, but I’ve finally started mourning the death of my brother. \n\nMy girlfriend has been a lot happier these last few days. She says it’s a direct result of me finding my emotions. This couldn’t have been possible without her. I'm so grateful to have her be a part of my life. My love and undying gratitude for her can't be translated into words. She's the only woman that gave me a chance after hearing about my “condition”, and the only one to help me with it. I couldn't ask for more from my girlfriend. I love her. \n\n---\n\n**tl;dr:** My girlfriend and I were sitting on the couch together. She said she loved me and gave me compliments for being a great boyfriend. My eyes watered and I cried for the first time in my life. I told my girlfriend how afraid I was of losing her. I told her how much I missed my brother. I told her how unfair it was for me to be putting my emotions on her when she's in a time of need. My girlfriend reassured me. She said helping me find my emotions was the most meaningful thing in the world for her. \n\nMy understanding of life has changed since then. I feel like a real person now. Someone who can express the full range of emotions that a normal human should be able to. This all happened because of my girlfriend, I love her so much. I can empathize with what she's going through now, and fully support her in her time of need.",
        "permalink": "/r/relationships/comments/7jfdqt/update_my_23m_girlfriend_21f_of_1_year_is_going/",
        "comments": [
            "Very happy you’re able to connect with your gf in a meaningful way :)  \n  \n  Just a head’s up, there’s a chance that the reason you haven’t been able to feel things is because something (very possibly the death of your own brother) sent your brain into panic mode where it felt completely overwhelmed by the circumstances and responded by damming up all of your emotions to prevent them from flooding you.  If this is the case, then you finally crying means that dam has broken, and you may find yourself being inundated with very intense versions of emotions you have little experience with.  This can be scary for everyone involved, and it can’t really be stopped, you can only prepare, warn others, and then weather the storm when it hits.  If you start getting disproportionately angry or sad about stuff over the next few months, you might want to talk to a therapist about getting in touch with your emotions.  \n  \n  Wish you both the best of luck with whatever comes next <3",
            "this is wonderful, OP. i'm so sorry for the loss of your brother, but it sounds like you have a wonderful partner in life to help you through it. ",
            "This is such a great update, you have really helped each other out. I’m so glad that you found an important part of yourself and had someone so supportive with you while you went through the experience. Love this post.",
            "Hey OP, I've read both your posts and some of your comments now. If you ever see this, I'd be happy to talk to you about some of the things you will continue to go through. As I read your posts, I related on a level that is extremely uncommon in my experience. I've said some of the same things as you and continue to wonder \"what's wrong with me?\" as I deal with people I care about experiencing loss or grief and can't empathize. Anyway, this is as much a request as it is an offer, because I still deal with this even after I've successfully gone through similar situations and I find it very helpful to talk to people who relate, of which there are very few (again, in my experience).",
            "Cool that you had a breakthrough, but don't put all your future progress on your partner. I'd look into therapy--maybe start with grief counseling. ",
            "I remember your post. Thank you so much for the update. I'm so sorry for your friend and hope this leads to the best for you.",
            "Both of you sound like you care for each other an incredible amount. I'm glad you were able to work through this :) ",
            "Have you tried psychotherapy? A good counselor can help you,learn how to identify your feelings, which will make empathizing with others much easier.",
            "omg now I'm gonna cry",
            "I'm happy for you OP! Not *that* happy, because like you I sometimes feel rather detached and did throughout my childhood. But happy enough to send some good wishes and vibes, which hopefully counts for something. You got a handful of asshole comments on your original post. Please don't take them seriously.",
            "That's beautiful. Sounds like you have found something truly special. I felt the love through the words in this post. She sounds like an amazing person. You guys will be more than fine. ",
            "On a scale of 1-10 how made up is this.",
            "How wonderful! I wish you guys the best of luck",
            "I'm crying, we're all crying!!! So happy for you OP ",
            "Congratulations, both on this breakthrough and on finding someone with whom you clearly have such mutual love and appreciation.",
            "I watch human beings die everyday at work and can't feel any emotion. But, dammit I was watching the end of Rudy the other day and my eyes start to tear up.  Ur doing better than me or maybe my job is trained me to deal with death when it doesn't relate to me. My uncle passed away I unexpectedly about two years ago and I cried like I haven't since I was a kid. Emotions are a strange thing and can be triggered by any experience in life. I'm just glad i found out I'm still human and things affect me. ",
            "I got teary reading this update! Thanks for sharing. I'm having a shitty day and this way heart warming.",
            "You literally haven't cried and you are 23? Seek a therapist, that's really alarming.",
            "I'm glad you've gotten past the barrier. I used to be exactly like you until I actually went to therapy and met my fiancé and started processing everything. It's going to be a tough but super rewarding journey. Although now I can't get through an argument without crying so there's that to look forward to! ",
            "This is the sweetest thing ever. So good. Awesome 😁",
            "I can't imagine how much that must mean to your girlfriend, that your first real cry was over how much she means to you.\n\nThis is honestly the sweetest update I've ever seen. I wish you guys all the best in your future",
            "I'm going to touch on YOUR grief for a moment. A little personal anecdote-\n\nMy best friend (basically my sister) lost her brother (my dearest friend in the world) to suicide, then just over a year later, another to an overdose. She had no time to process the first before the second, and then her grandma who raised her died. It took a long time for her to finally break, but she did. \n\nEight months isn't that long (in the grand scheme) to go before it catches up. Your girlfriend and you both have been dealt a really shitty situation, and losing her brother was an opportunity for you to start to process your own loss, and to help support her in turn. \n\nIt's good that you (both) aren't pitting one loss against another. I'm glad that your girlfriend was able to see that you had your own loss to process and didn't hold you coping mechanism against you. \n\nI wish you both the best of luck with working through this crap year. Grief doesn't go away, but it becomes livable. ",
            "Looks like OP went all Disney Pinnochio on us. Nice.",
            "This is a happy update!",
            "This is so heartwarming. Sounds like you two really do a lot of good for each other. ",
            "Told ya, you’re an excellent person and partner. Good work.",
            "Dammit, now *I’m* crying! But seriously, good on both of you. Hugs for anyone who wants them. 🤗",
            "You helped me find emotions I haven't had since about last night OP. But seriously, all the best to you and your girlfriend, I probably cry too much haha.",
            "Wow, just reading this OP, made me tear up a bit. I consider myself a bit of a robot as well. But you let open some floodgates. Good for you sir :) And thanks, I needed a heart-jolt for today.",
            "Right in the feels. Oh no Im not tearing up, I just recently been cutting onions...at... 11pm...",
            "This almost had me weeping myself. That must've been an incredibly meaningful moment, for the both of you. Maybe something emotionally shocking in your past had numbed your emotions, but perhaps this has flipped the switch! The best of luck to the two of you!",
            "I came here to tell people to hit the gym and delete facebook.\n\nNot to cry with them.\n\nCongratulations on a stronger bond than you've ever had. Wish you both the best.",
            "She's crying...your crying... I'm crying. We are all crying! But yay a happy update.\n\nI'm so sorry for both your loss and hers. I'm glad you two were able to connect and find strength in each. I hope you two have a long a happy life together. She sounds like a gem. ",
            "Both you and your gf had a brother die?",
            "I'm so happy for you x",
            "This is beautiful. In a sad way. But still beautiful. Thank you for sharing ",
            "Wow OP, this is a beautiful update. Being able to allow yourself to feel that much pain, after holding it back, allows you to feel the positive emotions so much more deeply. I'm so glad you were able to share that moment with your gf, and mourn and heal together. No matter what happens between you, this is a really powerful moment and I'm glad you're communicating and supporting each other. ",
            "Really happy for you. It seems that something was blocking you from certain feelings and not that you don't have any. Do you have any idea how you learned to block off your emotions?",
            "This post makes me really happy! :) it’s just really hopeful.  I’m so glad you were able to connect with her that way - it must mean a lot to the both of you, and must have strengthen your bond immensely. \n\nSorry for your losses ",
            "This is amazing! It sounds like you’re in a great relationship.",
            "This is everything! I feel like op in his situation and maybe one day I can find someone i can comfortably express myself too. Best wishes!!!! ",
            "omg that's such a heartwarming update.\n\nYou've tried your best to support her even though you felt nothing, and she repaid your efforts by being so receptive to you.\n\nOn that day you and your girlfriend is even more deeply connected.",
            "I am so happy for you & your gf, that you have each other. I hope you are happy together forever.\n\nThe best partner is the person who is there for you when things are hard.",
            "Grief is so tough. I'm really sorry for both of your losses, but this step is good. It's not much but I'm glad for both of you.",
            "This was touching to read and it's nice to see I'm not the only one who teared up reading this 😏        \nSo happy for you OP!!!",
            "I would argue that this could be the meaning to life: to feel everything as deeply as possible and to engage with the world around you in a totally new way. Congrats, keep on forging.",
            "this made me tear up. I'm so happy you have each other",
            "Well fuck this is adorable, and what a lovely outcome for such difficult circumstances. I’m so sorry for your loss, and that of your girlfriend. I wish you both peace and healing. ",
            "What an incredible update ❤️",
            "Read through the old post and your comments and you are really a good guy. You may have struggled with empathy at first but you weren’t cold, didn’t ignore her or invalidate how she felt, you tried your best to be there for her and that’s all anyone could ever ask of you. ",
            "And now I'm bawling.\nOP you sound just like my ex who I care for and miss very much. I hope he too has a break through like this one day.\nSending lots of love and best wishes your way.",
            "Congratulations, OP. I'm really happy for you :)",
            "It's scary to be that vulnerable. But it's so comforting when you find that person that will hold you when you cry. I wish you both luck and happiness!",
            "This is a great update, but I would advise you to consider therapy.\n\nIt's all well and good now, but this could be a tiring \"responsibility\" for your girlfriend as time wears on. If you find yourself relying on her to embrace your inner emotions, that can be a problem. There end up being a lot of posts here from one side of the couple who the other partner relies on for emotional support/mental health, and that ends up being not a great dynamic.\n\nI'm not trying to be negative - I love this update - but this is all new to both of you right now so it seems very positive. But just make sure it doesn't eventually cause more of a strain on what sounds like a really great relationship.",
            "Dude - congratulations on finding an area you can grow with your partner on - honestly I think that is the \"secret sauce\" when it comes to relationships - finding ways to evolve together that is mutually satisfying\n",
            "You two sound like the perfect couple! Best of luck with whatever you two experience in the future :)",
            "This is by far the most wholesome update I've ever seen, so happy for you two! Good luck moving forward :)",
            "That's fucking awesome man! So glad to hear this",
            "Gah, so it's onion season apparently. \n\nSo I read the original posting and the biggest thing that stuck out to me was the lack of feeling you had regarding the death of your brother/ even at his funeral. This is actually not uncommon as people block out these things as a self defense mechanism and it sometimes can take quite some time to confront these things. It was clear you had good intentions throughout and had actually done some self reflection. It's great that you could finally express how you felt about him which is always the start to the healing process. You and your partner bonding over this is pretty special as well. Happy for you m8. ",
            "Wonderful update!  Sounds to me like you’ve meet the one you can connect with in that deep level. Once you’re both settled it might be time to make her a permanent fixture in your life. Just saying. \nI think you’ve found the one. Don’t let her get away. ",
            "This made tears come to my eyes as well. I'm so happy that things worked out so well for you. It sounds like you two are both really lucky to have found each other. Hope you two continue to grow and lean on each other in tough times like this. Good luck!",
            "Holy shit, you almost made ME cry with your post.",
            "Dude, congratulations on your insight and your fresh connection with your GF.\n\nLife is so much easier when you can laugh and cry at times. When you show your emotions to your SO, you allow her to be there for you as well! And yes, men cry too (it even gets easier when you get older, lol).\n\nShe sounds like a terrific person and i am sure this will only make you both stronger.\n\nCongrats OP!",
            "Something similar happened to me in the past year. My father passed away in July and I turned to my girlfriend for emotional support. She was very much like you, she had trouble empthasizing and showing emotion. She is on the spectrum and simply couldn't help it. However, her just being there whenever I needed and listening to me was absolutely enough. My love for her grew through that difficult time. This has been the worst year of my life and she has made it much more bearable. She is the shining light of my otherwise dark life.",
            "Buddy, that's awesome to hear. I read your original post and hoped that you'd be able to sort out\n\nI've been guilty of bottling up and stamping down my emotions too, and just being that logical, unfeeling robot. \n\nI've never felt so good as I have in the time I've had my girlfriend who, much like yours, has been a supportive receptor for my feelings, even whilst I've been there to help her through tough times as well.\n\nI'm so glad you guys have found this new layer to your relationship. I wish you all the happiness in the world. Give her a big hug from me, and pat yourself on the back. Keep on shining, you pair of diamonds. ",
            "Hey man just so you know, you’re not the only one like that. I saw my brother get hit and killed by a truck when he was 8 years old and I was 10. We were very close and it was the most difficult thing I’ve ever experienced in my life.  I don’t ever remember crying since then. I’ve never been depressed in my life and I don’t understand people who are. I love life but I really have no interest in most other people. I feel like I go thru life faking interest when I really just wish people would stay away for the most part. I’m married with kids and my wife has told me many times that I’m emotionally detached. She loves me and most people seem to really like me a lot. More than I want them to in fact and I don’t really get why. I can be a pretty sarcastic asshole I think. Many fairly close people have died in my lifetime and I seem to very easily move on from it. Eerily, just as you said, I’ve thought before that if I was diagnosed with a terminal illness, it wouldn’t really bother me that much. Was interesting to see some of the things you said.",
            "What a strange day for rain. Indoors of all places. :')",
            "Damn the new AI learns so fast. ",
            "Awwwww. \\^_^ One of us! One of us! One of us! :D\n\nI just wanted to say I found this update incredibly touching. I hope you learn to embrace your newfound range of emotions, they can be a pain but they're rewarding. \n\nJust know it's okay and normal to be overwhelmed and sad and stressed for days on end. That could take some getting used to if you haven't experienced it your whole life. Anywho, cheers! :D Merry Christmas to you and yours! \\^_^",
            "[deleted]"
        ]
    },
    {
        "post_id": "9qrxn7",
        "author": "justanothergunner",
        "title": "[UPDATE] My [M 18] parents wanted me to break up with my girlfriend [F 18] and I stood up to them",
        "url": "https://www.reddit.com/r/relationships/comments/9qrxn7/update_my_m_18_parents_wanted_me_to_break_up_with/",
        "score": 4947,
        "num_comments": 315,
        "created_utc": 1540320837.0,
        "selftext": "https://www.reddit.com/r/relationships/comments/9oqcoa/18_m_my_parents_found_out_i_have_a_girlfriend_18/\n\nMy parents recently gave me an ultimatum - break up with my girlfriend or face them turning their backs on me, prompting me to drop out of university. They are very conservative and religious (Christians) and they said I should only date when I'm done with school.\n\nGrowing up I wasn't allowed to date at all. Prior my first girlfriend, I had only kissed one girl. My parents have always been very strict and unrelenting in what they think is right and what they think is wrong. Sex before marriage for them is an absolute no no. I come from Kenya but studying for my BA in England. \n\nMy parents found out I had a girlfriend due to Facebook - yeah, I learned from that mistake, big time - and they flipped. My dad called me and told me to break it off, or else they would stop paying for my BA and I'd be forced to drop out and come home.\n\nInitially, my plan was just to lie them - they are thousands of miles of away and with me being much more savvy with FB privacy settings in the aftermath of what happened, the chances of them finding out I was still with my girl were slim. However, that didn't come to pass because I got very pissed off by what my dad demanded of me.\n\nHe required \" physical proof\" that the relationship was over. Over the weekend, he called and demanded that my girlfriend should record a video of herself, saying it was over. \n\nI'm a shy, reserved person who has always been obedient to my parents. But for the first time in my life, I stood up for myself. I've never spoken back to my parents before but on that day, I did. I told my dad that he wasn't living in the same universe as everyone else and that there was no way I would humiliate and degrade my girlfriend in such a manner. That such a proposal was insane. He then started screaming and shouting at me (characteristically so). I cut the line. He tried calling again - I answered and he continued shouting. I told him I wouldn't talk to him until he started acting in a civil manner. I hung up again and didn't respond to his calls.\n\nHe then sent me a string of angry messages, saying he will stop paying for my tuition and that I'm not his son anymore. My mum called me a few hours later and she imitated my dad's angry rhetoric. But I calmed her down and we spoke. I told her that I absolutely love her and my dad, and that I'm grateful for everything they have done for me in life. \n\nBut I stressed the fact that I'm 18, I'm a man living in a completely new country, absorbing a completely new culture and making my own way in life. And that I'm old enough to have a girlfriend. I told her my girlfriend makes me happier than I've ever been, that she got me out of isolating myself in my room during those first weeks, when I was too shy to meet new people and make new friends. She continued to object, and went to the extreme justification of her reservations - pregnancy. Going so far as asking whether we had slept together! I told her that respectfully, it's none of her business. \n\nAfter that she hung up on me. I didn't hear from my parents until yesterday. It was my mum. She said she and my dad will continue paying for my tuition, but that they are very disappointed in me and  they regret sending me off to Europe to study - that it was better for me to go to a Kenyan uni. She added they raised me to be a better man and that the path I'm going down isn't right.\n\nI was planning to go to Kenya for the Christmas break but with the way things are, I don't think I will. My older sister lives in Seattle and she said I'm welcome to stay with her over the Christmas break. But that will probably be too expensive of a proposition for me. My girlfriend is Norwegian and she said she would love it if I spent Christmas with her and her family back in Norway. Her parents would be cool with it. Norway is a much more realistic destination for me. It's much closer than the States and thus much cheaper.\n\n**tl;dr**\n\nI'm not gonna lie, I kinda feel bad. I mean I'm happy that I stood up to them and it was such a relief. However, some of the things my parents wrote and said kinda stung. Was I wrong in my approach with them? And how should I approach them regarding our relationship, in the future?",
        "permalink": "/r/relationships/comments/9qrxn7/update_my_m_18_parents_wanted_me_to_break_up_with/",
        "comments": [
            "Good for you!\n\nNow, as a piece of advice, as someone who pulled something a little milder than what you did...\n\nIt is *imperative* that you do well in school at this point for approximately a million reasons.  If you do well, your parents (who clearly still care about your wellbeing, even if they're angry right now) will start to see that your relationship isn't interfering with your studies.  If you don't, you'll confirm everything they thought about you dating and may pull financial support regardless.",
            "Parents who demand their adult children remain obedient tend to be *very well practiced* (and very skilled) in using guilt as manipulation. \n\nIt’s normal to feel guilty. You’ve likely been taught (via negative reinforcement) that disobeying your parents comes with consequences. When you are under their roof, they can make you very unhappy if you disobey. Now, they no longer have that leverage, but you still associate displeasing them with a scary or bad outcome. \n\nIf they do withdraw their financial support or place any more expectations on you (“switch to a Kenyan school or else” / “come home for Xmas or else” / etc), please remember you are an adult and get to make your own choices.\n\nIt’s possible you will not *have to* drop out university, and if they value their image above all else, they may prefer to keep you in school than to bring you back (implying you’re an academic failure or unable to function without them). In that case, you hold all the cards.\n\nI’m proud of you, btw. I’m just an internet stranger, but rarely does Reddit see confidence and growth like this in such a young user. Your girlfriend has been a wonderful influence, and you are proving your independence.",
            "Hey, as someone who grew up with really strict, conservative parents... I'm really proud of you. Standing up to parents isn't easy, especially when they steamroll you with demands and ultimatums and yelling. The fact that you got your protests in and did it with civility and class (seriously, when you told mom that you and your girlfriends' intimate affairs was none of her business I nearly cheered) is great and I'm glad that it worked out, more or less, in the end.\n\nI hope your study abroad goes well, and I hope things with your girlfriend do too!",
            "Don't go back to Kenya this Christmas. There is every chance they will not let you leave. You did very well with this, this is the first step in taking control of your life. Do well in school and don't invest everything in your girlfriend - she sounds wonderful but you are young and things can happen. Keep your chin up if things go astray, continue living responsibly.",
            "As a Nigerian with very conservative Christian parents, their behavior is par for the course. You handled the situation as well as you could. Their words were meant to sting, its how they would try to influence and control you when not nearby. Continue to stand up for your relationship to your parents. Whether or not they change their stance is up to them but demand respect from them as you most likely gave them your entire childhood. ",
            "[deleted]",
            "I’m trying to envision how this was supposed to work. You tell your girlfriend, “I’m breaking up with you, please make a video agreeing with this.” Why would anyone agree to that? You’d be broken up, there would be no incentive to go along with such a kooky scheme. I think you chose the better route but I wonder what would have happened if you called him back and said, “I dumped her, but she’s not talking to me now so I don’t have a video.” ",
            "\\>  he said she and my dad will continue paying for my tuition, \n\nYou really knew how to play them. ",
            "This is great news OP.  Their bluff has been called, and now if you're smart about this, you can feel more secure in the knowledge that you hold all the cards.  You set a boundary (not allowing them to abuse your girlfriend), enforced it (hanging up), and they quickly realized that they can't control you with threats.  Well done.  You have learned that they are not willing to lose you over this, and that's great news.  \n\n\nStudy hard, keep your social media locked down, and play your cards close to your chest.  And always protect your girlfriend from their vitriol - just like you did.  I hope that you have a wonderful uni experience.    ",
            "This is gonna get buried and it may have already been said but it's very important that if things don't work out with the gf that you don't go back to your parents and say that they were right.  You were right, not because you love your gf, but because you are an adult.  If you guys break up that fact doesn't change and you don't want to go backwards.",
            "As a Norwegian, we'd be happy to have you! Well done.",
            "As a 21 year old who is attending uni while still living with my parents, it has been very very difficult for them to accept that I am an adult and have my own values that differ from there’s. We have had countless fights and they have said some awful things to be and it took me a while to realize that it all comes down to the fact that they want to regain power over me. ",
            "Good on you! Only real advice I can offer is that you should find a way to pay for your own tuition. Your lucky that your parents are willing to pay inspite of everything, but I recommend you don't keep it that way. See if you can get a job save up some money, or look into financial aid. Whatever options are available to you take advantage of them.",
            "The hardest part of growing up isn't something you learn, it's something your parents learn. They have seen you as their child who needs to be taught and protected. It's extremely hard to change that view especially when they can no longer see you and see how you've grown into your own person. This was hard but a necessary step for you to be an independent adult. Continue to try to reconnect with them but realize that you have to live your own life and while they are supporting characters, you are the lead and need to make your own decisions.",
            "Sounds like a tough time, but calm seas don't make for skilled sailors. Carry on, take care of yourself, and please take some cool pictures in Norway for your next update.",
            "[removed]",
            "\\> I was planning to go to Kenya for the Christmas break but with the way things are, I don't think I will. \n\n&#x200B;\n\nDO NOT go back to Kenya, there is a VERY high chance that they will take your passport and not allow you to leave. Parents like yours will stop at nothing to regain control of their kids if they feel they are no longer obeying. \n\n&#x200B;\n\n\\>  My girlfriend is Norwegian and she said she would love it if I spent  Christmas with her and her family back in Norway. Her parents would be  cool with it. Norway is a much more realistic destination for me. It's  much closer than the States and thus much cheaper. \n\n&#x200B;\n\nThis sounds like it'd work for you and be an unforgettable experience for you!  :) I wish you all the best. \n\n&#x200B;\n\n\\>  some of the things my parents wrote and said kinda stung. Was I wrong in my approach with them? \n\n&#x200B;\n\nNope. By your post, you did everything right.\n\nYou need to remember that according to how your parents view things, the only \"right\" thing for you to do was to do exactly as they ordered. No other reaction from you was ever going to be good enough. Don't let them make you feel guilty for doing nothing more than living your life like a normal, healthy adult. ",
            "Damn you might want to check out r/raisedbynarcissists",
            "I’m not sure if someone else mentioned this, but there is a privacy setting on Facebook (called Timeline Review I think) that you NEED to put on. It makes it so that if someone tags you in something, you have to review and allow it before it shows up on your public profile.",
            "Talk to your counselors at uni. Your academics advisor and financial advisors. If your parents suddenly cut you off, which they still could especially if you don’t go home, you may be able to gain some sort of assistance for independent students. Still, it wouldn’t hurt to discuss your options if shit hits the fan. \n\nSecondly, you need to do well in school. If that does happen, having poor grades won’t make the school keen on giving you assistance (at least in my experience with knowing unis here). \n\nThirdly, uni is the exact time you’re supposed to start figuring out who you are as a person and what goals you want to achieve in life. Standing up against something you don’t believe in is a great first step. Don’t play into their disdain for all of this, but also try to find a middle ground mentally. Learn who you are as an individual. \n\nGood luck!",
            "Norway is an absolutely magical place to spend Christmas! You will love it! \n\nKeep you chin up, study hard, and don't waver. You seem like a great kid with a lot of integrity. I wish you the very best. ",
            "Another internet stranger over here who's immensely proud of you, OP.  I think you handled this situation beautifully.  Good job!",
            "This was tough but you did good.  It's scary putting your tuition on the line and I'm glad your parents are still supportive of you getting your education.  This is absolutely something everyone goes through (moreso when you have conservative parents who want to control your life...) - you are an adult, and your relationship with your parents is different now.  You have to live your life as an adult making their own choices and having your own boundaries.  It's good to draw those lines!",
            "Culture shock is a difficult thing for them to accept.  What you did took more courage than most people will find in their lifetime.  We're super proud of you.",
            "It’s crazy how angry they are considering that you sound so level-headed and mature in your posts and handled this SO WELL that they should be exceptionally proud of the man they raised. I’m glad they still can realize your education is important and in your best interest and I truly hope you can have a relationship with your parents *if* that is what you would like in the long run. \n\nIn the mean time, I hope you are doing OK. I can’t imagine moving so far away from school and having been quite sheltered, being busy in university, and now having a huge fallout with your father. Make sure you are taking care of your mental health and reach out to any school resources if there are any if you find you need to! \n\nGood for you for standing up for both yourself and girlfriend and I wish you all the best!",
            "You've got zero reason to feel bad. You did the right thing. You're an adult now, time to make adult decisions about your own life. Your parents are the ones who should feel bad. Nobody reasonable would give their family ultimatums like that for completely innocuous, socially normal things. Proud of you proving you're an adult and a bigger person than your parents.",
            "Listen my man,\n\nyou just archived what some people don't archive even after years of study.\n\nYou challenged your point of view and modified it to the better and you defemd your position.\n\nAnd maybe your parents never had that challenge and now your are thier challenge and I hope they will come to an improved Knowledge about them and you and welcome you back as you deserved. \n\nI don't know what you study or how the guys over in the UK handle it but here in Germany Dr and Masters have to defend thier work against challengers. \n\nWhich are fellow Doctors or Professors, you just prepared yourself for that in a biger and more meaningfull debate then your study class.\n\nI want to congratulate you on that.\n\nBy the way Norvay is beautiful in the Winter. You will freeze your arse off but its beautiful!",
            "Really well executed. I think what you said to your parents was really well done. I wish you the best of luck and hope everything goes well moving forward. ",
            "Well done lad! My cousin recently married a Kenyan man whom we all absolutely adore, but you were right to call their bluff. They value education so so highly. They didn’t like my cousin (because she’s white, that was their reason) until they found out she had a masters degree. Overnight they changed their minds 😂 ",
            "Good for you. I’m glad it was a bluff. Don’t feel too bad about what they said or how you handled it. They forced your hand and really, if it didn’t happen now it was going to happen eventually. Better now so they have more time to get used to the idea that they can’t control your life anymore. \n\nI would consider carefully going to Norway. Things are sensitive and your parents may see this as further “wrong path” behavior from you. It’s not rational, but I can see them asking why you’ve chosen strangers over them, how you’re replacing them with a new family, etc etc. I know it will be uncomfortable to go to Kenya, but think of it as an olive branch since your dad didn’t pull your tuition? Then again you could get trapped there with threats.\n\nIf you feel strongly about going to Norway, then go have fun. Just expect to be fighting a new battle shortly after the last one is all. I think a good middle ground would be staying with your sister in Seattle.",
            "Dude, you did well, standing up for your girlfriend and more importantly, yourself. ",
            "Norwegian Xmas- the best. You’ll have a great time. ",
            "You’ve just graduated into adulthood. Congratulations :)",
            "I'm proud of you!!! You did a wonderful job. I was also raised in a very strict and controlling conservative Christian home. I know how hard this was for you. You did so well.",
            "Stick it to the old people man👍🏻",
            "I grew up with strict conservative parents who forced me to deactivate my Facebook account simply because I was texting a girl for a day.For me reading what you did is very satisfying.Good luck with you future I hope things work out for you ",
            "If you go to Norway for Christmas just bear in mind that it is really *really* expensive there, you will absolutely have to buy gifts in England and bring them with you. A pint of beer is often around €10. ",
            "Three beers in Norway cost around as much as a flight to Seattle though",
            "It's great to fall in love but I suggest you start worrying about being able to pay your tuition and look for student loans/scholarships/part-time first if your parents decided to follow through on their threats. I had a similar situation where I transfered back to my local university from another state for my ex, had to support myself for an entire year before I got my parent's blessing. ",
            "Sounds great, my only advice: Norway is NOT CHEAP AT ALL!",
            "Oh, bless your heart. I don't know you, but as someone who has been through a similar experience, my heart goes out to you.\n\nI'm 29F and have a good relationship with my parents now. But growing up they taught me to be terrified of sex, and men in general, by making me think that pretty much any man I get close with will rape me and/or ruin my life. I overcame that and started dating a very nice boy my age once I went away to college. We had sex several months into the relationship and used protection \\*diligently\\* every time. I was home for Christmas break when my mom casually asked me if I was sexually active. I'm terrible at lying to my mom- my face turned beet red. She proceeded to ask me if I might be pregnant. I told her absolutely not, and that I regularly take pregnancy tests just to be sure. She screamed for my father to come into the room and said \"tell your father what you just told me\". Which was humiliating. He started crying. My parents proceeded to shout at me, lecture me, for TWO HOURS while I sat there sobbing and feeling one inch tall. My dad ended it by telling me, \"you're not a lady.\" The worst part of it all, was that I didn't defend myself. All I could do was cry and apologize. That fact STILL bothers me.\n\nI think I will forever live with that humiliated feeling and it's been a very long road to learn to stick up for myself. I'm lucky in that my parents didn't cut off my college funding, and I'm lucky that they eventually got over it and we have a wonderful relationship now. We only have a good relationship because I told them how deeply they cut me, and they later apologized profusely. My point is, although it doesn't feel like it now, sticking up for yourself is the ONLY WAY you can hope to have a good relationship with your parents later on. It may take months, even years for them to get over this, but I am pretty confident they will come around. You absolutely did the right thing. I hope you're able to go to Norway and have an awesome time. <3",
            "Question: are you of different races? is there any part of your parents that is mad that you're dating outside of your race / religion (rather than just \"dating\" in general?)",
            "I am very glad that you were able to stand up to your parents.\n\nI know that things are very harsh right now, especially with you dropping out of university. \n\nHowever, I would say that there are many men in their 30s and 40s who never stand up to their parents and it wrecks their lives.\n\nThe fact that you are doing it now means that you are able to move forward in your life. I am happy for you. \n\nTruck on forward!\n\nAnd no, you wasn't wrong in your approach. These people sound malicious towards you and that you had to do that.",
            "I feel so bad for you. Your parents are insane. ",
            "I’m glad it worked out but your story is the exception and it’s madness to risk free education over a fleeting relationship. ",
            "Sounds like you got kinda lucky to me- I would have advocated not risking your education and future and just giving them what they needed to get over it and move on. You confronted them and forced their hand and got lucky, but I'd be very cautious about doing something like that again or pushing your luck while you depend on their money.",
            "congratulations my friend! i agree with the other comments, you should look for a way to become more independent economically.",
            "I’m glad this had such a great ending! You’re your own person and I hope you spend many happy years with your girlfriend! ",
            "Do it! Your eyes are open, stay close to your special lady and don't succumb to the parents with their archaic ways of thinking. Good job!",
            "You did the absolute right thing. Some parents don't see the line between raising a man and controlling a man. Don't sweat it, they'll cool down eventually. \n\nBonus response: I suggest going with your girlfriend for Christmas ",
            "Great job standing up for yourself OP!\n\n>My older sister lives in Seattle and she said I'm welcome to stay with her over the Christmas break. But that will probably be too expensive of a proposition for me.\n\nIf your sister is offering to host you, what is so expensive about Seattle? Just food/consumables for the length of your stay?\n\nThis may be a little forward but I'm located in Seattle and I'd more than happy to gift you some funds to make the stay a little easier if the choice is between Seattle and Kenya. PM me if you're interested.",
            "Start saving and planning for financial independence. Talk to your school and find out your options if you are cut off. Start working part time and save everything. You are in a very precarious situation. ",
            "Dude, yer girlfriend is a rock, hold onto her.",
            "As someone who's had to draw a line with his own father, I think you've taken a big step in being an adult. Standing up for what you care about, despite the possible repercussions is something we all have to do at some point. You're going to feel conflicted, and you might even question your decision, but regardless of what happens later, YOU stood up for what you wanted, what you feel is good for YOU. That's a victory in itself.",
            "Way to go! Good job! It’s essential that you become your own man. School is extremely important so the way to show them is to maintain good grades and STILL have a girlfriend...or 2...or 3 hahaha God didnt tell us not to date and to be miserable because it’s “right”. He put us here to enjoy life! So do it! Your parents will learn they can’t control a man. They’re supposed to guide you, not control you",
            "Do not feel bad. You said it yourself. Your dad is not thinking clearly",
            "That's really great! That took a lot of courage, but as you realized, they can yell and tantrum but can't actually force you to live a way you refuse to live. When you stood up to them, they backed down from cutting you off. They are frustrated at you and scared for you and for their world changing dramatically, but it's your life to live. And when you care that much about a good person,  then that's worth fighting for. ",
            "Standing up to parents can be so hard! And your parents did not make this easy. But you are a man and you made your decision like a very mature young man.  The reasons you gave were well backed up (including your desire to treat your girlfriend with respect). Good for you! \n\nYou may have continued challenges with relating to your parents, especially with the threats of no longer paying for school, etc. But you just stood up for yourself and your values in a way that showed respect for your parents,  yourself and your girlfriend.  I hope you can look back on this moment and feel proud.  This is how a respectful man stands by what he believes in. 10/10.",
            "Congrats man. Well played. ",
            "I come from a Mormon upbringing, and my dad was strict (not as strict as yours but still strict) when I turned 18 I: got a tattoo, got birth control, pierced my nose, and moved in with my boyfriend. He threatened the same thing when he found out. I told him that that was okay and I was an adult now and that although I loved him, part of Christianity and Mormonism is agency which is your right to choose and make mistakes. If they’re going to pull the religion card on you pull it back on them. \nMy dad didn’t talk to me for 6 months and now we talk a few times a month and we’re civil. If your parents aren’t accepting and keep trying to make you feel like shit, chances are they’re toxic and as shitty and lame as it sounds, you might be better w/o them. If you’re happy, that’s what matters.",
            "My parents are conservative Christians as well and I respected their wishes as I grew up, which wasn't a problem for me. However, they know that I'm my own person and I can do as I please. I'm sorry that you had to go through this. I wish some people can just think logically other than ranting about their feelings. ",
            "Great job!  Adulthood is taken, and you’ve started the process in a big way. And kudos for pointing out what a cruel thing your father wanted your gf to do.  What kind of man would request such a humiliating display? ",
            "I seriously give you a standing ovation!  \n\nIt took me a lot more years to stand up to my conservative parents and I can tell you that their controlling behavior never diminished.  Looking back, I regret not having stood up to them sooner.\n\nRegarding your relationship, keep setting healthy, reasonable boundaries with your parents and continue to show them love and respect.  Also start researching financial aid options and part-time job opportunities in case they withdraw their financial support.\n\nYou're a dynamo and you've got this!  Good luck!!!!",
            "Oof, good on you. My parents are Colombian and there came a time where i had to do the same thing. The only difference is they arnt responsible for my tuition, i am. So i had that long direct talk and told them this is my life not yours. It can be hard to be like this to your parents but if they can’t respect who you are then there’s no other way. ",
            "You did the right thing, and now is your time to be your own person outside of your parents ideals. It's a lesson we all need to learn and some people never do. I know it's a hard transition, I went through the same thing when I studied abroad. Keep doing you. \n\nPS Norway is beautiful during Christmas enjoy yourself! ",
            "I was just telling someone today that Asian parents ain’t got nothing on African parents. Damn he wanted you to send physical proof which consisted of your gf video herself telling them you guys are over. That is some deep stuff right there. I am sorry for what you are going through.",
            "Don't feel bad, you did nothing wrong OP",
            "Dude your girlfriend sounds amazing. Your parents are being jerks. I hope they come around and eventually want to see how much this woman has made you improve and be happy! ",
            "Stick to your beliefs, stand your ground.. cut them out of your life if you need to",
            "I am so very proud of you! Well done for standing up for yourself!",
            "Good for you and good luck in school",
            "I think they just want you to not fail and do well. A GF, especially if she is your first serious relationship can be a huge distraction. Focus on your studies and try to be responsible. At this point in your life you SHOULD be focusing on studying.",
            "Adulthood isn't given, it's taken.",
            "I don't have much advice for you, but after reading everything, all I can think is \"man, this guy has shitty parents\". While you may love them, and they still to an extent love you(or at least care for your well being), it does not excuse their shitty narcissistic behavior. I believe you realize that this is NOT the norm, and that you are clearly and obviously NOT in the wrong. If they ever pull ultimatums again, and begin to stick to them, it might be time to start considering disowning them. You should not allow people in your life who want to control you, especially to the most basic of human rights such as choosing who to love.",
            "In the future I'd advise absolutely avoid divulging anything about your personal life that can be used against you. Since you're still dependent on them it's wise to not rock the boat but also don't give them ammunition. Look up the 'Gray Rock Method'. Be as boring to them as a gray rock. Wako na utiaji mob lakini lenga tu hiyo stori. Soma na upite mtihani zote. Usiwapatie excuse ya kukataa kulipa fees. Christmas enda Norway. It's sounds like a great opportunity for a stress free holiday. ",
            "It sounds like you are more mature than your parents,  but I think you did well in your approach and your parents were being over dramatic. Be independent but responsible and keep working hard at school",
            "I just want to tell you not to go to your country before you are done with your degree. They may take away your passport. I am not kidding. It happened to others before.",
            "You did amazingly. Congratulations on achieving one of many important \"standing up to your parents\" milestones that are going to come up in your life. The first one can be the hardest. \n\nEnjoy your holiday season in Norway, keep up the good work at school, and continue to set healthy boundaries with your parents. In the meantime, find scholarships for you to apply for (international student scholarships, grants, work-study, campus jobs, tutoring jobs, etc). Get a savings account, and start saving up now. \n\nI had parents like yours, and they have calmed down greatly (I am 25 now). I understand that feeling of being yelled at, irrationally, by your father over the phone, and the mom trying to do the same. I understand the sting of taking their words a bit too closely to heart. \n\nRemember, your parents love you, but they aren't professional parents. They are doing what they think is the right thing to do to raise you, but they are wrong. Parents can be wrong, and that's because they're just normal people, like you and me. So, as you continue to set boundaries with them, and as they continue to see that you are able to be your own independent adult, things will get easier with time. \n\nI could not have done what you did, at 18, and I am so proud of you! ",
            "Well sounds like my situation (my parents disowned me), except my relationship is long distance. Just make sure you keep your shit together and work really hard to be successful, it’ll really show them that the relationship didn’t affect you badly. They’ll hopefully come around, especially after knowing that you can take care of yourself. ",
            "You did the right thing. I'm proud of you, that couldn't have been easy. ",
            "Just a quick comment from another Norwegian, please spend your Christmas in Norway!!! It’s absolutely beautiful, and if you haven’t tried skiing or other winter activities you for sure will, not to mention our great traditional Christmas foods!\n\n\nCurrently in Australia so sadly I won’t be able to celebrate Christmas in Norway this year, but hopefully you will, it’s absolute magic",
            "Good on ya, and forward into the future.\n\nI've been there with you with the disappointed parents.  They will probably remain disappointed to some degree for years, but one can get used to it.  \n\nBut then a wonderful thing happens when you have grandchildren. Any long simmering difficulties will magically disappear.",
            "Are you completely financially independent on your parents? Is it just your tuition or also your living expenses? \n\nI only ask because if you're in the UK you might be entitled to some financial aid or student loans. Could be worth looking into, on the off chance that things escalate again or a new issue crops up and they start threatening to cut you off again. ",
            "I remember your OP! Thank you for updating.\n\nYou've done such a brave thing. I'm very impressed that you had the courage and diplomacy to enforce your boundaries with your parents, especially at such a young age. You clearly have a lot of respect for your girlfriend too.\n\nI said this in a previous comment, but I would very strongly recommend seeking out your university's counselling services and seeing if they can offer you someone to talk things through with. It sounds like you're coping well, but conflict with parents is always difficult and speaking with a neutral trained professional will be helpful to keep on top of your feelings and process everything that's going on. I also wouldn't be surprised if there was some pushback from your parents if you spend Christmas with your girlfriend and her family, so maybe prepare yourself for that reaction if that's what you decide to do. What a previous commenter said about working really hard so you do well at university is also very good advice, both for yourself and to show your parents that it's a good idea to keep funding your education.\n\nIt sounds like you've already grown a lot since you arrived at university. Your parents have a lot to be proud of, even if they don't realise it yet. Good luck with your studies and your social life! It sounds like this is going to be a wonderful journey for you. Hard sometimes, but wonderful. ",
            "I am so proud of you! You did literally everything right. You recognized their toxic absurdity,  set boundaries,  kept them, respected your girlfriend  -- you did everything like a trained psychiatrist and you are a very young man. I am really impressed. \n\nI hate to say this, but I am very concerned about your parents stealing your passport if you go back to Kenya or of them doing something to sabotage you. Please take steps to safeguard against this. Perhaps you shouldn't go home for a while. And definitely do everything you can to keep your grades up and try to get scholarships. It's important that you not need your parents' money, that they don't have control over your life. ",
            "I’m 9 years older than you and just recently went through a similar situation. When you grow up with conservative and controlling parents, it can be hard to distinguish their expectations from your own. \n\nBut I wanted to drop by and tell you good job for standing up for yourself. I hope there’s a safe way to maintain and negotiate your relationship with your parents. If they’re too fuckin stubborn to change themselves, then that’s their loss.  I wish you the best! ",
            "Fanatical organized religion screws up so many lives. I cannot digest all the angst you have suffered as a result.  However I applaud your position.  It appears you are much more mature and use common sense that is foreign to your parents.  To threaten to disown a child because of religion brainwashing is beyond crazy.   You have taken a very mature and rational position with your parents.  They may not agree with you but they will hopefully respect your position. I do not think you have disrespected them at all.  Good luck to you.",
            "You're the one who has to live your future. Don't hand someone else control of your life, you might not enjoy what they do with it.\n\nYour parents are used to being in control of you and a lot of what they are saying is them struggling to come to terms with you becoming your own person. Don't let that sway you from running your own life. Something I learned too late is that you cannot please every one, all of the time.\n\nBe respectful to your parents but only if they are being respectful of you.",
            "Heh, I thought you were in the US. I'm pretty sure you can get a scholarship as a foreign student if you fill in the proper paperwork. Tuition isn't very expensive here. Heck, I wouldn't be surprised if that's what your parents did; it might explain why they didn't follow through with their threat.\n\nWhat country are you studying in? Some local redditors could confirm.",
            "Respect!!! Good Luck bro!",
            "I think you handled that perfectly, that would have been impressive for a person any age, but you are only 18! You’re gonna do great things my man.\n\nAnyway, Norwegian christmas’ rock, tho its probably pretty different from what you are used to. But Norway is as christmas-sy a country as you could ever imagine. Have fun!",
            "> She added they raised me to be a better man and that the path I'm going down isn't right.\n\naka she raised you to control you and you're going down a path SHE didn't lay out for you. \nYou're doing right dude.",
            "I thought I was in r/AsianParentStories for a second until I saw Kenya.\n\nYou have such a wonderful, shiny spine there. Damn, I felt proud of you just reading that.\n\nIf anything, I think you went easy on them... but you have to be somewhat soft on them if you want them to continue paying for school, so fair.\n\nWell done.\n",
            "You acted in an adult way and they should respect you for that. I'd suggest you talk to someone you can trust that works for the school. They may have more information on scholars and it often helps with getting your thoughts straight and future planned out. If you tell them your circumstances they may support you with anything schoolrelated as well. \n\nI wish you the best of luck and hope that even more happiness is coming. ",
            "Hey, \n\nDon't compromise on anything, If you really love her then go ahead. Don't worry about your parents one fine day they will agree with you. \n\nHave a good life",
            "Wow, you are actually an amazing person!  Keep going, you can always work part time to pay for the school if your father changes his mind.   \nMy friend wasn't so lucky though, her boyfriend broke up with her because his parents ordered him to do so after poisoning his mind for months, and only because she doesn't have Uni degree (note: the parents and the boyfriends have none too)   \n",
            "You handled it well. You (and your parents) should be very proud.",
            "I think it's amazing that you're standing up for yourself :) being your own person and defending your own boundaries is going to bring you a lifetime of joy.\n\nIt's extra excellent that you didn't make your gf humiliate herself. Men that do, their girlfriend ends up on r/justnomil, sad because their mother-in-law is driving them up the wall while their partner looks on and does nothing. You're protecting your gf, that's dope.",
            "Good for you mate, I had a similar situation happen to me years ago, only mine didn't come out quite so positive. Good on ya for standing up for you and your girlfriend, and defending her honor as a *real* man always should. The trip with her folks sounds wonderful, I'd jump at the chance if I were you and see where life takes you two. ",
            "Damn you don't need advice...i got a lot to learn from you",
            ">\tWas I wrong in my approach with them? \n\nNo because \n\n>\tI'm 18, I'm a man living in a completely new country, absorbing a completely new culture and making my own way in life.\n\nThey need to respect this.\n\n>\tAnd how should I approach them regarding our relationship, in the future?\n\nThey will come around eventually.",
            "Please don't feel bad for what you have done. I also stood up to my parents when I was almost 18....over a boy (now the man I've been married to for 15 years), school, and religious difference. \n\nIn the end, agree or disagree, my parents still loved me. My life was so much better for making a decision similar to yours. If I had not, I'd still be in one of the poorest states in the US with no future.",
            "You’re parents might be disappointed but the internet and modern civilization is very proud of you! You absolutely did the right thing. ",
            "Great job. As someone who stood up against his parents too, let me tell you a little secret: they almost always come around. \n\nMy story is that I dropped out to start an online business and things were rough for a year but I finally got things going and have been able to travel & work remotely from anywhere. \n\nAs soon as they see your successes, they turn around- and I've seen this happen in 99% of cases. \n\nIf they don't turn around then know that it's for better, however I'm almost certain they will. \n\nLike others have mentioned, just make sure to do VERY GOOD in school now, don't do any crimes or get in trouble, etc. etc. \n\nThey'll see that and come around. Even if they never fully approve of it they'll \"accept it\" and drop it. \n\nAgain, great job. I commend you for your bravery in standing up for yourself. It's especially scary with parents like that. \n\nThey care for you and just don't know how to respect you and your decisions. They *think* that controlling your life is good, even though that's wrong to you. \n\nKeep standing up for yourself and things will play out for better. They'll turn around, accept it, and you'll finally get to enjoy an ADULT relationship with your parents! ",
            "From failing in your clumsy attempt to hide the relationship, to abandoning your parents for some girl you just met, this is a story full of straight up misplays.\n\nBro, if you got hit by a rocket-powered frisbee and permanently lost your good looks, who do you think would stand by you? Your parents, or this 18 YO girl? What if you ran out of money?\n\nYou made a mistake, your parents are more important, so fix your bridges with them ASAP.",
            "I just wanna say one very important thing: AAAaaaaaaaaaaaaaawwewwwwwwww omg this is so cute.\n\nReally proud of you young man. Great for you to step up\n\n\nSpoken by a man of 34.",
            "You are so young, But I know a lot of adults who could learn a lot from you. \n\nYou’ve got this.  You’re a man to be admired. ",
            "Why are all Christians such intolerable assholes?\n\nI believe in God, and most of the christian faith. I have lost all respect and belief in the religion of Christianity and its 4000 offshoots and various cults.\n\nReligion is killing more people than anything else on this planet and it always has. Worse than cancer. ",
            "Wow! Great job! I just wished my parents loved me enough to pay for my college tuition, and not just my sister's....Sorry for the completely useless statement",
            "Good on you man. \nDon’t let your parents dictate your life. If she makes you happy then that’s all that matters, and if your parents reject you because of that, then they’re no good for you. \nYou are in control of your own destiny, don’t let anyone tell you different. ",
            "Some people know how to have unprotected sex but don’t know how to be good parents. Such is life. It’s easy to make the commitment. Harder to keep it. ",
            "Sometimes your parents want what they think is best for you. Doesn’t necessarily mean they know what’s best for you because you are your own man and they shouldn’t expect you to be anyone but who you want to be.",
            "Good for you!! Love always wins. \n\nWhen I was in high school my dad grounded me so I couldn’t go to prom. I knew he was on tinder trying to move on from the passing of my mother so I created an account and catfished nudes off him as revenge. But then I really started to get to know him and I slowly fell in love with him. Sometimes what you’re looking for is right in front of you.",
            "Oh my god. That's terrible. I am so sorry you have parents like that. That is a nightmare. I wouldn't even be surprised, if they caused you some psych.  complex.\n\nI'm so sorry about your family and I wish you the best ;) enjoy happy moments with your gf.",
            "That's terrible :/ Imagine the situation, that you marry her some day. Your parents shouldn't be invited on the wedding. They don't deserve it. Not for what are they doing to you.",
            "You were absolutely the adult in those interactions. I am amazed at your maturity at such a young age. This Mom would be proud to have a son like you. Your parents are proud of you, too. They just don’t want your future to get derailed and they reacted in fear. They have a terrible way of showing it but they really do love you. ",
            "Well done. Also, You're gonna love Norway.",
            "What are you suppose to do, not ever have a relationship that could lead into marriage? ",
            "Way to go. We all have cutting-the-cord stories, yours came early.\n\nHang in there. Parents really are capable of adjusting. Fair warning, it can take years. \n\nAnd you are right: Norway is a good place to spend the holidays. A bit colder than Kenya, but you'll get used to it.",
            "Parents can be essentially well-meaning but also be tied too heavily to their own biases and lack a lot of emotional maturity. One way or another, parents need to understand that their children are not children forever, and that they must make their own decisions with regards to many things - relationships especially. Whether they understand this on their own or are forced into it like yours were doesn't change this. I personally think you handled it pretty well.",
            "This hits home. I’m in a similar situation (i’m from Norway btw), only i haven’t objected yet. My parents are conservative in the same manner, to the point that if i spend free time with school friends instead of church friends they get really worried and start a serious conversation («you’re not meant for that kind of life.. god chose us... etc.»). Anyways, i’m 18(m) too now and i have no idea what i’m going to do. I have 9 siblings, only one of which has already left the church, and based on their reaction after he left, i feel really stuck.\nI can honestly say i feel your pain, and i am happy for you. ",
            "Your parents have failed you absolutely. They don't deserve to be at your wedding, though if they don't want to be there just invite them since that will be pouring hot coals on their heads. If you marry this girl, I say do the opposite of your parents' wedding wishes. \n\nPeople from your hometown can be even worse than people abroad (as a foreign student in England I'm sure there is a lot of harassment there, but it has been shown your own home people are worse than English people. )\n\nYour parents are N-parents, go check out that subreddit.\n\nAnd one last advice, like all those redditors have said, DO NOT GO BACK TO KENYA. \n\nHaving similarly strict conservative parents I can foresee one thing: YOUR PARENTS WILL TAKE YOUR PASSPORT. They will seize it and not let you leave. They also can withhold your plane ticket and other paperwork you need to leave Kenya. It didn't happen to me, but my own parents once floated it as a possibility if any of me or my siblings went overseas for studies. I'm Malaysian.\n\nEven if your parents meant well, their method meant that you will never ever receive their message in a good way. They already showed by example how bad they are. May God heal the pain that your parents have brought to you in His name.\n\nYou were absolutely right. You had a pair and a lot of maturity, and I applaud you for that. ",
            "Hey dude, I'm happy for you! Hope you get the most out of this relationship :)\n\nAs someone who followed a similar timeline as you, don't forget about your friends, your studies, and think about yourself!",
            "You may be overlooking a larger inference on a smaller detail here, so I'll say it if no one else has: People of your class who are that controlling are usually never going to actually follow through with it. You're an extension of them, so why are they going to take that away from you? What would they tell their frenemies when they ask what their kids are doing?",
            "No two generations are alike. We will act differently to our kids as well. The difference is how people react and how they take change. You did a good thing standing up for yourself. Its their reaction and your future actions that mater. The same path is not the same for everyone. Some have other needs than others. Some need a boyfriend or a girlfriend. Some need more social interactions. Other don't. At the same time don't let this incident ruin your relationship with your parents and don't stray away from your goals. \n\nThe fact that your father is continuing to pay says that he sort of understands your decision. If he had \"disowned\" you or mock, or degrade you then it would be a different story. His reaction although harsh at first, like a typical father, changed into a mild reaction. He's giving you a chance because he understands you're a man now and you're in charge of your own decisions. (although he is still paying for your tuition)\n\nAs for you. Make good decision. Do well in school and stay focused. Use protection with your girlfriend. Parents, or at least most parents, want only whats good for us even if sometimes what they think is good, is not. Sometimes we have to stand up for ourselves a bit too.",
            "You called your parents bluff but altogether what you’re doing is outright stupid. You risked free college over some girl you most likely won’t know in 5 years. \n\nCreate a new facebook account and start thinking about controlling your parents perception as they are currently your life blood. \n\nOf course your parents are acting ridiculous but that doesn’t mean you being right will make you get what you want. Bottom line, get your shit together dude. The fact that you have changed your relationship status on facebook knowing that your parents can see it and how crazy they are about that subject is absolutely foolish. Use your head. \n\nAnd by the way, stop referring to yourself as a man...You’re 18 and live on the tit, can’t even support yourself let alone a family. When you have a big boy job and your parents don’t pay your bills you’ll be a man. ",
            "My only reaction to this is wtf! In what world does a parent in the 21st century think they have the right to demand their adult child to end a relationship?",
            "Was in this exact situation. All I have to say is relationships at these ages are ephemeral and y’all will break up. Make sure to always prioritize your academics no matter what. ",
            "You were standing up for what’s right and not becoming what wrong, your parents are in a category 2 of incorrectness. You are an adult your parents have no legal authority over you. I don’t know what’s going on in their head and how you had stated they Christians which is awesome but to me this doesn’t  sound Christian-like. At some point you need to let your parents know you are an adult and you can go be free. Your still their child but your not their kid. I have a feeling this has to do with their thoughts of you growing up so fast and they don’t want to lose you or something related to that and they possibly didn’t know how to react and but because they had seemed the information of you Girlfriend they thought that was the most conclusive theoried answer, and in some cases is reasonable. Relationships and love is a big foundation part of our lives it’s a wonderful thing and a wonderfu mentor. But understand this your parents were trying to protect you and in their minds they thought they were doing the right thing but they reacted so harsh is possibly because they are afraid to lose or see you begin a new life and those years they had spent with you just vanish like a NASCAR at a Racetrack so in their minds they were only trying to protect you but there’s nothing wrong with having a relationship with a individual. Though you are 18 years old, you don’t need to listen to your parents. But continue this journey through college and the relationship between you and your girlfriend, especially your relationship, If I was left on a island with food and water and had one option to bring one additional thing that would be love. Love gets ya into trouble and out of trouble, it destroys you and it heals you, it excites you and depresses you, Love is the greatest gift upon the universe,  and no matter if your heart is broken or healed and you can learn from either view point, good or bad, but don’t waste your time with girlfriend , cherish her love, her company, her personality, her everything, Love covers a “Multitude” of sins. But do whatever you feel is necessary and remember you are 18 years old. Go be you and have fun, explore the world, have a good time with the people around you. And one day you may marry this woman, you have children with her, you may have grandchildren, you may sit on the front porch on some rocking chairs sipping tea and grow old with each other. Good luck in life  and I’ll pray for ya and good luck in college",
            "Dump her. Ok my bad just kidding.",
            "to be honest, you're not in an age or situation where you can stand up and say no, you're far fake it with the help of your gf, until you get financially independent then still be nice to them and do your stuff.",
            "Wtf?  People like your parents actually exist?  You sir would find some friends over at r/atheism.  If that’s what christianity demands then it must be a cult",
            "Another black man turning his back on his race and Africa.  You are in England to study, not to immigrate to Europe. Africa needs you. Your girlfriend is only with you because you aren't white and she has a mental complex about being \"different\".\n\n&#x200B;\n\nNorway is not a realistic destination, you and all your descendants will be foreigners and minorities, you don't want that. It's much more realistic to be a professional in your field back in Kenya than to get your kicks off hyper leftist white girls. Not only is she a different race, she's also definitely going to be non-religious (probably anti-religious) too. Do you really want that friction with your family? You are 18, you are super young. There's a 90% chance your relationship will end no matter what you do, simply because of age and the fact that most interracial relationships don't succeed."
        ]
    },
    {
        "post_id": "jcwxd4",
        "author": "throwrathingie",
        "title": "I (f32) kind of want my boyfriend (m35) to be my dad",
        "url": "https://www.reddit.com/r/relationships/comments/jcwxd4/i_f32_kind_of_want_my_boyfriend_m35_to_be_my_dad/",
        "score": 4932,
        "num_comments": 273,
        "created_utc": 1602947853.0,
        "selftext": "Just the title sounds creepy... Me and my bf have been together for only six months but have been friends for about a year longer than that. We only ever hung out with a friend group and did dnd together and stuff, and I fell in love with him without really hanging out at his house or interacting with his kids. I knew he HAD kids (m7, f12), and he'd talk about them, but I didn't meet them until I was already in love with him.\n\nSome background: I came from an abusive household. Both of my parents were emotionally/psychologically abusive and my father was an angry drunk who threw things and punched walls. I've been in therapy for it throughout my life (when I can afford a therapist, yay USA) but am currently not.\n\nI've never really hung out around a healthy family with kids in it? I'm estranged from my extended family since cutting off my parents, and most of my friends either don't have kids or they're very small babies. The first time I went over to my boyfriend's house, his kid was acting up and I felt my whole body go tight waiting for him to get angry/aggressive with the child... and he didn't. He was kind and gentle. I was absolutely just... I'd never seen that.\n\nThe more we spend time together and the more I see him around his two kids... I keep having these sort of earth-shaking revelations like... This is what parents are supposed to do. This is what it's supposed to look like. My therapists had explained, verbally, what it's supposed to be like, but that's very different from actually SEEING a parent who genuinely loves his kids and treats them well. I love spending time over there because when he is kind and gentle to his kids, I like... passively absorb it, is the only way I can think to explain it. I feel safe and warm and protected in an extremely just, primal way? That I never felt in my own house or anything.\n\nTo be clear, I know what daddy kink/DDLG is... and this isn't it. It's not sexual at all. I just see the way he takes care of his kids and wish that I could just ... duck under that umbrella and be cared for like that too? One time he was telling me about the custody battle he went through with his ex-wife, who didn't want him around the kids, and how hard he fought to stay in their life and I just started crying. He was comforting and I tried to explain that no adult in my life would have ever fought for me like that. I told him \"I wish I'd had a dad like you\" and he said \"I wish you did too.\" Which was very sweet but I just worry this isn't something I'm supposed to want from my boyfriend, or feel for him...? He knows about my parents and we've talked about it a few times. He gets it because he didn't have a great upbringing either.\n\nIt's probably not okay to cross wires like that... I believe in communication in relationships so I probably need to talk to him about it. But how do I tell him so it doesn't come off creepy? There's just so much positivity and warmth and unconditional love in his house and I want to just... wrap up in it like a warm blanket. But it's not mine... it's his kids'. And I probably shouldn't get the wires crossed like that? I don't know. If I hadn't had to change jobs during covid I'd talk to a therapist again but financially that's just not an option right now.\n\nTL;DR - Raised in an abusive household, now see how my amazing boyfriend loves his kids and I wish he'd take care of me/love me the same way, since nobody ever did. Is that wrong? Do I talk to him about it?\n\nEDIT: Wow so many comments. Thank you all for your kind words and advice. I'm definitely googling a lot of the ideas and books and things everyone mentioned. I didn't expect so many people to relate to this. It's kind of sad and really.. heartwarming? I was worried I was messed up and that I should shove these feelings away and felt guilty for feeling like that, but a lot of you suggested it's just love. Healthy love, and it's okay to want that. Which feels like it should probably be obvious. I've decided not to make a big deal out of it or have any kind of Talk about it, but just keep telling him how much I appreciate him and the things I see in him. Thank you all again for so many comments and advice and ideas!",
        "permalink": "/r/relationships/comments/jcwxd4/i_f32_kind_of_want_my_boyfriend_m35_to_be_my_dad/",
        "comments": [
            "I don't think you want him to be your dad, you just want to be treated with the empathy and respect he treats his children.\n\nSo tell him how you feel, just don't say \"I want you to be my dad.\" That'll probably spook him, but beyond that yeah tell him you've never seen a parent treat their kids right like that and it makes it feel amazing to be around him. And how much you want more of that. I'm sure he'll feel flattered for basically being called an awesome dad, and then he'll feel able to become more emotionally close to you.",
            "40 year old lady here.\n\nLots of people who had shitty parents look at their partners and friends and think \"I wish my parents were like that.\" Heck, people with good parents might still look at a great parent and think \"Dang, they pulled that off better than my dad!\"\n\n It's not that you want your partner or friend to parent you, it's seeing someone do good and wishing that you had it back then with your parents.  \n\nWhat you need to do is focus on what a good partner he is to you. And you need to start giving yourself the love you needed as a child.",
            "I think it's really normal to want to have a protective partner who's looking out for you. We all have to be independent adults, but it's nice when you can trust someone else to take charge. That's ok. Maybe not phrase it as 'Dad', but what are those qualities that you appreciate in him.",
            "I think it's pretty normal to want that kind of secure nurturing feeling from a significant other. I wouldn't worry about it at all, unless it detracts from your romantic feelings, then it could become an issue.",
            "I think actually you're kind of fine. I mean, not fine, because you're still healing from childhood trauma, but kind of fine for your path of healing. \n\nWhat I was worried about is there is a common response some people have who were mistreated, where they see others being treated properly and it is painful. You don't have that. you're responding positively to watching healthy relationships, which is great. And there's nothing wrong with that, as far as I know. \n\nAs for wanting it for yourself, well, part of healing from childhood abuse is mourning the loss of what you should have had but did not. You've already done a lot of that, but as with any mourning, sometimes something happens and it hits you strongly again. In this case, you now have a better idea of what you missed out on. So, you need to let yourself take time to grieve.\n\nBut I also think you need to keep in mind that while you are too old now to have a relationship with someone in the parental role who cares for you as a child, a loving partner is somebody you should feel safe and cared for with. And you actually can have some of that safety and concern within a healthy romantic relationship. I think the parts you really want are the parts you should be aiming to get, which is why I think this isn't as much of a problem as it seems to be to you. You're just not used to having it within any relationship, and now are witnessing it within the context of a parent-child relationship. But you aren't mentioning craving any of the parent-child specific parts of it. Just being safe, cared for, and treated with kindness.",
            "That feeling you are describing is love, the love within your new family absolutely involves you. Embrace it and enjoy it, you deserve it.",
            "I think wishing you had a good dad isn’t a problem? My husband also has kids and is a great dad and I wish I had a dad like him growing up and he knows that, he’s a parent and knows about my upbringing and how shitty it was and absolutely agrees.\n\nYou already told him that though so I’m not sure what else there is to talk about with your boyfriend, it sounds more like you are itching to process some childhood stuff and a therapist would be a better outlet for this. Good luck.",
            "I think this is totally normal and there are more solutions than just therapy.\n\nI had the same thoughts about my husband - I saw how kind and patient he is with our daughter and I thought to myself, if he weren't my husband, I wish he had been my dad!\n\nWhile I would still rather have a dad like my husband, one thing that helped me shift my focus off of being parented was being a parent myself. The longer I have been a parent, the less I think about wishing things were different for my child self and more on making sure my daughter has the best upbringing I can give her.\n\nPerhaps as your relationship progresses and you take on that role with his kids or kids of your own, you will feel that way too. Further, just being in a safe, loving relationship is healing in itself, whether or not you become a parent.",
            "A bit different, but I feel this way about my uncle.  My dad is definitely involved in my life and he’s a good dad, but he has a lot of flaws that make it hard for me to connect with him.  Really bad communication, doesn’t pick up on social queues, doesn’t have critical thinking skills, he gets irritated easily and doesn’t know how to control his temper, he’s not a very good husband...  But my uncle is the complete opposite.  He’s very gentle and understanding, he is absolutely a critical thinker, we share a ton of interests, he’s a great husband and father.\n\nThe more I spend time with my uncle the more I find myself thinking “I wish he was my dad”.  It causes me to be resentful of my dad for no reason.  At the end of the day I had to accept that they both have a place in my heart but are fulfilling different needs in my life.  \n\nMy point being that I think it’s okay to recognize these good qualities in your partner, and it’s okay to want to feel protected and comfortable.  I think you’re on the right track since you already recognize that it’s not healthy to think “I wish he was my dad”.  But it’s okay to think “I want someone special in my life who has these qualities”.  He sounds very understanding and I don’t think you have anything to lose by being honest with him.",
            "I’ve seen a video from the School of Life YouTube channel that said in every partner we choose, there is something about them that either reminds us of how our parents treated us, or reflects our unmet childhood needs. I tried to find the video so I could link it here, but that channel has quite a few of these videos on dating and how parent-child relationships affect how we ourselves approach dating. It might be worth checking out some of their videos as a temporary self-help measure for now, since you mentioned you can’t quite get therapy yet. Best of luck to you.",
            "I think wanting to be nurtured is the most natural thing in the world for anybody. But especially for a person with your background. If you’re worried about it somehow ruining your relationship, or if it’s otherwise bothering you, get therapy. But definitely don’t hate on yourself for wanting to be nurtured by your partner.",
            "I think you need to stop worrying and questioning yourself. \n\nYou were abused and were not given chance to see unconditional love. \n\nYou’ve not quite known before I think how to know if a man is genuinely capable of giving you the security and affection you deserve because your father let you down and failed to nurture you.\n\nIt seems that despite the pain you’ve felt, you’ve found the right man and are comfortable enough to let your guard down and feel safe without any fear :) \n\nYou’ve suffered enough. Enjoy and soak in that family love. Be good to each other and those kids and go to bed with a smile x",
            "DDlg is not always sexual. \nThe feeling that you describe of wanting to curl up and absorb all of warmth, patience, kindness? That is very real and very tangible. You dont have to put a label on it either!\n\nId say it sounds like you were never really taken care of maybe and you just want to melt into the couch and be doted on. I think its totally normal :)",
            "DD/lg isn’t always sexual, but I realize that with the prevalence of this kink increasing that some people get an icky feeling about it. To me it sounds like you want a caregiver type role in your partner, which to me sounds completely normal. I was abused as a child and I want a partner that takes care of me in certain aspects of my life. Due to my upbringing, I push myself incessantly to succeed, often times, ignoring self-care. This is where I like my partner to step in, who enjoys it, and cares for me. Your feelings are valid, I would communicate then to your partner and let him know how you’re feeling.",
            "Awh bless you. This really made me feel deeply for you; you missed a healthy father figure in your life for so long, it feels like your boyfriend is filling in a missing puzzle piece. Especially when you wrote about wanting to duck under that umbrella too.  \n\n\nAs you said - it is not sexual or a kink. And it's certainly not wrong. You summed it up best when you said to him that you wished you had a father *like* him. I think that's the difference. You don't want you boyfriend to be *your* dad. You just wished you could've had a dad *like* him, when you were young and needed it most. \n\n&#x200B;\n\nI think figuring out these distinctions is important for your own peace of mind. It's okay. Your parents let you down deeply, and that leaves scars. You can have years of incredible, insightful and healing therapy that *will* do you the world of wonders, but sometimes I think certain traumas never fully leave you, but are like a bruise that heal slowly over time but never *fully* go away. You just find better tools to deal with the ache. \n\n&#x200B;\n\nYour boyfriend sounds wonderful. Sounds like a deeply caring partner, and a fantastic father to his own children. You're part of a new family now; and remember as the days pass, you're growing and healing and learning.   \n\n\nI know it's cliche, but definitely take this to your therapist when you next can see them. Iron out those creases. But you're not wrong or sick or weird for longing for a father figure to replace the one you never had as a child. As a kid, the very least you were owed was a good parent, and you did not get that. It's awful.   \n\n\nBut you are a strong, accomplished adult now. You've found love, you've found true family. You'll continue to grow, and soon accept that you never got the father you deserved, but you found love in different ways.",
            "I don’t have any advice but I also feel like this with a guy I’m dating. He doesn’t have kids but is a leader in his community & I love seeing the way he teaches and guides people & I often wish that he had been my dad or something idk. I’m just taking it as a sign that he would be an excellent father if we had kids someday",
            "The ways we love aren't independent from one-another.  The same man who treats his children with so much empathy, kindness, and patience is *the same one who is dating you*.  You don't need to be his child to reap the benefits of being loved by him, you just need to be loved by him.  Which, it seems like, you might be, so...cool!\n\nIf your boyfriend is as cool as you make him out to be, I'd think about a few key ways his behavior with his kids makes you feel so secure, and start trying to articulate them into \"When you  ___  I feel  ___  \" statements.  \n\nA good partner is supposed to help support and nurture you, right?  So he'd probably like to know how best to support and nurture you, right?",
            "This is a good thing! You have learned what positive healthy relationships are like, and have been welcomed to join them. As your relationship progresses, he will surely care for you too. Congratulations op some people don’t learn that how they grew up was dysfunctional, let alone find healthy relationships. They just don’t know how",
            "I would say this is pretty normal. Sounds like you found a keeper. Maybe, if you feel you need to express this to him, it's more like, I watch you with your children and it makes me so happy to see what a healthy relationship looks like, but it also makes me grieve for what I didn't have.",
            "Reframe it. You wish your dad was as good a dad to you as your boyfriend is to his kids. Does it still sound creepy to you?\n\nI think you’re doing just fine, OP. Wishing you and your bf the best.",
            "I had a difficult childhood too, and my partner at the time had \"daddy\" vibes that I found very emotionally comforting. So I took an unusual route to exploring it.     \n      \nThere's a non-sexual form of DD/LG that is called r/ageregression here on reddit. I only spent like two or three months doing it, but it was very healing. I talked to my partner first about what role I wanted him to take for the roleplay sessions. Several evenings a week, I would make sure all my adult responsibilities were taken care of, then I would dress up in pajamas and pigtails, or whatever made me feel small again, and age-regress.      \n      \nI would watch Blue's Clues and other young children's shows to get me in the mindset, and would get a bunch of crayons or stickers or play-doh to keep my hands busy. I talked to my stuffed animals again, and acted out scenes with them. My boar plushie acted out my feelings of anger, my dragon plushie became the voice of reason, my spider plushie would speak kind encouragement to me. Suddenly I was just spending evenings re-narrating my own development.       \n       \nThe role my partner took in these sessions was a kind parental figure, who would respond to my raw emotions with compassion and love. I let my feelings come out as unfiltered as possible (bar actual violence), so that I could have the experience of someone in a position of care towards me show me acceptance and guidance. It revisited events of vulnerability the way they should have gone.       \n         \n       \nIt was pretty weird at first, but it was like going into very deep wounds in my psyche and repairing them. My therapist helped me integrate what I was experiencing into my healing as well. Overall, I'm very happy for the experience, and gained the ability to be much kinder to myself.      \n       \nIf you did take an approach like that, I would make sure to use terms that are different than what your partner uses for his kids, i.e. if they call him \"daddy\" then call him \"papa\" or something instead. Just find clear boundaries, have a safe-word for when roleplay needs to end, and communicate needs clearly.       \n     \nHope this brings some insight, whether or not it's something you try.",
            ">It's probably not okay to cross wires like that... I believe in  communication in relationships so I probably need to talk to him about  it. But how do I tell him so it doesn't come off creepy?\n\nI relate very strongly to this post. Except for the part about finally picking a kind, gentle and patient man to partner with. Seriously, good for you! I grew up with an absentee father and an explosive rage stepfather. I seem to only gravitate towards emotionally unstable men. When I see men treating their children (particularly daughters) kindly and patiently, I notice feelings of envy (bordering on resentment) building up. I am in therapy of course and have been for years.  \n\nAs it relates to the question of how to tell your bf... why do you feel like you need to? I am a chronic over-sharer (as are many people from dysfunctional households that lacked stable and appropriate boundaries) and one thing I've been experimenting with lately is keeping certain aspects of my self-awareness private. I realize your case may be different, but for me, so far, cultivating some emotional privacy feels good and self-affirming.",
            "It doesn't sound like you want him to be your dad, but that you just want to feel that type of love from him that you were supposed to get from your parents didn't. The empathy and the kindness. I don't think its a problem. And you should be able to duck under your partners umbrella. Thats not wierd.",
            "Get back into therapy. You do need a dad figure for yourself - but you are in danger of boundary crossing with him that can turn dependent and can elicit some behavior in your relationship that would be unhealthy. This isn’t a link thing. \n\nIn therapy you can create a figure based on your partner to be your father figure. It would be a creation you can build for your internal self as a fatherly guide. So you can internalize\nSome of your partners behavior toward his children to build this internal figure so that you can stay partners and not become father daughter with your partner.",
            "One thing to keep in mind is you will *never* get that kind of unconditional love from him that he gives to his children. Parent-child love is different from spousal or romantic love. You may get that same sort of warmth and secure, protective and loved feeling from him but it's important that you remember being in a romantic relationship means you are never entitled to that love unconditionally and must not take it for granted. Sometimes thinking about what we have to put back into a relationship reminds us of that.",
            "I think it’s okay to feel this way, but don’t have him meet both needs as a father figure and a partner. You can feel the safety, security, fun and experiences the relationship offers but remember to keep that projection in check because parentifying a partner may lead to an inmeshed relationship- in my unprofessional opinion.",
            "I don’t think this is weird or bad. I probably wouldn’t tell him about it the way you phrased it in the title, because that would potentially weird him out, but it doesn’t sound like that’s what you literally mean anyway. \n\nIt sounds like you found a partner who is a genuinely good person, and are getting an up-close view of what a functional, loving family can feel like for the first time, and you want to be part of it. And that is GOOD. You *should* want to want to be part of your partner’s family! That’s... kind of the whole idea!\n\nObviously at this stage you’re an adult- you will always have a different role with more responsibility than being a child in any joint family unit you guys may choose to create. If you feel like you are struggling to differentiate those roles, more therapy to keep things clear for yourself might be a good idea. But it just sounds like you are in a really good relationship and it’s inadvertently stirring some painful realizations about what your own childhood was like. That doesn’t mean your “wires are crossed” and I imagine as the relative novelty of witnessing family functionality wears off, so will the confusing feelings about it.\n\nPersonally, I didn’t have an abusive father, but I did have an emotionally distant one. I lowkey expected my partner to be that way when we had kids, just because it was what I knew. But my partner is an incredibly affectionate and involved parent, and seeing him be so tender and engaged with our kids made me fall even more deeply in love with him. Do I wish I had had that as a kid? Sure. But more than anything, seeing it makes me realize I chose a good person to build a family with, and I’m so glad that our kids will have *this* experience of family.\n\nSeeing ample evidence that your partner is a good and kind person *should* make you feel more in love with them and want to be with them. That’s a healthy reaction!",
            "> now see how my amazing boyfriend loves his kids and I wish he'd take care of me/love me the same way, since nobody ever did. Is that wrong? \n\nYou're not talking about being his kid. You are talking about wanting someone to love you the way he loves his kids. That is fine. \n\nThat said, make sure you are not putting him in a place where he is responsible for you or he isn't getting the same support and love back from you that he would be giving you.",
            "It's totally normal to have a partner support you and encourage you as a good parent would. You should feel secure in your relationship. \n\nHowever, romantic relationships require a certain level of reciprocity that parent/child relationships do not. Your partner needs to be cared for as well, and you also have to take care of yourself.",
            "Things in life overlap sometimes and it's not necessarily bad. I think, at least in North American society, we can get caught up in labelling relationships in very specific ways. Your partner sounds very loving so it makes sense that it brings up a lot of emotions based on your past experiences. Do you think maybe you feel undeserving of it in some way? Or shame for wanting to be loved and cared for and respected? Because I don't think wanting those things is shameful, yet I could see how not receiving those things as a child might send you that message and make it feel more complicated now that you've met somebody so loving.",
            "I don’t think you want him to be your dad — you just love being around him when he’s a dad. I would say something like this:\n\n“I just want to get something off my chest because it’s been knocking around in my head. It’s weird but I love being around you when you’re in Dad Mode. I actually feel like it’s healing for me to see a dad who’s so attentive and gentle and loving with his kids. I just wanted to tell you how much I appreciate you letting me into your kids’ lives. It makes me love you even more to see how you take care of them, and it helps me realize at a deeper level how parents should be. I wish I’d had a dad like you. I didn’t, but I’m lucky to have a partner like you. Thank you.”",
            "Hey, OP! This is kind of the opposite situation, but my current partner is very much like my Dad. I have an awesome Dad and I wish that everyone could have had a Dad like mine. When I first started dating my partner I was weirded out because they were so similar (even have the same job) and I thought there is something wrong with me. I talked to my therapist and she told me that it's not that I want to date my Dad, it's that I've found someone who reminds me of him and that is something very comforting. There is something very nice about a man who gives strong Dad vibes. It's not a kink, it's just that nice comforting love that you can only get from a kind and caring man. Someone who isn't your father specifically, but who would make a great Dad. Then I realized that that is why I love my boyfriend, because he reminds me of my Dad and would make a good Dad... Nothing weird about it. It's nice to be taken care of in that way.",
            "\"I wish I had a parent like you when I was growing up.\" That's the highest of compliments to any parent, I think. You don't have to steal the umbrella to get under it too, just understand roles.",
            "There's a concept in therapy called \"reparenting\"--basically it's giving, as an adult, what you needed and didn't get as a child. Often we reparent ourselves, but not only--sometimes our partners help reparent us, our mentors, our friends, etc. I don't think it's weird or bad to recognize how healing seeing unconditional love and experiencing gentle and supportive love is. It might just be about how you frame it to yourself and your partner.",
            "You know I actually have been feeling the same way recently. My dad left after I was born, and I had no contact with him until I turned 13. Now I see my boyfriend taking care of his kids, and it makes me envious in a way. I don’t think it’s healthy, and I really do like his kids but I don’t know how to stop myself from wishing I had a dad as good as theirs when I was a child. I think I feel that way because I’ve been so hurt by my dad and I know my boyfriend would never do that to me. I long to be taken care of in such a nurturing way because I’ve never had that from my father. I can’t really even put it into words.\n\nIt’s a weird feeling, but you’re not alone and judging by the comments it happens a lot more than you’d think!",
            "This is totally normal. I had a fantastic dad. He was loving and caring and dependable and so funny. My dad died before I met my partner who I’m with for life and have kids with... but guess what? The guy I decided to have kids is a fantastic dad, he’s loving and caring and dependable with a great sense of humour. You’re supposed to want your partner to be good, and be a good father. Absolutely. \n\nI’m sorry you didn’t have that as a child. You deserve it and you should have. But don’t feel guilty about finally realizing that. Just be glad you’ve found a good person to be with.",
            "I didn't have my dad around and my stepdad was an arsehole and honestly, seeing my OH be a good dad to our kids makes me feel so similarly.  I just tell him how lovely it is and how much it makes me love him and he'll wrap me in a bear hug 🤗 \n\nI don't think it's weird, I think he'll get it, and you'll never take the warm blanket away from his kids, love doesn't work like that, hearts stretch ❤️",
            "I am not a therapist, doctor, or even versed in anything like this. But I just read the book Burnout, and in it, they talk about “completing emotions” to move past them. And I’m curious whether your longing for what he brings as a dad keeps growing, or do you feel the more you kind of safely luxuriate in it, you feel calm and at peace, and need less over time? I’m not even sure if you could tell. But their theory is stress comes from incomplete emotions, which often come from trauma. I think you’re very self-aware to notice what you’re doing, and how you’re compensating. But I wonder if spending some time trying to complete those emotions would help you? I don’t feel qualified to give advice on how, but exercise is one way they say it can help, breathing deeply all the way in and out several times, several times a day, crying, meditation. \n\nMy opinion is you’re self-aware enough, and comfortable enough with boundaries, you might be able to find a technique and start working through the losses in your life you’re realizing through him. Really mourn the shitty hand you were dealt, and appreciate how that has affected you and even how it’s made you stronger, and a more compassionate and appreciative partner and friend. \n\nWhen I have emotions to work through, I like to go for a slow walk and listen to some music that feels open/calming and think about the emotion, and everything tied to it, and look at it from various perspectives. And I swear there is a moment where my body physically releases it, and I naturally am ready to move on. But I’m doing stupid stuff like a coworker got me worked up. Or thinking about how I never dealt with a breakup. And even if you don’t release it entirely, you might get 80% there. It actually sounds like you’re doing this naturally, while observing. So that’s why I’m recommending it as an option.\n\nIf you want to know more for free, check out Brené Brown’s Unlocking Us podcast from this week. They walk through these techniques, and I did buy the book, but the stuff I’ve implemented came from the podcast.\n\nGood luck! I’m rooting for you and hope you find both peace with your past, and joy and peace in your present and future!",
            "I felt the same with my husband.  Watching him with my kids made me Rea realize how faced up my parents were.. I also was totally different than my parents.  I talked to my kids about everything unlike in my family where we walked on eggshells around my dad and never got to talk about what you were really feeling.   You have a chance to be the mom you needed with his kids too.   Sounds like you got a good one.",
            "While I wouldn't tell him that you want him to be your dad, in those words, you should definitely continue telling him that you love how he's such an amazing dad. Especially because you mentioned that he didn't have a great upbringing either, I'm sure he's tried very hard to be better for his own children.\n\nAs long as you still see him as a romantic partner, I don't think this is necessarily something to be concerned about :)",
            "You don't think deserve comfort and care from him just because you're an adult? Is that sort of the basis of your thinking?",
            "I don’t think this is actually creepy at all; you basically have come to think of him as the pinnacle of dadness and you wish you had had a great dad like he is.\n\nHave you thought about kids with him?  Even if it’s not something either of you want, if you think about it does it seem like a happy image?",
            "There are a bunch of good answers in this thread. The only thing i will add is, be careful not to actually desire parental love from your partner. That will end the relationship. I am not saying you are desiring at this moment, coz what you described is pure admiration for his parental skills.\n\nParental love is different than partner love. He deserves your partner love as you deserve his.",
            "I would just  tell him youre super grateful that you get to experience the love and respect that families are supposed to have and that seeing him be such a caring and responsible adult makes you love him even more.",
            "Sounds like a keeper. People don’t like to really examine it in themselves, but the archetype of what a good man is, whether they are your brother, cousin, friend, lover, mentor, dad, uncle, grandfather etc., naturally has lots of emotional connections and associations which overlap and in healthy relationships this is healthy...",
            "He does love you. Although not as a parent. I think you’re just coming to terms with feeling loved but also maybe not 100% trusting it or feeling sad because love from a partner doesn’t always seem as reliable, pure and constant as parental love. \n\nMy therapist said I’d probably get some feelings come up when I have kids because it’s a reminder of our childhood. However I don’t think she realised this already happened because I have a much younger sibling. It sounds like things are coming up for you because of bf’s kids.",
            "I mean, it sounds like the place it comes from isn't that different from those of us who have watched our partner with some else's kids and melted thinking \"he's going to be such a good father.\" And you should feel safe and protected and supported in a good romantic relationship. There's a difference between wanting someone who can do that, and wanting to be infantilized by a partner, in my opinion. I had a very happy childhood, so I can't really speak from experience. But it doesn't really sound like you've crossed a line.",
            "You already told him! When you said “I wish I had a dad like you” you said what you really mean. And if you want to explain further you can take an extract from your las paragraph:\n“There’s so much positivity and warmth and unconditional love in YOUR house that I just want to wrap in it like a warm blanket”\nAs you depicted him, he will understand",
            ">when he is kind and gentle to his kids, I like... passively absorb it, is the only way I can think to explain it. I feel safe and warm and protected in an extremely just, primal way? That I never felt in my own house or anything.\n\nNot even when you were living alone as an adult? Or maybe if you stayed with a trusted friend, did you ever get a similar feeling? While it makes sense it would be stronger with your boyfriend because you love him, surely you had other good people in your life that made you feel safe in some way. Or is he the first person you've ever felt safe with at all? \n\nIdeally if your mental health is in order, you should sometimes be able to achieve this sense of safety and warmth on your own, when you are living alone. But of course humans are social creatures so you're probably more likely to feel it with your \"chosen family\" of friends, boyfriend, etc. \n\nI bring this up because I worry that if this is the only source of warmth and safety in your life then you will put all your eggs in one basket, which is risky. You know how your boyfriend makes his household a warm, safe place? That takes effort and care, and you're right that he does it primarily for his kids but also for himself. If he didn't protect and care for himself then he couldn't care for his kids on top of that. So.... you can put in that same effort and care into your life and make your life a warm and safe place! For yourself! \n\nYou say you want him to be your parent, you want him to be that source of warmth. But that shouldn't be your primary source of warmth. He can't be your parent. Only you can be your own parent, I guess.  There's nothing wrong with enjoying the vibe of his household and wishing to be part of his family. But you need to avoid looking to him for answers to the issues in your life. If he can make warmth then you can make warmth, you can do it.",
            "Can't you just say: \"Dude, your parenting qualities never cease to amaze me\".  ?\n\nAre you attracted to him romantically?",
            "There is nothing wrong with feeling like that unless there are feeling of jealousy towards the kids.  Then that’s not cool at all and would need to be addressed.",
            "You don't want him to be your dad. The child inside of you, who had to grow up far too quickly and deal with very awful things, is longing for the things she never had. You're grieving a loss, and you're also seeing the possibilities of what you could have and should have been given. And that's okay. It's normal. \n\nYou can talk to him. He probably knows. Definitely talk to your therapists. And talk to yourself. Talk to the inner child and reassure her. Those of us who had to leave pieces of ourselves behind to survive  -- we generally find, as adults, that we have to get back in touch with those pieces if we want to heal. If you want soothing, ask for it and accept it. If you want to play raucously, do that. If you want to cry, cry. There is no one right way to recover from an abusive childhood.",
            "I'm not a therapist, but there are some similarities here in how I feel about my boy friend. So let me tell you about those, and what i think of them. I love how my boy friend parents. I admire his parenting. He's kind, firm, principled, just a great solid dad. Now, whilst I also wish i had dad like him, I don't look up to him in a fatherly way. But i do very much respect and admire his parenting skills. There are similarities in how one parents, and how one can show care and love for a partner. And that's fine. Just because I feel protected by my boy friend, doesn't mean I feel that he fathers me, or that I play a daughter role in any way. I don't treat him like my father, I treat him, and see him as my partner. I take a lot of comfort in how he parents, because it does tell me a lot about him. I sometimes think about how good it must be to have a father like him, but I'm also at peace with my own absent father now, and we actually have a good relationship now. So I think with some time, you might just find yourself focusing naturally on your partner and his skills and qualities, rather than what was missing from your childhood. If/when therapy is an option again, this will be a topic for discussion that I'm sure a professional can help you along with in a shorter amount of time than some topics. Enjoy his qualities. And think about other qualities he has, that he brings to your relationship.",
            "I think you're recognizing what safe, protective mail energy brings.  It doesn't mean you want him to be your dad, but want to have that safety, which a good boyfriend brings too.",
            "Just call him daddy in the sack.\n\nProblem solved.",
            "[deleted]",
            ">There's just so much positivity and warmth and unconditional love in his house and I want to just... wrap up in it like a warm blanket. But it's not mine... it's his kids'\n\nThis is where you're wrong. You DO get to get under that blanket. That's what we look for in a romantic relationship as an adult. As a kid, you hope you get it from a parent. As an adult you recreate that love and acceptance for yourself. \n\nI think it feels parental and not age appropriate because maybe...you've never dated decent men before? Maybe you've never been in a position to be vulnerable before? \n\nI think it's sad that you think that welcoming you into his family, he ISN'T offering the same to you. He is. It will look different (no punishments, no rules, more communication needed). \n\nGet under that blanket. And maybe get to therapy and figure out why you don't think that's yours to have, as an adult. Why that only comes from parents.",
            "Everyone wants to be babied. This doesn’t have anything to do with your childhood. This is just you wanting normal things that literally everyone wants.",
            "Not an expert, but it sounds like you are attracted (for lack of a better word) to his warm and protective nature.  There is nothing wrong with this.  While they don’t exhibit themselves in the exact same way, the traits of a caring SO and loving parent are very similar.  It is likely that you fell in love with him for the same reasons you respect his parenting.  He’s even tempered, open with his emotions, and generally speaking you feel safe around him.  Love (of any kind) often makes one wish to be vulnerable and open around that person, the same way that children are generally when they are young.  You’re seeing his relationship with his children as an example of what happens when people are vulnerable around him.  Some people take advantage of vulnerability, but he doesn’t.  I won’t go as far as to recommend how to talk to him about how you feel, but words like “vulnerable”, “warm”, and “safe” are probably a good starting point.  Best of luck, it sound to me like he’ll understand.",
            "A counselor would be a very good idea. You could work out some of your trauma and such with them and come to an understanding that will help you cope with it and embrace your new found love and comfort.\n\nYou're now in a position to be a mature adult, even though you miss the childhood you could've had, the past cannot be changed. We can only adapt and grow.",
            "I haven’t read that many comments so maybe someone already said this but I’m going to put my educational background in clinical psych and ten years of personal therapy to use here. \n\nThis is not an abnormal want when you came from a traumatic background. When we grow up with developmental trauma (emotional, physical or medical neglect, any type of abuse, frequent invalidation etc.) and learn to perceive ourselves as unworthy of our parents’ love, which becomes part of our significant relationship schema, a part of us can be stuck at the age where that emotional development was hindered. Though people may not realize it, affection, unconditional love and support, trust, a healthy level of boundaries and freedom, and the ability to both have individuality and acceptance from our family for it are just as crucial to meeting developmental milestones . those internal senses of worth and care and protection are incredibly important to later having a healthy relationship with oneself and with others.\n\nIf we lack that in childhood, we seek it in other ways later. Two of the most experienced, educated therapists I had through my life talked with me about this in my own therapy and we learned similar things in my grad program. I also have had clients in the past when I did therapy who struggled with these same issues. There is nothing wrong with you for the abused part of you to want to be loved - if a part of you froze developmentally because of that abuse and neglect, it wants the healthy love it never got. Because we are adults, we can’t get that from another adult in the way we are wanting it. In adult relationships we are expected to be able to provide reciprocal care, support and demonstrate maturity and effective communication. So we kind of have to be a middle ground for ourselves - we are our parent now and we have to become the version of ourselves we needed when we were younger. We call this “self re-parenting” and the point is unifying that old trauma based need with our current self, becoming a “good parent” to ourselves to meet that childhood need appropriately.\n\nI think there are ways you can explain how you feel to your significant other without it feeling weird and a good partner will understand where you’re coming from. I explained it to my partners similarly to how you’ve done here. “I’ve had a past experience growing up in an abusive household. This caused me to feel (however you perceive it to have impacted such as unworthy of love, anxious, etc. whatever applies) and I have worked on this in therapy in the past. Seeing how good of a parent you are is such a different image of what family can look like to me because it’s the complete opposite of my experience. It makes me feel so happy that your children have such a good parent and are so loved and supported. Seeing such a positive relationship has brought up some feelings for me that I wasn’t expecting and a part of me that never had that kind of love and support feels sad even though it’s a positive thing to see. I wish I’d had a parent like you when I was younger. I’m working on coping with those feelings of loss (because it is a loss - realizing childhood you will never have that from your own parents is grieving a loss just like any other type of loss) from having to grow up without that, and I appreciate you listening to me talk about this because it isn’t easy. I want to find a way to address these feelings and my needs related to this in a healthy way with you.” \n\nEssentially that’s how I approached it with my significant others and especially my girlfriend was incredibly understanding, felt it made perfect sense and times when I’m hurting worse, we acknowledge it together and she tells me things I need to hear because my brain is defaulting to an old abused mindset. I am still able to provide support to her and we have a very healthy relationship with lots of communication. It’s truly a process of grieving to let go of the pain and hopes and dreams of an abusive childhood but it gets better. My girlfriends niece has two amazing parents, amazing grandparents, and amazing aunts and uncles who all love her to the ends of the earth. I love her too and I love seeing how much she grows emotionally and intellectually with all of that support and I get emotional to myself sometimes at how happy I am she is so loved, that she will never grow up feeling unworthy or know what abuse or neglect feels like. I feel equally as protective and supportive toward her as my girlfriend and her family does. At the same time a “frozen” part of me has a deep sadness that I never had that and how different should my life had been if my parents had just done their job? It brings up a lot of grief and anger but I deal with it privately when it comes up and process grief with a therapist, which I also highly recommend if you find the opportunity to see a good one. You can find lists of therapists on psychologytoday who have specific specialities like childhood abuse trauma and relationships. It will also list the insurance they take and other important info. \n\nGood luck with everything and just know you’re not alone in this and it’s not abnormal to want to be loved and supported.",
            "Honestly the best thing I can think of here is when you’re more attracted to someone because they’re a good parent. This is just a good way to kind of gloss over your negative milestones with positive ones and fill you up with more love and compassion than you ever thought possible. \n\nThat might be the description I’d go with",
            "This is not creepy.  And I don't think it's something you need to worry about.\n\nIt sounds like you just finally found your people, and I'm so happy for you.  :-)",
            " Bro just got Dadzoned.\n\n\nI mean not really, but it's a kind of funny concept. Good luck OP. You'll be fine.",
            "Sounds to me like he's already giving you that. When you spoke about your upbringing, he was kind and comforting right? Patient and understanding? \nI think your to focused on the fact that you've never had that growing up and it's blinding you from seeing that your getting it now. Sounds to me like he's got enough love for his kids and you. Stop dwelling on the past or you'll miss it...",
            "This title and where this went were two totally different directions. I think this is way more normal than I expected it to be, it makes sense given the context.",
            "[deleted]",
            ">There's just so much positivity and warmth and unconditional love in his house and I want to just... wrap up in it like a warm blanket. But it's not mine... it's his kids'.\n\nDoes he treat you worse than the kids?  Is the positivity and warmth and and love not there for you too?  if not, maybe express to him that you're like a little more of each of those things.  If so... then it is not just the kids', but yours too.  Make sure you do your best to give the same energy back to both him and his kids!",
            "You are ok and it is ok to feel that way. Tell your bf how you want to be treated.",
            "Just show him your post here, if he truly loves you he won’t freak out",
            "If you know what Ddlg is you’d know that it can, in fact be non-sexual...",
            "[removed]",
            "You’ve gotten a lot of good input already but I did want to let you know that there’s a lot of “scenes” you can do inspired by BDSM that aren’t sexual. CGL is one of them. \n\nThere’s a couple of things at play if you decided to approach it that way:\n\n- to heal from childhood trauma, you essentially have to envision yourself as an adult taking care of your childhood self. You may need to do this a few times depending upon how your developing psyche reacted to the trauma at different times. a lot of us with childhood trauma have “splits” - not “alters”, but splits are sort of a Stamp that has stuck around that pops up internally (and sometimes externally, referred to as age regression). that Stamp of yourself has not yet processed what you were going through at the time, and taking care of that version of yourself the way you needed at the time is key. This is usually guided in therapy (I have a 12yo split of myself hanging out in a HUGE library with all our favorite snacks and my grandma and a big beanbag, and the library’s encased in a huge, impermeable bubble of light; my mother was guided in a meditation session where she “found” her past self in the place her abuser had hidden her and brought her out; etc), but there are a lot of ways to do this for yourself. write a letter to that specific version of you (is she 2? 7? 14?), hypnotherapy audios; researching “inner child healing exercises” may help. the difference is with people who grew up in homes like we did, we usually don’t have one inner child, but many splits, so this will need to be done for each individual split.\n\nthis leads me to:\n- CGL or other similar “scenes” with a trusted partner can be very therapeutic. sometimes sex is involved, and sometimes it’s not! either way you would speak with your partner about this. healing this part of you, it’s essentially about *showing* yourself, and your splits, that you are worth being taken care of. in this case it could be as simple as setting aside a day/a few hours where you don’t have to be an adult. his kids can be maybe with a babysitter, and you and him just indulge in whatever that version of you needed. being held? being gently guided for chores? whatever works for you. a lot of littles will color pages, collect stuffed animals, etc; some others just need time and space to Not Be An Adult for a while. this can be done without anyone else but the idea of CGL is that you have someone protecting/caring for you while you’re in that state. there are a *lot* of people who non-sexually do this sort of thing for trauma, because it’s really meant to be a healthy coping practice. sex isn’t required.\n\nyou don’t have to do any of the CGL/little stuff but I wanted to let you know if any of that resonated with you it’s okay.",
            "[removed]",
            "[removed]",
            "He is trying to taunt you by showing off how good he is. He probably knows about your shitty parents and is now making you feel terrible about. You dont deserve it. Just break it off",
            "My therapists have said: people (esp with trauma) find people who are like their parents or fill parent roles, for better or for worse. This isn’t an unusual thing. \n\nIt sounds like you need to talk, if it’s true what I hear is you’re saying you need more affection and love. At the end of the day “treat me like I’m your child” is not a healthy relationship. I think there’s ways to express what you’re wanting, just keep in mind it might not be exactly as it looks like. Because its equally not as good to ask your partner to fill a hole that trauma caused. That’s not fair to your partner. \n\nHealthy relationships take time to make sure you aren’t developing codependency. If you have the ability to have a couples therapy session that can help to talk about hard things and learn how to talk about them.",
            "See it as you wanting a older male mentor (surrogate dad) rather than some weird dynamic wherein he’s “dad.” Daddy issues (please don’t hear it as a terrible thing...none of us have a choice about what kind of parents we get) often causes girls to grow up wanting an older man to take the lead and teach her about life and how to navigate it best. \n\nBack in the olden days, there were social systems of tutelage that included benefactors and patrons. Sure, some of the relationships got a little shady in this system, but the intention was that an older, wiser, and caring person always had the best interests of the person they’re counseling and providing guardianship over in mind. Read about *tutela*. I’m sure you’ve come across it learning about European history sometime during your schooling; many past artists of all genres, for example, had benefactors or sponsors—as they’re more common known as nowadays. \n\nJust be careful of sociopaths and narcissistic men who prey on women looking for this dynamic in a relationship.",
            "You might want to be careful approaching this. Wanting that safety and love from your SO is much different than yearning to have them take on a parental role with you.",
            "It is not a daddy kink. It is a great empty inside, left behind by a dysfunctional parent. \n\nThe great empty inside never goes away.\n\nIt is a challenge to function carrying that around, but if you have a Child with this man, your baby will have a great father. And a great mother, because it is a choice.",
            "Did he learn it from his dad? A lot of in-laws, despite the bad connotations, actually seem to serve as semi-parent figures to the person their child married.",
            "I honestly think you are doing a great job of educating yourself, thinking this through, and understanding your own emotions. You’ve also already communicated to him a good deal of it without scaring him off. It’s not as weird as it sounds. You are just more thoughtful about it than most people would be. Go on, girl.",
            "I came across this similar feeling recently too. I didn’t grow up with a dad, but I did grow up in a loving single parent home. In reflection of seeing my bf in that light, I realized that I recognized in him the qualities of what I want my partner to be and the future father of my children to be like. This has never been something I’ve ever known in my other relationships growing up. There’s something primal in empathy and kindness that pulls you in and makes you feel secure. Perhaps it’s not that you want him to BE your dad but you recognize the qualities of what you are looking for in a partner. I must say it takes a lot of internal work to recognize this.",
            "Hi, I just want to add that it would be a very good idea to ask your psych about schema therapy. It provides an outlet to reconstruct parts of your childhood with a happy ending. It’s pretty much what you’re doing with your boyfriend accidentally but you can do it with the safety of a therapist and the potential wire crossing of him being your boyfriend too.",
            "Don't talk to him about it.  Talk to your therapist about it.  Think about it for a month or two.  If you still absolutely have to talk about it, work with your therapist to find the right words.  What you want probably isn't him to be your father, you just want to \\*have had\\* a father.  It's normal that seeing a real father makes you grieve and all kinds of feelings arise.  That's fine.  Don't assume that because you feel it today you will always feel it.  Most likely, it will morph into just a desire to be loved and protected and to love and protect in return.  In any healthy peer-to-peer relationships there are moments where you can be the 'little girl' and snuggle with him - and vice versa.   But talking to him about it without a lot of advance planning is likely to come across the wrong way.  It could be something that it's really hard for him to understand.  Give it time and think it over first.",
            "It might be an idea to show him this post. Your description sounds completely understandable to me - not “strangely sexual” or anything like that. It’s already written and it does a good job of presenting how you feel with sufficient analytical remove.",
            "Op, your post had brought me one doubt: what kind of therapy you had? I ask because it looks like psychoanalysis when you say some things, but it doesn't look like you fully understand what is happening to you. Sorry if I'm being rude.",
            "Okay it may not be exactly this. As well it could be you just looking for affection in a way you never got it before. But also ddlg isn't actually sexual most of the time. It's actually usually a coping mechanism, when they get stressed the regress (I've known a couple littles throughout my life)",
            "You've got plenty of great advice here, I just wanted to chime in and say that no sex/sexual energy is not a requirement for any kink activity. The dynamics and specifically Dd/lg doesn't need to have a sexual component to be used. I know people who explicitly hate having that dynamic \"tainted\" with sex.",
            ">I know what daddy kink/DDLG is... and this isn't it. It's not sexual at all.\n\nDD/lg is not inherently sexual at all either, but it's not really relevant to your situation either way.\n\nIt's normal to feel the types of feelings that you're feeling about a significant other. It doesn't have to be framed in terms of \"dad.\"",
            "I think your “how a BF/partner should treat me” meter is as broken as your “how a parent should treat their kids” meter. I imagine your father treated your mom pretty horribly, so that’s what your meter registers as “normal”, and that a BF treating you with respect and empathy and love, even if you make honest mistakes, seems foreign. You see that in the way he treats his kids, but you should also demand that from your BF/partner. Yes, a romantic relationship isn’t the same as a parent child, but things like love and respect and empathy are present in both. You aren’t looking for this guy to be your dad, you want to be treated with the love he shows his children and that’s just fine. Now, he’s not perfect, so you shouldn’t just give him a free pass to treat you however based on how he treats his kids, but he sounds like a keeper.",
            "maybe research what littles and age regression is",
            "You should share with your partner what you like about him, and your mind about how you would like to be treated. It's a healthy behaviour. You probably can reach a happy compromise on the subject. :)",
            "I feel this sort of way towards my bf too. Grew up without a dad, abusive household, abusive relationships. My bf doesn't have kids, but he is the nurturing type and it's very comforting to someone who has never been treated with love or respect before. I think about what a great father he will be one day, but for now I am adoring being the object of his total affection. It does get some wires crossed when you have a void to fill and someone makes you feel like you found what you need, I think it's more about the nurturing aspect for people like us. It's a good situation because it allows the opportunity to work through trauma and create expectations for how you should be treated, or for how the furture father of your children should treat the family. I have learned so much on how to treat people and how to be treated from this relationship. Thank god because in my early 20s I was the classic \"daddy issues\" waitress that went after older guys because I was subconciously looking for some kind of parental comfort in a world that had chewed me up and spit me out so many times I was basically a shell of a person wanting to walk into oncoming traffic. A year later, I am a completely different person. I still struggle in some ways, but I am healing for the first time in my life. All it takes is one person to change everything, good or bad.",
            "You just want to be loved, hun, you don't necessarily need to be his kid or take up that role. Loving, romantic relationships also exist. He'll treat you kindly too.",
            "I feel for you, OP. I think you were raised to think about things in unhealthy ways, and now that you're seeing and experiencing people dealing with family issues in healthy ways, you're thinking it's something unhealthy, because your brain feels like it's in a bizarro world. It'll take time to really cognitively and emotionally process that up isn't down, right isn't left and abuse isn't love. \n\nNothing else to add, just really glad to see a thread in this sub that actually demands thought, depth and engagement instead of just letting the hivemind default to the binary of \"divorce\" or \"YTA\" or \"red flag.\" Sounds like you lucked out, OP.",
            "i don't see the problem tbh. Like you said, you already know about the sexual implications of daddy/daughter kinks, why is it so bad to indulge in one that ISNT sexual?",
            "You wish he were the dad you had growing up. \n\nI think that is a normal reaction as we get older to see things and wish we had that as kids.",
            "I know exactly what you mean. Not my boyfriend, just a good friend but exactly the same thing. My memories of shitty family vs watching his healthy loving interactions with his kids. \n\nIt's both incredibly reassuring to see that a family that good can exist, and painful when you contrast it with your own past.\n\nI think it's pretty natural to look at that contrast and feel a lot of stuff. But I think what you want isn't for him to take over and parent you, but for your inner child to have a parent like him instead of the one you actually have.\n\nThe thing is, it's not specifically your boyfriend. It's the overall set of behaviours and attitudes and the obvious, expressed love. I'm pretty sure if you had a female friend who was being a loving parent, you'd be having the same kind of reaction.\n\nThis isn't something you have to do anything about, at least not externally. Sure, tell him how glad you are to see good parenting. But the rest of it is really you continuing to heal from your childhood. You've gotten far enough that you can recognise his reactions as healthy and loving instead of thinking that kid should have been smacked or something. That's progress.\n\nThis is a sign from you, for you. A good one, I think. Maybe an opportunity to normalise for yourself the expectations your family will taught you. Definitely one to really look back at incidents that scarred you and go \"that was fucked up and not OK to do to child me\".",
            "I think you guys should def try agere.",
            "When I was married I was married to a man who supposedly really liked my independence and I always likened our relationship as two runners running a marathon side by side.  We didn't really nurture each other.\n\n&#x200B;\n\nAfter the divorce I have been in relationships primarily with nurturers.  It is fantastic.  Try asking for what you want and see how that goes.  Don't say you want him to be your dad.  Tell him you really like his nurturing nature and would liek to see it in your relationship.\n\n&#x200B;\n\nFYI DD/lg kink is not just about sex either but also about nurturing.",
            "This makes total sense. Look up Attachment Theory.\n\nThe short version of that we have a whole brain system devoted to seeking and maintaining a relationship with a primary care giver. When we are infants and children this is our parents.\n\nWhen we become adults we attach to our romantic partner.\n\nThe reptilian part of our brain doesn't understand time. So seeing healthy parenting speaks to the wounded child in you.\n\nThe book Getting The Love You Want explains this in full detail, I highly recommend it!",
            "Instead of father figure sounds more like he's exactly what you need as a spouse. Not only a father acts that way to care for you that way but our husband's also should make us feel secure and safe and loved that way too. And it's what you should want for future children you may have. Do not cross wires it's okay to wish you had a father who had his compassion and understanding but normal people aren't in love with their dad's.  You need to make the proper distinction between the two, its okay to say you admire his abilities to be such an amazing father and that when you you we him being so great you realize how those traits are also shine through in how great of a boyfriend he is to you as well.",
            "You’re fine, I think, if you’re being totally honest in that you wrote. Anyone would want a dad like that, and especially someone who probably has cPTSD from an abusive household. Enjoy this warmth and love. Get back to therapy when you can.",
            "I get that you wish you had a patent like him. But you dont want him to be your parent, so dont phrase it like that. What you really want from him is normal, a good relationship, maybe a futute Child with him, a caring partner. What you wish you had in life was a good parent, but that he can never give you, you Just see it When he is around his Kids. Dont mix them up, it is not what you need or want in the form it would /wouldnt Come.\nJust tell him you appreciate him and that you want to Carry on that way of being instead of how you were raised. It doesnt Just relay to kids, but general relationships.",
            "It sounds like you’re dealing with some complex regret about what could have been. That’s extremely difficult. I’m sorry.",
            "You want to be treated how family should be treated. Not like a good parent treats a child. Judging by they way you described those few interactions, you have a good guy there and you will get or already have what you want.",
            "You *can* duck under that umbrella; you're his girlfriend. I don't think you actually want him as your dad, you're just caught off guard seeing a protective, empathetic, masculine figure for the first time.",
            "Sounds more like you are talking about a \"little\" dynamic than DDLG. It's not my thing but I had a couple friends who had that dynamic so I ended up learning about it. I found the subreddit, its r/littlespace",
            "I don’t think this is creepy at all, your feelings seem very sweet and understandable given the situation. I would really recommend you work with a therapist on how to manage all these relationships though. I had an awful relationship with my stepmother and I suspect the root of it was that she had a similar sense of wanting my dad to be a dad to her too. Again, very understandable given the shitty traumatic situation she grew up in, but it led to weird aggression and competition between her and my sister and I. So give yourself permission to feel what you’re feeling, but especially if you’re already feeling some discomfort around crossed wires I think getting your own therapist involved for support could be really helpful.",
            "Sounds like you found a good person, one who was raised by loving, caring and smart parents.  He’s a keeper.  One thing of note that you probably don’t realize is that you, despite your troubled upbringing, are a good person as well.  People like him are smart enough to not choose to be with troubled people. \n\nYou have a lot to learn from him but you definitely have a lot of potential. Best of luck !",
            " The Positivity, warmth and unconditional love that he shows his kids can be yours as well. That stuff isn’t pie where there’s only so much to go around. There’s an unlimited supply. \n\nI have the warm fuzzies for my husband when he parents our kids and it makes me literally curl up in his arms and feel safe just like one of our kids could do. It’s not creepy, it’s not sexual- it’s safety and love. \n\nThese feelings you have don’t include jealousy of his children so you’re all good - just enjoy all the warm feelings that make you feel safe and wanted and loved. \n\nGood for you for finding such a healthy relationship that lets you explore what having a safe, strong, loving, supportive man feels like. You deserve it.",
            "To get over someone get under someone else ahhhhhh",
            "I'd suggest looking into reparenting yourself and attempting to spend time with your inner child, to give them the parenting they need (you now have a model of it to go by). And look for some other gentle male figure in the area to treat as being like how you think a father should be and that your BF is being like that father, but he is his own separate entity from that father figure.\n\nIMO your inner child is trying to attach to a healthy parent, which is fair for it to want to do that. But try to arrange for it to attach to someone else who is nurturing and for you as an adult to parent that younger part of yourself.",
            "Grew up in an abusive household. Married a man who loves kids. Made my life's work raising children in a loving home. The end.",
            "You don't want a dad, you want a healthy relationship.",
            "The daddy/lg kink is not always sexual. I would say I know more people who it isn’t sexual for than it is. A lot of the time it’s someone who has had a similar childhood to you who is looking for someone to take on a caregiver role. Talk to him. Tell him that sometimes you wish you could feel taken care of the way he cares for his kids so that you know what it’s like to feel that loved. Or something along those lines. Lots of people crave the love of a parent figure, what you’re wanting is not unusual at all.",
            "That doesn't seem out of the ordinary or anything. He's a great father & seeing that made you realize that you wish you had some of those experiences as well. I definitely didn't think it was some sort of \"daddy\" kink from reading your explanation. It's not sexual it's emotional. I get the feeling if you talked to him about it, the conversation would go well. Sounds like you got yourself a pretty understanding guy. He won't think it's weird",
            "He doesn't have to be your dad to treat you with unconditional love and respect. He can do that as a partner. Tell him you absolutely appreciate and love that about him. Id stay away from the whole, \" please be my dad\" line of thinking...that would go the wrong way...",
            "the way you are putting this makes it sound a lot worse than when you explain it. \n\nit seems that you still want to be an adult woman free to make her own choices, and it doesn't seem like you are trying to reject adult responsibilities. \n\ni think you are longing for unconditional love - a natural longing for someone who comes from less than ideal parenting. you don't actually want him to be your dad; you want him to care about you no matter what - even when you misbehave, like that scene you witnessed. remember that this is your boyfriend, so having him be your dad is sort of giving up any romantic and sexual relationship. I don't think that's really what you want, lol.\n\ni think you should communicate to him how overwhelmingly attractive it is to see him be a good parent. You can even say his kids are lucky to have such a good dad, or that you're jealous his kids have such a good dad.\n\nno matter what you don't want to phrase it like you want him to be your dad.",
            "I think you want a man to be like him. To feel protected, to be cared for, to fight for you when you are hurt, to love you unconditionally.  My dear, i think you have found him.  Do treasure him and best of luck. 🤗🙏",
            "You can ask for whatever you want or feel like you need in a relationship. \n\nIf you're worried you're not able to communicate it in a non-creepy way or fully express exactly what you're feeling, you can start by leaving the context out. \"Hey, I'm feeling a little vulnerable today. I could use a mega-cuddle. Can you wrap me in a blanket and give me a 5 minute hug? I think it would help.\" \n\nAnd don't feel like you're taking anything from his kids. Love isn't a flashlight that only shines on one spot at a time. It's sunlight.",
            "So my best friend, more then a brother then a friend, has become a father. He invited me to visit his new family in the hospital and I was allowed to hold his newborn. It was one of the strongest feelings I ever had.\nYesterday I visited them and witnessed the first steps of the child. It was nearly as overwhelming as holding him for the first time.\nThis child is born into a well functioning and highly loving atmosphere.\n\nSometimes I catch myself with the thought that I would have been a better person if I would have been born in such a family.\n\nI think that this is quite normal. I love the child. I love my friend and his wife. I am melting for the thought that the child is rising in such harmony.\n\nI want to raise my future, if that's ever going to happen, child in the same way.\n\nTake your feelings as a true side of you. Don't you dare to ignore them. Suck up all the love. Treat his child's the same way. Strong feelings connected to children are normal. He will not love you the same way as his own child's but he can love you with the same intensity.",
            "Work on your inner child. Lots of research on how to heal that since therapy isn’t an option right now. In the meantime just enjoy him. Sounds like he’s a great dad, probably would be a great husband too so keep your fingers crossed and his family could become your family 🙃 nothing wrong with what you’re feeling. You are well beyond the age of having a “daddy” the same kind of love he has for his kids, he can grow to have for you so no competition there.",
            "Just wanted to stop bay and lyk how happy reading this made me! I'm so glad you found someone like that! \nIt's definitely nit creepy at all and I'm sure he understand what you mean. \nI also don't think this is you wanting him to be your dad in a way he is a dad to his daughters (aka making decisions for them, check on their homework and what they are doing at most times or getting read beddtime stories) \nI think you just want the same compassion and understanding you see him treat his daughters with. \nWell if he's as great of a partner as he is a dad you can already get that from him!",
            "You are so normal. Legit. \n\n\nMy mentor/friend is my stand in dad and he is a whopping 3 years older than me. Lol. \n\nWhen you are in a place to absorb a good environment that is healing, just soak it in. No need to over think it.",
            "I’ve had similar earth shattering revelations after seeing my brothers kids grow up and seeing how he treats them. My mum was physically, emotionally and psychologically abusive and dad had mental illness. The home was unstable and violent and I was in fight/flight mode a lot. It is understandable that having come from an abusive/unstable home environment that witnessing how a loving parent behaves, it will highlight even more the things that you missed out on - which can be quite jarring. I wrote out a bunch of stuff that happened in my childhood and read it to my partner, who came from a loving home, and it was so interesting and comforting to hear that from an outside perspective, some of it was really fucked up and it makes sense why I ended up struggling with my own mental health. There’s a certain grief that comes when you acknowledge the adversity you experienced in childhood - make sure you acknowledge your emotions but don’t make it mean anything about you. It’s not your fault that your parents didn’t meet your needs as a child. It may be handy to look up Adverse Childhood Experiences (ACEs) and Complex Trauma - I found it useful to educate myself on the effects of growing up in an unsafe environment.",
            "Hese a great dad, you wish you had a dad even half as caring as him. You don't wanna be his daughter, you wanted your dad to be like him. Now you know - hese a keeper.",
            "We all carry an inner child within us, even in adulthood. It is that child that makes us act insecure, or lashes out, makes us feel vulnerable. That part of yourself still craves the feeling of being cared for, probably because you never received it.",
            "I grew up in an abusive household and have also \"crossed these wires\" in healthy and less-than-healthy ways with partners before. I think enjoying the modeling of treating everyone with respect and understanding that he exhibits with his kids would inevitably bring up grief for the small you that didn't get those things, and a desire to give it to her now in a way that, I found for myself, did lead to some regression and being a little less adult and independent when I dated a good \"dad\" esque guy for the first time. Like, for exanple check my oil and tire pressure for me regularly, and that felt really \"dad\" and caring in a way that id never gotten, and then I got a little too used to expecting him to do that stuff on a way that made him feel overly responsible for me and led to some resentment, and resentment on my part for not treating me like an adult, even as other parts of me found being fathered a bit Soo delicious after being deprived of that my whole childhood.\n\nThat all said, it also can be so wonderful and healing to get a sense of family you build with someone in a way that you can really cherish because you know what it's like to not get those things, my current partners family is so warm and loving and respectful that it made me really, just feel a lot of grief at first for my childhood self, but also with time, so much hope that I can be welcomed into that and allow myself to feel deserving of that love.\nJust keep communicating, parentification is pretty common and it probably means you feel really safe with him, just keep talking to him and try and separate out your childhood feeling voices from your adult responsibilities to an adult romantic partner as best you can together .",
            "Ddlg isn't just sexual. A lot of people have non sexual ddlg relationships not for the kink but for the caregiver/'little' relationship. That person takes care of them, cooks, reminds them to do things, makes the big 'adult' decisions and much much more and not usually 100% of the time, just when that person feels they need that extra care and attention.\nIt's a lot deeper than just the kink side and actually quite popular. It's worth reading into non-sexual ddlg/caregiver relationships.",
            "I've had someone say this exact same thing to me, with an almost identical explanation. I found it very flattering, and also quite heartbreaking for them. It wasn't weird. I totally understood where they were coming from.",
            "When you are a child, your parents are typically your attachment figures. They are supposed to be the ones you go to when you need reassurance, help, attention, problem solving ect. But when you grow up, you replace your parents with your partner and they become your new attachment figure. This is why so many people unconsciously seek out partners who are similar to their own parents, because they want a familiar attachment figure. You seem to have lucked out and found someone a much better person than your parents were, this is fantastic. Your concept of parental and romantic relationships is are dysfunctional from your past experiences. A partner should be kind, considerate, patient, and so should a parental figure. But that doesn't mean you want your partner to be your parent. I'm sorry that you didn't have the best parents growing up, and I'm really glad you have found someone who can show you what familial love is supposed to look like. Many times people in your situation will gravitate to someone just as abusive as their parents. I wish you both the best of luck in life.",
            "This isn’t a kink. This is you discovering how life should have gone. It’s ok to sit there and think ‘I wish I could do childhood over again, but with a father  figure to me like you are to your children’.",
            "I'm sorry that this causing you hurt and confusion, OP - and I'm obviously very sorry to hear about the troubles in your upbringing.\n\nYou say you are worried about coming off as creepy/pervy/Elecra-complexy etc. However, in what you have written above you articulate your feelings extremely lucidly and without a hint of creepiness, I think.\n\nIt seems to me that you sum up the crux of what you feel in the following two sentences, and without any creepy vibes whatsoever:\n\n&#x200B;\n\n>\"There's just so much positivity and warmth and unconditional love in his house and I want to just... wrap up in it like a warm blanket. But it's not mine... it's his kids'. And I probably shouldn't get the wires crossed like that \"\n\n&#x200B;\n\nIf your SO is as emotionally intelligent as he appears to be in your narrative \\[no reason to doubt that, as far as I can see\\] then I am pretty confident he will understand your feelings just from what you have written above.\n\n&#x200B;\n\nA second, and whole other question, is how far this is anything pathological. Many esteemed redditors have assured you that this is not really that unusual in the comments here and I am inclined to agree with them. If you started viewing him as a father figure, or resenting his kids because he actually is their father, yeah, ok those would be problems. But this actually sounds pretty understandable and normal to me.\n\n&#x200B;\n\nTL:DR,\n\n1) by all means open up the conversation if it will bring you relief - but don't beat yourself up thinking you have to bring this up as a matter of urgency because it is something shameful or problematic in itself. It ain't.\n\n2) If you do bring it up, use the words from your own text quoted above to articulate succinctly the limits of the matter.",
            "You don't want him to be you're dad. You just want to be loved the same way he loves his children.",
            "Tell him like you did in this post. Your title comes off wrong but the post itself isn't creepy at all.",
            "I have to say that as a person with a very unhealthy family dynamic, I am very attracted to people who have the capacity to give me a stable lifestyle. Seeing people react to conflict in a productive and loving manner is so sexy! It’s definitely okay to want that.",
            "To be fair, DD/LG isn’t necessarily sexual.",
            "You can engage in DD/lg activity that isn’t at all sexually charged. Most kinks can be separated from sex and many kinky people never cross the two. \n\nThe genre is generally divided into babies, littles, and middles, which is pretty much what it sounds like. The people I know who have similar stories to yours identify as middles. They don’t want to be infantilized, they just want to feel a nurturing parental energy and let their minds settle into a safe space where they color in pillow forts while blasting Disney songs and not think about Excel spreadsheets and bills and shit. And they don’t want it to be sexual, they don’t want to have sex while in that mindset or call someone Daddy in sexual contexts. \n\nIs there a chance you could explore that a little together? Slowly spend short amounts of time in that mindset. It doesn’t need to be an elaborate role play or an all day event. Watch a favorite kids movie while sitting on the floor. Pile up some blankets and pillows, have him sit behind you, legs spread, and wrap his arms around you. Maybe make some snacks and he can occasionally feed you a piece or two. It’s light and not sexual, not a creepy thing to do. Some people do that without any parental connotations. Just a thought.",
            "What you’re describing is a longing to be in a normal family dynamic and to be protected in ways you weren’t as a child. This is totally normal. I tell my boyfriend all the time I love our little family (me, him and the dog lmao) and he is our protector in so many ways. He’s a big tall dude and me and the dog both snuggle up to him on either side when we’re on the couch. He makes me feel safe, like a proper family unit. That’s completely normal.",
            "I don't have exact advice for you, but just wanted to say that you've expressed your feelings quite beautifully here.  Your writing is lovely and you seem very self aware. I think the fact that you're asking yourself these questions really shows you know how to maintain healthy relationships and boundaries. I'd go along with the overwhelming advice in this thread to allow a part of your healing to take place within a safe relationship like you have.  A partners love can be healing without being unhealthy.",
            "This is well beyond the ability of a random guy from the Internet to discuss. You need psychotherapy. \n\nThat's not meant as a joke or a put-down, most people would benefit from therapy,  but childhood trauma bleeding into your adult relationship in any form is pretty much the point of therapy. \n\nWhatever you decide i hope it works out for you.",
            "Try looking into the AB/DL community its like softcore BDSM and doesn't always involve sex",
            "I see nothing problematic here. Your boyfriend sounds great, and you enjoying seeing him be great is also great. I'm glad you've found your way into such a healthy environment, and I hope you continue to enjoy the experience.",
            "I had a manager who was like this.  I didn't have a healthy relationship with my father and it was mostly consisted of verbal abuse, beating, and how I was never good enough in comparison to my cousins.\n\nThis manager was older than me but he was very patient and willing to listen to what I had to say.  I couldn't help but thinking \"This is how a father should be\".  Even when he criticised my mistake, I wasn't sad but more disappointed that I didn't do the job correctly.  As a result, I'm more motivated to improve/do it correctly next time.  No beatings, no insult, just kind encouragement and constructive criticism.\n\nI was kind of sad that he wasn't my actual father but took comfort in the knowledge that I had a surrogate father, even for a brief period of time and within the confine of my workplace.",
            "Maybe you want him to be your babys dad",
            "It doesnt have to be weird. You just want and have someone who can give you the love and affection you need and deserve.",
            "I KNOW EXACTLY WHAT YOU MEAN. I'm usually the big spoon so to speak, but there are times when I realize a whole part of being in a relationship that I never realized growing up. there's this feminine/masculine dynamic of protected and protector, that has disgusted me in the past because of my religious background. growing up, people in the church would talk about a man acting as a *steward* over a woman, and how that was the God ordained dynamic of that relationship, and its made me (and a lot of other women) get turned off by that idea of control and ownership.  but i have realized that is a perverted interpretation of a perfectly natural emotion: of loving and trusting someone (man or woman) so much that you believe that they alone can do the right thing for you because they know you so well and they feel a sense of duty to you because of that love. it makes me sad that some men have used this to exploit and demean women and control them. its something that just happens if its supposed to and can't be forced or taught. it has to be earned. I dont know if any of this makes sense, but I feel that same pull, and i think to girls like you and I, who havent really gotten that sense of trust from people in our early lives, its easy to equate it to that parental dynamic, (and sometimes it becomes a sexual thing as well).\n\nall this to say: you're not weird, and many people in this thread have put it perfectly. its good to love a good man, amirite?",
            "You suddenly realised what you had lost and missed out on.\n\nWhat you are experiencing is very much a form of ***grief*** for the family and the childhood you never really had, and the shock of the sudden wave of realisation crashing through your brain like a tsunami.\n\nYou will probably find that once you recognise it and work through it, the feelings will normalise again, but just like grief when you lose a loved one, it still has that very real, very raw, very traumatising effect at the beginning.",
            "Tell him seeing him father his children lovingly helps heal you. That you admire and respect his patience and dedication and look forward to building a life with a man who is so present for you and his kids.",
            "I'd suggest looking into age regression/DDLG as a nonsexual form of therapy, if he's into it of course. Ive heard of people like you who do it just to fulfill the desires you mentioned",
            "From my experience and knowledge, it sounds like you are really tapped into your feminine side and the wounding of your past is all coming together. It sounds like he is really in his masculine and that is leadership in a relationship that you are looking for.",
            "I honestly think you’ve already told him, in essence, what you are expressing here. You long and have longed for parents with qualities you see in him. I don’t think you truly want him to like adopt you and it doesn’t seem like a fetish as you mentioned. It’s probably triggering your trauma a little when you see him be a good parent. Part of that may simply be subtle jealousy mixed in with the bad memories of your childhood.\n\nAnyway, it sounds like you guys are doing well. Communication is number 1 as always.",
            "You sure you're just not into ddlg?",
            "This is really normal I think. I've not had this but I have been envious of my stepson for the way we parent him vs the way I was parented.\n\nI also had never had a healthy romantic relationship until my husband and he cares for me when I need to be cared for and I care for him when he needs to be cared for.\n\nTalk to him. Tell him how amazing he is. Tell him you love watching him be with his kids because he's an amazing parent. Talk about what you never had.\n\nAlso, you probably do need more therapy. Are there any charities which offer therapy? Can you review your finances and see if you can find the money for it?",
            "This is healthy man. I feel warm and safe with my girlfriend, and she does with me. I also feel the same warmth and safety when with my best friends, family, etc, but that warmth and safety isn’t inherently sexual. It’s what love feels like, to me, and it takes different shapes depending on the relationship and what’s expected of that relationship. You deserve that.",
            "There are few things more attractive than a man who is a good parent.",
            "I’m a therapist who specializes in working with people who had sucky childhoods. With my background in trauma and attachment, what you’re saying makes complete sense. \n\nThe relationship dynamic we have with our parents when we are small leaves an imprint on you that is kind of a blueprint/instructions of how loving other people is supposed to be. In healthy families this is awesome. In unhealthy families it can set us up to expect to be treated poorly in future relationships, especially romantic ones. \n\nWhen your unhealthy ‘blueprint’ is challenged by actually being treated well it is called ‘the corrective experience’ because you’re finally able to experience a healthy/correct relationship dynamic. \n\nSeeing him parent his kids the way you should have been parented is like a corrective experience for your inner child, which was very wounded by your upbringing. \n\nYou’re healing on different levels. One of those levels is your inner child. And your partner is providing that corrective experience to your inner child makes it completely logical for him to feel fatherly to you on a deep level. \n\nChildhood trauma work is super weird and evokes all sorts of deep/primal feelings and reactions in us. \n\nAnd that’s okay. \n\nIf you feel the need to express this feeling to him you could probably say that seeing him raise his kids is healing to your inner child and makes you feel safe and loved on a deep and important level. I suspect that’s true and feels like a way less weird way to explain it for everyone involved. \n\nI send you internet hugs. This kind of healing is no joke and you’re doing great.",
            "I don't think you want your boyfriend to be your dad, I think you want permission for your idea of a loving relationship with a man to expand to include the kind of selfless care that this good man shows to the people he cares about. You deserved to be loved like that, and that is the standard of love you should expect and return. Whether things work out with this guy or not, this is now your standard for family and that's great.",
            "You can admire his parenting style as one you wish would have been part of your experience.\n\nYou can love this person as your romantic partner.\n\n\nThere are traits associated to both of the above that overlap.   The tricky bit is when you confuse the above.   A romantic partner is someone you want to share a life with as an equal.   The fantasy of this guy being your dad kindof undermines that ideal.   \n\nI’m sorry you had a bad childhood.   I hope you have a good future.  Sounds like this guy is one who would make that a possibility.   Don’t engineer a situation to sabotage it by enabling this fantasy.   Acknowledge he’s a good dad, but focus on why he stimulates you as a partner.   Inspire yourself to stimulate him in turn (I don’t mean stimulate as a sexual term).    The way you are thinking isn’t wrong and I commend you for realizing there are perspectives where it’s not as innocent as you believe it is.   \n\nCommunication with your partner is a wonderful thing.",
            "YOU ARE OKAY <3 Keep on living your life and don't question your feelings they are normal and healthy. \nJust chill you need to just look at it for what it is.  Love.  Don't look at it like u want him to be your dad but rather you protector. Your Man. You habe finaly found a good one. Don't freak out like my Mrs did :( \nIf he read this I think he would cry and give you a hug.. He sounds like a good man. \nBless you communication is great but some things are best left unsaid!!! \nYou are so lucky to be loved and you have found a good man. Hold onto him sweetheart and delete this post because everything is okay people are just nasty and have no life experiences. You cant get them from a fuckin pHD or a text book. How you are feeling is normal given the hand you were dealt. Just do and be good and good will come!",
            "Ddlg isn't always sexual. Perhaps look up clg- a caregiver dynamic.",
            "Sounds like a modern love episode I recently watched 🤷🏽‍♀️",
            "I feel the same way towards my boyfriend and I also had an abusive upbringing. He is so loving to his nephews and nieces and such a sweet dad to our little cat. Even when he gets annoyed at her and had to train/discipline her it is only ever things I find funny and fair, he is never hurtful in any way. The \"take under his wing\" comment makes a lot of sense and I'm sure he'll understand if you explain it like that.",
            "I believe in communication in relationships too and from how you describe your boyfriend, I'm sure he will understand. He sounds like a great guy. Just talk to him about it, also fuck the therapist. Just talk to your man freely and I'm sure you guys we be a great couple",
            "One of the greatest revelations I had as a parent, falling in love with my first born child and letting that love blossom throughout the years, is that love is love is love is love.",
            "FYI this is covered by DDLG, there’s an entire community that is on it for reasons similar to this. Fetishs develop from anywhere.. I like that OP recognizes that this isn’t a fetish-denial thing. It isn’t, because it’s not a sexual thing. Purely relationship-al. \nIMO, obviously. I’m no expert. But my gut reaction was expecting this form of response from the title. You don’t wanna date your daddy, you might have some wiring crossed in your understanding of what a healthy relationship is, but the important thing here is the reason you love him. Outside of the kids. He’s a good person that has a lot of qualities more so then just how he is to them, roles outside of his role as a father that you admire. Right? Focus there is my gut feeling the one for all the money.",
            "I can't offer advice. But I can offer solidarity - I have a similar experience. I was abused by my mother... when I met my SO's family, I was so surprised and amazed by the maternal love I saw. Yes, I'd heard about it - I knew what constituted a 'loving' relationship like that, but it is so different seeing it with your own eyes. Seeing people who genuinely love each other and would go out of their way to help each other - I have been moved to tears by the inclusion I have felt from my SO's family. They have just radiated love because it's what they do, and I've soaked it up and have never felt guilty about it because honestly it's allowed me to recognize I am deserving of that kind of maternal love.",
            "I think your feelings are really normal in your situation. To see a person nurturing, supporting, and loving their kids instead of abusing them is really jarring. It feels really unfair.\n\nMy husband (and I) don't have kids, but I get really jealous and hurt sometimes when I see how his parents treat him. But then, he reminds me: I have that now too. His parents love and support me, too. His family belongs to me now too.\n\nWe've been together for almost 10 years and I still am not always good at accepting that they love me, or that they are not secretly toxic people, but I keep working at it.\n\nBask in the love of your boyfriend. His unconditional love isn't only for his children...I bet some of it is yours too.",
            "IMO: Don’t talk to him about it. Just revel in the feelings of love, admiration, and feeling moved by his parenting. This is just something that’s making you love him more. Go with it.",
            "Hey ik you said this isnt the ddlg/ daddy kink thing but it kind of seems like this is what you want, not all daddy/little relationships are sexual, it sounds to me like you want some one to take care of you the way a parent would and that's exactly what a daddy/little relationship is like.... And i mean there's no rules to what it hast to be like a big part of thoes kink relationships is the people involved get to decide what they want from it. All im saying is i think it's worth a try and not to shut that option out.",
            "The problem here is that you're an adult, not a child. He has different expectations of you and probably wouldnt like the idea of needing to care for you in that way but also it edges in on the amount of energy he can focus on his kids. He might even be hoping if things are working out, you would want to help care for his children, but instead he will be shocked if you want less of the parenting role and more the needy child. I'm sure he would understand but inside there is conflict. Why is the current position not enough? Usually women feel the same security as the children do in a household with a strong male figure whether it be a father, a husband, a brother, or a son, they have the same effect. I would think he actually does care for you the same way but it's going to show differently because he treats you like an adult and doesn't want to treat you like he treats his kids.",
            "I have this feeling when I hang out with people who have nicer parents than mine, usually the parents of someone I am dating. I want to spend time with their parents because I never had that. It makes me a little sad sometimes, though. Like how different would my life have been had I had better parenting. So it may be sort of the same thing as you see it in your partner instead.",
            "I completely understand where you're coming from and the number of upvotes you got just proves how many people able to sympathize and understand what you are talking about.\n\nI'm with my fiancee who comes from a completely normal family, was brought up to be an all-round excellent person and my life with him for the past 4+ years has been a lot like what you said in your post. I feel so grateful to experience normalcy, emotional stability and proper everyday reasoning and so in my thirties I've learnt life skills for which there used to be a huge gap.",
            "He sounds like a great person. Its okay to want your partner to give you care and comfort in a non sexual way. I didn't have the greatest family growing up. My boyfriend gives me some really sweet things that I've been missing out on, stuff that is just for comfort and not sexual. He bundles me up in blankets when im having a rough day, makes me cute breakfasts, encourages me in school, gets me treats like ice cream. It's not weird to enjoy a partner to give you more care and comfort, and totally understandable that your feeling this way considering everything you've been through.\n\nThat being said, I don't know if I'd phase it as wanting him to be your dad, but more just, wanting him to give you comfort and care.",
            "Your boyfriend sounds like an amazing guy. Wife him up quick."
        ]
    },
    {
        "post_id": "2p3ih6",
        "author": "numbthrowaway12",
        "title": "[Update] Single father [38M] with my daughter [17F], discovered she has a large amount of cash and I'm suspicious.",
        "url": "https://www.reddit.com/r/relationships/comments/2p3ih6/update_single_father_38m_with_my_daughter_17f/",
        "score": 4930,
        "num_comments": 306,
        "created_utc": 1418407154.0,
        "selftext": "I was signed into this account on my laptop and noticed I received PMs asking for an update to my [post](https://ud.reddit.com/r/relationships/comments/2or7bz/single_father_38m_with_daughter_17f_discovered/). So, here it is. \n\nI had a long talk with my daughter Sarah that night. I sat her down and described the circumstances of the discovery. I explained that I was worried because it's a large sum of money and I didn't want her savings to be stolen. \n\nWell, turns out the elderly neighbor, Anne, has been giving her cash for the better part of a year now. Anne wanted her to have the money to help with college expenses, and told Sarah to keep it a secret from me because I've always refused to accept money from her. Sarah also told me that part of the money was her own. She had been saving up for my birthday present and didn't want to put it in the savings account because, well, she'd have to ask me and it wouldn't be a surprise anymore. \n\nLater in the conversation, I brought up the expensive clothing. Those were throwaways from her friend's mother. Her friend is really tall so she couldn't wear them and gave them to Sarah instead. They needed some slight alterations so she hasn't worn them yet. I apologized for snooping and explained that as a father, I was obviously concerned for her well-being. I also assured her that we are financially stable and that I've put aside enough money for her college expenses. I told her to keep an eye out for Anne, to make sure that her welfare is not affected by the money she's paying Sarah. Also, I asked her to write a thank-you card to her friend's mom and to include a present for her at Christmas this year.  \n\nAfter the revelations, I wanted to reward her for her savings habit, so I offered to start a checking account for her and we looked into the options online. Turns out, the bank I use offers a junior checking which I can co-sign (overdraft fees, etc) for her. It turns into her own personal account at 18. She'll have the use of a debit card, the bank also offers an online-based financial planning guide, so she will read that before starting the account. We're going to the local branch to set that up for her this weekend.\n\nSarah seemed to reflect well to our talk. She took the opportunity to reveal that she has been in a relationship for a couple of months. I've actually met her girlfriend a few times before, they go to the same school and I just thought they were good friends so that was a surprise. So yes, she came out of the closet to me. \n\nBeing a dad, I still verified the clothing story with her friend's mom. Overall, I'm happy it was just me dramatically overreacting. However, I do feel rather guilty for the minor panic attack I had. As a parent, it's astonishing sometimes how quickly your child grows up. Just another part of the learning process I guess. \n\nP/S: I didn't reduce her allowance but did encourage her to keep saving because it's an excellent habit. \n\n---   \n**tl;dr**: Money from neighbor, clothes from friend's mom, so she's getting her own checking account. She also disclosed she's in a relationship. Worst of all, my tortured soul is left wondering what she's buying for my birthday.\n",
        "permalink": "/r/relationships/comments/2p3ih6/update_single_father_38m_with_my_daughter_17f/",
        "comments": [
            "You're an awesome dad and Sarah is an awesome person. Happy everything turned out to be ok!",
            "[deleted]",
            ">So yes, she came out of the closet to me.\n\nBe thankful that she felt comfortable enough to tell you this. That speaks volumes to your relationship with her. Glad things turned out well. ",
            "YAY! I knew it would all come out in the wash. You handled that awesomely, OP, and I hope I do the same when/if I'm a mom.\n\nAlso, the whole revealing her orientation bit? Yeah, that wouldn't have happened if you'd gone charging in, all a flutter and ready to accuse of wrongdoing. So extra kudos to you for illustrating how calm and reasoned conversation reaps great benefits! :)",
            ">However, I do feel rather guilty for the minor panic attack I had. As a parent, it's astonishing sometimes how quickly your child grows up. Just another part of the learning process I guess.\n\nNever feel bad for caring for your daughter's well being.  You handled everything extremely well, and that's supported by your daughter trusting you enough to come out to you.\n\nTake care.",
            "You're an amazing dad or in general an amazing parent. Once you said you lived in a big city I figured those clothes had to be second hand. Also I was basically a lot like your daughter. Everyone thought of me as the house bank because I always had a great deal of money socked away.",
            "[deleted]",
            "The minuscule amount the daughter's sexuality plays into this post is the correct amount.",
            "> I do feel rather guilty for the minor panic attack I had.\n\nDon't feel guilty, because your daughter didn't ever see that. All she saw was a Dad who loved and trusted her. She saw this so well she trusted you enough to come out to you. \n\nI have had plenty of friends whose parents would have immediately flipped out at them. You took a step back, calmed down, and thought about it. You approached her in a  calm manner, focused on helping her. \n\nPanic is a natural response, its what you do after the panic that really matters, and you did the right thing. \n\n",
            "I'll say what we're all thinking: thank god she wasnt selling her body.",
            "This is literally the best outcome you could've gotten. \n\nNot only is she an excellent saver (is she offering lessons because I'm the worst saver ever) but she also ended up trusting you enough to reveal her sexuality. \n\nCongrats!",
            "Thank you for taking the time to update us I was really looking forward to it. So glad it turned out this way. Congrats on your responsible daughter! ",
            "I'm glad to hear it's a happy update! ",
            "This was one of the sweetest and most adorable stories ive read on Reddit. ",
            "You guys sound like you have a great relationship and are lucky to have each other :) ",
            "Congrats on being a fucking champion Father and raising your daughter right. I'm not a parent yet but I aspire to be on the level you are. You handled this with class and that is reflected in your daughter's actions; you should be super proud of both yourself and your daughter. ",
            "This made me want to cry. The throwaway bit about \"nbd, she's gay\" really got to me. You're a fantastic father.",
            "I love that her sexuality was the smallest of details. You're a kickass dad",
            "thanks for sharing and updating! you are a legend.",
            "I bought my first car when I was 16 for about $7,000 with babysitting money I saved up. Your daughter is on the right track towards being a financially responsible person. Kudos to you both!",
            "10/10 would read and then smile again",
            "I remember commenting on the previous post, and I remember thinking \"maybe the elderly lady is paying her and she doesn't want you to know because you wouldn't let her keep it\".  You've done a fantastic job as a father.  I'm a single father of a 5 year old girl now, and my goal it to become half of a decent father as you.",
            "Whew! Fantastic! I hoping for a good ending to your issue and there we have it! \n\nThanks for updating. btw - you sir, are a good Dad.\n\n\n*Nana internet hug*",
            "Wow that is the absolute best conclusion to this mystery. Congrats on raising a good person OP",
            "What a good daughter. It's so nice to get a positive update about a teenager!",
            "[removed]",
            "That was like the greatest episode of \"So You Think You Can Dad\". Honestly loved reading this story. Thank you for sharing and thanks for being such an understanding and loving father! Hope to be one like you one day.",
            "Thank you for the update! I'm glad this turned out to be the best case scenario,  since I'm pretty sure most of us thought it could have been way worse than \"lesbian daughter gets dresses from friends and money from neighbor. \"",
            "I laughed out loud with happiness after reading this update.\n\nYou seem to be doing a fantastic job at raising an awesome woman.  I was joyed to see how well both of you handled this situation from each others' ends.\n\nIt seems that a bunch of major things seemed to happen in an almost regular fashion which speaks to how strong and healthy your parent-child relationship is.\n\nAs a new-ish parent, I hope to work towards the same kind of quality.\n\nKudos and good luck to you both.",
            "This couldn't have ended better.",
            "You seen like a great Dad. That was really well handled. ",
            "You responded the way any parent who actually gives two shits about their kids would. You handled this incredibly well. Teenagers know their parents will go through their stuff sometimes, so it's great you apologized to her for it, but you shouldn't feel bad. You're her dad. It's not like you're controlling every aspect of their lives but if you don't find these things in the hiding places, you lose the chance to help them if you find something concerning. \n\nYour daughter sounds very level headed, I think it's great that you've actually extended some more responsibility to her rather than punishing her or being more strict. \n\nYou should invite her girlfriend around some time. Foster this relationship with your daughter, let her know that you don't care who she likes. Maybe make dinner or something. \n\nSeriously, well done. ",
            "All in all, this is a great resolution.  Nothing bad was happening, you and your daughter have talked about things you previously hadn't been, and you've built a stronger bond.",
            "damn. that was a pretty crazy plot twist. ",
            "I love Sarah!! Give her internet hugs from me. You have raised a very strong young woman :)",
            "I'm very happy you updated this. \n\nYou seem like a good dad, and good parents usually raise good kids. ",
            "Your daughter is lucky to have such a great dad and you are lucky to have such an awesome daughter.  Good luck to you both!\n",
            "Gold for being an amazing single father.",
            "You're such a great dad. Your daughter is going to be a-okay. Her habits of saving are really remarkable too, especially for a teenager. And it's awesome she was so comfortable with you to come out to you in such a matter of fact way; it speaks volumes of your trusting, open relationship.\n\nYou did good, pops! :) ",
            "Good on you OP!  Sounds like you have a pretty close to perfect relationship with your daughter, and you both seem like lovely people. ",
            "I dont know if I buy the whole elderly neighbor is giving me a pile of cash story.\n\nBut thats probably my jealousy at getting off brand old candy instead of money from old people...  ",
            "This is a wonderful update, I'm so glad to hear. Keep being a kickass and supportive dad - you have a great relationship with your daughter and she's very lucky. ",
            "You're a great dad and you have an awesome daughter!\n\nYou need to run seminars.",
            "You are an amazing father. Reading the short things you've said says a whole lot more than what was actually said. ",
            "I'm glad to read a happy update on your situation.\n",
            "I wish i could save some bucks when i was 17. For some reason I had to spend it for expensive shoes and musical instruments",
            "This is my favorite update. You guys are a great team. ",
            "We'll need an update on the birthday prezzie.  ",
            "You're a wonderful father, and you've raised a great daughter. I wish your family all the best in the future!",
            "That's awesome man. I wish all parents followed your role. Your daughter seems extremely smart. It really sounds like you 2 have an awesome trust filled relationship.",
            "Well goddamn that ended about as well as possible. You got a smart one there. ",
            "Damn you are a good Dad.",
            "Thank you for updating! I've never needed an update like I did for your story. So I'm not gonna lie, I was convinced your daughter was involved in something illegal and dangerous. I am so glad that I was wrong. And I am amazed by how responsible this girl is. No doubt she had a fantastic role model. Keep up the A+ parenting!",
            "This is what I had figured.  Elderly people just love giving money to the young on the sly.  I'm very glad you got to have a heart to heart talk with your daughter and that she felt comfortable enough to come out to you as well.  ",
            "Yes!! This is a great update, OP!! Finally, someone who knows how to handle their kid. ",
            "Wow, talk about a good result to what could have been a bad situation.",
            "Great results on all accounts.  Kudos to you and your daughter.",
            "You sound like an awesome dad. Good on you. ",
            "I hate you and your awesome daughter. Good for you and I hope you continued to be tortured by your birthday gift. ",
            "You sound like a really good dad :)",
            "Wow OP, sound slike an excellent relationship with your daughter! I'm very happy for you guys!",
            "beautiful update",
            "This is wonderful! You have a great kid and you're a great dad. ",
            "You're a good guy, OP, and I'm glad things turned out well in the end.",
            "Aww I love happy updates, especially since your situation was quite alarming!",
            "I'm so glad that everything turned out alright, and your daughter was being even more responsible than you thought. Congrats on being an awesome dad. ",
            "Woohoo! Awesome!! Great job, OP. ",
            "This is the best outcome.\n\nGood luck to you two!\n\n",
            "This is fantastic news! You sound like an excellent father and your daughter sounds like she has a GREAT head on her shoulders.\n\nWish you all the best!",
            "What a great ending.  This actually made me teary.  As a parent (of 5 teenagers) I tend to jump to bad conclusions in my head too sometimes.  It's always refreshing when I learn that my fears were unwarranted. As a friend told me just the other day \"Good parents make good kids\"..and it looks like you are a good parent.  :)",
            "You are raising a good girl. You're a great dad it seems.  I'm so happy for you.\n\nAnd I'm giving my husband the same torture for Christmas. It will pass. (but I bet your daughter in relishing your misery as much as I'm relishing my husband's misery. Muahaha!!!)",
            "Wow, what an outcome! You dhould be so very proud of yourself - proud for how you handled this discovery, her coming out but most of all for raising a level-headed, caring daughter.",
            "Dude you da man",
            "I'm so happy it all worked out so well for you and your daughter. Its just scary imagining what it is like to be in your shoes when I'm just barely 21 and 1 month into my first real \"job\". ",
            "This was the best possible ending. Excellent!",
            "Yaaaaaaaaaaay! ",
            "Sounds like your daughter is pretty awesome and your neighbor knows it. ",
            "Way to go, dad!",
            "You are a great parent. This make me so happy to read. :)",
            "niceeeee",
            "Your daughter has a great head on her shoulders. She saved money, wanted to get you a present, is happy to take hand-downs without whining they're not brand new, and felt comfortable with you to come out. You've got a great daughter and I'm sure she'll really enjoy having her money safe but still in her control.\n\nWell done for being open, talking to her in a way she could respond and not feel in trouble, and fostering a comfortable situation in which she could come out. You guys sound pretty awesome.",
            "You sir, are an awesome dad! From one father to another, I congratulate you on having raised such an awesome kid. From what I've read, your daughter has a bright future ahead of her and I hope she appreciates the lessons you have taught her, and from the sound of things, she does. \n\nKeep it up. I know I have a hard time allowing my son to do his own thing sometimes, but you seem to have found the perfect balance of parenting and being open with your daughter.\n\n",
            "Very good update. I may even recommend setting up a student credit card with her. Use it as a learning tool, and how never to carry a balance on it. I view all my credit cards as access to my savings account vs additional beyond what is in savings. I feel many people should have learned this when younger. ",
            "This is great. Sounds like you've raised a fine young lady.\n\nKudos for being an awesome dad :)",
            "Sounds like you did good!",
            "My dad gave my sister, brother, and I all a debit card when we turned 12. It was great help having one because whenever I needed something I didn't have to go home and get cash or something. I could just call my dad and tell him. Glad it all worked out though! ",
            "one of the better follow up posts here.  I'm sure you're a happy father at this point.  Kudos to you and your daughter",
            "You're a great father and I'm sure Sarah is going to grow up to be a fantastic and responsible adult. Luck to both of you! ",
            "Ha, I'm so glad I was rooting for her in the other thread. I can't believe how many people thought she was a hooker with a sugar daddy or a drug problem. Ridiculous. \n\nCongrats OP, your relationship with your daughter sounds great. \n",
            "Just wanted to ley you know that this is the most inspiring parenting I have ever seen on this sub and congratulate you fkr being an excellent father. Stay excellent dude!",
            "this is such a nice story I'm wondering if it's real!  I thought for sure she had to be dealing drugs.  Wow. I'm a jerk!",
            "WHOA!\n\nIs all I have to say. Sounds like you two have a good relationship together and she obviously trusts you.",
            "As a father this is the best outcome to this situation. I am so happy  for you OP. Keep doing your job. ",
            "This is one of the best outcomes I've ever read on this sub. If you see this comment, take it as the biggest compliment an internet stranger can send your way. You did a great job, you seem like a great father!",
            "awesome update!",
            "shameless plug for Simple. Instant transfers between customers and instant processing of all square cash transfers (other plug). \n\nplus their customer service is awesome. ",
            "I think you handled this really, really well. ",
            "her girlfriend? she is a lesbian? ",
            "Super glad this turned out well. Sounds like it may have even brought you and your daughter closer together. Plus, you don't have to worry about pregnancy anymore probably!",
            "Don't feel bad. 9 out of 10 times it's bad news. Sounds like you have a great daughter that you should be very proud of.",
            "[deleted]",
            "You sound like an awesome dad that's raised an another awesome person. ",
            "You sound like you handled this perfectly. I could only hope to be as cool, calm and collected as you.",
            "In the immortal words of Ronald Reagan .... Trust but verify..... Trust but verify.....",
            "Man I wish I could get myself to save money like that..\n\n*takes bite out of big mac*\n\n*sips soda*",
            "You're an amazing dad!",
            "Bravo sir! You sound like you are doing an excellent job raising her.",
            "i wish my parents were half as awesome as you\n\ncongrats on being a great father",
            "I wish my parents were like you.",
            "thats such a nice end to the story \"Worst of all, my tortured soul is left wondering what shes buying for my birthday\"\n\nWell, least she isnt a crack dealer...",
            "Man, you're a really good father. \n\nThe way how you handled things reminds me of my own dad :) ",
            "You sound like an awesome father.  :-)",
            "OP you are doing fabulously, this was handled so well, its almost textbook",
            "Appy everything worked out :) another plus is that xou don't have to worry about her getting pregnant! ;-) ",
            "What a wonderful father/daughter relationship. Beautiful!",
            "Well done!",
            "So basically, my original response to your original post was correct, you're welcome. Seriously glad it all worked out for the best :)",
            "[removed]",
            "[removed]"
        ]
    }
]