[
    {
        "post_id": "566iga",
        "author": "Tristine8",
        "title": "I [74F] haven't spoken to my children in 20 years. I'm dying now.",
        "url": "https://www.reddit.com/r/relationships/comments/566iga/i_74f_havent_spoken_to_my_children_in_20_years_im/",
        "score": 4811,
        "num_comments": 438,
        "created_utc": 1475774361.0,
        "selftext": "I realize I'm older than most here, if not all of you. But internet has been my best friend in old age and I frequent this subreddit regularly. \n\nI have two sons and a daughter (51, 50 and 44). I haven't talked to my sons in about 25 years and my daughter in 20 years. They chose to cut me off permanently and I respected their decision. With my history of mental illness they had every right to do that. I had problems with narcissistic personality disorder and anger which took many decades for me to overcome and I'm still fighting my demons to this day.\n\nI'm living the final months of my life. I have terminal cancer and will soon be gone from this world. I promised them to respect their wishes and I have for 25 years but deep in my heart I do wish to see them again, maybe to apologize for one last time before I'm gone. I don't know if I am being selfish as I can also apologize in my will. I want to do what is best for them. Will they be interested in seeing me before I die? There are considerable assets that I have which I am leaving all of it to them so they will hear about my death. \n\nIf you can provide some advice about my situation I will be grateful. You're all closer to my children or grandchildren's age and can see things from their eyes better than I can.\n\n\n  ---   \n  **tl;dr**: I'm dying and have not spoken to my children in 25 years per their request. I am not sure if I should let them know that I'm dying.\n\n---\n\nI never expected so much advice and love from you. I thank you all and I'm reading everything to come to my final decision. ",
        "permalink": "/r/relationships/comments/566iga/i_74f_havent_spoken_to_my_children_in_20_years_im/",
        "comments": [
            "I will start by saying: For children to cut off a parent, that parent has to have done something that really, really upsetting, something so hurtful, so unforgivable. And for them to maintain that silence for 25 years reinforces just how bad it must have been. So, whatever happens between now and your death, or between now and them hearing from the executors of your will, you need to accept that they may never forgive you, in this world or the next.\n\n\nThat out of the way:  Write a letter to each of them. Apologise. Tell them you love them. Ask for forgiveness. Explain what you have done in those 25 years to try to become a better person. Apologise again. Maybe ask for one last meeting or some photos or a letter in return.\n\nBut do not make excuses for whatever you did, because that will immediately put them off you forever - whatever you did to make kids abandon you for 25 years, my guess is that it is inexcusable. \n\nAnd don't wag a will at them. Any bequest should be a surprise and a bonus. If you mention it now *even if the intention is to demonstrate your contrition*, it will look to them as if  you are trying to buy their love back.\n\nGood luck. \n\nAnd if they don't reply you must respect that and leave them alone their new lives, without re-opening old wounds. Maybe just a quick call from the nurse as you are sinking.",
            "[deleted]",
            "OK so my aunt died last year.  She was estranged from her kids for 25 years because she was an alcoholic and put them in a lot of dangerous positions.  Her boyfriend was her health care proxy and he told no one she was in the hospital until she died (cirrhosis and pancreatitis).  When we told her daughters, they both said they would have gone to see her in the hospital.  I would at the very least let them know, write them a letter or something. ",
            "[deleted]",
            "I'm 42.  The last time I saw my dad I was 15.  Over the years he tried to contact me via my mom a couple times.  I never contacted him back.  I felt no need to have him back in my life.\n\n2 years ago, while I was traveling, I got an email from his brother.  My dad had been diagnosed with stage 4 lung cancer and given 3 months to live.  I was returning to the US in a month and his brother told me that my dad realized that he'd been a shitty parent had had no right to expect anything from me but that he'd like to see me and apologize before he died.  His brother asked me to consider visiting my dad when I returned to the country.\n\nI'll be honest, it was a shock.  And I struggled a bit with the decision.  For all intents and purposes, my dad had been dead for decades.  So hearing from him out of the blue was a bit of a shock.  I told my uncle that I would think about it and get back to him in a day or two.  I talked to my mom and some friends and ultimately, I decided to see him.  Not really for me, I was kind of ambivalent about it.  But I felt that if it would give him some peace at the end to apologize, I would do that.\n\nI sent an email to my uncle the next day.  He received it about 3 hours after my dad died.\n\nI don't really regret not seeing him.  I wasn't doing it for me.  The only thing I regret is that he died before finding out that I'd agreed to see him so he didn't get that peace.\n\nSo, take that for what you will.  If you have an intermediary that won't harass them, perhaps ask them to make contact on your behalf.  Just tell them that you'll be gone soon and you'd like the chance to apologize.  Let them know that you know you fucked up so you accept and respect their decision if they don't want to see you.  And make sure whoever is contacting them doesn't pressure them at all.  Then let them make their decisions.  If they don't want to see you, respect that.  Then write them your letters and leave them with your estate to be delivered upon your death.",
            "A letter is good because it gives them options. It can be read, left unread, or thrown away. If it is read, the reader can decide, in privacy, whether to do something in response. In a situation like this, it is the most respectful way to reach out, and I think it is acceptable given your terminal condition and the possibility that an apology and the chance for a last visit or call may be of benefit to one or more of them.  ",
            "Ma'am, I am sorry for the pain you have experienced in your life, and I hope your passing is as painless and as peaceful as possible. I myself am not religious, but if you are, I hope the other side is as wonderful as they say it is.\n\nAs for your children, would you consider video taping an apology/goodbye message to be played for them by your lawyer when they are asked to the reading of your will? That way, you can say what you want to say without breaking the No Contact they asked for in life. ",
            "I think you should be clear that you are apologizing and not asking for forgiveness. \nI think there is a distinct difference between the two. \n\nLay it all out there, speak your bit and face the notion that they may not respond. \nThis might not end up with the resolution you wish. \nBut I do think they deserve to know about your health. \n\nI had an estranged Grandmother. All of us put up with her awful shit for years. Narcissistic  verbally abusive, lying...never took any blame for her actions.\n\nHad she actually aplogized and taken the blame for her actions without demanding anything...I would have been stunned and willing to speak with her. \nThat never happened. She went to her grave being an awful person. \n\nOP, I commend you for taking responsibility. \nI'm sorry about your illness. I hope you find a peaceful end. ",
            "> maybe to apologize for one last time before I'm gone.\n\nwill it be sincere?  From your heart, with no expectations of forgiveness or even answer?  An apology that indicates that you *actually* understand what you did wrong and why they don't speak to you?\n\nIf not, if this is you gratifying yourself, then don't bother.\n\nI think letting them know is fine, IF:  you do it through someone else, and place no pressure on them.  For example, if there is a relative that you know they still speak to or a family friend, just pass on the news of your diagnosis.  Then leave it up to them.\n\nQuite frankly, we (I) don't trust deathbed reconciliation, confessions, or apologies.  too often I've seen them used as one final, manipulative jab at the 'disobedient' child.  The ultimate version of punching someone, then running away so they can't hit back.  At best, they tend to turn into one last chance for a lecture from someone who never really understood the problem in the first place.\n\nSo:  go ahead and give them the information, but don't expect anything, and don't be surprised if they choose to do nothing with it.  Don't use this as a reason to push for anything.  If there's not anyone who you can go through, OR if the person who still talks to them would pressure them into reaching out, don't.  The only way this works is if there's no pressure AT ALL.",
            "I have cut off contact with my own mother for many of the same reasons that you provide here. Like many here, your post strikes a chord with me as I face the possibility of my mother passing away. \n\nI don’t know the details of your situation, but for me, a situation that uses illness or impending doom to manipulate me and create a need for contact is something I have dealt with before. Also apologies. Like many who have already responded, this history would make it difficult for me to receive a “end of life, clear my conscience” letter from my mother without feeling manipulated, confused, sad, angry, etc.\n\nSo, here’s my honest opinion. If there is some value to you in a last-effort to reach out, apologize, and potentially connect, do it. At this point, you cannot control how they react. You’re doing it for yourself. Acknowledge that.\n\n1.\tDon’t pressure or beg them to see you/contact you. Put the situation out there without expectations or emotional strings and let them do what they want to do. I.e., “I have received X diagnosis and am told that I have about 3 months left. In the time that I do have, I want to express to you that I take full responsibility for the many mistakes I have made as a parent and apologize for the negative impact my choices have had on your life. These things weigh heavily on me as I look back at my life and I do not want to go without extending to you a final, sincere apology for the things that I have done which have caused you physical and emotional harm.”\n\n2.\tPersonally, I wouldn’t belabor individual points, apologize for specific actions while leaving out others, or get into justifications, ways you’ve tried to make up for it, etc. I’m not saying those things aren’t true or part of your own story of how you deal with your choices/life, I’m saying that I feel sometimes that “package” can be so emotionally burdensome that it defeats itself.\n\n3.\tI would not discuss what property you are leaving them. They’re going to find out once you’re gone and it comes to them. If you include that discussion, it will feel like (and be) an emotionally manipulative strategy to get what you want from them and it will likely taint the gesture that you are making by leaving them your property.\n\n4.\tPersonally, I hate the “I’m so proud of who you’ve become, I will always love you more deeply than you can ever imagine, you were always such a wonderful child” shtick, but, I mean, only you know if you’ve overused that in the past. If you feel like you really want to say something like that, keep it to your feelings. “I want you to know that I love you.” Not “You will never understand how much I care for you.” Not “No matter if you ever speak to me again, I will still love you deeply.” Just own your own feelings & let them have theirs!\n\nThey are adults & probably not totally dumb, so they will realize that this is their final opportunity to connect, forgive, or receive some kind of closure. If they want that, they’ll be able to figure it out.\n\n\nLast, but not least, I know it’s probably tough, but with this gesture, let it go. Grant them the autonomy to make their own decisions, respect where they are, & know that you did what you could to clear your conscience by offering a final, sincere, no-strings-attached apology. That is all you can do at this point to make amends, probably. \nFill your remaining days with meaningful things that don’t involve your kids. I have a lot of complex emotions when it comes to my mother, but I would want her last days, with or without me, to be filled with clarity and peace. I would want her to do things that bring her joy and to find ways to fill her life with beauty, even if I don’t necessarily want to be part of that. \n",
            "Irrespective of what has happened in the past, I would want to know if my mum was dying.  I'd make my decision from there.\n\nI would write them a letter.  Tell them how you feel, the progress you feel you made and the struggles you still have.  Explain the situation and say you don't expect them to want to visit, but you would love to see them.\n\n1 letter each.  You can respect their wishes beyond that, but give them the choice of how they deal with the situation.",
            "I'm 44 and have been NC with my parents for years. When I found out my father died last year, I didn't care. Even if he had written a genuine letter of apology, I still wouldn't have seen him because I didn't just close doors, I welded them shut. I cannot, mentally, revisit some paths, I just can't. Write letters if you like, but be prepared to get nothing back. Children of abuse just can't go back sometimes.",
            "First off, I'm sorry you're terminal, I hope your end is quick and not painful. \n\nI haven't spoken to my own mother in ages, for the same reasons you state above. I'd rather not heat from her again. However I would make an exception if she reached out to say that she is dying. This I would want to know and hear from her, not a go between. I wouldn't let her back into my life necessarily, but I'd offer some words of support and hopefully hear an apology. Email them, let them know, and take their cue, let them make contact after that.\n\n",
            "Many people here have said not to ask your kids for forgiveness. That's right on. You have no right to ask them for anything. But if you are offering something (an apology), maybe write them a letter. I was raised by toxic parents, and for years I longed for an apology. Some acknowledgment that how they treated me was wrong and I didn't deserve it. That may give them some peace. ",
            "One day my mom will be in your position and posting this question.\n\n\nAll I can think of, imagining this scenario, is why in gods name would you wait until now to apologize?",
            "I am currently estranged from my mother so I think I may be able to help you.\n\nThis is gonna hurt - but don't contact them. If you can have a family member who you can trust to not guilt them let them know of your condition and then wait. If they want to approach you they will. \n\nBut \" imma die so talk to me\" is probably how any attempt at contact will sound . If you want to safeguard a way to say good bye I'd recommend a handwritten letter (if you can) or a video. \n\nAnd when you apologize remember - you need to be sorry for the actions that drove them away. Not that they left. Leave any phrase like \" I'm sorry if I hurt you/ I'm sorry you feel this way/ I'm sorry I wasn't good enough\" at the door. They don't accept responsibility or the gravity of the role you play in their relationship.  And then you have to actually own what they are upset about.\n\nOther than that you just have to prepare for them to not respond.",
            "I'm 39. I recently disowned my mother. The conversation that led to this action was enlightening to me. I've struggled with crippling depression, suicidal tendencies, eating disorders, and PTSD. I thought that my struggle had begun roughly at puberty, but I found out that she'd thought I was depressed as a young child. She never did anything about it. When I had an eating disorder for three and a half years, she never did anything about it. \n\nExcept tease me. Make snide comments.\n\nWhen I came out to her as bi, her immediate, knee-jerk reaction was, \"How can you be in a monogamous relationship if you're attracted to other people?\" \n\nI'd been married for 16 years. \n\nI never came out to her as poly- my sisters did that for me.\n\nShe's hurt my children similarly. \n\nOur last interaction, the one that made me cut her out, she involved my children. She didn't respect me, my wishes, my children, or my spouse. \n\nYet, I'm the one in the wrong, according to her and my youngest sibling.\n\nWhile I have a lot of hurt and rage still, I hope that if she ever sent me a letter of apology I'd at least consider a reconciliation. Were she on her deathbed, I'd probably give it a bit more consideration. \n\nI am only human, however, and I don't know if 30+ years of neglect, abuse, and patent disappointment in me could be forgiven without therapy (with her, as well as private) and some sort of action that would engender trust from me to her.\n\nI truly hope that your children will respond to you, if you choose to act, but I also really wanted to give you perspective from the other side.   ",
            "Reaching out is fine, but do it in a way where they don't feel forced to respond (letter).  You can choose to reach out, and they can choose to either reach back or ignore.",
            "Here's my perspective - as a child who cut off my parents in my 20s.\n\nWho is your current family?  Who have you surrounded yourself with to be your support network?  \n\nWhen I cut my family out of my life, I accepted that I needed a different support network and I built one out of friends that I trusted and respected.   I now have a large happy healthy thriving network of people that I can rely on.  Who do you have?\n\nIf that answer is no-one, you may not have done enough work on yourself.  \n\nBecause your kids are just an accident of your gene pool.  They didn't choose which sperm and ovum created them.  And that sperm and ovum have no bearing on their support network.  And shouldn't have any bearing on yours.\n\nI'm fairly certain that my father passed away about 10 years ago.  I don't know for certain, because I hadn't spoken to him in about 15 years at that time.   So yes, that's 25 years since I last laid eyes on my father (I'm in my 50s).  And you know what?  My kids are better off not knowing him.  They didn't need the crap that he would shower on them.  They are better off mentally and emotionally never having to deal with a narcissist grandfather.  \n\nIf you have a will, you can leave a letter in the will for each of them.  \n\nA counselor or priest can help you ease your guilt and pain.  Because the only concept of closure comes from within.  \n\n",
            "Are you sure you are not using this as an excuse to bring them back into your life? Do you really regret all you did or do you just want people to think you are sorry? I'm asking because I got one of you as a mother and have been NC for two years and I plan on keeping it that way. I don't believe in her apologies (the few I've gotten from her in 37 years). Just do them a favor and spare them the trouble. They have moved on. You brought this upon yourself. If they cared about you they would have tried to make contact with you in all those years. You shouldn't have had kids if you knew there was something wrong with you. ",
            "Respectfully - death is the eventual outcome that we all share so that in and of itself is not unique. Equally for kids who have gone no contact - death might be one of the things they've been waiting to have happen - without knowing or judging you we don't know what kind of hell they believe you put them through.\n\nBUT -- you might want to afford them some opportunity to wrap things up -- **not through you reaching out to them** but say through a neutral 3rd party at least letting them know the end is coming for you then leave it up to them to make an overture or not.",
            "I think /u/deep_sighs said it best. Write each child a letter. Don't mention the will; don't ask for forgiveness. Name the things you did, don't justify them or try to minimize them; tell them why it was wrong and that you're sorry you did it. You may get nothing in return from them; it may be too little too late. But it's worth doing anyway. It may be something that they very much need to hear before you die.",
            "Mental illness blows, doesn't it?  I'm sorry about your cancer and your situation.  I don't think that it could hurt to reach out once to them.  Just once.  Make it clear, but concise, the reason that you're contacting them.  After that, it's up to them.  Like you said, you can always say more in your will since they will learn of your passing.  I hope that you can find some peace and comfort with the time you have left.  \n\nSide note:  I have a biological dad who doesn't speak to me.  I reached out one last time a few years ago and he didn't return my call like he said he would.  But at least I tried.  It's up to him now and I'm mostly good with that.  I just throw this in here because even with everything that's happened in the past, they might like to hear from you while you're still here.  ",
            "OP no one can give you good advice without knowing the scope of how bad you were. I noticed you did not give any specifics about your bad behaviour which is typical of narcissistic estranged parents.\n\nWhat have you done to them, what were the points that made them decide no contact? If I was talking to them, what do you think they would say is the worst thing you did to them?",
            "I'm on the other side of this.  I had cut off contact with my father, who was very physically abusive *and* openly hated me, and he became terminally ill.  I honestly couldn't have cared less.  I wasn't happy about it; I wasn't sad about it.  I gave him the same consideration that I'd give a stranger off the street.  \n\n\nThe illness lingered for many years before he finally passed away.  After cutting him out of my life, I got somewhat of a \"courtesy call\" the day that he was really dying.  I got in my car and drove several hours to see him one last time.  He couldn't say much and I'm sure that he was barely aware that I was there.  I don't regret going, but I'm not happy that I did.  I was surprised that, in the moment, I did want to see him one last time while he was alive.  \n\n\nI say contact them and let them know.  I'll be honest, for all three of your kids to cut contact, you likely did some horrific stuff.  But a lot seems to have changed in 25 years, and it would help them make sense of things if you were to discuss the issues frankly.  \n\n\nThey may be no contact with you, but they'll never forget you.  If things were so terrible that they'd cut off contact, it's likely that they're still working through issues and trying to figure things out.  \n\n\nAbuse (of any type) can make a person feel worthless.    *If the people taking care of me don't love me, what's wrong with me?*  Acknowledging that what you did was terrible and that you value them for who they are will probably help them come to terms with what happened.  What I went through was never even acknowledged, and still to this day, years after my father's death, I would love some sort of explanation for things, to know that I wasn't a worthless object to be hit.  \n\n\nIt takes courage, and they may reject you (and even enjoy rejecting you), but you're going to be a part of their lives again when they get the news, and you don't want your legacy to be that you didn't think they were worth enough for you to sacrifice the discomfort of admitting that you failed as a parent.  \n\n\nP.S.  To keep it brief, I left out a lot of details.  If there's any confusion, assume I meant well and don't be afraid to ask!",
            "Growing up, I dealt with a father who was a violent alcoholic who went on to tear my family apart. Upon reaching adulthood I decided to cut him off until he changed his ways. He never did.\n\nI didn't speak to him or see him for the last 10 years of his life. I found out from a third party that he had terminal cancer and was given months to live. I passed along my contact information and waited.\n\nHe never called, never wrote, never even passed along a half-hearted apology. Never bothered to even say goodbye. It's been eight years since his death and despite every bit of new age advice I've heard about forgiveness and letting go of the past, at times I still hate him. Sometimes even more than when he was alive.\n\nYou should contact them and apologize, or at least wish them well. They'll be here long after you, and aside from salvaging some kind of legacy, you might be able to give them the closure that allows them to get on with their lives.",
            "The bottom line is, you want this for you.  You want to apologize so you feel better.  If you reach out, you're saying (again?) that you don't care about their wishes, your absolution is more important.",
            "To give you some perspective I am estranged from my mother for six years now. I'm 27. It was my decision for exactly the same general reason that your kids did. I don't know their personal accounts of the trauma you no doubt inflicted upon them, but if you're anything like my mom I don't blame them. And I assure you it wasn't as easy as you think. To this day people look down on me for cutting off \"my own mother\" but they had a real mom that gave a fuck about them or anything more than herself so really they will never understand and I'm glad they don't get it. It just shows how lucky others are because to me it was a no brainer. Once you see other peoples families and you realize oh moms aren't supposed to be like this?? It changes everything. Anyways. I'm on a tangent.  Idon't assume you are anything like my mother obviously I have bias and I don't presume to know you, mental issues really latch onto different people differently. I suffer from my own no doubt inherited if not that then just from the lack of normal parenting. I digress. I can 100% say I made the right decision in cutting off my mom. I have no regrets and I wish I did it sooner because the scars she has left me have influenced who I am and I will never get a chance at that again. That being said. I'd see her before she died if she told me she was dying. Would I think it was a ploy and maybe a lie? Of course. Idk if it would be a morbid curiosity but if I knew for sure it was fact I would see her. Her Being a narcissist, I would almost feel like she just wanted more attention as a gut reaction, a last hurrah but since it's the end I would probably just give it to her. As much as I resent my mother, I do understand that she has no control of it,it's who she is and that's that. But that doesn't change how she made/makes me feel. Much like being punched in the face on accident repeatedly, it hurts the same whether intentional or not. I feel like in a lot of ways I'm a bigger person than her so I would honor a last wish, at the very least I would do it selfishly tospare myself from feeling any guilt from not doing it later on. Oh and don't mention the money at all I would sooner rip a check in my mothers face than cater to that bullshit. Oh also my mother would neverrrrrrr admit fault although you say it took decades so maybe just not yet. Eitherway though you saying that make sure your kids know that you know it's all your fault. Put it in writing so they have something to look back on thats positive if it were me it would bring closure because a part of them probably will never know if they did the right thing.If you haven't ever said that they might not realize you know. ",
            "I don't mean to be insensitive but, I cut my mother off also, after years and years of abhorrent behavior on her part, which culminated in actions that impacted not only my, but my husband and child in a very real and negative way. \n\nI know she isn't well, I've heard things here and there. If she showed up at my door claiming to be on her deathbed and begging my forgiveness, I'd slam the door in her face and feel immense satisfaction in doing so. \n\nAre you prepared for that kind of response? I mean, showing up after all this time might rip open old wounds for them that they've long since put to rest. It's *hard* to disown a parent. I know unequivocally that I did the right thing but it's still excrutiatingly painful sometimes. I have issues stemming from my relationship with her that I don't think will ever go away. \n\nI feel like asking forgiveness at this point is entirely selfish, and entirely unfair and you really may not like the response you get. ",
            "As a 48 year old women, I wish I had the chance to say goodbye to my father. It was too late. Give them the choice, please. They can say no. ",
            "Life is for living, not for regret. Do it. Reach out, be genuine, and god help us all. ",
            "I'm very sorry to hear about your illness.\n\nNone of us know how your children feel or what they went through. Although you may have made terrible mistakes, you sound like you have reflected and fought back your demons as you say. I'm sure it hasn't been an easy journey for you either. I know this isn't part of your question, but I hope you can forgive yourself, even if your children cannot, and that you find/have found inner peace. \n\nIf it were me, I would want to know. ",
            "Child who cut off parent here for mental/emotional abuse related to alcoholism and personality disorders, so I can't claim to get exactly what your kids feel, but I'm in a similar place. \n\nYou say that you've realized what happened was wrong and you've worked on it. To me, of my mother was dying and came to me saying that in all the years we didn't talk, I realized how wrong I was and I'm sorry and just wanted to let you know that before I died, I would be fine with that. \n\nIf she expected that to magically fix everything and us to be hunky-dorey for the last of her life, no. \n\nSo if you really just want to reach out to say, hey, I realized I was messed up and that's why you all cut me out, I've done my very best since realizing to better myself. I am dying and just wanted to say sincerely that I realize my faults and apologize heavily, WITH NO EXPECTATIONS, I would say that would be fine for me with my situation. I don't know you and yours, but I think if you're not putting any expectational pressures on it and really just apologizing, it should be something they can understand. ",
            "I'm a physician and in a specialty where I see a lot of death. Your situation is not rare.  I have seen it all, and have been asked by patients to call their estranged children/ex-spouses/siblings and explain what is going on.  It is hard. I don't judge, I give those patients more of my time, heart and thoughts than others. Sometimes no one returns my messages.  Some people hang-up after hearing my brief introduction.  Others cry and make the first flight to say goodbye. \n\nPrepare for any reaction and best of luck to you.  The hospital can seem like a lonely and horrible place, but each death and each patient touches someone and we all carry a little graveyard in our minds.  Even if you're lucky enough not to end up hospitalized, please know that your doctors/nurses/hospice nurses care. ",
            "If you want, you can post your letter in this sub before sending it. You'll have uncompromising feedbacks for sure :-)",
            "I think you can send them letters to let them know what's going on and your apologies and a way to get in touch with you. It probably wouldn't go over well if you did more than that.",
            "Man, that's sad.  First off, I am sorry about your situation and hope your soul finds safe travels between this life and the next.  I have a strained relationship with my mom over the same things you've mentioned in your post.  If she were sick, I'd  still want to see her.  ",
            "74-year-old internet savvy poster here who knows about /r/realtionships and posts tl;drs. On a throwaway. Has all of the reddit-darling mental disorders but has enough self-awareness to recognize it.\n\nIf you don't do your part to create a willing suspension of disbelief how are the people here expected to maintain the polite fiction that any of this happened?",
            "You may not want to hear this, but as a child of a narcissistic, mentally ill, substance abusing, abusive mother in NC for 15 years, I would NOT want to hear from you.\n\nIt would only be upsetting and triggering and rip open old wounds I've worked hard to close. It would send me into a rage. I would doubt you were even dying, that it was just a ploy to get whatever it was you REALLY wanted. Another guilt trip and manipulation because my Nmom would pull the \"I'm sick/dying, you need to treat me better\" card ALL THE TIME. When I went NC she sent me a fake medical bill for chemo from a doctor that doesn't exist, working in a hospital that merged and changed names 20 years ago.\n\nThere's such a thing as too little, too late. \n\nWrite them letters to be opened upon your passing. They MAY believe you were sincere then, since you had nothing to gain. ",
            "This is going to sound cold, but do your kids a favor and let them go on pretending you're already dead.\n\nMy mother had cut off her own toxic, narcissistic mother about 15 years ago. She was dead to her, didn't want to see her one last time, didn't care about the estate, wanted nothing to do with her. My mother has mental health issues, but she was much better off without her in life. \n\nTwo years ago mom got a letter from grandma saying she had lung cancer and wanted to see her one more time. Mom felt guilty and went to visit. All it did was stir up old emotions that mom would rather have just kept laid to rest. Her mental health suffered for months as a result.\n\nWhatever horrible shit you may have pulled, do your children one last favor by continuing to respect their boundaries. You're only continuing your narcissistic habits by putting your own needs before theirs. They know how old you are, they know you won't be around forever, they made their choice. ",
            "When I was six years old, my dad cut off his mother because she threatened to kidnap me and went off her medication for schizophrenia  He felt that it was best to protect my mom and me. I'm not sure how it happened but when I was 16 or so, they talked on the phone once. She passed away less than a year later. Based on that experience, I think you should write a letter or gently reach out. Some people have given great suggestions for how to approach writing the letter. ",
            "This thread and everyone hurting in here hurts my heart.\n\nI am NC with my mother after trying to salvage a broken relationship for years.  She threatened my life because she broke MY boundaries after I had a seizure/stroke.\n\nPlease OP respect their decisions.  Do not try to force their hand and respect their boundaries.  Maybe have a nurse call your eldest child and they can talk to their siblings to see what they say?  Even that might be a stretch.\n\nI know for me, in my situation, I really wouldn't want to know  or hear from my mother.  If she was dying or otherwise.  She has don irreparable damage and hearing from her would open old wounds that have taken YEARS of therapy to close.\n\nGood luck.",
            " /u/Tristine8 , I'm going to go with some practical advice, I hope that you see this. \n\nFirst of all, I'm so sorry to hear about your situation. I worked in Hospice care and had a few cases like this, where the family wanted nothing to do with my patient. I cannot imagine what you're going through. \n\nHaving said that , I'm not sure if this has been said or if you've taken advantage of this (I hope the answer is yes either way) but I am hoping you're receiving Hospice care. It's a matter of quality of life for you at this point, and if you're 74 years old, you qualify through Medicare with a physicians diagnosis. If you're low-income, you qualify through Medicaid. You need to preserve your comfort. This isn't about giving up, it's about receiving quality of comfort and attention from people who respect the culmination of your life enough to treat you well and end as much pain or psychosocial suffering as they can. Hospice nurses are some of the best people I've ever ever met. Rarely do I see someone so passionate about a career and field. \n\nHospice care provides a social worker who is trained in counseling, a Chaplain who can also provide guidance no matter what your religion or beliefs, and volunteers who are trained in being a good companion. This alone may help you find peace with your struggle. It's also, from my experience, worth seeing if your counselor or volunteer could help be a mediator to your no contact family. Sometimes it takes someone else to reach out and make the situation much more \"real\" to get results. This may sound cheesy, but one of my favorite movies of all time \"Magnolia\" covers this theme very well. A passionate professional advocate of yours who isn't just a doctor or someone seeming biased, someone who specializes in spiritual and psych guidance may be able to bridge the gap. \n\nIf you aren't receiving Hospice benefits, call any well rated Hospice agency in your neighborhood and tell them you're on Medicare/Medicaid/ Insurance and they will find a way to pair you with a case manager. If you have hospice, bug then and bug them and bug them until they've told you they can do all they can to try to incubate a new relationship or line of communication. \n\nI hope you find peace. ",
            "In my opinion, why not reach out to them, just let them know the situation and how you're not asking for anything but a chance to apologize. 25 years is a long time, but I don't really see any harm in trying to see if they want to see you again.\n",
            "I'm sorry for what you and your family have gone through. There's no doubt that was painful for everyone.\n\nIt's likely that your children have already mourned you when they cut you off. If you haven't had contact for a long time, you shouldn't reinitiate without considering all the impact it will have. You want to see them again. That's understandable. It may be painful to go without having seen them, but you won't have to live with those feelings for very long. Your children, on the other hand, may live many years with the consequences of whatever you choose to do. If I were you, I would write your feelings in a letter addressed to them, but never send it. Get your feelings out without involving other people. If you really need to cause drama in someone else's life to feel at peace and understood, you haven't yet mastered your narcissistic personality.  ",
            "The *best* thing you can do is leave them alone. There's no way to make this up to them. If you could have mended things they wouldn't have gone NC with you. \n\nI speak from experience. After 24 years of NC my father died. He left us nothing, no will, no poisoned final words. It's the one thing I'm grateful for. \n\nMy covertly narcissistic mother and I have been NC for a couple of years now. She told me long ago we'll all receive letters letting us know what horrible people we are. ",
            "I wouldn't\n\nIt honestly just comes off as selfish, which is how they will feel, if they even believe you",
            "If I was in your issues I would prioritize letting them know you love them and apologizing for the things you've done to make them want to cut you off for so long -- without seeking or expecting their forgiveness.  Let them know how you feel and make it clear you aren't asking or expecting anything in return.",
            "Wow. that is heavy. I'm sorry.\n\nHonestly, if you really care about them and what you have done, you will simply write them sincere apology letters and leave that with stuff you want to give to them in your will, and have it delivered to them after your death.\n\nI feel like it would be more upsetting for them to get this while you are still here, not know if you're being manipulative or sincere, then you end up dying before they can decide, which may make them feel even worse. Or they come see you, then feel terrible seeing you in the state you are in and then they have to deal with the guilt of not seeing you for so long.\n\nIt will hurt them either way, but if you don't contact them before death, you are still respecting their wishes, and will not seem as manipulative.",
            "Hello, OP. I forgave my mother a long time ago for the violence and abuse she inflicted on me, but I will not see her again because she was so physically violent, and believed so much in her right to punch and kick me, that I will not be within physical range of her. Forgiveness may not involve your children ever being in your physical presence again, if you were ever physically violent towards them. (I do understand my mother has mental illness issues as well as an abusive and violent personality, but those issues do not excuse her violence--they only help explain it.) I have no wish to have her punch or kick me, even though she's 86 now....",
            "Speaking on behalf of me and my mother, when we mean don't contact us again, we really mean it. For me, it's been 17 years since I've seen them and in no way I would want to see them. I don't care if they are dying or already dead.\n\nSorry to say it.",
            "It's better that you be the one to tell them and to end your life without regrets, reach out to them. If they dont reply then you still did your part as a parent and can live the rest of your life without thinking about it.",
            "My brother (35m) and I (34m) have not talked to our mom since 2010. She did some pretty terrible things to us and we both have some PTSD from it. I do not want to talk to her now, but if I knew she was dying I would want to see her before she died.",
            "I hope OP keeps us updated on this. It's not often that a person gets a chance to truly apologize for something and when somebody really means it, it's a beautiful thing",
            "OP, I'm not sure if you're still with us or not but I hope you did manage to find peace in your final days. ",
            "I think you can reach out while indicating that you will respect their wishes one way or the other. Don't mention the money. :)",
            "I would be pissed off if my dying parents contacted me after 25 years to apologize because they were dying. I feel bad for you and I hope you do find some comfort but damn actions have consequences.\n\nETA: People die. Whether suddenly or not, everyone dies. You don't know if your children have already grieved your death. When they were young and vulnerable you caused them enough harm that they cut off contact with you. Now that you are vulnerable you are looking for them, but they were vulnerable too. Vulnerable and without an awareness and knowledge that comes with age that you have.\n\nI don't know what the best thing to do is but if they haven't come looking for you then it's a pretty good indicator that they've grieved your death already.",
            "> I want to do what is best for them.\n\nThis self-aggrandizing, narcissistic weasel speak needs to be left out of your vocabulary regardless of what you do.",
            "[deleted]",
            "[deleted]",
            "I have not spoken to my parents in 10 years. Knowing that one of them was dying would not change that for me. It would not be wise of me to give them one last chance to hurt me tremendously, which is what I can only assume they would end up trying to do. \n\nI have to honour myself, and my right to keep myself and my kids safe and healthy. And time and time again they have shown me that I am not doing that when I let them into my life. ",
            "You are my father. Not literally, as he's 79 and I'm 29, and as far as I know he's not dying yet. But still. Yes reach out like the top comment or says. Don't hold a will over their heads. Don't expect them to come. They might not, but I know I would. For one last sense of closure.",
            "This pissed me off just to read so I can imagine how enraged and afraid your kids are gonna feel. Leave them alone. The kindest thing you can do for them is to leave them be to the (hopefully) happy lives they have managed to form despite having a narcissistic parent. It would be extremely selfish to stir up wreckage in their lives and devastate them all over again. Reading between the lines - 'there are considerable assets' - 'still fighting my demons to this day' - all you're likely to do is brutalize them again while holding money over their heads. \n\nYou can leave them stuff without breaking their no-contact wish, but frankly it takes so much for kids to ditch a parent that I'd bet they want absolutely nothing from you at all. Consider leaving it to charity, or if you do leave them money and stuff, also leave a heartfelt letter that includes real, sincere apologies.",
            "Hi OP. My grandmother treated her children horribly and was undoubtedly a narcissist. The amount of abuse my mother endured for decades definitely left an impact on her. My grandmother has been dead for 14 years and my mother and her sisters still deal with the residual pain left over from their childhood. Though she was never cut off from the family for long periods of time (though she should have been), I often wonder if it would have helped my mom in the long run had she had an apology from her mother...for anything. I'm not so sure that it'll necessarily open old wounds if you reach out to them, because trust me, they live with whatever happened to them every single day. I guess it's just nice to know that maybe some people with shitty personality traits maybe do feel some remorse. It makes me feel like my own grandmother maybe regretted a few things. You should reach out. Don't mention the estate. Just apologize. ",
            "[deleted]",
            "As someone who has repeatedly tried to cut my father off, I can tell you that hearing his apologies do nothing.  If he wants a relationship with me, what I want is to stop hearing about his guilt, to stop hearing his apologies.  Because I know that while he is sorry, he feels worse for himself than he really does for me.\n\nI would definitely give your sons & daughter the opportunity to see you.  Don't make it about you though, make it about them. Apologise for sure, but let them know that you 100% respect their decision, and that you just want them to know that you do love them.  \n\nIt's a tough one, because regardless it will probably make them feel some guilt.  Which is the shitiest most frustrating feeling, when you are a child of a parent that didn't parent very well.",
            "Like many here, I have been estranged from my parents for years now as well due to them being very abusive and narcissistic. The last thing I want to do is to hear from them. \n\nEven if they are on their death beds, I won't be visiting. If they left me any assets - I will be donating it to charity as I want absolutely nothing to do with them. They died a long time ago - on the day I was born. I was never their child, I was a trophy that needed to be a certain way so they can show me off and pretend to be great parents. I wasn't a human being with my own thoughts and preferences.\n\nDamage is done, if they have kept their distance for 25 years - they don't want contact.\n\nAs someone who can admit they have narcissistic personality disorder, as many have said here - ask yourself, is this apology for you or for them?\n\nI think you know the answer in your heart. If you truly want to give them peace - let them go.",
            "Your kids are at peace and that should be where they are allowed to stay. It is their reward for enduring whatever it is that happened to them. Seeing them only fulfills your own desire and curiosity. This is the narcissist part of you speaking. \n\nLeave them be and make peace with it. You can pass on knowing they will all be okay. ",
            "Evidently you have a lot of good comments here so I will just reinforce that yes you should let them know, then they can make the decision what to do.",
            "I'm late but hopefully you can see this.\n\nMy wife's mom is a raging narcisist.  I don't know what you've done, but what her mom has done to her daughter (my wife), her other kids, her husband (my father in law), and me over the last ~18 years has caused me to hate her and I honestly don't care if I ever talked to her again.  Ever.  My wife and her brother and sister feel the same way.\n\nI won't go into details here but her mom on one occasion tried to convince her daughter (my now wife) I was a woman hating asshole *while inviting a coworker's son to their house to go on a date while I was engaged to her daughter* (obviously she didn't go on a date).  I can't make it up.  Her mom has *never* apologized for what she has done, ever.\n\nThat said my wife **really** wants the kind of loving, caring relationship she has with my mom with her own mother.  If her mom would send a letter apologizing for all the bullshit she has put my wife and I through and did the same for my wife's siblings and their dad we would consider having an open heartfelt, face to face conversation with her.\n\nYou have nothing to lose at this point, your time on earth is nearly over.  You need to accept that they might not ever forgive you but if you can put your sincerest apologies onto paper and send them a letter they might agree to meet with you again, at least one more time.",
            "Me and my siblings cut our father out of our lives about 8 years ago and went complete NC. I don't know what you should or shouldn't do but I know that if my father tried contacting us now or in years, there is nothing he could say that would make me want to even reply, let alone meet. Sorry if it sounds harsh but cutting a parent out permanently is not the sort of thing you reconsider later on.",
            "My wife cut contact with her mother, too, because of narcissism, mental illness, and drug addiction. She's been a happier person for it for the past 10 years, and has been able to move on. That being said, my wife has told me she'd regret it if she didn't get to at least have some sort of closure before her mother died. Her mother is still a toxic person, unfortunately. But I still think if her mother was on her deathbed, she'd appreciate a letter, like others have suggested. Avoid any language that might be interpreted as placing a guilt trip on them. I don't know how to do best do that when the subject is that you're dying, since right there it could be misconstrued that you're \"just making it all about your drama again\" in their eyes, but just be honest and sincere and loving. I think you'll be able to figure it out.",
            "My mother and I have both been cut off from her family for 24 and 6 years respectively, because we wouldn't \"be good\" and play their games.  My one uncle is also estranged, and another died because my grandparents didn't tell him about possible medical conditions due to cutting him out.  Oh man, this brings up so many emotions.\n\nMy advice?  You should leave them the hell alone.  They don't want you in their lives.  I wouldn't be surprised if they feel you died all those years ago and have already made their peace.  You're just trying to play another game, weave another web: \"Oh, I'm *dying*, isn't that sad?  I'm only sorry because I'm *dying*.\"  No matter what you say, you* aren't doing this for them to say goodbye - you're doing it for you, because if they *don't* forgive the terminally ill woman, then they look like horrible people.  You waited 20+ years to \"apologize\", so what's a few more months?\n\nLeave them alone.\n\nEdit: I forgot two words.",
            "I had a very strained relationship with my narcissist Dad. He died in December. I'm processing grief + guilt + \"could haves\" + memories of the weird and hurtful behavior we all endured. I didn't cut off contactentirely and saw him last Thanksgiving. We said \"I love you\" (I did, just in a very complicated way) one last time. I am so very grateful that I had that opportunity. \n\nIn your situation, if you can, send them a few lines via email and explain that you love them and want the opportunity to say goodbye. Let them respond or not. Believe me, in the face of death people experience an incredible storm of conflicting emotions. I'll bet at least one of your children will visit, plus, you'll have been able to say \"I love you\" that one last time.\n\nI wish you and your family peace.",
            "You have a lot of responses on here and I'm on my phone so I can't write a long comment but I did want to say that my mother is similar to what you described. I'm currently NC. \n\nHer mother died and she never said goodbye. I went to my grandmothers funeral but did not know her because of choices made by my mother. I find it hard to deal with now, not knowing really who she was and if it was right. \n\nMy mother said she was always waiting for an apology or some kind of contact to at least acknowledge the abuse she suffered and to know that her mother loved her. Although I'm not sure exactly who should have been doing the apologising (perhaps both), this broke my heart to hear. That she might of liked to have said goodbye but her own stubbornness prevented her. \n\nMy mother, well, despite all her faults, is still my mother and I love her. If she were to die id want to say goodbye. I'd want to see her. I still want to see her I just can't. I'm sure you know it's incredibly complex. \n\nThe main thing to know is that if you're going to reach out make sure you make it clear that you don't want anything from them. It is going to conjure up mixed feelings and it's probably best to do it as gently as possible. \n\nI'm sorry for your situation. It's terribly sad and i empathise hugely. I hope you get some good advice here to move forward. \n\n",
            "As a child of a father with what in reflection I am sure has NPD, which led to me cutting him off entirely when I was 14, I'd say don't. I can honestly say I do not give a fuck if my father is alive or dead and I certainly do not have any interest in hearing from him on his deathbed. \n\nJust because mortality is now come knocking doesn't take back anything you did to your children, and your apology is going to seem even more false and entirely selfish. I would be fucking furious if my father tried to contact me and if your children feeling anything close to the amount of resentment I do, they will be equally as angry. \n\nLet them live in peace without your shadow coming back on the scene. They'll be haunted enough by the shit you did, they don't need reminded, just because you're dying doesn't change a thing. \n\n\nI feel your disorder is making you very, very selfish about this entire thing without considering what they have explicitly stated. You get to die soon and escape your behaviour, they don't have that luxury. If you truly are sorry, let them live in peace. ",
            "I have chosen not to speak to my father or have any contact with him, and it sounds as though it is for similar reasons as the ones your children have. I love my dad, because he is my dad, but I carry great hatred and resentment for him, too.\n\nThat said, he was put into the hospital recently for liver failure, and a family member reached out to tell me. I called to make sure he was okay, but I didn't speak directly to him. If he was about to die, then yes, I would want to be able to talk to him. Under any other circumstances, I don't. \n\nI feel your kids are probably in the same ballpark. I think you should reach out. ",
            "For some reason, I don't think this is real. ",
            "I'm thinking that your post already contains a decent nucleus of a letter. To paraphrase your own words: \n\n> Dear X, \n\n> For 25 years, I have respected your decision not to contact you. With my history of mental illness you had every right to do that. I had problems with narcissistic personality disorder and anger which took many decades for me to overcome and I'm still fighting my demons to this day. \n\n> I am sorry if this letter causes you pain and sorrow. I'm living the final months of my life. I have terminal cancer and will soon be gone from this world. I promised you to respect your wishes and I have for 25 years but deep in my heart I do wish to see you again, maybe to apologize for one last time before I'm gone. \n\n> I don't know if I am being selfish. I want to do what is best for you. If you would be interested in seeing me before I die, you can (whatever mechanics of visiting, telephoning, or emailing).  \n\n> If you fear that this is yet another manipulation and do not feel comfortable with responding, I completely understand. It's ok, I promise. \n\n> I love you very much and I am sorry that I was not the parent that you deserved. \n\n> I sincerely hope that you have found the happiness, peace, and love in your life. \n\nEdit to suit. If you have a therapist, have that person help you with the wording to as to remove any possible whiff of hurtful language. \n\nIt would be good to give them the option ro email or telephone you first. That might feel like a safer way for them to test the waters, so to speak. \n\nMy other suggestion is about the money. If you are leaving them life changing amounts of money, hopefully you have consulted a tax lawyer about structuring their inheritance so as to minimize any tax headaches. You may also consider prepaying for one or more consultations with a financial planner for each of them. If you have been working with a reliable broker who understands your estate, make sure to include that reference. \n",
            "[deleted]",
            "I would let them know you're dying and apologize to them. That's it. They can decide what to do from there.",
            "Video yourself explaining this and send them each a copy.  ",
            "[deleted]",
            "As a son who was incredibly shit on by my mother, father, and grandparents, including my moms siblings being too wrapped up in their own worlds to give a shit about my well being, and making sure their kids had everything, I want to chime in. \n\nMy mother decided to leave my dad and live out her new life with a woman she met. She moved out of our house and into her parents house, my grand parents. \n\nSoon she'd be gone and not heard from for long periods of time. She would show up after calling to tell us to wait outside so she could pick us up without going inside. \n\nWed get to her 1 bedroom apartment and watch tv in the living room while she would go straight to her bedroom with her dyke ass lover, close the door, and completely ignored our existence while being no more than 15 feet from her thru a wall. \n\nId call my grandfather to pick me up because I didnt want to be ignored any more in person than i was when she wasnt around. \n\nThere was a time she went at least a year without calling and i asked my grandfather if she had died and he didnt want to upset us. \n\nEventually Id find myself living with her again for a few months. I remember my grandfather picking me up but my siater wasnt with him and he wouldnt say anything. I got home and saw my stuff in the living room only to learn she kicked me out and took my sister and her lesbian lover and 2 friends to mardi gras in New Orleans. \nNeedless to say, my experience with her would be much of the5 same, eventually leading to me moving her to my house in Dallas to get her off crystal meth and a clean start in the tech industry.\n\nShe would end up being kicked out of my house and me not talking to her for years. \n\nFinally i had business in Little Rock AR so i took the time to visit her since she claimed to be clean and healthy and remorseful. \n\nIm glad I did, but 8 years after that i had to deal with her wanting to move back to dallas after being threatened with eviction. I refused since I had my son to take care of and letting her in any position to hurt or disappoint my son was the last thing i had intentions off. \n\n30 days later, she was murdered and i got the call while leaving my clients office that afternoon, which was Disney World in Orlando, FL. I had to leave the next morning back to Dallas, then drive to Little Rock, and take care of everything. \n\nI think about the times she showed zero ounces of give a fuck, the multiple countless times i let shit slide because she was my mom, and realize she got exactly what she gave. \n\nShe died on her knees, in a trailer full of junk, lonely and wishing shed cared less about partying, drugs, and pussy and more about the kids that would see her in her olden years when the other stuff didnt matter much. \n\nId say call them, tell them why, dont tell them about your will, and see what happens. \n\nAs a side note, dont leave them anything. Talk to an atty and create a trust. Set the trust up as a way to help your childrens children or even great grandchildren when they turn 18. \n\nYour children are more likely to spend it or see it as a windfall and as a payoff. \n\nHelping their children and further down will say far more about you to your lineage than what your kids might.  \n \n",
            "Sit down and write a letter to each and apologize.\n\nTell them that your sorry for what you did.\n\nDon't tell them your dying or they may feel your guilting them.\n\nJust leave your name and number at the bottom.\n\nThey may call they may not.",
            "Write them all an email or a letter explaining the situation.  You can begin to apologize in the email / letter. Then respect whatever decision they make.  If they continue to choose not to interact, go ahead and write something to be left in the will.\n\n",
            "I think you should send them each a separate, deeply personal, letter or email.  Just apologize. Do not ask for forgiveness. Do not mention the will.  Say you are terminal and you are dying and you wanted to let them know you are truly sorry for any pain you have caused them in your life. They may not read it or show up, but I think that is the best you can do it this point. I am terribly sorry to hear of your declining health and I wish you all the best and hope you find peace.",
            "I'm about your grandchildren's age. And I can relate to where your kids come from. And yes, you might have been a terrible parent and you might have done terrible things. It is past now. What matters is that you realize what you did wrong and want to make amends.\n\nThis is just one life we have. And as you say, unfortunately maybe, it is coming to an end. And this clearly matters to you a lot. Fulfill your wish. Don't leave it undone. Apologize to your children. I hope they will understand. I know I would if an apology ever came my way from my parents.\n\nHope for the best and go for it. I only hope you fully realize your faults and do not stick to those ideologies anymore.",
            "Are you working with a grief counselor? I would work through this with a therapist. Make sure the therapist understands that you deeply hurt your children and that they have every right to be no contact, and you have no right to ask for forgiveness.\n\nYou need to prepare yourself for this. How will you feel if they don't respond? Will you die holding out hope for a response that never comes? Are you prepared for angry responses?  How will you handle it if they do reach back out, how can you assure you don't fall back into old habits and hurt them again?",
            "Ok first of all...I feel my mom is going to end up in your situation and start regretting how she has treated us. That is my only solace in being pushed away and treated like shit by her. Not just me- my kids, my sister and her kids, my mom's boyfriend. The list goes on. The only people she doesn't treat bad, have no clue she is a selfish, angry, hurtful, grudge holding person. She has two faces- Her nice sweet, work face and the face she is around us.\n\nI'm not going to go into anymore detail, I know you get the point.\n\nSo I have a good perspective on what your kids may be feeling. But first of all, it's been 20 years!! Has any of them tried to contact you? \nI have dealt with a narcissistic person before and oh my god, it's hell. \nYou might not realize how bad you've hurt them but I'm sure for them to cut you off for so long, it's got to be bad.\n\nAnd do you honestly regret it or are you just not wanting to die alone? Ask yourself that question. \nOk...no matter what happens or what has happened, your kids will probably regret not seeing you before you pass away. I know that for a fact...unless you did something that was so horrible that you are pretty much dead to them and they have no room in their hearts for forgiveness. Could be the case, I don't know.\n\nAll I can say is, as much as I hate my mom and know she's toxic, I still love her. \nI don't try to have a relationship with her or be close to her. She's not cut off but she might as well be because we barely talk or see each other. But despite all of it, I do love her. I have tried to stop and I can't. But just like your kids, I recognized that she is hurting me and I can't allow it anymore.\n\nYou should call your children...just start with a call\nTell them what is going on. Tell them you will be leaving them items when you pass away and you would like to talk to them about it. \nAnd if you can find a way to have a deeper conversation, do it, if they're willing to.\nTell them you know things are bad between you but you would like to see them before you go and talk to them face to face. \nIt's about all you can do.\n\nIf they're not receptive at first, try a couple more times but don't ever try to minimize the pain you have caused them, that will just push them away. \n\nGood luck, I hope you can be reunited and find some peace about the situation, you and your kids. ",
            "Straight up tell them the truth and say everything thats on your chest. Maybe write up an official genuine letter and send one to each",
            "Speaking as a kid that cut off an abusive parent, I'd advise you to reach out only once to your children. Send them emails/letters/whatever, and apologize for your actions. Let them know that you understand why they needed to end their relationships with you, and respect the decision they made, but that you wanted to let them know, before you die, that you are truly sorry for the harm you did to them.\n\nDO NOT ASK FOR FORGIVENESS. Forgiveness is theirs to be offered, but asking for it is presumptuous. When my own father was dying, he sent me several cards, all asking for my forgiveness, and each one made me angry. I'd long since come to terms with my childhood, but his repeated requests that I give HIM peace of mind were simply infuriating to me. It wasn't my job to let him die with a clear conscience, and I deeply resented his efforts to coerce forgiveness from me.\n\nDO NOT MENTION THE WILL. Mentioning that you intend to leave them your estate will only seem like you're trying to buy their affection. Make sure your lawyer/executor know your wishes, and leave it at that.",
            "I would have given just about anything for my mother to have taken responsibility and apologized for the years of abuse I suffered as a child.   If you can take responsibility for what happened to cause your family to go NC then write them each a letter.  ",
            "First, I'm very sorry about your diagnoses and your long alienation from your children. It must be very difficult. I don't know what led to your estrangement but I expect that it was fairly awful. However, I think you owe it not just to yourself but also to your children to give THEM the opportunity to see you to say anything that they need to. I think that if you were to pass away without at least giving them a final chance to see you, they may feel a lot of guilt. Perhaps send them each a letter and let them all know that you are in hospital and that you are dying. Tell them that you will entirely understand if they don't want to see you but you wanted to let them know in the event that they do want to see you. Apologize again in the letter and let them know that they have done nothing wrong and will not be in the wrong if they decide not to visit. And tell them that you love them. \nI hope they do come to see you but make sure you make this all about them if they do. ",
            "I'm pretty low contact with my dad for a few reasons. I do think you are being selfish but i think that is also perfectly fine. You're dying. You want to see your kids before you die. I think the bigger question is will you be OK if they say no or don't even respond?\n\nApologizing honestly is the most important thing if you do decide to make contact.",
            "If you can get a message to them, that message can be the apology. You don't need to see them to apologize. \n\nYou can express your wish to see them, but there should be no implied obligation or strings attached. Merely your wish to see them before you are gone. Then it's up to them to decide whether to reach out. \n\nI would not mention wills or \"considerable assets\" at any point - it turns the whole thing into a transaction where you're holding the strings, creating probably pretty much the same situation your children intentionally walked away from in first place. You already know - and they will find out when you pass.\n\nIf you do meet, just convey what you want to say. Place no expectations on your children.",
            "I cut my dad off for similar reasons. He died while I was no-contact. Despite my decision, I still wish I would have been given the opportunity to say goodbye.",
            "I'd forgive my father, and I hate him. ",
            "I was estranged from my father for about 15 years, and he died last December. I did not get to speak to him before he died. He had a stroke and went into a coma. My siblings and I were notified of the stroke by a relative. At that point we were each able to make a decision on whether or not we wanted to see him. \n\nI say let your kids know. This will make it their decision on if they see you or not. \n\nMy dad's death would have been much more difficult to deal with if I had not been given the option to see him and get some closure (even if he wasn't conscious). \n\nThank you for posting this. ",
            "You have nothing to lose. Reach out to them, offer an apology and be as respectful as possible. Good Luck to you.",
            "I wonder what's it's like to be at peace with the fact that you're dying.\n\nGood luck to you! If they don't respond after so long, it's probably for good reason.\n\nThis is incredibly heartbreaking. I wish you all the best ",
            "The advice I would have given has already been given by others way more intelligently than what I can ever organize into words. Instead I want to offer my deepest condolences. No one is ever perfect. But I believe in redemption. And despite not knowing your situation in detail, I think anyone who even considers wanting to redeem themselves or recognize their faults to be forgiven is worth enough to be forgiven and redeem one's self. It shows humility and humanity. \n\nAs a community, I hope there's plenty of people here and in your life who can sooth your last days. The thought of knowing your own oblivion is extremely pressing, I'm sure. Can't imagine it myself. \n\nI hope you may rest easy in the end, regardless of whether you are reconnected with your children or not. Best wishes to you OP. ",
            "OP I just want to say I'm sorry for what you are going through. Through your own actions (be it mental illness, inability to parent well due to past abuse, your own shitty childhood, whatever issues) you are at the end of your life. And alone. I'm sure some here may say I'm taking your side because they can better relate to your kids' POV (going NC with you 20+ years ago) but you are a human being. You have value. While I'm an atheist, I do believe most of us do some good (some less and more than others, for sure) while we are here and even if your good was to bring smart, resilient people into this world, that's something. It speaks volumes that you do care enough to want to reach out to your children while you are still here. How you choose to do it will be your last act towards them. Choose your words wisely. May your death be as painless and peaceful as possible. Internet hug. ❤️",
            "Contact them.  I am in the same situation, only I'm one of the children.  My father is dying of cancer.  I hadn't spoken to him in probably 15 years because he was, and maybe still is, a massive asshole.  \n\nI didn't have to take his call, but I did.  I figure that at the end of all of this, I think I would be a lot more likely to regret not speaking to him before he dies than the alternative.  He seems to have changed a lot, but it could be an act.  And if it is an act, then he is going to die with me thinking that he's still an asshole, so nothing would change.  If he really has changed, then we will reconcile and find our peace before he goes.  I see no downside to giving it a shot.\n\nLikewise, I see no downside to you giving your children the same choice that I was given.  If they reject the invitation, then nothing changes.  If they accept it, then you might find your peace.",
            "Oh, I kind of have a parallel experience from the child's point of view. Of course my experience is different, but there are some similarities.\n\n\nI was a daddy's girl when I was young. My father was my world. My first memory is of my dad standing over me in my crib, taking meat out of my mouth (I was a weird kid who chewed up and sucked on meat...) My parents divorced when I was 3. But I still saw my dad on the weekends. My dad was also an alcoholic. He kind of dropped out of my life at 7. I didn't see him again until I was 17(1998), telling him I was going to college and asking him to pay the application fee. We spoke for about 5 minutes before I got mad and left. Then I didn't see or talk to him again until 2003 at my brothers funeral. At some point he had gotten sober, so good for him. We still had no relationship. Then 1 angry phone call. Then silence until 2014 when I was ambushed with him showing up at my half sisters baby shower. Then 2015 I saw him at her wedding, but he didn't say a word to me. And I was glad. \n\n\nFebruary this year, while I was pregnant, he had a massive heart attack. My brother and I went to the hospital, to hear the worst, but he started making a turn for the better. Maybe I was sentimental because I was pregnant, I don't know. But I went to visit him several times in the hospital. He was not in his right mind most of those visits. Talking about women he has been with and my mom. Not acknowledging my pregnancy. Not making sense. Then he was going into heart surgery, and I saw him before he went back. He had a tube in his mouth so he couldn't talk, but for the first time he was coherent. He saw me, and lit up. He patted my belly, and mouthed \"baby\" over and over, and tried to get out of the bed. \n\n\nHe survived the surgery, but was out of it again. Like an angry alzheimers patient. Then I got a call from my half sister. Things had gone south. He died while she was screaming into the phone at me asking what she should do. \n\n\nSo now the point of this and advice. Regardless of the awfulness he may have put me through, I still had love for him. I choose for my last memory of him to be that sweet moment before his heart surgery. He touched my son for the first and last time at that point. And he was that daddy that I loved and adored. When he was wheeled away after that moment was the first of 2 times I cried from start to finish of this all. I forgave him. Even if we couldn't really hash anything out. And when I thought about it, I was sad that, even though the chance was slim due to me being unreceptive and him unwilling to admit to anything, I was sad that there was now no chance of reconciliation. It was now final. It was now done, and I had zero say in that. I was lost because the chance that lingered with me from 7 years old was now definitely gone. I grieved what could have been, not what was, and the few moments we spent together when my son was 7 and a half months in my belly. I am so glad I got that chance. I am so glad that I got that memory. \n\n\nWhile I am unsure that your children would be receptive, I would advise letting them know about your situation. If there were any happy memories, they may want to meet you after so long. Just to say goodbye. I am thankful I got that experience with my dad, even if a year ago I would have said I wouldn't care. While that one nice memory doesn't wipe out the bad, it is wonderful to have it to pull up when I look at my son and can see some of my dad in him. \n\n\nI am so very sorry for your situation, and regardless of what you choose to do, I hope you find peace. But please give your kids the option at least.",
            "First, I think it's awesome that you're 70 something and on reddit. Second, my mom's a narcissist and I never thought I'd meet someone with NPD who could acknowledge it, let alone work on it. Kudos to you for that, though don't give yourself that kudos in your letters. :p\n\n\n\nThere's a lot of good advice on here about how you should say sorry and it's kind of hard without knowing what sorts of things you've done....I frequent the /r/raisedbynarcissists sub a lot though and have seen some pretty horrible things.\n\n\n\nI wish you the best of luck - if you choose to approach them, then do remember the parts written around here that there should be know justifications for what you've done. Just apologies and then go into the work you've done on yourself. That will most likely mean a lot.",
            "Take a day and make the best goddamn homemade card you can and personally write each of them something as emotionally deep as possible, apologetic as hell, and sincere. Tell them your days are running out and you don't expect anything from them you would just love the opportunity to speak face to face. \n\nPitch an idea for a brunch or order a bunch of food and have them over for movies, board games and music etc. And if they decline then write them again saying your goodbyes and regrets ending with a simple but effective. \"I will always love the special kid you were and amazing person you became. Im so proud of you\". \n\nThen spend the rest of your days doing what makes you happy!! If it doesn't work out with your kids atleast you gave it one last hurrah. Right a book. drink cocktails and creep on pretty girls, make a new friend. \n\nThis is the end of your chapter and thats okay but you need to enjoy the rest of your time here on earth before you start your next chapter in the great beyond. All the best friend!\n\nEdit** I swear I responded as soon as I read your comment. Now I'm seeing everyone who responded to you has said the same about writing a letter. So ill expand on the idea; Its a great idea because if your kids want their distance its the safest way to reach out to them and not break any boundaries. But I do recommend hand making a letter because if your kids have a heart. (which I mean im sure they do!) They might not necessarily forgive you for what u did but they will keep that card long after your gone and they'll remember that you always loved them and wish you didnt have the problems you did. ",
            "I read this post and started to read the responses. I quit reading the responses quickly because I thought they might color my response. \n\nI am the only child of an abusive parent and a parent who didn't care about the abuse. I started running away at eleven. Over the years...my parents and I came back into contact but from sixteen on he never spoke to me. Well aside from a one conversation where he asked to meet my children...you see he hated me and all I'd ever done but he wanted to meet them.\n\nMy last conversation with my father was when I was twenty-two(?). When I was fifty-six I found myself dealing with his rapidly declining health. I went to help take care of him in those last days. \n\nI was with him as it seems I always knew I would be. My mother reminded me after he died that I'd always said I would be alone with him where he died. I was. \n\nLet them know. \n\nPlease...give your children a choice. Let them know you accept their choice. ",
            "Sorry for your illness. I think you should do all of your apologizing via individual letters. To ask forgiveness of people in the wake of extremely egregious behavior, always strikes me as offensive-- it shifts yet another burden on the ones who were traumatized. Forgiveness is an internal cost-benefit analysis they will have to weigh on their own. They don't need or want your permission or prompting in order to do that-- they have to find value in it for themselves (and frankly, forgiveness is not always essential or vital to people who have suffered) \n\nYour letter should contain a heartfelt apology and be specific, but avoid dredging up long lists of past hurts. Realize that the only substantive thing you can do at this point is facilitate their continued healing after you are gone, by allowing them to understand how much they mean to you and by offering an acknowledgment of how your actions ruined so much. There is actually something noble in the finality of relinquishing the hope of ever being reconciled to them and focusing on letting them know-- however feebly it is said in writing- that they were loved. ",
            "Send them the letters, definitely. Heed the advice here about how to compose the letters. But don't delay - get writing. This is your chance to apologize sincerely, which I very much believe you must do before you move on from this earthly plane. It is not a waste of time. Even if your children read the letters and still do not contact you, by the time they at the end of their lives they will feel a measure of comfort knowing for sure that at least their father was truly sorry and always loved them, imperfect though he was. \n\n\n\n",
            "I am so sorry about your illness. I know I would want to see my parent in this situation, but it has to be their decision. To not be overbearing, write them heartfelt letters and leave your address and phone number. Also let a nurse or caretaker know Their contact information so they know when the end is almost there. They may change Their minds at that point if they don't when they see your letter. ",
            "Ma'am, \n\nI have been lucky enough to not have someone with NPD in my life, so I have no perspective in that situation. \n\nBut still, your situation and they way you have come to Reddit is something I can relate to. I just wanted to tell you that I admire you (even though we are strangers) for having made the self-growth that you've made to get to a point where you recognize your wrongs, and you want to face the consequences of even trying to reach out. Life is tough, and I can't imagine how you must be feeling. I want you to know that here's a 29 year old woman giving you her support whatever you decide to do. Choose to do the decision you'll be able to die in peace with. Best of luck, and I hope you have the most peaceful passing possible. <3",
            "Keep it simple. Just send them each a note or have someone else contact them to let them know you are in the final stages of cancer and that you want them to know that you are very sorry for hurting them so deeply. \n\nThen the ball is in their court. If they want to visit, they will. \n\nI was low or no contact with both my parents for different reasons and for quite a few years. Even if you have a healthy\nRelationship with your parents there will likely be regrets when they pass away,\nFor things you wished you'd said or done. Give them the opportunity to say or do whatever they need to. ",
            "Just out of curiosity since my dad suffers from NPD, how did you go about recognizing that you had a problem?  Everywhere I read, typically the hardest part about getting someone treated is for them to actually recognize they have a problem which can be impossible.",
            "I am no contact with my parents for the same reasons yours are with you. \n\nThe issues here are a bit of a catch-22 for me. If they reached out to me to tell me they were dying, I would not see them. However, if they left me anything without word of their dying before-hand I would see it as one last attempt at a mind-f*ck after they died and I would greatly resent it. This is the mind-twist narcissistic personalities have us in.\n\nTo be honest, if I got notice of a will reading but no notice of death, or impending death, I would not even go to the reading.\n\nI would take u/deep_sighs advice 100%. Send the letter with apologies and how you have tried to better yourself. Do not tell them you did it for them, no excuses, etc. Say nothing about the inheritance. During the reading of the will I, as the child, would feel better about it if a there was a letter that alleviated the thoughts of it being one more attempted guilt-trip. A letter that tells me, more eloquently than I write here (or maybe not), that the inheritance has nothing to do with my parent's failing at our relationship; my parent is not trying to buy good will after the fact, and it is not a guilt-trip. Definitely do *not* tell them it is to make up for any thing.",
            "Your story echos painfully in my heart. I haven't spoken to my mother in almost two years. I keep expecting my father to contact me and tell me she's finally overdosed or otherwise killed herself. I wouldn't feel sad, but happy isn't the right word. I would feel relieved that the pain is finally over... She struggles with unseen demons. She is extremely narcissistic and abused any substance she could get her hands on. My dad escaped through his career and left me and my siblings to fend for ourselves. The trama and abuse she bestowed upon me during my childhood years was very hard to overcome, the healing is incomplete and will always be incomplete. I will carry her marks to my grave. I will likely never be able to form a lasting relationship. It is a source of unending anguish. I only attract women as fucked up as she is. Through countless hours of therapy I've come to understand that my loving and trying to help these broken women is just a representation of my helplessness. If I could help just one woman, it would make it ok that I couldnt help my mother.\n\n&nbsp;\n\nAnd yet, if she ever did make it to a point where she was on her deathbed and she reached out to me I would go and hold her hand and tell her that I love her nonetheless. Forgiveness is the most beautiful thing in this world. It's unfortunate that so many people are incapable of forgiveness, for others or themselves. \n\nI wouldn't write letters or leave notes. It's too late to say you are sorry. It's too late for you to ask your children for anything, especially forgiveness. A note or letter has too much potential to be taken negatively. Letters would only serve to open old wounds that your children have obviously healed over 25 years. It doesn't mean that you should leave this world with a legacy of pain. Your children deserve to know that the life, of the one who gave them life, is ending. Simply say \"i'm dying\" and leave it in their court. Give them that opportunity to say their last goodbyes, their grievances, or maybe just to say fuck you one last time. But, I wouldn't expect anything from them. I wish I could be there to comfort you as you pass, good luck.",
            "No matter what, you should atleast get a call or letter into them, they deserve to know what's going on. No matter what you're the only mother they ever will have.",
            "Not gonna lie, did tear up a bit then. I cut my mum out about 10 years ago and do not want her to speak to me. I know vaguely wants going on because my sister keeps up to date.\n\nThe only thing I would want from my mother is for her to accept responsibility and say sorry, rather than to continue to say it is our fault (siblings and I) for what she put us through.\n\nI think that's the only olive branch I would respond to to accept the apology for her peace. I would not forgive, though. Too late for forgiveness.\n\nReach out and let them know where you are but you understand if they do not want to acknowledge what you have sent etc etc, just that you hope an apology is accepted and you are happy with what they have done with their life - i presume you have some sort of updates??",
            "Big hugs to you OP.  I have not spoken to my mother for 30 plus years and I too am older than most.  I'm sorry to hear about your health and would like to share, from the other side, I think closure would be best for both of you.  I know how hard it must be, but I feel reaching out would might give you the peace you both need.",
            "Can I ask a question?\n\n( I am no contact with my mother going on 5 years, its not easy and it breaks my heart but her narcissistic abuse is so toxic. I struggle everyday with depression and PTSD as a result of my childhood with her, and she will not change. She does not see she has a problem, she projects it all on me. I've had to accept that. I believe that you've damaged your children similarly because cutting your parents out isn't easy, so most people don't do it unless they really really need to.)\n\nHow did you realize you were wrong? How did you gain self-awareness? The thing about narcissistic personality disorder is that it doesn't change, they people can't see themselves and their behavior. Holding out hope that my mother will change is fruitless and harmful for me, but I can't ever let it go 100%. How did you realize just how wrong you were? And how did you fix yourself?",
            "Damn. Even if a parent did something so bad that it hurt me, I would still at least keep in touch. Anyway, do you have any means of contact with them? ",
            "I would perhaps recommend trying to discuss some of their specific grievances here first (maybe in a new post). Perhaps the community can help you understand your childrens' side and what is the best way to approach them if you're planning to apologize.\n\nGood luck to you. I hope you get a chance to see them again.",
            "Most of the comments here are from children of narcissist parents. I can't relate at all but I do think you should reach out  to them. I hope that they will consider seeing you and maybe can develop a few fond memories to remember you by. I really hope that they will meet with you but you have nothing to lose by trying. I wish you peace and hope you do not suffer.",
            "I tell you, I hadn't seen my father for almost a decade. But when he was on his death bed, and my sister, who had some contact still told me if I wanted to see him before he was gone that I had to come THEN.\n\nI got on a plane from Australia and flew to the US two days later.\n\nMy father was an abusive drug addicted drunk. I didn't go there for him. I went there for me. \n\nNot saying your kids will want to see you. But one might. Or they all might. Not for you.\n\nFor themselves.\n\nThat's all I got.\n\nGood luck. In every way possible.",
            "After all you are their mother. Ask if they would like to see you. You deserve to say sorry and leave the world in peace.",
            "Write a letter to them, even if they won't forgive you now or want to see I'm sure it'll mean a lot to them once you are no longer here.\n\nMy father passed away earlier this year and reading this made me start crying. I wish my dad would have reached out, wish he showed some regret. Instead I'm the one feeling absolutely shit about a person that was awful to me and that I haven't had contact with over five years. I don't regret putting that distance between because it was what was best for me. But it also doesn't seem fair\n\nSorry if this doesn't make any sense, your post really touched me and also not a native English speaker.\nWrite your children letters.",
            "I'm very sorry about your diagnosis and mental illness struggles.  If you have their mailing or email address, I think that is the best route to contact them.  Apologize for everything you have wronged them for and explain your current situation.  Say that you respect their decision of no contact but you would like to see them again if they are open to it.  Do not, I say again do not, guilt or blame them in any way, or confuse an apology with an excuse.  Sending a letter or email leaves it open to them in my opinion.  If you call or show up that could make them immediately defensive and not want to hear what you have to say.  \n\nIf your children prefer not to reconnect with you, you can leave individual letters for each of them with your will.  Use that opportunity to say your peace and ask for their forgiveness.  Good luck with everything!",
            "Honestly, yes, I think you should contact them. As others have suggested, write each one a letter, apologize for your behavior and treatment of them, and explain your health situation. Don't bring up your will or inheritance issues - that will definitely come off like an attempt to bribe or manipulate. And don't use sneaky phrases (like \"I'm sorry if you felt hurt\") that essentially place the blame on them rather than you. \n\nGiving them the option is the best gift you as a parent can offer at this point. If you don't let them know, you're basically removing their agency in the last interaction they'll ever have with you. Whether they get in contact or ignore you, giving them the information is acknowledging their right to make their own decisions.",
            "Wow it looks like some people are projecting their own parent issues on you here.  The top response is really quite excellent though.\n\nAs yet another person in this thread who is estranged from their parents, It never hurts to try and write something heartfelt if it is honest.  You have to be prepared for the reality of receiving nothing in return.  My mother recently emailed me after 10 years of no contact, and I decided not to read it, but I sent her a response saying that I bear her no ill will but I did not read her message, and I am not planning to read her messages in the future.  I'm sure this was quite hurtful for her, which makes me sad.  I do not resent her reaching out after all this time, but I would prefer to invest time into my other relationships or make new ones without this baggage.  I still feel this way knowing that that email she sent me could have been one like what you plan to send.\n\nI don't know if my reaction to receiving something like this helps or hurts, but I hope more information is better.  We can not change the past, but we can make the present us the best we can be. Don't die with regrets.  If this situation pains you, send that letter, and at the very least, you can pass knowing you did all that you could.\n\nBest of luck.",
            "Reach out. If they say \"No\" then you've lost nothing.",
            "This really needs to be cross posted to r/raisedbynarcissists. The individuals that post in that subreddit deal with narcissistic parents on a daily basis and many have gone \"no contact\" for decades.",
            "I don't think there's any harm in reaching out, explaining the situation, and saying you'd like the chance to apologize in person if they're willing but understand if they aren't.  You're dying; you've got nothing to lose.  And if the hurt goes too deep for them to address the past with you in person, at least they'll get a head start on dealing with the emotions that's going to raise for them.",
            "I agree with the letter idea. Make sure it's worded in a way that truly respects their choice not to see you. \n\nI suspect that whether they hear of your illness prior to or after your death, it's going to stir up old feelings. Be prepared for fact that you could be met with a great deal of hatred and that they may not forgive you. \n\nI suggest sending by certified mail to be sure it was received and then leave it alone. \n\nI also think you should either address them as a group (Dear Mark, Pat, and Jane), or else try to write letters that are obviously personal to each one - and not just copied and pasted, which could seem insincere if they compare notes. \n\nFinally, if you want to run a letter by me privately or post to the group as a whole. I'm sure I/we will help as much as possible. ",
            "I had a very strained relationship with my Dad growing up and there were periods where we didn't speak to each other.\n\nA few years ago I got a phone call from my Uncle that my Dad was in hospital in a bad way and that if I wanted to I should come and see him. \n\nThis was on Boxing Day and I went to see him. He'd had cancer for a while and was awful. He couldn't speak and looked terrible.\n\nAlthough my Dad and I had a strained relationship I still wanted to see him and say some things to him. I'm so glad my Uncle contacted him because my Dad wouldn't as he didn't think I would care - which kinda hurt me to hear as no matter what we went through he was still my Dad and deep down I loved him.\n\nHe died the next day and I was glad I got to see him and tell him what I wanted to even though he couldn't speak back to me.\n\nI think you should give your children the opportunity to decide for themselves whether they want to see you, so they don't have any regrets from not having the choice. Don't guilt trip them though.\n\nI echo the poster who said write a letter.\n\nI'm sorry to hear about your cancer and I hope you're not suffering too much.",
            "I say go for it and talk to them. The worst that can happen is that their last memory was the same as when they cut you off, and the best would be that they have a happy memory before you die",
            "Reach out to them.  They can choose not to come, or they may be happy to get closure.  Just let them decide.",
            "Try, you have nothing to lose.",
            "I grew up in a household with a terrifying unpredictable alcoholic father and a very critical mother who did little to protect me from him. \n\n\nThey are both long gone now but it would have meant the world to me had either/both of them apologized for what I went through as a child before they died.  (And they each had time, neither were sudden deaths.)\n\nFrom my perspective and experience, heartfelt letters to your children apologizing would be cathartic and healing for all of you.",
            "tell all of them youre dying and have cancer",
            "If they wanted contact with you they probably would have done something about it in the last 25 years.\n\nI can see that you being close to death might change things though. Last chance for them to get things off their chest or whatever. \n\nIf you wanted to you could send a letter just saying simply that you only have a few months left to live and would like to see them one last time and if they want that too heres how to contact you. \n\nThen leave it at that. I doubt they will take you up on that offer, its been 25 years after all but at least this way they are making an informed decision that its their last chance and all of that.",
            "If I had an estranged relationship with one of my family members, and they were dying, I would at least want to know. I think I would want to at least have the option of reconciliation or at the very least saying goodbye. Depending on the situation, I may not want to, but I think I would be really upset or even feel guilty if I hadn't known or didn't get to say or do anything! \n\n\nI would be hesitant to rehash too much in the letter or try to guilt them into seeing you. Just a simple statement of your condition, an acknowledgment that you made mistakes in the past (and try not to make these acknowledgements excuses). Maybe acknowledge that they are welcome to come see you if they'd like, but you respect their decisions not to. And then the information they need to know about your will and what not. And try to make it handwritten if you're able. I think those mean a lot more these days than an email or a typed letter. ",
            "Send them a letter/ text/ email with the title of this post. \n\nI bet they'll answer.",
            "Of course ask! Good luck and leave them with your love. ",
            "I haven't spoken to my mother almost decade. If this were her I'd like a letter that simply states she is dying without any specific requests or apologies. ",
            "You should keep your promise to them.",
            "Fuck you, you don't deserve to see them again if they unanimously decide to tell you to fuck off.",
            "Yeah man! Do it! Like everyone says, be sincere. You may be surprised, and may have some nice final conversation(s). You never know until you try! It will probably be really good for them to have closure as well.",
            "Let me start by saying that I understand this situation on a smaller scale me, 21(m) My biological father died a couple years back from terminal cancer(lung) and at that time I had not spoken to him in about 5 years or so. He was a very bad man. Very abusive over the years to myself, my siblings, and my mother. I was the only one with the gumption to get out of it. So being a young man that was raised by great man and a fantastic dad (step dad) when I heard the news that  my bio father died from cancer I was completely crushed. Even though for most of my life he was an abusive piece of shit I still was completely destroyed. At the end of the day there was so much I wanted to say to him (good and bad) I always had the hope I could repair the situation and one day have a relationship with him. So despite the fact that I already have a great dad I still had those feelings.  My advice to you OP is no matter what at the end of the day you are still their mother. Yeah the relationship wasn't perfect but what I have learned in my short life so far is that living with regret is one of the worst things you could ever do. Pease reach out to your children, say what you need to say. Tell them you love them. ",
            "Own up to everything. Be very specific. \"I'm sorry I hit you. I was a bad mother.\" Or whatever it may be. Don't justify your actions or try to explain or defend yourself. And don't use martyr language. Be plain and simple. Acknowledge that you were a shitty mother to them and you fucked up and if they choose to contact you, you should be grateful as all hell. \n\nSeeing a therapist during this time may be helpful to prevent you from slipping into old behavior patterns with your children and help get you some closure if they don't decide to lift the no contact. ",
            "I'm not sure what happened between you and your kids but I don't think that is selfish at all. I would contact them right away, asking them to visit. If they have no wish to visit then you should respect that as well. \n\nI hope everything works out and you get to see them one last time.",
            "There's no harm in reaching out. Good luck.. ",
            "Hello. As far as advice on what to do next, I believe that u/deep_sighs has the right idea, so I'm not going to expound on that. I just wanted to talk to you.\n\nI am sorry that you are facing the prospect of your death alone. I am sorry that you have been burdened with mental illness. I am sorry that you have been without your children for 25 years. You have my deepest sympathies, and for what it's worth, as one stranger to another, I would not hesitate to wait with you in your hospital room and hold your hand as you pass beyond.\n\nI am proud of you, as well. It must have taken a lot to respect your children's wishes for so long, and it is a testament to your maturity that you can accept your own responsibility in the situation you find yourself in. Regardless of what your children decide to do, know that at least one person on this earth will not think of you unkindly when you leave the rest of us behind. \n\nNone of us know what happens when we leave, but I hope that now, in the twilight of your life, you can at least look back on some things in your life with fondness. The first time you held your children, maybe, or how it felt when you heard them laugh. The way in which you met the great love of your life, if you've been so fortunate as to have one. The kindness that others have shown you, no matter how rare. Hold on to those thoughts, and express them in turn to those around you in the form of as much kindness and compassion as you can muster. Let them be a shawl around your shoulders, and cast off your regrets. They are far too heavy to be brought along on your next great journey. ",
            "[deleted]",
            "I'm 59 and I would want to hear from a dying parent.  Maybe not when I was closer to 44 if I were in their shoes.  But at 59 I've had time to come to terms with my parents' flaws and many of my own.  So I vote to write them a letter.  ",
            "From a woman who lost her father whom she'd only seen once in about 18 years without getting a chance to say goodbye, don't let them miss the opportunity. The regret I lived with after was very difficult. They may not want that, but at least give them the opportunity. I'll be praying for you and your family. May God be with you. ",
            "Whatever you decide, let them know you love them. ",
            "OP I can understand your trying to give them and yourself some sense of closure before your no longer able to be there for them. I think a letter or a phone call could be helpful to you and them just to see if they're willing to come see you. I believe enough time  has past where regret over past decisions can encourage dialog between you and them. But here's the thing. You Should not mention a Will at all now here's why. If they are willing to see you knowing about your condition then try to just be happy with that. But if they don't want to see you then. I agree with a nurse calling them when your about to expire will be OK. If no one shows up my advice would be to lovingly forgive them  and forgive yourself and let any regret go as holding on to it doesn't help you. Remember your loved and trust that. Because there was a time where they loved you and that's worth holding onto. God bless you.\n",
            "this hurts. I cut my mother off 10 years ago (also suffers a mental illness) and I think im gonna give her a call after reading this. Thank you and I hope you also recieve a phone call as well.",
            "if you've been stubborn your whole life, chances are that they picked up that trait and also want to talk to you but afraid to make the first step out of pride.  \n\nit doesn't hurt to try to talk to them. at least you can make the effort. they also might have some things they'd like to say to you.\n",
            ">narcissistic personality disorder\n\nYou and every other baby boomer. ",
            "You are entitled to be selfish when you are dying. We all make mistakes in life, some are unforgivable, some aren't. I'd reach out. I actually don't agree with the top comment at all. A lot of people cut others out of their lives for extremely petty reasons and then when something tragic happens, they realize how stupid they were being. Or time just passes and it becomes the norm, and it's easier to just continue that way. Now I'm not saying this is your situation, but I wouldn't jump to conclusions and say you were an awful parent. I'd apologize, but don't ask for their forgiveness. Just tell them that you hope they can come to some peace in their life with you. I wish you well and I'm sorry for what you are going through. ",
            "Make a YouTube apology video, make it go viral",
            "Give them the opportunity for closure. Write a heartfelt letter, apologizing...take responsibility for your actions. Let them decide if they want to see you. My brother is refusing to see my Mom, I am not. I believe that most of us deserve a peaceful death and will not let my Mom die with anything less. I hope your kids will come around so all of you can find peace. I wish you well. ",
            "Honestly, something similar to what you've said here *might* be of some comfort to hear.... Perhaps a letter/email that explains that you respect their decision for no contact, that you acknowledge that they had every right to do what they needed to do because you were fighting with your demons, and that ultimately you would like to have an opportunity to apologize to them in person if they'll allow it.\n\n\nPersonally, I wouldn't immediately bring up having terminal cancer because guilt is a tool that many narcissists use and it might help the case to first establish your desire to reconnect because you want to and not because of limited time. That knowledge will become known anyway, but it can take away from the conversation if they perceive that it's only being told to them in order to guilt them into breaking no contact. (Not saying that you would mean it that way, but it's a common problem.) I wish you the best, and hope for all of you that some peace can be found during this time.   \n\n\nETA: Since I'm being downvoted for what's apparently an unpopular opinion, might as well add that my advice comes from someone that has gone no contact and has dealt with the \"are they genuinely remorseful\" feelings and managed to rebuild some kind of relationship. It is possible to reconnect in some instances and in my opinion, a heartfelt attempt to apologize is a good start if you're wanting to try. ",
            "You got a lot of responses but I can't help but wonder if perhaps r/raisedbynarcissists might give you any responses you didn't receive from here. ",
            "Honestly I would just call/email Start with you are dying and have little time and say you wish to see them again before you die. If they dont wish to meet you can still respect their wishes and say good bye.\n\nThis way there is non of the bull shit get straight to the point. apologize in person if they wish to see you other wise leave it in the will.  \n\nNothing to lose at this point anyways. ",
            "see them 1 last time for like 24 hours have fun,and before you die give them some money",
            "Definitely reach out and let them know. For them. I haven't read all of the responses but I've seen firsthand how awful it is for the kids when a parent is gone forever without even an attempt at closure. Not speaking to a parent for years and cutting them out of our life is unfortunate, but unless you did some really serious shit (molestation, murder) they need to at least try to forgive for their own well being. Not saying they will or they should for you. But that shit eats away at you. Post your death they will never get to resolve that. At least offer the chance, for them. ",
            "Maybe show them this post.",
            "OP I think a video would've been the better choice :( I'm sorry. ",
            "Reach out to them. It doesn't matter what caused the situation, if they still act like assholes 25 years later then that is something they will have to live with. ",
            "I recommend talking to a niece or nephew that is close with your children, or some kind of liaison.  Let them know what is happening and that you will. W passing soon.  I would even let them know what your resting place will be, arrangements etc.  It's at the digression of the messenger to give them details as they hear how your kids feel.  If no such contact exists I would recommend writing a letter/e-mail/message on Facebook.  My husband and I have a similar situation with his mother.  I don't know the details but she is a pathological liar and is verbally abusive.  Despite her flaws we will be taking care of everything when she passes.  I don't respect her decisions but I respect her as a person.  Let your kids know that you still respect their decision.  You seem to know where you were at fault.  I would certainly come running to your side if I was aware of that it was the end of your life.  I hope that at least one of them does the same a puts you to rest in an appropriate way. "
        ]
    },
    {
        "post_id": "eigtct",
        "author": "cut_stepfam",
        "title": "UPDATE:My dad died recently and I (24M) don't want to go to my step mom's place cause I'm still grieving",
        "url": "https://www.reddit.com/r/relationships/comments/eigtct/updatemy_dad_died_recently_and_i_24m_dont_want_to/",
        "score": 4798,
        "num_comments": 73,
        "created_utc": 1577872962.0,
        "selftext": "Link to original post:[https://www.reddit.com/r/relationships/comments/ebbyc9/my\\_dad\\_died\\_recently\\_and\\_i\\_24m\\_dont\\_want\\_to\\_go\\_to/](https://www.reddit.com/r/relationships/comments/ebbyc9/my_dad_died_recently_and_i_24m_dont_want_to_go_to/)\n\nOk so I went to my step mom's place for christmas, this was my first time with my step mom and step sister without my dad. It was super hard cause I sat in the seat he always sat on and I just broke down crying. I am forever grateful for both my step sister and step mom cause we all just had a group hug on her couch while I bawled my eyes out. It ended and we didn't open presents but just talked. We had brunch and it went well tho I was holding in tears for the whole thing, this was the first time I could see they actually do care for me and I care for them. They are my family, I didn't stay the night cause I def couldn't do that but I left around 11 at night. This was the first time I ever felt like a full family unit and not the bad kid who fought with my step mom was just wasn't the nicest to my step sister. I thank them so much for not holding a grudge when I went through my teen rebel phase. I hugged them both goodbye and went home, I feel like me giving them a shot and going to my dad's place helped me realize that these are the people who have always been there for me. I mean they were the ones who didn't give up on me when I was a troubled teen and I love them both for it. I talk with my step sister almost daily now even if its just a good morning text and I call my step mom a bit too now.\n\nThank you all for the comments and making me realize that I should go and how it would do wonders to make us all closer it helped!\n\nTL;DR: went to my step mom's place for christmas and we all bonded more than I thought",
        "permalink": "/r/relationships/comments/eigtct/updatemy_dad_died_recently_and_i_24m_dont_want_to/",
        "comments": [
            "Aww I remember this post. I'm glad you went.",
            "We did it kids, we didn't make it worse! I'm proud of us.",
            "Your update had me crying a bit. I am so happy for you that it went well. Have a blessed new year!",
            "What a wise, brave decision that was, I’m so glad you were able to do that and that it turned out to be just the right thing for all of you. \n\nLife is full of wonder and opportunity, good for you for seizing it despite your grief—I have a feeling your father would be very proud of you.",
            "I m glad that you went and happy that u see them as your family  as they do see you.",
            "I'm not crying, you're crying!\n\nI saw your initial post and I know you had some major trepidation about this. Kudos to you for taking this very difficult step...and I'm so happy for you that everything worked out the way it did. Your Dad would be so proud of you. <3",
            "Give yourself room to continue to move through your feelings about this.  I can tell you from personal experience that 30 years later you'll still carry some grief, but it does get better.  \n\nYou must learn to live *with* your feelings, rather than trying to move past them.",
            "If you haven’t yet, I think it would mean a lot to them if you told them how much you appreciate them. Maybe write them each a letter explaining that you realize how you were as a kid and how thankful you are to have them.",
            "You are helping your dad rest in peace.",
            "I'm so happy for you.\n\nFamily is who is there for you, regardless of your blood.\n\nMy sister died 6 months ago and I was so worried I would never see her kids anymore, but her husband has made sure that they stay involved with me and with my parents. I'm so grateful to him for that. He's always going to be family to us.",
            "I'm really sorry for your loss. I lost my dad too less than a month ago and the holidays were really really difficult without him. I'm with you dude.",
            "I am so glad that you had a positive experience with them!  Hugs! The first Christmas after losing a parent is the worst!",
            "Sorry for your loss, also so proud of you for going. My step-mom came into my life when I was 4, my dad and her divorced a few years after they married, but she never went away even when my dad stopped seeing me. She went to every single one of my birthdays, joins us for holidays etc. I'm 27 now, and shes a grandmother to my son. I don't know what I would do without her, I hope you have the same relationship.",
            "This is beautiful. I’m so glad you went. Good luck with your healing going forward, and your Dad would probably be really proud of you. ❤️💕",
            "Proud of you, OP. Humans are a social species and grief is a communal process. I'm sure your dad would be very happy to see the people he loved most spending time together to remember him.",
            "So happy you’re feeling genuine love and support during this hard time. Happiest new year.",
            "They *are* your family. Be their family. You'll do well together. Thanks for sharing this.",
            "Hey you might not see this but wanted to share my friends story. Her dad and mom got divorced when she was in her teens. She never really jelled with her new step mother and step sisters in her teens and early 20s. But sadly a few years later on, her father and her mother died. Her father died first and that brought them closer but her step mother was really there for her when her mother passed (her mother had had health issues for years which meant her and sisters ended up being carers).\n\nNow 10 years the two families are completely blended, they all have kids and her step mother has thrown herself into the grandmother role for her step-grandchildren. It’s really heartwarming to see they have managed to grow that relationship and can all be there for each other. \n\nOf course it’s no replacement for their own parents but having that connection to someone their Dad loved and vice versa has been really helpful to them.",
            "So sorry for your loss. All the best for 2020 !",
            "Way to go. My father was in an ugly motorcycle crash and my family (which is not known for bonding and such) was easily the rock that I held onto through my dad's recovery. We've all kept somewhat close, but even now I know that those are the people that will take care of me when crap hits the fan. \n\nI'm glad you found those people! Don't forget about that. It'll get you through tough times in the future, I'm sure.",
            "You are an incredibly strong person and you did the right thing even though it was difficult. You deserve praise.",
            "I’m glad you went I lost my brother in October and after our parents passed away he always hosted Christmas. I had thought of skipping this year as it was too painful. \n\nI ended up going all of us are grieving but being together made things much better. It will never be the same but it’s not the same for anyone who is missing the person lost. In some ways being together was healing. \n\nAs I struggled with deciding whether or not to go my youngest son said something that reminded me that I had to go. \n\nHe simply said what if this is the last time everyone who is left is together? A reminder that our time is now. \n\nI read your original post and this one I’m glad you went. Who the hell put the onions in here?",
            "Sorry for your loss. Time will heal this pain. Very glad you opened up to your step mom and sister. Sometimes strangers are better than your natural sibblings. Good on you! Happy New year indeed.",
            "I am so proud of you. Good job, giving it a chance.",
            "Wow, I’m so happy for you OP. This is amazing and I’m so proud you had the courage to go to your step moms for Christmas. Happy new year and things will only get better from here on out.",
            "This is lovely. I'm so very happy for you. Love is a beautiful thing.",
            "Well done mate. Well done!",
            "Well done. You did the right thing ❤️",
            "Your dad is so proud of you.",
            "I remember commenting On the original and urging you to go, hoping it would be a bonding experience. I’m so glad you chose to go. Adversity can often create beauty. Much love to you and your family.\n\nAlso, if you haven’t, it may be very sweet to tell them or write them a letter about how you feel.",
            "Damn you, making me cry at work.\nSo happy for you man, take care.",
            "They needed you there as much as you did.",
            "This is a lovely update :) thanks for sharing",
            "Your update brought tears to my eyes.  Peace and love to you and your family. I think this would have made your Dad so happy.",
            "Take all the time you need to grieve i know how you feel my dad passed away in 2017 it took alot out of me",
            "Thank you for this update, this is an important message that could probably benefit a lot of us. Best wishes to you in the new year, and I’m very sorry about your Dad. You’re doing right by him and that’s the most any of us can ever ask of our loved ones.",
            "Aww, I'm so glad you went, not just for you, but for them. As someone who's been widowed, I remember how much people avoided me, and it was really hard not to take that personally.",
            "You did the difficult thing, and you should be proud of yourself. It sounds like it was meaningful for all of you. I bet your father would have been proud of you for going and would be glad to know you are supporting each other. I’m very sorry for your loss and hope you can begin to find peace over the coming years.",
            "[removed]",
            "Wow, stepparent and stepsibling that aren't horrible. Amazing. But good stuff op, I'm glad you got them by your side.",
            "Hang in there op. You got this :)",
            "So glad you went and were able to talk.",
            "I'm happy this ended well, and I'm proud of the courage you had to take this hard step forward OP. Happy New Year, hope this one brings you joy and comfort !",
            "So glad you went!! I can't imagine how hard that is but youre a bad ass",
            "That's beautiful.  Thanks for updating us.  Good luck and condolences.",
            "I'm so glad you did it and that you're connecting with your family more. I feel like your dad would be really happy that you're all yelling care of each other.",
            "I'm so sorry for your loss. Reading about your crying made me cry. I hope you find more moments of peace and healing as 2020 unfolds.",
            "Lots of support to you, I lost my dad in the last few years and its so hard.   Sending love.",
            "I’m so happy for you. I’m so sorry for the loss of your dad, but so glad you have family to grieve with who loved him too.",
            "Fantastic update! Good for you, for facing your fears and going. I hope your healing process is helped along by these bonds.",
            "So sorry for your loss. Hope you always find all the strength you need to keep moving forward. This is beautiful too. I’m amazed by you and your step-mom & step-sister!",
            "So sorry for your loss, but glad things worked out with your family.",
            "You're family sound wonderful! They are good people, good people will never give up on you.",
            "I feel your pain. I hope you find little and big moments of peace and healing with as much time as you need",
            "Good for you. Hang in there.",
            "Glad you went, but I'm sure they would have understood if you weren't ready to go. Your family seems lovely. I'm really sorry for your loss.",
            "I’m proud of you, OP. I’d like to believe your dad is proud of you too. Definitely got a little misty eyed in my apartment reading your update."
        ]
    },
    {
        "post_id": "9kznlb",
        "author": "SugarCoatThis",
        "title": "I [33F] tried breaking up with my boyfriend [33M] in person yesterday and he turned on me. I still haven’t left him",
        "url": "https://www.reddit.com/r/relationships/comments/9kznlb/i_33f_tried_breaking_up_with_my_boyfriend_33m_in/",
        "score": 4807,
        "num_comments": 696,
        "created_utc": 1538559577.0,
        "selftext": "I’m kind of in shock right now. I decided yesterday to end my 9 month relationship...we have been arguing constantly recently and it was turning toxic. It had got to the point where my bf said his mom has overheard our arguments and he said she thinks I treat him like shit. (Im not sure if this is entirely true as his mom has always been absolutely lovely to me) Regardless i was so mortified to hear that, embarrassed and ashamed,  so I said that is a prime example of why we shouldn’t be together. He said it didn’t matter what anyone else thinks and he wanted to work through things. In my mind though things had gone too far and we needed to split.\n\nI told him in person yesterday when I was at his house that we needed to break up , that the arguing was too much and it wasn’t good for either of us . Id brought his belongings that he’d left at mine and I tried to be as nice as possible. He turned on me and said “no way, you’re not doing this to me you fucking idiot. How dare you come round here with the intention of breaking up? Are you mental? Are you sick in the head?” He called me the most disgusting names. \n\nI said I needed to leave and I was sorry but he locked the front door and wouldn’t let me go. It was only us two in the house at the time. I begged for him to let me leave and he wouldn’t. Instead he started to interrogate me about the reasons I wanted to leave. Kept wanting to know if I’d met someone else and was I leaving him for another guy. I couldn’t get to my cell phone as it was in my purse out of reach so I couldn’t call anyone for help. Then he changed tactic and said  we can work things out, backtracked on the thing he said about his mom, said he loved me and didn’t want to break up. In order to keep myself safe I kept him sweet and I agreed to stay together; he had calmed right down by then and I felt relieved. \n\nLong story short I’m still with him. He said he wants to come to see me later and make things up to me. He said he will buy us takeout and we will have a nice evening together. I don’t know why he is so intent on wanting to stay in such an awful relationship. He tells me I’m a complete pain in the ass all the time and how he’s had enough of me so why the hell wont he just let me go.\n\nTDLR: tried to break up with my boyfriend but he turned nasty ",
        "permalink": "/r/relationships/comments/9kznlb/i_33f_tried_breaking_up_with_my_boyfriend_33m_in/",
        "comments": [
            ">I still haven’t left him\n\n>Long story short I’m still with him.\n\nLet's adjust your perception here.\n\nYou did break up with him.\n\nIn response, he imprisoned you in his house.\n\nYou had to play along for your safety.\n\nThat doesn't mean you didn't break up with him. You did. He didn't take no for an answer. That doesn't mean **anything**. You're not still with him. You merely pretended like you were still with him because you were taken hostage. You don't need his approval to break up with him, break ups don't work that way.\n\nYou are in an abusive relationship, and your judgement is extremely clouded. You should find a way to cut all contact with him **immediately** and find a secure place until all this gets resolved. You may need to get a restraining order against him and have what happened in record. You are in danger. Maybe you don't realize but you are in *real* danger. Locking the doors to keep you from leaving the house is **not** normal behaviour. It is abusive, and it is a crime. You were imprisoned against your will. Despite what you might have been led to believe, this is not something done out of \"love\". This is not something a sane partner does to their other half. You need to leave immediately. Don't go to his house ever again, and don't let him into your house either. **Under no circumstances you can be alone with him ever again.** You can get imprisoned (by him, again), beaten, raped or worse. Thousands of women get harmed or killed each year by people just like your ex. Please understand the severity of the situation and please take the appropriate measures to protect yourself.",
            "You're in an abusive relationship. That is why the relationship has felt bad and toxic. This is why he wants to stay with you even thought he calls you terrible names. \n\nA common feature of abusive relationships is the abuser escalates when the victim tries to leave the relationship. He escalated yesterday - he held you hostage in his home and abused you until you agreed to stay with him. \n\nThis is really concerning behaviour. You need to end this relationship and get away from him. Please reach out to your friends and family for support, and read the book 'Why Does He Do That?' by Lundy Bancroft. He might escalate further into threats of violence and stalking when he realises you are serious about not being with him and you need to have your friends/family there for you. ",
            "You don't need his permission to break up. You're in a abusive relationship. He held you hostage and locked you in his house. That is illegal. You've given him his stuff back. You have nothing else tying you together. Break up with him by text and block his number. Don't have him try and convince you to meet up with him. You don't owe him anything. If you do, he will try this bs again.",
            "Firstly I just want to say thank you so much to everyone who has taken the time to reply and express their concern for me. I am beyond grateful. \n\nSo I’ve done it. He actually called me to ask what time he should come round and I told him it was over. He tried to plead with me, he said he loved me and that we can make it work but I just said no, it’s over and put the phone down. I blocked him on everything and have now changed my cell phone number. \n\nI’m staying with my best friend for the rest of the week to be safe.\n\nDespite all of this I do feel embarrassed and ashamed about how the relationship panned out. There was a lot of arguing and I do feel like I was a psycho girlfriend - I’m just re reading all the comments on here and trying to drill it into myself that this was abusive/he was gaslighting me but I think I need to see a therapist to really understand that for myself.\n\nThanks again guys x",
            "Dump him by text or phone, lock your doors and dump his stuff outside. If he comes over and kicks off,  call the police. Do not go to his again!",
            "Ah, the false imprisonment. I do not remember that fondly. Mine was for something like 10 hours. Terrifying, stupefying. It does not get better. \n\nYou can never be alone with him EVER again. Ever. He is not coming over today. You must call the police when he tries. You must be vigilant. No matter what argument he makes--talking circles around you, talking you out of it, blaming you, shaming you--you can NEVER go back or be alone with him again. I would also add never be anywhere NEAR him again. Please. I'm sitting here on the other end of this story because of grit, police, friends, G-d and blind luck. He is not going to be nice this one time. You don't need his frigging permission to leave. A relationship, a house or a room. Stay gone. Please. ",
            "I don’t think it’s a good idea for you to allow him to come to your house.  He escalated yesterday and he may hurt you today.  Tell him no and call the police if he shows up.  You told him that you want to break up, stand behind that decision and protect yourself.  ",
            ">Long story short I’m still with him. \n\nNo you’re not. Refuse to see him ever again. Do not allow him into your home. If he persists outside the door, call the police. Text him right now and say, “I do not want to see you again. I am deleting you from all platforms and devices.” Then do it, and never respond to any communication from him ever again.",
            "Your EX held you hostage against your will. This is tantamount to kidnapping. Let that sink in for a moment.\n\nThis is a violent act that shows a complete lack of respect for you as a human being.\n\nYou need to never see or talk to him again.\n\n---\n\nDoes he have keys to your apartments/home? If so, call a locksmith and have them rekeyed.\n\nThen tell your EX by phone of email that you will never see him again. Put his stuff into a box and have a courier service pick them up and take them to him.\n\nIf he shows up at your door, tell him to go away. DO NOT OPEN THE DOOR. If he does not leave, just call the cops. (Tell them that he kept you against your will the last time you saw him.)\n\n---\n\nYour BF is an abuser. Plain and simple. Things will escalate.",
            "I’m still trying to figure out how Reddit works, not sure if I should start a new update thread or carry on posting here.\n\nI just wanted to say you guys were totally right...he has since tried to contact me. He’s set up a new email address (I blocked his usual one) and just sent a message saying: CALL ME\n\nI have no intention of replying to that or any further communication from him. I’m focusing on keeping safe and well away from him. I’ve also told all my friends and family so they are fully aware of the situation. \n",
            "As others have said, this has the hallmarks of an abusive relationship. I'm sorry you're having to go through you're! His emotional manipulation (claiming his mother thinks you're cruel, for example, and probably many other, smaller things you haven't noticed) and not 'letting' you break up with him are pretty classic. Also gaslighting you by saying you must be 'crazy' to leave and that sort of thing. You need to get out of that, it's not healthy and could get very, very bad. Also, try to tell people who he might use to get close to you (friends, family) so they don't inadvertently help him, too, I've had friends keep it close to their chests and then their parents try to get them back together because the abuser acts like it's some rocky period and they're nice to everyone else, so no one guesses how awful they are. ",
            "Breakups don't have to be mutual,if one person is done, the relationship is done.\n\nPlease don't meet him again. Maybe stay with family or friends for some time and text him that it really is over. Don't engage after that. You don't need his permission! \n",
            "Locking the door and not allowing you to leave is illegal.   \n\nNot just a red flag, illegal.  \n\nHe's not a keeper.  It's okay to change your licks if he has a key. It's okay to tell him not to come over. It's okay to call the police if he comes over without your permission.  \n\nIt's okay",
            "You’re not still together. You broke up. He became abusive and dangerous. You said whatever you needed to say to defuse the situation and get home safe. Now that you are safe, you need to send him a break up text. Honestly, I would call the non-emergency dispatch number for your area and talk to patrol about what happened. You need to start a paper trail with this shitbag. Call the police ASAP if he ever shows up again.",
            ">Long story short I’m still with him.\n\nNo you’re not.\n\nHe just exhibited signs of abuse when you tried to leave. That doesn’t mean you’re still together. Whatever you said to him “ok we will try again”, was in response to **being physically trapped by an abuser.**\n\nSay that out loud to yourself: “my ex boyfriend locked me in his home, trapped me, and verbally abused me for hours until inrelented and agreed to stay with him.”\n\nGet. The. Fuck. Out. Now.",
            "Ghost this asshole. You're a person with independent thought, not a locked up pet. You broke up with him so block his number and call the police if he shows his mug",
            "I know I’m not saying anything new but when I was in your position I needed to read every comment even if they were repetitive for them to sink in. \n\nHe is abusive. \n\nHe will escalate. \n\nYou don’t owe him anything.\n\nI spent a long time going back and forth with my ex because I felt like our problems were my fault too. I knew the relationship should end for both our sakes and I felt so guilty I couldn’t fix it. I loved him and I didn’t want to hurt him so I tried to be nice. And he took as much advantage of it as he could. \n\nYou don’t need to be nice. You need to be OUT. cut him off. Do it now.",
            "he kidnapped you when you tried to leave him. Call the police. NOW\n\n&#x200B;",
            "As everyone is telling you, this is abuse.  You must not let him come over.  I was this situation with my ex fiance and when i tried again to break things off, he pinned me to the wall by my throat.  Do not make the mistake i made by seeing him in person again.\n\nBreak up via text, tell him never to contact you again and that if he tries you will call the police.  Then, DO NOT BE HOME TONIGHT.  He will most likely come looking for you and if he does you are in serious danger.  Go stay somewhere else for at least a few days and tell everyone not to tell him where you are.  Document everything you can and go to police as soon as you feel threatened.",
            "Lundy Bancrofts' Why does he Do That pdf online is good for unpacking this shit.  He kept you prisoner, that's not okay.  He's not safe to meet in person, break up via electronic communications and keep people in the loop about what is happening.",
            "I would not let that man in your house, or otherwise be alone with him. He essentially held you hostage for breaking up with him. If he comes over, I would not even open the door. \n \nAnd make no mistake - you are broken up. He doesn't get to decide that for you. Make that clear when you contact him again. ",
            "> I don’t know why he is so intent on wanting to stay in such an awful relationship.\n\nBECAUSE THAT KIND OF RELATIONSHIP IS WHAT HE WANTS. Abusing you feels good to him. It feels pleasurable. ",
            "Text him: “I broke up with you yesterday. You refused to let me leave and I was afraid for my safety so I went along with you, but my decision stands. Do not contact me again. Anything else of yours will be left at your mom’s. If you come to my home I’ll call the police without hesitation.” \n\nAnd follow through. ",
            "This guy is scary. You should go to the police station and file a report that your ex imprisoned you physically in his home for one hour when you ended the relationship. This might be something you really don't want to do right now, but it could be a tremendous help to you down the line because: \n\n* What this guy did was illegal (false imprisonment).\n\n* This guy is extremely scary and dangerous, and you should be wary of how willing he is to hurt you once he knows the relationship is over-over.\n\n* Getting what he did documented now will help you establish a pattern if he tries to stalk you, or if you otherwise end up needing a restraining order.\n\n**Don't** downplay what happened. **Don't** tell yourself, \"well, I don't want to make a big deal about it. He wouldn't actually hurt me.\" He's already shown you what he's capable of, and you need to proceed treating him as a threat to your safety.",
            "This is exactly how my abusive ex reponded when I ended things. \n\nHe has a severe anxious attachment style and lots of narcissistic issues. He is a manipulative abuser who can’t handle rejection. My ex is still harassing my family, 1.5 years after cutting off contact. \n\nI beg you to just stay away. Don’t be like me, letting myself be manipulated by someone like this for years because I loved them. Love is never a good reason to tolerate abuse. \n\nYou will see this situation clearly when you are months out of it. ",
            "You're out of his house now. Leave him via text, tell him he's no longer welcomed to see you, talk to you, or show up at you're house and you will call the police if he does show up. You need to hard stop this. He can't strong arm you into a relationship unless to some extent you allow it. Getting out of that house was important but now that you're out put up the wall. ",
            "Um, he held you against your will and insisted on controlling you.\n\nYou're not an equal partner in this relationship, in his eyes. He will try anything to control you.\n\nYou need to NOT see him again. Period. Lock your door (change the locks if he has a key!) and stay with a friend. Text him and say 'It's over, do not contact me again' then block his number. Get a camera set up at your house IF you have enough time, or see if a friend can keep an eye on it from afar and call the cops if it looks like he's going to destroy things or try and break in.\n\nHe is dangerous. You cannot see him again because he will not hesitate to turn violent. Again, he sees you as more of a pet, not a person. It is not safe to be alone with him ever again.\n\nAlso, tell his mom what happened. Maybe she will help to keep an eye on him. But after you tell her, cut contact with her. He might use her to try and lure you back in touch with him.",
            "Please do not see him today. Take your safety seriously. There are hotlines that can help you develop a plan, and which can give you best practices. Do not be afraid to start reporting things and keeping track - even if the police don't do something with a certain incident, the total record can be very helpful if you end up needing to get a restraining order or something similar.",
            "Tell your friends what is going on (especially roommates) that you are going to break up with him today again via text. Tell him over text you are breaking up with him and that he scared you yesterday when he wouldn’t let you leave, to not contact you again, to not come over. If i were you i would also text his mom after him and be like hi i just wanted to let you know me and X are breaking up and i just wanted to let you know he is not taking it well and scared me yesterday. Maybe she can help keep him in check. If he threatens you in a any way contact the police and let your friends know. You’re doing the right thing and you’ll get through this. you deserve to feel loved and safe with a partner",
            "FYI, Locking the door and not allowing you to leave is considered kidnapping, and that is a felony. ",
            "\\> Long story short I’m still with him.\n\n&#x200B;\n\nNo. Long story short, you told him whatever you had to tell him so you could go back to your own home safely.\n\n&#x200B;\n\nRelationships need two people to want to be in them; if one person wants out, that's enough to dissolve the relationship. So just be broken up with him. What is he going to do, keep you physically trapped so that you cannot physically leave his side ? The answer to that is clearly yes, since he already did this. However 1) he can keep your body trapped, but he can't trap your mind - and you're only in a romantic relationship with him if \\*you think\\* you are in a romantic relationship with him, and 2) seriously though this guy is dangerous, make the plans you need to survive breaking up with him: talk to a domestic violence hotline, never let yourself be alone with him again, bring friends with you whenever you have to physically interact with him for any reason, break up with him via email, change your locks, block him everywhere, look up how to get a restraining order in case he escalates, etc etc.",
            "Cut all contact and get a restraining order immediately. He held you hostage, which is a criminal offense. Save yourself. ",
            "Hun he is abusive, and you two aren’t living together. I don’t recommend ghosting because it’s mean but with him? You’ve dropped off all of his belongings, just silently fade away. He’s very controlling and manipulative and he sounds like he won’t hesitate to start hitting you in the future if things go south.  (Been there...) \nYou’ve only been there for 9 months, please don’t give this asshole anymore of your time. To leave abusive relationships it’s best to not tell them, and just leave. \n\nMake sure your friends and family know about this. I made that mistake and when I left, my ex told such twisted stories about me to my friends and I lost all of them except for one. He might be vengeful and try to go to your house once you leave, so please keep all doors locked and have at least one other person home with you at all times. \n\nYou can do this! I’ve done it before, and it was hard at first but the feeling I got when I was at my own home surrounded by my animals was the best feeling I’ve ever had. When I left it felt like a weight was lifted off my shoulders and for the first time in awhile, I actually smiled. Walking away from abuse is hard, but it’s worth it in the end once you realize all the shit he’s done to you mentally.",
            "FYI locking the door and not letting you leave is a Felony called False Imprisonment.  ",
            "You text him saying you already broke up and that you are sticking with that and that it’s non negotiable. Tell him that locking you in the house was illegal and terrifying. (That way if he shows the text to people trying to say you’re mean, he has to admit he’s crazy, lol) Keep the doors locked. Tell him he isn’t allowed to come by.\n\nIf he comes by and freaks out, text him again saying you will call the cops if he doesn’t leave. Then call the cops if he doesn’t leave.",
            "> He said he wants to come to see me later and make things up to me.  \n\nTell him very clearly over text to not come see you and to leave you alone from now on.  \n\nIf he does show up, yell through the door for him to go away.  Do not open the door.\n\nIf he refuses to leave, call the police.  \n\n&#x200B;",
            "Reading this brought flashbacks to when I was in a very similar situation 3-4 years ago. My ex would prevent me from leaving by locking all the doors and holding me down while crying and begging for me to stay. When I tried to get out through the window, he blocked it as well. He would then start threatening suicide and would grab a pair of scissors and threaten that he’d kill himself if I left. I cried a lot and asked why he would do these things and his dumb abusive ass response was “I love you” and shit like “I’m nothing without you”. It took me months to leave him and I contemplated suicide a lot of times during those last few months. \n\nI wanted to leave so badly and when I thought I had successfully dumped him, he would start hitting himself in front of me and even ended up giving himself a black eye. I stayed out of fear he would hurt himself more. \n\nMy mental health drained and I felt so alone. I hit my friends up and they all took me out and I started to see how much I had to get away from him and be around people that made me feel good not trapped and on edge. I dumped him. Ignored his calls and texts. He’d show up every night drunk and bothering my family. He apologized profusely and I told him to get out. After awhile, he stopped. We remained acquaintances and recently I’ve deleted him and blocked him because he’s always under the assumption that we’d get back together one day. \n\nDelusional people stay delusional. After you leave him (please do, if you stay you’re jeopardizing your mental health) make sure to keep it no contact at all. Get all the proof you can of his abuse whether it be screenshots or recording your conversation. He’s going to gaslight you and your friends/family. After he realizes how done you are with his shit, he will try to apologize and try to get on your good side as a form of manipulating you to be with him again. If that doesn’t work he’s probably going to cuss you out then eventually ask to remain friends and stalk every aspect of your life. \n\nBlock him immediately. Don’t even give him a chance. ",
            "I see a lot of people saying call the police if he tries to come over.\n\nI disagree. You need to go to the police NOW because keeping you from leaving is illegal. Do not wait.\n\nIf he has a key to your place, have the locks changed. You have already broken up with him. Block his number, block him on social media, and keep yourself safe. Make sure your friends and family know the relationship has ended and they are not to give him any information about you, your location, your work schedule, etc.\n\nBe safe. Best wishes. ",
            "When he prevented you from leaving he committed false imprisonment. \n\nI would report this to the police and never, ever choose to see him in person again. \n\nYour life is in danger from this man. ",
            "As far as I'm concerned you broke up with him already. You should file a police report about him locking you in his house. That's an actual crime. \n\nChange your locks, notify your work and building management if you live in an apartment, tell any friends you may have in common. Don't let this piece of filth in to your life in any way. It's just going to get worse, whether through stalking or physical abuse he WILL escalate. He does not see you as a person, he considers you his property do not allow him to warp your perspective. Stalkers and abusive partners do escalate to  the point where they kill their victim. Do not give him the chance. Protect yourself. ",
            "I was horrified by your story, and like all the other commenters here - breaking up only requires one of the two parties to be effective. And hence he kidnapped you. Have you thought about filing a report at the police?",
            "When he inevitable shows up at your front door, video record the entire interaction from behind a locked door and make it clear that you never want to see him again. Start building a paper trail of evidence and get a restraining order. He sounds mental, volatile, and aggressive. Things will only escalate from here.",
            "I agree with breaking up via text. If he calls, DO NOT answer. If you want proof don't block his number so you have all messages and possibly voicemails of nhim flipping out, calling you names, and other toxic/abusive behavior.  \n\n\nIf you can BEFORE you text him call and arrange to stay at a friend's or family member's house just in case he decides that coming over is a bright idea. Even if its afterwards, try to get as much distance between you two as possible.\n\n&#x200B;\n\nBest of luck to you, and don't give up on leaving him. You're right. You need to break up and he can't force you to stay. Relationships take two WILLING participants and you are no longer willing.",
            "Holy shit, you need to go to the police for advice/help.  Along with getting security cameras. ",
            "[deleted]",
            "run away pretty bird. if he is planning to come to yours, you can leave his stuff outside yours and wait for him to arrive and collect it. or you can leave it outside right before he arrives and escape to your friends for a day or two... ",
            "Absolutely do not let this guy in your house! You've given him his belongings, there is absolutely no reason to have anything further to do with him. Lock your doors, block his number, and call the cops if he shows up outside your house and won't leave!",
            "I was in a relationship similar to this earlier his year. It’s hard to leave him when he makes you feel like you have to be together, or that he needs you to survive. \nHim locking you in the house is abuse. Take this as a sign and go before it gets worse. \nIf that’s how he treats you when you want to leave him, do not meet up with him again it’s not safe.\nYou do not owe him anymore explanations you’ve told him you want to break things off, do it and don’t look back. It’ll be the best decision you ever make even if you can’t see it now.",
            "You are 100% in an abusive relationship. Always trust your gut instinct. \n\nI was in a relationship where things started to go south real quick. I was accused of all kinds of weird things, but he wouldn't \"let me\" break up with him. I had to call the police to get him to leave me alone while I packed my stuff and left.\n\nYou don't owe him anything. He will try to gaslight you and make you feel like you're the bad one and that you're being irrational and mean. You're not. Listen to your gut. Break up with him and keep him as far away as possible. ",
            "You don't live together. You gave him his stuff.\n\nStop talking to him after one last text: \"It's over. Please don't contact me again.\"If he comes by yours, call the police. Be extremely careful on your way to work and back or running errands.\n\nOp, he held you against his will!",
            "So you wanted to break up with him before he turned into a nasty, controlling psycho who wouldn't let you leave . . . and now you're considering staying with him?\n\nHe was bad before, and now he's revealed that he is even worse than you thought. \n\nYou already did the polite thing by breaking up with him in person, but he wouldn't accept that. Now, you just need to stay as far away from him as possible. Don't meet him in person. If he tries to meet up, just send him a text saying \"We're not together any more. We won't be meeting up.\"",
            "You need to file a police report about the incident and try to get a restraining order (or whatever the equivalent is where you live).  He committed a crime by locking you in the house so don't let the police brush you off.",
            "He doesn’t have to agree to end the relationship for it to end. Block him, don’t answer the door, and call the police if you have to.  ",
            ">  he locked the front door and wouldn’t let me go. \n\nThat's call the police territory, False imprisonment is some level of felony in most places.\n\n> Long story short I’m still with him.\n\nOnly if you continue to say so. Just because he rejected your breaking up with him doesn't mean it didn't happen.",
            "It is over. Breakups are unilateral, if one person wants out, the relationship is over. All he did was show you exactly how right you were to break up with him.\n\nText him to tell him you're done with him. Do not go to his place or let him come to yours. In fact, don't even meet him in public without a friend to back you up.",
            "You are NOT still \"with\" him. He's trying to hold you hostage. Document his behavior. Notify trusted individuals if you can. Text him that you don't want to see him again so there's concreteevidence that you don't want the relationship to continue. Do NOT let him into your home or on your property. If he shows up, call the police. It may sound like an overreaction, but filing a police report sooner rather than later may be helpful if he escalates to something more serious. These are all very troubling behaviors and your safety and well-being is your number one priority. There's too many horror stories and tragedies out there already. Please take care of yourself.",
            "Do not let him come over!!! If he shows up, call the police. Maybe have a friend come over tonight in case he tries to pull anything before the police show up. ",
            "Don't feel bad about the fact that you \"agreed\" to stay together yesterday. It doesn't count, because he didn't listen to you when you broke up with him, and he threatened and bullied you to agree to stay. As soon as someone turns abusive, you no longer owe him a face-to-face conversation.\n\n&#x200B;\n\nI would suggest texting him one final time to say that you ARE breaking up with him and that you want him to leave you alone.  You don't want any more contact and he is NOT velcome to your place ever.",
            "Hey op I was in a similar situation with my ex, though not quite as intense. She and I had been dating for a month, I felt like we were incompatible and wanted to break up. \n\nI knew she would make it difficult in person so I tried over the phone. She wasn’t having that and said if I wanted to break up I had to come do it in person. That I had owed her that.\n\nWhat I wish I had done is say that “I don’t need your permission to end a relationship, it’s over”. What I ended up doing was driving over to her place, and getting talked out of it. \n\nThis situation repeated roughly once a year. I would try to break up with her because I was unhappy in the relationship, she would talk me out of it. Usually she would say that I don’t really want to break up, I’m just angry and when I get angry I just try to completely pull away from the situation. This went on for 6 years.\n\nFinally, a little over a year ago I got up the courage to do it for real. I told myself “I’m not going to end up married to this woman and spend the rest of my life unhappy just because she throws a fit.” So I wrote a note that firmly and clearly stated that I’m out, I do not want to work on it, and there’s nothing to discuss because it’s done. I sat there while she read it. It was really hard but finally with that note we were broken up. \n\nIt wasn’t all bad for those years. I loved her and would totally be friends if she also wanted that but I just couldn’t be in that relationship anymore. We’ve both moved on. \n\nThis turned into a long story about me but what I’m saying is you don’t owe him anything, and breaking up is literally the only thing in a relationship that you don’t need the other person’s consent to do. Tell him you’re done over email or text, and don’t listen to him if he says he doesn’t accept it. It’s difficult but you have to picture where you want yourself to be in the future. \n\nAlso be sure to save any conversations you have with him just in case you need to get a restraining order. ",
            "No no no no NO. Oh my GOD. He held you *HOSTAGE*. I'm shocked you didn't call the POLICE. \n\nYou need to break up with him. This is SO toxic and abusive. If you don't think you can do it over the phone then do it in text. Text is very final. You send it and unless you answer back there's no discussion. If you really need to even just prewrite some phrases to copy/paste. Like \"this isn't a discussion. It's over.\" so you don't even have to read his responses if you don't want to. And if you think you need support to not backtrack, have a friend with you while you do it. \n\nDon't go to his house again without an escort like a trusted *male* friend or family member, or a police officer. If he refuses to give you your things back, tell him you'll call the police to get it back.\n\nYou're totally and completely in the right here. Don't let him gaslight you. You're correct for wanting to leave. You've done nothing wrong in this so far from what you've said. You can do this. ",
            "This is scary, but I can't understand why you say you are staying with him.\n\nBreak up with him over the phone, not in person.  If he comes to your house don't open the door and call the police.  If he starts following you or harassing you then call the police.  If he doesn't immediately stop then call the police or court and ask what you need to do to get a restraining order.   Don't let him escalate to violence - which is where this is headed if you don't cut him off now.\n\nIf for any reason you find yourself in a place where he has locked you in again then go to the bathroom, or another room where you can lock the door.  Lock the door and call 911 immediately.",
            "You're not with him anymore. You broke up with him. He is abusive and acting in a very scary controlling way. Do not EVER be alone with him again. \n\nDon't respond to his messages, don't reply to his texts. Let your work know that your ex boyfriend is acting in a scary way and they are not to let him in the building or talk to him on the phone. \n\nChange the locks if he ever had a key. \n\nKeeping you from leaving when you try is illegal. Yelling and calling you names is abusive. If he tracks you down, go somewhere where there are people and call 911. \n\nDo. Not. Ever. Agree. To. Meet. Him. Not alone, not in a year, not with someone else, not in a public place, never, ever, ever. If he has some of your stuff, he can ship it. \n\nHe is showing a lot of warning signs of someone who will hurt their partner rather than let them leave. \n\nIf you feel in over your head please contact a hotline or organization that helps women escaping domestic abuse. They will help you learn how to be safe. ",
            "And change your locks NOW if he's EVER had possession of a key.  Even if he gave it back. Psychopaths like this make copies.  RUN. FAR. I have been on the similar end of this and it not only gets much much worse, it will break you and turn you into someone that you won't even recognize or like anymore. At least you're able to recognize the toxicity of it now.  If you stay, you won't be able to recognize all of the inappropriate ways he treats you. ",
            "Gtfo. Block number. File restraining order if necessary . Get a gun if you think he will try to hurt you.",
            "What the hell? Text him to leave you alone. Call the cops if he shows up. This is insane behavior. ",
            "Document any texts, save voicemails, document everything. Contact the police every time he exhibits abusive or illegal behavior to build a case for a restraining order. \n\nOP do you feel safe at your own place? Can you change your locks and stay somewhere else for a while if you don’t feel safe?\n\nReddit, should OP file a police report for being held against her will?",
            "I tried to break up with my ex for 8 years. Every year, I would initiate the breakup conversation, but I always fall back to him. That’s 8 years of me being stuck in an abusive relationship. 8 years of opportunities gone. Stand strong to what you believe in. It’s not worth it holding on. ",
            "Damn this sounds eerily similar to my last relationship. I always wondered “why is he trying hard to win me back when our relationship is so toxic”? Turns out that is a textbook abusive cycle, according to the counselor I go to.\n\nBeware that breakups with these sorts of people are never clean. Do not guilt yourself over it not ending civilly. You need to cut him out as wholly and gracefully as possible. No contact. No way for him to weasel back in. Be careful, OP",
            "Get away from him! The minute he trapped you it should have been over. ",
            "Please don’t let him in your house! This is abuse. Looking you in his house and not letting you leave is kidnapping. Your instincts are right that this is a terrible toxic relationship and you need to leave. \n\nAbusers make it very hard to leave, and they are very good at manipulating the situation. See if you can stay with some friends or family for a while, or at least find someone who can stay with you. Text him and let him know that the relationship is over and that he is not welcome at your home. \n\nIf you have anything at his place, consider it the cost of the break up. It is not worth going back for. ",
            "Everyone has the right to end a relationship. It isn’t consensus-driven. \n\nYour safety was threatened and you are officially in this relationship under duress. \n\nThe police need to be involved asap as well as a counsellor. You were unlawfully confined. You may be at risk for developing ptsd symptoms even if you feel like you’ve rationalized it all now. ",
            "He restrained you against your will (locked you in) while berating and humiliating you ( terrible names).  That is standard intro abusive behaviour.  if you don't cut contact immediately you may find yourself telling someone that you 'fell into the door' or 'he hit me but I deserved it' pretty soon.  Please don't let that happen to you.",
            "RUN. You know you gotta get out. Can you block him on everything and stay at your parents or friends house for a few days?",
            "I 100% agree with everyone that he is an abuser and it will get worse if you stay. It will. \n\nMy concern is about you though. He's manipulating your self views by making you think anything is your fault, like you see things wrong, you're being paranoid, etc. Once he has control of how you view the world, that's when you're really in danger. \n\nA story illustrating what I mean:\nA friend of a friend was dating a city councilman. They had a toxic relationship, similar to how you described yours. Recently, he turned on her after a night out with friends. He beat her up so badly that she required surgery to put plates her head and to repair her face! \n\nLuckily, she was on the phone with my friend when the fight began. She thought she'd hung up, but hadn't, so my friend heard it. She and her husband raced over there and pulled her out of there before he killed her. \n\nThen all of her friends rallied at every council meeting to get him fired. Eventually, it worked and he stepped down. But during the trial process, she went back to him! His mother went to her explaining how he didn't mean it, he needed her, and how this was so hard on him. She bought it. She's now convinced herself that all relationships have problems and they're both at fault. They're \"working it out.\" WTF? \n\nThe longer you stay, the more your view of reality, sense of self, and understanding of healthy relationships erodes. Please leave now and get counseling. You are valuable and worth so much more than this! ",
            "I've broken up with a toxic abusive person like this, and I agree with everyone telling you to refuse to see him and just text him your final thoughts. \n\n&#x200B;\n\nHowever, I need to add that you very much need to go no contact with this person immediately and stick to your guns on it no matter what. When you send your final goodbye text, let him know you will not be acknowledging ANY communications he chooses to try with you. Make sure he knows you do not want to have literally any kind of contact then block him on every single platform that you can. \n\n&#x200B;\n\nFurthermore, DO NOT be tempted to unblock just to see if he has been contacting you. He WILL experience an \"extinction burst\" when you cut contact. This kind of person will do or say anything to get you to engage again. They may threaten suicide, threaten to ruin your life and your reputation, and may threaten you physically, etc. The most important thing you can do right now is to literally never talk to him again. He may hover for a very very long time (Mine did for 3 years because I couldn't completely cut contact at first bc our situations).\n\n&#x200B;\n\nI'm sorry, OP. This sucks a lot. Keep yourself safe, and block this MF-ER. ",
            "He has proven that he has the potential to become violent when he doesn't get his way, (forcing you to stay in a situation when yoy want to leave) he involves other people in your relationship, (his mom thinks you treat him like shit) he called you a laundry list of horrible names, and he's coerced you into doing something you absolutely do not want to do. This is the beginnings of an abusive relationship id I've ever seen one, and you need to get our ASAP.\n\nMaybe call your local PD and give them a heads up that you've already tried to end it with this extremely abusive person and he lost it.\n\nI am so sorry you're going through this, but as hard as it is you need to leave immediately.",
            "Something similar happened to me once, but it wasn't as severe. I tried to break up with my boyfriend of 2 years in person. twice. both times I left still in a relationship with him some how. All the crying and begging just prevented me from being stern. A month later I ended up having to break up with him officially by phone, just like other people are saying. In your case, I would say that is definitely your safest bet considering how violent and nasty he became.",
            "Fuck this guy, he needs a good ass whipping. \n\nYour life is yours, he does not get to tell you if you can or can not break up. Do you have any guy friends that can go with you? I have found that a few big mean looking hairy guys behind you opens up a fast door to honest communication plus gives you many witnesses to what transpires.\n\nGood Luck and GTFO of this relationship. If you are in central CA you have access to one big hairy mean looking guy right here if you need me.",
            ">I don’t know why he is so intent on wanting to stay in such an awful relationship. He tells me I’m a complete pain in the ass all the time and how he’s had enough of me so why the hell wont he just let me go.\n\nYou think about it this way because you're a normal person. He doesn't think about it that way because he's not a normal person. It's extremely common for abusers to insist that their victims are bad people who make them miserable, yet also insist that the victim can't leave the relationship. That's because the \"You're a bad person who makes me miserable\" stuff isn't an objective statement on the reality of the relationship; it's a statement made to make you feel bad about yourself. You feeling bad about yourself means you're less likely to leave (if you're such a bad girlfriend, who else would want to date you? thus you're stuck with the abuser) and you feel like you need to go out of your way to be nicer to your abuser (after all, you've been such a bad girlfriend to him...) \n\nThe takeaway is that you shouldn't listen to anything this guy says. He's not objective or rational or speaking in good faith. He's trying to manipulate you and everything he says and does is in service of that. ",
            "I had an experience like this when I was 18; I ended a two-year relationship (I *had* found someone else who wasn't abusive and shitty) in person, in public, and he also did the thing where he turned on me, and when I got home (with my new, non-abusive partner) his car was sitting in front of my house and he was *begging* my mom to \"talk some sense into\" me. This was after blowing my phone up with so many cruel and then desperately sweet text messages my phone died on the walk home. This guy was three years older than me, by the way.\n\nMy point is, abusive people like that will do evil, desperate, and downright illegal things to keep you around. If you can break up over text or maybe even a phone call, *please* do. Keep it concise, firm, and non-negotiable. If he tries to argue, don't engage with him. It's a trap. Do everything you can to go completely NC after that.\n\nMy ex still finds ways to text me occasionally to send me disjointed rants about how he wasn't abusive, which should tell you just how dedicated to fucking with your life these people can be, and staying with someone like that is a *very bad idea.* The best possible thing you can do here is just Cut. Him. Off.",
            "The great thing about breaking up is that only one person has to agree to it. He cannot say no. \n\nDo not see him again. Do not let him in your home. Do not accept his phone calls. Do not text him. \n\nPlease call the police if he continues to harass you. ",
            "No girl, you need to get out. That behaviour is textbook emotional abuse and gaslighting. I lost YEARS of my life to someone who did that. If he had any amount of respect for you, he would realize that the situation was toxic and he wouldn’t have guilt tripped and manipulated you into staying with him. Listen to that voice inside you telling you that you’re worth more. The longer you stay with him, the more he will stifle that voice and you will lose touch with it. The longer you stay, the harder it will be to leave so get out while you can. Do it in a situation where he can’t physically block you or prevent you from leaving. Just fucking get out now. ",
            "You’re not still together - you broke up with him. 🙄",
            "Do not let him come over. I repeat DO NOT LET HIM COME OVER. The way he's acting is indicative of some possible violent lashing out, and he could have intentions to hurt you. Tell him you'll mail his stuff, and change your locks. If he needs to be at your house for any reason, tell him the police will be there presiding. Stay strong ",
            "STOP.  DO NOT let him come see you later.  Call the police and get a restraining order. This guy is dangerous!",
            "A break up only requires one person to decide.  He’s abusive.  Preventing you from leaving is  kidnapping and it’s incredibly illegal.  Please report it to the police if you feel capable of doing so.  Do not see him, never be alone with him again, let him know that if he contacts you again you will call the police. \n\nBe safe and take care of yourself. You do not deserve to be treated like this. ",
            "YOU DON'T NEED HIS PERMISSION TO BREAK UP.",
            "You send the following text:\n\n\"X: I just wanted to make it clear, as I said yesterday when I went to your house before you imprisoned and threatened me with violence, that this relationship is absolutely over. I want no further contact with you in any capacity, and you are to never approach me  again. Due to the gravity of the things that transpired yesterday, I've gone and filed a report with the police. If you don't honour my wish to be left alone, I will call them without a second thought, as you have already threathened me with violence.\n\nAnd then you block him from everywhere. Then you go down to the police station and file a report about what happened yesterday. It may or may not be enough for a restraining order, but you need a paper trail in case he escalates and you need to get one in the future.\n\nAnd if you live alone, it's a good idea to spend a few days at a friend's couch, or have someone stay with you.\n\nAnd then truly, never, and for any reason, allow yourself to be reeled back in. You reached the right conclusion when you decided to leave him, and now he's shown you you weren't mistaken.\n\nThis is not a game and you are in real danger if you keep engaging with this person.",
            "I was in a similar situation when I tried to break up with a guy a few years ago. He blocked the doorway and wouldn't let me leave until we talked it out. I got really stressed and even though he was a gentle giant, I was scared because I couldnt push past him. That small memory has stuck with me years later and I still get very panic-stricken when someone tries to block my way. Even though he wasn't touching me I still felt so angry and uncomfortable.",
            "Ghost him. Don’t talk to him, don’t answer calls, don’t answer the door if he comes to your house no matter what he says, go absolutely no contact. You tried to break up with him, he proved himself to be dangerous, and there’s no reason to put yourself in danger again. \n\nCall the police and notify them so that they have it on record in case he pulls something else later (and it’s likely that he’s going to). Ask them about a restraining order. Do NOT block his number, don’t answer him, but save every single text he sends you so you can file a harassment claim and have stronger defense when something happens. It’ll be easier to file the restraining order as well if you have proof he’s making unwanted, repeated contact. I’d also recommend for the next few weeks staying at a cheap hotel, AirBnB, or with a friend/family he wouldn’t know a lot about/suspect. ",
            "Send him a message that the relationship is over and his behavior makes you feel unsafe so your blocking him and need him to stay out of your life otherwise you will contact the authorities. (Be harsh. No words like \" I wish this could have been different \" )\n\nSince it sounds like he will escalate , Don't block his email, and if you use fb messenger his messages will still come through and then you'll have more evidence for a longer restraining order , but block him from everything else.\n\nIf he has a key to your place tell the landlord so that it can be changed and so I'd you have security he can be on a not allowed in list (or posters ect).\n\n If you have any pets, see if someone can watch them for a bit and and also try to stay at a friend's house. The amount of times I've seen and heard of men break into houses or apartments is insane . \n\nAlso Goodluck, you deserve better ! And I'm sorry this is happening to you",
            "Call the police. Yes, really.",
            "You are broken up whether he admits it or not. Ghost him. Change your locks. Stay with a friend or family for a few days to make sure he doesn’t turn violent. He is abusive, violent, and frightening. Stay far, far away. You’ve brought him his things and told him it’s over so you do not owe him any more communication ever ever ever for any reason at all. \n\nIt takes 2 willing participants to be in a relationship, but only one person to end it. Doesn’t matter how much he insists otherwise, you have already broken things off and that is that. \n\n",
            "What is actually keeping you from leaving if you don't live in the same house? If he comes around, lock your doors and call the police  as you've already asked him to leave.\n\nYou should've called the police the minute you left his home as he had no right to keep you there by force, that's called kidnapping.",
            "You absolutely DID break up with him. You are now single. Lock your door, and don't let him in when he comes over for takeout.",
            ">  he locked the front door and wouldn’t let me go. \n> I begged for him to let me leave and he wouldn’t.\n\nThat's called kidnapping (or false imprisonment). \n\nIt's a crime. \n\nYou understand that, right?",
            "You're too old for this shit. This is what 21 year olds do. You're damn near mid 30's. You know what you need to do.",
            "[deleted]",
            "Out of all of the replies on here this is the one I keep thinking about: \n\n*I'm going to go out on a limb here and say you two are terrible to one another and are not right for eachnother and after a while plenty of people will lash out just in retaliation. Abusive relationships are often not one-sided, people seem to want to extract their pound of flesh from one another. Just because she is nice to you doesn't mean she thinks the two of you are good for one another.* \n\nThis is how I feel about myself and the relationship: that I must be abusive as well and my bf lashed out because he has had enough of me and my bullshit",
            "I agree with everyone here. Also is there anyone you can call to have them stay with you for a day or two? He isn’t going to go away quietly. Call 911 if you need to. Have a friend/family stay with you if you can. Block his number cut off all communication. Tell everyone you know that you broke up with him. ",
            "Tell him it’s over, over the phone. Then go away for a few days. He’s not safe to be around.",
            "Dear Miss, please never be around this horrible being alone ever again. You said youre gonna do it by phone, perfect! If you have any material things over there, you CAN get the police to escort you or with at least TWO friends. \n\nBut he's so close to edge of violence with you. Be super cautious! Im sorry this is happening to you :-(.",
            "Hi-I'm around your age. I was married to an abuser-I left him.\n\nDo not go near him. Tell him that you wish him the best, that you have ended the relationship, and that you do not wish to remain in contact with him. The end. If there is any rage texting, calling, or visits--you call the police. People like this become unhinged very quickly. You made your decision-stand behind it. Intuition is real. ",
            "If he did not let you leave (coerced you to stay until you did what he wanted) I'm pretty sure that's a crime.\n\nIf it's as bad as it sounds in your post, my first stop would be to the police to see if I could get an order of protection or something like it.\n\nThis guy is an abusive psycho and if I were you, I would not feel safe being around him by myself.",
            "Get out now! The next time he does this, and he will, you may not come out alive. Save yourself and leave him.",
            "Sever all contact with him and if he keeps trying to talk to you get the police involved, he can’t make you stay in the relationship",
            "You’re not still with him!  You gave him the message it’s his fault for not listening.  Disgusting behaviour on his part!\nSend him a message clearly stating again it’s over and say you will call the police if he contacts you again.  Then block him everywhere.  Do NOT enter into any form of conversation.  If he turns up at your house call the police.  That is what I had to do.",
            "Please do not let him into your house. He manipulated the situation and prevented you from leaving his place, if he vomes over to your place theres no telling what he can do. Id be concerned about him possibly doing something so having a friend around today or being prepared to call the cops couldn't hurt either.",
            "Do not let this guy into your house, call him on the phone tell him you thought it over and you still want to break up. If he dares to drive to your house or where you work tell him you will call the police to have him removed. There is no reason you should be forced into staying with this person. ",
            "Tell your closest friend or family member, and make sure they are with you in case he shows up. This is deeply unstable, abusive behavior and you have every right to be afraid. The gaslighting (telling you his mom thinks you're bad news, and calling you an idiot) is just the beginning. Please be sure you're not alone with him again anytime soon, and prepare to keep him out of your life as much as possible. Leave your things behind if you have to, don't give him any more reason to be around you alone going forward.",
            "DO NOT stay with this person. This is an abusive relationship. He called you demeaning things and held you against your will. PLEASE do not let him see you. Block all contact and call the police if necessary ",
            "Call a local women's abuse hotline or women's shelter. They will have resources and can give you advice on how to proceed. You don't have to break up with him again (meaning you don't have to speak with him *ever again*) You don't owe him an in-person breakup and after the way he's behaved, you don't owe him any kind of communication. You might appease him with a few texts while you work on a safety plan, but figure out what supports are available in your area, they will help you get in touch with police, etc. ",
            "This reads like he might hurt you. I would break it off via message, not in person, and avoid all contact. Pursue a restraining order if he continues to contact you. He locked you in his house and refused to let you leave. Even if he never has been violent before that’s a form of kidnapping and a HUGE red flag. If I was you I would consider staying somewhere else for a while to be safe. ",
            "Sorry to hear this, sounds like a very challenging situation. I would say it's time for you to introspect and find out why you would be attracted to this guy in the first place, and why you would stay after he used the threat of force to keep you in the house. This isn't putting \"blame\" on you, or even him, but the idea is to get out of this relationship having learned something so you don't repeat the same mistakes with the next guy.",
            "You are broken up. Your ex boyfriend's refusal to accept that and his attempts at bullying you into staying with him don't change that. You told him you're through with the relationship, so you're done. A break up is probably the one single thing in a relationship that doesn't require the other party's consent or acceptance.\n\nHis outburst is not only unforgiveably, it is concerning. He not only insulted and disrespected you, he threatened and intimidated you to a point where you felt you couldn't safely leave his apartment whenever you wanted. Obviously I don't think you should even consider meeting him, but if you do, be cautious do not meet him at home or anywhere private. If you meet him, do so in public with other people around.\n\nAs for the why? Look at what he said. He said: \"How dare you come here with the intention of leaving me.\". He has more than clearly expressed that he thinks he is entitled to you and your love. Him backtracking on his mom supposedly complaining about you at the very least indicates that that was an attempt at controlling you by making you feel unworthy of him, but that he, the most Gracious and Merciful that ever lived, wants dear old you still. That's a classic and frankly unoriginal emotional abuse tactic. \n\n1. Partner A actively undermines Partner B's confidence and self worth \n2. Partner A makes Partner B believe that he's doing Partner B a favor by staying with him \n3. Partner B attempts to leave Partner A and Partner A loses his shit because how dare unworthy partner B even think he is a position to leave such a grand prize as partner A. \n\nReally not much mistery there once you allow yourself to take what he says and what he does at face value, instead of trying to make excuses for him by thinking he was emotional/hurt/lost his temper.",
            "You don't need his permission to break up, you just declare it and you are done.  That is what you did yesterday.\n\n\nI would highly recommend informing friends of his irrational behavior (essentially keeping you hostage) and your concerns about it.   \n\n\nYou can google \"domestic abuse hotline <your city>\" and/or \"domestic abuse resources <your city>\".   Given how he behaved I think that is a great reason to tap some experts into helping you navigate this (it looks like there are some great comments here already but these peeps deal with this type of crazy daily).   At a minimum they will advise you on precautions to take but likely will help you understand things like restraining orders.\n\n\nPlease do not take his actions from yesterday lightly.  They show he has no respect for you and is willing to get angry when things don't go his way.  He might think he loves you and \"would never hurt you\" but you don't call people you love disgusting names do you?",
            "You let him come around, do not let him inside. You should have someone with you to keep you safe (they can be in another room or whatever) but you tell him \"We are breaking up. Do not contact me ever again. There is no further discussion. Take care.\" and lock your door. Call the police if he stays too long.",
            "I know it's hard, but you really need to stand up for yourself. Invite a good friend over to hang out in the other room if you invite him over. He seems unstable and kinda dangerous! Please be careful. Do not feel bad about calling the police if you feel he might be violent or overly aggressive toward you. \n\nI was stalked by a man that didn't want me to leave him. I regret not getting a restraining order when I had the opportunity. Please be careful!",
            "This sounds like my relationship with my ex. Maybe not as bad..but very toxic abusive relationship. It wasn’t just him, both of us were not good for each other. Great first year or so but became so terrible..get out ASAP. I know it’s very hard but the end result of not being in that is worth it. ",
            "Don’t let him come over. He knows you want to end it, and, as far as i’m concerned, if one person wants to break up you’re broken up. ",
            "I broke up with someone who scared me and I knew it would need to be in writing and I should offer no explanation or things to debate. I stated I would not be answering any of his messages. He proceeded to message me and come by my house that night. He hid when he knocked on the window of the front door, I had been sitting right there and I didn’t see him. Any normal visitor would have been visible. I called some guy friends to come over and they called the police. Scary stuff should be documented. They ended up patrolling my house that night and used my phone to call him. They told him to never contact me again or they would get him for harassment and trespassing. I never heard from him again but he did try to contact my brother. I was embarrassed by the situation but I was glad to not be dealing with it on my own. Get the police involved, they don’t care, they are here to deal with this stuff. You shouldn’t have to. ",
            "Dont let him guilt trip you. \n\nIf it was love, it wouldnt be this hard. Trust me, i know. \n\nMy ex tried cutting himself with the broken pieces of his favourite watch that he smashed dramatically when i tried ending things with him. He made himself out to be so pathetic and weak without me. 2-3 weeks later he was being arrested for attacking me in our shared apartment.\n\nIf he loved you, he'd let you go. If he cared about anything else than himself, he'd listen, learn, and let you go, not turn on you. \n\nDo. Not. Let. That. Boy. Control. Your. Decisions. Ever. (or anyone for that matter)",
            "I would say block him on everything, but this may also trigger him. Write down somewhere about his obsessive behavior so that if anything happens there’s proof. You probably don’t have enough to get a restraining order but I would still look into it. The behavior you described is totally abusive and you need to remove yourself from that situation ASAP.",
            "You are in an abusive relationship. This may be difficult to see from the inside but it's painfully obvious from the outside. Bear in mind that it doesn't need to be violent to be abusive. I mean he locked you in his house so you couldn't leave. That's illegal and creepy as fuck to be honest.\n\nSimple solution. Dump him. You don't need his permission to dump him. That's not how it works.\n\nGiven his extremely concerning behaviour you don't even need to be polite about it. \n\nText him to break up, dump his shit out the window for him to collect. If he get violent or refuses to leave, call the police.\n",
            "This is downright scary and dangerous. You have the right intentions and you’re not crazy; you need to break up. I’d suggest making it clear to him one last time that you’re done and then taking any and all safety measures I could think of: changing locks, blocking his number, maybe carrying pepper spray, consider a restraining order if he doesn’t stop, and most importantly, TELL SOMEONE WHAT’S GOING ON! Good Luck,\nOP. ",
            "I very much echo what others have said; call the police, explain what happened, get a restraining order. You broke up with him; him refusing to believe you and trying to bully you into staying doesn't mean you're still together, it just means that he is abusive and dangerous. Please take steps to protect yourself ASAP, including a police report, restraining order, and locking down all your passwords. Tell everyone you know that you are broken up and that he may try getting information from them to get to you. Consider getting a camera for your front door, they are very inexpensive now. If you can have a friend stay with you, or if you can stay with a friend or family for a few days, that would be a very good idea.",
            "For this type of relationship, I think if u end it abruptly, no way the guy will go for it. Instead he might go for a rage. Maybe keeping distance from him steps by steps before ending it for good?",
            "I've been in the same situation and honestly, you have to break up with him via text and block him on all channels that he can access you (Phone, Facebook, Instagram, Gmail, anything he can contact you with). Also, stay safe in public places because he'll try to eek his way back into your life by 'bumping into you'. My ex told me I was sick in the head because I broke up with him, too. When we got back together, things escalated to physical and I blocked him, but he turned up at a gig I was playing and tried to suggest nothing happened. My heart goes out to you. \n\nAfter you've broken up with him, make sure you take really good care of yourself and do not let any doubt enter your mind. He probably gaslit you the entire relationship so you're apt to doubt your decision, your mental health, everything. It took me a long time to remember who I was after that relationship, but it gets better. \n\nStay safe, hun. ",
            "That's a very abusive relationship.  Break up with him.  Be strong.  If he traps you like that again, dial up the 911 operator and report him for kidnapping.  This guy is an asshole.  ",
            "If you say it’s done, it’s done. Tell him not to come over because you are broken up and if he shows, you’re calling the police. Make sure you have a friend or family member nearby to witness anything that might happen. \n\nThis is an abusive relationship. Lying, gaslighting and verbal abuse all count as abuse. It may only be a matter of time before he gets physical. You need to get away. ",
            "Honestly call the police if he does it again and have a guy friend or multiple female friends over when he comes. He is crazy.",
            "No this is abuse. You don’t actually need any reason at all to break up, but he’s giving you about a million.\n\nDon’t get into an argument/discussion about this. Tell him by text that it’s done and then filter all future messages (or change your number). I’d recommend blocking but he sounds like the type to get different numbers to call you on.\n\nAnd maybe have a big male friend stay with you for a few days or you stay elsewhere because locking you in is very very problematic. Suggests he’d happily do worse to you physically\nGet out, text him hit done and maybe even call\nThe non emergency police for a record of this for when he comes back (because he almost certainly will) ",
            "Please get out. I tried to end my abusive relationship after six months. It took 14 years to get rid. If he tells you he will kill himself if you leave, he’s either lying or unbalanced. If he tells you he will tell all of your friends/relatives XYZ thing, he’s either lying or unbalanced. At the end of the day, they’ll figure out pretty quickly that he’s the one with the problem; not you. Those are the two things that I was told constantly. Those stupid, pointless threats as well as constant gaslighting were my every day. It won’t get easier, but it won’t get better. Please get out. You can do this. x",
            "Get out of that relationship. ASAP. ",
            "If you want it to be over, as long as you're not living together, then it's over.  It doesn't matter what you had to say to get out of there.  He doesn't get a say in this.  I went through this same crap with an abusive, psycho ex.\n\n- Do not meet with him.  Do not talk with him.\n- Tell whomever you live with the situation, that he's not welcome, and to call the police if they see him.  \n- If he has a key then change the locks.  \n- If you live in an apartment building, let your building manager/doorman know what he looks like and that he's not welcome.  \n- Once you've taken care of those things, text him and let him know that the relationship is over and that if he attempts any further contact, the police will be called. Any of his property left at your place will be mailed to him.  Keep it brief and to the point.  Don't engage with him.  Once you've sent the text, block him.\n- Take photos of anything you do mail to him so that you can't be accused of theft later.  Get a tracking number.\n- If he does show up, don't hesitate on following through with calling the authorities.  Stress that he is abusive and that you're afraid for your safety.  If officers do have to come out, insist on filing a police report as this will help you if you need to file for a restraining order in the future.\n\n",
            "Never be alone with him again.  Tell as many trusted people you can about this.  Start running, don't look back.",
            "Call the police, file a report for his actions yesterday. Call the police if he comes to your house. He is not welcome there. Call a friend or family member to stay with you or let you stay with them for a few days. Call his mother, and tell her what happened, and that he's behaving erratically, that the police are involved, and that you wish to have no more contact with him. Let your work/school know what's going on. Do not reply to any communication from him. Do not contact him in any way. Call the police if he approaches you, and if he messages you with threats. \n\n\n\n\n\n\nYour life may be in danger. Please, please act like it. ",
            "I'm sorry you're going through this but I doesn't take two people to end a relationship. It only takes one. You broke up with him. Period. You only are still with him if you want to be. You don't need him to be in agreement with the breakup...",
            "PLEASE be safe. I'm legitimately concerned for you after reading that. Don't let him near you if possible. He's so close to snapping, if he hasn't already.",
            "Never go inside the other person's house to break up.  This would have never happened in a public place.  If you wanted some privacy or let him down \"easy\", I would have just stood outside the door.  Please be safe!",
            "Well, in person failed. Time to take extreme measures. Shoot him a text. Do not answer the door later. Tell him youre blocking him everything and do it immediately. If he shows up banging on your door, call the police",
            "Go to the police, tell them exactly what happened and please tell everyone you know that is close to you what happened too and that you need help to end the relationship. I would send a msg too him saying that the relationship it's ended and cut him of all contact too. Your ex is a danger person! Be careful! ",
            "So what do you want us to do here? What do you want us to tell you? Shouldn't it just be common sense that you don't keep people like this abusive monster in your life? He gets violent you need to call the police! That's what they're there for. Cut this piece of shit off already and get out. Why are you even listening to a fucking thing he says at this point? Get, OUT.",
            "You are in an abusive relationship. And now you’re not. You broke up with him. Stick to it. He doesn’t have to agree. It’s not a court case you have to win. \n\n\nCall his mother or a friend of his and ask them to come pick up his stuff. Block him on everything and let him you will call the cops if he harasses you. ",
            "You’ve already broken up with him. You’re not ‘still with him’ just because he says so. \n\nI recommend telling him this via text so you have a record of communications. Make it clear that the relationship is done and you don’t want to see him or ‘talk things through’. Personally I think you should report him to police for holding you against your will. Make sure your family, friends and neighbours know that he’s being abusive so nobody should give him ANY information about you.  \n\nDon’t feel embarrassed or try to hide his behaviour - it reflects badly on him, not you. Report every single threat to the police.\n\nPlease refuse to ever be alone with him again. Refuse to see him at all. \n\nWould it be possible to spend a few days away from your home? Somewhere with people around? ",
            "If you're now safely away from him, have your locks changed if he has your key and then break up with him by text or e-mail, not in person. Don't let him back into your place when he comes by and if he won't leave, call the police. Stay safe, OP. ",
            "You need to just leave the relationship and ignore him.  Shoot him a short txt explaining that you still feel that you need to leave the relationship. Don’t forget you can call the cops when he proceeds to bother you or if he pose’s as a threat. Hope it works out for you",
            "Please stay with a friend tonight. \n\nYou have effectively ended the relationship. I would send a text stating this. “As confirmed last night, I cannot continue this relationship. It is best that we not talk. I ask that you please not visit, text or call. I wish you all the best.”\n\nHe’s an abuser and he physically kept you from leaving. You need to be very careful and you have to end it and stay with a friend for at least a few days. ",
            "Get out right now. Change your number. Change your passwords. Block him on all social mediaHave a friend stay at your place for a while.\n\nHad the exact same thing happen to me when I tried to leave an ex. I can't give too much information as hes still on reddit but message me. You will likely recieve threats after he understands you're not coming back. Record these and get a restraining order. They usually will not act on these threats but you need to get out ASAP op.",
            "I was in this exact scenario. I only managed to get out once I established a support system for myself. I told anyone who I trusted what was going on and made sure they'd have my back if my ex showed up. He did escalate things once I made it clear I didn't want to be with him, so please watch your back. ",
            "No. You broke up with him yesterday. Just because he's not accepting it doesn't make it less true. Send him a short text, \"We are no longer in a relationship, never contact me again.\" Then block him on all fronts. He is abusive and he held you captive when you tried to do it in person. \n\n\n\n\nRead \"The Gift of Fear\" by Gavin de Becker and *never* be alone with that man again. Don't ever let him into your space, not your physical or mental space. ",
            "Please get out of this as soon as you can. Run and never look back. It only gets worse. ",
            "I agree, please be safe and stay away from him. Keep us posted, OP",
            "Do you have a roommate? If so advise them of what’s going on. If not change your locks and please do not open the door when he comes over. Block him on all social media sites and turn location services off on those sites. Change up your routine. Let someone you trust at work know that he shouldn’t be given any access to you or info on you. If necessary see if you can file an order of protection so he can’t come within so many feet of you. \n\nMost importantly do not stay with him. ",
            "If he ever stops you from leaving again, or refuses to leave, call the police. End of list.\n\nOh...... and definitely dump him.",
            "You don't need his or anyone's permission to end the relationship. Nor are you responsible for him \"letting you go\". \n\nHe showed you who he really was when you broke up with him. Locking you in, insulting you, and extreme anger aren't just warning signs that he might be abusive, they are abuse. \n\nText him that you meant it when you said it was over and that based on his response you do not want to see or speak to him again. Then block him. After that make sure you have friends and family who know what's going on. If he ignores your request to not contact you and shows up and your house or elsewhere tell him to leave and if he does not either leave yourself or call the police. ",
            "Omg ghost his ass asap. Don't respond to any texts or calls, and don't answer the door if he comes over. Call the police if he stalks you or makes you concerned for your safety at any point.",
            "Because YOU were dumping him, not the other way around. It’s rejection and he needs to be in control. Stick to your guns and get out now. It’ll only get more toxic. Be strong. It’s hard but in a couple months you’ll be so glad and be moving on :) good luck ",
            "He wants control.  You need to end this NOW.  Would bet good money if you stay it will get physical.",
            "Please provide an update when you can. He is showing all the signs of someone who would not take no for answer and it is very concerning.",
            "HELL NO!! He held you at his home against your will! He is lying about other people saying that you’re treating him badly to try to manipulate you into allowing him to control you. It takes two willing people to be in a relationship, and you do not want to be in one. Tell him that you have thought a lot about it, and you still want to break up. Sorry for any confusion, but you don’t want to be in a relationship with him, and you do not want to see him again. \n\nBe prepared for things to go badly. If he shows up at your house, call the police and tell them you’ve broken up with your boyfriend m, asked him to leave you alone, and he is at your house refusing to leave. ",
            "You don't need his permission to end the relationship and you don't need to do it in person. Based on his behavior yesterday, I don't recommend seeing him in person again. If he tries to come by, don't let him in. Look out for yourself and stay safe.",
            "You do not. need. permission. to break up. Just because he says \"no we're not breaking up\" doesn't make that fact. He doesn't control you, your heart, or your mind. If he insists the relationship exists, that's his delusion. Block him. Refuse to see him. Call the police. He is abusing you. Your ex boyfriend is in la la land. ",
            "The reason he won’t let go is you are his supply. He feeds off of tearing you down and is slowly working on killing your confidence so that you never leave him. The best thing you can do for yourself is cut contact, and file for a restraining or protective order immediately. \n\nRecord everything. Save every text, record phone calls and what was said. You’ll need it for court. \n\nMake no mistake, this is a predatory individual. He prevented you from leaving when you wanted to go, what’s to stop him from physically hurting and overcoming you next time? If he’s capable of essentially holding you hostage then don’t underestimate this predator. \n\nPlease take care of yourself, save yourself from a world of pain. ",
            "Do you have friends or family in the area who you can reach out to? You shouldn’t be alone right now while this (potentially dangerous) guy is acting this way. Holding someone hostage because they want to break up is not normal behaviour, no matter how much you love them. He is abusive and you need to do everything you can to cut off contact with him. ",
            "Tell him you are broken up and if he shows up at your house you'll be calling the police.  He doesn't get to not let you break up.",
            "Go to the police, tell them about what happened and what he did, mostly the part about locking you in. I don't know where you live, but that is a crime in many countries and any incidents you report to the police will help if he ever becomes even more threatening.",
            "do not ever see him again, he sounds like he came from an abusive background and he is doing the same thing to you.  Put all of his things outside your home, lock the door.  if he shows up call the police.  get out now!",
            "You need to get out of this situation as soon as possible for your safety and mental health.   It doesn't matter if you have ever been \"nasty\" to him back in the heat of an argument in the past.  \n\nThere is absolutely no excuse for physical control of a person EVER.  Make no mistake, that is a bodily threat to your person.\n\nYou need to break it off in any way that is not in person.  If you think in person would be best, bring a friend or your dad, brother, etc... anyone who will keep you safe.\n\nI would seek therapy as soon as possible.  Specifically someone who specializes in domestic abuse.  Everything you mentioned points to that.  Please please please take care of yourself in this way before you seek out another relationship. ",
            "Did you leave his stuff there and take your stuff with you? If so - send him 1 text saying that you're broken up - not to contact you - not to come over your house. AND BLOCK HIM from everything. Never speak to him again.  If he comes to your house, call the cops.\n\n&#x200B;",
            "You have gotten some excellent advice here. Please do not see him again. Leaving a relationship is the time when a woman’s life is most in danger from domestic violence. Please tell your friends, family, and neighbors, and be very aware of your surroundings at all times.",
            "Verbal abuse and false imprisonment are actions that say, \"Yes, you should break up with me.\"",
            ">Dump him by text or phone, lock your doors and dump his stuff outside. If he comes over and kicks off, call the police. Do not go to his again!\n\nFile a report with the police beforehand because that psycho held you captive inside his home for an hour. Even if you don't press charges,  you will have a police report on record and a text message on record. ",
            "As someone who works at a shelter for women fleeing violence, this is just the beginning of a bad situation. His need for control over you and your relationship will only get worse and the cycle will continue until you don't allow it to anymore. Break up with him over text, leave his things outside and tell him he can come get them. If he tries to contact you after, keep messages and do not respond. Good luck and make sure he knows you are not afraid to call the police if he does not leave you alone.",
            "Huh? Dude.. you don't stay with someone because they physically won't let you leave...",
            "Agree with the comments on here. You don’t “try” to break up with someone. You do it. You don’t need his permission to end the relationship. You tried to do the decent thing and do it in person. He acted like a psycho, so he doesn’t deserve decent now. Text him and tell him it’s over. Have someone else drop off his belongings for you. Block him on your phone, emails, social media, etc. \nWhatever you do, don’t stay in a relationship with this toxic person. Especially someone who trapped you in a house and refused to let you leave. This is NOT ok. You are doing the right thing. End it whether he likes it or not and move on. You deserve a relationship that is respectful and not toxic like this one clearly is. ",
            "Dump this asshole and block him on everything. Lock your doors etc.",
            "I would make a statement with the police saying you are a little worried about your well being and then tell your EX that you did so as a deterrent. ",
            "Get a restraining order or at least file SOMETHING with the police right now.... if you have the means to talk to a lawyer do so so that there is evidence on your side from this point on. I very much doubt he'll go quietly into the sunset. Inform your family of how he is and maybe go stay with a friend that he doesnt know for a few days ",
            "The most important thing here is your physical safety. He obviously has a temper so if you feel like he might cross the line, bring a friend with you or go back when you know you're not alone with him, or don't go at all and just cut him out completely and never go back. That decision is going to be based on the nuances of your relationship and isn't something a stranger on the internet should tell you how to do. I went through this exact same situation (the freak out, the accusations, and locked door), except his mom heard us fighting, and came up and begged me not to leave her son... It was mortifying and I backed down and ended up staying with him for another couple weeks. The one thing I had to keep telling myself was that NO ONE was in charge of what I decide to do and it wasn't about him \"letting me go\" it was about be getting the fuck out. The day after giving myself that pep-talk, I sat outside his house in my car for probably an hour or so trying to muster up the energy to do it all over again, and I did. While he ranted and screamed I packed up any stuff I had at his house that seemed important (anything else could be replaced and wasn't worth staying there longer than I had to) and put it in my backpack. While doing this, I made sure the door to his room stayed open and unlocked (I managed this because when he yelled at me, he liked to yell right in my face meaning he had to face me, so I kept my back to the door so that if I felt unsafe needed to get out, I could turn around and run before he could get to the door) and after I'd packed everything of mine I  walked out without looking back. It takes a lot of strength to leave someone even if they're terribly and toxic, which doesn't make sense when you say it out loud, but thats the reality sometimes. You need to do this for your own well-being.  You NEED to break up with him. Speaking from experience, someone who talks to you that way and then frantically backtracks and traps you against your will is incredibly unstable and it will get worse if you stay. ",
            "Do not see him again! The fact that he locked his door and wouldn’t let you leave freaks me out. Maybe I’ve watched too many episodes of Forensic Files, but this guy sounds like he could be dangerous. ",
            "You don't need him to agree to break up with you. You did what you needed to do to get out of that situation. \n\nYou did break up with him, now you need to follow through. Send him a text saying you've broken up with him, you're not going to discuss it further.  Tell him you don't want to hear from him in any way, and he is NOT welcome to come to your home to see you. If he has stuff at your place, put it in a box and put it on the porch. \n\nLock your doors this evening, if he shows up and does anything more than pick up the box and walk away, **call the police.** This is what they're there for. \n\nDO NOT try and use reason to talk to him. You cannot use reason with someone who's unreasonable. If you try and talk this out with him, he will do exactly what he did last night, it's a tactic abusers use called DARVO - Deny, Attack, Reverse Victim/Offender (in other words they make themselves into the victim and you the one doing them wrong).\n\nYou don't need to have any reason to break up with him other than you're not happy. Period. Breaking up doesn't take 2 people, it just takes 1. If he doesn't want to break up, that's his problem and he should have been a better human being. You don't owe him anything. Let him call you a whore, let him accuse you of cheating, what he thinks doesn't matter. Save yourself.",
            "Are you my neighbor? Sounds just like the situation next door...... either way, you need to leave now. He is abusive and you deserve better. ",
            "Run.\n\nHe locked you in. That's abusive/psychotic.\n\nDo not let him into your place. \n\nBreak up through text. Call the police if you need to.\n\nPut your happiness and safety above his needs.",
            ">bf said his mom has overheard our arguments and he said she thinks I treat him like shit. (Im not sure if this is entirely true as his mom has always been absolutely lovely to me) \n\nThis has unlocked a memory in my mind that I had not thought about for a long time. In the process of breaking up, my college ex tried to pull this exact same thing to me after almost two years of gaslighting, patronizing, and emotionally manipulating me. Please get out of this abusive relationship as soon as you can.",
            "Don't break up in person next time, do it by text and cut contact. If he threatens you again, go to the police.\n\nMake it clear in the text that you do not want to see him again.",
            "33 and still lives at home? ",
            "Text him it is over, lock your doors, call the cops if he comes over and gets violent. Be safe. This guy is not okay. ",
            "Change your locks. Block your number. Call a friend or family member for reinforcement. Leave his stuff outside. \n\n&#x200B;\n\nThis is NOT okay and I hope you can see that. \n\n&#x200B;\n\nNEVER go to his place again. Please- I beg of you.",
            "A lot of people are making good suggestions on documentation and talking to the police. I'd also recommend educating yourself on the cycle of domestic abuse. Having a name for what's happening and knowing what to expect (for example, the honeymoon period where the abuser is all lovey dovey and makes promises to change and all that bullshit which is rarely if EVER true) will make it a LOT easier to steel yourself against ever going back. ",
            "Get out. Do not maintain contact with this person. ",
            "Hey man, I’m sorry you’re dealing with this. I had a bf like this. I had to move cities to get away from him. Even then I couldn’t end it, he did, by phone, because he thought I would fight for him back. Instead I told him no take backs and stuck to my guns. He spent the next month calling and texting me incessantly but he eventually left me alone. \n\nGood luck. It’s never easy to cut ties with this type of person. But just know not everyone deserves a face to face break up. ",
            "OP, that is a dangerous and abusive person. He held you against your will and given his angry outburst he could be capable of much worse. You have two objectives. \n\nFirst: GET OUT OF THERE. You are not safe.\n\nSecond: You need to start writing everything down and keeping records in case this blows up or he tries to track you down. Break up over text, and don’t respond if he gets abusive. Just screenshot it, save them to the cloud, and send them to someone else to save to the cloud—with someone like that you just never know what they’re capable of.",
            "Been through a similar breakup in an abusive relationship with an abusive man. Text him  a clear breakup message, and also add in there that you broke up with him yesterday and even though he didn't accept it and wouldn't physically let you leave his house- this is your firm decision. You may need this paper trail, unfortunately. Also add in the message that you will be dropping everything at his house (if you still have anything) in a secure place- but you won't actually be doing this, have a friend or family member do the drop off. Then you NEED to block his number, email, social media accounts, and etc. and start moving on and healing. You cannot move on if you are still in touch or if you are lurking his accounts or his yours. Please do these things today and keep your physical and mental safety in mind! Feel free to PM me if you want to discuss further. Good luck",
            "You don't need the other person's permission to break up.",
            "Please keep us updated, if for anything, to let us know you're okay. ",
            "Do not waste another iota of energy on this twatlord",
            "No. You are not still together. You are broken up. You broke up with him. It's not a negotiation. He doesn't need to agree. You don't have to see him. If he shows up, keep the door shut and call the cops if he won't leave.",
            "You already know what to do. Instead of postponing it by asking Reddit's opinion on this obviously toxic relationship, just break up and get it over with. It's hard but be strong. It will get so much better.",
            "block him on everything, get your older brother, father, any friend with a black belt to tell him to fuck off",
            "He's being an asshat so dump him like one, by text. He's supposed to be an adult and he's a 16 year old. If he comes over lock the door and don't let him in",
            "OMGOSH, break up with him even if he doesn’t agree. Do NOT see him in person again. This is the type of person who will hurt you. Please, talk to your friends and family. Call the police if you need to, even call his mom! Don’t see him again.",
            "DO NOT MEET HIM ALONE. DO NOT.  \nThis a serious red flag, don't go alone near him. This is toxic behavior, gaslighting and i fear he might get violent in the near future.  \nPlease stay safe, what he said and did is totally not okay, please break up with him over the phone and if necessary inform his mother why you're doing it.   \nTell all your friends and family the current situation so they can stay around you as much as possible and they know what to do in case of need.   \n",
            "Jesus. Run, don't walk, out of that situation.  Nope, nope, nope.  You made up your mind about what YOU want.  You need to respect yourself enough to act on that.  Put YOU first, as we all ultimately have to do, and that includes NOT tolerating the verbal abuse and manipulation of someone you've already recognized as not healthy for you.   \n\nSo seriously, exit. YOU have decided what is best for you.  Now it's on you to make that happen.  \n\nBest of luck!  You'll find the love you're looking for yet!  ",
            "Breaking up doesn't require both parties to agree. It's not a vote.",
            "I’ll be completely honest here OP. Reading this scared me...a lot. I really hope you break it off with him, and if you choose to do it in person (which I wholeheartedly advise against) take someone with you. Please don’t put yourself in any room alone with him. \nI’m so sorry you’re dealing with this stress and intensity from him. \nBig hugs",
            "Ok I am worried that he could escalate into crazy domestic abuser zone you do not want that. \n\nYou need to change your locks ASAP. \n\nDo not met him in privet always in public. \n\nSee if you can get a roommate willing to stay with you for a few weeks after you finalize the break up. \n\nYou may need to look into getting an restraining order as well, \n\nI mean he locked you in his house and did not let you go that is disturbing. I would go to the cops because that can escalate pretty severely. The cops can not do much but they can do more drive bus of your residency. Also if your in a condo with security notify them that he is no longer allowed on the premises. I writing via email and in person with a letter they can keep at the desk. ",
            "You can text him simply\"do not contact me ever again, stay away\". to the police if he does it is then considered harassment. Keep a picture of him on your phone and back up any and all texts between you. Call the non emergency number and report the incident where he held you against your will and tell them that you felt you had to agree in order to be allowed to leave. Tell EVERYONE, your family, friends, call hr at your work to discuss with them and management and security. The domestic abuse website is fantastic and will help you talk through and short yourself out, give you resources to help you protect and heal yourself. I'm so proud of you for recognizing how toxic this was and listening to your inner voice. You can do this, but you don't and shouldn't do it alone.",
            "No no no, a thousand times no. Nothing about what you wrote about his reaction is healthy or normal. He absolutely took away you choice and controlled your actions.\n\nI was in a relationship with a guy like that, and I had to sweet talk him an hour to get him to \"let me leave\" after telling him it was over. Honey, I never looked back.\n\nTell him whatever you have to to his face and get the hell out. Be wary though, mine went through a small stalking phase over the next 6 months or so. \n\nListen to your gut and have your friends and family on call.",
            "NOOOOOOOOOOOOOOOO - this is abusive. \n  \nGo to the police station and file a statement that he locked you in his house and did not let you leave. If you can reach out to his mom - tell her what happened as simply as possible - you brought his belongings over, stated you wanted to end the relationship, he locked you in the house and verbally abused you, the relationship is over, you are blocking his number and have contacted the police.  \n  \nAnd then double down security on your social media (set everything to private, block him) if he emails send him a bounce back email saying the address is no longer valid, block him on your phone, let your workplace know that you've ended a relationship and you want no contact from him if he calls or shows up, if you can use a buddy system if you're leaving work or places you frequent. Tell your family/neighbours/roomates that you've ended a relationship and he is not taking it well. This is not dramatic, this is simply the steps you have to take when you end a relationship with an abusive person.  \n  \nWhat happened is NOT normal - he is abusive and could escalate. He wants this relationship because he wants control and he wants someone to talk down to. Don't be that person. You do NOT owe him closure, the breakup is not a negotiation. Text him and tell him not to come over, you have ended the relationship, he is not to come around. If you left stuff at his house call the police for an escort so you can get it back. I'm really sorry this happened, please do not trust him that he will change.  He may try to romance you so you come back to him (google love bombing) don't fall for it, you are not safe.   Be firm and you do not need to justify, defend or explain your reasons for breaking up with him. This is *not* a negotiation that he gets to participate in.  ",
            "Never go back. And if he gets nasty call the cops ",
            "whoa, no one owns you...you did the best you could to be amicable...tell him you made up your mind and go no contact...",
            "You don’t need his permission to break up with him. He doesn’t have to agree.\n\nYou broke up with him saying no doesn’t mean you’re not broken up.\n\nHe’s abusive and for safety reasons I’d never see him again, certainly not alone and not in his house.",
            "Get a protective order (also called retraining order). This won’t protect you physically but will make it illegal for him to approach you. ",
            "Hey OP, I really respect that you wanted to break up with him in person. But after reading this, I think you should break-up over text or on the phone. If he tries to come over, call the police. If you need to see him at all, get a male friend to go with you.\n\n&#x200B;\n\nI'm sorry you are going through this. Good luck!",
            "Don’t put yourself in a situation that is difficult to get out of. Tell him it’s over via text and block his number. Have family/friends come over in case he shows up and call the police if he does. Do not engage, do not open the door. Let the police handle it and remember that he can only put you in those situations if you give him access to you. This is abuse.",
            "Lock your doors... That guy is no good lady.",
            " RUN! RUN! RUN OP! He sounds super controlling, manipulative and straight up scary! This is already emotional & verbal abuse taking place & unfortunately the physical will be next, if it hasn't happened already. Be very careful but make a plan to get far away ASAP. (& he doesn't want to stay with u out of love, he needs someone to put down to help build his ego up.)",
            "The relationship has ended, you told him, end of.\n\nHe does not decide alone in this.\n\nYou have a choice in this and you made your choice.\n\nIt doesn't matter what he thinks, it is done.\n\nAnd you do not have to give him reasons.",
            "I would go for the police right away. He's already kidnapped(or imprisoned, which is considered kidnapping) you which is enough reason to bring the police in. He prevented you from leaving when you wanted to leave. Don't treat that lightly. Think what else he might do to you when he realizes you're not planning on sticking with him. If you don't want to get the police involved, confront him with a friend or two, and say clearly \"I want nothing to do with you, if you contact me again I will bring the authorities\". You have to make sure he gets the message that he can't keep you in a relationship you don't want to be in. Honestly this guy sounds like he has a screw loose. Sounds dangerous from what I have read. Don't ever go to his place alone again. You might think you know a lot about him, but 9 months isn't long enough to learn about someone. \n\nTo sum up: Either go to the police, telling them he held you against your will, or confront him with multiple friends and tell him he is to never contact you. Consider yourself lucky dodging a bullet. If he was willing to prevent you from leaving, imagine what else he was willing to do.",
            "Break up with him via text. I would go somewhere (I recommend a police station) before you do it. Explain what's going on to the officer at the desk so the police are aware in case something happens or in case you need them. Then wait a few hours and see how he reacts. When you feel ready to go home ask for a police escort home so they can make sure you are returning to a safe environment. It may seem extreme but I have had to do this and before I was ready to go home an officer walked up to tell me the location I gave them had been \"broken into and trashed\". Be safe and it's okay to ask for help if you are worried. You can also ghost him. You told him you want to break up. You are broken up. Change all social media and anything else he can see to reflect that. If the other person refuses to accept that then its him being a stalker. Best of luck. ",
            "If I were you, I’d stay with a friend or your parents for a few nights just to be safe. Also, tell someone you trust at your job Incase he tries to show up and ask for you. ",
            "Darling run! Please run and hide. Don't let him know just slip away. I'm being serious here, this could very easily get physical. I fear for your safety. Do you have family or friends you could stay with? I have a feeling tho that he has already isolated you from them. Can you afford to stay in a motel, move? If you can't get out now then get serious locks, cameras, major security and document EVERYTHING. If at any point he threatens you or you feel unsafe, or now preferably, call the police and say you dont feel safe you fear that your partner is going to hurt you and get it documented and also they should put you in touch with the right services to help you ",
            "You are very lucky you got out alive this time.\n\nMake sure there is never, ever going to be a next time.\n\n",
            "yeah that is abuse.\ndont be alone with him again.",
            "You are not still with him. \n\nBreaking up is a unilateral decision. You told him you are no longer in a relationship with him, thus you no longer are. Bam. \n\nHe cannot keep you in a relationship. He does not have that power. \n\nThis is abuse. Please be prepared to bring in the police if necessary. ",
            "You don't need his permission to dumb him. Send one last text telling him it's over and to stay away and get yourself a restraining order asap.",
            "Ah, this sounds like such a toxic relationship, the way he acts is quite manipulative: literally locking the door at your face so you cannot leave him? I would not want to think how this relationship would continue. l think it would just get worse for you at the end OP! How he acted is quite mental. \nAnd you guys are at a mature age... Not like 20 year olds first relationship break up, in which case l dont know if an age would justify this behavior. \nYou are right in wanting to break up. Did you leave his stuff at his place? Be strong! You can do it, you can break this unhealthy relationship. You have the strength in you to do it. If talking to him again does not work, just ignore and block him. Taking no for an answer is so awful! How can he not accept your wish to leave? So bad. \nBe strong OP, reddit is behind you!!",
            ">I don’t know why he is so intent on wanting to stay in such an awful relationship.\n\nBecause he's abusive.\n\nLocking the door and not letting you leave is ABUSE. It's also ILLEGAL.\n\nIf he comes to your house, do not open the door. Call the police. Do not have any further interactions with your ex. No talking, no texting, nothing. It won't cool him off, it will only serve to escalate him.",
            "No need to break up in person, he sounds extremely dangerous and controlling. I mean, he held you hostage. Literally. \n\nBreak up with him via text and immediately block him. He does not deserve your time or attention.",
            "This is very concerning for your safety. I am legit concerned. He locked you in house and then verbally abused and manipulated you. What’s to stop him from locking you up again if you get in an argument? Or him calling you awful names over a disagreement? OR him physically or sexually assisting you? He’s already proven he doesn’t respect your boundaries.\n\nAs far as I’m concerned you two are already broken up. I think you should reiterate what you said from afar, like an email or text. Be prepared and open about the fact that if he tries to contact you in person again or comes to your apartment and refuses to leave (the premises you should not let him inside) you will call the police.",
            "Breaking up with someone is a unilateral decision. He doesn't get to forbid you to do this. You want out, you get to be out! It's controlling and awful to try to tell you otherwise. Get away from this guy and block him on everything.",
            "Tell your family and friends about what is going on, and to call the police if they see him around where you live.  Block him on all social media, and don't answer any text messages.",
            "change the lock if he has a key lock all your windows and things of that nature text him one last time about the situation and contact his mother to get your stuff out of his house if there is any and live a peaceful life away from hurt people",
            "No, you broke up. Only one person needs to break up for it to be a break up, he doesn’t get veto power.\n\nJust block him everywhere and call the police if he shows up at your house. He is emotionally abusive, sounds like it was about to get physical as well. What a psycho.",
            "Girl run. This is INSANE! ",
            "This guy sounds like a future wife beater. Dodge that bullet now while you still can.",
            "Please for the love of gods leave now ",
            "TOTALLY UNACCEPTABLE!!!!!!!\n\nI'm a guy.  I would never, ever, ever, EVER,  EEEVVVEEERRR do this.  If someone wants to break up it's sad but that's their choice.\n\nHim locking you in and not letting you leave is a giant red flag.\n\nAs others have said, protect yourself.  This guy is not acting rationally and I'm frankly worried for your safety.\n\nDefinitely break up and definitely stay far away from him.",
            "RUN! Go somewhere safe, a friend he may not know about, do anything you can to get away from him as soon as possible! If he keeps harassing you, you need to send the info to his mother too. You are in danger around this guy. Get out ASAP!",
            " How are you \"still with him\"? If you decide that you're broken up, then you're broken up. Text him and tell him its over and block him on everything.",
            "This sounds exactly like a situation I went through, and I ended up getting a smack and almost a fractured skull 🙃 get rid of the pr***, block, delete, call the feds if needs be! ",
            "Contact your local domestic violence center. Talk to them. If you don't have one, contact another one. I can send you a number if you need it. ",
            "Been there. I lived with my toxic partner though, so you’re on a much better foot. \n\nTotally agree with other posts. Dump him by text/phone (personally I’d go with text). Dump his stuff at his door, or with his mum. \n\nBlock his number/change your number and lock the doors. \n\nFuck that shit.",
            "You didn't try to break up with him. You *did* break up with him. You don't need him to agree to the break-up for it to be valid--starting a relationship takes two, but ending it only needs one. \n\nTell him that you never want to see or hear from him again via text message and block his number. ",
            "He committed a felony and is abusive. You need to escape.",
            "Time to block him on text and social media and any other way he can get a hold of you."
        ]
    },
    {
        "post_id": "7zom8g",
        "author": "throwagoawayalready",
        "title": "[Update] A colleague (30ish M) that I (28F) dislike keeps trying to force an uncomfortable conversation with me. How do I navigate this?",
        "url": "https://www.reddit.com/r/relationships/comments/7zom8g/update_a_colleague_30ish_m_that_i_28f_dislike/",
        "score": 4789,
        "num_comments": 166,
        "created_utc": 1519397990.0,
        "selftext": "[link to original](https://www.reddit.com/r/relationships/comments/7wewwb/a_colleague_30ish_m_that_i_28f_dislike_keeps/)\n\nI wanted to post a quick update because a lot of people here seemed  as annoyed with this caveman as I am. \n\nI got a ton of great advice (thank-you!), and I started practicing what I would say to his face the next time I ran into him. I also considered alerting the management at the club he chased me out of, but I didn’t have to do that. Apparently he brought it to the club himself and tried to rat me out for my “rudeness,” but it totally backfired. \n\nOne of the managers approached me a few days ago and said “Justin” told her about what happened. My stomach sank at first because I thought she was going to encourage me to talk to him, but she said just the opposite. Without even hearing my side she told him that I don’t have to talk to him if I don’t want to. She also said she won’t be booking us on the same shows anymore, and that the staff knows not to allow him into the building on nights I’m performing. She said she wants me to feel safe at the club, and she’s got my back. What a win for sisterhood!\n\nAfter that, he tried reaching out to my SO who also shut him down and told him to leave us alone. I don’t know if he’s let it go at this point, but I’ve been making notes about everything like some people wisely suggested, and I’m feeling validated and supported.\n\nTL;DR: creep tried to rat me out for being rude, and it blew up in his face. ",
        "permalink": "/r/relationships/comments/7zom8g/update_a_colleague_30ish_m_that_i_28f_dislike/",
        "comments": [
            "What amazes me about this is that apparently, he genuinely thought he was in the right, enough to go to management. Just... how?",
            "Yay for creepy mother fucker getting his ass handed to him... himself!",
            "[deleted]",
            ">he brought it to the club himself and tried to rat me out for my “rudeness,”\n\nOh my god I'm dying laughing. Just...WHAT??? How did he think that was going to go? Even if it *was* rude (which it absolutely was not, you have a right to avoid whoever you want, nobody's required to talk to anyone ever), why would they give a shit? Are they the conversation police?\n\nWhat a garbage person",
            "Props to her. Would love to be a fly on the wall when that conversation went down. \n\n\"Ever since I hit on a girl in front of her and she told me not to do that, she won't be my friend. I keep trying to get in her face and be friendly, but she's still avoidant and rude to me\" \n\n\"...She doesn't have to be your friend.\"",
            "What I want to know is what the fuck did he think was gonna happen when he reached out to her SO? Like what was the thought process behind that??",
            "Yeah I’d be a little concerned he’s still going to show up at something and make it seem like coincidence, as this guy seems like his entire ego is founded on him doing no wrong and he just got told to fuck off twice. Often times people like this will feel the need to prove how right they are even more when they’re told they’re not allowed.\n\nI’m super happy for you OP, but I’d also make a confrontation or exit strat when he just happens to show up at a party or venue you’re at.",
            "What an amazing outcome! Couldn’t have been anymore perfect. I hope that you don’t have to waste your energy on confronting him OP, but I am sure knowing so many people have your back will help you if you ever do.",
            "It's concerning he's still allowed to come through at all. ",
            "\"I can't stand being around cavemen. It's just how I'm wired.\"",
            "Congrats OP! While this is definitely very good news for you and your S/O I'd just like to offer a gentle warning to still keep an eye out for this guy. It seems like now is the point where he may decide to do something truly stupid and overstep his boundaries (assuming he hasn't let this all go). \n\nTl;dr stay cautious and stay safe ",
            "I don't know how you or your SO haven't knocked his teeth out already (metaphorically that is, violence is not the answer).\n\nI'm glad you practiced what to say. It's always good to do once in a while, especially in your industry, to practice standing up to these type of men in a public space. I'm super happy management has your back. Honestly dude should be banned for that type of obvious and predatory behavior.",
            "Yay for how this turned out! Your Manager sounds great but I would take it a step further. Go and write up an official report or have it documented that he made you feel uncomfortable multiple times and made unwanted advances. If any future situation arises you have documented proof that it has been an issue before. When you have interactions with him record the conversation. Get evidence so if something else happens it doesn’t turn into he said-she said. Get your manager or other female employees to report his behavior and get it all together. This gives you a standing ground for anything that might happen. You have proof, recordings, and management documentation of his actions.",
            "Why in earth would he reach out to your SO. So bizarre! Glad he is out of the picture. ",
            "Way to go.  And no his fragile ego hasn’t let it go.  Just watch out for him spreading rumors in your community.  ",
            "I hope that's the end of it for you. I work with someone EXACTLY like this and the only way I could get him to leave me alone was to be actively rude to him. He tried to start an official complaint with management about me refusing to work with him, but they knew what he was like and he got shut down immediately. He's now creeping after an 18 year old at work (he's in his late thirties). Hopefully she won't have to put up with it as long as I did...",
            "\"I'm just a caveman\"... Please. Is that what we're calling rapey vibes these days?  The Nile is not just a river in Egypt. ",
            ">he tried reaching out to my SO\n\n????? shaming tactics his parents most likely used on other people to get them to spend time with them/him.",
            "He will turn out to be the guy that commits some horrible crime that afterwards everyone says \"We reported it and nothing ever happened\"\n\nGuy is a sociopath.  Scary, scary, scary.  To call OP's BF to whine about her not do as he says is a special kind of displacement.",
            "That's great to hear. Thank her for being such a good boss and looking out for you.",
            "This is one of my worst nightmares, I'd be looking over my shoulder for a very long time. \"Creep\" can turn into \"psycho\" so damn easily...\n\nI sincerely hope he's out of your life for good, OP. Feel free to update us if anything else happens. ",
            "Always nice when the trash takes itself out. Glad it's working out for you and thanks for taking the time to update us.",
            "I am completely confused about what kind of business you are involved in.  ",
            "Some people are just fucked that way ",
            "This guy gives cavemen a bad name. ",
            "Holy crap I really want to know how he described the situation to the manager? Like how does he even explain “she didn’t want to talk to me so I chased after her” with his mouth and not realise how he is in the wrong here?",
            "Upvote for sisterhood! ",
            "Gosh your previous post made my skin crawl and this is such a good update. I’m so happy for you!",
            "That guy sounds very ENTITLED.  Someone put him in his place or else he might go shoot people up.",
            "Yay! Glad to hear this worked out well. I want to add one other suggestion. Since this guy has a temper, an ego, and zero common sense, I'd have some emergency plans ready to go. Not to be an alarmist, but you just never know and it can't hurt. I'm not sure what kind of cell phone you have, but I recently upgraded to an iPhone 7+, and it has a feature where if you press some combo of keys (even if locked), it calls 911. Stuff like that. Don't call 911 unless it's an emergency, obviously, but some precautions will probably offer peace of mind in case he escalates. ",
            "There may be an online group specifically for women in your artistic arena and general geographical area to talk about things like this, for the sake of mutual protection and commisseration and general sisterhood.  I'm part of such a group, and situations like yours come up regularly.  If you want to find such a thing and haven't/can't, msg me privately if you want and I'll see if I can help out?",
            "we love a happy ending",
            "What an awesome outcome! OP, I’m sure I don’t need to say it, but I hope you bring that manager a plate of cookies/gift card for the local coffee place/bottle of wine/whatever as a small thank you.  Never hurts to show appreciation to people who do good by you.",
            "It's more of a win for \"being a normal human being\", and less than that of \"sisterhood\".\n\nSorry to hear that the dirtbag still is allowed to go there though. Sounds like he will find another target, which totally sucks.",
            "I didn’t see it there.  I was just so pissed of at this comment. Just unbelievable to have remorse for such a*hole such as this one. So my bad. ",
            "Uuugh I'm so relieved for you!! Hell yeah. \nI had a similar experience like a year ago so I know what a great feeling it is to know your perception is  validated.  It's great to not have to be aggressive to be treated decently.",
            "Wow. You know he's got literally no awareness when his OWN version of events turned someone against him\n\nHe doesn't know where you live right? I can see him escalating from here",
            "I’m making real shit",
            "Light travels faster than sound. This is why some people appear bright until you hear them speak. This rings for ya’ll. ",
            "You could also point out to him that this may be why \"cavemen\" went extinct. But, so long as he is out of your lives, there would be no reason to reconnect just to poke at him. I'm happy you are working is a safer space than before. ",
            "Have you gone to Human Resources to report his flagrant violations?? In any industry his behavior is archaic, he needs to be written up, disciplined and possibly fired!! Isn’t there a zero tolerance policy where you work?",
            "Ovaries before brovaries. I'm glad she's got your back.",
            "Thank you for a great update. It couldn't have happened to a more creepy guy and I am cheering for you! Excellent. \n\nSeriously, what a moron. Glad you're shed of him.",
            "[removed]",
            "[removed]"
        ]
    },
    {
        "post_id": "9du198",
        "author": "throwaway98989609",
        "title": "My best friend (20M) asked me (20M) out. I said yes. I didn't know it was a date.",
        "url": "https://www.reddit.com/r/relationships/comments/9du198/my_best_friend_20m_asked_me_20m_out_i_said_yes_i/",
        "score": 4791,
        "num_comments": 206,
        "created_utc": 1536324713.0,
        "selftext": "I'm an idiot. I'll try to keep this short. Also, I was a bit drunk when this happened.\n\nNoah and I have been best friends since 2nd grade. We live together with one other friend near the college we go to together. He came out to me when we were in high school. It didn't change anything. When we got to college, I came out as bisexual.\n\nLast night we were hanging out with some friends and I had a bit to drink. When we were walking home I could tell he was nervous so I asked what was up. He asked if I wanted to go out with him. He literally said \"do you want to go out with me\". I don't know why, but I thought he meant as friends. Thinking back he made it really obvious it was a date, but I'm an idiot and I was still a bit drunk. I said yes. He suggested Saturday night. I said yes.\n\nI left to go to the gym before he got up so I didn't see him. While I was at the gym, the friend we live with texted me that Noah was really happy this morning and she didn't know we were going to go on a date. She congratulated me and said we make a cute couple. This happened literally six minutes ago. I'm panicking right now. I don't know what to do. I love him but he's like my brother. I can't go out with him. How can I tell him I'm not interested without embarrassing him more than I have to? I don't want to mess up our relationship. We're supposed to have lunch together in a few hours. What do I do?\n\ntldr: I'm an idiot. My best friend asked me out. I said yes. I didn't know it was a date. How do I fix this as easily as possible for him?\n\nUPDATE: Thank you guys so much for the advice. I only saw the first 30 something comments until just now, and I'm blown away by how many people have commented to give me advice. I tried to take a lot of the advice I got, but some of it was contradictory so I couldn't do all of it. Thanks again to everyone who gave advice, even if I didn't see it until after we talked.\n\nI texted Noah and asked if we could skip lunch and go home instead so we could talk. I tried not to make the conversation dramatic. I apologized to him for misunderstanding him, and told him I knew it must have taken a lot of courage for him to ask me out. I told him that he was my best friend, I loved him, and that would never change, but I had never thought about a romantic relationship with him. I apologized for fucking up and getting his hopes up. He asked a few questions, like did I really not know he meant it as a date. He apologized for \"fucking things up\" between us, but I told him that I wasn't uncomfortable with him feeling that way about me. I told him that I understood if he wanted space to process it, and I would give it to him if he wanted, but I also told him how important he is to me and how much I love him. He said he didn't think he wanted space. He just wanted to try to move on with the secret out.\n\nWe've always been totally open with each other (well, except for him liking me I guess) and he said he was happy he wasn't keeping his feelings a secret anymore. We had a cheesy moment where I told him he could always talk to me, about anything. It was like straight out of a romcom. We talked for a long time after that. Apparently he's had a crush on me since before he came out in high school, and after he had a few drinks last night he decided fuck it, why not try. By the time he had to leave for his class this afternoon, things felt normal. I don't feel weird knowing about his crush, and he doesn't seem to feel hurt or anything because of my fuck up. Maybe just a little sad. I'll definitely keep an eye on how we interact and how he acts for a while. A few people warned me against accidentally flirting with him, and I'll try to keep anything like that in check.\n\nI guess this is a happy ending. I know there are still things to be aware of, but right now it looks like the conversation went pretty well. Thanks everyone for commenting and supporting. It helped me not just with advice but also with calming me down when I was really panicky this morning.",
        "permalink": "/r/relationships/comments/9du198/my_best_friend_20m_asked_me_20m_out_i_said_yes_i/",
        "comments": [
            "There's no easy fix. Contact him and clarify: \"Noah, did you ask me out on a date or are we going out as friends?\" It's going to hurt him regardless. The less time you allow him to dream about this, the fewer fantasies he can build. Likely, rejection is the end of your friendship, but it's more fair that way than him sticking around to think he'll eventually have a chance. ",
            "Be direct. Tell him you need to talk and in person let him know that you don't have romantic feelings for him. Do it as soon as possible so he doesn't keep telling others.",
            "Apologize for accepting the date and let him know he’s like family to you and you don’t feel that will ever transition to something romantic. \n\nI mean it might be rough on him but really you need to shut down his romantic interests ASAP if you want to continue your friendship.  \n\nMake sure to ask him if he needs some space to process this. Maybe spend a bit less time together temporarily that way he can move on mentally. ",
            "This happens often, best friends fall for best friends, especially people who are same sex attracted. I had an intense crush on my best friend when I was your age and she didn't reciprocate and I knew that, but she was kind and respectful and loving to me and we are still great friends today. We both feel very fortunate to have gotten through that nicely, it can happen. \n\nIf I were you, I would call him and say hey, I didn't know you were asking me on a date. I consider you a brother and not a romantic prospect. You are an awesome person and GREAT people will date you, but that's not me. If you need some space take some space. \n\nI'm guessing he will need space for a while and that will be good for both of you. This doesn't have to blow up anything, just let him heal and turn his attention to other guys who do like him back and most likely it'll blow over, as long as you keep treating each other kindly. ",
            "&#x200B;\n\nI'd say something along the lines of, \"The relationship we share right now is one of the most important relationships in my life. I love and care for you so much, but I don't want to take it in a romantic direction. I hope that's okay with you.\"\n\nThis would let him know you value him highly and lets him know the reason you don't want to change the quality of the relationship.",
            "I would just say something like ,\"Noah, I wish I would have been more sober when you asked me, because now I feel bad, but i have to say: the idea seems really nice. but I've given it some thought & the reality seems like something I can't go through with. I just can't stand the thought of losing you as a friend and seeing as we're roommates.. I don't want to complicate things. you've been around my entire life, I cannot envision a future without you. dating you puts that relationship at a risk that I'm not willing to take, I'm sorry!\"",
            "One thing to consider is that as he potentially starts to get over his crush on you, you may have to start taking on more responsibility for \"maintaining\" the relationship. I have had a few friendship survive unrequited feelings but have also had a few slowly fade. The biggest thing I realized was that, whether consciously or subconsciously, the friend had been doing way more for me in the friendship than I had been doing for them. Which makes sense, if you have a crush on someone even if its something you keep a secret you still on some level want to impress them or make them likeable or be the best version of yourself around them. But once a crush fades, you typically don't strive as hard to always prioritize them, even if you are still friends. And if this has been going on since high school, it may be that you have fallen into a routine where Noah carries more of the \"work\" that is involved in your friendship, whether that is emotional labor, logistical labor, time spent, etc. ",
            "Hey, I've been through something super similar. I was basically in love with my best friend and I told her, and she didn't feel the same. She quite explicitly told me she probably never would. \nWhich sounds harsh (and it was) but she was equally explicit in telling me how much I mean to her, and how much our friendship means to her. I was super scared of losing her because she would find it too awkward to be friends with me, and I don't really know if she did find it awkward at all (Unrequited feelings are always awkward for everyone involved, I feel like) but ultimately I left that conversation feeling sad, but really really happy. I felt like our friendship and our bond was affirmed and even deepened by it! Because it's honest!\n\nMention that it took a lot of courage to ask you out (because it did) and that you admire him in lots of ways (cuz I imagine you do, he's like your brother!) \nIt doesn't have to be the end of the friendship. My best friend literally JUST texted me like 12 times while I was writing this, lol. We're closer than we were before, and even though you and your friend are two completely different people than my friend and I, I think this could be what happens. Just be honest and clear but loving, too. Your friendship has survived things before, and it can survive this, too! ",
            "Okay, so, I think the least hurtful thing you can do here is *not* tell him you thought he asked you out \"as friends,\" because that'll just make him feel like he's so horribly unattractive you couldn't even conceive of the possibility when it was put bluntly in front of you. \n\nInstead: Tell him you said yes because you like him a lot as a person and were optimistic you could build a romantic connection, but once you went out on a date you unfortunately didn't feel any kind of spark at all and you think you should probably not go on any further dates. Assure him he didn't do anything wrong, you just love him like a brother and so it felt weird and uncomfortable when you actually tried a date and you're really sorry and etc.  ",
            "Go on the date, see if you feel something and then if not tell him you don't think it would work out. ",
            "Please read to the end of the post.\n\n1. Apologize. Things happen.\n\n2. Explain how you actually feel about him\n\n3. Tell him that you are very sorry for the mistakeand that you don't want to lose him as a friend, That you really value your friendship, and that you want this to be as easy on him as possible. \n\nYou could offer to have the two of you just like in case anyone asks. Say you went on th date but both decided friendship was more your thing. \n\nI do just want to say that this is likely the end of your friendship. He has developed romantic feelings and those don't just go away. He has probably been wanting to ask you out for a very long time and didn't have the courage or didn't want to ruin things.\n\nIt is very likely that his feelings won't just disappear because you explained you aren't into him that way. \n\n**This is the perfect example of the ending of a relationship where no one did anything wrong.** You may not believe me but even if you turned him down the same result would happen. His feelings won't just disappear.\n\nNo one did anything bad. No one is wrong or right. No one acted a way they shouldn't. This is just a case where two people's desires do not meet in the middle. No one is at fault here.",
            "Oh man, that is tough.  Maybe to spare his feelings go on the date, but for future dates...\"it didn't work out\".\n\nWomen do this all the time.  Give them a shot but if it doesn't work out that's fine too.  It allows you to let them down without leaving them feeling like they didn't even get a shot.",
            "After lunch just explain how much you value your friendship and would rather cherish that than turn it into a romantic thing. It will hurt him but at least you can sit face to face so he knows you're sincere. \n\nI feel like telling him you misunderstood him about the implications of going out might make things awkward but honesty can be the best policy ",
            "Hes a person you already like. \n\nDo you find him hot?\n\nIf the answer is yes. Go with it.\n\nIf the answer is no. Dont go with it. Take him down a gay bar and be his wing man.",
            "Be honest, be kind, be a friend. ",
            "I hate all of this \"I see you like a brother\" stuff. Probably because I've heard it before from a friend crush. I think it would be better to hear, \"I value our friendship, but I don't see you romantically. I know that's disappointing to hear and I'm sorry for that. I hope that we can continue our friendship and I understand if you need space for a while. Let me know if and when you're ready to hang out again.\"",
            "> ... and after he has a few drinks last night he said fuck it, why not try...\n\nSounds like Noah has been getting his advice from Reddit.  \n\nI’m glad it worked out for you. OP.  Maybe you can be his wingman on a future adventure together. ",
            "Meet him for lunch and explain to his face exactly how you feel.  It will be better received by him directly in his eyes.",
            "What's wrong with going out with him, and seeing how it goes? if you don't want a second date then he doesn't get one. You never know, there could be a spark between y'all!",
            "Call him and set it straight. You're not a teenager anymore.",
            "I know I'm commenting late, so I'm probably not being helpful, but it's ALWAYS just best to be honest and straightforward. You guys have been great friends since second grade! Just tell him you misunderstood what he meant, and while you love him as a friend, you don't feel romantically about him. Or however it is that you feel. That's totally natural, and while it won't feel great for him, he will get over it, he's a resilient, strong person.\nIt's always most important to just be honest I think. ",
            "Straight up unadulterated honesty. Tell him what you told us.\n\nPeople make mistakes. Everything else people do to try and back out of these situations is fucked, just tell him the truth.",
            "Dude.  You need to adult and tell him. \n\n“Noah I love you like a brother.  I was a little drunkalish when I said yes, but I just can’t flip that switch.  I’m really sorry, and I’m panicking because I love you but I can’t date you.”  \n\nHowever you say it, do it now. It’ll probably come out like that but that’s fine.  Don’t destroy this friendship. ",
            "Thank you for handling this the right way",
            ">I guess this is a happy ending.\n\nYou are just a walking barrel full of communication misinterpretation. ",
            "Wow, this is really shitty. It's said and done, but dude... How did you misinterpret that? That is like, one of those most common ways to ask someone out that I've ever heard of!\n\nJust apologize and explain that in your drunken stupor, you couldn't comprehend exactly what he had said. Tell him you love him (like a brother) and that you'd never risk messing that up. He's going to be hurt, but it's better than prolonging this. Goodluck :)",
            "[deleted]",
            "Basic question I didn't see addressed anywhere, but are you attracted to guys? Have you ever dated or been with a guy?",
            "I'd say just go on the date! You were going to go anyway, just don't act romantic if you don't want to. People go on dates with friends all the time, if there's no connection then you'll just go on being friends!",
            "Looking at your edits, this isn't over. I've been on both sides of this. He still thinks he has a hope. Your options are to put him down completely and that will hurt him, or move out. ",
            "What if you go out once and just tell him there is no chemistry?? ",
            "As soon as possible tell him straight up that you personally don't click that way. \nIt might seem like a big, destructive action, but he's supposedly known you all your life; he should get that you're an idiot and that this is an easily fixed situation.\n\nProblem Is!!! If you don't do this sooner, he will tell people, confess excitement, and then you'll both be public idiots.",
            "Go out to lunch and just be truthful, chances are he’s a little hurt but hopefully doesn’t blow up over it and just recognizes the mistake. I mean usually you show interest in someone before just asking them out to be a couple, I mean take it as a date and just see how it goes. Maybe there’s another side of him you don’t know or maybe you know him inside out but what’s holding you back? Is it an attraction thing or what is it? ",
            "Call him and make the situation clear. Don't text, call him.",
            "It’s been a few hours and it’s around lunchtime in the US!! Idk where you are but you should definitely update us!!!!!",
            "Don't even waste time sitting on it - text him and ask if it's a date or just a hang out. When he answers, tell him you misunderstood, are so sorry but you are not interested in that way and still love him regardless. Don't know what will happen once he gets that news but \\*do not\\* put yourself through such a complicated and uncomfortable situation when you have the chance to nip it in the bud right from the get go. Good luck.",
            "Call him and tell him straight.  “Hey man, I think we have a misunderstanding”.\n\nHe might be upset/disappointed, but there’s no avoiding it.",
            "An easy fix would be to sit him down when you see him in person, do not dance around the rejection it should be made immideatly clear maybe say something along the lines \n\n\" look I do love you but not in that way man, I'm sorry that I was so oblivious to what you were asking the other night. I'm really flattered, but I see you as family.\n\n I don't want to lose your friendship so if you need space or to pretend that this never happened I'll help in what ever way you want. \n\nI'm really afraid of hurting you but I also know that going along with the date on any level is going to hurt more, because I'm not being honest about my feelings. \n\nI think you're an amazing person and you deserve someone who feels the same way about you that you do them, who respects you loves you and is able to be 100% there. That can't be me but I'm so looking forward to meeting whoever it turns out to be.\"",
            "Can you provide an update.  Have you talked to Noah.  This kinda happened to me but more my best friend told me he hated that I hit on other guys and nothing ever happened between him and I.  It didn't end well.  ",
            "I think there's two ways to do this - you either nip this in the bud before the date, or you nip it in the bud after.\n\n&#x200B;\n\nIf you are pretty sure you don't want to date him, say you are sorry for the misunderstanding but you really value your friendship with him and you don't want to date him.  And then end the text message with an invitation to do something friend related if he's up for it.  Try to brush it off as no big deal, and maybe make a joke at your expense like \"wow you must be really lowering your standards if you're considering dating me.\"\n\n&#x200B;\n\nIf you chicken out of that text message and end up going out on the date (or you realize you might want to date him, though it doesn't sound like it), I think after the first date you should tell him something along the lines of how you think it's kind of weird and that you see him like a brother and can you guys please just stay friends.  And pay for everything.\n\n&#x200B;\n\nGood luck.",
            "I wouldn't say brother, as that can really bother a guy, say I feel like we are so close as if we are family.  \n\nI've had a lot of close friends who have later said they saw it as something more.  Be reassuring that you still want to be in their life but that you respect that they might need time to sort out feelings.  But you will be waiting as life long friendships stand the test of time and that is what you consider them.",
            "You can certainly date him, a great friend is a great opportunity ... would a stranger be better??  Nooooo....",
            "OP, I'm sorry that this has happened to you both; this is a no-win, shitty situation. Here are a few things to bear in mind as you go forward:\n\n1. There is no such thing as \"the friend-zone\", and no one should make you feel as though your friendship is a consolation prize. If anything, there's a \"girlfriend-zone\" where *he* has put *you* (but this is not a permanent state of affairs!)\n\n2. The sad truth of the matter is your relationship is different now, whether you like it or not. You cannot un-know what's been revealed: he does not perceive your friendship in the same way you do. To deny that and try to make things \"go back the way things were\" is to be willfully ignorant, and cruel to him. \n\n3. You're afraid of losing him, but you may have to for a while. It's scary. I know how that feels. I've been in your place (and his place) before too. One of them was with my very best friend through high school, with whom I was completely besotted! It took some years of on-and-off friendship, but we're in our 30s now, and still relatively close. Of course, we each have our own partners and lives which occupy most of our time, but we still catch up, hang out, and talk shit.\n\n4. Respect what he chooses to do. He'll probably act weird for a bit. He's hurting, respect his healing. You'll hurt too, it sucks being put in the position you're in, but neither of you is \"at fault\". It's not his fault he has romantic feelings for you, and it's not your fault you don't see him in the same way. What stokes our fires is different for everybody at different times in our lives. Be gentle with yourself and gentle to him too. It will be hard not to feel selfish or resentful in the next little while, but I believe in you! ",
            "Tell him you thought about it some more and really don't want to screw up the great friendship that you already share. And maybe pivot that conversation into how the two of you can be each other's wingmen.",
            "Very easy fix. Tell him the truth. He is your friend so y'all should get a good laugh about it. I dunno why people have to get all super emotional....",
            "I’d send a blunt (yet friendly) text reaffirming everything:\n\n“Hey friend, I was talking to Girl at the gym and she made it seem like our ‘going out’ was a romantic date. Maybe she misunderstood or maybe I misunderstood, but I just want to clarify that we’re only hanging out as platonic buddies. All the best”",
            "Try to contact him, and clarify with him. Just tell him \"I'm not ready for a date\".",
            "Meet in person and clarify. Don't overthink it. It will be fine!",
            "I think you definitely should call him and tell him the truth, but tell him you want to remain friends and how important he is to you. \n\nIt may even be better this way than had you rejected him when he initially asked. ",
            "So glad this worked out! It sounds like you guys are well and truly BFFs, lol. ",
            "Yay! Honesty and transparency are always the best policy. Seems like you guys have a super strong friendship, which is awesome. Kudos to you both for how you handled this. ",
            "I was 'the Noah' myself a few weeks ago. I asked a girl I know out for a drink, we did. It went great, she said she had a great time. I was a happy guy. \n\nA good friend of mine later told me that he heard that she thought it was a friends thing and only realised it was a date when talking about it with a friend afterwards. \n\nWe haven't talked to eachother about it yet, it's really awkward. I don't know what to do now (and in the future to prevent stuff like this from happening). ",
            "U r a real good friend ",
            "Good on you for not waiting and being straight up! That’s what makes it not awkward and also an amazing friend who shows they care a lot! ❤️",
            "OP, you handled this SO well—your friend is really lucky to have you, and now he'll hopefully be able to move on and you two will have a lasting friendship together. Or you may eventually go your separate ways with no hard feelings. But you handled this so compassionately, and I wanted to thank you from the bottom of my heart for being such a great example for this sub.",
            "OP, you handled this SO well—your friend is really lucky to have you, and now he'll hopefully be able to move on and you two will have a lasting friendship together. Or you may eventually go your separate ways with no hard feelings. But you handled this so compassionately, and I wanted to thank you from the bottom of my heart for being such a great example for this sub.",
            "Awww. That’s kinda sad but it’s so sweet of your thought about your frship :> \n",
            "OP thank you for sharing this with the rest of us, and glad to hear you and Noah are still on good terms. :D It would majorly suck to lose a bestie to what amounts to a misunderstanding.",
            "obviously this wasn't the outcome he wanted, but this story really makes me feel happy at how everyone involved handled it, well done and keep being you.",
            "I'm late as fuck, but I really liked the way you (and reddit) took his feelings into account and they you were able to re-affirm your friendship. ",
            "tell him you love him and cherish his friendship, but the more you think about it the more you realize you see him as a brother, not a romantic interest. let him respond and if it seems appropriate, tell him you're willing to give him some space if he needs it.",
            "Tell him. Tell him gently like you have no clue it was a date? “Man, I’m looking forward to our bro date. It feels like it’s been a while since we had a day to just hang out as besties.” ",
            "Just make sure it's not a date. Any embarrassment that he experiences will probably be short-lived. Your friendship of so many years will endure! Be brave and talk to him.",
            "just go out with him and after if youre sure you dont like it you can tell him you just want to stay friends",
            "The reality is your friendship, as it was, ended when he admitted romantic feelings for you.  You can never go back to that.  You can still be friends in a different way, but THAT friendship is over.  Don't feel bad.  People change.  Feelings change.  Circumstances change.  Etc.\n\nAsk yourself a hard question though: Are you giving up a chance at a solid non-platonic relationship out of a desire to preserve a friendship in its former state that is very likely already altered forever?\n\n'tis better to have loved and lost than never to have loved at all.  \nIf you seriously have no romantic feelings for him though, don't force it.  Just be honest with yourself about how you're feeling.",
            "I would mention it to him as having heard from a friend that she thinks you're going on a date, then laugh it off as a rumor. ",
            "I didn't read the full story but...r/suddenlygay ? Also, goodluck 😊",
            "I'm confounded. Do women really think it's possible for men and women to go out as friends? News flash. Unless the man is homosexual then it's 99.99% not as friends ",
            "I mean, if you want biological kids and all that you could let him know that you aren’t pursuing anything serious with guys despite being bisexual. Thus the inherent nature of how you date guys is not with a intent on future. In that case, you’d almost certainly be ending the friendship because the idea of getting serious or committed wouldn’t be an option to you. This is all assuming a shit ton and I realize that. I have no idea what you want in life, but that’s all I can think of that gives a very firm reasoning without making it about him or you. \n\nI did this exact thing with a girl I dated but it was genuine. She didn’t want kids. I’m at an age where I don’t date without the possibility of marriage. So we dated, but it got to a point where she wasn’t cool with not being serious and I wasn’t going to commit to someone who wants a fundamentally different life from me. ",
            "Tell him you were drunk at the time but you'll give it a shot considering you did say yes who knows y'all maybe lost lovers that never knew you needed each other.  I've made this mistake and I was happy for a few years until she got knocked up by her ex. Then I ended it. ",
            "Males will not be \"just friends\" with females unless under very specific and rare circumstances, this is not one of those. You're going to have to be honest and tell him that you were not thinking clearly and are not sexually interested in him and will never engage in a relationship that goes past the dreaded \"friend zone\". After that he'll probably get upset, be confused, and wont want to talk with you for a while, which is to be expected. Maybe he'll be your friend still, maybe he wont. But if you don't buckle up and nip it in the bud the situation will only become more painful for him and you in the future. "
        ]
    }
]