[
    {
        "post_id": "cm9p77",
        "author": "Petty_Dreamer",
        "title": "Update: What to do about my (18) brother (23) and his toxic fiance (22)",
        "url": "https://www.reddit.com/r/relationships/comments/cm9p77/update_what_to_do_about_my_18_brother_23_and_his/",
        "score": 4637,
        "num_comments": 49,
        "created_utc": 1565003971.0,
        "selftext": "Original Post: https://www.reddit.com/r/relationships/comments/ceqq7u/what_to_do_about_my_18_brother23_and_his_toxic/\n\nHey everyone! I wanted to thank you all once more for your help and support on the situation with my brother and his now ex-fiance. I took your advice and let him know that I support him and just want him to be happy, him and the ex fiance had a huge fight and we're getting all his belongings picked up today. \n\nHe's doing really well and it will probably take him a long time to heal from this but he's the happiest and most relaxed I've seen him in a long time. After everything blew over I showed him my post and he left a little message for you all. \n\nHeyoooo (its the brother in question) gotta say the one thung my brother got wrong was the reconiciliation for the past month. With the wool removed from over my eyes i seen what she had done to me AND👏I👏GOT👏THE👏FUCK👏OUT👏 thank you all for the support and the advice yall amazing inspiring people yall amazing i love all yall peace ✌\n\nTldr: Brother got out of his toxic relationship!",
        "permalink": "/r/relationships/comments/cm9p77/update_what_to_do_about_my_18_brother_23_and_his/",
        "comments": [
            "Don’t be surprised if she tries to come back saying she’s changed and wants a second chance. Unless she’s gone through months of therapy and really worked on herself it’s a lie and things will just go back to the way they used to be. \n\nStay strong. It’s awesome to see a family really support each other.",
            "Congrats to your brother! Hope him and all your family are going to be much happier. Sending internet hugs for support, it feels really shitty now but its gonna get better!!",
            "It takes a lot of courage and strength to leave a situation you have known for so long, good for you for leaving. It sounds like you have an incredibly supportive family (esp your bother, OP) so I really hope you have a happy relationship with them and eventually find a partner who respects you, them, and your relationship.",
            "Great news. Don’t be caught off guard if they reconnect though.",
            "This is a great outcome as these situations can be so, so hard! Well done everybody for staying supportive and for actually getting out of there.\n\n&#x200B;\n\nNow block her. She's at best manipulative and will likely do all sorts of things to try and get him back",
            "Omg yessssss. I thought about your brother a few days after your post and wondered what would happen. Happy for your family!!!",
            "This brought tears to my eyes. I got out of a toxic relationship years ago (after three years) and I understand how hard it is to see the whole messed up situation from within. But this experience makes us more appreciative once we find someone who really cares about us.",
            "It's like a weight off your shoulders to finally get out of a terrible relationship, just immediate relief. And freedom! Thank you for updating us.",
            "That's awesome! I'm so glad you have your brother back!  He's very lucky to have a sister like you. My brother had longtime girlfriend who was very similar to your brother's. She was the worst. She cheated on him, and lied about anything and everything, including being pregnant to guilt him into staying with her when he tried to leave. It took everything I had to keep my cool after I found out about that. He's my baby brother and I've always been fiercely protective over him. He met the most wonderful woman I could have asked the universe to send him a few years later and they now have a beautiful 6 year old daughter. \n\nThank you for the update and I wish you and your family the best of luck in the future!",
            "You should be really proud of yourself and your brother! It's clear there's a lot of love there and at the end of the day, you trusted each other. Awesome update.",
            "Proud of you bro! Now just stay away, no matter how much of a pity party she reigns in.",
            "You both sound amazing, hope everything continues to go up for you :)",
            "This Update just stole a tear from me",
            "Congrats! If only my brother got out but he's too far gone. Unfortunately he refused to see the truth and make a run for it before it was too late.",
            "Congrats to your brother! Just read your original post... what was her deal with eating in front of people?",
            "This update makes me so happy!! I’m so glad your brother is getting out. :)",
            "Whatever you do, DO NOT GET BACK TOGETHER WITH HER!!!! My brother dated the same kind of girl. We breathed a huge sigh of relief when they broke up. She kept him from visiting, talking on the phone, emailing etc. Then they got back together because he was bored, didn’t find another girl to date or whatever his reasoning was. They got married. She immediately got pregnant with an unplanned baby. They moved far away. She got pregnant with a second unplanned baby. They live states away from us and we rarely talk or see him or the kids. She criticizes everything about him. She doesn’t seem to like him much, and she hates us. My brother and I were super close and now I rarely see or speak to him because of her. It’s breaks my heart. Break off all contact and block her on everything. My brother is miserable and I don’t want you to end up the same way.",
            "Congratulations to you both! He has his life back and your family has your brother back.",
            "Hoozah! Teamwork makes the dream work! Take the time to heal, relax, pursue your own thing. You'll know when you're ready for another relationship. Good luck!",
            "Read your last post and now reading this. Best news for the day, a nice guy saved from disaster, you are the best f'ing sister. Congrats brother and sister keep looking out for him.",
            "My bf's brother got out of an extremely similar situation! His parents gave her a \"farewell\" coconut cake. She's allergic to coconuts.",
            "Yay!! So happy for you both! What a wonderful relationship you brothers have! Best of luck on your future endeavors.",
            "thank god. I thought he was a lost cause",
            "Hey, good to hear! But older brother, be warned that she may come back saying that she's changed. Don't believe her if she does, these people never change.",
            "That’s great - good for you!",
            "bravo!!! go out and celebrate mate. if you haven't already :-) but if you did, then do it again. you dodged quite some bullet there.",
            "Watch out for “hoovering.” She will most certainly attempt to suck you back in. Don’t fall for it.",
            "Oh I e missed you and I’m going to change or I have changed should be met with what’s the name of the psychiatrist you’ve been seeing and do you give him permission to speak to me about you. When she freaks out there’s your answer.",
            "Kudos to your brother for getting out of the toxic relationship. People stay in such relationships for decades before realising whats going on. Its not easy, and he will have withdrawls, but with the support of your wonderful family, he will get through this. Please tell him not to jump into a new relationship quickly. It is very important for him to work on himself and to understand why he let someone treat him so badly. Most probably he suffers from very low self esteem. Seeing a therapist is not the worst idea for him.\n\nKudos to you for being there for him even after he (and his fiancee) hurt your family so badly. Hopefully this will also teach you what kind of red flags to look for in a relationship in future and avoid them.",
            "Good! and please stay out!",
            "Congrats, brother! Go live your best life! ☺️",
            "Kidnap the fiancé and stage her death. Set up your brother with his true soulmate. Who knows? Maybe you’ll fall in love with his fiancé while she’s under your captivity.\n\nEdit: I read the original post, not the update. glad it all worked out.",
            "I just jumped similar ship, before it got too deep and while I still realized it. Well played man.",
            "Leave it alone and worry about your own life."
        ]
    },
    {
        "post_id": "a84i3z",
        "author": "UnusualInsect",
        "title": "[UPDATE] My BIL [34M] invited me [27F] and my husband [29M] to an orgy.",
        "url": "https://www.reddit.com/r/relationships/comments/a84i3z/update_my_bil_34m_invited_me_27f_and_my_husband/",
        "score": 4627,
        "num_comments": 249,
        "created_utc": 1545352204.0,
        "selftext": "**Original:** [https://www.reddit.com/r/relationships/comments/9s5so2/my\\_bil\\_34m\\_invited\\_me\\_27f\\_and\\_my\\_husband\\_29m\\_to/](https://www.reddit.com/r/relationships/comments/9s5so2/my_bil_34m_invited_me_27f_and_my_husband_29m_to/)\n\n&#x200B;\n\nI decided to give an update, since we've finally reached the end of the mess from the first post. I told my husband, shortly after I posted the story here because I was feeling very anxious and he was going to pick up on that anyway. I don't think I have to say that my husband was livid, I never saw him like that before. After a lot of talking, I ended up learning a lot about the relationship between him and BIL.\n\n&#x200B;\n\nTo keep things short, BIL is a huge asshole who has ruined relationships for my husband in the past. The only reason he didn't ruin ours was because my husband put a lot of distance between himself and his own family. His family by the way, always chalked it all up to sibling rivalry and never did anything to help, so I don't blame him.\n\n&#x200B;\n\n**What happened after:** My husband called BIL and asked him to not contact us anymore, he only wanted him to apologize to me for dragging me into this. BIL denied his request saying it was just a joke and I should be able to take one like a grown up. He hung up on us and that was that for a few days, until we received a call from my MIL who was very angry. BIL had told her and my FIL what had happened and that he was very upset that he couldn't even make jokes without my husband making a big deal out of it. So MIL was calling to say that we and my BIL's family weren't going to be invited to family gatherings anymore until everything was solved.\n\n&#x200B;\n\nI told my husband about the call and he was surprisingly calm this time around, saying that it was the usual behavior and that if I wanted to he would make an effort but he didn't care very much. At this point I was angry myself because I never saw this behavior in his family before and it was etremely frustrating. I told him not to bother and that it would be up to him to decide. We kept mostly to ourselves since and nobody reached out to us either. Until monday, when my FIL called us to say that BIL was invited to spend christmas with the family because his wife was pregnant. He only wanted to make sure that we knew this because he didn't want us showing up to \"ruin everyone's good time\".\n\n&#x200B;\n\nMe and my husband ended up laughing about it later because it was so absurd. But I noticed that it has taken a toll on my husband's mood and I'm debating suggesting therapy for him because I feel like there's a lot he doesn't feel comfortable telling me. We're going to spend christmas with my parents and I hope my husband will be able to tune out from this entire situation and have a good time.\n\n&#x200B;\n\n**TL;DR BIL said it was a joke but he was offended that we didn't take it as such. Shared with the family what had happened and eveyone ended up getting banned from family gatherings. Except now BIL can go home for christmas because his wife is pregnant. We cannot because we would ruin the party.**\n\n&#x200B;\n\n**Edit 1:** I didn't expect this to get the attention it did. I've been reading the comments and I want to say thank you to everyone who shared resources to help us moving foward. A lot of people have  also been telling their own stories and I can't answer them all but know that I read it and your advices are being heard. This has helped me to get some perspective as I cannot share what happened with my close friends. My husband is aware of this post and he will read it in his own time, right now we will be focusing on the holidays and he would rather deal with it once the celebrations are over. Thank you once again to everyone!",
        "permalink": "/r/relationships/comments/a84i3z/update_my_bil_34m_invited_me_27f_and_my_husband/",
        "comments": [
            ">FIL called us to say that BIL was invited to spend christmas with the family because his wife was pregnant. He only wanted to make sure that we knew this because he didn't want us showing up to \"ruin everyone's good time\".\n\nBull shit. He called to rub it in that BIL is the golden child and your husband is the scapegoat. Really, the only thing to do is to support your husband however he decides to deal with his family. If he wants to ghost the famdamily, so be it. Your husband might benefit from some personal counselling as he processes getting shut out by his family. You and your husband know perfectly well that BIL was not joking. He has an unhealthy obsession with the women your husband has been involved with. ",
            "Sounds like your BIL is the Golden Child and your husband is the Scapegoat. Your husband is probably holding back multiple instances where their parents picked his brother over him, and this is just the final straw. \n\nWhy would you be showing up to ruin christmas? Why would they phrase it that way? Because in their heads his refusal to see that BIL is great and doesn’t do anything wrong is bad. \n\nGo enjoy Christmas with your family. Make sure your husband feels loved and supported and knows that he is in the right here. Don’t let your in laws manipulate you into sweeping this all under the rug. ",
            "I am not exactly the most favored member of my family, to put it mildly.  I could give a long list of instances where my siblings were preferred or promoted in front of me, but honestly, it would just take too long.\n\nSo let me assure you: distance is good.  Therapy for your husband is good, because you can make all the smart decisions, but it doesn't mean it still doesn't hurt when your parents pick a visibly toxic sibling over you, because you chose to call them on their shit.  He's going to need to talk to someone about it, and just help develop some coping tools.\n\nIn the meantime, enjoy a day in your jammies until you head to your parents' place.  It's not an under-rated way to spend Christmas, I assure you.",
            "Sounds like you are both best off separating yourselves from his family.  WTF kind of mom enables sex jokes to her daughter in law from her other son?\n\nI am NC with my sister and VLC with my Dad over their “jokes” and other issues that could be resolved with a simple apology.\n\nI don’t know what the right answer is for your husband, if he wants to do therapy, by all means.\n\nMe, there’s no level of therapy that will give me a decent family, so I’ve long detached myself and moved on.",
            "You missed a golden opportunity to ask your MIL what makes her so sure that the baby is her son’s and not some rando from the orgy",
            "I would be the asshole to the in laws and ask them if they are sure on the paternity of the child. But thats just me. ",
            "Your husband might be interested in /r/raisedbynarcissists\n\nAnd for you there is /r/justnomil\n\nAnd yes, therapy might benefit your husband, I wish both of you the best of luck. ",
            "Wow. His family is *deeply* dysfunctional. \n\nI think you’re better off just dropping the lot of them. But I definitely agree with therapy for your husband. This will be hard for him, since I imagine he still held out a bit of hope that someday, maybe, his parents would wake up and see his brother for who he really is. That they’d be sorry for not supporting him when his brother was deliberately ruining his life. That there might be actual consequences someday for his brother’s behavior. \n\nLetting go of that hope, however faint it was, is going to be painful. If he’s not comfortable talking to you about it, then a neutral third party is a good idea. Make sure to shop around until he finds one he clicks with. It may take a few tries, but it’ll be worth it if he can start unpacking his feelings about his family in a safe space. It sounds like there’s a lot buried in that baggage. There’s no shame in asking for help.",
            "What an asshole. Your in laws are pathetically manipulated. He’s behavior is so fucking predictable it’s sad. \n\nThe only defense I could see if you feel like you need to stick it to his parents. Is that you don’t give a shit if it’s a joke and you aren’t childish for being offended. And if they wanna condone in appropriate behavior from BIL they can do it without being in contact with you guys. \n\nBut honestly this sounds like the pattern of the family. Golden child and scapegoat. The golden child can get away with almost anything. ",
            "Man it would be *really* hard for me to resist sending an embarassing passive aggressive gift for them to open in front of the family.  \n\"Since you all are so open minded about this lifestyle, we thought we'd buy the four of you a 1-year membership to the local swinger's club!\" with a fake gift certificate.  \n\nJoking aside, you guys handled it well. Distance is the best medicine here.",
            "Gaslighting? **Check.**  \nCompletely and arrogantly throwing your discomfort's validity out the window, even though it was 100% valid to be uncomfortable in that situation? **Check.**  \nTrying to actively punish you for setting healthy boundaries (confronting your BIL) by using guilt in a petty way and deflecting any kind of responsability, while simultaneously doing all the things above? **Check.**  \nThat is a good, old and classic *'toxic family'* case right there. **Textbook case.**  \nThe fact that such unfair, mean, and let's admit, illogical attempts to guilt and manipulate orchestrated by his entire family managed to took toll on him shows that 1) his family is *highly dysfunctional / toxic* (considering that *he only managed to build and mantain a relationship when he distanced himself from his family* should offer a clue to that) and 2) he is still vulnerable to this toxicity.  \nNow, I'm serious when I say this: being emotionally vulnerable or dependent on a toxic family is **extremely damaging** to one's emotional health.  \nI say that because I'm going through this myself. Therapy helped me a lot and, by my experience, you husband needs therapy as well. By their behavior, cutting ties with his family would be almost a no-brainer to me, but this is a thing that your husband needs to evaluate and process himself.",
            "Just love and support your husband. Reassure him that he is the normal one and that, unfortunately, his family is toxic, but that that’s not his fault. I’d start going little/no contact with whole lot of them. And good riddance!",
            "Should've told your in-laws something along the lines of \"well I mean *we* don't wanna go but *you* are more than welcome to partake in an orgy with your son!!\"\n\nIf they say anything, \"It WaS a JoKe\"",
            "Your brother in law needs to SERIOUSLY learn some key adult skills. For one, he should have known that asking something like that in the first place was crossing way too many lines. And he should have owned up to his mistake and apologized for making you feel so uncomfortable and anxious. He sounds like he's a bit off his rocker. I'm sorry you've had to deal with all this.",
            "\"It was a joke\" is a bully's defense ",
            "Sometimes I feel like shit is fucked up with my family, then I read about peoples families on here and don't feel so bad...\n\n&#x200B;\n\nTherapy for your husband may or may not help, but suggesting it may not hurt either. Honestly, just cutting this bullshit out of your lives is probably overall the best.",
            "I've had a LOT of experience with familial dysfunction, drama from non-traditional marriages/households and such and so I'm going to try and give you the best advice I can here. I've read a lot of horrible advice about poking a hornet's nest full of crazy, making snide comments about the paternity of SIL's fetus, etc ...\n\nLook,bottom line, you married into a wild ass family with a lot of dysfunction. I think all families have their degree of issues, but girl...you hit the jackpot. LUCKILY, your husband seems to be the family oddball/black sheep, which is a good thing for you- all things considered.\n\nThey're nutty and dysfunctional and if I had to place a bet , I'd say they are all totally uninterested in changing, or therapy or any of that shit so...\n\nKeep it light with this bunch. Love em from a distance. Your husband, thank God, seems to have come to terms with all this already, and isn't forcing you all to be part of their madness. Essentially, don't give them a second thought. I wouldn't suggest making any of their weird shit a hill to die on , or even be disturbed about. \n\nThey're into all their own shit. You guys aren't, and that's all ok- you can all be happy independent of one another. \n\nChalk it, and any inevitable future craziness up to \" they're nutty ASF😂\", and go about your happy life with your husband who is well aware already.\n\nIt's the best you can do. There simply is no changing , arguing with, or winning with this type of dysfunction. Learn how to let it go in one ear and out the other- IF you absolutely HAVE TO deal with them- and do not let it spill into you and your family's life and happiness. Do your thing, let them do theirs. ",
            "Therapy might help\n\nHugs, kisses, affection and intimacy maybe all he really needs. \n\nThe real shame is that it seems the BIL has reproduced. ",
            "My big question is who got the BIL’s wife pregnant?  They are swingers, after all.\n\n\nBut joking aside, my wife and I cut out a brother and I think it has actually helped a lot in our marriage.  It’s really my borther’s wife, but she is someone that clashed with me and my wife constantly.  It was sooooo hard for me to try and bridge the gap and “keep the family together” but in the end, I am so happy I stopped caring.  There is room for reconciliation, but the distance has been nice.",
            "I'm impressed with your husband for being so reasonable, having come from such a ridiculous and obnoxious family. \n\nIt sounds like you two more or less have this under control, and I agree that you could suggest that the two of you or just he could talk through some of this drama with a therapist because there's a lot going on there.\n\nBut, I mean, if your husband isn't too upset about this, and you're doing okay, then I mean, not every drama requires a mental health intervention. ",
            "You’re doing great. Give your husband and yourself a lovely Christmas with lots of treats and great food. I HIGHLY recommend completely ignoring texts, calls, social media - any attempts from that bunch of weirdos to get your attention/show off. Treat the Christmas period as a well-deserved break for you both. Look after each other. \n\nTherapy decisions and a discussion of whether to go NC (I would, cos fuck that noise, but your DH might not be there yet) can be scheduled for a fixed date early in New Year.\n\nJust sounds to me like you both deserve to switch off from the situation for a little while.",
            "First of all.... DAFUQ?!??!?!\n\nIs this like an Eyes Wide Shut thing or is he like hoping to blow his brother in this orgy? ",
            "A joke, my ass. It's only a joke now that you didn't seriously take him up on his offer.\n\nWhat a bunch of assholes. You're a kinder person than I am. If FIL had told me SIL is pregnant, I would've replied: \"Awesome! Whose is it?\"",
            "I'd be tempted to tell them.\"no,we're definitely going to show up at Christmas. See you on the day\"... With no intention of going in the first place.\n\nThen turn your phones off and have a great day.\n\nThey won't be. ",
            "Woah... Coming from us, a couple that are usually pretty open with sexual deviancies, this crosses a huge line. Sadly I didn't see this post before, I would have commented.\n\nYour BIL wants to bang you. I don't see anybody else really mentioning this but yeah, this is basically what's going on. Obviously you won't cheat on your hubby, so to him this is the next best thing. \n\nThis is incredibly inappropriate on so many levels. Again, me and my partner are pretty open about this stuff but it even grosses us out. \n\nAs for his family, it sounds like they don't have the full story, and even if they did...wow. That opens a whole new can of worms. Are they being complicit in this sort of thing because they find the idea of two brothers wife-swapping to be acceptable? Do they also secretly want to join in? \n\nHonestly with behavior like this, I'm actually afraid for your safety if you did go over, so nothing lost I guess. Please don't go over.\n\nGo have Christmas with your own (OP the wife's) family. Or, worst case, spend it with some close friends.\n\nAfter Christmas, I would recommend some counseling for your husband, because like somebody else mentioned, he's probably been subjected to a lifetime of gaslighting, which is now only coming to light because of how obscene things are. Personally I would ghost or gray rock them until the end of time over this, but that's easy for me to say.\n\nEww.\n\nAlso, they may have seemed normal before, but in our experience people with certain proclivities usually live very very \"vanilla-looking\" lifestyles. Don't judge a book by its cover. These people will change completely once the doors are closed. ",
            "It does NOT matter at all if it was meant as a joke. If it made you uncomfortable he owes you and your brother an apology. If it was really a joke he would say so and follow it with an \"I'm so sorry I didn't mean to offend and it won't happen again\" or something along those lines. People can't always read others and jokes that aren't appropriate are told, but adults own up to their mistakes and apologize. This is a good show of how this family operates and it would be good to try counseling with your husband if you feel he's bothered by it or other things you might not be aware of at the moment. You are not required to take this kind of joking simply because others are shit heads. ",
            "Therapy would be a fantastic thing for your husband.  My grandparents almost let my dad go to jail in the 60s for things my uncle did.  It took my dad years to be able to step back and see his family didn't care for him.  He had stopped talking to most of them for years before speaking with a priest and coming to grips with everything.  \n\nHe now has a relationship again with a sister who's still alive.  But his brother only comes around when he wants something, and my dad now understands that he doesn't have to give the baby if the family everything baby wants.\n\nOnly took 6-8 months.  I think you'd see it as money well spent.  Things like this don't go away until they are dealt with, and a counselor can help him deal with it.",
            "I fucking HATE your husband's shitty parents. I feel really sad for him. 😔",
            "Aww, man. That's super rough. I wish your husband lots and lots of peace 💜",
            "Your husbands family is fucking crazy. You should cut ties. He knows god damned well it wasn't a joke. If they were normal BIL would have told his parents and his parents would have said then don't make jokes like that towards her, its inappropriate. This dude is a creep. And the fact that his parents are on his side for some reason says a lot about them. ",
            "I’d be petty. Tell them to pass on you congratulations on the pregnancy and ask if they know whose it is. ",
            "Never contact these people again. Block them. That’s it. I’m sure it’ll tick them off that you two aren’t reacting to their crap 🙃",
            "Who needs family... If they are like that. Better to cut ties and free yourself of this burden. Can't imagine this ever bringing you happiness. ",
            "His family is full of fakes, you’re better off without them. ",
            "Sounds like your husband definitely should get some therapy, and he should also cut them out of his life, as it seems like he's already moving toward that. It's likely the healthiest way to go. That family is clearly over-the-top toxic. There's messed up, there's toxic, and then there's your huaband's family, that takes it to a whole new level. Good riddance to toxic people. ",
            "Wow. Yeah I'd definitely encourage therapy. They're crazier than hell. Make sure your family gives him some extra love and affection this Christmas. Poor guy. ",
            "You're a good wife.  He sounds like a good husband.  I hope you are taking good care of each other in this trying time <3 \n\n",
            "Its gonna be funny when BIL announces that the child isn't even his.  *kanye shrug*",
            "Your in laws are messed up. Sympathy.",
            "I think your husband is most likely feeling frusted and angry like yourself at this unusual situation that his family have put you both in. \n\nI think you should both just focus on positive things together and put your husbands family at the back of your mind. Therapy might be needed but at this stage I'd not mention that while your husband is still angry and upset and instead remind him that you appreciate his support and that if he ever needs to talk about what's happened now or in the past that you are there for him too! ",
            "I think this was the plan from the beginning, your BIL knew you would refuse.",
            "Sounds like you guys have a really great and strong relationship. You are handling this perfectly. I think your right about therapy for your dh, even if it's to offload and have someone reassure him that these behaviours of his family and past incidents aren't normal. Keep ignoring and tbh don't even bother answering their calls if you can screen them. Also voicemails could be useful evidence if they start to escalate. Keep texts too for this reason. Grey rocking is a very useful tool for any interaction with people like this, take a look at justnomil for some great tips on dealing with these sorts of nutty in-laws. Good luck guys",
            "> Me and my husband ended up laughing about it later because it was so absurd. But I noticed that it has taken a toll on my husband's mood and I'm debating suggesting therapy for him because I feel like there's a lot he doesn't feel comfortable telling me.\n\nIt's baffling, but it's all so clear and simple and that makes it probably easier to accept. For your hb, this is a big blow and an energy drain. I hope you can do something to get out of this mess, like taking some days off after christmas and going on a city trip or hiking or something he likes, that can take his mind off of this. It could take courage for him to go to therapy. I hope you two find a way out!",
            "I'm probably weird, but would not have been hugely offended by the question itself, as long as the \"No thanks\" was respected and not \"You'd better ask your husband.\". \n\nAll that aside, if it had been a well-intentioned interaction, you would have gotten apology in spades from BIL. Instead: He complained to his parents about you. Got you \"both\" disinvited from all family events. Talked them into allowing \\*his\\* family only into family events.\n\nWhat a manipulative asshole!\n\nGood riddance, honestly. Your husband will be sad about it, but it's nothing to do with you. It's just wishing his family could be different. But they're not, so.",
            "Looks, this comment isn't going to be supportive or enlightening, so turn away now if you are expecting that...\n\n\nBut is this opposite land? I mean, seriously. I've put up with things like this. I've known countless people who deal with this kind of BS, and it just feels so counter intuitive to how everyone I meet wants life to go. It really baffles me that we would, as a society, have a broad and even subconscious understanding of how healthy relationships should operate, and yet almost no one I run into holds themselves or others to that standard. Again, like I said, almost the exact opposite.\n\nWhat the fuck is going that this is how things operate? I feel borderline in-human sometimes for wanting basic things like, oh, I don't know... respect, autonomy, justice, a general sense of ease and happiness....",
            "What backwards fucking parenting is this?! I can’t think of any parents I know who wouldn’t have gone apeshit at their kid for even JOKING about inviting family to an orgy. They definitely wouldn’t believe the “waaaa it was just a joke really why can’t they give me a break waaa” it’s the cheapest way to cover your own arse, because JNBIL was clearly not joking. And again, who even makes a joke like that - sober?!\n\nFrom the way FIL worded his text, he was aching for a negative reaction and/or a livid phone call from DH. Don’t even entertain it! I mean, the most you should do is text “okay :)” but that’s still requires way, WAY more effort than they deserve. I hope you and your JYfamily have a wonderful Christmas :) \n\n(Sorry if this turned into a bit of a work salad. I’ve been working tirelessly since the start of the month so I have zero energy)",
            "Therapy and support groups such as r/raisedbynarcissists do a great deal.",
            "It doesn’t get better. Detach from husbands family. Run. Can you spend the holidays with your family? Are they better than these weirdos? ",
            "I would, in that situation, tell my father or FIL to eat my ass, hang up, and move on with my life. They will clearly be of no benefit to you",
            "[deleted]",
            "Call up BIL:s wife and invite her to a preggers orgy",
            "Wow, cut them all out of your lives immediately. They sound like horrible human beings. ",
            "As a scapegoat myself, I learned to just say what I'm really thinking or how I feel. Since my family is going to make a big deal out of something small, why not really give them a reason to be upset.  \n\nYeah at first it was difficult since my whole life was to make my parents proud of me, but you just get tired of it when YOU keep getting blamed for everyone else's crap. Now, I live my life how I want and do what I want with my life. I stopped living by their rules and began living by mine, I am not a wildling. I don't drink or do drugs, ar this point I'm not really sure why I was crapped on for so long 🤔.\n\nThe funny thing is that I consider myself the black sheep of the the family. I have not been arrested, I have a college education, and Christian. Most members of my family have been jail or prison visitors at one point 🤣.  \n\nLive a productive and healthy life. I learned most individuals who envy you, often make mountains of ant hills. Sadly, most of the time it's family. So I came to realize that family isn't always blood related 😉.",
            "I'm sorry you and your husband have to deal with this stuff with his family.\n\nAlso \"it was just a joke\" is such a copout when you've offended someone. And who jokes about inviting family to an orgy anyway?!? \n\nAnyway it seems like you will both probably have a much better Christmas by yourselves.",
            "I have a really torn relationship with my brother. My brother hasn’t done anything like ... invite my SO to an orgy ... but he’s an unempathetic and selfish. \n\nMy family always sides with his and always acts as if I’m overreacting. I experienced something similar. **And it can cause ALOT of anxiety**. All I can tell you is that your support will mean a lot to him. And make sure you let him know he has the right to feel upset and it is sometimes healthy to cut ties. \n\nMy family did come around understands and accepts that I only play lip service to my relationship with my brother. And they have stopped trying to interfere. I wish you the best! ",
            "If you want to be passive-aggressive (like me!) next year plan an elaborate Christmas vacation so while they are having theirs you can be posting about how beautiful Paris is at Christmas or something like that. I think I'm going to do that myself since I've been wanting to check out their Christmas Markets forever (not the one in Paris but maybe Strasbourg).",
            "I bet the BIL's wife is pregnant with the fucking antichrist",
            "Oh, I remember this post.\n\nReminds me of when people do truly rude things and say, \"It's just a joke man.\" If it's a joke, and you're supposed to take it \"like an adult\" then there are real adult consequences. Don't complain if the consequence is being cut off for being an asshole. He should be the adult and apologize for saying a joke (or not) that was negatively received to that degree. While I'm all for people doing what they want (not going to negatively view them for participating in orgies), like, read the freaking situation. You said no. That's enough to back off. What did he think? That you'd be like, \"Oh, now that you said to have an open mind, suddenly I want to go!\" And now his family is like, \"Wasn't even a big deal.\" I hate when people try using that reasoning. If it's not a big deal, it's not a big deal to apologize about it instead of throwing a tantrum. \n\nIt's a tough position to be in for your husband though, don't know what to say much about that because I don't think I'd care if my family was unsupportive of how I'm personally feeling in a situation involving me. However, he could benefit from therapy as you've mentioned. If his mood is changing (negatively anyway) from something so ridiculous like that, he might have some remnants of wanting his family to recognize him. I know I did at one point. \n\nI wish you guys luck in that whole... mess. ",
            "> FIL called us to say that BIL was invited to spend christmas with the family because his wife was pregnant.\n\nI would've offered congrats and good luck...on figuring out who the father is",
            "I am affraid there is no other option than cutting the inlaws out your life as much as possible. Your inlaws are creepy and I thought mine are weird. But yours are toxit for the both of you.\n\nThere is only one sivler lining: You two are probably never going to fight with whose family you want ot celebrate christmas with. It will always be yours.\n\nWhen I realised how weird and part time toxit my then future inlaws were, I dropped a hint to my parents, who then opened up to him and made it to clear to him, that they view him as second son. It helps that he and my brother get along wonderful.\n\nWhat I am trying to say, it may be a goog idea to enlist the support of your parents. A therapist maybe good, but he is not able to give him something he is lacking: Parental love. Your parents are able to fill that hole, at least to some extent. Mine do it for my husband, and it so heartwarming for me to see, how much they love him and he loves them.  \n\n&#x200B;",
            "> He only wanted to make sure that we knew this because he didn't want us showing up to \"ruin everyone's good time\". \n\nHahaha how the fuck old are these people? The mental age is...astounding here!\n\nI have a friend who has in-laws like this. Last time she visited them, her MIL told her she wasn't invited back ever again because she starts drama.\n\nWhat drama you ask? Oh, she'd just gotten off a red-eye flight and wanted to sleep, but the family wanted her and her husband to sit around and watch them do nothing.\n\nThese people are useless. You and your husband can cut them out. It's ridiculous.",
            "Tell everyone in the family the BIL cheated on his wife/GF with another woman. Then after everyone is pissed off, just them it was just a joke and no big deal. Its offensive, crude, and rude of him to say what he did and has me wonering if he has it thing for you. ",
            "It sounds like the problem has solved itself. They don’t want you guys there - that’s a punishment?? Sounds like freedom to me. Make it permanent and you’ll find happiness following after.",
            "That sounds weird. Like you are getting hazed by BIL and the BIL family is enabling him.\n\nWhat a weird situation. How do you explain why people do weird stuff like that?",
            "Part of me wanted the update to be \"Talked to husband and we decided to take BIL up on his offer\" lmao, just so I could have my jaw drop.  \n\nSounds like you guys handled everything really well, cheers to family being weird.  ",
            "That call just to tell you about an event you're not invited to reeks of desperation. Would husband normally have contacted them after MIL saying they weren't inviting you to things anymore? If so, it sounds like his ignoring it this time got to them. Good on you both.\n\nTherapy does sound like a good idea; these kinds of family dynamics aren't \"normal\" and would get to anyone; it makes perfect sense to want to at least talk about it a bit with a professional who might have experience with such dynamics. It's really up to your husband whether he feels that might be helpful to him though.",
            "Do we even know for sure who got the wife pregnant 🤔",
            "Shouldn't be this is some disaster sub :d",
            "BIL's child is someone else's. That'd be hilarious.",
            "I wonder if the baby is his.",
            "OP as someone with a strained relationship with his family just remember that you are family too. In fact the best Thanksgiving I ever had was one where me and my so literally just spent an evening alone in a hospital parking lot. (Long story).\n\nMy point is just be there for him and things will be ok.",
            "I didn't get to see the original post, but reading the fallout here, you've possibly given your husband the best present of all - a fucking break from his poisonous family. Good for you and good for him for standing his ground. Celebrations for all! Happy holidays.",
            "Imagine the MIL/FIL face when the find out the baby daddy isn't BIL!.  ",
            "She's pregnant !?!  LOL Oh yes, by all means stay away ! ",
            "Toxic family so what's the point. Seems like if you continue any sort of contact it will be a detriment for you two. Just let it be. ",
            "Honestly, I know they're your family, but fuck them. They sound completely toxic and dillusional, best shut them out, they'll inevitably start hating themselves ",
            "Life truth #274: some family are shit family. Your husband has a shit family. I support therapy. They’ve likely been shot to him for a while. See, shit people don’t like when non shit people are around. So they try to convert them. If they can’t they all take turns taking bigger and bigger shits on them to tear them down. Work that out with a therapist and never look back. Peace!",
            "I relate a lot to your story. My husband is the scapegoat of his family and it’s been a rough road. I would strongly recommend therapy. Just my two cents, do not let them manipulate you, op. I allowed it for years thinking things would get better. No contact with his brother is a great start. ",
            "The family structure sounds EXTREMELY toxic. I can’t imagine growing up in a family where parents took sides against their own family and issues between siblings. \n\nThey sounds like a narcissistic family structure with a golden child and an invisible one. Therapy would be very helpful, because when crazies like that define “normal” to you as a kid it’s very scarring. ",
            "So much drama. Just ignore them.  I'm literally not inviting my parents and brother to my wedding.  ",
            "Sounds like you are both far better off. \n\nMy aunt is like your BIL. She spent her whole life as the favorite and now anytime someone disagrees with her or refuses to let her BS go, she acts like theyve mortally wounded her. Her husband is the most beat down dude around. \n\nYour BIL is a miserable person and your inlaws contributed to that mess. Good riddance. ",
            "Man this sounds so much like upper class spoiled family with black sheep syndrom.\n\nthat your BIL is an Arsehole welp invitin your SIL to an Orgy is 1o1 Arsehole-Manual Page 17.\n\nYour Husband would be probably better with a Therapie. \n\nI also would block all numbers of that shit show of a Family in the router by the way. you then wouldn't even see a ringing on your landline.\n\nIf your hsband really wanna see thier world burn, do an announcment in the local news paper under the recently deceased part:\n\nHusbands Familyname- Finally without you and your crazyness \n\nHusbands and your name",
            "Your husband's family is overtly toxic.  Inviting your known-non-swinging sister-in-law to an orgy is not a \"joke,\" it is boundary-overstepping of the worst sort.  It is past normal bad manners; it is the kind of behavior that in times past might have led to brother killing brother in a duel.  Condoning or excusing this behavior is detestable.\n\nBanning you and your husband from a family gathering  because someone behaved in this crass manner towards you can be looked at two ways.  On the one hand, it is detestable.  On the other hand, because this toxic family gathering is a place where ill manners and foul behavior are not only tolerated, but coddled, the ban may have inadvertently done you a favor: you can drop these garbage people forever, and avoid their noxious gatherings, without being blamed for it.",
            "I'd make sure that the rest of the family knows what's happening, don't let BIL share his version, or lie, and make you come off as the bad guy.",
            "Lol, what an asshole BIL is.  In your first post, you said when you turned him down he said to tell your husband y'all should think about it?!  He knew exactly what would happen if you told him, and he was definitely hoping to ruin some relationships for your husband and you.  ",
            "Y’all should take a surprise visit to Disney. \n\n\nThat way when they try to rub in their “wonderful”Christmas, y’all can be like “oh that sounds quaint, Disney was amazing”",
            "The only way to make this better is to just completely remove/go no contact with people like this. ",
            "You and your husband are on a great path together. Great suggestion about counseling. It’s not the easiest to distance yourself from family - no matter how toxic. How sadly disturbing of you in laws though. “How dare you not accept their “fake”invitation to the orgy?!”\nJudging from your original post, do they know for sure it’s even the BILs Baby? S/",
            "Long story short. Your family is garbage. I would call the police and place a restraining order on your brother. Inform your parents you made that decision, and that in lieu of a logical unbiased response from them, you do not wish to undergo abuse by proxy through them as they are clearly biased in his favour. As you move forward in the right direction, and your parents see you leaving their lives towards greener Pastures they'll reach out and admit and apologize for their bias. Or they won't. Either way you've made the correct decision for you and YOUR family. Cheers.  ",
            "Yes yes yes yes yes to therapy. It's not a sign that you've failed to solve your own trauma, it's a sign that you are ready to do the emotional and psychological work to *fix what these horrible dangerous toxic people have done to your husband his entire life*\n\nFind a therapist who specializes in treating childhood trauma. That's what this man has survived. \n\n\"Be sure you don't come around and ruin everything with your presence\" is hilarious of course because no way would either of you behave as badly as BIL. But it chilled me when I read that because it is sooooo abusive to say to anyone who asks for an apology. The fact that your DH is like yep, this is always what comes next makes me deeply sad for 5 year old him, 10 year old him, 15 year him....all of them.\n\nYour current situation is what many here call \"the trash taking itself out\" -- appreciate it for the blessing it is. Your husband was right to protect you from them and now you know why. Enjoy your lives away from all of them and don't give them any more of your time. \n\nP.S. I can't shake the feeling that BIL's plan all along was to get you both banned forever. Like, he's currently disappointed he didn't get to witness your husband's lividness at the party because you played it chill. He still got what he wanted in the end, but no blowup at the family gathering.",
            "I would send an email to the ML,FL, and BL stating that you were there and BL was NOT joking and he knows it, and that you have no intention of attending any \"family\" functions as long as they refuse to show some decency and respect, or apologize for having failed to do so before.",
            "This is some seriously dysfunctional behavior from your husband's family.  I suggest posting in r/raisedbynarcissists and getting some feedback from them. Thry can be very helpful. ",
            "Go and ruin the party, they all sound like assholes.",
            "It sure seems that not a single family member is making any effort at all to understand how you must have felt and to put themselves in your shoes, choosing instead to be indignant on their own behalf despite the fact that you were the one who was put in the uncomfortable situation.  Have you tried explaining to them yourself how it felt?  I would say something to the family \"If you really don't care enough to understand how I feel and instead choose to punish me for feeling defensive in an incredily uncomfortable moment, then I feel no great loss at being uninvited and would prefer if you would continue to not involve us in family affairs until you're more considerate of our feelings, too\".",
            "K but next time you see them make sure to ask who the father is, ask multiple times if they’re sure, and then pretend it’s a joke. ",
            "Can't help but wonder if it's BIL's baby...considering",
            "So the BIL and SIL are going to raise a child in a household where mommy and daddy are regularly having sex outside their marriage? And they’re sure the kid is even his??? Poor kid, I hope for it’s sake they give it a normal childhood and a normal upbringing. That kid might never grow up knowing what commitment looks like.",
            "This sounds like something from a sitcom ",
            "Yeah, being shut out of family events is a strange reaction. The issue is between you, your husband and BIL. The incident has nothing to do with the rest of the family, you are all adults. And tbf it also makes no sense for BIL and his wife to be invited just because she is pregnant. Rents in law are playing favourites and are forgetting how old their kids are.",
            "[removed]",
            "Just out of curiosity... why does everyone in these threads suggest therapy? Is it a common thing to go to in whichever country is most common in this thread? Sometimes things happen that we need to manage ourselves. It’s okay to be sad. ",
            "[deleted]",
            "[removed]"
        ]
    },
    {
        "post_id": "3pudml",
        "author": "wannacomeclean",
        "title": "[UPDATE] Want some advice on how I [29F] can \"come clean\" to some new friends [32F, 34F, 34M, 38F) I've gotten close to over the last 6 months to whom I've been lying by omission.",
        "url": "https://www.reddit.com/r/relationships/comments/3pudml/update_want_some_advice_on_how_i_29f_can_come/",
        "score": 4615,
        "num_comments": 196,
        "created_utc": 1445559746.0,
        "selftext": "(My first post) [https://www.reddit.com/r/relationships/comments/3pcfi6/want_some_advice_on_how_i_29f_can_come_clean_to/]\n\ntl;dr of first post: Want to tell my close friends of 6 months that I lost my husband, daughter and a pregnancy 3 years ago and have lied to them about it by omission since we met.\n\n\nSo I really want to first take a moment to talk about how awesome my experience in this sub has been. I knew that I wanted to tell my friends the story of my past, and I knew they would react pretty well, and I knew they'd be supportive and we'd remain close friends. I really just didn't know how to bring it up after SIX months. I don't know if I expressed it in my first post, but 6 months is kind of a long time, I feel so close to these people in so many ways, so mostly it was just weird to me to not be able to casually mention my family. I absolutely still have days where it's hard to get out of bed and I just want to be left alone to cry in the dark, but so many times I think of happy memories with my family, and adorable things Veronica did that I'm reminded of and I want to be able to pepper those into my conversations. I struggled with HOW to tell people. One on one? Big group dinner? Email? So I actually emailed them all the day after my first post here and invited them over for dinner the next night if they could make it on short notice. I said to please bring their SOs, but told Kelly I'd explain later why I think she shouldn't bring her kids this time. Honestly I was just afraid she'd get really upset and wouldn't want her kids to see her like that. She couldn't get a sitter, so her husband stayed home with the kids, but Brenda and Luke brought their SOs, and I made a huge pot of chili and some cornbread. I feel like they sensed something was up, because honestly I thought the odds of them all being able to come with one day's notice was unusual. \n\nThey showed up early evening, we sat in my living room (tight quarters!) and had some wine, and then I started. I'm an awkward person, so I basically said \"I have some big information about my past that I really want to share with you. It's not something that I share with everyone I meet and it's hard to bring up, but now so much time has gone by and I feel so close to you all, and I really want you to know this part of my life. I think it'll be emotional for you all to hear about, and I think it'll slightly change our dynamic for a while, but I'm also really excited to share this with you.\" A couple of the girls were already teary. I didn't know if they'd googled me and already knew what I was going to say, or if they could just sense the emotion in my voice. I wanted the next part to be really blunt and not beat around the bush and first set it up so they wouldn't see where I was going. I said, 3 years ago my husband, 2 year old daughter and I were in a car accident when I was 5 months pregnant. My husband and daughter were killed instantly, and I lost the son I was carrying, but was otherwise physically okay.\n\nEveryone was silently sobbing at this point, including me. I told them why I moved away, why I wanted to start fresh, and why now I needed them to know my story. Kelly got up and came over and sat on the floor by my feet and cried into my lap for a while. I stroked her hair and told her it was okay, and that her kids are the first kids I had contact with since Veronica and it genuinely gave me so much joy to be around them, and that the only thing I would change is that I'd like to share stories about our kids, talk about what Veronica liked to play with or the \"words\" she would say, diaper rash. We were all still crying, but there was a lot of smiling and joking too. I tried to break the ice a little bit with Kelly and said \"you know what this means right? I have had a baby and still look hot in a bikini!\" We giggled, she said OMG I can't believe I said that, I said I take it as a compliment and assured them all I would not hold anything against them they said previously that in the light of this new information could now be seen as offensive. \n\nIt wrapped up so neatly like a goddamn sit com! I mean, they are good people and I knew it would. With all I've been through I'm choosey about who I let into my life and I could tell they were good people who would react well, but they've also all been friends for SO long, it always kind of feels like I'm the new kid and we aren't on equal footing. I am glad I told them all together though, instead of telling them individually. I honestly don't think I could have handled that emotionally, going through it took a lot out of me. \n\nBrenda actually said that when we first met and she was looking up to see if I had Facebook, she came across a headline about my accident but didn't click on it because the headline was so horrific and she assumed it was just someone with the same name. We finally ate chili around 10:30. I do think they'll tread lightly around me for a while, but I also think this is going to bring us closer. And I don't intend to bring my family up often, but I'm glad now I can share stories about my wedding planning, childbirth, breastfeeding, etc. I never wanted someone that I could cry to about missing my family. Honestly....that's mine and mine alone. I still go to therapy, so I'm not keeping it inside, but it just doesn't work for me to express my grief over my loss to others. Thanks for helping me talk this out Reddit.\n\nThank you to those of you who sent me PMs sharing your own losses or just wishing me well. I could not have had this particular conversation with anyone in my real life. You were really here for me. That means a lot.\n\n\n\n   \n**tl;dr**: I spilled my guts to my friends and it went as well as I could imagine. I think it'll bring us much closer.",
        "permalink": "/r/relationships/comments/3pudml/update_want_some_advice_on_how_i_29f_can_come/",
        "comments": [
            "[deleted]",
            "[deleted]",
            "I'm not going to read this because I don't want to get teary as I'm leaving work, but I'm happy for you, OP.",
            "Awww this made me tear up OP :) \n\nIm glad this all worked out!",
            "I am so happy things worked out with your friends! The way you described them and said they were great people, I knew they would be awesome. \n\n> I could tell they were good people who would react well, but they've also all been friends for SO long, it always kind of feels like I'm the new kid and we aren't on equal footing.\n\nTHIS. Thank you so much for saying this. It is never too late to make friends or \"join\" an already established group. An addition to such a longtime group of friends just makes it sweeter and more loving than it was before! ",
            "I've been looking forward to an update since you first posted & now I'm sitting over here crying because I'm so happy for you. Stay strong, lady. You sound like a great person who has made some wonderful friends!",
            "Wow, OP. You have me in tears. I am so happy for you that you now have such a wonderful group of people in your life. I admire your courage and strength so much! And I will make cornbread and chili this weekend in your honor :,)",
            "I didn't sign my permission slip to go on this feels trip. Still, such a happy ending. Good luck to you, OP.",
            "Why did I read this at work. My coworker comes to ask me a question and I'm trying to wipe tears away, I just told him I farted and it was burning my eyes. ",
            "I don't know what I could say to add to this perfect, *perfect* update, OP. Just that I'm really stinking happy for you. Reading through this post brought some genuine smiles to my face. Like, I'm ready to weep tears of relief for a complete stranger. I'm just, gaaah...so glad this worked out good for you. \n\n*Doing a mental happy dance*",
            "Fucking A ...it blows my mind what people go through. I'm so glad you found these awesome ladies and are able to move on with your life, in whatever way that is. ",
            "I'm so glad things went well for you.  Your original post broke my heart so deeply.  I'm pretty Jaded sometimes, but hearing your story gave me some much needed perspective on several fronts. Thank you. ",
            "So good.\n\nAll the best to you, OP.  It sounds like this new chapter of your life is coming together really wonderfully.",
            "I was thinking of your story earlier today! I'm so, so glad it worked out for you as well as it could have.\n\nTake good care of yourself, OP. <3 :) And best of luck.",
            "I am so deeply happy for you OP. ",
            "I'm not a religious person at all, but I feel like these people were put in your life on purpose. ",
            "I'm so glad this worked out for you. You have some great friends there! ",
            "[deleted]",
            "Damn chilli at 10:30 sounds like you're asking for trouble later",
            "A drunk driver ruined my life too. I'm glad you seem to be doing ok",
            "OP, I wish you nothing but the best. I can't even imagine the horrors you have lived through. These friends seem wonderful.",
            "This is a wonderful update.  They sound like great people and I think you handled this beautifully. ",
            "I have no idea what to say to you. This is the best thing I've read on reddit in however long I've been here. I wish the best to you. I'm happy you can handle your situation as well as you have. Most people couldn't. Thanks for being awesome.",
            "You may have lost your family in an accident, but you've gained a new family.  \nTruly caring companions.  \n  \nAnd you still have the option to start a new family of your own again.  \nBless you, and your courage, girl.",
            "Hey man, I had a fucking worst day today. Had a huge accident and yet alive. I just read your post and I feel amazing. Thank you for telling us your story. ",
            "Well, I'm 27 year old male and I'm in tears reading this. I'm glad to hear you've found close and dear friends who I'm guessing will be friends for life. \n\nCheers!\n\nEDIT: Definitely done with reddit; I've read all I need to.",
            "I am sure this will get buried.  But - you sound like such a genuine person with such great love in your heart.  I hope you continue to find new happiness in your life :).",
            "Wow, this is such a touching update! You're so lucky to have supportive, awesome friends! You're an incredibly strong person, OP. Your first post nearly brought me to tears and this one did as well, but in a really \"I'm so happy for you\" kind of way.",
            "Oh I am so glad for you that this situation worked out in the best possible way. How wonderful for you to have such supportive people in your life. :) Now that YOU aren't walking on eggshells around THEM and trying to avoid the subject anymore, I hope it will help you continue to heal. <3 ",
            "I'm so glad it worked out.  I know it will never be easy, but I do hope time is healing for you and that you find joy with the new friends.",
            "This is a great update. I am really glad Brenda chose not to bring it up with you, as this was a much better way for you to unveil your situation. Best of luck OP :)",
            "I am so glad you updated here :) Your story stuck with me.",
            "So happy it worked out for you OP and I'm so glad you were able to find these great people to start your new life with. Best of luck to you.",
            "Your story is so sad and beautiful at the same time. I wish you the best life can offer you, OP!",
            "My heart is bursting with happiness and heartbreak at the same time. ",
            "Damn you put too much onions in that chili",
            "I'm very happy for you OP. I cried while reading this. \n\n",
            "I'm so glad this went well for you and I wish I could give you a hug.\n\nMy grandma (not by blood) lost everyone she loved before she eventually passed away...and while she lived like normal, you could tell that underneath it all, she was very happy to go meet up with her family again. Relieved. It wasn't super obvious, but it was just something you know without needing to be told.\n\nI don't know what you can take from that but you'll meet more family that you didn't know you had, maybe you've found that in your new friends :)\nGood luck in life, and know that your family is watching your story play out and they'll be there for you at the end.",
            "Reading this in the train was a bad idea, but damn am I glad you gave us an update.\n\nYou have found yourself some quality friends, really glad this talk turned our the way it did! ",
            "Onions, fucking onions everywhere. I'm at work, dammit!",
            "❤️",
            "And now I'm crying at my desk at work. You are an amazing woman, and you have found some seriously special friends. ",
            "This is one of the most beautiful things I've ever read on reddit. \n\nI don't even know you and I'm so happy for you to have found such great people to share your life with. ",
            "This was an incredibly sweet update OP. Made me tear up! \n\n>\"you know what this means right? I have had a baby and still look hot in a bikini!\"\n\nI thought that was hilarious :)",
            "Damn lady, just reading your posts was like cutting onions. I never took you for (at least not from your two posts FWIW) as some attention grabber. You seem very genuine and that's refreshing. I don't need to tell you this but you've got a good head on your shoulders, I think you already know this but I thought I'd concur with that affirmation. You're a stronger person than I am. Just keep doing you. I'm happy things are working out for you. ",
            "Thank you so much for updating. Some ninjas were chopping onions in my room when I read this!",
            "I have tears in my eyes and this does not really happen to me (like ever)...I wish you all the best for your future",
            "Thank you so much for posting this. I'm laying in bed crying. You're a beautiful soul and a great person. It takes a lot to be vulnerable in life. \n\nI'm sending you a hug because hugs are awesome and I kinda needed one. ",
            "This has genuinely moved me. What an incredible story. You, OP, are an inspiration.\n\nAnd, Redditors, you are all quite amazing.There is some really fantastically helpful advice being given here. I am stunned, purely because people have taken time to give sound and helpful advice....Wow.\n\nThank you, I am humbled.",
            "Thank you for sharing your story.  It's made me think of a few things I've been keeping from my friends.  If you can do that, surely I can tell them my little \"secret\"",
            "My eyes are sweating really bad!",
            "Thank you so much for updating us all. I arrived late to the party on your original post and felt that everyone had already given you the best possible advice. I am very glad it worked out nicely for you. \n\nAlso, I'm pretty sure someone is cutting onions at my desk.",
            "I just read your first post and this update. Thank you for giving me perspective on so, so many things. I wish you and your friends all the best.",
            "I am so glad you have such wonderful people around you and this is one of the best updates I've ever read, I'm teary too!",
            "YAY HAPPY ENDINGS!",
            "Wonderful update and you brought me to tears again.  ",
            "This just made my week! Thank you for the best update ever kind redditor.",
            "Thank God I was in the bathroom at work while I was reading this. People seeing my sobbing in my office on a Friday would have been bad for my young tough guy image. \n\nI'm really happy for you Op. You're a much stronger person than I am. I hope everything in your life continues on this same forward trajectory and carries you to a place of healing. ",
            "I've been waiting for this update. I'm so glad things went well. It seems like you found a great group of people. <3",
            "I'm glad you have such good friends! <3",
            "Interesting posts! Thanks for sharing, and best of luck with everything.",
            "Glad to hear it went the way you (and I think most of us) expected, and now that weight has been lifted off you.",
            "Op I am just so glad that you have found your people. They all sound wonderful. ",
            "This is beautiful - I'm so happy that you have good people in your life who are there to support you and who you can trust with this information. You deserve so much happiness, so glad that this went well!",
            "This is the first time that /r/relationships has made me cry. Thank you so much for sharing OP. I'm so glad you have found a little bit of happiness. You deserve it and I wish I could give you the biggest hug in the world right now. ",
            "I've never had such a terrible loss (and so I didn't PM).  I am amazed at you.  You make me have faith in humans.  Your friends (sitcom conditioned or not) are amazing.\n\nYou, by the way, are an extraordinary person.  I hope you keep all of us in mind as you go onward - because although none of us can even remotely help you with your loss, we are rooting for you and we care so much.  I seriously think about you every night.  \n\n",
            "Dear OP, I also want to echo the love you're hearing from everybody else here. Also I was curious, I have to know, what happened to the drunk driver? Is he/she behind bars forever?",
            "Crying as I read this. Truly want the best for you and glad you've found your friends!!",
            "They will tread lightly around you because you fed them chili at 10:30. Bad joke, I know. \n\nIt seems like these friends still want to remain your friends. I am a mom and if this happened to me my friends would be awkward. So, give them a chance. They may ask strange questions as friends are wont to do. Try to answer truthfully. Really it sounds like you have met an amazing group of friends. Keep those lines of communication open. \nAs a last note, if they are offering to talk to you and say things like you can always come to me, please go talk to them. Sounds like you were able to find a great group of people. Keep them in the loop. ",
            "There's a quote from Sports Night that I really love that says, \"This is what friends gear up for.\"  I'm glad you got the reaction you were hoping for. It looks like you've found a real group of friends.",
            "So many feels.  I'm happy for you op.",
            "<3",
            "original post got me, this one got me. I wish you the best now and in the future. I'm super glad to see reddit helping someone so much. ",
            "Sweaty eyes. I'm so pleased that you found this great bunch of people and that this went well for you. \n\nYou write beautifully btw. ",
            "Thank you for sharing this. ",
            ":')",
            "I love your friends",
            "Hang in there OP! I feel for you",
            "Thanks for sharing your story and this experience. You've reminded me to not take my relationship for granted, even though I do my best not to. I'm glad things are working out for you now. You're fortunate to have met wonderful, open-minded, and caring friends, and I know you'll cherish each of their relationships.",
            "Sounds like you've got a great posse.  Good Luck to you!",
            "I'm glad it worked out for you OP. You showed a lot of courage and your friends showed a lot of love. Peace.",
            "So...  I think I sprung a leak.  My eyes!  =::::(",
            "Congrats its so nice to see you're able to find such a supportive group of friends. Best of luck from here on out and remember to have as much fun as you can and less stress",
            "Damn.....I've got something in my eye....",
            "I'm glad you found these good friends. ",
            "Man, I want friends like you guys.",
            "Not a lot to say, other than you seem like one of the strongest people I've ever even heard of. I'm proud of you.",
            "Yay! So glad it went well! :) ",
            "Omg. It just took me 20 min to read because I had to take a break and cry and hug my son. You went through so much I really admire your strength and will. I just dont know what to say. ❤",
            "This was not only brave, but I imagine helped hugely with the healing process. Huge congratulations and well done to you! It must have felt great to get that weight off your shoulders! You have a great support network, too :) ",
            "I was really looking forward to this update and I'm so, so happy that everything worked out so well for you. You've found a lovely group of friends and I'm so glad that you're in a place where you feel comfortable sharing your past with them.\n\nThank you for the update. :)",
            "I'm not crying. Onions!\n\nSeriously, I was rooting for you, I am SO happy for this update. ",
            "You're an amazing person and these friends are great humans too.  I just rubbed seasoning into my eyes reading this while cooking. ",
            "Hi,\n\nI just read your whole story.\n\nYou're a really damn strong person! And I internets-admire you. Well done on telling your friends, seems like they're a real good bunch, and you did right by setting up your life anew.\n\nI hope you stay well!",
            "I cried reading this simply because I'm so happy you have such amazing friends, and the fact that you can not feel so bad about not telling them. Thank you for letting us see how it all worked out. Your post has taught me so much I hadn't realized. I wish you the best, I wish you strength and most of all, happiness.",
            "As a 90210 fan, just got to say I love the names you chose!",
            "nothing like starting your day off with a good cry :D  i think it is wonderful that you have such great friends. *hugs*",
            "Silently sobbing from this update as well. I wish you the best. You have some good friends in your corner, darlin'.",
            "Being so new to Reddit this was one of my first post i have ever read and commented on. I have to be honest I have been stalking (Not a good choice for a word but i can not come up with anything else) Reddit for this exact update. Congratz OP and I glad that everything turned out alright. ",
            "Incredible update. Almost brang me to tears. You are awesome. And a beautiful person. Keep fighting! We love you.",
            "I was looking forward to this update! I think you went about it well, and it sounds like your friends are understanding. I wish you all the best. ",
            "Just read your original and this... def got a lil teary eyed :o\n\nSo glad that you've been able to meet these new people and share this with them.",
            "Thanks for the update. \n\nI can't imagine going through what you went through. I'm very happy to hear you have such a wonderful, supportive friend group. ",
            "This hit me right in the feels. I'm so glad you have those people in your life! Sounds like an upstanding bunch. Wish you all the best, OP!",
            "Awww, I'm so glad you told them, and I'm so glad they responded the way they did. I hope you have these friends for years to come :) ",
            "You have the most amazing friends in your life. Cherish them forever ♡",
            "Wow, your story is heartbreaking, but yay for salsa for bringing you together with these new friends. Dancing really is the best hobby.",
            "Lie by omission? Whatever. Obviously they would take have taken it badly unless they were complete dickheads? I really don't know why you posted.\n\nEdit: jesus. I just sobered up a bit and read what I posted. Anyhow, I'll wear it. Apologies to OP. ",
            "I just want to mention that while it's awesome that you were able to open up about this to them, just keep in mind that in the future when you mention your previous family in light conversation, people may have trouble reacting to it as light chit chat, and it could change the mood. Just don't bring up your late family all the time when people are having a good time since to them they only understand the loss, and people aren't good at dealing with death. ",
            "Please tell me that the drunk driver at least died...",
            "[removed]"
        ]
    },
    {
        "post_id": "eo6ykz",
        "author": "Swimming-Ordinary",
        "title": "UPDATE: Should my brother [17M] and I [17F] invite my brother's [32M] crush [30?M] to Chinese New Year dinner?",
        "url": "https://www.reddit.com/r/relationships/comments/eo6ykz/update_should_my_brother_17m_and_i_17f_invite_my/",
        "score": 4602,
        "num_comments": 148,
        "created_utc": 1578935374.0,
        "selftext": "Really quick update to this [post](https://old.reddit.com/r/relationships/comments/elwlz8/should_my_brother_17m_and_i_17f_invite_my/)\n\nMy twin brother and I talked to my oldest brother yesterday about inviting the brother and sister over for Chinese New Year because they didn't have any family.\n\nHe just laughed at us and said yes, it was fine and said he knew exactly what we were up to with the baker/brother but in like a really smirky kind of way. \n\nI think they've already been talking or maybe even dating but he refused to say any more than that and kept telling us to get ready for school and that \"good things take time\" and acting all \"wise\" and \"older brotherly\" and just annoying. \n\nSo I told him he'd better get married by the end of the year so I could get more red pockets next Chinese New Year and he just laughed at me. \n\nWhen I went to the cafe after school today his crush told me that my brother had invited them over for Chinese New Year so I was \"oh really?\" and he kind of laughed at me too and told me I was a good sibling. \n\nSo they are clearly together or together adjacent or something. Maybe they want to announce it on Chinese New Year.\n\nBut when my brother asked me what I wanted to eat on Chinese New Year I gave him a list of wedding foods and he asked me if I was getting married. But he's just been laughing at me and my brother the whole time. \n\nSo we've just been annoying each other back and forth until he bought us ice cream to shut us up but he did give us hugs out of the blue today so I think I'll just leave it at that and they can take their own time with whatever it is they have going on.\n\nBut I do kind of want to tease him about it because I have little sister privileges and I can only abuse them for another year.  \n\n  ---   \n  **tl;dr**: Update, looks like there's already something going on and they are coming for Chinese New Year but my brother is being coy.",
        "permalink": "/r/relationships/comments/eo6ykz/update_should_my_brother_17m_and_i_17f_invite_my/",
        "comments": [
            "This is adorable. You guys are wonderful siblings. I wish you and your family a Happy New Year!",
            "> together adjacent\n\nI laughed.",
            "this is the cutest shit i ever read all of you guys sound like awesome siblings",
            "Haha, they're clearly dating. All those smiles and giggles... Still a cute story though.",
            "That is a wonderful and adorable update. Also, good news, you get to abuse little sister privileges for life. Source: Am an oldest sibling of several younger siblings and they pull little sibling things all the time even though we are all adults.",
            "This is so Chinese (or just east asian?) I freaking love it\n\nthe family nagging lovingly about dating and expressing their feelings through food\n\nkeep the good parts of your culture, leave the homophobic parts <3\n\n&#x200B;\n\np.s. gung hay fat choy",
            "This brought sweet happy tears to my eyes. Sounds like you have a beautiful family unit with your siblings. Perhaps we can get another update after Chinese New Year dinner!",
            "So sweet.  I hope you all have a great New Years.",
            "As everyone says, this is the upcoming Netflix Holiday movie. I think maybe you played by Constance Wu and brother's love interest played by that super hot dude from Crazy Rich Asians.",
            "I'm glad this has all turned out well. You may be right, they may have already had a thing going on, but trust me, having you and your brother's support is huge for him. It's probably the biggest gift he's received in his whole life. He's got some awesome siblings, that's for sure. Best of luck to all of you, and enjoy the festivities!",
            "I'm so glad this turned out well! Your brother seems really happy. Have a lovely Reunion Dinner and may love blossom!",
            "I love this update. You have a wonderful family. Have a great new year celebration!",
            "This is just downright lovely. :) Happy Chinese New Year to you all!",
            "I actually got giddy when I saw there was an update on this. I can't wait for the update after the holiday!!",
            "tearing up over here. nobody look at the pregnant lady.",
            "Please adapt this into a romantic dramedy. This is what cinema gold is made of.",
            "Lolo this is the update I needed",
            "Yay!! :) Hope y'all have a wonderful New Year!",
            "This is so wholesome I can’t stand it.  You’re basically living in a romcom! 💜",
            "Thanks for posting, your story made my day better.  Glad that ya'll have each other.",
            "This is all the most adorable thing ever! As a queer person, I love how supportive of your brother you are. And you're awesome to want to help him get his crush. Such a sweet sibling. I'm so happy things seem to be going well and I hope you guys have a wonderful holiday!",
            "Such wholesome content. Update us with wedding pictures next!",
            "Feeling residual happiness 🥰\n\nYes you *are* a good sibling",
            "Ahhhhh! \\*happy tears\\* I just love what a loving, accepting, and kind family you all are! Wishing you all the most success, love, happiness, health, and fun in the new year!",
            "I still really want to watch this TV show <3",
            "This is so beautiful!  I hope you all have a lovely celebration, and I would totally watch the story of your brother and the cute baker as a movie!",
            "Everything about this is adorable and I love it. Happy new year, and I hope you get all the red envelopes!",
            "This is such a sweet story, op. Update us when they get engaged!",
            "I love everything about this story. Somebody please turn this into a movie, 100% would pay to go see it and cry my eyes out.",
            "You and your twin are so presh for helping push him to be closer to his crush; thank you for being so loving and supportive of cafe-guy and your brother. \n\nEqually, your brother and crush are just as damn presh for knowing what y'all were up to. I can't wait for another update of them coming forward about the relationship.\n\nThis warmed my heart and made me giggle!",
            "This is so wholesome :) 新年快乐!",
            "SO WHOLESOME! ❤️ thanks for the update, you guys are a wonderful family. I know exactly what a traditional Chinese family is like, and I hope your parents come around soon. It's such a shame to have to tiptoe around the people who are supposed to love you unconditionally. x",
            "This is great. Please may we have another update in the future, this story makes me happy!",
            "This is adorable. I'm happy for the update! Hope everything works out with your brother and his man!",
            "You are such loving siblings ❤️",
            "This makes me so happy, I saw the first post and the first thought of me was \"if they don't give an update soon I'm gonna die\" lol",
            "Awww I remember the first post andI’ve been shopping then so hard!! Happy update!",
            "Oh sheet, this is just too cute i might consider throwing an early angpao..",
            "LOVE IT! Thank you for the update",
            "Awww so sweet. Y'all are cute",
            "I’m legit tearing up. This is the sweetest update. You are a good sibling. Here’s to a great year to you and yours, OP!",
            "What a great story! Your family unit sounds really lovely, with your older bro looking after you guys and you looking after him back. It's so nice to read something so positive on this sub.",
            "This is soooo cute!!! You have such a sweet relationship with your siblings, I love stories like this",
            "This is the most adorable story, I have the stupidest grin on my face while I’m eating lunch at work. I’m very happy for your brother. Happy (almost) New Year!",
            "I'm so invested in this story I can't wait for the new year update!!!",
            "I love when posts have totally wholesome and sweet updates.",
            "this is so cute i cannot deal",
            "This whole thing warms my cold dead heart.",
            "Everyone in this story is precious! I love this. :)",
            "This is absolutely the cutest thing I have ever read. You are good siblings. lol",
            "Why can't rom coms be this cute? I love this story.",
            "Don't you worry the little sister card is here to stay.",
            "This is such an adorable story. Somewhere else on Reddit today someone was a real ass and this story made me feel better",
            "This is very cute. I expect a manga and story arc by the end of the year",
            "I love this story so much!! Please keep updating after Chinese New Year's dinner 🤩🤩😍😍",
            "This is amazing and I need this to be a cheesy Lifetime movie like YESTERDAY",
            "That is really adorable <3 I hope you all happiness and many oncoming family gatherings !",
            "Now update when you option the screenplay for this, because this is the kind of wholesome content I want to support in these troubled times!!",
            "I remember your original post and was hoping for an update. This did not disappoint. Also all of you are adorable! ❤",
            "You two are awesome siblings to your brother. Thank you for being accepting. This warms my heart.\n\nMuch luck and love to all of you. <3",
            "this is so wholesome it's made my day <3",
            "This is so cute. You guys are such awesome siblings. Your big brother is lucky to have you.",
            "THIS IS SO ADORABLE OH MY GOD this could literally be a cute short film",
            "Update me when they get married! I am so invested in their love story!!!\n\nAnd you all seem like amazing siblings.",
            "This is all kinds of adorable",
            "I would like to see this rom com",
            "This is awesome! You are a good little sister.",
            "You are really sweet and I hope it goes well for your older brother! Happy New year!",
            "This is so wholesome. Love it.",
            "My cuteness scale just imploded then exploded into a whole new cuteness universe! <3",
            "I just read both stories and you all are just too cute!🤗🥰 I love how supportive you all are towards each other.",
            "I am so happy about this. Would love an update to the update after new years",
            "I feel like I read this fanfic, once...\n\nWell done, you guys. It's nice to hear a positive story on here for a change!",
            "This is the most heartwarming thing I read in here. Happy New Year and I hope everything goes great for you family!",
            "This is extremely adorable. The whole thing is cute, I can't deal. Your whole interaction is very entertaining and heartwarming",
            "Backyard sausage action!",
            "Such fun cheekiness is fine. You can do that to friends too",
            "This is the cutest thing I’ve ever read on this website",
            "This is adorable ahhh!!\n\nAlso FYI, as a little sister, little sister privileges last all lifetime ;P",
            "Would your brother like you broadcasting his life like this? Would he like you commodifying him and making him an object? You already know the answer to the question you asked, only reason you are doing this is because you find pleasure in reifying romanticism.",
            "[removed]",
            "[removed]"
        ]
    },
    {
        "post_id": "96htm9",
        "author": "amydsd",
        "title": "[UPDATE] My [28/F] friend [41/F] announced she is getting married next week. I have reason to believe she is lying.",
        "url": "https://www.reddit.com/r/relationships/comments/96htm9/update_my_28f_friend_41f_announced_she_is_getting/",
        "score": 4598,
        "num_comments": 152,
        "created_utc": 1534005097.0,
        "selftext": "Link to original post: [https://www.reddit.com/r/relationships/comments/92ssov/my\\_28f\\_friend\\_41f\\_announced\\_she\\_is\\_getting/](https://www.reddit.com/r/relationships/comments/92ssov/my_28f_friend_41f_announced_she_is_getting/)\n\nSo after reading all the responses here, I became increasingly more concerned. A background piece not included in my original post is that all the players in this scenario are connected by a recovery community. Because of this connection, I knew the \"ex\", Ashley, some years ago and we were still on one another's social media. I decided to reach out and ask about James.\n\nThat evening Ashley called me and we then conferenced in James. As it turns out, he is married to another woman and they have a child. He and Ashley never dated and aren't even really friends, they simply used to chat at a large meeting that was also attended by my friend, Wendy. They believe that she saw them speaking there and created a delusion that they had dated and Ashley was now poisoning James against Wendy, all the while he was married to another woman. \n\nOver the course of the last two years, Wendy has approached James at multiple meetings with declarations of love. He reiterated to her each time that he was married and stopped attending that meeting to avoid her. But oddly, she ended up at his meetings again and again. She approached his sponsor and friends telling them they were in love. She also approached Ashley threatening her with a restraining order because she believed Ashley was conspiring against James and her, as a couple, because they were \"together\" now. The second time she approached her, six months ago, Ashley called the police and made a report. \n\nUntil our conference call, Ashley and James didn't realize how they were connected and they didn't know the extent of the delusions. When I told them about the marriage date, they were very concerned. James called the police.\n\nI called the emergency mental health line looking for help, but their only suggestion was to call the police and ask for a welfare check on Wendy, which I did. Knowing that she has no connection to James and is living in a complete delusion made me so concerned for her. Once the wedding date came and she didn't get married, what would happen? How would she mentally process that? \n\nI was given a reference number and when I called back, was told they made contact but did not intake her since she didn't appear dangerous. Since the check, she has ignored my calls. The wedding date came and passed and I heard nothing. At this time I feel like I lost a friend, but she was already gone in these delusions and I did what I could to help. \n\nGoing forward, I hope to get updates from other people in the community that she is doing better, and hopefully abandons these delusions.\n\nTL;DR: There was no wedding or relationship, James is a real person with no connection to Wendy, she was fully delusional. ",
        "permalink": "/r/relationships/comments/96htm9/update_my_28f_friend_41f_announced_she_is_getting/",
        "comments": [
            "[removed]",
            "Wow. Thanks for the update OP. I hope that she gets the help she needs and well done for joining the dots on this before she did anything more sinister. ",
            "This happened with my (schizophrenic) and one of her professors. She really thought they had a relationship, he of course was freaked out due to him being married and the school having rules against dating students. For my sister this was just one of many issues she had until we managed to get her into treatment.\n\nIf possible see if you can reach out to her family, as they'll have more options on how to deal with this (not a lot of options, but definitely more). ",
            "OP, what’s safest for you is to worry about taking care of yourself. She doesn’t seem like a safe friend. She’s not your sponsor. She has bigger problems than you can handle. \n\nYou did the right thing with this situation. ",
            "Wow, I’m so impressed with how you handled this situation. You’ve done the absolute best you can and have been an extraordinary friend to her. Time to move on, though, and continue to take good care of yourself. ",
            "You're describing an erotomanic delusion. Could either be delusional disorder or a symptom of another disorder (schizophrenia or bipolar disorder). Alcohol and drug abuse are known risk factors, as is low SES. \n\nPeople with delusional disorder can be fairly high functioning overall. Treatment is therapy, though they often resist due to poor insight. Antipsychotics can be somewhat helpful for some people, but usually do little more than help decrease anxiety or agitation associated with the delusion. It is a hard disorder to treat, especially if it has been going on for years. She is unlikely to simply \"give up\" on it, but with treatment may be able to develop some insight and question the delusional beliefs. \n\nLetting her family or sponsor know would be reasonable next steps. It is not productive to confront someone directly about a delusion, but you also don't want to encourage her. Your best bet is simply to validate and empathize with her feelings. \"I can see you're disappointed that the wedding you were looking forward to didn't happen.\" ",
            "Wow. I'm really sorry for everyone involved.\n\nIf I was James r Ashley I'd frankly be concerned and feel unsafe. James should really shut down his social media and talk to friends/family about doing the same so this woman doesn't find his \"secret family\" (ie his real wife and innocent vulnerable child). Who knows how she would react to him having a child with another woman? ",
            "It's insane how this person is literally Murello from OITNB. I can't help but picture her in this whole story! Seriously though, thanks for the update and for handling this all so well, you did good",
            "Have you reached out to her family or other close friends? Although I imagine they know. (Or sadly, could even be just as deluded as she is.)   \n\n\nIn any case, there is sadly not much you can do, apart from possibly that IF you think it might be an option. Hopefully she eventually gets help. I am very sorry you've lost her as a friend.",
            "Wendy sounds like my husband.  He hasn’t lived with me and our son for over 6 years.  Exactly right now I have him on speaker phone while I am typing this.  He believes cops, firemen, ambulances follow him everywhere when he is out.  He thinks the gov’t sends them out to follow people they feel are crazy.  He has delusions of women chasing him at work wanting to be with him and then the next day they are witches putting curses on him.  He fights with any and everyone.  He has a great job makes over $27 an hr worked there over 20 yrs.  Thankfully his work has a union and they know he has mental illness.  I care for him but could no longer live with him.  He mercilessly accused me day and night of cheating with any man....coworkers, neighbors, his brother.....literally would get physically abusive and break things in our house.  I could not believe I was fighting and fearing for my life over a delusion......  Problem is you cannot help them if they don’t want help.  No cops, or psychiatrist will not do anything until they physically harm someone or kill them.",
            " Omg this sounds so crazy. Thank you for updating. ",
            "Anyone getting Lorna Muccio from ‘orange is the new black’ vibes? Anyway I hope she is okay",
            "I'm glad you let James know. Enduring Love taught me that de Clerambault's syndrome can be dangerous!",
            "Thanks for the update, this was a weird one, eh? I’m a clinical social worker and actually had a feeling this may be a genuine delusional disorder, which it really seems likely to be. It’s broadly called “erotomania” when a person has an ongoing delusion that a person is in love with them. I can’t diagnose your friend obviously, but my gut says she’s genuinely ill. Delusional disorders like this are extremely difficult to treat, sadly. ",
            "Really glad you contacted them, OP. You acted as a good friend to all three, I hope you feel that way.\nI don’t know for sure, but it might be a good idea for someone to tell her sponsor. \n\nBut back to you...& back to your life! Take good care of yourself & be proud that you handled this responsibly & with the least amount of drama you could.",
            "I did not comment on your first post however I agreed with many other posters. You did the right thing",
            "You’re really a good friend. :) ",
            "You did the right thing. Unfortunately the system doesn't really treat situations like these (stalking/delusions, etc.) like they should until someone is dead.  Is there any relative you could probably give a heads up to keep an eye on her. Otherwise there is no much else you can do at this point. :/ ",
            "My mom is schizophrenic and has suffered from delusions half of my life... and as you learned, unless someone is a danger to themselves or others there’s nothing you can do. It’s sad to watch someone you care about lose sight of reality, but there’s nothing you, the government, or even medical professionals can do unless they seek help themselves. ",
            "Thanks for the update.  You're a good person for taking the extra steps to try to get her help.",
            "Take care OP, agree with the comments that you did your best within your capacity.",
            "Thank you so much for the update even though it's not as hilarious as we'd all hoped  :(",
            "That’s so sad. I hope your friend is okay. ",
            "Girl you better keep an eye on this. I don’t want to see this episode on Investigation Discovery. ",
            "What a feckin' looney",
            "👏👏👏 10/10 thought this a fake Jerry Springer post",
            "Sounds like erotomania huh",
            "Wow. I’m sorry about you’re friend. It’s really kind of you to try and get the story together to try and help her. This event really reminded me of “The Daemon Lover” by Shirley Jackson.",
            "Thanks for an update!",
            "Wow, I'm sorry to hear that. I do hope eventually she gets the help she needs and realizes you were really being a good friend to her. \n\nIf you do care for her keep reaching out every so often to try and keep in touch. She was delusional, but there's still the person there you had a friendship with somewhere, hopefully. Maybe you'll see her again.",
            "This is so sad- I totally remember reading the OP, thank you for providing an update. I hope that she can get the help she needs and that everyone involved can move on.",
            "I hope things have gone well in these last for months, is it okay to ask for an update?",
            "What the hell, mental health didn't do anything? In my country they would take get into custody for 3 days and do a full assessment",
            "Calling the police on a mental health problem is very dangerous if you are in USA.",
            "Since she is in a recovery program, or was, I can imagine she has had some brain damage via drugs and it has come out in some sort of psychopathy. The problem with people who are delusional psychopaths is that they can be harmless but then one thing will set them off and turn extremely dangerous. That's the difference between sociopaths and psychopaths: One is planned while the other is random based on current mental state.\n\nI would contact her family and inform them of the situation. Think about getting her involuntarily committed so she can get proper diagnosis, medication, and therapy. Also it wouldn't be a bad idea for your friend James and his wife to invest in a security system and a firearm, along with being super extra careful of their surroundings. The wife and baby could only be seen by your friend as an obstacle between her and James.",
            "[removed]",
            "[removed]"
        ]
    }
]