[
    {
        "post_id": "azzp25",
        "author": "throwawaywifehatesme",
        "title": "Update: My wife [28F] found out that my mother [59F] and I [28M] have been lying to her about our (me and my wife's) baby [0M] for months",
        "url": "https://www.reddit.com/r/relationships/comments/azzp25/update_my_wife_28f_found_out_that_my_mother_59f/",
        "score": 9880,
        "num_comments": 302,
        "created_utc": 1552342805.0,
        "selftext": "Original: [https://www.reddit.com/r/relationships/comments/az648p/my\\_wife\\_28f\\_found\\_out\\_that\\_my\\_mother\\_59f\\_and\\_i/](https://www.reddit.com/r/relationships/comments/az648p/my_wife_28f_found_out_that_my_mother_59f_and_i/)\n\nDon't think anyone would particularly care about an update but I all appreciated the insight anyways. So here's an update:\n\nAfter I wrote the original post, my mom took my son to stay overnight with my wife's sister so that the two of us could have the house to ourselves.\n\nWe pretty much just talked for an hour while constantly reaffirming that we love each other a lot and want to sort this out. I apologized and explained why I did what I did. She said that feeling like she was there for our son's milestones was really just a band-aid solution that didn't actually convince her she was present. She said that if she actually *had* been using the milestones to feel like she was present, this would probably have felt worse for her. But since she wasn't, in her words, \"deluding herself into thinking she's actually home\", her main issue was that I lied which hurt her feelings. I apologized and explained that I honestly thought that she would prefer the lying if given the choice. She said she understood where I was coming from and that she felt betrayed when she realized, but she sees that I was doing it because I love her and she thinks we'll probably laugh about it with our grandkids one day (yes, I am very aware I don't deserve my wife).\n\nSome things came out on my end that I wasn't going to tell her and didn't mention in my last post- namely, that I'm scared she's going to become suicidal. My uncle committed suicide when I was a child, in part from working in a high-stress job where he made a huge and costly mistake. One of my wife's colleagues attempted suicide while she was on mat leave. Being a working mom is bad enough, being a resident in this program is bad enough, both combined are a recipe for trouble. Since our son was born and the incident with her colleague happened, I've been afraid that if her home life wasn't perfect, it would push her over the edge. Anyways, she reassured me that that's not happening and I think saying it out loud also made me realize it's a pretty irrational, groundless fear.\n\nWe ordered takeout and sat together watching the real videos I have of all our son's firsts. I also have a special folder of pictures/videos of my son with my wife, so we went through that after. She almost choked from laughing so hard when I tentatively revealed the beanbag trick. I am the laughing stock of her friend-group chat. So I guess we're already at the stage where we're laughing about it.\n\nThank you to those who responded to the last post! The stereotype of *someone* in [r/relationships](https://www.reddit.com/r/relationships) advocating divorce every time anything happens is true.\n\ntl;dr: marriage is work. I am stupid. We moved past it.",
        "permalink": "/r/relationships/comments/azzp25/update_my_wife_28f_found_out_that_my_mother_59f/",
        "comments": [
            "I've always heard that NO firsts ever happen in daycare. Until Mom sees it happening, it didn't happen. Many grandparents feel the same way. ",
            "You guys are going to be just fine. You listen to each other, try to understand one another, and are able to express your feelings. Keep it up.",
            "So I don't have any advice, but I am one of three children born to a Family Med physician mom. My mom had my older sister during med school, me during residency, and my younger sister a year into her practice. My dad worked part time and his mom was our \"daycare provider\" our whole lives (grandma still babysits the puppies for my parents).\n\nI'm sure my mom missed a ton of milestones, but you know what? None of us kids know that she missed them. My mom would come home and love on us.  She'd come home for lunch after my younger sister was born, and I remember eating yogurt with her on the floor. I remember helping her dig the car out of the snowbank at the end of the driveway after she got home from working Urgent Care late into the evening. \n\nMy dad and I are really close, and I'm sure that has something to do with him being around more when I was a baby, but I'm also really close with my mom. I learned women can do whatever they want to do AND  have a family. I learned that kids don't have to be the absolute center of your world to be happy and healthy. \n\nI hope your wife doesn't put too much pressure on herself about missing these things. Your kid won't know the difference and will love you and your wife no matter what.",
            "Wasn't there for your last post but read it and it's clear you love your wife dearly. I'm so happy to ready she understood why you did it.\n\nIts refreshing to see a good update. Good vibes for your family from a random internet stranger!!",
            "Man love this. Its great it got worked out.",
            "Would have been ironic had your child hit another milestone while at your sister’s house with your mom.  ",
            "your intentions were pure, but it's really cool that you still are doing some real self reflection about why you did it. you're lucky in your wife and she's lucky for you, too. Also nice to read about a non-insane MIL for once. ",
            "I honestly was also in tears laughing from the beanbag thing. That was ingenious.\n\nI'm really glad you guys were able to talk through your feelings on this; your love for your wife and child absolutely comes through. I hope you keep up the good communication! That's where it's at.",
            "I was laughing when I was reading the divorce advocate's posts. If that person is in a relationship, there's a pretty good chance their SO will tell them a white lie this week. Better call a lawyer.",
            "What a wonderful update! Happy you two worked it out, and understood each other's perspective. This really serves as a great example of \"us vs the problem\" instead of \"you vs me\"",
            "I know you’re feeling sheepish, but this is the cutest story. Glad you two are already chuckling with me.",
            "Honestly, I read both posts and I think this was so sweet and innocent. I get why she’s upset, but you not only sound like an AMAZING father, but a very loving and doting husband. You’re lucky to have each other. ",
            "You sound like the kind of husband I'd hope to have one day. Your wife is a lucky lady. Best of luck to her as she finishes her residency. I will most likely be in her shoes one day (a working mom): she isn't any \"less\" because she's working to provide a good future for her child. She will miss some things, yes ... but she's going to make a whole lot possible, too. YOU GUYS GOT THIS.",
            "My husband just finished residency last summer, so I get this on a whole other level. I think what you did was incredibly sweet and thoughtful. I’m glad everything has worked out in the end and remember, this will be over soon! Post-residency life is still tough on the days my husband is at the hospital (long hours) but then he’s off and when he’s off, he’s OFF! We can go out of town and have done several mini vacations during his off weeks. Hotels are much cheaper on a Tuesday, after all! He loves being able to bond and connect for long stretches of time. It does always take a day or two for our toddler to warm up to him so keep that in mind. He’ll just want “mama” for awhile but eventually he warms up to daddy and is super happy being around him. Sometimes he cries when it’s time for my husband to go back to work. Anyway, good luck and hang in there! The most important asset in residency is a supportive partner and it sounds like your wife has just that :)",
            "No lie, I teared up reading this because you guys seem to have the best relationship and your wife seems like such a chill, stable lady.  Im so happy for you two. ",
            "I wasnt there for your last post, but this gave me the warm and fuzzies (is that the right term?). \n\nThank you for sharing. As I was reading your first post, I suspected she was crying so much over the well intentioned white lies. I'm glad you two were able to talk it out, openly, come to an understanding and move on.\n\nThis is how it's supposed to be, this is how it's supposed to happen! \n\nThanks for giving me a little hope. You two sound like a lovely couple.",
            "Man I just want to note one thing from your response.\n\n> saying it out loud also made me realize it's a pretty irrational, groundless fear.\n\nThis is so huge for anyone suffering from anxiety, saying things out loud can be like 1000 pounds being lifted from your chest.",
            "It didn't seem appropriate to comment on your original post, but I do think this will eventually be an often-repeated and much-loved story in your family (especially the beanbags). ",
            "You’re both clearly going to be great parents. Stay strong. It’s hard to be scared for a loved one’s emotional well-being. Your wife is strong herself and your kid will grow up knowing he’s loved by all. ",
            "Congratulations! This is beautiful, messy, real grown up life. And it's going to be one of your best sitting around the table late at night drinking wine and telling stories stories.",
            "You are a good person, and I never thought I'd say that to someone who perpetuated a campaign of lies to their spouse. ",
            "I honestly thought it was really sweet what you and your mum did. I glad that your wife is doing OK and that you guys worked through it.",
            "I’m glad this wasn’t an irreparable event to her.\n\nAs a preschool teacher, we do the same thing in infant rooms... this is an unspoken industry standard. Well, the teachers discuss it with each other. But it’s not an official rule.",
            "At least it was a good-hearted, well meant fuck up.",
            "Daycares 100000% do this alllll the time.  It's the nature of the beast with working moms.  ",
            "I dunno OP I still think this betrayal is horrific and divorce is inevitable with your child blaming you forever\n\n&#x200B;\n\njust kidding you guys have a great relationship of being able to communicate and work thru issues and understand why people do things and where behaviour comes from and I'm super happy for you! You will definitely laugh about it later in life. Glad you disregarded the angry black-and-white thinkers. ",
            "You had good intentions and your wife saw that! Glad it all worked out. ",
            "it's not really anyone's fault that she missed practically all these things that a baby does for the first time.\n\nshe should be glad that you tried to make it meaningful for her.\n\nbut either way, i hope it's not going to be anything that messes up the relationship too much, because ultimately, you and your mom did this out of love for your wife.\n\n",
            "Lmao I’m glad she got to hear the beanbag story because that is hilarious I laughed out loud at that \n\nPoor kid 😂😂",
            "This is not working out, divorce her instantly!! ",
            "Oh man. I don’t have anything of substance to add, but as a woman about to enter residency your posts hit close to home. It’s hard to know you’re missing things to achieve this big goal. And the mental health cost is big. Thanks for giving so much to your family, your wife is also lucky to have you. ",
            "I *love* that you went to all this trouble for your wife AND that she understood and you moved past it.  You are a good dad, and a well meaning husband!!  ",
            "This is amazing. You may feel you don’t deserve her but I truly believe y’all deserve each other. ",
            "This is some pretty good sitcom-level stuff. ",
            "Why am I crying? You clearly love your wife so much. She sees that too. Although it made her upset in the moment, it’s so obvious what you did came from a place of love. This is seriously one of the sweetest stories I’ve read on here and I think you guys will be just fine. The beanbag trick is hilarious.",
            "Yeah. Give yourself a break friend. You made a mistake, compounded by time, and you communicated why with your partner. \n\nYou’re not stupid, you’re just trying SUPER hard.\n\nSounds like you and your wife got your communication back on track after this. Which is awesome. Nice job.",
            "Wife?! Mother?! Son?! Relationship troubles?! I know what goes well with that. Divorce!! Only option is divorce. Come on OP!\n\n(Glad you got it sorted OP 🙂)",
            "People actually told you to get a divorce over this? Don't get me wrong it's still a big deal but divorce is completely unnecessary.",
            "This is great to read. Happy for you guys!",
            "You guys are awesome! You worked together to solve a situation that isn't all candy and rainbows and you figured it out. Your wife needed to feel hurt and cry it out, yet, she was open to your explanation instead of just being butt hurt and dwell on it. I'm proud of you two! Keep going! ",
            "Perfect ending to your story. You are a stronger couple because you talked it out and revealed some things about your own fears.",
            "Just my 2c, i know your hard working wife probably feels guilty not being present for all these moments, but in reality, as a parent myself, as long as your child is well loved, their needs taken care of,\n it's not the firsts that eventually matter, but how your child ends up as an adult responding to the world around them, life & it's challenges, your wife is sacrificing much to create a future for you all, these heavy shifts will smooth out & her time will become more balanced, healthy kids take these things in their stride so don't sweat the small stuff, you have each other & your health, enjoy your good fortune & be happy, good luck little family...",
            "As a working mom to a kiddo the same age, I so feel your wife's pain in this. I'm an RN, so if I'm on a long stretch of shifts I also will spend days without seeing our baby awake. It is so incredibly difficult to be away from your baby for those long hours. I love my career, but many days I wonder why I do it. But as much as I don't ever want to miss a thing, it also means a lot to me that my husband gets to experience the joy of those first. I take a lot of comfort in that. I bet your wife also is very comforter be the knowledge that your baby is being cared for by such a loving dad. I'm so glad you two were able to talk it out and laugh about it. You sound like a great parenting team. Keep up the good work, both of you.",
            "I'm glad it worked out. FYI, daycares do the same thing to spare the mothers the guilt of missing firsts. ( I was instructed to lie about baby's firsts when I worked at one.) At least daddy and grandma were there witnessing it and not some stranger. ",
            "I hope your wife realizes what an incredible role model she is to your son. Residency is brutal and missing out is so hard but he is going to grow up to be a wonderful partner being shown that gender roles don’t have to be followed and that his mom is a badass who made sacrifices to endure medical training so he could have a good life and she could follow a passion to help others. You’re a good partner as well for caring so much and supporting her.",
            "I've learned that fear is false evidence appearing real. I think you've learned something seriously important: honesty and asking rather than making assumptions and fearing the answers is where you need to go. Sounds olike you are on your way, both of you.  \n\n\nWishing you all the best in your adventures together",
            "To the people who brought up divorce. It's probably why you're still single.\n\nIt's kind of ridiculous to project your own insecurities and intolerance as advice for someone else.\n\nOf course this is the internet so you're behind a computer, there's less guilt if something does go wrong based on your horrible advice.",
            "My husband worked a lot when our daughter was born and missed a lot of firsts. I used to say to him that the only time a first mattered was the first time you saw it, not the first time she did it. It wasn’t the same but I think it helped him process missing out a bit better. \nI’m glad you worked it out together :) ",
            "Thank you for being so supportive to your wife during residency. \n\nWe need more partners like you in the industry. I'm glad you understand the gravity of the situation, and you both are doing your best. \n\nIt gets better, there's a light at the end of the tunnel for her. ",
            "Her career is going to be demanding for her whole life. Instead of lying as a band aid, help her come to terms with her decisions; reassure her about what a great mother she is, what a great dad you are, and how happy and healthy your son is. Help her get past any guilt and sorrow. Just listen and hold her if she misses something. Make *her* first time seeing his milestones special - send a video, have him hold up a sign, write it down for his baby book for her. Focus on the example she’s setting for him, the experiences and comfort her job allows your family, and the extraordinary amount she and your son are adored. \n\nYou can do this the right way. ",
            "I’m so happy this one ended in a happy ending! Sure, you deceived her but up did so with the best intentions. ",
            "I'm taking the longer view of the mom at home while dad is away (yes I'm old and my husband traveled a lot while the kids were babies). It's always the first time when both mom and dad are there to see it together. It's complicated now with every instance of everyone's lives filmed. Your mom's instinct to start that was because it was so often done when dads were away all day every day, and it was done out of love by you and by all those other moms too.\n\nAt some point, however, it has to stop and I'm happy that you two have found your ability to laugh and love together. It's along journey together, not just for the firsts!",
            "This is such a sweet update, which happens so rarely on this sub. ",
            "This update really warmed my heart you two sound great for each other and especially great for your child! ",
            "So glad for you that you two worked it out, and it’s great you were able to also discuss your fears over her mental health, too. That’s definitely a horrid worry to keep bottled up. \n\nAnd I’m not surprised she laughed at the beanbag trick. It’s both hysterical and ingenious!",
            "I don’t really care for marriage and family things.. I haven’t seen much happy from any of it.. but this story really made me feel like it might be alright to get behind something like that. I’m glad you two have each other. ",
            "I’m just reading your story for the 1st time and honestly, I think what you and your mom tried to do was VERY sweet. I’m not a mom, but if there is anything that is worth telling a lie to someone about, this is one of them! ❤️",
            "Aww, that's sweet. You ARE NOT a bad husband in the least. This one definitely was a difficult situation to navigate through, and you did your best because you love your wife and want her to have a healthy emotional and mental well-being. While you may not have to worry about your wife hurting herself, it's not a totally invalid concern given her job and such. In the future, if you're worried about her (or someone else) bring it up. You don't have to be direct. Also, when your wife is home, take a few minutes to ask your wife about her day/time at work. You can use her description as well as her tone/body language to gauge her emotional state. I ask my husband this every single day, not just because I'm interested but because it gives me a lot of insight even if all he says is two words. ",
            "I'm a Nanny to infants and one of the first questions I ask Moms is \"do you want to be informed of milestones?\" \n\nI've witnessed first steps, first words, etc and some Moms want to know right away and others would prefer I didn't mention it. \n\nHonestly, the most important firsts in a child's life are the ones they will remember sharing with you. I would remind her of all the big milestones she can support your son through, and how much they will mean to him. \n\nMy Dad was in the military. He missed a lot of stuff. I don't dwell at all on the stuff my Dad wasn't present for but the things we have been able to do together are much more special. He took me to buy my prom dress, taught me how to ride a bike, taught me to drive, etc",
            "That was lovely to read, I wish your family all the best ",
            "this is a great update.",
            "I loved going back to work.  My first day back?  He rolled over for the first time.  I honestly laughed because the irony of missing a major milestone my first day back to work was too much.  I also missed the crying at nap time and the poo-plosion.  A little fussy today? Not my problem, see-ya!\n\nI’d be more upset that I didn’t know when a first happened than missing it. \n\nThe biggest pro I see to being a working mom is the example I set.  My own mom had a career (higher level in the same company than my dad).  It just made working the default for me.  Not a question of IF I will work, but a question of what kind of job I wanted.  I’m not saying staying at home is easy (I can’t imagine how I’d cope!!) but I think it gives a lot of freedom to have a career.  Freedom before you marry or have kids.  Another option/goal if you can’t have kids.  Better long term financial health and retirement savings.  Freedom to leave if a marriage isn’t working out.  Freedom to decide you don’t have the patience to stay at home full time and would rather work instead!!!  \n\nI know I had care providers and was still close to my parents so I know the affection, closeness and love are still there.  I’m glad my son had caregivers that treated him like family.  I don’t feel jealous over that, I’m grateful.\n\nIt still hurts not to see your kid on a normal routine.  But for the short-term these aren’t lasting effects and there is a long-term payoff.   Money/career now but also the example, the very long-term effects of higher incomes and so forth.\n\nIt sounds like your wife is handling it well but I just wanted to share another working mom perspective. There are so many positives to focus on that take out the sting of the negatives.  Give her updates on poop disasters along with the milestones!!  Share the frustrations as well as the good bits.  Never complaining or guilt tripping, but just a mix.  I had to ask my husband not to text pictures of them having fun at the playground when I was working on a weekend during deadlines... show me later but in the moment it made me sad.  Sending me pictures of a horribly messy lunch that needs a hose to clean up?  That didn’t make me quite so sad, lol.",
            "4th year Medical student here. Female (bc I think it matters in this context) My SO called in tears the other day convinced I want okay. I was very confused because I’m currently living my best life but was actively on the edge a year ago, but he didn’t notice.\n\nWhat residency? They’re all brutal, but some more than others. She might be able to swing some extra time off. If I had to take a guess, the locking herself in the bathroom wasn’t being angry or anything at you. More like protecting yourself from Hulk.\n\nAs I approach residency, I can hear my ovum crying out as my ovaries shrivel. (Kidding - kind of) You and your wife are in a tough place. Best of luck.",
            "Sounds like your mum is awesome. The beanbag thing is super cute. You've done well to make mum feel like mum. I like the idea that it doesn't count till mum see's it happen. ",
            "Your wife sounds like a fucking champion. No wonder you did what you did. She sounds like an amazibg person. Your son is very lucky to have her as his mother. Best of luck for the future.",
            "FWIW I don't think you did anything wrong or stupid, you were trying really hard to give your wife something special and that should be appreciated for what it was and not held against you. ",
            "It's so sweet that a mother in law and husband would be so thoughtful... As a working mum I missed quite a bit but she's older now and those mile stones become a distant memory, next is reading, writing and doing shows at school ... \nWorking mum's will frequently have a reason to feel shit and inevitably miss things. \n\nMy silver lining is she doesn't remember her shows from nursery and reception class. I do what I can and get other mums to take pictures or videos when I can't ... In-fact some of our mummy circle at school watch the videos and tell the kids they were at the back of the audience (& I may be one of these mum's!!!) 😂😂😂",
            "I LOVE this update 💚\nSo happy you were able to talk through it...sounds like this may have even brought you closer.",
            "My nephew had been practicing walking with his baby sister for awhile. Then one day she just walked to me when it was just my sister and i. She said, \"don't you dare tell (nephew!)\" He truly adores his sister. That night he calls me all excited and I played along. I understood why you did what you did. I actually think its kinda sweet.",
            "I LOVE THIS ONE! The title was extremely yikes but once you read it its clear you did it for all the best reasons. Like i get it, lying is bad bad times (even for good reasons because it takes away the autonomy of the other person to have actual facts and process them).\n\n&#x200B;\n\nBut your wife is great, and you were good for admitting your wrong, apologising and understanding that the lie was worse than the actual missing stuff etc. Who knew, good communication and honesty and we get there!?",
            ">(yes, I am very aware I don't deserve my wife).\n\nOh come on, you did something incredible for her so she wouldn't feel like she's missing everything. ",
            ">(yes, I am very aware I don't deserve my wife).\n\nYES YOU DO. Your ruse came from such a place of empathy and love - I'd have probably made the exact same mistake.\n\n",
            "I just want to say this is so sweet, and you sound like you absolutely DO deserve your wife! As a mom of a 9 yr old, I honestly kinda forget the exact first time a lot of things happened (and some of it probably happened in daycare!) But that doesn't change any of the wonderful memories I have of him being super little. We are now very close, despite co-parenting with my ex and me working full time. You got this!",
            "OP I am fairly confident that I missed most of my baby’s milestones and my in-laws probably lied to me too. If I had found out then I am sure I would be just as upset. It’s a terrible feeling knowing that your mother in law, however awesome she is (and mine is the literal best), is getting to experience these things with YOUR baby. It just sucks. \nHowever, as time goes on, I’ve realize how lucky my daughter is. She got two moms to love her. How lucky I am that so many people love my daughter. And that she gets to be close to her grandparents. \nI hope your wife will look back just as fondly and see the kindness and how your intentions were not to deceive her, but to love and protect her. ",
            "so many parents fuss over all these firsts and then are not there when they are really needed.\n\nmy wife was in medical school when my two young ones were born. they were in full time nursery care as i was also working full time. we literally missed all the firsts. however, we made sure the nursery keep us posted on their progress and we celebrate in the evening when we have them back.\n\nhowever, i made sure we were there when we really need to be there. i was there to teach them how to swim, ride a bike. i was there to take them hiking, skiing, sailing.\n\nthey are now fully grown and ready to leave home. due to the early childhood sacrifice, all their college funds are saved up.",
            "Real tl:dr: don't lie to people",
            "The bean bag thing is creepy. I mean, the level you and your mother were willing to go to just to deceive your wife. You should have just sent her videos as soon as it happened. You are still a jackass for doing this. \n\nalso, these milestones are over-hyped.",
            "Can I just say you and your mother are absolute Angel's for doing this for your wife. I'm glad it ended well ",
            "Relationship goals material 💕",
            "As a nanny, I have heard stories of nannies fudging big first moments to parents so they don’t feel so left out. I’ve never done it, but I get it. Happy it’s all going to work out. ",
            "She is lucky to have such a loving husband and mil. Your hearts were in the right place. ",
            "Omg, this is so sweet/bittersweet. Though it's particularly hard for her at the moment, I hope that in the near enough future your wife is able to find some better compromise between work and home life. She deserves all the best from her child.",
            "I didn’t see your first post. But this is a beautiful update. ",
            "I am so happy for you, my heart melted when your mom pulled your wife in so she could see him roll, and I was heartbroken your wife found out. Ended my night nicely ",
            "Wow. This seriously warmed my heart. You and your wife give me hope. Best of luck to you two and your family! ",
            "This made me cry buckets. All I can see is HOW MUCH you and your mom cared for her feelings. Not everyone has that. I’m not discounting your wife’s feelings but omg.. to have a husband and mom in law that cares that much. I’m a mess.",
            "this is such a nice update and it warms my heart. i can only imagine how it feels to miss their “firsts” but rest assured she will not miss any more firsts as they grow and i like to think that’s nice. i’m happy you’re able to move past it and just live in the moment now ",
            "Thank you for your wonderful post, I'm glad you two worked it out.\n\n&#x200B;",
            "A happy ending! I love this story",
            "So happy it all worked out. I read your original post and definitely can see the tricky situation you were in. You both clearly love each other so much! ",
            "This whole story start to finish is so sweet. You are both great parents and partners. This is how we learn and grow.  Good on ya!",
            "You two have a lovely, healthy relationship. I'm glad you were able to be honest with one another. That is so important. ",
            "Good for you two, this is an update I wanted to read!",
            "Just saying you are a good person. Your wife is also a good person. I wish you three the best.",
            "It’s not too often that there are happy endings on this sub. You guys are sweet and this put a smile on my face. All the best to your family :)",
            "My wife and I blog on relationships and wrote about the importance of total honesty just a couple of weeks ago. The more we write, the more we recognize what goes into a good relationship, and we realized that honesty is required to create trust, and that trust is necessary to have commitment, and a committed relationship is one where it is safe to be totally honest, so it makes a circle.\n\n",
            "You’re not an idiot at all. You tried to spare her feelings and that’s commendable.",
            "This was actually really touching and beautiful that you worked it out. Best to you both.",
            "Sounds like you have a great relationship! If I was in this situation I would feel the same, mad about the lie, happy my partner loved me enough to try. This will be a funny story in the years to come.",
            "You’re such a sweet husband ❤️",
            "I don’t get what the big deal you should just be happy you got to have them in your arms. Lying bout it is just plain dumb though. ",
            "I'm so happy you were able to work thing out man.  Good luck with everything ",
            "I am so glad that you guys are working through it!\n\nThe post made me sad but I understand your intentions, I have friends who work in childcare. Many of childrens firsts just happen to be in daycare, and they dont mention it to the parents.\n",
            "Lol I’m a stay at home dad to 11month twins and my wife and I keep joking that I’ll just not tell her if they hit any milestones while she’s working",
            "Worst TLDR I've ever seen!",
            "You guys seem like a great couple! Starting  out any serious talk with affirmation of love is an awesome idea. It allows both people to be open and honest and it fosters understanding. I hope others read this and take it as advice.",
            "That sounds like you guys came to a nice conclusion. Even if she misses a \"first first\", it's still a first for her when she sees it, if that makes sense.\n\nI think it's a great idea to keep all these videos and photos in a folder for the both of you.\n\nRe: suicide. Talk to your wife about your fears. Don't hold it inside. So many people are afraid of talking about suicide because they think they'll be putting the idea into someone's head, but that's not how it works. Let your wife know you're there for her and what you're afraid of so she can reassure you.",
            "All three of you are hero’s!! ",
            "I'm not sure if this has suggested or not, but you could put a folder on like the Google Drive and upload videos fresh off the event, and everyone could have access for quick sharing!\n\nGlad you and your wife talked it out!",
            "This is so hard. I think you're a great husband doing his best for his wife. ",
            "This update is so sweet and heartwarming. Thank you for posting it!",
            "I'm so glad this had a happy resolution. It gives me hope that two people can talk through a situation like this and then laugh about it. Your marriage is inspiring! =)",
            "I read the first a bit ago and now the update. You gotta quit shouldering all the blame. This sort of thing, as others have said, is incredibly common. Further, you both choose to have a child during perhaps the most difficult time in her career. Not everyone is Elon Musk and can do the work of three people at the same time for years.\n\nThis is going to happen again and again if her job keeps her away from the family constantly.  It's not on you to keep up some charade that progress in the home only happens in her presence.",
            "Such a lovely update! Your wife is so cool. ",
            "I don't know if anyone said this but, I find this Interesting because I  used to work at a day care with babies and we would do this all. The. Time. If a baby had a milestone, we would say they're close to it. So, I have mixed feelings ",
            "My kids have gone to daycare since they are about 3.5 months old.  They are almost 3 years and 8 months respectively.  Daycare teachers are often the ones who get your kids first milestones.  They are very adept and reading the parents and can tell which might be heartbroken at missing the first roll or the tentative first step.  With my first, they told me that he was looking like he might be ready to roll over any day now!  He did, he rolled over that weekend, while I was videoing him.  Can I be sure it was his first roll?  No, he probably rolled over at daycare, but it was MY first time seeing it and I was SO damn proud of him as ridiculous as it seems. I am getting teary eyed remembering the moment and he will be 3 next month. \n\nWe have videos of his first steps, and I do really think they were his first, but I am not sure about his crawling, and other milestones. \n\nIt's incredibly kind what you tried to do, but we all make choices, and I understand that my working (not a doctor btw, mad props to your wife) means that I will miss things.  There are days that the videos and photos come through from daycare and I just cry quietly in my office for a few minutes because I just miss my kids in that moment.    \n\n\nYou sound like a wonderful husband and father, and damn, your mom sounds like a real amazing lady.  To be so gracious and understanding to try and help your wife feel like she didn't miss these moments, as opposed to gloating about grandma being there, tells me so much about your mom's character - especially since you said she is more traditional.  \n\nI'm so glad you two worked this out maturely and lovingly.  There are going to be more challenges to come and now that you can openly communicate better, you will get through those too, one step at a time - no beanbags required. ",
            "You’re an awesome dad and husband! I’m glad you guys were able to work through this - you obviously had the best of intentions, and you weren’t lying for malicious reasons. Sending you all lots of love and strength, especially your wife - residency is CRAZY, and I’m glad she has such an amazing support system!",
            "I’m glad you guys worked this out. The medical field is tough when trying to raise a family. Stay positive and honest. Good luck to you and your family. ",
            "For your wife and all medical professionals:\n\nEpisode 30 (scroll down a bit) is on burnout and management of stress for medical professionals. ",
            "My stomach is knots from how sweet and thoughtful you are to your wife. Lying is bad, but in your case it came from a genuine place. Best of luck to you and your family! ",
            "I mean this very sincerely because literally everyone can benefit from it, but it sounds like you might need some therapy regarding your uncle and suicide. There’s a difference between being aware of danger signs and projecting onto your wife. It seems like you really care about her and I’m really glad this was a situation where you guys communicated and sorted it out 💕",
            "OP, you and your mom are so wholesome. I hope your family stays loving and has the strength to get through this tough time. Having a young child is hard. Being a resident or SO of someone working so much is hard. But damn do you love your wife.",
            "Not to minimize what your wife is going through, but stereotypically, dads are the breadwinners, and we miss tons of milestones while at work. One parent or the other may miss something, even if they were home. \n\nMy kids are now in their early 20s, and pretty much live their own lives now. When we are together, we cherish those times.  I was present for my daughter's first steps and words. I have zero recollection of my son's (who's 4 years younger)- seriously, after the first kid, and when the first one is walking and talking, you're pretty exhausted when another kid hits the scene. \n\nI was present on weekends to help coach softball games, and other \"firsts.\" Your wife will likely be present for first day at school, plays, graduation, etc. \n\nProps to your wife for being in a grueling program, while being a \"present\" mom. Present doesn't have to mean being there at every moment; that's impossible. If your child knows they're loved and emotionally supported, you're \"there\" all the time. I think that's more important than witnessing a \"first.\" Moving forward, it's the collection of moments that make up our memories, so make the most of them. Before you know it, the kid(s) are independent, and walking out the door. That's a bittersweet \"first.\" ",
            "I missed the original post but this is easily one of the cutest screwups I have seen in this forum.  It's very obvious you love your wife OP! Glad she was able to get over the (well intentioned) lies.",
            "This happens to me a lot because I work full time and the commute isn't short. Sometimes I only get to see my kids for like 30-60 minutes a day during the week. It's rough. Sometimes people don't tell me things happen, and I didn't how I feel about that. I know that realistically I'm going to miss stuff, I'm gone for like 10-11 hrs a day.\n\nBut sometimes them not telling me means I get to see their new tricks first hand, so it's a nice surprise anyway. They walk around, they wave, they say \"uh oh\" and \"hello\" a lot.",
            "This entire story is wholesome and adorable.  You’re a sweet hubby and dad!  Cheers to both of you!",
            "Best husband ever! I hope to have what your wife has in the future!!",
            "The only think that make it up to her is to actually make her understand you did it to make it easy on her and your options were limited. Then discuss how would you to deal with things like in the future? Wish I could take more time being insightful it seems you love this women and you prioritized you love over morality and as upsetting as that is it can’t be next hearing every big milestone you child had constantly but she still feels she missed and was lied all at the same time so just tell what it meant to you. That you didn’t count the milestones when she was gone but when you were both present and she was there. Hope that helps ",
            "I've never got this \"firsts\" thing at all. If it was a one off, then yeah, but you can watch them do it for the rest of your life, you ain't gonna see there first a lot of things! ",
            "You did a crazy crazy thing...like soap opera crazy...i dont think missing “milestones” is such a big deal to require faking them lol. As long as youre around, you get to see the general picture of progress which is probably more rewarding.\n\nYour child is pretty young but when they get just a bit older, you wont be around for all of their verbal milestones, youll only have the first time YOU hear them, which I think is just as good.",
            "Good for you. When you have your second child nobody is going to be interested in milestones anyway lol everybody is going to be just like yeah whatever As long as the baby eats, poops, and sleeps well 🤣🤣",
            "OP, you may also want to consider your wife being jealous of your mother. By moving to your home, your mother is mothering that child. By the time residency is up, that child is going to know grandma as being its mother, basically, regardless of what you teach it to call them.\n\nI am sure your wife realizes this and feels terrible over it. She may also have some animosity towards her because you state your mother doesnt exactly approve of a mother being a doctor and a father a stay at home dad. ",
            "I don’t understand needing to be present for these firsts so bad that you get so upset you cause this entire debacle. \n\nPerhaps it’s because I’m not a parent, but it just seems so stupid to me that you’d get so caught up in this that you’d be lying your wife about it. Similarly, it’s stupid of her to be so caught up in this that she’d be heartbroken by not being there.\n\nIt’s not a big deal to be there the first time, its just a big deal to be there. Fucking stupid. Our lives aren’t the guiniess book of world records, we arent here to set records and observe firsts, we’re just here to live. There is no significant difference between the first steps and the second steps.",
            "I’m so glad that you worked it out. I’m sure she’s sad that she missed the milestones. I was there for most of my children’s...though there’s never “good” lies, I would have liked to have someone recreate things for me had I missed the big ones. ",
            "Awww <3\n\n&#x200B;\n\nI also laughed at the bean bag trick.\n\nYou were well intentioned and I'm glad she appreciated that.",
            "This is such a common thing people do. But I understand she is upset.\n\nI work a lot  but my son is happy in daycare and when my mom picks him up. It’s good too know he’s in the hands of someone he loves and someone who loves him back and really cares about his well being. \n\nMy mom has always worked several jobs and I was at my grandparents house a lot. She went to school when I was 3/4. I don’t remember missing her at all. I remember eating pizza and watching wrestling with my grandma. I remember my grandpa taking me for rides in the car all over town. I remember my mom showing discipline and teaching me work ethic and responsibility. \n\nIt hurt her more than it hurt me.  Now that I have a toddler I’m learning  it’s a bittersweet feeling. Yes I miss my son and I feel like a jerk for not being there for him. But I am there for him. Just not 24/7. I need to work on myself too. I have a career and I am making decent money right now. She’s stressed out and tired and working her ass off, but to throw some cliches out there: this too shall pass! The days are long and the years are short but she’s almost done with her schooling. She needs to stop beating herself up! (Easier said that done, I know.)",
            "The original post is amazing and the bean bag trick was one heck of a thing",
            "Omg..i want my 10 mins back from reading this.  Tell your wife to suck it up.  Parenting isnt for fragile people lile this",
            "The fact that this guy loves his wife so much and cares so much about her feelings that he would go to this length to make her feel happy is truly awesome. No, lying is really not \"ok\" - I get that. It's just that he is supporting his wife and her ambition to become the best version of herself and make her dream come true to a degree that most men wouldn't even think about let alone go to this extreme to accomplish it! Yes, I absolutely understand where the wife is coming from and how hurt / betrayed she feels in the moment, but in the end, she realized that her hubby was really just trying to love her and protect her. ❤️",
            "Does it even matter that much if you're not there for the milestones?",
            "You were not stupid. You were actively trying to assuage mommy guilt. How is that stupid?\n\nGlad the truth is out and both of you can operate  in reality.\n\nI told my wife your story and she said that you faking the first moment for your wife was cute.\n\nShe missed some milestones with our kids but had the attitude that. \"it doesn't happen unless Mommy sees it\"\n\n",
            "Hey, thanks for this update.",
            ">I apologized and explained that I honestly thought that she would prefer the lying if given the choice.   \n>  \n>  \n>  \n>namely, that I'm scared she's going to become suicidal.\n\n&#x200B;\n\nYou really need to stop making unfounded assumptions about your wife. It's like you're projecting your own fears onto her. Your wife never gave you reason to believe she'd be suicidal or that she couldn't handle missing her child's milestones. You aren't supporting her by infantilizing her. Why don't you try asking her how you can relieve her stress instead of rolling with your own assumptions?\n\n&#x200B;",
            "I do not find this as heartwarming as most.",
            "Lawyer down, cancel the gym, and eat pizza.",
            "[deleted]",
            "Tbh you say you dont deserve your wife. I mean, I'm not the one to determine it, you and your wife are. But imo at the very least you obviously care about her feelings/life. \n\nAre you the most wise motherfucker on the block with this, no. But some people sincerely believe withholding info is a act of care (and some would even prefer that for themselves if they're met with the choice, while other would rather the truth. But we ultimately don't know unless someone say something, otherwise we're using our best judgement) which I'm counts for something?",
            "[removed]",
            "this warms my cold dark heart so much!! thank you for sharing.",
            "[removed]",
            "I can’t see anything wrong with what you did here. Lying to your wife isn’t good and she will see it that way but fuck me, you did it out of the goodness of your heart and out of love, that’s all that should matter. I think this was a good thing to do, just not so smart to have the evidence on your phone lol. Anyway I commend you on for having such a big heart ",
            "I read both posts.  I hope to have a relationship like this one day.  I thought I did but some people are cheating liars. ",
            "[removed]",
            "How does she feel about your mother? Do you work as well? "
        ]
    },
    {
        "post_id": "fn8n1t",
        "author": "DemiSeren",
        "title": "UPDATE: I (34F) feel unattractive and my husband (41M) of 5 years has low libido",
        "url": "https://www.reddit.com/r/relationships/comments/fn8n1t/update_i_34f_feel_unattractive_and_my_husband_41m/",
        "score": 9613,
        "num_comments": 264,
        "created_utc": 1584916178.0,
        "selftext": "I posted last summer about [struggles with my husband of 5 years](https://www.reddit.com/r/relationships/comments/c96jun/i_34f_feel_unattractive_and_my_husband_41m_of_5/), our longest dry spell being 9 months.\n\nI felt unattractive and undesirable, and wanted to have sex more often, but he was happy to never have sex again (aside from how that would affect me). I wanted to feel like a sex Goddess again. Reddit advised me all kinds of things, from checking testosterone, to therapy, and even that there was no hope and if I wanted to feel like a Goddess again, I'd have to leave him. The [comment](https://www.reddit.com/r/relationships/comments/c96jun/i_34f_feel_unattractive_and_my_husband_41m_of_5/estjlke?utm_source=share&utm_medium=web2x) that hit me hardest was jimmyjrdanceparty's who pointed out that I was allowed to feel the way I did.\n\nWell, I feel like a Goddess again, everyone! :D\n\nWhat happened? I decided to go to individual therapy, and focus on myself, work on myself. My physical self-image was a symptom of a larger problem. Troubles at work, troubles at home, a storm inside. During counselling, I opened the door to a cellar where I had been keeping my true self locked in the dark - ashamed of her. I was bullied as a kid, and I had no idea I had accumulated so much self-loathing since then. Releasing that was amazing and so freeing!\n\nAnd so, by the time I said goodbye to my counsellor, I was stronger and more self-assured. I realised I had been sacrificing so much of myself for the sake of others (especially the important men in my life - my husband, my boss, my father, my manager, etc). I was constantly seeking approval, trying to please them. My relationships had gotten completely out of balance.\n\nThings started to get complicated. I developed a crush on a colleague, and because I am demisexual, my attraction to my husband started to diminish. The more time passed the more I felt like I just didn't care anymore what he thought of me.\n\nAt a low point, I said to my husband: \"You know, you always keep your thoughts to yourself. I used to find it mysterious and interesting - like a puzzle I could unwrap. But now I realise that there's actually no mystery to unravel. There's just nothing. And the silence is boring.\" It was hurtful and unkind. I'm not proud of it. Something changed after that. Both for him, and for me.\n\nOver the course of the next few months I gave less, and I took more. I went to conferences, I left the kids with my husband, I took time off work, I stopped making up for the mistakes of my superiors at work and let them deal with the consequences of their actions. I felt like I was coming home to my true self - my no nonsense kickass self.\n\nOne night my husband and I were watching Alien, and he confessed that ever since he'd seen the original as a boy, he'd really liked Ripley. She was the kind of woman he had wanted to marry. And so he married me. You should've seen my face, the tears wouldn't stop. I felt like he had finally told me what I needed to hear the most.\n\nI got rid of my attraction to my colleague. It's actually not that hard as a demi, I just focused on everything I didn't like about them, and within a week or two the crush was totally gone. I find them a total turn-off now.\n\nDo you remember I mention I wasn't able to initiate sex? That's because it was a huge turn-off for my husband. One evening we discussed why, and you know what? He felt too much pressure if I initiated, because he thought he'd have to perform. Once he realised that he can safely turn me down if he's not in the mood - and also that's it's OK for us to kiss and cuddle without it leading to something more - he's been OK with me initiating. You'd think you wouldn't get to age 40 without having figured that out, but hey... I guess people never cease to throw surprises!? Haha!\n\nOur sex life improved a lot. I no longer needed his praise to sooth my self-loathing, so I was less needy about it. He initiated a bit more often. But more importantly, with greater enthusiasm and quality! He chooses what I wear sometimes - and I feel so beautiful when he looks at me like I am the only being that matters. And he compliments me! We even got into a bit of light D/s, which has spiced things up a lot!\n\nEven though I had fallen out of love with him for a while, I have fallen back in love with my husband stronger and harder than ever before!! I couldn't be happier, I love myself, and I love him so SO much!! He's just the best partner I could ever wish for! <3\n\nThank you reddit for helping me through one of the hardest lows in my life, and thank you especially jimmyjrdanceparty for your advice and encouragement.\n\nTLDR: I felt unattractive and my husband didn't want sex. I went to a counsellor. I stopped self-loathing. Husband and I fell back in love again & have great sex.\n\nUpdate: OMG thank you thank you thank you for all the comments and awards! I have no words! I thought maybe 5 people would care about the update, not this amazing amount of encouragement! Thank you so much, so glad to have been on this journey with you. <3",
        "permalink": "/r/relationships/comments/fn8n1t/update_i_34f_feel_unattractive_and_my_husband_41m/",
        "comments": [
            "This is the best post I have ever read on here. You changed your thoughts about yourself, which is the secret to life (IMO). Congrats and thank you for this empowering and amazing story!",
            "Love this!!!!! Therapy! That’s the number 1 thing I want to say to people in this subreddit. Either couples counseling or individual therapy is so crucial to mental health. You should be so so proud of yourself for getting what you needed and taking control of your life!",
            "These are my favorite types of updates. I love it when people communicate, identify their problems and tackle them together. Thanks for the update OP!",
            "You put so much hard work into all of this! Congratulations on finally finding your happiness 🧡🧡🧡🧡",
            "I’m so glad a situation like this turned into something positive and happy on Reddit and not something I saw over on /r/gonewildstories. \n\nIt’s good to read a story about who adults experiencing sexual problems in the relationship handling it like adults. Not turning it into a cheat fest, which many couples do, or a dead bedroom situation.\n\nAnd you’re a fucking badass to for going to therapy and figuring out your shit! That’s so fucking awesome. And I hope to do that someday myself!",
            "I was expecting this to turn into a cheating story because I’ve seen this before on this subreddit, the exact same details apart from her loving her husband during the time(s) she cheated \n\nBut I was surprised, guess it finally clicked for him - I hope you two go on strong",
            "My boyfriend and I have different sex drives (I’m 25 and he’s 35) and I usually get a little upset and felt rejecting. I’ve been seeing a therapist for about 2 years and I feel more confident in my own skin, but I’m curious... did you bring up your sex life to him/her? I guess I’ve never realized how sex ties into our self esteem so much. I want him to be able to safely turn me down to, which I admit I fail to not take it personally sometimes",
            "Amazing. So unlike what I normally read on this sub and it has really helped my mood today. Well done, Goddess",
            "It's probably an unpopular opinion, so I'm ready for the backlash, but here goes. I understand wanting to work on yourself and I'm glad you resolved your issues and found positivity and love in your life. But it just seemed that in that journey you treated your husband and your colleague very unkindly which could have been avoided. And even that is fine, as everyone makes choices that hurt others, but what I find worrying is your lack of remorse. \n\nIt would have made sense if these issues were caused by them, but like you said it was your own personal perspective of yourself.\n\nI just find this worrying, and someone should notice this.\n\nAnyway, I'm glad you're happy now and hope everyone else in your life is too.",
            "I hope OP reads this.\n\nEven if things are much better now, keep going to therapy and talk to your husband about him going too. Life is not ever constant. Things will get complicated again eventually, it's important for both of you to have the tools to go through the next issues better prepared and with the training of working things out AS A TEAM. \n\nI just read this update and haven't read all the comments so I don't know if he's been to therapy or not.\n\nWhat I wanted to say is don't lower your guard because things are better. You both need to keep working in your couple's communication.\n\nBest of wishes OP",
            "OMG I wake up this morning and see all your replies! And gold?! I did not expect this! Thank you so much. I am not crying. I am not crying. T_T",
            "I'm really, really, really happy for you. I said it in the DMs but I'll say it again, this made me cry. You and your husband are true models of love being an action.",
            "Epic story. I love it. Thank you for sharing. ❤️❤️",
            "I'm not crying,  you're crying",
            "love this! actually working through something instead of ditching when the going got tough. congratulations!",
            "Wish I could give you gold! Congratulations on this amazing phase in life!",
            "I'm so happy for you !\nReading your story actually gives me motivation to improve my life and myself.",
            "I'm very happy for you, however I'm concerned you have used your sexual orientation to explain/excuse why you crushed on a co-worker and why you lost attraction to your husband, and why you said mean things to him.",
            "I hope you never delete this. It's very inspiring and I hope to come back to reference it at my low points in the future regarding myself or a S.O. issue. Congratulations on finding a solution and yourself!",
            "AWESOME.....GREAT STORY...& IM HAPPY FOR YOU...INSPIRING, EXSPECIALLY IN THIS DAY IN AGE..GOD BLESS YOU-THZCHOZEN1",
            "What I really like about your story is that it took some self work and self discovery.  This, to me, is crucial. I love that you have developed a different frame of mind as a result and it shows that any circumstance that we are in can change for the better if we do the work.  I actually see this all the time with people who work on themselves and learn to be better about communicating effectively.  This just reinforces those thoughts for me.  I really appreciate you posting this and I am very happy that you had the determination to care for yourself and as a result have a happier life.  It always starts with us.  If we can learn to work on that first, things will fall into place in a beautiful way.  Yay, I got the good chills.  <3",
            "A real-life Cinderella story, good for you.   That communication piece is just very very difficult for some people (myself included) to master, but it makes all the difference, doesn't it?",
            "This gives me so much joy to read!! Good for you, OP. Many blessings to you and your family ♥️",
            "Congratulations on getting the help that you needed!!!!!\n\nIt's really difficult to love someone else, when you do not love yourself. There are times in life when you just take care of yourself first. Glad you figured it out. All the best to you.",
            "This is the best update :') So happy for you!!!",
            "I absolutely loved reading this post. So happy to see a positive outcome. Well done!",
            "This is the best thing I have ever read on here. Thank you for sharing it with us.",
            "What a great updated. You managed the situation incredibly well. I am really happy for you !",
            "Wow - I’m so glad I came across this post! It resonated with me so much, and I plan on putting into practice a lot of the things you mentioned. Thank you for the update! Glad to hear you’re doing well!!",
            "This is great. I guess people can learn a lot from OP's post about holding themselves accountable for how their respective lives turn out. It's a great lesson ins self-responsibility and taking matters into your own hands. Thank you, OP!",
            "So happy for you guys! Both my husband and I are demis. It's always nice to hear success stories on this sub. I hope you're his Ripley forever and that he's always the most attractive man in the world to you. I'm just super glad you guys are doing so much better. 💚",
            "hooray!! this is so wonderful!!!",
            "loved this post, well done to you and your husband 🥰🥰🥰",
            "Nice! Super glad it worked out for y'all.",
            "This is like a perfect guidebook for how to address self-esteem and relationship struggles! You took care of yourself, got yourself to a better (happier) place, and that gave you the stable base from which to address the issues in your relationship, through frank and generous communication—from both sides. I'm simultaneously so proud of and so inspired by you, good stranger! Congratulations and best wishes going forward!",
            "Yaaaay!!! I'm so happy for you!!",
            "This is the best update ever. Yay for self growth!!\nJust curious if your counsellor used any particular method or techniques? It's been a lot harder for me to reach this kind of break through! X",
            "thanks for posting something inspiring and uplifting on this thread! so happy you finally were able to see the light and are in a better place <3",
            "Ahhh congrats!! Therapy can do wonders in the right situation can’t it!",
            "I admire you, honestly. It's so inspiring how you focused on yourself so carefully. I really have struggled with self love too, as I'm sure a lot of women also have.",
            "Kudos to you !!!  You put in the work as well as worked on yourself, it’s had to come to face that there’s things we need to work on to improve oneself but once you do it’s amazing 💕✨🍀.",
            "Thank you, thank you, thank you for your forthrightness, your openness and the strength that will give to so many!\n\nLOVE, true love, for you being YOU - you have many admirers now and so richly deserve every one. \n\nThank you again",
            "This post was like synchronized with mine, and it gives me incredible hope so I saved it. I reached o it to a therapist today. I don’t want to self-loath anymore it makes me sick.",
            "So happy to hear that I wish you nothing but the best.",
            "Wow, this is a very inspiring post and I relate to many aspects of what you're saying.  I'm grateful that I'm on a similar trajectory in my personal life, and that I'm not just starting out...thank you for the good reminders and pointers!",
            "Wow such a great story! Congratulations! \n\nYour comment:  \"You know, you always keep your thoughts to yourself. I used to find it mysterious and interesting - like a puzzle I could unwrap. But now I realise that there's actually no mystery to unravel. There's just nothing. And the silence is boring.\" Is a fear that my GF has this thought of me very often. I'm in my head a lot. How did your husband change after that comment?\n\nI too carry a lot of low-self esteem baggage and always aimed to be the people pleaser. I don't really like it that much and I'm beginning to notice it again in my relationship. I'm starting to not simply give in every time but slow down the decision-making so that I can ask for what I want to. But I still think that many of my decisions revolve around her.",
            "One hell of a lot of people need to look at what you did and take notes. Props for not giving up on the marriage and actually looking for a way to make things work.",
            "Oh my gosh I'm so so happy for you!\n\nThis is so great to read, I hope that one day in my future relatioships I can solve things just like you: seeking for the right help, in a mature way",
            "This post made my day, and it's the type of ending I need to hear. Congratulations! And may you have a long, happy love filled life with your loved ones!",
            "This is such an uplifting post! So happy about how things turned out for you :)",
            "Dude. I am so lumpin proud of you. This is all so amazing and I loved every word. I wish everyone could experience this for themselves. Isn't it so FREEING?! I'm so happy for you! ♥️",
            "Great to hear about your transformation. Best wishes!",
            "Congrats to the happy ending. Hope it will last even longer.",
            "Who'd have guessed that *Alien* would provide a key plot point in a major r/relationships success story.",
            "Wow this is such an inspiring change.\nI hated myself since I was a child. I was bullied too. A lot. Mostly by boys when I was in school. And they used to bully me physically too sometimes. So I felt really ugly since then. And sometimes. I feel like that girl I was. And I feel weak and ugly. And I hate it. And then I realised that I have that image of myself. The image of when I was a child. And I just can't stop hating it. I tried to go to therapy. And they've also told me to stop hating it. But I can't. \nThat's why I'm so insecure. And I feel like shit everytime I like a boy. Because I always think they're out of my league and they will never like me back. (which I mean, can be true). \nBut the feelings I get when I like someone are completely terrible... I start hating myself so much. I feel so sad and useless and ugly. And not feminine. And I feel like that girl that was bullied and called bad things for her appearance... \n:( I'm sad. Lol.",
            "Thanks for sharing your beautiful update. BTW - Please send this post to sub Reddit category r/deadbedroom as a successful story. It's needed over there! 🙄😜👍🥺😄😆🙏🤓",
            "this is amazing! I'm glad that you have rebuilt not only yourself but your relationship. I can relate, I've been on the other end and been disappointing but have started focusing on making myself right again. it's a long road to travel but I feel optimistic!",
            "I appreciate your honesty here. Thank you for sharing.",
            "I don't remember if I read the earlier post back then but when I read it now all I could see was this poor woman seeking attention and validation through sex and I felt so much sympathy towards you because it's such a cruel thing society does to us. I'm very happy to hear you found your worth and can feel the love through other means. I'm also happy that you didn't try making your husband \"fix\" his low libido and accepted him the way he is.",
            "This post gives me a lot of hope, thank you for sharing your story",
            "Brought a smile to my face glad everything worked out for you",
            "This is great. I’m really glad to hear everything worked out :) Therapy goes such a long way. All we have is our own mind and our own thoughts. It’s always best to keep our mindsets healthy and keep ourselves comfortable living in our own skin/ have a good sense of self.",
            "Damn sounds familiar to me lol except for the fact it wasn't all me",
            "Thanks a lot for sharing this. It gives me a hope for my relationship which is going through difficult time now.",
            "Wonderful post . Congratulations",
            "I’m sure happy for you! My husband is exactly the same way. We got together he 20 and I was 24. For the first 6 months doing ALLthe time. Then screech, it was like someone flipped a switch. Now looking at our 28th anniversary, I used to get it on my birthday and sometimes Christmas. He says he’s got ED . Ok , but, he won’t aggressively do anything to help. I’m about 180 degrees opposite. I have always had a very healthy sex drive . We used to joke about me being a nymphomaniac . Now, I don’t ask for it because frankly it makes me feel bad about myself. Especially after he gives his usual answer and I’m not to care or stop wanting sex . I’m even said we can just cuddle and just body contact. He won’t do anything but thinks I shouldn’t have a right to say anything about this . If I dare mention it, it just makes us both feel bad ! \nQuestion; do I leave or have lover on the side or suggest a throuple? Yes , I’m very serious and want all your insights and opinions. \nThank you, Very Frustrated 😏",
            "Thank you Demi-seven .\nI hear you and what you’re saying. I whole heartedly agree. Now , here’s the rest of it . I Love my husband, I do but, I’m finished trying to talk to him or him to some one o a dr . I’m at the point where I’m seriously considering finding a lover . I’m always being propositioned all the time . I say that with all modesty. I don’t see what others do. Truly!!! I don’t want a divorce he doesn’t want to get help . So, an affair is all I can see . Know that an affair is not what I want or think it is right . \nI’m literally crying right now writing this . I’m in therapy and have been with no resolve. I’m so lost . I’m just at my wits end!!!! I’m taking all advice!!! Thank you!",
            "It's a matter of re-working strategies, communicating and all that. More people should have relationships like you and your husband or if they did, they WORlD would be a better place",
            "I have no idea why I got this recommended, but it is such a beautiful story that I can't help but comment.\nThanks for this. And all the best for you and your husband, together, with lots of love, sex, movie nights, cozy cuddling, and such great discoveries.",
            "Awesome! Cheering you guys on!!",
            "OMG that is such a beautiful story!!! Wtfbbq\n\nI'm so feaxkjn happy for you two!!\n\nI hated the part about leaving kids/him blah blah, cus it's not part of the solution. But focusing on yourself and what actually matters IS.\n\nDamn, you've made my month. Literally.\n\nYES EVERYONE THIS IS A WOMAN WHO TRIED HARD AND LOOK ITS POSSIBLE !!!",
            "[deleted]",
            "[removed]",
            "The hell is demisexual?",
            "My husband and I have been in a tough spot for maybe... going on 2 years now? It's hard work, but stories like these make me think our efforts aren't in vain. Kudos!",
            "Off-topic (and in no way a remark on your writing) but I feel our language should have a feature for laborious snippets like \"low libido\", where it almost sounds like you're stuttering, which would make it correct to create an ad-hoc portmanteau. \"Lowbido\", in this case.",
            "As someone who's probably a lot like your husband, one of the things that scares me the most is that my partner will say something to me like what you said about him about there being no mystery to unravel. Can I ask: do you still feel that way about your husband? If not, what did he change to make you feel differently?",
            "First of all, so proud of you. This is really great, an ideal outcome borne of maturity and PUTTING IN THE WORK.  \nSecondly,\n\n>I got rid of my attraction to my colleague. It's actually not that hard as a demi, I just focused on everything I didn't like about them, and within a week or two the crush was totally gone. I find them a total turn-off now.\n\nI have never read such a succinct description of how my demisexuality works. The few times in my life I've felt \"rejected\" by a man showing less interest than I was at the time I've found it almost ludicrously easy to get over it (and them) in a matter of maybe 2-3 weeks, lol. I just focus on their (usually glaring) flaws and then they overcome the tingly \"crush\" feeling and it's done. I literally don't even think about them after about a month.",
            "I know this doesn't have a lot to do with your post but I needed to say thank you. You mentioning being demisexual i thought, \"hm, what's that?\" So I googled it...and found out that's me. So I'm enlightened and surprised but very very thankful.",
            ">I developed a crush on a colleague, and because I am demisexual, my attraction to my husband started to diminish. The more time passed the more I felt like I just didn't care anymore what he thought of me.\n\nSuper\n\n>At a low point, I said to my husband: \"You know, you always keep your thoughts to yourself. I used to find it mysterious and interesting - like a puzzle I could unwrap. But now I realise that there's actually no mystery to unravel. There's just nothing. And the silence is boring.\" It was hurtful and unkind. I'm not proud of it.\n\nGod you're a real peach.",
            "wow!\n\ngreat to hear this",
            "This made me tear up. You're awesome! Congrats on realizing how great you are, and also on working things out with your husband. I wish you all the best!",
            "I'm so happy you strengthen yourself and worked on your relationship. Too many people bail but you perused and triumphed. Good for you!",
            "Fuck yeah OP! This is awesome!",
            "Wow congratulations!! I'm so glad that you were able to fix your marriage and learn to love yourself!!!",
            "Very very rare to see a reddit post about a spouse who isn't satisfied sexually, losing interest in their s.o, and developing a crush on a colleague that has a positive ending without any cheating or breaking up. Wow. Awesome for you two!",
            "Anyone else get some “Fried Green Tomatoes”/Towanda vibes from this story?",
            "This is amazing and actually a huge help for people who struggle with insecurities and self-image. Thank you for sharing and this inspired me to work on myself more than focusing on the outside factors. I wish you are having all the great sex you deserve!!!",
            "Ahhh - This individual isn’t the definition of growth! 🤟🏾",
            "Amazing post to read, glad it worked out for you two!",
            "u/jimmyjrdanceparty u should see this",
            "I was very happy to read this post! Keep it going!!!",
            "This is great.  I wish my wife and I could learn some of these lessons especially about our sex life.  I can never seem to know when it is an appropriate time to try and initiate and after getting turned down a lot from my wife, I've stopped trying because I just never know and then she complains about me not initiating.  Like tell me when its ok then without me just saying, hey you wanna have sex?  Because its the slight touching, kissing stuff that always gets rejected. Damned if I do damned if I don't.",
            "/r/femaledatingstrategy",
            "I have a feeling I'm about this one been there done that she made me feel like I was the one that didn't want it when she was going out there getting hers wow I was just asking for it at home but it didn't matter things turned out the way they did now she can be controlled and taken care of by someone else it's not my problem no more and the baby's ain't her problem in there cuz I got all of them hard pill to swallow swallow that",
            "This is great, OP. Congrats. I really needed to read this today. \n\nBut I’m wondering: how did you get around feeling (not sure if you did but guessing) like you were the one doing all of the emotional labor here. I’m struggling with a similar issue (LL partner and feeling undesirable) but it’s triggering for me to believe that it is all on me to fix it (YOU went to therapy and got help but what did he do for you)? This is probably going to get downvoted but this is the biggest struggle for me: feeling like I’m the only one who does the bending in relationships to “make it work.”",
            "To DemiSeren . My apologies for getting your name wrong in my last post . Forgive me! Please !",
            "Thank you! I’m sorry if I offend you with my ignorance but, what is Demi sexual ?",
            "I find you to be interesting and fun and I think we could be friends. I’m intrigued by your insights. You’re very wise .",
            "So , may I ask you how did you make the decision to get married? I mean to say if you are/aren’t attracted to some one person enough to get married? \nAgain, please I don’t want to offend you with my ignorance. \nI’m even more intrigued by you and your life",
            "I completely agree with that. I thought we were going to be able to have that forever. Now, I’m not sure if we can last very much longer and I wanna tell him that. Yes , the weight of our problem is going to crush me!!!",
            "Got to be honest I am terrible with this stuff. Ready, can you tell me how to do that. ? I’m sorry if I’m too stupid",
            "Help! I don’t know what I’m doing to get it to DM you .",
            "Ok did I get this time ?",
            "No . W didn’t get it . Please help me with this please. I can’t ask him what to do because he will know that I am talking about this .",
            "I don’t know what url is and what yours are for the link",
            "Good. I’m glad you did. Now I can get more of your great advice.",
            "I feel unattractive too but cause of my tiny breasts.",
            "I teared up a bit reading this. Sooo happy for y’all ❤️ I know none of that was easy and you’ve overcome so much!!! Best of luck with your husband and kids☺️",
            "This is amazing!! Also thank you for having that self reflection. I’ve seen a lot of similar posts about declining sex life and sooo many people instantly try to blame porn addiction. Some people are just out of sync and need a little help.",
            "Communication is the linchpin of every relationship. Glad you found and followed the right advice for you in the chaotic sea that is this life.",
            "[removed]",
            "Good on you for taking agency for your own happiness, OP.  I’m breaking my usual lurker status to let you know you can tag a user by adding u/ before the name.   Paging u/jimmyjrdanceparty , for example.",
            "This is so amazing and wholesome. I love it so much. Thanks for sharing, and great job doing healthy things for yourself. <3",
            "Its good to read things like this in this subs. Im so happy for you.",
            "this was beautiful, so happy for you",
            "Congratulations! I’m so proud of you!",
            "Congrats, and it's pretty good to know there are other men out there that took some of the same things from Alien(s for me).",
            "This is amazing to read. I'm so happy you worked through your feelings by yourself and together with your husband. It sounds like it's totally been worth it :) Also good to read for many people that it really is possible to fall back in love after a rough spot!",
            "This was great, I'm happy for you both",
            "Atta girl! This is such an uplifting post.\n\nI love knowing that you turned your life around and have a rekindled relationship with your husband.\n\nKudos to you for finding your voice, working hard with a godd therapist Rocks!",
            "Wonderful! I’m so happy for you both! 💛",
            "Thank you for the update OP, such an inspirational story! Wish you all the best, you rock! :)",
            "wow I never upvote or comment on this but this is awesome most people just give up and go to the next best thing but you frought for what you loved your a good women",
            "Great to read this story.  Congratulations to you both :)",
            "Communication wins again.",
            "The best part of this lovely update is \\*your\\* personal self improvement and self discovery....Yes Ripley!!!",
            "You know, I feel like I am in a similar boat. Maybe during this time where we're at home we can talk more about it and resolve things positively lile you have. Thanks! \n\nI'm so glad things are better for you. :)",
            "This is awesome, good for you!",
            "This is a great update!  I am happy that things have worked out so well for you, you deserve to be happy.  This is an inspiring story, thank you so much for sharing!",
            "Such a nice post. 💜 I (23F) dream of the day when I can finally afford therapy, and can speak to someone about having no sex drive.",
            "I love how wholesome this post is! I'm used to reading sad stories and shit but this really hit me in a way I didn't think i could get from r/relationships\n\n&#x200B;\n\nProooooooouda you!",
            "This is the most self empowering post I have ever read. It blames nothing but faults of the individuals instead of pointless figure pointing. OP has inspired me slightly",
            "Thats really great to hear. Keep it goin",
            "I used to (still sometimes) have negative views on human relationships. Posts like this change my mind. Thank you",
            "\"I have low libido\"\n\n-men with porn addictions",
            "\"I got rid of my attraction to my colleague. It's actually not that hard as a demi, I just focused on everything I didn't like about them, and within a week or two the crush was totally gone. I find them a total turn-off now.\"\n\nThis right here is all the evidence you need that love, real love, is a choice.",
            "This is what happens when you have that kind of age gap",
            "God led me to this post- I literally needed to read this. Thank you for refreshing my faith that things can be restored even if lost for a while. Imperative thoughts❤️❤️",
            "Didn't read all of it but glad you didn't just settle for someone's advice off Reddit",
            "hit me up for the threesome after the pandemic has passed."
        ]
    },
    {
        "post_id": "cnd80k",
        "author": "big_platypus_",
        "title": "UPDATE: My [24 F] boyfriend [26 M] of 6 months told me that I need to \"unlove\" the men from my past before I can love him.",
        "url": "https://www.reddit.com/r/relationships/comments/cnd80k/update_my_24_f_boyfriend_26_m_of_6_months_told_me/",
        "score": 9579,
        "num_comments": 500,
        "created_utc": 1565219527.0,
        "selftext": "Link to original post [https://www.reddit.com/r/relationships/comments/ccl1gt/my\\_24\\_f\\_boyfriend\\_26\\_m\\_of\\_6\\_months\\_told\\_me\\_that\\_i/](https://www.reddit.com/r/relationships/comments/ccl1gt/my_24_f_boyfriend_26_m_of_6_months_told_me_that_i/)\n\nFigured I'd update my post from about a month ago. Unfortunately, there wasn't a happy ending, but I am very grateful for a lot of the advice I received here. Thank you, reddit, for helping me keep my head on straight!\n\nAfter I made my first post, I read all the comments and thought about everything for a few days. A lot of people mentioned that they would not be comfortable with the frequency of my communication with my ex. I thought that was very fair. People also mentioned that Mark's behavior was pretty controlling and not ok. I also thought that was fair.\n\nI went to talk to Mark and told him that I understood if he was uncomfortable with me being in touch with Eli weekly, and that I would be totally willing to cut that down. I also reiterated again that I was not currently in love with Eli and hadn't been for a while. Mark was understanding this time and seemed happy with the fact that I offered to cut down my contact with Eli.\n\nBut then I told Mark that although I was willing to do this, I wasn't happy with how he approached the issue and that I found his behavior controlling. I basically told him that I want him to approach issues in a more rational way and I would appreciate if he opened a dialogue rather than just telling me what to do, and that I wouldn't put up with him trying to \"command\" me to do something (especially something so ridiculous). I said everything in the same tone as I used for the first half of the conversation - I wasn't yelling at him or admonishing him, just trying to let him know where my boundaries are.\n\nYou guys - Mark. Flew. Off. The. Handle. He started SCREAMING at me. I obviously wasn't having it, so I got up to leave. He started throwing dishes and random kitchen items at me, and grabbed me and slammed my head into the door jam. I ended up with a nasty black eye and a busted lip. Luckily for me, a neighbor heard the commotion and called the cops. Mark was arrested and I was taken to the hospital. Yes, I'm pressing charges and filed for a restraining order.\n\nOverall, it was a horrible incident but I'm glad this happened earlier in the relationship rather than later. And I am forever grateful for the neighbor who called the cops. Im also grateful to (most of) you guys for telling me that I wasn't being insane in my first post and for pointing out the early warning signs. It wasn't the best ending, but I'm ok and I'm just glad it's over. Take this as a cautionary tale, I guess!\n\nTLDR: tried to have a rational conversation with Mark, he gave me a black eye and busted lip, it's over (thank God).\n\nEDIT: I've gotten a lot of concerned messages (which I appreciate!) telling me to watch out for Mark now and that abusers are often at their most dangerous right after a breakup. Just to ease everyone's mind: I'm staying with a classmate (who Mark does not know) for the time being, so I'm well-protected! Thanks everyone!",
        "permalink": "/r/relationships/comments/cnd80k/update_my_24_f_boyfriend_26_m_of_6_months_told_me/",
        "comments": [
            "Him: WOULD A CONTROLLING PSYCHO DO THIS?!\n\nHim: (Smashes dishes and your head)\n\nAll of us: ...yes?\n\nI’m really glad you got out of there. I hope you heal quickly.",
            "Well, you know what.. Fuck Mark.\n\nI'm glad to hear you're pressing charges against the cowardly little motherfucker.",
            "God just even the phrase “unlove” from your first post gave me douchechills. I’m not surprised but I’m so relieved that you’re escaping this situation. Stay safe.",
            "Good for you for pressing charges. Be proud of yourself.",
            "I am not trying to throw you in a panic, but if this just happened within the last few days please be extremely careful, abusive dudes tend to be their most dangerous directly after they get slapped with a restraining order. Keep yourself safe, stay with a friend or relative for a little while if you can and I'm sorry to hear you had to deal with this.",
            "People sometimes think this sub is overreacting when we say that someone is an abuser, before physical harm has been done. But this update is proof that the line between shitty, controlling behaviour and physical violence is wafer-thin. \n\nOP, I'm so glad you were able to get out before they got even worse. Look after yourself and your mental health, your injuries will heal but it's OK if it takes some time to process what happened.",
            "Sweet Jesus. Glad you got out early, this kind of thing almost always escalates.",
            "Oh no, that's so awful! Please, please, PLEASE don't let him talk you out of pressing charges and/or testifying in court! It's actually really common for abusive partners to (seemingly) do a 180 after an assault. Suddenly, they're all loving sweetness. They put on a huge show of contrition and convince the woman to help them get out of legal trouble. Then once they're safe...they drop the act.",
            "*title of post* \n\nHmm ok let’s see what’s the matter \n\n*gets head smashed and lip busted* \n\nHolup",
            "This might get buried but I hope you read this.\n\nI was in an abusive relationship where my ex was in jail for 9 months and is now on 10 years of probation for a DV aggravated assault w/ a deadly weapon and a DV aggravated assault with a motor vehicle charge.\n\nI WENT BACK. Many times. I was with him up until the night before he went to jail after he was out on bond. He never changed. Do not fall for it when he manipulates you and gets you to come running back! \n\nAnd HE WILL TRY. So please, be strong. Don't let it get worse. My stepdad is a cop and he told me if I didn't leave that I would eventually end up dead. Looking back, he was right. \n\nPlease please stay strong. You may be pissed now, but you will eventually have a myriad of different feelings. Inbox me if you need.",
            "\nI was thinking that Mark is like this, when he was trying to get you to \"unlove\" other people before loving him.\n\nLike you said, I'm glad you found out now.  Sorry for your injuries but thank you for being brave enough to press charges against him so that maybe he doesn't do that to someone else.",
            "I am so sorry you went through this. As someone who gave up the charges fight....please don't let his violence go unpunished. It's not going to be easy or quick but please stay the course. Him having a record could save another girl's life.",
            "Wow, that is terrifying, good on you for getting out early. Seems like he wanted someone who would just do what they were told and freaked out when he realized he couldn't control you.",
            "HOLY SHIT!!!! I am SO sorry this happened, but thank god you got out.",
            "Wow... I went to read your original post first and then came back to read this one, and like.... What????\n\nI hope you don’t suffer too much from this, I’m so sorry this happened to you. But it seems you’re handling the situation very well, you’re really strong! Best wishes!",
            "Oh lord, I'm so sorry to hear that he hurt you.  But I'm glad you had such great neighbors.  Take care of you.",
            "Holy crap! You did the right thing, I'm sad you paid for it with bodily harm.",
            "Holy fuck that escalated quickly. What an absolute lunatic.",
            "Jesus tap-dancing christ. What a cock-womble. Glad you got it sorted, and dodged that long-term bullet. Take care of yourself, and don't let assholes try and control you mate. You deserve better. Take care",
            "Looks like he helped you find a quick way to unlove his sorry ass.  So sorry you had to do through this. Stay strong.",
            "I’m so proud of you for setting your forthright boundaries! It’s not your fault you could never have known ahead of time that when he talked about loving you, all he really meant was owning and controlling you. And if you didn’t obey him when commanded to do that he would viciously “punish” you for it. \n\nHe will never, never, ever get to do that. You deserve a good life, OP, and a good love to match. Stay always strong as you are now!",
            "Wow, I am sorry that Mark did that to you.  He is insecure and violent.  I am glad that you are filing for a restraining order and that Mark was arrested and will be charged as well.",
            "Wow. I’m so sorry you had to go through this, but I’m glad you posted the follow up. I hope that anyone that might be in a similar situation understand how serious those early warning signs are and how quickly things can escalate. You’re being very brave going through with pressing charges and I hope it’s over for you as soon as possible",
            "Glad you are out and that you are pressing charges! Hope they throw the book at him.",
            "Fuck Mark!!\n\nI always read the original post before the update post and the vibe I got was - he’s going to hurt OP if they stay together. That kind of “erasing” attempt for anyone else in your life is textbook and toxic. He’d have isolated you from family and friends next (if he wasn’t already doing so).\n\nSorry you got hurt OP, stay strong, remember it’s not your fault. (Ps I also disagree with you communicating with your ex being this huge issue, you’re broken up, in the context of your apparent text pattern of texting hundreds of times a day, it was barely anything. And I suspect as you grew further apart it would likely die down naturally anyway. Just wanted to add that part because people policing how much you communicate with your ex is also controlling).",
            "I mean, I'm friends with my first love. But don't love him anymore. Hell, he hangs out at my place with my current bf! Watches our kid for us. \n\nI'm so glad you got out early. Usually they don't show the signs until about a year.",
            "Unlove, wtf does that even mean.",
            "Honestly this is my first time seeing the post and I read the backstory. Personally I’m 27 and I tried to put myself in his shoes being close to his age after I read the first post but after about 2 minutes of thought I also thought it was bullshit. If you love a girl at this age you have to accept the fact that there was definitely someone important in their life before you. You can’t deny them that ever and have to accept that. If you’re concerned the best way to confront it is by just being there for all of it. You want a girl you have to accept everyone in their life, whether it be an ex or an annoying friend. Regardless you have to accept them and accept they will probably be a part of your life too. If you put up a barrier you’re just asking for trouble. Just my 2 cents.\n\n\n\nAlso though, fuck mark, fuck his violence, he’s a fucking idiot.",
            "ALSO PLEASE LOOK INTO GETTING YOUR LOCKS CHANGED AND GET A SECURITY SYSTEM. PLEASE please please dude.",
            "Thank god you're okay! I'm sorry this happened to you.",
            "Jesus girl. So glad you’re out if there. Hope you’re ok",
            "I'm glad you saw very early in your relationship how abusive he is; that he was gracious enough to show you his controlling/abusive side. It's much better than realizing it after you've invested years into it where your feelings are more cemented and more difficult to detach. In a way, I suppose it's lucky? Messed up, I know.\n\nAlthough, I wanted to say something: in your previous post there were some people who were complaining that you and your ex were exchanging 50-100 texts a day, and I thought that was bizarre. What the hell, how is that off? It's your lover, your partner; you enjoy each other's company and want more of it. My husband and I also EXCHANGE (emphasis on *exchange*) as many texts a day, too, and the reason is because we just have things to talk about. I mean, it's not *exactly* daily, but it is for the majority of the days of the week; when he goes to work, we always still text and talk about silly things. I send him things to keep him \"entertained\" while he's at work and might be bored and he tells me about the things that are actively happening... or we discuss current events/politics/social issues/the kids... we do this because we have a good rapport with one another and actively *enjoy each other's company*. I was so weirded out by people complaining about that. But who knows, maybe it's mine and my husband's relationship that's weird and \"unhealthy\" (yeah right). \n\nAnyway, I'm really glad you're alright (although we're simply strangers!), and I hope you're able to move on from this asap. Good luck!",
            "Wow. Fuck Mark. What a piece of shit.  I'm really glad you're okay.  I'm sorry you didn't completely dodge that bullet, but I'm really happy for you standing up for yourself.  \n\nKeep us updated on what goes on from here with Dicknuts McGee.",
            "OMG thank the baby Jesus you got out!!! Congratulations on losing that asshole and to your amazing future up ahead. \n\nI tried leaving my abuser serval times before I was finally able to escape. I'm sorry he got physical and wish you a speedy recovery.\n\nGood luck!",
            "> Unfortunately, there wasn't a happy ending\n\n> Mark was arrested and I was taken to the hospital.\n\nI'm sorry this scum beat you, him being arrested is actually a very happy ending though. Fuck him",
            " I just wanted to say- be very careful in the upcoming days and weeks.  He escalated SO fast to physical abuse that it's scary.  \n\nStatistically, abusers are at their most dangerous when they are being broken up with.  That's the time when they are likely to act out violently and they will often ignore restraining orders.  \n\nPlease look into changing your locks, and having a friend or relative stay with you.  Also warn your employer about this guy in case he tries to call or show up at your workplace.  Be safe, OP, and congrats on being strong and standing your ground- it takes a lot of courage!",
            "God I read the original post and I was scrolling down through this one I didn't expect this outcome. I'm so sorry OP. Mark can be unreasonable to the bars from his cell from now on I guess.",
            "Good on you for getting out now.  It sounds like it would have gotten worse over time.  Please, take care of yourself and block all communication from him so he doesn't try to weasel his way back in.",
            "Fuck that assbag. I'm so so glad you're okay and happy that you took the right steps towards getting a dangerous criminal off the streets.\n\n&#x200B;\n\nNot all heroes wear capes! \\^\\_\\~",
            "Holy crap! Thank goodness the neighbor heard the commotion. Sounds like you're lucky to be alive. What a whack job. I'm so glad you're okay and really, really sorry that happened to you. Wow.",
            "Mark sucks.  What a loser.",
            "Sounds like a better ending than you would have had if you’d stayed with Mark. Congrats on the freedom!",
            "Oh dang, I'm so glad that you are okay! I'm sorry that you had to go through that at all, fuck that dude.",
            "You are a powerhouse for dealing with this as calmly and rationally as you have. Just want you to know that and hear that from someone. Now you can move on to bigger and better things.",
            "Wow he did that to a law student. Abusive and dumb. Anyways thanks for pressing charges the next person he tires to date will see this, and it stops him for treating people this way cause he is getting locked up. Good luck btw!",
            "I am so very glad you got out of that relationship but know your surroundings. Who knows what can still happen. I truly hope he stays away from you. On a lighter note... I really don't think 10 txts a week is at all bad. When you find someone who truly loves you, he needs to accept your friends and vice versa, irregardless what they are in the past, the present is a childhood, close friend. if they can't accept that and don't trust you, they're not worth it",
            "WOW i mean this guy went from 0 to 100 in an insanely short time, that is scary! You handled this so well so I don't have much to add except that you really don't have to ever doubt the appropriateness of your relationship with your ex. It sounds perfectly healthy and believe me there are guys out there who won't give a shit because they have healthy boundaries themselves. My ex, the first guy I ever said I love you to, only other I've said it to except for my current partner is one of my best friends. He came to visit me and my boyfriend in our new city, we talk all the time, we are pretty close basically. My partner has never had an issue with it because he knows I have zero romantic feelings for him anymore and he trusts me. If you're honest and open about it with future partners you can find a guy who will respect your past relationships because they are a part of who you are now and why you are the person they love.\n\nI wish you all the luck and happiness in life!",
            "I’m sorry he did that to you. I’m glad you’re ok. \n\nAs for being in contact with your ex. You shouldn’t have to change the friendship you have with your ex. They’re an important part of your life. I’m still good friends with two exes. My husband is good friends with his major ex. We would never guilt each other for that. We trust each other. You did nothing wrong here.",
            "Hmmm...it's intriguing how controlling behavior always seems to go hand in hand with violent tendencies. I had a boyfriend that made me cut off all ties with my exes. I also ended up breaking up with him because of violent abuse. Really happy for OP for dumping that scumbag",
            "Nope!!! Fuck off from anyone who tells you how to process your feelings!",
            "Thankfully you are okay. Injuries will heal. And as unfortunate as this situation is, your neighbor was smart enough to call the cops and make sure he couldn't do anything more to you. I'm just glad you made it out of their with your life!!",
            "I really hope you're pressing charges for attempted murder!  Holy shit balls that guy is unhinged!\n\nI am so sorry for what you went through.  I've walked through abuse and it's awful. Please make use of any resources at your disposal...counseling services, etc.  You are loved and you deserved to be loved.",
            "I am sorry this happened to you. You are doing the right thing by moving forward with charges. This is not how anyone should treat anyone ever.\n\nI am glad you are escaping this relationship. Good luck. You are amazing.",
            "Yep.  People who say shit like “You need to unlove people from your past” are controlling and immature.  Massive red flags.  Hope you are ok.",
            "I am SO SORRY you went through this.  It is true that the most dangerous time in a relationship with an abuser is when you try to leave. At least it escalated immediately rather than him picking at your self-esteem for years.\n\nDo encourage the DA to press charges. I hope you have a support system in place.",
            "Holy shit I'm glad you're okay! Fuck that guy, lunatic.",
            "I disagree, this is a very happy ending. You found out early in that this dude is abusive PSYCHO, you got out before it escalated even more, you’re standing up for yourself, and you are now free from this LUNATIC.\n\nAll in all, shitty shitty journey but you are much much better off now and it can only go up from here. Thank fucking god you discovered this now. You’re a very emotionally mature and smart woman and you should be incredibly proud of how you have handled this entire situation and advocated for yourself from start to finish.",
            "Fucking hell, That’s terrifying!  Good on you for shutting that bullshit down right away. Sending much love and BIGG hugs your way.",
            "Holy shit OP, I'm so fucking sorry. You were so brave in facing this asshole and his tiny fragile toxic man ego couldn't handle it. Fuck him, I hope he stays in prison. I hope you get a much better person in your life, because you're strong af and you deserve it.",
            "It's still a happy ending because you got out! Holy fuck he sounds like a complete psychopath. I would maybe change your locks, person like this may have made copies...",
            "Your happy for you, shit, *I'm* happy for you. That is crazy wild and just imagine, you would've possibly been with this dude for mad longer! This is real life for a lot of people out there where they'll even get married before the other person turns that switch. Scary dude, but I'm so glad this turned out as well as possible for you",
            "I’m so glad you’re ok, that is extremely scary.\n\nI recently listened to an Oprah podcast where she talked about Maya Angelou’s quote “when people show you who they are believe them the first time” \n\nGenerally, when someone says something extremely controlling and over the top, that is deeply embedded in their character. \n\nAs a therapist who goes to therapy, I highly recommend finding a good therapist to work through what happened, this entire incident is extremely traumatic. Your mental health is so important.",
            "Bro milk it for all it's worth man, this guy is fuckin dangerous. Hopefully he takes it as a chance to go to therapy and get his shit together before he ends up murdering someone for not \"loving him enough\".",
            "Obviously I don't know your life and I don't want to make assumptions about how you deal with shit. But this kind of thing can be traumatic. Check in with yourself mentally and emotionally every now and then. Here's hoping this incident doesn't have any lasting consequences.\n\nEdit: Also when I was reading your original post I was thinking about Scott Pilgrim vs The World. Like it's not your job to unlove Eli, it's his job to fight and defeat your \"evil ex\". Kinda silly but y'know",
            "My eyebrows went as far up as they go reading this. Good riddance! Good luck OP.\nI am very good friends with my ex, and I'm meeting her new SO this weekend for the first time. Let's see how that goes.\nPeople should be able to be friends with their exes. Anyone who says otherwise needs to grow up.",
            "And I was planning to type something like: \"Oh, how lovely that he seems to be able to reflect on his actions and .... omg... No no no!\". Kudos to you OP that you got out of that! He really showed his true character, good shit that he did and as sucky as it is that you got hurt in the process, its probably way milder than you would have to endure from him in the future...\n\nEdit,: and being friend with exes is so difficuly. My ex is basically my best friend but its been a rollercoaster lately. Luckily I haven't had problems before with partners that my ex has been somewhat in the picture.",
            "Top 10 anime fuckups",
            "Shout out to your neighbour! Not everyone takes the time to react.",
            "I actually work very closely with statistics on female abuse and deaths caused by men. You need to be very careful. Women are most at risk from their current and former intimate partners with mental health issues. Before the charges are pressed through make sure you are not alone, keep friends and family around with you as much as you can. I dont mean to scare you unnecessarily but he has already been violent towards you once. Men like this often break restraining orders too so kick up as much of a fuss as you can to the police to make sure they keep an eye on him.",
            "I'm glad you got out of there. This is why I tell people to nip controlling behaviour in the bud, it's usually hiding a violent abuser waiting to attack you.",
            "So glad you're safe. \n\nThis is a wake up call to a lot of people.\n\nI have broken up with a guy who was rude, insulting and mean in private and going forward, if I feel the slightest bit unsafe, I'll break up in a public place. \n\nYour post is probably helping a lot of people right now. Thanks for the update and glad you're safe.",
            "JFC, what's doubly bad about this is that he went from 0 to criminal in 0 time flat , that kind of explosiveness means for sure this won't be his last (and possibly not his first) time doing this, I fear he may end up killing someone. Good for you for pushing charges!",
            "That escalated quickly, damn!  Glad you got to see his true colors and get out, not glad that he beat you.\n\nSeriously, that guy is fucked up!\n\nI hope you stay connected to your ex.  He seems like a really great guy.",
            "Yo this is fucked. Sending good vibes your way that you heal soon",
            "I came to see if there was an update because I conversed with you on your original post.\nI am so sorry you experienced this and I am so glad you’re pressing charges. It sounds like you really approached the situation with maturity and class - I know you know this but I’m going to gently remind you that you never deserved what happened.",
            "Omfg. Im so sorry this happened. I remember reading your original post and I didnt think anything this serious would come of it. I 100% support your choice to press charges against him cuz this behavior is inexcusable and women have died for trying to be nice and forgiving and not getting their abusive SOs arrested.  Stay safe.",
            "Just a thought.\n\nI disagree with the people who told you to cut contact with your ex. If your ex has been friends with you since childhood, you are basically like family. You shouldn't cut contact with someone you've always been friends with just because your partner is insecure.\nMy boyfriend has friends, girls, he knows since he was young (one of them was his first girlfriend) and yet I never asked him to cut contact with any of them. Trust is part of a good relationship and if there is no trust there is no place for a good relationship.",
            "Got us in the first half not gonna lie",
            "Omg. In the first post i just thought Mark was just a bit insecure. I even understood that he was feeling uncomfortable that you kept weekly comunication with your ex. But holy hell, turns out he was a fucking psycopath. Im sorry you had to go through that.",
            "That took a turn, yikes!!",
            "Sweet Jesus.\n\nI am glad you are ok. And I am glad you are out.",
            "I’m so glad you’re okay. Please never go back to him.",
            "I am so so sorry that you had to go through and endure that. I am so glad you're safe though and that you're pressing charges. You are stronger from this and have learned a lot of valuable things about yourself.",
            "Holy shit...that's crazy. Yea the abusive narcs tend to hide that side of themselves till they \"have you in their clutches\" and then they unleash hell. Glad you got out, and fuck that guy!",
            "What a shit head! Sorry you got hurt, but glad you got out of that mess.",
            "Wtf!! Glad you're ok OP",
            "Oh my God, I am so proud of your bravery, but I'm terribly sorry for your injuries. I'm just glad you're alive.\n\nYou sound strong, sensible, and confident. Keep that up. Good luck with school.",
            "I hate that sorry lump of fuck got physical, rake him across the coals!",
            "How scary!  So glad the neighbors called the police and you're safe",
            "Thank you for coming back to update us. I’m so sorry he escalated it to violence. He showed you his true personality. Good luck pressing charges, and I hope you feel better soon!",
            "Horrible experience, but glad you caught the controlling behavior early.",
            "Yikes that's awful. I'm glad you found out now rather than later, but I'm sorry that happened to you",
            "Fuck Mark.  Holy shit I'm so sorry that happened to you.  I don't care what tone you spoke to him in, you did not deserve to be berated and physically assaulted.  I'm thankful you are able to leave AND press charges.",
            "Oh my God. That's horrible, feel better, sending lots of love ❤❤",
            "I'm sorry that he got physical with you, but like you said, it's good he showed you his true colors early on in the relationship. Good luck with that restraining order, OP.",
            "I'm sorry to hear that happened to you. I'm glad that you've gotten away from him and he's gonna get what's coming to him. If you get the chance maybe send the neighbour a thank you note to show your appreciation. Good luck and I hope you find your happiness!",
            "So sorry to hear about this! This is terrifying and I’m glad you were so strong in this situation and got out of the relationship!",
            "Your intuitions are on point, and they have saved you from further abuse by this guy. Glad to hear you’ve dodged a bullet!",
            "What the fuck. I'm so sorry for what happened, but so glad you got out when you did. What a piece of work. Hugs <3",
            "This took a really dark turn really fast. I hope you are okay and you seem level-headed about the whole situation which is really impressive. Good thing you ended it early and didn’t get stuck in an abusive relationship. Best of luck!",
            "What a wild ride! Glad you are ultimately ok. Sorry you had to go thru that. Hope you are drama free for..ever lol",
            "Damn when reading this I was not expecting all that glad you are ok though.",
            "Girl. Someone up above is watching out for you. The way this happened was shitty but a blessing in disguise and you are so lucky to be given that warning and got out when you did. Cheers to a mark-free life!!!",
            "Wow. You dodged a bullet... Glad you're okay.",
            "Holy fuck. Thank God you are ok. How terrifying of an experience.",
            "Omg. You dodged a major bullet- not to minimize the fact that you were physically assaulted by this clown. But I’m glad you got out before it got worse. ♥️",
            "OH MY GOD ARE YOU OKAY? Thats so fucking scary\nHe's a psychopath, holy shit",
            "Wow. Bullet dodged big time. I don't understand why some behave like this.",
            "Holy shit, I'm sorry that happened to you. :(",
            "Holy shit, sorry about what happened. But extremely glad you got out when you did and found out this side of him early on.",
            "Hot damn! Sorry that happened to you",
            "Wow I thought he'd come to his senses and be reasonable but I guess not. I'm sorry for what happened to you and I hope he never bothers you again.",
            "does he not realize there were people before him?",
            "holy shit.. let's hope he doesn't say \"I love you\" to another girl any time soon! Glad you are ok!",
            "Holy shit, good thing it happened early on ...",
            "i hope you're doing better",
            "I’m so sorry this happened to you, but so incredibly glad you’re safe and into a better future!",
            "You didn't just dodge a bullet you dodged a burst of them from a machine gun nest.",
            "So sad you had to go through that. So glad you have left the relationship and taking constructive steps to keep him away. \nGood luck. And please remember, he won't change, no matter how much he promises.",
            "“Unfortunately there wasn't a happy ending.“ - Underestimation of the year!",
            "I am so glad you're out of there!",
            "Luckily for you, you discovered this side of him early into your relationship while on the other hand, I have to say you have a part to play for how things have unfolded.",
            "Bruh I dated this guy called Mark, total narcissist. Mark the narc. Fuck marks lol.",
            "I’m so sorry this happened to you but also grateful you at least saw the light before this got any deeper and harder to get out of. I’m really proud of you for handling this all as well as you could have and for standing up for yourself in a strong, rational and mature way and for having the strength to leave and press charges. I think you’re really smart, strong and brave.",
            "Wowwww I was very shocked reading this whole thing. This escalated super quickly. I am glad you're out of this relationship. Also it is sad that things turn out this way. Sending you a big hug! You deserve better.",
            "While I'm really glad you got out of there, I'm really sorry you had to go through this in the first place.",
            "I imagined Mark to be this, clingy, controlling, and comic book nerd that just never had a girlfriend before.\n\nShit escalated real quick, I'm glad OP got out alive with this one.",
            "This type of behavior is a sign of his weakness, not strength.  I think you handled it the best you could and your attitude now, \"I'm ok and I'm glad it's over\" will allow you to proceed with your life.",
            "*Does the ‘you dodged a bullet’ dance *",
            "I'm glad you got out. Sorry it was due to physical abuse. Please don't fall for his b.s. when he gets out. He will lay it on thick and try to convince you it was a one time mistake and that he just really loves you. What he did, how he acted, that's not love. Remember that. \n\nThis. Guy. Doesn't. Really. Love. You.",
            "I’m sorry that you experienced that, OP. Take care of yourself.",
            "Honestly I’m baffled at how many people said weekly was too much to be in contact. \n\nMy ex-gf (K) is one of my best friends. We broke up bc I was only in the US for a year and we didn’t want to do long distance. Because of this, we stayed friends and talk on snapchat daily. My new bf doesn’t have a problem with this, he understands that my love for K is entirely platonic and I love him in such a different way.",
            "Omfg I did not see that coming. I’m glad you’re okay and will be pressing charges. I hope you recover from this and find someone who deserves you.",
            "Dear lord he shoved your face into a doorhandle! I hope you're ok and heal quickly. Sorry he turned out to be a terrible dude.",
            "Oh my word. I'm so glad you got out.\n\nWell done for getting out.\n\nI'm so so sorry this happened to you ❤",
            "In spite of his attack, you are empowered and in charge and this feeling will carry you through. Well done and thank God you got rid of that POS. Good luck with the court case.",
            "I'm very glad to hear you filed the order, that your neighbor cared enough to call the cops, and that you're not with him. (edited for typo. I'm pre-coffee!)",
            "Bloody hell this guy is off the rails.",
            "Good thing you know now! Too bad you had to end up in the hospital for putting down boundaries. But",
            "Woah. That escalated quickly. I hope you recover soon and I'm glad you spoke up about the issue and didn't just brush it off.",
            "Yeouch! Sounds like a huge bullet dodged! I’m glad you are ok except for relatively minor damage—this sounds like the kind of guy who would beat you down emotionally as well as physicallly.\n\nFor his sake I hope he got a huge wakeup call and learns from his mistake, just not at your continued expense.\n\nIt sounds like you and your first ex had a healthy friendship and love. What Mark didn’t realize is that you knew what a healthy relationship is already. \n\nCongratulations and good luck to you!",
            "Your approach to the issue was perfect. You addressed the issues, found a compromise, used the right tone. Mark is just a beast, hope he finds a good psychiatrist.",
            "Sounds like good advice from him",
            "Op get away from this psycho path.",
            "Holy shit. I’m so sorry you went through this. I’m so glad you got out, and found out before anything worse happened.\n\nI don’t know how you feel about therapy, but I’m a big fan. In my opinion, what you experienced was traumatic and I believe you would be well served by seeing a therapist to be sure you process all those emotions that are in your body. \n\nGodspeed.",
            "Irrelevant. I like your username.",
            "Well he certainly showed his true colours. Although it's horrendous that he was physically violent with you, it's better to know how he behaves now rather than after you're married and own a house together or something. Just be warned, he might try to apologise and ask you to take him back - don't even entertain the thought.",
            "Well...that's not the plot twist I was expecting. Geez, glad you're ok!",
            "I'm so sorry this happened to you. Stay safe x",
            "Wow, this is scary. So happy for you that you're getting out and away from this guy. Hoping for good things for you in the future!",
            "Holy shit! I wasn't expecting that dramatic of a reaction. That sucks that he hurt you, but I'm really proud of you for not hesitating to cut that asshole out of your life!",
            "It did sound extremely off from your initial post. It gave me all the bad vibes.\n\nDon't cut contact with your ex bf from years back, and don't let anyone try to cut your contact. I'd be uncomfortable if you were actually seeing each other but it's texts and you thought through what the abuser said, even thought it turned out he didn't deserve anything done for him.",
            "Wow, I hadn't seen your original but I went back and read it and **woah,** while he was being weird and controlling and jealous, you hadn't said anything that would have make me think that he'd physically attack you. I'm so sorry this happened to you but also glad that it happened earlier when it's easier to get our of a relationship as opposed to later when you two may have been living together. I'm also **SO** happy to hear that you know that it was 100% not your fault and that he is 100% to blame here. I am also so happy that you are willing to cooperate with the investigation and prosecution of this abuser, you are amazing!\n\nAnd an unrelated side note, I was surprised about people commenting that exchanging 50-100 texts a day is too high. Maybe it's different for my husband and I because we use the chat feature in gmail (computer web browser and phone app - it's our only method of written communication, we do not use the standard text feature) so because of that we probably exchange way more \"texts\" than that a day. We both have office jobs and basically have the chat box open all day on our work computers. We do actually get work done, but when you're having a back-and-forth conversation with someone (or let's be honest, sending each other memes) they quickly add up. I've never counted, though.",
            "Im so glad you are pressing charges. He needs to have a record.\n\n&#x200B;\n\nBut meanwhile, please tell everyone of your friends and your family what he did to you. Tell them all - tell it loud. Tell everyone that you are getting a restraining order but that those can be violated, and that to never tell Mark anything about you if he ever aproaches them. You need a support system, also during the trial. You need to be strong, which you seem to be, but also need to present as too strong and protected to fuck with.\n\n&#x200B;\n\nAnd give your neighbour a cake. Seriously. Or a card or something. He or she may have saved your life. Tell him or her that you are pressing charges and getting a restraining order. I think they would be glad to know they did a good thing and reacted to something substantial and real. A lot of people hesitate to get involved, and sometimes its because they dont know if its serious enough or warrants police. Its good if your neighbour is also aware of your restraining order when the times comes.",
            "Damn you had me in the first half. Totally thought this was going to have a happy ending.",
            "It might not be a fairytale ending but you know what? You don't have that horrible, nasty, abusive asshole in your life anymore. Life can get so much better from here. You can be with someone who loves you and of your friends. That is a happy ending.",
            "I honestly don't understand how anyone could react so violently. You didn't insult him, condescend him, talk down to him, or anything. He clearly has issues and I'm glad that he will be locked up for at least a while. Maybe the judge will issue the maximum sentence. At least you wont have to deal with him anymore.\n\nSorry it ended so violently for you. Doesn't sound like you were really dating a man rather a manchild. Hope you find someone better for you!",
            "I am utterly horrified that he would respond this way x.x",
            "Mark seemed off from the last post that I just read now. Good that you cut him off your life.  \nIf I was him, I admit I wouldn’t feel comfortable with the frequency of your contact with your ex. But I would never tell you to cut off a person you loved from your life. That’s for you to decide. We can’t just “unlove” people, even if we don’t love someone romantically anymore... Human’s still have some bias towards their ex.",
            "Holy shit! Well that escalated quickly!\nFuck him. Glad you’re ok- you handled the situation perfectly which makes the reaction all the more shocking",
            "I’m so sorry you went through this. You sound like an incredibly emotionally healthy and mature person, that is something you should be proud of. I’m so happy you got out and are doing well :)",
            "OMFG i remember this weirdo 26 year old.. turned out he's a fkkn legit psychopath!? Destroy that fool in court, and talk with a good therapist pleassee",
            "You sound like a balanced and mature woman. I’m sorry he came into your life. Remember you are the woman who came into this rationally. Good luck in your proceedings",
            "I'm so happy for you ☆ but I'm so sorry for the abuse ;;;;\nHope your better! ☆",
            "Holy fuck. I'm glad you're away from him and hope you're okay. If you ever need to talk to someone who has been in a similar situation, feel free to pm me. The silver lining is that this happened now rather than down the road. after you'd become even more invested...Those red flags were real.",
            "Good for you!!! Guys who are abusive to women need to have their ass beat. Hopefully he'll get that treatment in jail.",
            "Wow, glad you got out of that situation and that you're (mostly) okay!",
            "I am so glad you got away with only a busted lip and black eye. I'm sorry this POS did this to you, but he showed his true colors early on and you are able to get away. \n\nPress charges and do your best to make sure he gets punished for his shittiness, you could very well be saving another woman later down the road depending on what he gets charged with. \n\nStay safe",
            "oh wow that was not what I was expecting to happen. I am glad you are ok and got rid of that psycho! Please inform your friends that know him about this so that other women will be safe around this thing.",
            "Holy hell - that is a crazy flip and I’m so sorry you had to endure that treatment. Glad to hear you’re in the mend and have the resolve to make sure he doesn’t do this to anyone else! It’s a godsend that the neighbor heard and quickly acted!",
            "Wow, bullet dodged. I mean you got grazed but this could have been a lot worse given time..",
            "Any guy who lays his hands on a woman should be castrated. I never understand how someone could get to that point, I have sisters and if they ever mentioned they were hurt, the guy would be missing the next day...",
            "Thank god you got away from him! I'm so sorry you went through this but at least he is out of your life now.",
            "Jesus Christ that's terrifying, I'm so glad you're safe! Holy fuck. \n\nI know you're safe w/ a classmate and got out relatively early and are doing ok, but if you ever feel like you need to talk with a professional about this there's no expiration date on that sort of thing.",
            "Well that escalated quickly. Good to hear you got away from that mostly ok.",
            "Your ex might be a future mass shooter.",
            "Wow. The guy was crazier than I originally thought.",
            "I read (and responded to) your first post a month ago and have been eagerly waiting for this update.\n\nI disagree with \"there wasn't a happy ending\". It saddens me that you had to go through all of this and that it got this bad, but at the same time it IS a happy ending because you're out, and you'll heal and you'll be the best person you can be. Good luck!\n\nSide note: #relationshipgoals when your fiancé links you both the post and the update without ever having discussed it before, because he thought I'd find it as interesting as he did.",
            "WoW. Glad you're okay!",
            "Had commented on your original post when you made it and was literally just thinking about your post and if there was an update. I was not expecting this I hope you are doing ok and I’m so impressed with how you are taking the positive from his awfulness. Go you and I’m happy you are out of that relationship and safe!",
            "I am so, so glad that you are pressing charges. I really hope you get better.\n\nBtw, I know you aren't allowed to post another update on here, but is there any chance you can make an update post on your profile once the charges are resolved?  I'd really like to know that this guy got his just deserts.",
            "Jesus christ - I was not expecting that update. As a dude, I can sympathize about insecurities when a woman is in constant communication with her ex. That said... He is nuts, please send him to prison.",
            "When I read the first post about this I was instantly worried over your safety and well being as someone who has been through that song and dance I know that shit escalates QUICKLY. I am glad that you are out of that situation and safe now. <3 Much love and virtual hugs sent your way.",
            "Well that does explain unlove, Don't it.",
            "I know I'm 5 days late to this but holy shit, what a psycho. \n\nGlad your neighbor had your back. Hope you stay safe, this dude is downright deluded.",
            "Ugh. I was of the opinion that you exchanging 10 texts a week with your ex that you'd known for longer than not was not unreasonable.  I was super scared for you after reading the first part but am glad you are safe now. The comments from people that said your communication with Eli was unreasonable (in a aggressive way that's beyond simply stating they felt it was unreasonable) make me worry about their potential significant others.",
            "[deleted]",
            ">I basically told him that I want him to approach issues in a more rational way and I would appreciate if he opened a dialogue rather than just telling me what to do, and that I wouldn't put up with him trying to \"command\" me to do something (especially something so ridiculous).\n\nI really appreciate your perspective on this. I'm the one who's been communicating my needs to my boyfriend but not really having them met, and I'm also aware that he doesn't like being told what to do but have had trouble with being effective about that.\n\nI've tried to communicate my needs by telling him what they are, but my engineering mindset immediately problem solves and gives him  tangible examples of how to fix it, and I thought that was okay because it genuinely felt like we were problem-solving together, and I was just more prepared. I never realized the perspective that he had--I'm going to assume, the one that you had--until you were able to verbalize it (he has trouble accessing his emotions), so thank you so much for sharing this.",
            "Only read the end, if he got physical with you at all you need to find a way to end it safely. Doesn’t really matter what the circumstances are beyond that",
            "How did u live like this 6 Months and non of the red flags in ur head be like (BEEP. BEEEP, he is  Sycho) also I wish ur in a better situation",
            "I'm a believer of the no-contact with exes while in relationships due to the exes at some point or another revealing \"lingering feelings( lonely bullshit)\" but this was something else. Glad you got out alive. Take time and hopefully you never experience this again.",
            "Omg that's wild ! The guy threw things at you and jammed you against the wall for just calmly telling him a simple boundary!!! I'm so thankful that your neighbor called the police and that he was arrested. Please stay careful and hopefully in a few years he is a bad memory",
            "Wow. Holy shit. People are fucking insane. Im sorry that happened to you.",
            "Omg. I'm glad you're okay now. Be careful next time. No one deserves a relationship like that.",
            "Good job letting him go, he clearly wasn’t the man for you. Just remember it as an unlucky experience. Hope you find the man of your dreams.",
            "Holy poop! Glad you're ok!!",
            "This makes a good story but sorry you got hurt.  You're a survivor and you'll always be able to look back on this and know that you approached this like an adult.  Nice job.  Better luck in the future.",
            "This asshole did you huge favor in addition to assault.   You found out early what a prick he really is. He’s a coward.",
            "Okay I always enjoy updates because I get invested ya know? It’s like the next episode of my favorite show that picks up where we left off . NEVER in my life have I seen such a drastically different update!!!! It’s like I was watching General Hospital and they decided to replace one of the characters with THE HULK. That was such an unexpected turn. So glad that he showed his true colors before anything got even more serious. So sad that it resulted in you getting injured; definitely hope he gets prosecuted to the fullest extent of the law.",
            "Now to really make Mark give up on life you should get back together with Eli!\n\n^_^",
            "It’s really strange that this happened 6 months in. I’m not questioning you, it just is. I think it might be because the two of you are young(er). I’m a 29F dating a 37M for the past 6 months, and being older we’ve both been around the block (actually both had 7 year relationships, he had additional 4 year and 3 year ones on top) and we discussed exes and our past romances, what we’ve learned, how we felt, pretty quick. I mean, it was hesitant at first because nobody wants to hear the person they’ve been dating for 2-3 months wax on and on about some great past romance, but by 4-5 months in when we were official we’d discussed our past relationships at length. Talked about how they changed us, what things we loved and hated about the other person. What the dealbreakers were that lead to the end.\n\nMark is not an adult, he’s an angry shitty little child. Adults can talk about these things. Can understand that just because you didn’t piss on your ex’s pillow and incinerate their shit (hyperbole, but you know what I mean: because you don’t despise them and even *gasp* still hold some forms of fondness and love for them) doesn’t mean that you aren’t COMPLETELY 100% POSITIVE that it is OVER romantically between the two of you. I think of my ex as an annoying family member, like a cousin or something. \n\nI’m so happy for you that you got out. I hope you have better luck next time, seriously. I hope you’re taking care of yourself because I’m sure you’re really shaken up. If my bf suddenly attacked me physically after this past 6 months it would fuck me up for a long time.",
            "Although I would never be cool with my SO having such frequent contact with their ex, I also wouldn’t physically attack them over it. I’m glad you got out without experiencing some irreparable damage OP and good luck",
            ">Overall, it was a horrible incident but I’m glad this happened earlier in the relationship rather than later\n\nI think it was a pretty good ending :)\n\nEdit: To show the silver lining",
            "Gatsby ? Is that you ?",
            "I’ve realized now that all of us men secretly want this. We ALL want to feel like you just want to be with us. Of course it’s controlling. It’s out mate strategy. And a good woman should be loyal and respect his preferences and vice versa.",
            "What Mark did was wrong. But I feel keeping an ex around and communicating is keeping the door open when its already closed. Thats just me I stay away from those girls.",
            "[removed]",
            "bets how fast you called Eli....you clearly are not over your ex. Mark was wrong but you were wrong from the very start.",
            "No offense to you, but wouldn't you feel the same if he was still in love with his ex-girlfriends? Or do I maybe listen to Ellie Goulding and Taylor Swift too much?",
            "It’s bogus what mark did.\n\nPersonally I would never let my girlfriend be friends with her ex.\n\nYou share private moments that no one else knows about  with each other , why should it be ok for you two to keep talking?",
            "[removed]"
        ]
    },
    {
        "post_id": "a54mgo",
        "author": "throwaway98989609",
        "title": "[UPDATE] My best friend (20M) asked me (20M) out. I said yes. I didn't know it was a date.",
        "url": "https://www.reddit.com/r/relationships/comments/a54mgo/update_my_best_friend_20m_asked_me_20m_out_i_said/",
        "score": 9410,
        "num_comments": 155,
        "created_utc": 1544512485.0,
        "selftext": "The original post: https://www.reddit.com/r/relationships/comments/9du198/my_best_friend_20m_asked_me_20m_out_i_said_yes_i/\n\nFirst of all, I wanted to thank people for responding. I was majorly panicking when I wrote the post, and the comments I got helped a ton to get me to relax before talking to Noah. I wasn't expecting such a huge response at the time and I was amazed, but looking back now I can see why it got so much attention. It was a pretty weird situation.\n\nNext, I want to say we are both men (apparently this makes a big difference for some people in terms of advice). Some of the people who assumed I was a woman also made some weird comments and sent me some pretty gross messages. If you did this, please stop. That's not cool.\n\nI gave a bit of an update as an edit to the original post, but now since it's been 3 months I thought I'd give you all an update about how things have been going since then, since it seems like there's been a bit of interest, and I'm still really thankful to all of you for helping me out.\n\nNoah is doing really well. I could tell he was still a bit embarrassed for the first couple weeks, but after that he told me again that he was still happy he asked me because now he knew how I felt and he could get over it. He also thanked me for taking it so well, which is definitely thanks to what a lot of you said, so I guess I'm sort of passing his thanks on to you :P\n\nOne of the commenters said I should be careful not to do anything that seemed like flirting with him, so I tried keep that in check (we used to hug a lot, sit really close together, and tell each other flirty jokes, you get the idea, but I toned those all down a lot to give him space and not mess with his feelings). I honestly think I see now why he thought I might be into him, because my relationship with him was very affectionate. It's been a lesson for me on how to be more aware of how other people are interpreting my signals.\n\nAbout a month after he asked me out, he asked me if I wanted to go to a gay bar with him. He made it super clear that it wasn't a date, but he did it in a really sarcastic way, which was a little embarrassing for me but also I think it was good that he could joke about it. So we went to a local gay bar together and we had a really good time. He's a bit introverted, so I played the wingman, and he ended up flirting with this really cute guy and he just seemed really happy.\n\nThat was like two months ago and we've gone to the same bar a couple more times since then. He's been getting a bit more comfortable putting himself out there which is really cool to see, and he's just been more open and happy for the last two months, always smiling and eager to go do stuff. Not sure how it's related but it's a noticeable change from before he asked me out.\n\nI'm doing great too. I'm just really happy that I didn't hurt our relationship and that he's so happy. I also learned some important things from this whole situation about communication and being aware of how I present myself. Important lessons. I actually think I feel more confident now too, since he asked me out. Getting asked out feels good man.\n\nIt sounds kind of weird, but I think it made us closer. We've started talking about relationships more, which isn't something we really talked about before. He's gone on a few dates and he tells me about them, and the most recent guy he went out with he was really excited about, and I think he might be headed for his first serious relationship, which is amazing! That's actually what made me think of this post and decide to give you all an update.\n\nTL;DR: So yeah, our relationship wasn't ruined and I still have my best friend. He's doing really well and I love seeing him so happy.\n\nThanks again for the help!",
        "permalink": "/r/relationships/comments/a54mgo/update_my_best_friend_20m_asked_me_20m_out_i_said/",
        "comments": [
            "If you’d like to share those messages you received, you can pass them along so that I can take care of it for you. ",
            "That's great news. I remember your original post so it is good to get an update. \n\nAnd thank you for calling out the idiots who thought they would send gross messages to a woman. You didn't have to mention that in your update, but it is cool that you did.",
            "What a lovely happy update - and I had to go back and check your ages because the maturity and self awareness you have both shown is pretty impressive. Big smile from this mom 🙂 Happy holidays!",
            "This is so wholesome. Thanks for the lift!\n\nGlad both you and your friend are happy.",
            "You two are precious darlings and such an amazing example of how to handle rejection and move forward. It sounds like he was “waiting” for you but once he finally realized it wasn’t happening, he was able to readjust his perspective. It’s wonderful to hear how healthy your friendship is and how supportive you both are of each other. Good personal growth! Thank you for updating us!",
            "> Some of the people who assumed I was a woman also made some weird comments and sent me some pretty gross messages. If you did this, please stop. That's not cool.\n\nPlease report those people.",
            "I love this update. Had a similar experience with my best friend who is also gay. Dude is like a brother to me and our relationship definitely evolved as we went out to gay bars to help him find someone, talked more openly about our dating experiences, and were able to give each other advice on how to proceed with our respective relationships. ",
            "You are both awesomely mature for 20 year olds! Great job OP and happy friendships",
            "I remember reading the original. I love this so much.",
            "You genuinely sound like the best friend a person could hope for.",
            "Dude asked me out once. I thought about it. Decided since I’d never considered it before there was just no way I was gay or even bi. I told him so. His reaction: “wait...you thought about it?”  I said well yeah why not? We became roommates and really good friends... till we graduated and drifted apart. It was a really great friendship. I’ve always hated stereotypically male interactions and the space that friendship gave me to be myself helped me grow into the person I am now. Super gay! Just kidding. Still straight. He would still hit on me occasionally but he wasn’t secretly into me. He was just being a guy. It gives some perspective if I’m honest.  ",
            "> Some of the people who assumed I was a woman also made some weird comments and sent me some pretty gross messages. If you did this, please stop. \n\nLol the internet never changes even when something is as wholesome as this.\n\nGlad you guys could work it out, it sounds like you have a friendship built to last a lifetime.",
            "I didn't see the original but this update made me so happy. You seem like a real sweetheart. If I were 20 and single I'd ask you out too! ",
            "Sorry to hear about the a-holes on reddit giving you a hard time, glad things worked out for you though",
            "This is awesome. I have met so many heterosexual people who would brutalize another man if they even thought about asking them out. You can tell the world is changing when a homosexual can actually ask someone out without that fear. You are very beneficial to this society and I applaud your acceptance. Not just tolerance, but acceptance. ",
            "\" Some of the people who assumed I was a woman also made some weird  comments and sent me some pretty gross messages. If you did this, please  stop. That's not cool. \"\n\n&#x200B;\n\nlike what? (im not asking for names, or proof, im just curious what people said)",
            "This story was beautiful, honestly. Shows that if it's really wanted, any kind of relationship can endure even if both sides have different desires.\n\nFrom a non-professional psyhcological point of view, I would guess Noah became more open because he learned with you that expressing and showing true feelings can't end it all if it's correctly talked afterwards. Even though it was a sad experience from his eyes, he learned something that'll be useful for the rest of his life.\n\nI can't give medals, but if I could, I put give an \"Inspirational\" medal, a \"Power to Overcome Fears\" medal, and a \"Yay for Good and Healthy Relationships\" medal.",
            "This was super cute! Im so happy the friendship wasnt ruined. Good job! ",
            "This is the perfect dose of wholesome I needed to get me through work! So glad your friendship has grown from this & wishing you both the best! ",
            "Man! What an amazing fella you are. I can see why Noah would have feels for ya. You're the kind of understanding friend all us crushing young gay guys would have loved to have had. Thanks for sharing this amazing experience with us all. ",
            "Op I feel for ya. My best mate is gay and currently has the biggest crush on a straight man. They hang out and are very good friends, and whilst my mate wants more than that he knows he can step back and turn off his feelings to save the friendship. He eventually told the guy and he didn’t reciprocate at all,  but took it really well and responded so kindly. It is possible to maintain this best friendship, I know for a fact because my mate only wants the best for the other guy and knows he wants him in his life as a friend and will not do anything to make the friend uncomfortable moving forward. ",
            "I'm so happy to see this update! You sounded genuinely worried about losing your friendship, so I'm glad to see that you were able to make it work. It sounds like it's been good for your friend, too. \n\nYou're both good eggs. ",
            "\"It's been a lesson for me on how to be more aware of how other people are interpreting my signals.\"\n\nManaging perception is crucial for increasing the probability of achieving desired outcomes.  You're doing well with your reflections!",
            "You really are a great friend. Such a fantastic update! ",
            "Yay another happy positive update, glad you guys worked it out and came through it better",
            "I remember your original post - I’m so glad that it worked out well. Also, I’m real impressed by how you two handled this. Really mature, and A+ communication. Keep being awesome!",
            "HOORAY! OP, it sounds like both of you have handled this in as mature a way as possible. The fact that you’ve been so supportive as your friend comes out will mean the world to him.",
            "This is so sweet!!!! I'm very happy for the both of you 💜",
            "I am very happy for you and your friend!",
            "I read your original post, I'm really glad how it worked out for you two :)",
            "This is the best thing I've read on the internet in a while.",
            "I'm sooooo happy everything worked out for you and your friend, OP! I remember reading your original post and could just sense how scared you were to lose your pal. You both sound wonderful and very luck to have each other as friends. I wish you both the very, very best!! ",
            "Y'all handled that really well. Good on you mate! I wish you happiness and joy.",
            "Awwww! What a great outcome. ",
            "I'm so thrilled for you, OP. I didn't catch your post the first time around, but I caught up and even if I'm checking in late, I'm glad it turned out as it did. Best of luck to you and your friend!",
            "open and healthy communication like this is actually my biggest kink ",
            "this is so wholesome. thanks i love it",
            "This update made me smile. Good luck to both of you guys finding the guy(or girl) you're both looking for. \n\nI love seeing happy updates",
            "You sound like an amazing friend and great person. I'm glad things worked out so well for both of you! ",
            "This is so damn cute. I love this post. ",
            "The way you handled this situation is a good approach to life in general - we can't necessarily control the situations we will find ourselves and there will be many that are adverse or at least uncomfortable. But usually, we can imagine and come up and execute a response that turns a negative situation into a positive one.... ",
            "Solid friendships like this are hard to come by, and you should be proud of yourself for being a good pal. More than that, you’re both lucky to have each other! Hope you both have lots of loving relationships in your future.",
            "Best thread I've run into yet, kudos on being a great set of human beings. 😊😊",
            "You are awesome. He sounds awesome. Congrats to you both on being good fucking people and putting a healthy relationship first. ",
            "This is beautiful. You’ve made my day a little more positive. I’m glad you guys are still friends and that he still has you for support. What a great update. Good job to both of you! ",
            "I think he's \"happier\" now than before, because his crush wasn't out in the open and he had to hide it from you. As you wrote, he wanted to move on and I think that you gave him the opportunity to do just that. It's a big weight off of his shoulders.",
            "You are an awesome and super supportive dude. Things like this really define a person’s character. I think a lot of guys would’ve tried to salvage the friendship but things would’ve remained awkward or they’d be this pressure to “pretend it never happened”. You acknowleged it did AND you took it a step further to support and empower your friend. This update makes me very happy. :) ",
            "You’re both good dudes. Glad everyone is happy and living well.   ",
            "Reddit for the win, bro!",
            "I’m super happy for the both of you and really appreciative of the fact that you went out of your way to update us all a good 3 months later! That’s really awesome of you. I also want to say that you’ve got a very kind, warm and inviting spirit. You’re aware of how your actions might and can affect others especially your best friend and that’s a wonderful trait to have. \n\nThat being said, I think it’s so easy to joke with friends on a level that outsiders may see as flirting. And it’s also very easy to not realize that you’re doing it. A year after I graduated high school, a new kid in town that started attending the same school who was also a year younger than me had confessed to me that he had a crush on me. However, I felt the same way you feel for Noah. He was one of those rare people who you meet and after 5 minutes of getting to know them, you feel like you’ve known each other since you were babies. \n\nHe was a very infectious person to be around and he still is to this day and we’re in our very early 30’s now. But he confessed to me and I also had to tell him that as much as I love him, it’s just not that type of love and I value him so much, I didn’t want to lose him over that. I’m so happy that we’re still great friends after all this time. I last saw him on Thanksgiving day and it felt like being kids all over again. Gave him a huge hug, asked about his family and how they’re doing and vice versa and we said our I love you’s and went on to go see our families. I love that it’s not weird or worse that I can’t even speak to him. I know how you feel and it’s a great feeling. I’m so happy for you both. ",
            "That is a beautiful story of friendship and I hope you two remain close friends for the rest of your lives. ",
            "This is so great! I love when people can keep a friendship or even build it stronger after an awkward situation. I’m glad you’re supporting each other!",
            "Thanks so much for posting a follow up. You seem like an awesome wingman and friend.",
            "You seem like a real sweetie and I'm very pleased for both of you.",
            "Wow you're a guy! Not like it changes anything but I remember your post from 3 months ago or sonething and this entire time you were in my mind as a women and it's so mindfucky to suddenly have to rewrite everything even though it doesn't really change anything. Glad it all worked out!",
            "I remember your post, and the update there, and I'm really happy that things are going well and that your friend is making strides with his sexual identity. You both entered a really vulnerable place and seem to have come out closer and stronger :)",
            "This is so wholesome",
            "I love this update! You’re such a good friend! I’m genuinely curious what the creepers of reddit said when they thought you were female ",
            "Aw this is so heartwarming, you sound like an awesome friend!",
            "Thanks for the update!!",
            "We should all be so lucky to have a friend like you! ",
            "This is all such great news!!!",
            "You're a good dude, OP.",
            "Ngl this was really helpful, in that im in a similar situation as to what noah was in",
            "You handled this with such maturity, care, and grace.  It makes me happy.  So happy it worked out!",
            "Glad to hear your friendship is doing so well. Sharing secrets and being open sounds like it has deepened your friendship ",
            "You are the luckiest...",
            "Great update, better friendship! 💚",
            "You are a true bro.  And you're both lucky to have a genuinely good friend.",
            "Wish I had told my best friend no. He (18M) asked me (18F) to stay over one night and i agreed because it was super normal for us. We made out that night and then dated for nearly 6 months, moved in together. He dumped me for the one ex I never met (I was abroad while they dated), and she also hated me for some reason. She’s 21. Now I’m 20, he’s 19 and haven’t talked in about 4 months. I’m assuming she doesn’t let him talk to me because I’ve tried texting him like 5 times, of course friendly and nothing romantic because he certainly was my best friend ever... but never got a response so I’ve pretty much given up on that. \n\n\nI even still talk to his mom sometimes, nothing weird though, we had been friends for about 4 years before all this went down and she’s still really kind to me. But yeah. ",
            "I’m glad everything worked out! Something similar happened to me with a friend when I was about 17 or 18, only it did strain our relationship because he kissed me and I didn’t realize he had romantic intentions for our outing since we were good friends. Haven’t seen or talked to him since as a result but it’s probably for the best. Glad to see it does work out for others though. ",
            "I remember that post and I'm so happy to read this update. Good on ya both!",
            "Damn, that made my day. 🧡",
            "I’m glad to hear that it all worked out! I didn’t catch the original post, but I’m happy for you all the same.",
            "Great update, OP. I'm happy for both you and your friend and that the friendship is intact. ",
            "This is so nice I'm happy you guys are still all good ",
            "I think a lot of the time when you're queer and introverted it's easy to start crushing on your same-sex friends because you're building close connections with them while simultaneously not finding yourself in situations where you can meet new people who are *also* queer that you could potentially date. I'm glad he's having an easier time putting himself out there, and it's awesome to hear that this has made you guys closer. ",
            "This made me so happy, I remember your first post. I’m so glad everything worked out so wonderfully! ",
            "Thats so cute. I'm sure he feels great that there is a friend that fully supports him.",
            "This is the best update we could've received. Thank you so much for sharing. Hoping for happiness for the both of you (seperately)! ❤️ ",
            "This is one of the best updates I’ve read here all my years looking at this subreddit. You both sound like wonderful people! ",
            "This is the most wonderful update. Both of you should honestly be so proud of yourselves. It's so nice to hear when things work out so well, thank you for updating us!  :)",
            "This is a really nice update. It makes sense that he’s putting himself out there and making an effort to meet guys. Since he had a long term crush on you, that was probably holding him back from exploring other options. It’s sounds like he’s a great buddy and you handled this really well. ",
            "Aw thanks for the update! I remember seeing the original post and I'm glad things are good for you both :)",
            "You both sound like awesome, healthy, good people! You handled something awkward really well. The good advice only helps of you actually put it into action. (I say that as someone who loves to give advice, haha!)\n\nYou deserve each other for best friends! Good luck to you both.",
            "I wish all 20-year-old men were as mature and caring as you have been",
            "LMAO happens all the time.",
            "Important question: are you gay too? I didnt see it in either post and you mentioned \"when he came out\" and I am genuinely curious.",
            "[removed]",
            "[UPDATE-UDATE-UPDATE-UPDATE] My best friend (20M) asked me (20M) out. I said yes. I didn't know it was a date. \n\nCURRENT STATUS: WE ARE DATING.\n"
        ]
    },
    {
        "post_id": "b08jsj",
        "author": "throwitaway462649261",
        "title": "(Update) How do I (28f) break up with someone when I’m their (31m) everything?",
        "url": "https://www.reddit.com/r/relationships/comments/b08jsj/update_how_do_i_28f_break_up_with_someone_when_im/",
        "score": 9180,
        "num_comments": 436,
        "created_utc": 1552401773.0,
        "selftext": "[Link to original post. ](https://www.reddit.com/r/relationships/comments/aab0wm/how_do_i_28f_break_up_with_someone_when_im_their/?utm_source=share&utm_medium=ios_app)\n\nStraight to it: I broke up with him a day after I made my original post a few months ago. I was emboldened by the support and, strangely enough, even some of the negative comments. I came home from work and blurted it out, straight and to the point. I told him that I wasn’t happy, I hadn’t been for a while, and that we would be separating. We agreed that he could stay in the extra bedroom for a few months while we got everything sorted but when the lease was up we would be going our separate ways. \n\nThe last few months have been hard. He went into full blown panic mode, promised to change in the ways I had waited years for, and had several actual melt downs begging me to stay. It was painful, but my resolve to live my own life never wavered. \n\nI just signed a new lease (by myself) and have begun to casually date someone in the same field as me. Life has an excitement to it that I haven’t felt in years, it’s like I’ve taken my first deep breath in a long time. \n\nSo, if you’re on the fence about leaving someone but your lives are so enmeshed that you don’t see how it is possible: put yourself first, there is always a way out. Thank you! \n\nTLDR: I broke up with my codependent boyfriend and am the happiest I have been in years. ",
        "permalink": "/r/relationships/comments/b08jsj/update_how_do_i_28f_break_up_with_someone_when_im/",
        "comments": [
            "Amen.\n\nLeases, shared bills, mutual enjoyment of GOTs or Survivor while everything else is terrible is no reason to stay together.\n\nI’ve told my sons. Keep an emergency fund that you NEVER touch. Don’t bail on relationships, but NEVER stay in a relationship because you don’t have first months/last months rent and security deposit. \n\nEDIT - thanks for the gold!! Just trying to share some hard-earned wisdom. ",
            "This is so relatable to me. I broke up with my boyfriend of 8 years and while it was very hard to do, I feel so much better living on my own and working on figuring out who I am as an individual. I spent so long putting him and others first that I forgot to put myself first. It’s tough, but sometimes the hardest things are the right things to do. Best of luck to you!",
            "Great update, all the best for the future! ",
            "I did this several years ago and have been single since. She is married to the guy she moved in three days after I left. I feel stuck in a rut, kinda killed my self esteem that she moved on so quickly. ",
            "I needed to hear this. I still don't have your strength but I need to hear this and I need to find it in me too.\n\nI am not surprised to hear (as you share in a comment) that your now ex boyfriend, despite his promises, did not follow through.\n\nCongratulations on your success and I hope that you have a happy future. \n\n&#x200B;",
            "The best thing my ex did for me was to break up with me.  I was codependent, and severely depressed.  It made me get help and now I’m in a healthy relationship with both myself and my spouse. ",
            "This was horrible to read as it reminded me about my ex doing the same thing. A real gut punch yet it was the best thing that happened to me when she left me and I had to make other things my everything. ",
            "That’s great! Be careful about jumping into anything long term right away. Take care of yourself ❤️",
            "[deleted]",
            "Good job, glad you stayed strong and didn't fall for the fake 'promises' of change. You done good.",
            "Reading your original post and the comments on it actually helped me get the resolve to end things with my ex. Thank you for that—and I’m glad to hear you are so much happier!! :)",
            "This perception vs reality (tm 500 Days of Summer) stuff kills people.\n\nWe cannot live complete lies, it just doesn't work emotionally.\n\nAnd anybody of any age is allowed to end a romantic relationship they are not feeling.\n\nNo-one is owed a romantic relationship.",
            "[removed]",
            "Completely agree. Life’s too short to spend it with someone who makes you unhappy ",
            "Fantastic news, I'm happy for you. He'll pick himself up too, it's for the greater good.",
            "I was at the receiving end of this. Not too long ago. Similar story at least she wasn't staying with me.\n\nAnyways she wanted us to work out and it wasn't planning out.she wanted this relationship for a long time and realised after a decade being in love with (we officially dated only 4 years) that we wouldn't work together. I took a long time to understand that what we had was good.\n\nAnd by the end of it I knew no other way to exist. \n\nShe took a hard decision. I still am mad at myself for it and not one moment I hate her for it. I've moved on, moved cities, sorting my financial stability. \n\nOP you did the right thing. The onus is on him to be a better version of himself.",
            "Im glad lifes on an up now. \n\nMy gf depends on me and im not sure if i wqnt to stay.\nSince I've been with her i hardly have friends if any and dont want to go back to beig lonely everyday.\n\nWhat advice would you give please?",
            "OP I’m so happy you got out of that awful situation and are moving on. Don’t listen to the rabble who are trying to imply you did something wrong by not putting your life on hold for your old relationship any longer. Sometimes relationships are over for a long time before they actually end and I’m glad you’re living your best life. ",
            "What about being on the other side of the story? I’m in a similar situation, being the ‘weak’ spot. We both developed a lot the last years, together and alone. Until my cancer came back and i needed surgery and was sick and recovering for the past 6 months. He continued his life in the meantime, and developed a lot. While i was ‘just’ recovering. Now i’m the ‘codependent’ one, as in i need him more than he needs me. Should i break up with him to allow him to move on with his life? I feel like i’m a burden but he’s staying with me anyway because he loves me deeply. But just love isn’t enough.",
            "I'm in this situation right now but I don't know if I can do it. I feel like the leech because he makes the most money, but also I'm the only one thinking about the future. I don't know, it's so complicated and I wonder if I'd ever have the strength to do what you've done.",
            "I just did the same and it is so liberating. I (23M) was with a guy (33 M) and we dated for about 9 months. He didn’t have a job when I met him, he claimed it was bc he just moved back from Florida. I came to find out, he didn’t just move back from Florida, and he had been back for almost a year. He always insisted he was going to get a job, and it never happened. He was clingy, insecure, and always accused me of being about to leave him, which strangely enough PREVENTED me from leaving him because I didn’t want to prove him right. Finally, I just had enough after he had berated me for about 2 hours straight. I told him I was done (via text, I’m not proud, but it was necessary) and haven’t texted him since. This was maybe a month ago (the day that season 33 of The Challenge on MTV started) and he has been blowing up my phone from different numbers ever since, has spent the night in my driveway (which he did a couple times when we were dating, just to spy on me) but I still feel free. Best decision I ever made, although I was scared at first because he always threatened to hurt himself if I left him. Good job, OP!! It’s hard, but SO rewarding!",
            "Are you me? I was in this exact same situation last year, though additionally complicated by medical issues and him being from out of state. I finally got up the courage to break it off about 7 months ago. I always thought I was happy in that relationship, but now that I know what happy actually feels like, I know it was just complacency. Enjoy your happiness and never settle!",
            "My ex-wife would know 😔",
            "Good for you. I've been through a very similar situation myself recently - my (now) ex-girlfriend doesn't get on with her own family, doesn't have that many friends, and said so often that she wouldn't know what to do without me. Gradually, I fell out of love with her and I think part of that was that I spent so much of my time worrying about her or focusing on her problems that I could never really take the time to look after myself.\n\nWe're also currently having to live together until the lease runs out and it is tough and awkward, but I know that in 6 months-1 year's time, things will have worked out for the best.",
            "If there’s one thing I’ve learned through my failed relationships it’s that codependency is, more often than not, going to lead to an unhappy relationship and ending. People need their own lives in order to be happy, and sharing their lives with someone makes the relationship more exciting, as you can show each other new things and places, as well as continue to enjoy those things separately. \n\nBeing “one” entity and losing identity is a really unhealthy thing to do, especially in a society that thrives off of personal identity.",
            "I remember this post! I'm so happy for you, OP. Enjoy your newfound freedom and live your life. :) ",
            "I needed to hear this and read these comments. I just broke up with my boyfriend of four years because I felt unhappy and we were just kinda stuck. I haven’t regretted it so far but it is really hard losing someone who’s been in your life for so long.",
            "Kinda going thru a similar situation... It's TOUGH. Especially when the one supposedly being 'blindsided' claims they've never seen the problems :/ I keep telling him I need to get MY oxygen mask on securely before I can even THINK about trying to save him, or anyone else. Thank you for your inspiration, I know that I will be ok one day as well 😊❤️",
            "Just read through some of the old comments. People are jerks!\n\nPeople that accuse you of being narcissistic for describing how codependent he was? .......why? Why do that? Seriously, talk about insult to injury. Hey we see you're struggling to take action, now take this hit to your self esteem, that oughta do it. So if they aren't helping you, why say it? Because they are projecting themselves into the situation, and defending themselves unnecessarily. And they are projecting the abuse. Because that is what abusers do, they see you are about to leave and they belittle you into feeling like you are the problem so you lose motivation to leave.\n\nPeople saying you're definitely not going to leave him. Well, they were wrong and I hope they take this as a lesson in seeing that people actually do get held accountable \n\nGuys saying \"can't believe people just dump people for their own personal gain\"\n\nYes!! Yes we do! Yes you should! A relationship is a partnership, two partners are strong separately but are stronger together than they would be going alone. Though they may struggle at times, they rely on each other when they need support and return the favor, a symbiotic relationship. A relationship where one person puts in all of the work and sustains all of the effort and is held back by the other person and gets little in return is not symbiotic, it's parasitic\n\nIf you don't have a disability or illness, chronic or temporary, and just aren't putting in the work to be your own person, it's not anyone's job to make you do it. It's your responsibility. I say this as someone with a disability, I put in a heroic amount of effort to be a good partner in the ways that I can be, because my disability makes it a challenge in many areas. It's exhausting at times and my partner doesn't hold it against me because he knows I'm trying. Even with my struggles, I still manage to provide support and a relationship that benefits him more than being single would.\n\nIf there's no self-awareness and no effort being made, it's toxic. The saying is \"in sickness and in health\" not \"in sickness forever, you're my slave now\"",
            "I’ve been on his side of this. It’s tough. But better in the long run.... for him too. ",
            "Congrats! OP, I was in the same boat as you in a way, I was with my ex for almost three years, I had been suffering so much subconsciously about wondering if I wanted to stay with him or not, it was actually affecting my physical well-being. I was just not happy anymore with him, and finally took a leap. It was tough, but sure enough about a week later I felt so free! For people in a situation like this, just understand that it will get better, I am in such a great relationship now that I never would have experienced if I didn't break up with my ex-boyfriend. ",
            "You must’ve moved on long ago to start casually dating after such a long relationship. Probably speaks volumes to just how bad it was with your ex. ",
            "Sounds like it was for the best, I'm glad you two are going your separate ways. Ending up in spots like this is why I've seriously extended my casual dating period before titles/commitments/obligations. I want to see if someone has ambition that matches mine, or if our goals are different that they at least complement one another, before I start getting serious about our future. I can't be carrying people anymore.\n\nAnd the best part is -- people like your boyfriend and my exes don't need you and I pushing them either! If they're happy to stagnate at 21, if that's the life that fulfills them, then I think they should have a partner that agrees and would live that life with them. <3 ",
            "I’m in a similar place myself. I’ve dated my high school sweetheart for 4 years and in that time I feel like I’ve grown so much and I can’t say the same for him. I remember reading your first post months ago when I was still on this fence of leaving or not but seeing this really put a new perspective of life. I wish I could pm you to ask more questions ",
            "Waahh.. reading this post was like looking back in time to my last relationship. Congrats on putting yourself first",
            "I'm so glad to read this. Your comment of \"Life has an excitement to it that I haven’t felt in years\" is familiar to me - a long time ago I remember telling my single friends that while they might be lonely and alone, at least they weren't lonely in a relationship. I was in the same situation you were, and I felt completely trapped. I eventually summoned the courage to break up with him, and the feeling was indescribable. A decade later and I wake up every morning feeling so happy with my life partner, and I'm still glad I made that decision, as hard as it was for me to hurt them at the time.",
            "I’m (27f) struggling with something like this in my life right now. Thanks for sharing!",
            ">So, if you’re on the fence about leaving someone but your lives are so enmeshed that you don’t see how it is possible: put yourself first, there is always a way out.\n\n\nThank you I really needed to read this. I am stuck and my anxiety is spiraling, I want to be able to breathe again",
            "Ugh, this hits hard. My partner of 5 years was working when we met (when I was 20) and quit really soon after- I was a student, got my degree, and now I'm working in my field and doing post-grad. I am so exhausted- making money for 2, doing more of the cleaning... And he keeps saying, for years, that he's going to start looking or going to smoke less weed or going to whatever and it never happens.",
            "Everyone is entitled to be happy. Hope you and him both find what you're looking for.",
            "Thank you for giving me hope. I'm still too scared to take that leap.",
            "Feel free to ignore this if you don't want to answer...\n\nI've always wondered how one goes about unattaching themselves from one another in the age of social media. My husband and I have been together for almost a decade and our relationship started at the beginning of the social media age. I have no thoughts of separating.. Just curiosity. ",
            "I applaud your bravery. It's never that they won't change, it's that they didn't. ",
            "You started dating someone else 2 months after breaking up a 10 year relationship? \n\nI usually dont comment on these but that does not seem healthy.",
            "Good for you for knowing your worth. Also, I'm impressed by how mature and gracious you were in unwinding it. You didn't have to do it that way but you did.",
            "I was in that situation back in college.  And it was exactly like how you described.  It finally feels like you can breathe again and you can look forward to life.  I've never regretted that decision.",
            "I know this is the best for you and stuff but I still can't help but feel sorry for him. :(",
            "I admire you\n\nGood for you!",
            "Oh yeah, they had previously dated and honestly I knew we wouldn’t be together much longer after they got back in touch.",
            "I need to laminate this and hang it up. As a future reminder to myself and others who may need to read this!",
            "I’m 23, in grad school now and interviewing for jobs in a pretty cutting edge, well-paying field. Broke up with a boy about a month ago. He’s 2 years out from his graduation and still lives with his parents and mysteriously can’t seem to land a job in his field, even though he’s qualified and the field is hiring. I was wondering over the weekend if I should give him another chance. This was like a glimpse into my future if I had... I’m gonna save this and reread it every time I start to get sad about the break up. ",
            "I am so, so happy for you (and proud!!). It is such a hard step to make, but as someone who had to walk away from something similar 3 years ago - there has never been a single regret for my decisions. It was hard at first, but nothing can compare to how grateful I am for having found courage in the moment to walk away and not return. Much, much better things are in store for you. I wish you the utmost happiness in your new adventures!! <3",
            "I was in a very similar situation. It got to the point where I couldn't eat or sleep because all I could think about was how I needed to break up with my boyfriend. I eventually just did it, and immediately felt so much better. Of course I felt shitty and very sad, but I knew it had to happen. I had no money saved and was just starting a new job, but that risk was worth it so I didnt feel so sick all the time. ",
            "Wow. This WAS me 10 years ago, it's like reading my own journal. When your lives are completely intertwined with one another's it seems impossible to get out.\nLuckily for me I left that toxic guy but still had to share our apartment for a few months b/c neither of us could afford to move out. He constantly begged or tried to bully me to stay.\nDon't give in.\nAbout a year later I started dating the guy who is now my husband and we just bought a house together.\nIt Gets Better.",
            "Lived with my ex for 3 and 1/2 years and we did everything together. We split bills, got a dog and a cat, we eventually stopped hanging out with our friends more and more. At the end of our 4 years together it was basically just me and him and our families but we didn't see them that much. He was my life and I was his and we only had each other. It wasn't a good relationship towards the end and I thought about breaking it off too many times. What stopped me was the fear of starting over, moving out, not having that help, not having my old friends anymore. I only talked to him and hung out with him so my life was pretty dull and that played a huge part. He decided to move away over 2,000 miles and I was so scared and not ready for it. But he needed to better himself and I understood that. So he left and now I've been opening up more and having more of a social life. I really think we held each other back and I love him and always will but it was definitely better this way. No more fighting over everything and going to sleep pissed off almost every night. He's happy where he is and I'm finally happy and feel like I have my life back. Being codependent was rough and it sucked to start over but I feel 100% better and outta the slump. Anyone who isn't happy and stays because theyre scared should remember, you are you're own person and you need to live your life. Don't worry about the other person as much and put your happiness first! ",
            "I'm two days into a similar split. I'm scared as hell. Scared for myself. Scared for him. Filled with grief over parting ways from my closest companion of five years. I still love him and I know he loves me... but our personal growth was stagnant and, after a year of trying to encourage positive changes, I decided enough was enough. I guess this is what we call tough love... just hoping it's truly for the best <3 Reading this helps, even if just for a little bit... ",
            "Wow. I just ended a similar situation *yesterday* and I was sat here feeling lousy. Thank you for posting this update. I feel the waves of relief and excitement for a new life and I know it is worth it. Thank you. ",
            "10 year relationship, you barely moved out, and already dating someone else. Im out of words.",
            "I was similar to OP's boyfriend.  My ex and I had been together for around 4 years and were best friends for about a year before that when she broke up with me.\n\n&#x200B;\n\nLike OP's boyfriend, my ex was my world. By the end of our relationship I was not in a good place. I had been unemployed for a very long time, I was broke, and quite honestly I had very little motivation to do much at all.  I was totally caught by surprise when it happened. She had given hints to me that I needed to change, or at the very least that  I needed help, but they were never direct.  I'm by no means saying she had an obligation to do so, but it would have been nice for her to have a real discussion with me about her needs from me before she pulled the plug. \n\n&#x200B;\n\nHer breaking up with me was the most painful thing I've ever experienced in my life.  I told her that this was the wake up call that I needed. I told her that I was going to make changes in my life for the better going forward. I told her that I was going to do what I needed to do whether or not she was there with me, but that I really would like it if she could be there with me while I did. She told me that she couldn't give me the answer right then and there. That was the last time I actually had a conversation with her.\n\n&#x200B;\n\nIt's been almost a year since the breakup and I made the changes that I said I would. The first step was getting therapy and medication for my anxiety and depression. Getting my anxiety treated really opened up the world for me. I finally learned how to drive after being terrified of it for over a decade. I conquered my fear of flying on airplanes.  Most importantly, I was finally able to really sit down and work towards getting a job. I contacted my career counselor and got advice from him. I started doing volunteer work to add things to my resume and make connections. Ultimately it worked, and after being unemployed for literally years while we were together, I landed a job in my field within 3 months of the breakup. \n\n&#x200B;\n\nAm I happy that she broke up with me? Certainly not. Frankly, a lot of the happiness as to what I've accomplished gets met with a lot of sadness that I can't share it with her. But it would be disingenuous to say that it didn't push me into getting my life together. \n\n&#x200B;\n\nSo for people in the position OP was in I'd say that breaking up with someone might be what's best for them. I'd just like to add that I really think you should have a very clear, direct conversation about what has been bothering you and what needs to change before you do.",
            "Thanks for the update, I enjoyed this!",
            "Omg!!! Im going through this now. I've been with this man 16 yrs. (Im 37) I devoted my life to him. Our situation maybe a lil different because we have a 13 yr old daughter.  Im just not happy. I recently met someone in August that we fell in love. I never planned on it, that was the furthest from my mind, but it happened.  I dont want to hurt my daughter's father, but i can't continue. I need to be happy.  For once, i need to think of my happiness. My whole life I did to make people happy even tho I've been miserable. I wanna take my life back. ",
            "Congrats and glad you summoned the strength to end it - and share an apartment for a few months. ",
            "Congratulations OP. Your situation reminds me of mine in a lot of ways. I wish you the best of luck in your self-discovery.",
            "Sorry for my unpopular point of view. I understand that you were not happy in your 1 decade long relationship because he was not keeping un the pace with you. But you started dating in the next few months. Were you still living with him when you started dating again? Or were you freshly moved out when you started dating?\n\nBecause it seems to me that you just want validation. You dumped him because he was lazy? He's the bad one and you're the good one for being hard working....hmmm. I think the truth is somewhere in the lines of: you fell out of love with him and wanted a new romantic partner.  \n\nBut that won't bring a successful amount of validation for you.\n\n",
            "Tbh, how do you string someone along for so long and then just end it? I get you need to break up with him at some point, but why wait 10 whole years if he wasnt getting his shit together?",
            "I never understood why people start dating after a relationship ....especially a long one.\n\nOne would think you would take time after the relationship to do things for yourself, work on yourself, grow as an individual and think more about your life and the direction it's going in in general ...before going back into the dating scene.\n\nBut I suppose wondering why people do things would only be a waste of time.",
            "May be it was good for both of you.  I hope he get his ducks in a row soon.  Btw I was wondering after reading your post (original and new)  if any case your boyfriend is border line disorder person. He should check for that.  \nI'm wishing you all the best ",
            "Can confirm, codependent ex became hazardorus to my health. Would not recommend!\n\n&#x200B;\n\nCongrats on getting out and moving on, cheers to freedom!  /drink emoji",
            "Went through this exact situation a couple of years ago with someone I had been living with for 8 years. It was one of the hardest things I have ever done and also pretty terrifying to strike out on my own. But 2 years later I am independent, great full time career, beautiful downtown loft, and I found the love of my life. Everyday is a new experience and I'm making memories I will cherish forever. Sometimes you just have to change and never look back. 🖤 ",
            "Ugh you can't imagine how much I needed to read this today ♥️ Thanks, stranger!",
            "Wait, you broke up and are already dating someone? Why not just actually say that's why you broke actually wanted to break up. Something is off if you were able to date that fast.",
            "I’m not meaning to pick things apart, but you say that you wanted to live your own life - then start dating someone else? Maybe it’s because I’ve been on the other side, but I don’t get that bit. ",
            "Good for you!!! I’ve been there and I know the relief you are feeling!",
            "This makes me happy, congratulations <3 <3",
            "[deleted]",
            "YAAAAS! Good for you! Happy you found the resolve to walk through the discomfort to get what you needed!!!",
            "You just have to do it.  My ex told me I was everything she could ever want in a partner, lover, and life companion.  She could not leave her abusive family though, and didn't believe in my ability that I would make sure we were taken care of.  In the last year I've traveled to Colorado, Minnesota, and Texas.  Each time I made it from the bottom up.  I'm back in my home state ATM, Missouri.  I loved her big time, but she wouldn't part with the one thing holding us back.",
            "You did right by yourself good for you. He’ll figure it out. ",
            "I was the guy that got left behind. I never saw it coming. I tried to give my best. ",
            "I felt like I was reading my own story from about 4 years ago. Realizing that you aren’t their everything is one of the most freeing experiences. I know that we’re both better off and wished I could’ve broken up sooner. You’re right to just be straight up and honest. Kudos to you! And I hope you’re living your best life! ",
            "I have almost the same situation. I was so unsure about making the decision, but now I feel more confident. ",
            "I have a question. Do you think about him positively ever? Now that you've split up and are happier.",
            "You just have to do it.",
            "Amen to this!! I have been separated from my husband for 2 months and it’s the best decision I’ve made. ",
            "One thing to say:\n\nCongratulations!  Now go enjoy the shit out of life.",
            "If you think that you are gonna be hapier, always do it",
            "“I’m everything to them” = I’m a narcissist!! :D",
            "TLDR; If you don't get a Bachelors Degree/go to Trade School, you're just a 21 yr old silly boy.  Lul.",
            "I'm glad you were able to get yourself out of a situation you didnt want to be in, but this story just makes me cringe and triggers so much anxiety..\n\nI feel like this is exactly what's gonna happen to me when I get in a relationship. I'm a 24 year old Male and ugh, I hate what this is making me think of.",
            "Thank you for sharing this, ive just found myself in a similar position, its such a relief to hear somebody coming out of this too, it gave me some direction and perspective which im sure anybody who has been in this situation can agree, can get blurred. Peace and love 💕 ",
            "[removed]",
            "I’m fucking proud of you!! BICHHHHH YOU DID THAT!! We love a queen that loves herself enough to do what’s best for her, instead of bowing down to a mans feelings!! ",
            "[deleted]",
            "[removed]",
            "[removed]",
            "I feel bad for the dude if you’re already dating after a few short months.\n\nSounds to me like you were dishonest for quite a while.\n\nPeoples emotions are not toys to be played with. Instead, like the garbage person you probably are, you lead him on for probably months. Likely because it was inconvenient for you to break up.\n\nKarma will come around to you. \n\nPoor guy deserves better than you anyways. ",
            "Honest question: was the guy you're casually dating the reason you decided to finally leave? I'm just curious. I read the OP; I'd have left too.",
            "Amen girl, good for you. Always ALWAYS put yourself first. Your happiness always matters. :) \n\nNow I wish my SO would do the same and leave me. ",
            "Are you still living with him? If yes, I don't think that's really fair to the person you're dating. I wouldn't be comfortable with it, personally. ",
            "I understand that. I don’t think about her or what she is doing, just the fact I can’t seem to talk to women outside of being friends. I have no trouble interacting with them, it’s the transition to where I actually am attracted to them. I immediately assume I’m not good enough and they won’t like me. Once I feel that, I no longer have the ability to talk to them",
            "I know, but how can i if i dont have any friends at the min?\nIm 24 electrician shes 21.\n\nI find it hard to socialise sometimes aswell but ive been working on it alot this past year.\n\nI live with her also\n\n",
            "[removed]",
            "I didn’t read the first post and not saying this bout you. Sometimes you gotta learn how to fix things when you feel “things have run its course” I take the song piña colada as a good example. \n\nEdit:this is the reason why no one nowadays can stay together. Seems like a few ppl are butthurt listen to the song or look up the lyrics ",
            "Something really irked me about the post. You started casually dating. Like immediately. You clearly haven’t loved the poor dude for a long time. You probably should have been a little more honest and mentioned more to the fact that he’s not just holding you back in life from “being an adult and doing the things in life you want to do” but also that he’s holding you back from seeing new people. You mentioning the fact that you’re dating someone in the same field showed that you already had someone lined up. Nothing wrong with any of that but the poor sap who’s in love with you probably deserved that bit of honesty."
        ]
    }
]