[
    {
        "post_id": "3n57lm",
        "author": "bigboobedgf44",
        "title": "[UPDATE] My (28m) large-chested gf of 2 years (28f) was asked by our roommate's gf (21f) to stop going braless in our apartment.",
        "url": "https://www.reddit.com/r/relationships/comments/3n57lm/update_my_28m_largechested_gf_of_2_years_28f_was/",
        "score": 4463,
        "num_comments": 105,
        "created_utc": 1443730440.0,
        "selftext": "Original:\nhttps://www.reddit.com/r/relationships/comments/3lgroe/my_28m_largechested_gf_of_2_years_28f_was_asked/\n\nA few things to address before I go into the actual update:\n\nI did not confront Jenna when she was going on her tirade because they were in Troy's bedroom. I have no reason to barge into someone else's bedroom to start a fight. You can stop with the pitchforks about how I was awful for not immediately wrestling Jenna to the floor in a show of manliness. Waiting for the event to pass was a much better way to handle this. \n\nHannah does not need you to tell her that she's wearing the wrong sized bra. She has been to ABraThatFits for fit checks, and she measures herself frequently and knows what works on her body. She has a wide range of sizes from when she was figuring out her fit size. If the measurements really don't make sense to you, I can't help you. All I can say is that she's a fat bottom girl.\n\nTo the actual update: \n\nI talked to Troy about Jenna's outburst. He said that he would handle it, and he was extremely apologetic and said that it would not happen again. He said he was glad Hannah didn't hear Jenna's tirade, and I agreed that it was for the best if we tried to handle this maturely. Hannah was still hurt from Jenna's comments on FB, but Troy asked Jenna to apologize, and that's what happened. We let Troy know that Jenna wouldn't be allowed over again if she continued to behave like that. He agreed and said he would be reconsidering their relationship.\n\nSome time passed, and here we are. Hannah has gone back to just being comfortable in her own home, taking her bra off when she gets home. She is respectful of Jenna and Troy's space and wears a bra if Jenna is over. But things changed the other night. \n\nHannah and I were cooking dinner when Jenna came over to wait for Troy. She hung out in the kitchen and talked to Hannah (they seemed to get along a little better at least, Hannah is very sweet and doesn't hold many grudges). I was chopping up brussels sprouts to roast while Hannah was making some herb and parm crusted chicken or something and some cucumber tomato salad that I love. She coated some huge chicken breasts that she'd pounded and that's when Jenna piped up and said something like, 'Wow, that's so much food. You're not going to eat all that, are you?' to Hannah. \n\nHannah laughed and said yeah, she was going to eat it all. It was her dinner. Jenna scoffed and made some comment like, \"That's so much food, I could NEVER eat that much. But well, look at me.\" She got up to try and get our attention and show off her figure. Hannah didn't say anything, but I could tell by the look on her face that she was starting to panic. Hannah has a long history with ED NOS and one of her only triggers is people paying attention to what she eats like that. She used to not be able to eat at restaurants because she was afraid of people judging her. \n\nJenna took it a step further and said something about how she goes to the gym every day because she loves keeping her figure and she knows Troy loves it. She pointedly asked Hannah when the last time she went to the gym was and then asked me if I thought Hannah should do some kind of Yoga or something. She made some comment about how sad it is when girls \"let themselves go\" after they get boyfriends. (For the record, Hannah didn't). I was starting to get very angry because it sounded like she was implying I do not love Hannah's figure or something. I put my hand on Hannah's shoulder and told her to go to our bedroom, I could finish up. She had the fakest smile and said goodnight to Jenna.\n\nI let Jenna have it. I dont' want to go into what I said because it was not my best moment, but I could not accept her trying to intimidate or make Hannah feel bad. I especially could not take her implying at all that I wasn't attracted to Hannah. It all felt too surreal. I've never met someone who would just say mean things about a girl who was perfectly nice to her like that. Especially not about her weight. \n\nJenna left and told me she was going to \"have a talk with Troy.\" I consoled Hannah, who said she was okay, but ended up not eating dinner. We watched some TV together and about two hours later, Troy comes in. He just stands in the doorway and looks at us and he looks right at Hannah and says \"I broke up with her. I'm so sorry. She is never coming back.\"\n\nJenna is gone and done. Troy later said that Jenna was convinced Hannah was trying to steal him and that she was just jealous of her body. It was all because of one day when Jenna came over and Hannah gushed over the dress she was wearing. Jenna thought that meant she was in love with her or something. I have no idea where this came from. \n\nIt was never about the bra I guess. \n\n\n   \n**tl;dr**: Jenna attacked Hannah after everything seemed settled. She's not coming back. ",
        "permalink": "/r/relationships/comments/3n57lm/update_my_28m_largechested_gf_of_2_years_28f_was/",
        "comments": [
            "> I was chopping up brussels sprouts to roast while Hannah was making some herb and parm crusted chicken or something and some cucumber tomato salad that I love.\n\nSo ... you gonna post the recipe or what?",
            "This Troy fellow sounds okay.  I'd like to buy him a beer.\n\nYou, too for that matter.",
            "Jenna sounds like an absolutely horrible person.\n\nSorry you had to go through that, and kudos to Troy for dealing with it in an appropriate fashion!\n\n> Troy later said that Jenna was convinced Hannah was trying to steal him and that she was just jealous of her body.\n\nI'm wondering what sort of mental gymnastics led her to this thought. ",
            "Troy is a true bro.  ",
            "[deleted]",
            "Troy sounds like a really reasonable roommate.  Great news for everyone (except Jenna)",
            "I just absolute hate that nearly every time big titties or bras are mentioned, tons of users pile on about the wrong bra size and the abrathatfits sub.  It's obnoxious.  Almost like religious proselytizers knocking on the door.\n\n\"Hello.  Have you heard the good news about /r/abrathatfits?\"",
            "I'm so glad she's gone! Sorry that other people suggested she get a bra that fits. Even bras that fit are stupid and uncomfortable.",
            "Jenna was a bad egg. ",
            "Damn im suprised Hannah didn't start ripping at Jenna's face when she was talking. She had class and stayed collected. Fuck jenna",
            "Hannah sounds so nice I can't believe Jenna was such a dick to her. A girl goes out of her way to compliment you on what you're wearing and you think she's trying to steal your bf and is jealous of your body? How delusional do you have to be? ",
            "I'm pretty impressed with Troy. He sounds like a great roommate. This could have been so much worse if he didn't have his head on straight.",
            "1. YAY TROY!\n\n2. Poor Hannah :( That dinner sounded wonderful.\n\nAs a very petite woman myself, preferably representing kindhearted skinny women -  I apologize for that twigs horrible nasty behavior. Hannah sounds like a gorgeous woman inside and out and should never have to deal with that, especially not in the safe haven that is her home.\n\n3. Also you get a ribbon for being the best boyfriend.\n",
            ">I let Jenna have it. I dont' want to go into what I said because it was not my best moment, but I could not accept her trying to intimidate or make Hannah feel bad. I especially could not take her implying at all that I wasn't attracted to Hannah. It all felt too surreal. I've never met someone who would just say mean things about a girl who was perfectly nice to her like that. Especially not about her weight.  \n\n\nHurray!   Reading this made me so happy.  You did the right thing.  \n\n\nAs for never meeting someone who would just say mean things about a girl who was perfectly nice to her like that...  It's more common than you think.  Mean girls are a real thing and I'm just glad that Jenna was stupid enough to do it in front of you and you were aware enough to pick up on what was happening.  I wouldn't be surprised if that wasn't the first time Jenna made passive aggressive comments to Hannah.  ",
            "Jenna sounds like a totally self absorbed nutjob. Good riddance!",
            "Ding Dong, the witch is dead! \n\nHigh fives all around.  You 3 are all great people who should do great now that you've put this behind you.",
            "Yey! Congrats to Troy you guys should go out for a celebration.",
            "I'd really like to know what you said to Jenna, you know for justice porn. This chick sounds like she is both incredibly narcissistic and has low self esteem. She is an ugly person that no candy coating will hide. Good on Troy for dumping her sorry ass.  ",
            "You're a good bf and you keep good people around you.  It was nice to read this story :)",
            "I'm sad your gf missed what sounded like a delicious meal. I probably would have ate more to prove a point but I don't really have eating issues anymore. I'm glad he broke up with her she sounds very insecure and bitchy, someone secure with their body doesn't go out of their way to tear other people down. ",
            "A person that spiteful just can't help showing their true face, can they? I don't blame you at all for going off. Everyone has a breaking point, and yours sounds VERY reasonable.\n\nCongrats to Troy on dodging that bullet. ",
            "Its never \"just about the bra\", OP. You're a good boyfriend and Troy is a good friend.",
            "Troy needs to get a new girlfriend who doesn't suck because he's a good guy who doesn't deserve to be lonely.",
            "What a good guy Troy is and way to be awesome yourself. Buy that guy a beer.",
            "Wow Kudos to Troy! You're lucky to have such an awesome friend in him and a nice gf too (if I were Hannah, I may have unloaded on Jenna).",
            "What in the actual fuck. This entire post (and the original) are just... They're unbelievable! I thought Regina George was a movie character. \n\nI'm glad you let Jenna have it, OP. Normally I'm the one who advocates for deep breaths and taking a step back during heated moments, but *fuck* that awful, *awful* excuse for a human being. Seriously. If ever there was a time where it was absolutely okay for you to \"stoop\" to somebody else's level and fail to engage a filter before unleashing a torrent of unkind words, this was it. \n\nI hope Hannah is okay. You all sound like good people, and I'm glad you're free of that toxin. ",
            "I'm glad Troy has his head on his shoulders. Lesser men ditch old friends for their gfs every day. I'm glad he values your relationship, got away from that crazy bird and that Hannah can go back to being comfortable in her own home and skin in the end.",
            "Good outcome! I hope from now on your apartment is a bra-less, pant less, free ballin paradise.",
            "I like you, OP.  ",
            "Now go buy your roommate some good booze! What a guy.",
            "Fuck Jenna. She sounds like an insecure little twat. \n\nHannah sounds like a genuinely nice person for not ripping Jenna to shreds, and it's ridiculous that this whole thing started because Hannah paid Jenna a compliment. ",
            "Jenna is a psychotic narcissist.\n\ngood riddance. \n\nedit: bitter and jealous people like Jenna is quite common and they tend to happen a lot within female circles. it's very unbelievable when you hear stories of this nature because it's just so crazy but they do happen quite often once we triggered something in someone like that somehow. \n\nI was quite dumbfounded when it happened to me. but now I think it's just them being too bitter with what's handed to them in life. just get rid of them. good thing that Troy is a decent and level headed person.",
            "She sounds like such a mean, immature, insecure person. Good riddance! Also, kudos to you for standing up for your girlfriend. I hope Troy finds someone who's a LOT better. ",
            "Jenna is disgusting. ",
            "Jenna sounds really insecure, and is definitely very mean. ",
            "[removed]",
            "Bitches be crazy. ",
            "It concerns me that Hannah did not eat the dinner she made. Don't bug her, but I might press the issue just a little - perhaps she needs to go see a therapist or just receive some extra love & support from you. ",
            "[removed]"
        ]
    },
    {
        "post_id": "onvpca",
        "author": "Ok-Professional-3570",
        "title": "UPDATE : I (26F) am struggling to come out to my late husband's parents (50s)",
        "url": "https://www.reddit.com/r/relationships/comments/onvpca/update_i_26f_am_struggling_to_come_out_to_my_late/",
        "score": 4451,
        "num_comments": 65,
        "created_utc": 1626758875.0,
        "selftext": "[Original Post](https://www.reddit.com/r/relationships/comments/oa8qy1/i_26f_am_struggling_to_come_out_to_my_late/)\n\nI received a lot of great advice from the people here. I decided to come out to my sister in law. She took it really well and was very supportive. She suggested that she was going over that week and she reassured me that they would be mostly fine. she told me about the time when they thought she was queer and they tried to support her in their misguided but still loving way which is hilarious but also endearing. \n\nWhen she visited them she apparently laid down hints that I wanted to introduce my partner but I was scared about how they would react and that they should try to be calm. They reassured her that they would try to be cool. \n\nI visited last week. It was awkward and they were waiting for me to say something but I was feeling incredibly scared. I told them that I had a girlfriend. I was in love with her. we were about to move in together and I wanted them to meet her. They were quiet for a moment. I panicked and told them that I was attracted to men and women and that dating a woman didn't mean what I had with my husband was not real. \n\nThey told me that as long as I am happy and I was with someone nice. it didn't matter to them who I dated. They want to meet her. It feels like a huge burden has been lifted from my back. I am out to all the people that matter to me now. It is amazing. \n\nwe can only visit them next month as my girlfriend is incredibly busy with work. She is really excited to meet my family. I know they are too. I feel really lucky to have all this wonderful people in my life.\n\nTL;DR : I came out to them. They want to meet her. We are going over next month.",
        "permalink": "/r/relationships/comments/onvpca/update_i_26f_am_struggling_to_come_out_to_my_late/",
        "comments": [
            "I am incredibly happy for you!",
            "Awww, what a lovely update. What you did was so brave! so happy for you.",
            "You go girl! Glad that you're happy and that your mind is at ease now",
            "This was so great to read I’m so happy with how things turned out for you!!",
            "This is so beautiful! Love is one of the few things in life that is endless. You can love your husband to the moon and back, and also love this girlfriend to the moon and back without it taking away from how you loved him. It's good to hear that his parents are accepting and still want to be in your life! <3",
            "Congrats, OP. You deserve to be happy and it seems like they agree.",
            "Without knowing you, I can say that I'm proud of you. Well done.",
            "SIL said they were misguided but supportive. Your in laws 100% think that no man could ever measure up to their son, and are probably a little flattered 😂",
            "I'm tearing up with happiness with you. So glad you found a new love and still have your \"old\" family. Hope the visit is wonderful.",
            "Yay. Was waiting for this update.",
            "This gave me all the warm fuzziness. Congrats OP, best of luck with the move and all the happiness going forward x",
            "*They told me that as long as I am happy and I was with someone nice. it didn't matter to them who I dated.*\n\n\nThis.",
            "This made me squee!!!!❤ Happy for you!",
            "Cool,  great to hear some good stuff happening in the world.",
            "This is so good to read! I saw your original post and was really worried for you, as a lesbian myself (not saying you’re a lesbian necessarily! just wlw solidarity!) and I’m SO relieved they were supportive and kind. You deserve that.",
            "That's gorgeous. I'm so happy for you!",
            "YAAAY! Best possible outcome!",
            "That's fantastic, I'm really happy for you!",
            "I’m so happy for you! Keep up the positivity and happiness! So glad you have such amazing and supportive people in your life!",
            "I’m beyond happy for you. You’ve been through hell. It’s time to live openly in love with all of your family’s support. I’m so happy they are such good ‘parents’ to you and thrilled that they are welcoming to your girlfriend.",
            "This honestly made my eyes well up. I’m so happy you have these incredible people in your life. What a wonderful person you must be to attract such love and loyalty. Wishing you and your girlfriend all the best. I’m sure the first meeting will be fantastic!",
            "This is lovely! I'm so happy for you. What a wonderful relationship you have.",
            "First thing i read this morning and i cried a little bit, so happy for you!",
            "Congratulations OP, I love this update!",
            "I'm happy for you!!  I have 2 littles, and it would break my soul if they spent one second of their precious lives worrying about having our love/support over   the gender of who they love. 💔",
            "Man, this made me tear up. This is so great. I'm so happy for you and I hope things continue to go well.",
            "Who put these onions so close to me?!?\n\nI’m so happy for you!!!",
            "This is really the happiest of updates. I'm glad for you OP.",
            "This is so damn wholesome! I’m so happy to have read this! Congrats OP!",
            "This is so exciting! I’m glad you have such wonderfully supportive people in your life. Best of luck with your relationship!",
            "That is nice! I am happy for you!",
            "Fantastic news, it sounds like it couldn't have gone better",
            "This is one of the best updates read on Reddit. I am so happy for you ❤️",
            "Chills!! What an incredibly moving outcome. I'm so happy for you up OP!",
            "I’m so very happy for you. I wish you and your partner the very best. It might be nice to send them a text or give them a quick call just saying how much you appreciate their presence in your life and their continued support. I just find it’s always nice to express your love and appreciation.",
            "Awesome update!\n\n\nBut I can't wait for the day that \"coming out\" isn't a thing anymore. That everyone can bring over their partner, their gender didn't matter, and it's no big deal. Just that they make their son/daughter happy and treat them well.",
            "[removed]",
            ">She is really excited to meet my family. \n\nSomeone's ^cutting ^^onions.",
            "oh no why am i tearing up at work???? this is such a wonderful update",
            "AHHHH that's amazing! I'm so glad everything worked out :D",
            "It's 2:51am and I'm fucking happy after reading this.",
            "It's so nice to see everything went well with telling them. I hope everything continues to go well for you and you enjoy your happiness with your girlfriend! 😊",
            "Congratulations that's fantastic.",
            "I love this post. I’m super happy for you!",
            "Teared up reading this. What a tough situation for you and what supportive in laws. You have all lost so much already at such a young age and deserve every happiness.",
            "im happy for u . bi isnt something shameful although many opinionated people are out there . Im proud of OP for telling his parents . coming clean before others find out is good which shows u cared about him and his family before moving on .",
            "Thank you for the update! I am so happy for you!",
            "This is the best, congrats OP!"
        ]
    },
    {
        "post_id": "4hs7k6",
        "author": "buttstuffthrowaway00",
        "title": "[UPDATE] My [18F] boyfriend [19M] guilts me into doing sex things I'm not comfortable with.",
        "url": "https://www.reddit.com/r/relationships/comments/4hs7k6/update_my_18f_boyfriend_19m_guilts_me_into_doing/",
        "score": 4448,
        "num_comments": 332,
        "created_utc": 1462325393.0,
        "selftext": "Original post here: https://www.reddit.com/r/relationships/comments/4hcg0r/my_18f_boyfriend_19m_guilts_me_into_doing_sex/\n\nSo I sat my boyfriend down and told him I really don't like how he disrespects my sexual boundaries especially when he knows how hard it is for me to say no to anybody, and it took a lot to directly tell him to stop and keep my foot down. He flipped. He said that I was being selfish and inconsiderate by not letting him do anal. I kept thinking of all the kind words everyone left on the original post and didn't budge. This just made him angrier. He said there are plenty of prettier, sexier, and all around better girls that would be more than willing to give him what he wants. In fact, he had plans to meet up with a girl the next day. Admittedly, that stung, but I knew I couldn't give in. The responses to the previous post really opened my eyes. \n\nSo he stormed out in a fit of rage after I didn't give him what he wanted and I started gathering all his shit and putting it into garbage bags. I was running purely on fury at that point. I left his shit outside the door and locked it. I then sent him a text that only read \"In case there was any question, we're done.\"\n\nI don't think I've ever been that pissed in my life. I can't thank everyone enough for helping me see how much of a harmful prick that guy was. You all saved me from enduring any more time of guilt and anxiety because of him. Lots of love to all of you. <3\n\ntl;dr: broke up with my shitty manipulative boyfriend. I bought some cute lingerie for myself and have never felt so free.",
        "permalink": "/r/relationships/comments/4hs7k6/update_my_18f_boyfriend_19m_guilts_me_into_doing/",
        "comments": [
            "I'm so happy you kicked this guy to the curb! If you haven't already, block him everywhere. If he had a key to your place, change the locks. When/if he comes crawling back, don't cave. Stay strong!",
            "If someone reacts with hostility when you communicate your boundaries, that is all the confirmation you need to know you were right to do so. ",
            "...well that escalated quickly. \n\nJust FYI, everything he said to you was just him getting in his childish parting shots. Unless he really is under the delusional impression that hot women will line up to have poorly executed anal sex with a selfish idiot (spoiler alert they won't). \n\nEither way, GOOD FOR YOU. Go forth and have great sex. ...with people who deserve it.\n",
            "So happy to hear your rid yourself of that pain in the ass.  Good work!",
            "> In fact, he had plans to meet up with a girl the next day.\n\nSo he was actually planning to cheat on you before he broke up with you... I'd get tested, if I were you. Who is to say he hasn't already cheated?",
            "You not only got rid of a troublesome human hemorrhoid, but even better-YOU STOOD UP FOR YOURSELF! I bet it felt awesome!\n\nI know it's possible your emotional state might swing back to the darkside. Don't despair if it does-just remember that righteous anger and well-deserved sense of self-worth and keep moving on! \n\nHappy trails! ",
            "Congrats on standing up for yourself. Seriously. That's a MAJOR achievement. It's pounded so hard into young girls that they should always sacrifice themselves for others, always put themselves last, never argue, always go along, and if they don't then they are selfish. Huge congratulations on overcoming that terrible programming. \n\nThat anger will help you A LOT going forward when you're in other situations with people who try to trample your boundaries and use you. ",
            "Congratulations! Glad to hear it!",
            "Gosh, if there's one thing you're allowed to be \"selfish\" about, it's what goes inside you and where! Good riddance to bad rubbish!",
            "IM SOO SOO HAPPY! You're free! I hope your ex rots in hell! Congrats on leaving that douche and here's to hoping you will find an amazing guy that will love and respect everything about you! ",
            "This is the kind of update that makes me smile. You go girl!!!!",
            "I'm so proud of you!!! I hope your next partner treats you amazing, in bed and out.\n\nGood for you, seriously.",
            "Ugh, I dated a guy that tried to guilt me with sex.\n\nYou know what is unsexy as fuck? Having someone fuck you to literally shut you up from complaining. Reminds me of the exhausted mother that gives in to the child in the grocery store and reluctantly throws the candy bar the kid has been crying for in the basket. You see the look of defeat and frustration in their eyes. They were mentally done for, it's like surrendering. \n\nBullet dodged. Getting turned down for sex when you are horny sucks, but a respectable person would respect their partner's wishes and just masturbate (unless their partner is against that, which to me, that's pretty fucked up but that's a different discussion for a different day).",
            "I don't know you, but sweetheart, I am so darn proud of you. Your life is going to be better because of what you were strong enough to do. You deserve so much better, continue to fight for it ",
            "Good on you for having the courage to get rid of that asshole. You did the right thing. I'm sure you've learned a lot from this experience and you can find someone who respects you and your boundaries. \n\nYour ex will probably try to get you back, but don't give in. If he won't leave you alone, report him to the police. ",
            "I'm so glad you are away from him now! :)\nYou are making the right decision for sure!",
            "I'm so proud and happy for you OP.",
            "You are going to have this memory of yourself being a badass for the rest of your life. Congrats to you, and here's to a new chapter of standing your ground!",
            "Good job hon.  It sucks that you had to go through this, but hopefully the experience has taught you signs to watch out for so that you can avoid coercive jerks like this in the future.",
            "Wow he says you are being selfish for not letting him do anal? Thats wack! Unless she is into it before even trying it and still enjoys it after trying it anal is one of those things you really need to let the better half decide they are ready to try and only then do you proceed, yes a suggestion that you like it here and there is not a big issue and if she wants your thoughts on the idea of it then talk freely about how much you'd like to try it.. But to pressure someone for it and then call them selfish for not doing it is so fucked, im glad you broke up with his disrespectful ass, and to use a line of there are other women prettier and better than you is just hurtful and douchie. ",
            "This is hard for you I know, but is really a great thing for your life.  Use this experience as strength to never let anyone guilt you into doing something that you don't want to.  Let this set the tone for all other relationships in your life going forward.  \n\nYou should be proud of yourself OP, it took great strength to do what you did.  Also don't let this jerk make you think all guys are like this.  Many will not be, and eventually you will find a good one who will respect you.\n\nI suspect even your ex may one day be ashamed of his actions, hopefully.  Don't try to get back with him though.  \n\nAnyway way to go, and don't let this get you down.  ",
            "This seems fitting:\n\"It takes a great deal of courage to stand up to your enemies, but a great deal more to stand up to your friends.\"\n\nFantastic that you stood up to him!",
            "My ex tried to manipulate me too, when he tried to say I didn't care enough about him. He ended up emotionally cheating on me. Congratulations on getting rid of that pest in your life (: ",
            "Congratulations!! Now block him on all social media so that you don't have to put up with his crap, and consider calling someone over so that you don't have to worry when he gets back. ",
            "You did the right thing by standing up for yourself in your convictions. Nothing wrong with that and everything is right with it.\n\nGood for you!\n\n\n*Nana internet hug*",
            "You are going to be amazed when you find someone who is happy with literally anything you provide in the bedroom. This is coming from someone whose previous relationships were at least 80% using what I did and didn't want to do in bed against me. I have been with my partner for 4 years, we are engaged, and it still boggles me when I ask him if there's anything in particular he'd want, and it's \"no, just -insert regular sexual acts here- =]\"\n\nIt'll take some time to get used to, but it's fucking great. You'll feel great, just ignore the nagging feeling that you're not doing something they want - you only feel that way because you've been conditioned to by douchebag ex.",
            "I was so hoping for an update to this. You're amazing, OP. <3<3<3",
            "That is a great update! You got this.",
            "So glad you got rid of that asshole<3",
            "This is the best update I've read in a while.  I'm so happy for you and relieved you listened!  That guy was/is abusive and you don't need that in your life. ",
            "Good for you. He was seriously not worth it if he had an immature reaction like that.\n\nThat \"girl\" he has is most likely not real; he's just throwing it out there, hoping you'd be desperate/hurt enough to give in.",
            "So proud of you, OP! I know it was hard for you, but you were clear about your boundaries and stuck to them, even when he tried to get a rise out of you. You will find someone who respects you. ",
            "What a creep. I'm so glad you're free, OP!",
            "\"Harmful prick.\" Just perfection, OP. \n\nCongratulations on moving on to better things. ",
            "Yaaaaay! You're a kickass lady!",
            "> much of a **harmful prick** that guy was\n\nSounds about right.",
            "Sounds like an ex I had when I was younger. He pressured me for sex all the time, and even told me a \"girl in his class had offered\". Glad you got rid of the asshole.",
            "One of the things we see on Reddit a lot is how relationships are so much better with communication. It's just that sometimes, the message you need to communicate is \"get the hell out of my life\".\n\nWell done, OP, well done.",
            "GOOD FOR YOU!!",
            ":nature boy ric flair wooo gif:",
            "Congrats OP I have been following this with interest and I'm very happy for you.  This evoked a lot of emotions in me and I'm genuinely beaming with positive feelings for you even though I don't really know you :)",
            "It stung, but it was supposed to sting, it wasn't supposed to be true. And if it was true, that doesn't make him some playboy sex god, that makes him a cheating asshole. Win win for you. ",
            "You know you deserve so much better, and will get it. Internet hugs and snaps to you for you standing your ground :)",
            "> In fact, he had plans to meet up with a girl the next day.\n\nThat shows you that you made the right decision.",
            "Never before reading this sub have I punched the air and yelled \"yes!\"  My neighbour now thinks I'm mental. \n\nWell done you. ",
            "WAHHHHH you won't do anal with me WAHHHH\n\nWhat a lowlife ",
            "Any guy who says \"there are plenty of girls who would do x with/for me\"  is not worth the time,whether x is anal or running through a field of daisys",
            "You wonderful, strong Amazonian QUEEN!!! Good for you sticking to your guns and not backing down. That guy was a grade A asshole and I'm so glad he's out of your life. Good job!",
            "What a jackass. Good riddance to his dumb ass and good luck healing away from him, hon. You are so much better without that idiot, and please don't give in to his later pleading (baby, I didn't mean all that! blah blah blah) and go back to him once he realizes how much he screwed up!",
            "So glad you got out! I was in a very similar relationship from the time I was 17 until 20 - I didn't realize how manipulative and mentally abusive he was until years later. Just a warning though, don't let your guard down now. Even after we broke up, my ex continued to guilt me and manipulate me into sleeping with him (threatening suicide, etc) for years after we broke up. When I wouldn't answer his calls, he would show up at my house and beg me to get in his car and take a drive to 'talk to him', then drive me to his house and not let me leave until I gave him what he wanted. Please make sure this doesn't happen to you - regardless of how much guilt he tries to lay on you, you are not responsible for his happiness and well-being. We broke up 9 years ago now, and I am just finally starting to face the emotional and mental damage that relationship caused. ",
            "My God this is a flawless post. Don your cute lingerie and be proud of yourself, because I definitely am.",
            "I'm so happy to hear you kicked him to the curb. Anyone who thinks they can demand sex from another person is dangerously wrong, and I'm glad you were able to speak up and defend your boundaries.",
            "you should have poured vegetable oil into all of the bags after you packed them.",
            "Just a tip for the future, if you do date someone who pressures you for anal and you are prepared to give it a try again, tell them only if they let you fuck them in the arse. \n\nIf they're so obsessed with it, then you'll be able to give them a taste of what it's like, so when you tell them it hurts, they'll know. \n\nI've told this to a few female friends who asked me why some guys are so obsessed with anal. One girl absolutely loves fucking guys the the arse. She has a special strap-on so she is penetrated at the same time. the funny thing is quite a lot of them really like it. \n\n",
            "Fuck that guy.",
            "Way to go! Make sure to block him on everything and ignore him if/when he tried to come back promising he's changed. ",
            "You're better off. No need for an asshat who won't take your concerns seriously. ",
            "Good job OP! You don't need someone in your life who can't respect boundaries, especially for things like this. Also 10 bucks says the girl he claimed he was going to meet doesn't exist. Your ex will probably try and get back with you but stay strong! ",
            "You're wonderful! I'm glad you're ok now. *hug*",
            "I am so glad you are rid of him!!",
            "here's to you :)",
            "This honestly makes me smile so much. Good for you!! You have my utmost respect and admiration for standing up for yourself and not taking his shit anymore. 😊",
            "What an asshole, good riddance ",
            "I wish I could give you all the karma points in the world. Honestly, you're my hero today. Good for you!!!!",
            "well done he sounds like a manipulative bully ",
            "Yay! Good for you for breaking up with him you're 10000% better off without him, I did a little happy wiggle for you :) ",
            "Good riddance to shit rubbish, top marks OP",
            "Being in a manipulative situation can certainly be tricky but I'm really glad to hear that you were able to make the decision to leave. \n\nYou should never be made to feel like you can't leave if that's what you want to do. You should also never be made to feel like you need to come back either. Even if they're making threats or holding things against you. \n\nJust remember, it's not your fault or your problem that they only realise what they've got when it's gone. \nYou now know what they're like one you get to know them and it's not who you want to spend your life with. ",
            "I love this update.  Nothing is sexier than a confident woman that doesn't let anyone push her around. You will do much better with the next boyfriend.  Hopefully he'll find the guy he's looking for too,  so they can happily butt fuck ever after. ",
            "*Hugs*\n\nGood for you for leaving him!",
            "Grats! Proud of you!",
            "I'm so sorry that it ended so awfully, but you're better off without that jerk! Maybe you even learned from the experience of standing up for yourself and saying no like that for the first time - maybe what lies ahead will be so much better with your growing confidence!\nWell done!",
            "Sounds like you did the right thing.  In hindsight, you should have told your BF that sure, I'll have anal with you but first you're going to have to take a dildo up there and see how you like it first.  Pretty sure then you'd see who's the selfish and inconsiderate one.  Honestly, this is just a \"wished I'd have thought of that earlier\" idea and is only meant to be half serious but you definitely did the right thing walking away.  You'll find someone else who'll honor you and your boundaries soon enough.  Best of luck to you OP.",
            "Good for you!\n\nYou should never be expected to do something you don't want to do just to please your partner.  (Except go to the office Christmas party, we all get sucked into that one.)",
            "You did awesome, OP. it is always better to be alone than to be with an asshole. Now you have a chance to meet so.eone who isn't a toxic pissbaby.",
            ">He said there are plenty of prettier, sexier, and all around better girls that would be more than willing to give him what he wants. In fact, he had plans to meet up with a girl the next day.\n\nWhat a lunatic. You did the right thing. You're probably going to question yourself in the near future, and that's natural. But please believe me that you made the right decision.",
            "Oh my God, thank you, thank you! I can't tell you how happy and proud I am for you to have stood up for yourself! Seriously, sex is not the same for everyone and if you don't like something they should never force you or be upset about it. Your ex sounds like a piece of shit and I kinda feel bad for his next girlfriend",
            "I'm kinda glad he showed these signs so early, and that you got rid of him so soon! ",
            "Well you deserve someone better anyway.",
            "He sounds like a pain in the ass",
            "Oh man. He's going to die alone.\n\nYou should be proud that you stood up for yourself. A lot if people couldn't do what you did.",
            "shut it down, deal breaker",
            "So happy to see this update. \n\nI'd be tempted to mail him a dildo and tell him he knows exactly where he can stick it. ",
            "What an asshole. Great decision OP! I wish you all the best.",
            "Hearing that someone escaped a manipulative relationships makes me  happy, especially since I used to be in one as well. Congrats! Recovery will be difficult, but stay strong and ask for help if needed. ",
            "I'm so proud of you, OP. Standing up for yourself can be damn hard, but you kicked ass. Congrats on the new lingerie!",
            "Well done and remember to put yourself first, its a cliché but things are when they have a grain of truth, you get the love you think you deserve, it took me a few years to realize that and when I stopped tolerating men who treated me badly they melted away like ice.  ",
            "Well done, I can't remember if I commented on your last post (I think I read it after it was locked) but I'm SO PLEASED to see this update!",
            "Good riddance! You did a brave thing, he's an ass for making such a big deal about anal, like it's just a sexual position that some people like and some people don't. If he's basing emotion in a relationship on someone's physical boundaries then he's gonna have a tough time finding someone, on top of being an manipulative ass that is! ",
            "Well done OP, you can do so much better than that. Don't look back and have fun finding someone who will appreciate and make you happy! ",
            "Wow this guy gets douche of the fucking year. I can't believe how selfish and self-centered he is. He gave no shits about how you felt. All he was concerned about was sticking his dick your butt and nothing else. I'm so glad to hear you gave him the boot and hope you find someone who sincerely cares about you.",
            "I can't believe that there are people like this out there to the extent that I see in this sub.   Do all these guys get their relationship knowledge from music and movies or something?   Completely stupid.  \n\nGood thing you got out of that relationship. ",
            "Good for you! Now stay strong and remember everything we be said to you in case he tries to worm and manipulate his way back in. \n\nLife's too short to have bad sex, go live your life! ^_^",
            "Nicely done! :)",
            "He's still a child, his loss OP! Well done.",
            "Good for you mate! You dealt with that so well. Hope you meet a lovely new respectful partner soon. ",
            "Im so happy for you!! Im clapping in front of my screen lol You will so much happier!",
            "You are awesome! Well done for not backing down and standing up for yourself! The sky is the limit for you now that you don't have that lead weight hanging around your neck, when he comes back begging you to take him back talking about the good times let dead silence be your answer it will really fuck with him ",
            "im so proud of you for standing your ground!!",
            "So proud of you.",
            "Yaaaaaaaaaay!",
            "Dude this kid is garbage ",
            "I'm so glad you're done with him!\n\nAnd I'm so, so very happy that you stood up for yourself! Well done! Now you know that, no matter what douche you meet, you can at least trust yourself to treat you right.",
            "You go girl! Good riddance, that guy isn't worth your love, time and energy. <3",
            "You should have said I'll do anal if you do anal so you can feel what it's like. Find the biggest fucken dildo and shove it up his arse. ",
            "Congrats on getting out before it got worse.  Physical intimacy should never be one sided.  If it is not enjoyable or agreed upon by all parties involved, should not occur.  If he blew up over you setting personal boundaries that you were uncomfortable with crossing, then no telling how bad things may have gotten because he would have just assumed that there were no limits and he was in complete control, and that is extremely unhealthy and could even turn violent if not kept in check.  You did the right thing.",
            "You have done the right thing. Thank you for the update OP.",
            "Good for you standing up for yourself to a selfish asshole.",
            "Well done! You 100% made the right decision. ",
            "You did the right thing!",
            "He showed his true colors when he told you ha had a date for the next day.",
            "Well done! Enjoy not being with an awful person.",
            "Good on you for taking out the trash OP! Hope you find someone that deserves you.",
            "WTF. Best possible outcome really. Now he's out of your life.",
            "Fabulous work OP.",
            "this dude is a fucking piece of shit. I'm so glad you left",
            "You handled that very well. Time to start dating around and find someone that respects you and treats you like a human being.",
            "lol once you're in your 20s or 30s you will have a lot more to worry about than these silly sex things. good for you for nipping this literally in the butt sooner than later",
            ">In case there was any question, we're done.\n\nNice! Good for you girl! Dude was a complete asshat.",
            "OP...pretty sure he will come running back to you...don't take him back! You deserve better.",
            "Good going! :)",
            "WAY TO GO! \n \nI am sure that you are hurting because breakups do hurt, but you have given yourself an amazing gift of self-respect that will last you the rest of your life!\n\nI am so proud of you. ",
            "That feeling right there? It's GOOD anger. Don't ever forget how this whole experience made you feel.\n\nI'm really proud of you!!!",
            "That whole ordeal sounds extremely rude and selfish on his behalf.  You should've reversed the roles and told him to let you show him how it feels.\n",
            "I am so happy for you!  Congratulations!  His behavior was 100% unacceptable and I am glad you do not have this person violating your boundaries and then gaslighting you about it daily. ",
            "Good job!  Just don't ever cave in in case he starts getting all romantic and tries to win you back.  That's how manipulative relationships work.",
            "Did you try manipulating him into allowing you to peg him? Because it really seems like he wants to be pegged. So much focus on assholes. When he is really the asshole. Good for you for breaking up with him. Seriously. What a piece of shit. Good riddance to him!!!!",
            "well i'm glad the advice led you to stand up for yourself. I just read the OP and definitely sounds like he knew he could push you around. If anyone else tries to push you into thing you're not comfortable with, then they're not right for you or anyone really.",
            "Yay! Good job. You should be proud of yourself. ",
            "Girl, I am just so proud of you ",
            "I'm glad you got rid of that asshole before he seriously hurt you. Don't listen to a word he says, he's just trying to lash out and manipulate you again. There is probably no other girl, and like someone else said, I doubt girls will be begging to sleep with some selfish, manipulative dick (though I would get tested to be safe). \n\nGood on you for standing your ground. I've had one night stands and fuckbuddies where we mean absolutely 0 to each other respect my sexual boundaries (which also happen to include no anal), and respect me in general, better than your boyfriend did. So long, motherfucker.",
            "Yay congratulations! ",
            "You're better off without him. Any guy that wants to get pleasure out of something your find painful and don't want to do is a dick!",
            "GOOD FOR YOU! Rock that sexy lingerie, girl. ",
            "Congratulations! I'm so happy to hear you're free of this douchecanoe. You don't deserve that treatment and will be much better/happier for having dumped this asshole. ",
            "Hahaha, too bad you didn't have the chance to offer to fuck him in the ass with a strap-on as *quid pro quo.*",
            "Good job!\n\nThat guy was a jerk! You are not obligated to do anything. Any two sex partners find the compromise that works for both parties and if you can't deal with that, leave and find someone else.\n\nThe fact that he was hooking up on the side, well you dodged a bullet.",
            "Yay! Good job! Now go have sex with any nice boy you like. ",
            "Here's thing about assholes: Everybody needs one, and exactly one, in their life.\n\nBig congrats to you for recognizing that you'd acquired a giant extra asshole and getting rid of him!  ",
            "GIRL.  You are a badass.  This was an exercise in boundary setting that will stick with you hopefully for the rest of your life.  This is a superpower you must always practice. ",
            "So proud of you and putting your foot down!! I wish I would have done this in my past abusive relationship but I didn't see what it was turning into, I also didn't have Reddit back then to peruse. I hope all goes well with you and your newly single life!!! ",
            "I bet there is a pattern of abuse that you haven't noticed yet. Check out r/verbalabuse to see if anything fits.",
            "Well what an absolute chode he turned out to be. You dodged what sounds like and emotionally and physically abusive asshole.\n\nNow go be fabulous.",
            "you go girl ",
            "You're amazing :) you did what so many women are unable to do. Well done.",
            "I was in a somewhat similar situation in my previous relationship, which was also unfortunately my first- you deserve someone that respects your boundaries no matter what, and who doesn't punish you for trying to communicate them. \n\nSo glad you got out of that and stood your ground.\n",
            "This post is amazing, seeing a self confidence boost in action is a rare thing. ",
            "Whoa- this exact dynamic happened between two neighbors I once had.  It's more about power than the specifics, as that gal let the next guy rail her behind like the world was about to end.",
            "Ugh this guy's reminding me of my immature ex boyfriend lol. Please don't go back you would do so much better than someone that has to whine to get what he wants.",
            "As someone who was in your exact situation around that age, great job! I wish I was as strong as you at that point in the relationship. ",
            ">He said that I was being selfish and inconsiderate by not letting him do anal\n\nlol, fuck outta here. Glad you got rid of someone like that.",
            "I think that there is probably about a 90% chance that this guy will come crawling back to you because this supposedly 'hotter girl' will treat him like absolute shit. Don't cave in when he comes crawling back to you. You deserve better than that. ",
            "Good for you girl!! I know I don't know you but I am seriously so proud of you! \nWay to stick to your guns and stand up for yourself! \nYou are more than just a sex toy for a guy to use however he wants! I'm so glad you realized your self worth. ",
            "I know people like this are out there, but for some reason it still surprises me. \n\nIf someone isn't having fun you stop. You stop and you respect that.\n\nThank goodness you won't be wasting more time on him. ",
            "You fucking go girl. This guy was a total asshat. I'm so glad you stood up for yourself.",
            "Congrats! I'm so happy for you and guys like him have the worst corner of hell reserved for them! :-) ",
            "Him saying there are prettier more lenient girls is bull. He's only trying to push your buttons and hurt you. Stay strong girl! I don't know you, but I am very proud of what you did here! ",
            "I doubt he had another girl waiting for him.",
            "What a jerk, let him take a weiner in the bum and see how he likes it",
            "Boy am I ever proud of you for knowing yourself on this.\n\nBe ready for him to come back, begging and crying, promising to do better. Don't fall for it. This isn't about the anal sex, and we all know it. This is about a controlling, childish, abusive dickwad. And that isn't going to change, not any time soon.",
            "I'm proud of you, OP! You were brave and stood up for yourself. You didn't back down, and that isn't easy! You deserve so much better than that guy. ",
            "I'm so happy for you. Stay strong.",
            "More young women need to have the strength and courage you have.",
            "That guy is bad news. I'm sorry",
            "Give up the butt ladies, give up the butt.",
            "LOL HE TELLS YOU HE'S MEETING A NEW GIRL AND YOU TEXT HIM AFTERWARDS AND SAY \"WE'RE DONE\" HAHAHAHAHHAAHHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAH OMFG",
            "Change your\n\n- Locks\n\n- Passwords\n\nHit the\n\n- Gym\n",
            "This is the best for both of you. You shouldn't have to do things that you don't want to and he shouldn't stay with a woman who doesn't please him sexually.",
            "[removed]"
        ]
    },
    {
        "post_id": "al5zdu",
        "author": "PurpleHairEngineer",
        "title": "UPDATE: I [22F] am graduating and can't find a job in my chosen field here, but my BF [30M] refuses to move",
        "url": "https://www.reddit.com/r/relationships/comments/al5zdu/update_i_22f_am_graduating_and_cant_find_a_job_in/",
        "score": 4429,
        "num_comments": 323,
        "created_utc": 1548802925.0,
        "selftext": "[Original post](https://www.reddit.com/r/relationships/comments/ahunq4/i_22f_am_graduating_and_cant_find_a_job_in_my/)\n\nI decided to follow the advice of everyone on Reddit, my family, professor, etc. and take the job. It is an amazing opportunity in a beautiful city with a reasonable cost of living. It is a job doing exactly what I want to do with a team I really liked and on which I feel my contributions would be heavily valued.\n\nThe BF and I have amicably ended our relationship. Unfortunately, I'm going to be stuck here for the next 3.5 months because I can't afford to move out there (2500 miles away) more than a few weeks before the job starts, even though all my classes this semester are online. I can't really go out to many local social events during that time, since I know I will see my now-ex, and it would feel like a dagger twisting through my heart to see him with a new girl. I still think I'm making the best decision for my career (and likely my future happiness); the next few months are just going to suck.\n\nTL;DR: I accepted the job offer like everyone told me to, even though it ended my 7-month relationship.",
        "permalink": "/r/relationships/comments/al5zdu/update_i_22f_am_graduating_and_cant_find_a_job_in/",
        "comments": [
            "Oh thank god, I was getting a little worried there based on some of your comments in the original post. You absolutely made the right decision. ",
            "Okay, don't spend your last days of freedom before starting a job hiding because you are afraid of running into an ex. Trust me when you work for 49 weeks with 3 weeks off, you will curse yourself for not taking advantage of all the free time you had back when life was simpler. ",
            "You made the right choice! Best of luck with the move! ",
            "7 Months?\n\nDude, I've got outstanding power bills older than that.\n\nMove on, be happy. ",
            "My piece of advice is do not give up on the last time you have for a social life at home, over a guy you were with for 7 months. You only have a short time there left, make the best of it! I swear when you look back on this time after you've been in a really long term relationship, those 7 months will not mean near as much as the 3.5 that you get to choose to make the best of. Take advantage of this time before you have to join the workforce, I just graduated myself and wish that i had some time off to enjoy just being 23 before having to jump right into my career.",
            "I’m sorry but he doesn’t sound wrong either. He’s a 30 year old man who has worked hard to be in the position that he is right now. He can’t just up and leave his life for a 7 month relationship. You’re not wrong either. You guys just met at the wrong time. ",
            "Congrats on your new job!\n\nYou 100% made the right decision!",
            "I remember back when I was dating and that fear of seeing a recent ex, and not going out. Looking back, I say the heck with that. Face the fear, tear off the bandaid, whatever cliche you want (but they're true). You're going to meet lots more people and date more and like you said, the split was amicable so just consider that an enjoyable chapter in your life. It's all easier said than done but I look back on decisions I made out of fear of being hurt as just a waste of time. I think the hurt intensifies if we hide from it.",
            "You did the right thing, always put yourself first.Congrats! You're only 22, it will all work out",
            "[deleted]",
            "For being a self-proclaimed hopeless romantic, you recognized the situation and handled it very well. Your future self will thank you. All the best with your new job!",
            "Congratulations on your new job!!!",
            "7mth relationship is nothing..career and financial stability in the future is way more important. \nYou are still young, you'll find another bf easily but concentrate on work first 👍",
            "You know that this job is better for your future than staying in with your bf. That's all you need to consider. And congrats on your new job! I wish you nothing but great success with your future! ",
            "Miss, if you're at UVM I'll drive to you to pop a bottle of champagne! Congratulations!! (I'm serious-- feel free to pm me!) \n\nYou're going the opposite direction I took for cross-country moves, but you won't regret it. Live it up in your last moments to properly close this chapter before you bid your sweet home goodbye. It will change when you're gone, but the pieces always follow you and identify you from the rest of your community. Wear your differences proudly on the west coast! \n\nThe memory of this relationship (similarly, I had a 9-month relationship that completely broke my heart despite being \"prepared\" for everything) is a good book to re-read and cry happy tears over, but don't look back. Don't regret anything. This is an important growth for you that really enriches your life. It's DIFFICULT but when you look back, you feel this overwhelming sense of YOU.\n\n--And if it were meant to be, he'll be back. And it's not limited to romantics. He could very much support you even as just a friend. Sometimes we're not meant to be with someone we love so deeply. But this journey for yourself is so important. That cannot be stressed enough! ",
            "You made the right decision! :) ",
            "You made the right choice and I bet in a year from now, you'll be very glad that you did. Congrats on landing the job and good luck! ",
            "Oh good for you. The job sounds great. It might hurt now, but as soon as you start the new job you probably will hardly have enough time to think about it. You will be too busy getting to know new people and the job.  \n\n\nIn the mean you are scared to go out for social events, but maybe you can go over to a friends house or hit the cinema , do some sports or arts and crafts or something",
            "Something to remember here is he's probably at a point in his life where he was getting ready to stay put for a while. By your early 30s, you'd typically have a solid job under your belt, are getting ready to buy your first home if you haven't already, and are past the point where you're thinking of dropping everything and moving to a new city/state/country. Many people even have kids at that point. That's the one issue I could think of as soon as I saw the age difference, stuck out like a sore thumb.  \n  \nNot saying you should never date that far out of your age range again, but rather that it shouldn't be that much of a surprise if you do, and run into someone that isn't willing to drop everything for you to move for a new job.",
            "[deleted]",
            "Yes, you made the right choice! Onward and upward! Congratulations on the new job!",
            "I don't know you but I'm happy for you! You're young and the possibilities in your future are limitless. ",
            "My sis moved cross country for a job, left her relationship behind and it sucked at first. She made do and made new friends. He ended up moving there to be with her and he won her back. They’re still together. Not saying it happens in every case but it does happen sometimes. Either way she was prepared and she left home without him and was brave enough to do right for herself, and I respected that leap of faith.",
            "Yes I'm so freakin happy for you. Never pass up an opportunity for anyone. If you guys are meant to be, you'll find yourselves with each other spme day. In any case, it's a brand new life and brand new world for you. Best of luck!",
            "I know you don’t know me but I’m so proud of you! This is one of the hardest decisions of your life, but you will be so glad for it, I promise. ",
            "You made the right choice! \n\nI was in a very similar position and I made the choice to stay. I love my husband and my son, but sometimes I still wonder what my life would be like if I took the job that was being offered to me after graduation. I majored in Aerospace Engineering and after my internship I was offered a job with a top defense company in another state. I got married and had a baby instead, now I’m a SAHM with a super lucrative degree that’s becoming less and less useful every year while my husband with the same degree is working at an amazing company. If I could go back and make the same decision with the knowledge I have now, I’d choose my son 100% of the time, but it doesn’t stop me from feeling sad about it sometimes. ",
            "It's only 7 months & if he really loves you then he will understand. With me, I have 16 yrs & a 13 yr old daughter so i can't just get up and go. I seem old, but im only 37.  I have my Bachelors in healthcare & still could not land a job, until recently. I'm excited to be starting my new career on February 11th. ",
            "If your in love then you should stay. He will always be the one that got away if you don't. I would choose love every time. ",
            "I'm (21m) in a similar situation right now. 1 week from now I'll move to a city that is 450 km away from my hometown, to star an internship in a company that I always dreamed. The company already said that if I do a good job when I complete the college I will be contract. \nSince the beginning of our relationship I told to my girlfriend (19f) that one day I would move to another city (my hometown don't have the field that I want to work with).\nWe do not want to break up, we really live each other, but now she started to say things like: \"If you had told me BEFORE we start dating I would have think more about start this relationship\", \"I never wanted to move from here\", \"I have to stay close to my relatives\" and stuffs like that. (She is tooooooo close to her parents and relatives, it is almost annoying).\nWe'll keep our relationship in distance, I'll be in my hometown once a month approximately. But I am afraid of how it will end in the future.\n\nI'm really happy for you, you career is your future, I'm sure that you will find someone else, or even be together with him, how knows? Good luck and success!\nPS: Sorry for my English. ",
            "Good luck with the job, seems like a wise decision. If you are leaving Pittsburgh and coming to the Bay Area (my guess based on that 2500 mile distance between places that do hardware), welcome. :P I loved living in Pittsburgh, it's a great city, but there is in fact more tech here. Silicon Valley definitely has its drawbacks but has some special stuff too, even if the culture is radically different than when I moved here.",
            "Congrats on the job! You’re making a great decision for yourself and your future (: ",
            "You absolutely made the right choice gf! Heartache and heartbreak are part of life, lessons to learn from. Years from now u will look back and know u made the right decision. Congratulations! ",
            "I'm so happy for you, you have a very bright and beautiful future ahead of you. 😊 ",
            "I’m so glad to read this happy ending! Proud of you for making taking the courageous (and smart) route! You will find love just like you found this amazing job!",
            "I think you definitely both made the right decision. Moving to a town you don't want to for someone else is such a fucking bad idea. But also, inhibiting your career for someone else is also a fucking bad idea.\n\nOnly way it could have ended with a good future for both.",
            "I’m so happy for you! Go forth and be amazing! ",
            "Count yourself lucky that the split is amicable.  Go out and enjoy your friends.  Here's hoping he DOES find someone else right away so he won't reel you back in.  ",
            "I am genuinely proud of you and besides I admire your  courage and determination. Most of hopeless romantics couldn't be able to that. \nNow, already said million times below, it's time to give yourself a some time to get through your pain by post breakup. I used to have LDR for more than a year and we broke up two weeks ago. If you wanna talk, I am here total stranger. \nYOU GO GIRL! ",
            "Glad you made the right choice",
            "We see it all the time both here and in real life: 22 and 30 is mathematically not very far off, but that is an age gap that is damn near impossible to sustain due to what is typically going on at those two ages. You made the right choice.",
            "Congrats, you made the right decision, you're so young and clearly with a bright future ahead!",
            "I just came here to say, like everyone else, I'm so sure you made the right choice, and am really, genuinely happy for you, and all the doors you've left open for yourself. \n\nAll this from a girl that has spent the last 13 years with the same man, married him, and had his babies......oh, and is a stay at home mom. \n\nTake a day, maybe even a week, and feel all your feelings. Be as sad as you need to be, then shake it off, and find a way to go out and enjoy this time in your life. \n\nAnd don't talk to the guy. At least not till you move. Just leave that door firmly closed.  Let yourself go out and be happy, without the constant sadness that talking to him would bring to you. \n\nI wish you all the best in your next chapter. ",
            "You are growing up! :)  Congratulations!",
            "you have 100% made the right decision. It might not feel like that now but you have.",
            "[deleted]",
            "Go out and enjoy your last few months.\n\nDan Savage often talks about the “straights” who cut off all contact with exes and demand that all their friends do the same.\n\nI’m not saying you have to seek him out. But don’t isolate for months on the off chance you might see him.\n\nYou spent 7 months with the guy. It didn’t work out. You can move on without a cloud of bitterness or fear of running into him. If you do see him, nod, mentally acknowledge the good times you had with him, and just move on. ",
            "I don't know what happened but it seems like you made the right decision!",
            "Immediately after getting married my wife took a job across the state. In a town I never wanted to live in. We argued over it a ton. I was super bummed but went along with it. That was 7 years ago. Now we both have jobs we love and literally got to choose the city of our choice. I can promise you that everything will work out exactly how it's supposed to..",
            "Definitely the right decision.  You have to think about yourself.  There are plenty of people out there and relationships sometimes end because of wanting different things and not always with bad blood or one screwing the other person over.  You should be excited you have the whole world in front of you.",
            "Right now \n\nJob > Relationship ",
            "Fantastic! You seem way more mature than your 30 year old ex.",
            "He may take your Duvet. But he'll never take you FRRRREEEEDDOOOOMMMMM!\n(Also Towels. You always need them.)",
            "You 100% did the right thing-Rock your new job and be fabulous.  Have fun in new city!",
            "Congrats! You did the right thing! At 19, I choose an \"amazing guy\" who wanted to marry me after 6months over my dream college and he turned out to be a manipulative, emotional abusive a-hole. Took 2 years for him to show his true colors.  A Year later I left him and still regret not transfering to my #1 choice of schools. Always focus on you. From one hopeless romantic to another, you did the right thing. In my 30s now and have a great career that I love and an amazing boyfriend. ",
            "Congratulations!!!! Sometimes the hardest things and the right things are the same 👍♥️👍",
            "I admire your courage! At this point in your life you should be selfish a little bit and focus on improving yourself the best you can. You have a long way to go and hope you have fun at your new job! The next few months might be hard, but rest assured that they will be worth it!! You seem strong enough to get through this! I'm so happy for you! ",
            "You made the right choice, he did not. My best friend and his fiancé moved away to Vermont (3000 miles away) because she was accepted to a wonderful job, and it hurt him to go but he still did it. After she gained her experience there she found an even better job back here where they both love it. You never know how things are going to workout, your ex should have supported you, and someone worthy enough to marry would. Congrats on the new job.",
            "You made the right choice. You got plenty of time to find The One",
            "You got this girl! Break ups are always hard but you’re putting yourself and your career first, that’s the best thing you could do. Kudos to you for choosing your happiness and not letting anyone hold you back from it 💕",
            "Change the thought process, there's an opportunity to (i) have some meaningless flirtation (ii) start a new hobby (iii) see your friends, your ex being there shouldn't stop you!!\n\n&#x200B;\n\nOtherwise sounds like you're making the right choice for you!",
            "You go girl, things will work out and you'll be fine. Good luck!",
            "I feel you and I think you made the right decision.\n\nDuring the summer I broke up with my now ex for a very similar situation. I got an incredible job offer out of my Country but she wanted to stay in her home city with her family.\n\nNow after a couple of months passed I see I made the right decision because in the end one of us was going to be miserable.\n\nGood luck with your job! And take time to heal :)",
            "YAY! SO excited for you. I, too, was very concerned you wouldn't take this opportunity because of a guy who claimed he wanted to soon get married and settle down with \"the right person,\" but was clear he was not willing to propose to you yet or even commit to staying in a relationship with you if you stayed. As others have said, I think you're making a good decision and have a great adventure ahead of you. I'm sorry you feel unable to go out to local social events in your current city while waiting to move, but maybe you can enjoy planning out the logistics of getting settled in your new city when the time comes and finding great things to explore when you get there! ",
            "Good for you, I know it was probably hard to leave him, but at the same time you have to make yourself happy, and you mentioned that he could find a job practically anywhere. It can be hard to find a job in the field you're in especially if it's a small town/rural area. Just think on the plus side, at least you didn't decide to stay and end up with kids down the road never knowing where you could have been.",
            "You did the right thing but sometimes the right thing to do is not the easiest.\n\nResentment can kill relationships quite as effectively as distance unfortunately. You are too young to be saddling yourself with a load of regret about missed chances.",
            "Made the right decision. 7 months isn't nothing. BEST OF LUCK! 😁😁😁",
            "congrats ! new opportunities for your life are going to open up, though it ended like this you will find that these new opportunities are going to really make you happy :) ",
            "I wish you the best and hope it really works out for you! I wouldn't be surprised if your ex ends up missing you so much, he decides to join you.",
            "7 month relationship with a 30 year old who’s dating a young college girl? \n\nYeah nah you do your thing. Dudes like that only care for you being young. ",
            "You did the right thing. I read the original post and I feel like he was telling you that he did not see the rosy future you did, which is understandable since you really don't know each other all that well yet.\n\nPlease don't hide yourself away. Start doing new things if you don't want to go to social events - you are a young adult so practice \"adulting\" - going to places and events you haven't had the time for or hadn't considered before. Museums or art shows, small comedy or musical venues, hiking or SUP meetups, anything that expands your world and gets you with people that think and live a different way than you have been with your ex. You might surprise yourself with growing and it will get you in a good head frame for making new friends in your new city.\n\nCongrats on making a tough decision and not throwing your future away on a fantasy! I'm sure everyone including your ex has a newfound respect for you and I hope you do too!",
            "Leave him do what’s best for you hun ",
            "Financial stability takes precedence in life. You have to take care of yourself, be stable financially and emotionally as a result to be a strong relationship partner.",
            "I'm happy for you and I think you're making the right decision, but don't listen to all these people citing the age difference and the length of time you were together. It's OK to be sad and to grieve this relationship--especially if you got on so well, and you were both emotionally invested. Your feelings are real and they are normal. It's going to be hard for a bit, but it will get easier.\n\nYou've got this. ",
            "Enjoy your new adventure.",
            "Just want to say that being single in a new town can be a lot of fun! Congratulations on your new job. ",
            "Careers are important. Boyfriends are not",
            "Right decision. Now go have some rebound action. ",
            "You definitely made the right decision!!! ",
            "[deleted]",
            "[deleted]",
            "You made the right choice. I know it's hard, but good luck. I'm CA based if your job is here; PM me and if you're in the area, we'll meet for coffee! ",
            "[deleted]",
            "I'm really glad you made this decision. I've ended relationships due to my moving around, and it sucks and is terrible, but it's almost always the right choice. (And now I have the most amazing fiance who matches me so much better than those other people anyway.) If you need a listening ear, I'm here for you!\n\nGood luck with the last few months and the move!",
            "Good for you! I’m going through something similar where I got dumped, essentially, and I realize that he would’ve been a Fair-weather husband. You deserve a love where he supports your dreams and helps you accomplish them! Not being willing to stay with you while you pursue your career goals and a dream job that will help you further your career is his weakness, not yours!! ",
            "you made the right choice. he’s s loser, date someone your age",
            "Uhhhh I don't mean to be insensitive, please don't take it that way. ",
            "There are tons of people who would be willing to help. Find the city your moving to’s sub reddit and ask if anyone would trade like,\nHome chores or something for a room.\nPeople are amazing and verification of someone not being a psycho is easy-ish nowadays.\n\nWe did it for a friend of a friend of about 10 other friends down the chain. We had clean dishes and sheets and he got to get used to the city so he knew where he’d want to live",
            "Mmm ok. Perhaps my comment was a bit harsh on you. Sorry for that. It sounds like you love him more than he loves you. You should just do what you want to do. Whatever makes you happy. It sounds like if the roles were reversed you would do anything for him. Doesn't sound very fair. Good luck. I hope it all works out for you. ",
            "You made the right choice. \n\nTo quote Blink-182 “I guess this is growing up”. \n\nAlso, if you see your Ex with someone else while you are still in the same city it will only mean that he didn’t love you like you thought he did. ",
            "So... your other post was 10 days ago, you guys amicably split up, and between then and now he’s *already* seeing someone else? Dang, you definitely made the right choice taking that job. ",
            "You made the right choice!",
            "Very exciting good luck! ",
            "Good for you best of luck ",
            "Yay! So happy you made the right choice! ",
            "You’re 22 and he’s getting old, leave him and live your life! ",
            "It will twist his heart too.\nTake up dnd. Find some people on the internet in the town you are heading to play online.\nIts a fun mindless hobby that will make you friends. \n",
            "You absolutely made the right decision. You have to do what is right for you. The right man wouldn’t hesitate to move if it meant supporting you in your advancement (so long as it doesn’t hinder his career of course). The fact that he wasn’t even willing to try speaks loudly. \nGo out, have fun. If you see him with another girl that’s even more validation that he wasn’t the one. “The one” wouldn’t replace you so quickly.\n\nBest of luck to you on your move and furthering your career! Proud of you sister!",
            "Why are you hiding away from your Ex, it was an amicable split... ",
            "Money over love. Nice ",
            "Your too young to be stuck with him. Prepare to move on to better your life. ",
            "You really need to find alternate arrangements for your living situation for your mental wellbeing. I was in a situation like yours, and only had to stay for an extra month, but holy shit that month sucked.",
            "Congrats and good luck!  \n\n\nIf he truly loved you, he would have made the jump with you. ",
            "Good for you! Your only 22. Live your life not somebody else’s. His loss. I would still go out, don’t stop having fun your young. I moved away from Pittsburgh when I was 23 and don’t regret it one bit but I do miss the city and the people. Good luck!",
            "It was a 7 month relationship and you are this broken up, and you'll be hiding at home because you might see him with someone else?       The simple fact that he's moved on so quickly should really tell you how important he thought you were. \n\nI think maybe you might want to spend some time with a therapist because your response is quite over the top.  ",
            "[deleted]",
            "Job over love? I know what my choice would be. Clearly you aren't in love. ",
            "If he's really a great guy as you said you should follow your man.  Your new career isn't going to love you.  It's a job.  Can you find someone else?.  Absolutely you can.  Can you find someone as good as the one you had?  That is uncertain.\n\n \n\n Women are constantly being told that they need to pursue career above everything else.  This hasn't led to women actually being happier though and they often end up hitting the wall and then panicking and settling for a someone they don't really love or they just get cats and remain single.  \n\n&#x200B;\n\nWhat happened to love conquers all?  What happened to making some sacrifices to be with the person you love?  What happened to respecting the leadership of your man in the relationship and trusting his judgement?  "
        ]
    },
    {
        "post_id": "9rknqb",
        "author": "ElectricalNobody6",
        "title": "Dumping her [26/F] for failing to believe me [25/M] about being sick?",
        "url": "https://www.reddit.com/r/relationships/comments/9rknqb/dumping_her_26f_for_failing_to_believe_me_25m/",
        "score": 4421,
        "num_comments": 784,
        "created_utc": 1540559998.0,
        "selftext": "My GF and I have been together for about a year. Most everything is great except one thing: If I tell her I'm sick/not feeling well/hurt she refuses to believe me. If I have a cold, she tells me I'm faking it until it goes away and then says \"see, you are fine!\" I'm rarely sick, so it's never been a major issue. But, she has zero sympathy when I'm sick. \n\nShe grew up with hypochondriac parents who were always \"sick\" with something, often self-diagnosing themselves with fatal maladies. She has limited contact with them and the time I met them, I was told (by them) that \"they didn't have long left to live.\" I get it, growing up in that household must have been awful. But, what happened on Sunday just sent me over the edge. \n\nGF and my sister [29/F] wanted to check-out this event and we were all supposed to go. I woke up with excruciating back pain and could barely breathe. GF got so mad at me for \"ruining this\" that she wouldn't speak to me. As she was about to leave I asked her not to leave because I thought something was wrong. She said no and left. I threw up in my bed and eventually called my parents (I was too embarrassed to call 9-1-1) and my mother and brother hauled me to the hospital. \n\nI was whisked back and after ~20 minutes I was diagnosed with kidney stones. Fentanyl and gravol and I had a CT scan and then went for a procedure to bust the kidney stones. (Anyone questioning whether or not to have the procedure: DO IT. The side effects are nothing). \n\n5 hours later and I was laying on my parent's sofa in a haze. I have never, and hope to never, feel pain like that again in my life. I was sure I was going to die. The attending in the ER told me it's worse than child birth and that they've had it before, too. \n\nI didn't text my GF throughout because I really didn't have the strength or foresight. I was drugged up and uncomfortable. My sister found out that I had been in the emergency room and soon after my GF called me. She was pissed off I didn't call her. Then I reminded her that I begged her not to leave as I thought something was wrong. She got quiet and eked out an apology. I got furious and said something rather nasty things.. among them \"f-off\" and some other unsavory things. \n\nIn fairness, I was on dope, still sore, peeing blood and felt like someone had punched me in the gut. Standing was incredibly painful. I needed to take two days off of work & school, I rested in bed and the only thing you can think is \"the person who should have been there didn't even believe me.\" \n\nShe's texted me this week a formal apology and wants one in return for saying nasty things to her. I've been avoiding her texts/calls. I've felt like shit this week and picked something up in the ER so I laid low, took a few days off work and relaxed. She wants to meet tonight and talk about everything, but I'm still so mad I don't know if I should hold off seeing her. \n\nIs this as big a transgression as I feel like it is? Am I blowing this out of proportion because I felt so shitty? \n\nI just am so annoyed and angry. \n\ntl;dr GF didn't believe me something was wrong and I wound up in the ER with kidney stones and needed a procedure. She was mad that I didn't call her (I was too doped up) and then when I blew up at her she felt bad. I'm still mad at her. Am I blowing this out of proportion?",
        "permalink": "/r/relationships/comments/9rknqb/dumping_her_26f_for_failing_to_believe_me_25m/",
        "comments": [
            "If you want to work through this, meet up & hear her out. If she’s focused on getting her apology from you instead of discussing what happened, then I would bail. (Note that I think you should apologize for the specific words you chose to express your anger. I don’t think you’re wrong for being angry, but you could’ve expressed it differently, without swearing at her etc.) If you get through that, I would be interested to hear how she plans to change her behavior moving forward. You had a medical emergency, & she basically left you to fend for yourself. Luckily, we live in the age of phones we can reach form our beds, & also luckily, you have other people you can depend on besides her. But I would want to know how she plans to change her behavior in the future when you’re feeling unwell. \n\nI think it’s possible that this was a wake up call for her that not everyone she encounters in this world will be like her parents & that she needs to work on those issues. But I also think it’s possible that she’s just trying to assuage her guilt here & will end up trying to shift blame back onto you for not doing enough to convince her this was a serious health problem. ",
            "When you pick a partner for life, the very least you should expect from that person is a ride to the hospital when you think you might be dying.",
            "If I asked my SO to stay with me because I had neck pain so bad that I couldn't breathe I would feel SO betrayed if they left. Your reaction is 100% justified. Her first reaction should have been concern for you. In a normal reaction, she should have asked if you wanted her to bring you to the hospital. I get that her past makes it difficult for her to be empathetic in situations like this but she needs individual therapy to figure that out. Imagine if she ever had kids and she didn't believe them when they felt ill... that would be considered neglect. ",
            "OP, I don’t know if you’ll see this but in my personal experience I’ve had three times in my life I needed someone’s support due to medical reasons. 2 were scheduled, 1 was not.\n\nI can’t tell you how much incredible resentment I have for my husband that he wasn’t there for me. I had my wisdom teeth taken out, I had 4 all at once and I was given hydrocodone. He was supposed to tell me to let the doctors office know if I threw up on it. I threw up a lot for about three days because it made me so nauseous. He laughed about it later like “oh hee hee I was supposed to tell you that.” \n\nI had hives break out all over my body and my eyes were swollen. I didn’t even call him to let him know because I’d been begging him to address my needs for emotional support at that time and he just dismissed me. He was upset I didn’t call him but quite frankly I didn’t even think he’d cared at all.\n\nI had bunion surgery (it involves cutting into the bone). His mom is a JustNo who had all these people helping her with the loss of a family friend... I partially understand it. But I had no one. I was at home, unable to move because it hurt so much and I was on powerful narcotics. Truthfully if I needed to I probably would have messed the bed because that’s how much pain I was in. \n\nHe left me alone when I shouldn’t have had to ask for him to stay. Thinking about it now, that’s not something you should have to ask of your partner. \n\nOP, would you risk your life on your gf taking you seriously of your medical needs? Sure she needs counseling, but until she learns to stop dismissing your medical needs... she should do that on her own time and you shouldn’t be her guinea pig until she figures that shit out.  \n\nAlso, you don’t owe her a damned apology. She needs to grow the hell up.",
            "[deleted]",
            "Personally, I would meet up with her and see if she is actually sincere or not. If she is honestly remorseful, maybe this situation has been a wake up call for her and shown her that not everyone is constantly afraid of illness like her parents. Maybe she's seen that sometimes people are actually sick and not overreacting to the extreme every time they complain. If she is sorry and feels bad, I think you should apologize for what you said. You admit you said some very nasty things, and, drugged or not, an apology from you for your words is also warranted.\n\nIf she is more focused on getting an apology and glossing over how she acted.....I would say dump her. Because she'll just keep up the mean behavior.\n\nRegardless, she should probably get some therapy for herself. I can't imagine growing up in a house where you're getting dragged to doctors constantly for very sniffle or perceived illness, and having your parents tell you they're dying all the time. Or being told you yourself are dying. Either situation would be terrifying for a child. I can imagine that would cause some serious psychological damage to a kid. ",
            "[deleted]",
            "I just want to point out that her first reaction after finding out about everything is to be PISSED that you didn’t call her. That’s incredibly selfish and mean. I can understand her being angry that she didn’t know, but she should have understand that you were busy dealing with it, AND her first priority should be concern for you and your feelings in the wake of this health crisis. Instead, her feelings and anger are her top priority.\n\n\nYou are still very young, time to find someone who cares for you. It does take most people growing up to become more considerate. I doubt your current gf is gonna get there soon though. You can do and deserve better than being with someone like that",
            "I’d have to real hard time getting past this. And even if I did, I’d be worried that I’d have to deal with her nonsensical bullshit every time I got sick. Who wants to deal with guilting and doubt on top of feeling physically sick? For fuck sake it sounds like you have to be hospitalized for her to believe you? She can kick rocks. ",
            "Here's the thing, I married a huge over-exaggerator. He will yell \"formerwindow, come quick, there's blood everywhere!\" and I will sprint into the room and there will be two little drops of blood and I'll think *are you kidding me right now?* Everything he says you have to take with a grain of salt. If he says that one of the toddlers had a horrendous accident, they truly just fell, scraped a knee, and popped right back up. It's incredibly frustrating because not only am I the opposite, but I never know when it truly is an emergency. I tend to internalize and downplay everything, so by the time I end up getting help, I'm rushed in for surgery same day because \"it just hurts a bit\" is really \"I've ruptured something.\" We are just two very different people. \n\nHowever, never once have I not been there. I may internally roll my eyes a bit when I discover the \"huge emergency\" is something small and insignificant, but it's small and insignificant to me, not to him. I've driven 45 minutes to his work to pick him up because he had kidney stones (very tiny); conversely, I frequently get them, swear internally a lot, and just go to work. We just have different pain tolerances and ways of dealing with things. \n\nBut my point is this: no matter how minor his problem is, even if it's a paper cut, if he needed me to spend the day cuddling him on the couch afterwards, I would. I might tease him a little, but my job as a partner is to be there for him. I may not understand why everything is an 11 for him, but it is. And yes, it's frustrating. And yes, sometimes I'm not the best wife and I've asked him to stop overstating things as emergencies when they clearly aren't, but if he looks at a scrape on my daughter's wrist as the worst thing in the world, then for a moment, it's the worst thing in the world for me too. \n\nPeople here have had a lot of good advice about finding out what it is she is looking for, whether it's an apology or to give you one. But moreover, I want you to know that I was someone who grew up in a similar household to her. Hell, the night before I got married, my mother \"had a heart attack\" and had to be rushed to the ER. She wasn't having a heart attack. That's just my mom. But that didn't harden my heart towards my partner, just my mom. I'm cautious about her. Not my children. Whatever illness or fad or whatever my mother and her husband talk about goes in one ear and out the other for me, and to some degree, I suppose that happens with my husband as well, but I also take care of him. I encourage him to see his doctor. I get him medicine. I book appointments. I take care of him. I make homemade soups, I get special teas, I coddle him... because he's my partner and that's what he needs. And even if he is faking, what he needs is me. And maybe, with two toddlers and both of us working, I haven't been there for him as much as he's needed, so instead of blowing him off, I'm going to be there as much as I can be. \n\nSo, go if you want to. But don't feel you owe her anything. If you feel angry, then hold onto that, because you have every right to feel angry. When we are sick, we are vulnerable in a way that is terrifying, and she left you alone. You have every right to feel whatever you want to feel. If she is truly sorry, and you are both willing to work together, know that someone who is as cold as her is capable of caring for someone else. It just takes a lot of work and trust, and she has to be willing. ",
            "If you can't forgive her then you can't forgive her. There is nothing wrong with ditching a relationship because of a lack of empathy. It really doesn't matter why she has this problem - that's for her to deal with. What she has shown you quite clearly is that you cannot trust her to have your back with things get rough. ",
            "You aren't. For a relationship to be successful you have to take early behaviour as an indication of future behaviour.\n\nIn the past your girlfriend has shown you that she   doesn't believe you when you are sick. She may have learnt to roll her eyes and dismiss because of her parents but you aren't her parents.\n\nShe has taken every instance of illness you have had as evidence you are like them, and this has lead to dismissing and abandoning you when you had a serious medical emergency.\n\nEven if she's sorry now, she still has to change her behaviour for all those times she dismissed you instead if grabbing you a box of tissues and a blanket and a bit of sympathy.\n\nIf you want with time to continue this relationship then couple and individual counselling for girlfriend to address not every person is like her parents. ",
            "Don't think you're overreacting at all. Yes, she may have gone through some traumatic things with her parents. But it's not your job to be there while she learns how to trust, how to be emphatic, how to care for someone. \n\nAs others have mentioned, you could have died if it was something time sensitive. Imagine your family wasn't available and you had to go through this alone? Incredibly dangerous and stressful. ",
            "Normally I’d try to be a voice of reason and forgiveness, but I don’t think I could get past this. Her issues could have cost you your life. Imagine if it had been your appendix. Or any other emergency issue where her delay might have kept you from lifesaving treatment. You should talk to her, but she doesn’t deserve an apology from you. You were doped up, going through incredible pain, and she still wasn’t apologetic. The second she found out you had been hospitalized she should have run to you and apologized profusely for doubting you. ",
            "You're still recovering! No, don't meet her tonight! If your doctor doesn't want you to go to work, why would he/she want you to leave your sickbed to go have a stressful conversation with your girlfriend?\n\nShe'll just have to wait until you're ready to talk to her. \nShe doesn't deserve an apology. Her behavior was selfish and entitled. She would have put your well being in jeopardy if it had been something more serious.  Hypochondriac parents or no, she effectively showed you that you cannot depend on her.  You are not blowing this out of proportion, and you have a right to be angry. ",
            "Dude, seriously. She left you to basically die. ",
            "I had a kidney stone, and you're right, it feels like you've been stabbed and dying. And I can't imagine anyone, let alone a girlfriend who's supposed to care for you, leaving a gasping, doubled-over person in pain without offering some kind of assistance. While it's not immediately life-threatening, what would've happened if it was? ",
            "I’d be pretty appalled that she still feels entitled to sneak in her expectation that you’ll also apologize. \n\nI think you should meet her and let her apologize. I don’t think you should make any big gesture or apology yourself. You said nasty stuff. How nasty? Like insulted her nasty or told her to f-off nasty? You were on painkillers after an intense experience, in which you hit your limits for both pain and fear. You’re owed some slack. \n\nListen to the apology. I wouldn’t offer one in return just yet. If she prompts for one I’d take some more distance because she isn’t getting it. She abandoned you. She did not believe you despite knowing you are not her parents. And it’s shocking to me that she’d pull the teenage-like “apology swap”. ",
            "Ultimately you feel how you feel. No blame there. I have a question though, does her lack of empathy extend to everything or is it just illness? - Like if you lost a loved one or something really bad happens besides illness does she care then? If so, her parents really did a number on her and not caring about that would be un-empathetic as well. She should find someone to talk to. ",
            "Please give us an update!",
            "[deleted]",
            "Relationships will not last if it is only a relationship when you’re having fun. Life has ups and downs and you need to be with someone who will be by your side when everything sucks and you’re peeing blood. She sounds very cold I think you should reconsider continuing a relationship with her. ",
            "I'd have a real hard time being friends with someone who just ignored me when I said something was wrong (medical emergency).  ",
            "Twice been rushed to the ER for kidney stones that required blasting, so I know firsthand the pain you were in. This would be a dealbreaker for me. Not only did she not believe you, she then proceeded to imply that you were ruining everything and then left you to wallow in your misery. The second time it happened to me, as soon as my husband came home from an eighteen hour double shift, God bless him, I said I needed to go to the ER. No questions asked. He grabbed his keys, turned right back around and helped me to the car. Your girlfriend got pissed because she had to miss her little event and left you alone. Nope. That'd be the last time she'd see me, period. \n\nEither way, good luck with your recovery and drink, drink, drink! You don't want them coming back. (or her, for that matter.)",
            "You're not blowing this up at all, but I think its time to start thinking about what's next because while you are rightfully angry, continuing to dodge her calls seems like a waste of time. Is this an absolute deal breaker? If yes, there's no need to talk is there?\n\n&#x200B;\n\nIf this is a \"I'm still so mad at you but I want to work this out\" then you should communicate that to her in a way which acknowledges that you used words you shouldn't but that the feeling that she left you when you genuinely needed her is something you are struggling with and need her help to acknowledge/accept that what she did and how she reacts to illness generally is unacceptable.\n\n&#x200B;\n\nIf you're holding on to the anger to punish her, I'd think about letting it go because its not a very useful exercise. But it doesn't mean the anger isn't valid, I just feel like \"not talking to her\" is wasted energy. Either dump or talk",
            "Seems like an unreliable other half. If you're riding a bike with one bad wheel, it's not a good bike.",
            "The only way I'd stay with her is if she agreed to go to therapy to talk through the issues she had with her parents as a child. This deep-seated childhood issue clearly still has a huge influence on her, and that's not going to change unless she addresses it with a professional.\n\nIf I were you, I'd talk to her and see how serious she is about changing this. If she's not serious or doesn't think it's a big deal, then I'd bounce. If she seems genuinely remorseful, admits she has an issue, and agrees to deal with it through therapy, then I'd consider giving her another shot.\n\nLet us know how the conversation with her goes!!",
            "Hahahaha -- she wants an apology. How cute.\n\nThat being said. A partner to me is there for you when you need them and it seems like she struggles with this. If you sincerely believe she won't change I wouldn't stay. Next time maybe you die and that's that.\n\nI wouldn't apologize at all. While I would realize I was wrong I wouldn't like her flipping it around on me like she gets an apology also like you're both equally wrong here. You're not equally wrong. She's massively wrong and you said some mean things because she let you down to basically the highest degree you can let someone else down.\n\nTo be honest. I don't think I'd be able to forgive her without holding it against her forever. I sure as fuck wouldn't trust her or make that mistake again and ultimately my resentment over this decision of hers would be our demise. I've learned as I've gotten older that some things just fuck things up for good and this for me would be one of them. You need to look deep inside yourself and find out if you can move past this or not because you'll just be wasting time you could've found someone with a heart.",
            ">My sister found out that I had been in the emergency room and soon after my GF called me. She was pissed off I didn't call her. \n\n>She's texted me this week a formal apology and wants one in return for saying nasty things to her.\n\nYou know, I get that your GF has some baggage from her parents. The thing is, while that would explain her initial not believing you (which is bad enough), she compounded that at every turn with even worse behavior.  First she's mad because she assumed you were faking. Then she's mad you didn't call her. *Then* when it becomes clear how much she fucked up, she demands a tit-for-tat apology from you, which to me comes across as a very bullshit way to deflect from how bad she messed up. That last bit especially is where I went, \"Nope.\" \n\nPersonally? I'd be done. But if you do want to try to come back from this, the ONLY way is if she takes full responsibility for being a jerk, and gets some serious therapy to address the baggage left over from her parents. If she can't take responsibility for making sure this NEVER happens again, your relationship really doesn't have a chance.  ",
            "Last year I woke up one day and my entire abdomen felt awful and I was in a ton of pain. I hate doctors and wanted to wait it out by my SO was there and made me go to urgent care. I ended up having to get an emergency appendectomy so my SO probably saved my life. THAT is what your SO should do when you feel ill, not tell you you're faking and then leave you there. Dump her OP. She's shown her true colors and now is embarrassed that others have seen them too, that's probably the only reason you got an apology. I really think the universe shows us signs when we're with the wrong person and I think this was your sign OP. I hope you feel better! ",
            "That formal apology she texted you. If it was a true, heartfelt apology, it wouldn't contain a demand for a return apology. And neither would the next round of texting. In fact, an apology from you should be FAR from her mind. So, I'm not hopeful that going into this meeting she'll be in the right frame of mind. \n\nShe doesnt get to be angry with you for not forgiving her yet, either. You are not on her timeline. \n\nI do think you can make it work IF she realizes that her reaction stemmed either from her parents, or from just being a shitty person. If she's able to get to that point, she can change. I don't see this meeting making her see that truth, though. She wants an apology from you.\n\nIt's up to you to hold firm to your \"we need to fix this, and it never can happen again\" stance, and don't be drawn into any of the \"yeah, but...\" she'll throw. The response is \"we're not talking about how I reacted to YOUR BEHAVIOR while I was sick and drugged yet. Right now we're talking about what you did, and why you did it.\" And if she keeps on, then \"Ok, it's clear you're not ready to face this yet, and listening to you is just making me angrier/sadder. Let's try again after you have cooled down.\"\n\nYou might have to hold her at arm's length for a while, or simple walk away. ",
            "Okay, so her parents are hypochondriacs but does she think everyone complaining about pain or illness is faking it? Like, everyone sitting in doctor's waiting rooms? Everyone in the hospital? All faking it? \n\nYes, it's a big transgression and no, you didn't blow it out of proportion. I'd have a hard time forgiving that too. I've had a few recent health crises and the worst thing was the feeling of vulnerability and fright, so boy oh boy, did I need support from my DH.  I hated feeling that vulnerable and that scared.  You need someone at that time, and the natural expectation is that the person you love is there for you.  I couldn't imagine if my DH blew me off and left me to suffer alone. It would seem so heartless, cruel, and even hateful.\n\n Take your time getting better and only when you feel you can tolerate talking to her, let her have her say. But I wouldn't apologize for swearing at her. You were freaked out from just having suffered a bad medical situation after having been abandoned by her, and on drugs, so yeah, that's a natural reaction. You're human.",
            "Your girlfriend needs professional help and you need a partner you can rely on when you’re sick. Neither of those things are gonna happen if you stay in this relationship. \n\nThis was a revealing incident and I don’t blame you one bit for being done. It’s unfortunate that your girlfriend’s childhood messed her up so badly, but she’s an adult now and it’s past time to acknowledge that her attitude towards illness is twisted and she needs to fix it if she ever wants a healthy relationship and/or children. ",
            "I have severe chronic pain and sometimes it’s hard for my boyfriend to get exactly what I’m going through, and there’s even been times where he’s asked “are you really in that much pain”, but overall he’s been supportive. It didn’t happen overnight and I’ve had to teach him a lot about my multitude of disorders, but he took the time to learn and when he says something in defence of pain in general, it makes me so proud.\n\nLike you, I woke up after my double mastectomy two weeks later screaming bloody murder. My boyfriend rushed me to the hospital and HE was the one who blurred out SHE MAY HAVE BLOOD CLOTS IN HER LUNGS because *I* was like you were after being on Fentanyl... (I was on dilaudid, Tramadol, Tylenol, and other anti inflammatories). He pretty much saved my life because my lung was fucking dying, and I would have been dead had I waited one more day to go in.\n\nHe refused to leave my side the entire time. I had to insist he go home to sleep because he had been with me 72 hours.\n\nThis is the type of person you deserve. Someone who BELIEVES you when you say you’re in pain. I agree with baffled soap, hear her out. If she’s not willing to listen, I would end it.\n\nOn the flip side, my bf was so sick he looked white as a sheet, he was throwing up and had severe abdominal pain. He was taken to the hospital and diagnosed with food poisoning. Well why did he keep throwing up and barely able to keep down any type of food? I kept telling him something else was wrong and as he did research, I was right there with him and honestly, I’ve had to educate myself (and I correctly diagnosed myself with what has actually been wrong with me this ENTIRE TIME - 4 years) because doctors just didn’t give me the answers I was looking for... so I knew what that was like.\n\nIt was my cousin who gave him his answer, and when he went to his doc they diagnosed him with exactly that.\n\nI hope you are getting rest and that you feel better soon. Again, you deserve someone who believes you when you say you’re in pain.",
            "I had a very very tiny kidney stone in high school and it was just as you describe. Thankfully it passed but I was a complete wreck and have never experienced internal pain like that before or since. I get why she is the way she is - she's got an extremely low tolerance for medical issues. But that's her own baggage to deal with. The fact is, you were experiencing severe pain and begged her to stay with you and she instead scolded you for ruining her good time. To me, it's an alarming lack of empathy. Especially considering you don't get sick often. Caregiver fatigue is a real thing - but that's not what her deal is.\n\nYou'll really have to decide for yourself whether to stick with her or not. But consider, what will she be like if you get the flu this winter? Or if something really serious comes up in the future. Would she think you're faking it if, God forbid, you were diagnosed with cancer?",
            "Fuck her. Unless you called her something deeply personally insulting to hurt her feelings, she doesn't deserve any apology. She fucked up BIG TIME and is lucky you haven't left her already. ",
            "I disagree with the posters saying to give her a chance, and it goes beyond simply the massive problem of her completely abandoning you in your time of need. What I noticed as a common thread throughout your entire post is that whenever something wasn't *exactly* as she wanted it (you being sick, you not calling her, you using more extreme language towards her) her response is always to get angry with you! \n\nSo for me, there are two things at play here: 1) She left you in a time of immense need with zero sympathy, 2) You've basically expressed that whenever any negative happening to you is an inconvenience to her, she'll get mad at you. Do you want to live like that? With a partner that won't give you sympathy when you need it most? \n\nLate at work because of a big issue and you're tired and grumpy? Too bad, she's pissed at you. Broke your leg and now you can't go on that big trip? It would probably be nice if someone would tell you it's okay, and try to make you feel better, right? Not your GF, she's pissed at you. Car broke down and you had to walk 10 miles home and also have to pay to get it fixed? She's pissed because you've delayed saving goals.\n\nYou see the vein I'm going on. Basically, if you can get over this maaaassssive betrayal, can you still live an entire life with a partner who will make every misfortune about them? Can you experience the double hit of negative occurances + these negative occurances incurring your partners' wrath?\n\nFucking run my guy, and find someone who supports you. ",
            "Something similar, although not health-related happened to me with a gf in college... I forgave her, but we broke up soon after.  Something inside me soured toward her and I just.. well.. didn't like her anymore.  I tried to fake it for a month thinking it would pass... But I just didn't like her after this event.\n\nIf your initial anger has settled... when you think about her, how do you feel?",
            "I don't think you can forgive this and it's clearly an annoying pattern. I wouldn't be able to do this either. My ex grew up in a household where his mother was (years later) diagnosed with full blown Munchausen's and Munchausen's by proxy. As a result whenever I was ill or had hurt myself, he had to pretend he had something ten times worse to 'compete'. Drove me mad. \n\nAlso I'm glad you're over the worst of the kidney stones because I know how excruciating they are!",
            "This is a serious issue, yes. I'd actually encourage you to hear her out and see if she is really apologetic or not. It sounds like she knows she screwed up and is sorry. That doesn't mean you have to forgive her, but it's the first necessary condition. The next step would be her showing some signs of working to change.  But, if you're not ready to hear her, it's ok to tell her \"I'm so upset about this that I don't think I'm ready to hear you out.\"\n\nIt maybe this messed up your trust in her. You could get that back with work from both of you, so that means it's up to your commitment to and investment in her and the relationship. Is it enough to make working through this worth while?",
            "Her apology was conditional, so probably not very sincere. I would expect this to happen again. What if you were having a heart attack or some other potentially fatal problem? \"Oh you're faking it\" and walking out is such a horrendous response. ",
            "If my boyfriend was on the couch in pain and thought he was going to die, I cannot possibly fathom leaving him in a huff. It's not even like you're sick a lot where she would think you were also faking.\n\n&#x200B;\n\nHonestly, this would be a dealbreaker for me and I would hope she would learn from it.",
            "Honestly under the circumstances she should be groveling at your feet, not asking you for an apology. Meet up with her and see how she acts. Remind her how selfish she was to leave you, accuse you of lying, and then to blame YOU for not calling her. Only stay if she agrees to get therapy and make serious amends.\n\nIDK I would dump her, she's a terrible girlfriend.",
            "There are plenty of people out there who would give you a ride to a hospital in this situation. Strangers, even. Why stick with someone who treated you like that?",
            ">Is this as big a transgression as I feel like it is?\n\nNo, I don't think it is. You're in agony, and she made it about her, saying you're \"ruining\" her night out. She went anyway, leaving you writhing in pain. (I've had a kidney stone, stuck for a week. I know exactly the pain you felt, and it's no joke.)\n\nWhen she found out you went to the ER, she again made it about her, mad that you didn't call her.\n\nNow she apologizes, but at the same time, wants you to apologize to her for your reaction to all this? No way.\n\n&#x200B;",
            "Holy crap.\n\nThe only thing you should be apologizing for is swearing at her. To echo what everybody else is saying, whether you dump her or not will totally depend on how she apologizes to you. \n\nYou definitely need to stress with her that you totally understand where she is coming from with her parents, but she HAS to trust you. You won't try to trick her, or try to get pity from her, if you confide in her about injuries or illness, she needs to trust you in the same way you'd trust her. It's not going to be something she can change over night, but hopefully this is a major wake-up call for her and something you two can work through together.",
            "Heya. I’ve dealt with similar partner issues, as well as issues of medical professionals disregarding me until it was too late and causing me more suffering. \n\nThis can legit give you ptsd, to varying degrees. That could be contributing to how hard it is for you to let this go. \n\nWhen you’re in that much pain, just that experience alone where your body is basically screaming “SOMETHING IS WRONG SOMETHING IS BAD I MIGHT BE DYING” is enough to contribute to some lasting trauma or even ptsd.\n\nWhen you factor in how wholly dismissed and disregarded you were, and how when you were going through a traumatic experience it was the person who should have been there for you who did it...yeah, that can definitely leave a pretty intense impact. \n\nFor me, being in agony and having an SO and doctors treat me like I was drug seeking until I blacked out from pain made me feel: \n- crazy because no one believed me\n- guilty for whatever I was doing to make them think I was faking it \n- trapped and panicked because I couldn’t fix this and I needed help and the people who were supposed to help me would not\n- trapped and panicked because I did what I was supposed to do and went where you’re told your whole life you’re supposed to go for things like this, and then it didn’t help and they hurt me more and I didn’t know what else to do\n\nI’m sure if you were raised in a more normal family than hers, you grew up knowing that if you were sick and needed help, your family and loved ones had your back. Even if you got in trouble for faking sick to get out of school on occasion, you could firmly trust that when shit got real, they’d be there for you.\n\nYour girlfriend was not. \n\nAnd in moments where your mind is operating in heavy pain and stress, having that lifelong firmly-held feeling of security shattered can fuck you up. \n\nI’m sure consciously or subconsciously, when she’s disregarded your ailments in the past you were annoyed but still felt like if things were REALLY bad and you REALLY needed her, she’d come through. It’s one thing to disbelieve someone or think they’re exaggerating a headache or a cold, but when something severe happens it’s very obvious and you trusted her to be able to use her judgement and see that. \n\nShe didn’t. \n\nSo, not only did you:\n- Have a traumatic and painful physical experience\n- You had a core belief in security damaged\n- You had the hope and benefit of the doubt you’d given her broken\n\nThat is super hard to deal with at all, let alone come back from/repair relationship wise. \n\nYou are not overreacting or holding a grudge because you’re selfish or being passive aggressive. You are probably still processing how some of your core subconscious beliefs of security have been proven to be untrue.\n\nYou need to convey to her that this wasn’t that she just didn’t bring you chicken soup and dote on you when you had a cold. \n\nShe showed you that if you stay with her, you can’t have that security. That the excuses you’ve made for her behavior, and the trust and belief you still had for her to be there when the chips were down were for nothing, and are gone now.\n\nShe needs therapy, and if you guys continue dating I’d honestly suggest a therapist for you as well to deal with getting past this level of betrayal of such a basic fundamental trust. ",
            "My advice is to drink more water ",
            "So you didn't do anything wrong and you don't owe her any apology. If I was in your shoes I would absolutely refuse to apologize for this. This is entirely her fault and you saying nasty things while you were hopped on extreme medication doesn't mean anything. Even if she was the perfect GF and you said nasty things to her while you were beyond high shouldn't require an apology. You had Fentanyl in your system, literally the worlds most potent drug because of a medical emergency.\n\nJust saying if I was in the same situation as you and my wife visited me in the hospital while I was still high and I called her A,B,C. She would be definitely not get upset about it, probably laugh at what I was saying, and maybe record it to laugh at me later in good fun. And definitely not post this nonsense on social media.\n\nNow..... I mean if you really like this girl and this is honestly the first real problem you encountered. And given her history then it's easily forgivable, but I would refuse to apologize.\n\nUsually things are pretty grey and both people are somewhat responsible, but like this is clearly her fault.\n\n&#x200B;",
            "So my dad is a bi polar narcissist with rage issues and would would often fake sick for attention when I was growing up. It got to the point where my mother never believed him anymore when he said he didn't feel good, but because of the trauma of it she never believed it when my sisters and I said we didn't feel good. As a result, we suffered a lot of medical neglect and \"suck it up\" mentality.  I suffered from ovarian cysts as a teenager and never once went to the doctor for it because my mom thought I was being dramatic and trying to ditch school. I still to this day have issues going to the doctor myself and think I'm blowing things out of proportion. I waited three weeks to go see a doctor about my UTI once because I thought they would be mad I was wasting their time.\n\nAs an adult, I have medical issues that could have been avoided if my parents had just listened and taken me to a doctor when I was a minor. But because of my mom's issues I never went. You've experienced how bad her trauma is, what would happen if she was responsible for a child or pet and it got sick? She needs therapy to address these issues before she ends up killing someone through neglect.",
            "She is making this about her. If she understood that illnesses are messy and hard she would have compassion and not request an apology. I truly don't think she understands the severity of what just happened and for me this would be a deal breaker. ",
            "You don't owe a single syllable of apology to her, not until and after she has fully grasped how utterly jacked up her reaction was.  \n\nAlso, if you're drugged post-surgery and still bleeding from the urethra, you don't owe an apology for your tone and word choice.\n\nIf I were you I would seriously question how reliable a partner she can be in the future, given that her reaction to you waking up to a medical emergency was to be angry with you for disrupting her plans.\n\n\ntldr, you are not overreacting, and you don't owe her your dignity while you recover.",
            "You were right to be angry and annoyed with her. she apologized, accept it or don’t, only you can decide that. \n\nIt was probably a lesson for her to trust you more, so it could change things in the future. But where is she now, shouldn’t she have come seen you immediately to take care of and comfort you? \n",
            "I don’t know if this makes me petty, but I wouldn’t apologize if I said nasty things to her unless they were truly unforgivable. She has a lot of nerve expecting an apology after what she pulled. ",
            "Your response to her lengthy apology should be: \"go fuck yourself\".",
            "Honestly I can't imagine her as a mother at this point. If her child is sick is she going to tell them to get over it? What if they're depressed?\n\nI get that her parents were hypochondriacs but at some point you need to take responsibility in changing your perspective and not let the past run your life. \n\nIf this was me I would thank her for the apology but explain nicely that I can't be with her.",
            "You are absolutely not blowing this out of proportion. \n\nIt was kidney stones this time, but what if there's a next time? Would you list your girlfriend as your emergency contact? Are you always going to call your parents when something bad happens? \n\nThis justifies a breakup, because she lacks empathy and will not do things to help keep you safe and healthy. This could have caused some even worse health issues for you and she didn’t even take you to the doctor. Is this someone that you want to rely on when you’re sick? When you need immediate medical attention? I don’t know what you’re looking for in a relationship and partnership, but I have an expectation that my partner will help me out, be empathetic, go get meds, etc., when I’m sick or injured. \n\nI went through something similar once where my girlfriend at the time was less than empathetic and very selfish regarding a major injury I had. It was a symptom of other issues we were having. We are no longer together. I am happily married to someone else who took me to the ER in the middle of the night when I was having a medical emergency. ",
            "Even though I didn't have the same issues as her, mine were similiar.  \nBut instead of having parents that claimed sickness even though it was a lie, my parents treated me exactly like your girlfriend did.    \n\nSo at the beginning, when my boyfriend was supposed to visit me but got sick, the first thing I thought was \"that's not true. He just doesn't want to.\"     \nBut actually saying it? Oh my god, never.    \nEven though I thought it, even though I was angry, I KNEW saying it would be the WORST thing to do, because, what if he isn't lying?  \nSo I pretented it was real.    \nI told him to get better, I gave him advice on how to get better and left it at that.    \n\nAfter a while I stopped thinking this way. I realized how stupid it was. \nHe never even found out I ever felt that way.     \n\nSo I guess what I'm trying to say here is, this has little to do with what she went through and has more to do with how much she cares about you.   \nI agree with most advice that was given here, let her talk.   \nBut keep in mind, that if you feel like she doesn't give two shits about your wellbeing, dump her.   \n\n\n",
            "Is your girlfriend my boyfriend?! I have so been where you are my friend. And it is a shitty place to be! It is like taking fucking crazy pills. If your girlfriend is indeed like my boyfriend, the explanation for her behavior is fairly simple...\n\nShe is self-centered.\n\nThis is not necessarily a moral flaw. This is a strategy she developed in order to look after herself when both her parents remain preoccupied with themselves. They were not there for her. And, in turn, she is not there for anybody else.\n\nIt's a tough problem to address in a relationship. If her self-centeredness is truly confined to illness and injury, it might be one that is solvable. I think you're more than justified to dump her for this; it will be a long hard road for her to become somebody who is reliable and can be there for you. Here's what I did with my partner, to more or less successful effect: I would sit her down and explain to her that her abandonment of you when you need her hurts you and is not tolerable. It will end your relationship if it is not changed. But you can tell her you are willing to work with her to change it. If she says yes, I want to change and be a better partner, than you can move forward.\n\nAsk her to reflect on how she felt when her parents used their imagined illnesses to center attention on themselves. She probably felt hurt, abandoned, afraid and enraged. She probably felt bitter and betrayed. Now connect those feelings to how you feel when she centers the attention away from your needs and onto hers, even when it put your life in jeopardy. It is the SAME THING, even though to her she probably feels that you are trying to take attention from her that she desperately needs. But she doesn't. You are not her parents. Your job is not to put her first no matter what; your job is to be a partner, who cares for her as much as she cares for you. Remind her that helping you when you are sick takes only minutes or maybe a day or two. She will survive putting you first for a short time. The rest of the time, you are there for her. And remind her again and again that if she is not able to choose to believe you and prioritize your needs, the relationship will end.\n\nGood luck!",
            "Her upbringing is an explanation, but not an excuse. Many of us with terrible families of origin work very hard to ensure we are healthy partners and human beings, and to avoid hurting others due to our own issues.\n\nIssues like hers will manifest in other ways in your relationship too. It takes years of therapy to overcome a toxic childhood. So I don’t think she’s capable of change on anywhere near the schedule you would need if you’re going to be able to trust her again, but that’s up to you. Still, in your shoes, I wouldn’t be able to see her the same way again no matter what kind of apology she can come up with. Damage done, you know?\n\nI’m sorry. Her inability to be there for you was her fault, not yours. You deserved someone who believed you and took care of you. That’s just part of what being a girlfriend entails.",
            "This one hits really close to home so it's hard for me not to feel like you're in the right for cussing her out. My mom grew up chronically ill all her life and has almost died (actually legally died) multiple times. People think she's faking because she knows how to \"pretend to be well\" since she'd be beaten as a kid if she showed any signs of vulnerability/illness.\n\nI get sick a lot too. My mom thinks I have the same problems she does, but not to the same degree. It really sucks that I can't carry my weight of obligations sometimes because of how often I get sick... It causes a strain on my marriage mostly because my husband can get swamped if I can't do what I need to do for that time.\n\nSorry I realize I just made that about me for two paragraphs... My point is, I couldn't imagine someone being so awful to you about being in such pain especially since you rarely ever feel ill. I don't think I could stick around for what she said even if she's willing to change. I honestly think breaking up with her could be the kick in the pants she needs to get help.\n\nAlso, you're still angry with her. It sounds like you're curious about what she has to say but not really wanting to hear what she has to say regardless. So why entertain it? \n\nI had to stop being friends with someone because I almost died on a plane with her and she called me a liar about it until the hospital said otherwise. That made her realize she needed help and she started going to therapy and 5 ish years later we are friends again. I don't regret my decisions at all because of that. I get to have her back and have her respect me and my boundaries and now I feel safer communicating with her than I ever did in the past.\n\nWhatever you do choose, don't let her try to justify what she did. I'm so sorry this happened to you.",
            "She punished you for things her parents did. If you hadn't had anyone to call, you could've gotten very seriously even more ill...or died. Kidney stones are no joke. \n\nDump her. ",
            "She sounds like a brat and a not-great partner. I don't think you're overreacting. You don't get to ask for an apology in return when you're rightly told off for being selfish and unsympathetic. \n\nI'd basically never feel like I could rely on her in any time of crisis or emergency. ",
            "Dump her immediatly please. For your own good.",
            "At 26, I wouldn't give her many excuses for mommydaddy stuff. She's a full-grown adult, and this is who she is. Someone who bailed on you while you were in agonizing pain, begging for her to stay and help. Oh and texting you an apology only to demand one in return? Yeah, no. I'd be out.\n\nI'm sorry you went through this. ",
            "Do you plan on having kids with her? Is she going to disbelieve them if they say they are sick?\n\nKids do pretend to be sick. But it's better to at least listen to  them than to just dismiss everything they say.",
            "As someone who was raised by parents of the same nature, I struggle with feeling sympathy towards sick people and hardly ever think they actually are sick. I am very aware of this and constantly try to combat it. I believe the root of this is childhood disappointment: being really excited for things and the morning of, always being crushed with the parent saying “We can’t go, I’m coming down with something.” It was a weekly thing. Built a lot of resentment. \n\nThe thing is, she has to be willing to get help for the invisible damage they’ve done to her or she will continue to allow it to make her annoying to be around in some cases and even cruel. You also have to be open minded and willing to work through the kinks with her. \n\nIn this case, yes, she should have stayed with you. She responded irrationally to a situation that requires rational thought. Should it be a dealbreaker? I don’t think so. Find it in your heart to forgive and try to move forward. She needs a little extra love and patience but also a firm kick in the direction of therapy.\n\nCrappy parents are unfortunate, but they don’t have to dictate how we behave as adults. She can overcome this if she tries. ",
            "This is actually a narcissistic trait. They can’t deal with others being sick and having  an organic reason to have attention. She was obviously too preoccupied with how you were “ruining it” and how your sickness was impacting on her to care for your your welfare. \n\nI’m sorry the one you love wasn’t there for you in your hour of need. This would be a deal breaker for me if my husband treated me like that when I was in so much pain. ",
            "This is not okay. She literally left you when you needed her the most and now expects you to apologize for going off on her? I wouldn’t have not tolerated that at all. You have every right to be mad. This even got me mad and I’m not the one that this happened to. This is a red flag. Do you really want someone who does this?",
            "Kidney stones are some of the most fucking painful things on earth. I just want to say that I've been there, dude, and I'm so sorry you had to experience it. I had a similar experience to you -- woke up, excruciating back pain, threw up, passed out, came to in an an ambulance -- it's UNBELIEVABLY painful. I wish you speedy recovery. Drink LOTS of water and eat a lot of citrus fruits from now on!!",
            "I would be so horrified if I did what your gf did. The fact that she immediately turned that around and wanted an apology from you is just crazy.\n\nTell her exactly how she's made you feel. ",
            "The fact that you were too embarrassed to call 911 speaks volumes. Partners who express disbelief in their partners' chronic pain can be extremely psychologically damaging to the one experiencing problems. This includes making the person more self-conscious about their pain and more likely to downplay it when they talk to doctors.\n\nAs someone with chronic pain, I have experienced this with romantic partners, and it's a really terrible feeling. I hope this either serves as a serious wakeup call for her, or that if she can't manage to get over the problem, you go your separate ways. Good luck!! ",
            "What if you have kids and she doesn't believe they're ill and something happens?",
            "If you don’t want to meet up with her, don’t. Don’t be forced into this if you’re still feeling bad, but honestly, it sounds like she is more interested in you apologizing to her than her being understanding of the situation and granting you a grain of salt.",
            "You shouldn’t have to beg someone to care about you, especially when you are sick. Her event was more important. It says a lot about her and how she feels about you. ",
            "I understand you're feeling very pissed off right now and you have every right to. Damn, I would be too. I don't think you're blowing this out of proportion. It's a kind of betrayal in a way really. \n\nBut I'd advise you to give yourself time to cool down. Making big decisions like breaking up in this kind of emotional state is probably a bad idea. She screwed up big but thanks to your reaction it's probably a wake-up call for her. Up until now she didn't have any strong proof (in her mind of course) of being wrong in her judgement. Nobody ever got hurt or died. Until now. Like you said, her parents probably made her into a person she is and it's gonna take a lot of effort to change that. It's up to you if you decide to stick around to see if she does. But I really advise you to wait until you're calm to make any decisions. \n\nAlso, the thing I would be interested in is whether she'll make it all/mostly about you (which I think she should) or if she'll make the apology you owe her equally important. ",
            "Not related to your question, but speaking as someone who gets kidney stones, you should check in with a urologist to see what you can do to create a plan to prevent them.  Once you have had one, you are at a pretty decent risk of getting another.  I got several before I figured out a good preventative routine.   Once a week, I take a shot of the juice of 1 lime and an equal measure of apple cider vinegar.  It is not pleasant, but for the stones I get, the acid in the shot seems to keep them away (acidic substances can dissolve many types of calcium which is usually what the stones are made of.)",
            "You are asking two questions, if this is such a huge transgression as you feel it is, blowing this out of proportion.\n\nYes and no.\n\nWhat happened was on the level or worse than infidelity. Your feelings are not only valid, they are healthy reactions. \n\nIf you want to forgive her or not is up to you. But in such a serous matter there is no way forward if she is jot able to see the seriousness of what she did, and acts accordingly. \n\nThat would be more or leas the same as for someone who has slept with somebody else. To take total responsibility for her actions, and doing what is needed to mend what she has done. She needs to urn your trust, wait for the time that will take. She will need extensive therapy and a change in bed behavior.\n\nUnless she understands this it would be unwise to be with her. And if course, you might just cut the strings at once if that is what you want. The choice is yours. ",
            "I wouldn't say you're blowing it out of proportion. I mean, when you're in a relationship you want to feel cared for and disrespected, not disregarded completely like that. Ultimately it's just a question of whether you can get past it, how sincere she is and how much you want this relationship ",
            "I think this is a thing where right now she has too much baggage to be a good partner. Maybe if she works hard at unpacking her childhood with a therapist for a couple of years she can get past it? But for you, it sounds like it’s a deal breaker. If you part ways and reconnect in a few years when she is a different person, then fine. But honestly why would you want to be with someone who gets mad at you for being in excruciating pain? I think you should move on. ",
            "do you really want to continue building a life with a person who will leave you when you're asking them to please stay to help you? I don't think there's any coming back from this. I think you should  dump her. You deserve better.",
            "You should tell her what you're thinking. Something like,  \"I like you, but I'm seriously considering dumping you over this.\"\n\nThis will frame the conversation about how she treats you and her past/present actions. If she is willing to have a discussion in this framework good. If she says,  \"But you\" dump her on the spot. ",
            "I would break up with her, not just the fact that she didn't believe you, but also for her reaction afterwards. If my SO was in bed due to kidney stone and I had accused him of lying just hours ago, I wouldn't be blaming him for not calling me and I'd be much more upfront at offering my apologies. The relationship issues are something that can be dealt with when you out of the hospital. \n\nChildhood traumas can be overcome with effort. But her behaviors just showed her self-centeredness and her lack of care and consideration towards you. She's not going to change because she doesn't want to. \n\nI would tell her to give you space until you have recovered. Then meet up with her after you are out of the hospital. If it were me, I'd apologize for the nasty things you've said and end the relationship. ",
            "Mate, just get rid. \n\nYou went through hell yet SHE wants an apology. \n\nNope 👎 ",
            "The advice I would give you is that you might want to apologise for your understandable rudeness after she acknowledges that she majorly messed up and probably has some issues that she needs help for. Kidney stones aren't fatal but there are a few things that cause very severe abdominal/back pain that can be. \n\n&#x200B;\n\nFor myself though, I'm not sure that I would want to continue the relationship under these circumstances. I know that if my partner woke up with extremely severe abdominal/back pain I would be transporting him to A&E myself and would expect him to do the same for me.",
            "My girlfriend didn't really believe me when I was in pain (It was probably from food poisoning), and kept trying to have sex with me, even getting on top of me even though I kept saying no.  It got to the point where I decided to leave and go back home to avoid it.  It really annoyed me.  Your situation is definitely worse than mine was though, and I could totally see why you would want to leave her.",
            "I personally wouldnt get back to her unless she shows total and complete remorse for how she acted.  She shpuldnt even WANT an apology. \nIf i did something as shitty as leave my boyfriend alone when he asked me not to go because he thpught something was wrong, and then it turns put something WAS wrong? Id understand him swearing at me. \nIf i was in the reverse situation i would tell my boyfriend to fuck off! \nMaybe im too empathetic but i really cant imagine  ever doing that to an SO. And if i did i cant imagine ever feeling like i deserve an apology. ",
            "You should not apologize if you don't believe you are on the wrong. The same way you wouldn't tell you are guilty of murder to a judge if you have not murdered anyone. I personally think you were not on the wrong. Pain can really hinder thoughts and your ability to control how you express yourself. So, in a way, it might simply have been impossible for you to not say nasty things to her. Thus, you should not held accountable for such.\n\n&#x200B;\n\nAs for breaking up with her (dumping is not a good way to express ending a relationship imo), you should do it. A serious relationship involves being there for each other and unfortunately I think she won't change that behavior and thought patterns soon. She probably has traumas involving her parents and this is not something so easily fixable. She should see a therapist and all and it's not her fault. But so is not yours. You should not have to deal with her traumas and put up with this type of behavior while she has not fixed this in her, which she might not ever accomplish.",
            "All I could have said has already been said, but damn, just two days off? They made me spend two weeks inside after going through this myself. ",
            "If my SO, that almost never gets sick, asked me not leave because he felt awful and thought something was wrong, there is no way I would leave him alone. Even if it turned out to be nothing. This is a big red flag. You should go see her and see how she trys to handle this. If she is truly apologetic first and is low key about getting an apology from you about how you talk to her, maybe she can wake up from this. If she wants her apology first and tries to minimalize her mistake, I would leave her. Regardless, she needs to get therapy.   ",
            "My first instinct would be to dump her. You can't rely on her in your times of greatest need. If you'd been so sick you were unable to talk or move? How long would you have lain there until someone found you?\n\nBut, if the relationship was otherwise great, i might possibly give her a chance. But only IF it seemed like she really understood the gravity of her inaction, and of her responsibility for fixing her own childhood issues.\n\nI don't think that's the case here.\n\nHer first reaction wasn't a huge apology, followed by a commitment to getting treatment. She hasn't booked in with a therapist. She hasn't gone out and bought any books on the subject. She probably hasn't even googled it.\n\nShe mostly just wants YOU to apologize for the way you spoke to her. You know, at that time you were understandably furious at her for the way SHE'D treated YOU. That's not \"understands the gravity\", that's \"completely self-obsessed\".\n\nSo if you want to end it, I say \"good call\".",
            "Regardless of whether you want to forgive her, it is not sufficient for you to decide to forgive her based on receiving an apology. You also need to talk to her about your feelings about being dismissed when you are sick, you need to be explicit that in this case it led to her leaving you in pain, you need to tell her she needs to accept your own perception of your body and trust you when you tell her things, because you cannot be in a relationship where you are dismissed like this, and what happened to you is a wake-up call at least for you that even when shit hits the fan, your partner is not there for you.\n\nNo one should have to survive in a relationship where their concerns are dismissed like that. A lot of people are suggesting she get therapy so she can take your feelings seriously, and they're probably right that it's the most efficient way to do this, but first she needs to absolutely understand what you have told us thus far:\n\n* she has repeatedly dismissed you when you are not feeling well  \n* she dismissed you in this instance when you asked her for help and said you needed medical attention  \n* you could have died in a similar situation, especially if you hadn't been able to contact someone after that moment on your own  \n* she put you in a situation where you were concerned for your own safety and felt abandoned by her and that it is unacceptable for your partner to leave you feeling like that because they don't believe you when you say you are in excruciating pain.\n\nYou should not talk to her while you are mad. If she holds that over your head, you should leave her. You should organize your thoughts about this, make a list of what you need to be sure is conveyed to her, and have a conversation that _must_ end with you believing that she will work on making the relationship something you are safe in.",
            "If it had been meningitis, you would have laid there and died 😱throw the whole gf away",
            "I would apologize for what you said but if she's not simcere, run the other way. My uncle died of a heart attack because of his wife. She woke him up for work and he told her he felt like he was having a heart attack and she told him to go to work and called him a lazy drunk. She left him there and found him dead when she returned six hours later. You don't want this to be you. You were left alone in pain because she can't see past her issues. I would apologize and ask her to seek out counseling. ",
            "I think you should lay it all out for her like this:\n\nTell her you are sorry for the choice words you used, but not for your anger as you have every right to be angry with the person who abandoned you during a medical emergency.\n\nAsk her how she will change her attitude in regards to medical ailments, as her current attitude isn't acceptable.\n\nIf she doesn't apologise for her actions or tell you how she plans on changing her attitude, it is time for you to move on. I have known people like this and I actively ignore their disbelief at literally any other person's pain. I don't believe she will be able to change. Be very cautious of her behavior.\n\nThis is a very valid reason to break up with her. If you aren't satisfied with her response be prepared to leave her.",
            "Aside from the fact that I would *never* want this person to mother my children, the biggest red flag to me is that she is already asking for an apology from you after she apologized. I mean, sure, you should eventually apologize for saying some nasty things. But what she did was a *huge* betrayal and so awful. I would never forgive myself if I left my husband like this and he ended up being hospitalized for an incredibly painful ailment. Also, you were drugged up and in immense pain on top of being rightfully upset at your girlfriend when you said the things she wants an apology for. \n\nYour girlfriend should be focused 100% on regaining your trust, begging for your forgiveness, and assuring you she will work on her emotional trauma from her childhood that leads her to think no one can ever get sick with anything ever and to not err on the side of compassion and empathy when you say something is wrong.\n\nOnce a bit of time has passed, *then* she can seek an apology for your bad form during the ordeal.\n\nIf your girlfriend seems to be trying to even *remotely equate* what she did with what you did, she is not fully grasping what happened here and lacks a fundamental empathy for you.",
            "My ex-wife’s mother fakes being ill, or having surgery, and all these medical conditions if she thinks people aren’t paying attention to her. My ex never believed me either. One time I was being seen by a Doctor and they check my chest. Apparently I had Pneumonia for a week and it was getting worse. I hadn’t realized it though. \n\nI came home and she pampered me and felt really bad for never believing I didn’t feel well. This sounds great and that it would be a turning point in our relationship. However, everything went back to normal a few months later. \n\nYour GF/ex is likely to never change in this regard. You’ll have to figure out if that’s acceptable you or not. ",
            "Damn OP my bf didnt leave my side when I had wisdom tooth surgery which is nothing compared to kidney stones. I consider myself lucky with him, but your SO should have been sympathetic.",
            "So, 1:she accuses you of faking/lying, 2:tells you that you ruin plans with your illness, 3: she blew you off when you begged her to stay, 4:then upon finding out your in the hospital she gets mad at you for not telling her you went to hospital (Though she would probably have then accused you of exaggerating) then turned it into something about her 5: wont respect your request to be left alone 6: insists you meet up though you are still not well and probably will expect you to drive somewhere while medicated. 7: is demanding an apology from you. I would told her to fuck off too with that shit. I think dumping her is well with in reason. I also kinda wonder if her parents actually were hypochondriac or if she was just doing the same shit to them too. ",
            "Not at all out of proportion. Totally normal and understandable. Cut your losses and end it now.",
            "I think you've every reaso be angry and pretty frustrated that she was very insensitive to your pain, and yelled at you for being sick. I do think it might be a good idea to hear her out, but if you want to salvage the relationship, focus on a few key points. \n\nIs this the only problem? If not, you might be using her mistake as an excuse. \n\nAsk her this: \"Do you believe I've never been sick, or can you accept that sometimes people get colds, or other illnesses ?\"\n\n\"Do you believe I lie to you in order to get your attention or ruin your plans?\"\n\nIf she admits that she knows you don't do those things, she needs to understand she has been calling you a liar all this time, and that she needs to see a counselor in order to understand how to recognize real illness.\n\nIf she can't admit she was wrong about this in the past, she won't believe you in the future.\n",
            "If you do decide to talk to her, something you need to point out to her - is marriage something she is ever interested in? Because there's a piece of those vows called \"through sickness and health\". One of the most important parts of a long term human relationship is to have someone there for you when you are sick, ill, or injured. ",
            "If your partner doesn't have your back, they are not really your partner. She walked out when OP asked her to stay. No way I would welcome her back into my life. No way I would be apologizing for telling her to fuck off. ",
            "If she wants something in return, is what she offered really an apology? I don't blame you for telling her to f off. That was an incredibly shitty way for her to act. An apology shouldn't come with expectations. ",
            "My mom is a gigantic hypochondriac. I mean huge. She should have died so many times. She's currently diagnosed with stress induced memory loss. She forgets stuff that causes her stress which would really piss me off if I hadn't cut contact a few years ago. Here's the thing.  I dont project that into other people.  Myself mostly in that I dont think I'm really sick when I am. If my loved ones get sick I worry, I buy comfort foods, whatever they need. Anything.  I would do anything.  If my coworkers get sick I do extra work. I want them to stay home and rest too. \n\nI have no idea what the fuck is wrong with your girlfriend. ",
            "As a child to a hypochondriac mother who would manifest things happening to her, over and over and over again... this is some serious lack of empathy.\n\nI have chronic pain that my mother chose to ignore, tell me I’m making it up, or how she has it worse and didn’t get me the treatment I needed and made it known it was a burden and how my parents health was far more important than mine.  \n\nDespite that treatment for 20 years I still found empathy and compassion for others suffering. I could tell the difference between genuine and fake thanks to my mother. I developed discernment in spotting the red flags that try not to pop up.\n\nI’d say I’m a caring person, I do what I can to help others. I’m limited in what I can do but I still do what I can and/or pass along any knowledge I have that may serve them well. I want the best for everyone because we all deserve the best, ya know? \n\nI feel like she has to truly work on herself and get past the blinders her parents placed over her. She needs to realize that not everyone is like her parents and shouldn’t be treated as such until proven otherwise. That isn’t fair at all. I’m all for hearing her side of things but the way she demands an apology feels wrong. Like she doesn’t fully acknowledge that what she did was wrong. Sure, you feel like you said the wrong things but the feeling and message is all the same and you wanted to get that across. Being in pain and being on as much medication as you are, you’re not going to be fully present minded.\n\nI think you should wait to talk until you’re feeling better. She shouldn’t get to control when she gets to get her say in. It can wait.",
            "Your partner's first reaction should have been to help, not to sling blame at you and get mad. If she really felt that bad about it she'd have done more than send you a text. And her asking for an apology from you? That's soooo fucked my man. If you want to try to get past this more power to you but this would be an absolute dealbreaker for me and no one would fault you for thinking the same.",
            "She doesn't deserve an apology. She sounds narcissistic. Regardless of her parents if a person can't have empathy they are broken inside. I've had to deal with it before and it made for a journey I shouldn't have taken. Just find someone that you don't have to explain yourself to.",
            "I grew up with a mother who would somehow always be \"sick\" whenever something important in my life came up. Time to go to the DMV to get my drivers license? Nope, she's magically too ill. Need to go to the open house at my college? Sorry, too sick. \n\nI understand where she's coming from and I'm sorry that this escalated to this point. This may have been the moment that she needed to realize that not everyone in her life will pretend to be sick in order to get out of doing things. \n\nI say hear her out, and definitely apologize for the things you said in anger. You guys can work this out.",
            "Yea, this relationship needs to be over. \n\nShe doesn't give a shit about you. That should be a dealbreaker.",
            "Tell her to fuck off.",
            "I don't know, man. This girl responds to your pain/illness/discomfort with dismissiveness then anger. She responds to you being in the ER with more anger. She's got some pretty heavy baggage that is preventing her from showing basic human concern for someone who she claims to love. I'm not sure she should be in any relationship until she gets that shit sorted.",
            "Consider holding off on making a decision or saying things that cannot be unsaid while you are on pain medications and in pain, recovering. You are not in your usual mind-state. That being said, you two definitely need to communicate openly and honestly about your needs and expectations. ",
            "That moment alone in your bed, pained and in dread, sounds absolutely horrifying. I‘m sorry you went through that. ",
            "Apologize for the package the words came in. Let her absorb that apology. Then discuss how hurt you were about her not believing you. Explain that you are not a hypochondriac and that not having a partner trust you when you are in pain is really damaging in a relationship. \n\nI work around kids a lot so I get sick constantly. Everything from just feeling fatigued with sniffles to full blown flu, aches and being unable to walk. My exbf/sorta bf rarely gets sick but whoo boy turns into a huge baby when he does. I make sure to be supportive as much as I can even if I have baggage from my hypochondriac mom. \n\nAlso want to say my partner and I aren't actually together because of how he speaks to me when he is upset. Instead of getting to the point he is very verbally abusive. I'm sarcastic and in turn he spends a whole day belittling me, cursing me out etc etc. Regardless of my remorse. Therapy helps, reflection helps. Pain or not it is no excuse to be cruel. ",
            "Lots of good advice in this thread just wanted to add: you have no obligation to give her a second chance or help her be a better person. If you can't see yourself trusting her after this even if she apologizes and changes, it's really over.",
            "Your girlfriend should be taking you seriously. Hopefully this was a wake-up call for her. If you're interested in making it work, by all means, talk, but if you see this behavior being something you worry about or fear from her in the future, I would quit while you're ahead. You're lucky that this time, it wasn't something seriously life-threatening. \n\nFor some perspective into how someone else's SO might act,, I have a lot of weird health problems, and not all of them are diagnosed as of yet. Sometimes I worry I'm just blowing my own pain out of proportion, but my girlfriend still takes the time to rub the pain out of my joints, and heat up my hot packs, and painkillers. \n\nEven when I have a panic attack and can't breathe, and it's all \"in my head\" she's there for me. She worries when I mention my chest hurting. Is she perfect? No, but she believes me, more than I believe myself sometimes. \n\nThat's what you need in a partner. Not someone who will enable you, but who will validate and support you through real concerns and pain. Your  girlfriend doesn't sound like she can do that. \n",
            "I doubt this will change about her anytime soon. IF it ever does, it’ll be a process and she’ll have to be *committed* to that process. \n\nIF you get all that out of her, do you want to hold her hand through it or find a person who wasn’t scarred by their parents regarding maladies? ",
            "Personally, it would be unforgivable to me. This is not something I would be willing to work on with someone and have it happen a few more times before any real improvement occurred. Basic empathy when you don't feel good should be something you are allowed to take for granted in a relationship.",
            "You're not blowing it out of proportion. Whatever way you feel about it, your feelings are always valid. I'd be super pissed if my SO bailed on me when I asked her to stay because I thought something was wrong with me. It was selfish of her to get mad at you for ruining her plans and then leaving you to go do what she wanted to do. People in a healthy relationship who care for eachother would be filled with concern for their partner.         \n        \nI know people are saying to meet with her and hear her out, but I would wait until my anger subsided and then decide if I wanted to meet with her. ",
            "Everyone is pitching in with their take about her, so I'll spare mine.\n\nCan I just add, the point of dating is to figure out if you want to do something for longer. \n\nIf this is the first time this has happened, at a year in, I'd say it's pretty fixable - if you feel that she seems remorseful enough to try and make up for it. If it's not the first time this has happened, you've got some serious thinking to do.\n\nFor me the biggest problem isn't her abandoning you (although that IS a big deal), it's that she didn't trust your judgement.",
            "That's absolutely ridiculous. Why can't you expect your partner to have sympathy and believe you? I would personally be beyond hurt that this happened, and would consider us incompatible if that was my gf. \n\nLike other people said, perhaps attempt to work through it. To me, though, it's already too late as she did not care when something immensely painful was happening to you. She didn't have sympathy. Only was angry when her needs of a call weren't met. \n\nThere are so many other people out there who would ensure you got to the hospital, were believed, cared for. So many other people out there who wouldn't fly into a rage when *you* are in pain. ",
            "If you're still really hot under the collar, I would agree to talk but ask for a few days to cool off so you can come into this conversation with a level head. \n\nWhile it's generally right to apologize for cussing out your partner, I don't really feel you \"owe\" her an apology Your call there but it seems a bit silly for her to be fixating on that right now. She needs to understand how she's causing real time damage to her relationships due to the baggage she's carrying from her experience with her parents. It sounds like it's bad enough that she would benefit from some therapy over this issue.\n\nPersonally, if my partner didn't deeply committed to dealing with this issue and changing their ways, it would be a deal breaker for me. Her dismissive attitude could literally result in death if you were unable to get to contact emergency services yourself. ",
            "Her first reaction to finding out you had to go to the hospital was anger because you didn’t call her... somehow she managed to make your situation about herself. That in itself says enough about her as a person. She doesn’t deserve you or an apology from you. I’m glad you’re okay!",
            "I used to get this from my ex. \"You're just getting old\" (I was in my 20s, pro tip; chronic pain is not normal).\n\nYou need to speak to her, got to stick by your guns but don't fire",
            "I would move on, if it were me.\n\n>My sister found out that I had been in the emergency room and soon after my GF called me. She was pissed off I didn't call her. \n\nSee, this is almost as bad as her leaving you. Her first reaction to you being in the hospital was to be mad you didn't call her. Not \"oh my God are you OK?\" and all of that. Her her her, it's all about her, your illness was ruining things for her.\n\nThis goes beyond just her refusal to accept someone being sick. When that part was no longer in doubt, she still was worried about herself first.\n\nAnd now her apology comes with the requirement of her getting one in return. Even though you ought to apologize, the last thing she should be doing in her position is demanding one.\n\nHer, her, her. Everything is about her.",
            "Truly, I think all she needs is a while in therapy. Her parent’s ailments, fake or not, have obviously had a large impact on her, and I doubt she realizes the extent of that. She needs help reconceptualizing those issues and getting perspective on why it’s so difficult for her to be empathetic when people are sick. She’s not inherently fucked up or anything, but she needs to address this because it will come up again and again in all of her relationships. \n\nIf you want to work through this with her, that’s what I would suggest. Encourage her to see someone for a while about the baggage from her parents and hopefully you can both move on. If you can’t forgive her, that’s fine too, but I think this or variations of it will just happen again unless she actually tackles her hang ups.  ",
            "While what she did was extremely unfair, and this was a serious matter that she did not aid you in, and you have every right to realize this is not a good fit for you moving forward, given her past you can choose to work on together instead, as long as you both actually work on it. \n\nI know how family can fuck you up. Realize that her parents behavior was ingrained in her from an early age and did a lot of shit to her, that may not be easy for you to ever grasp fully. She probably didn’t even know what normal was for a long time. She still might not. I know what it’s like to not be understood by others who weren’t rewired at a young age by their parents. I also know what it’s like to not understand them because of it. \n\nGiven her history, she can go to therapy, or make a genuine effort to reconcile her past in interest of her future. But only if she recognizes this and makes an honest effort at communicating with you and moving to take action against what has her mentally blocked against all illness. Because maybe next time you could die because of her inaction and that is not healthy.",
            "I would not be able to look at my partner the same after that. You're not wrong to be this upset.",
            "I’d be out. You don’t want to deal with her bullshit every time you are sick. And what if something serious were to happen to you? Would she just assume you’re “faking it.” She seems obnoxious",
            "No, you're not blowing it out of proportion. She is not a good mate. Imagine what would happen if you'd become disabled after marriage. Get someone who is sympathetic.",
            "So a couple things I have to say about this. First, I think you are absolutely justified in how you feel. I would be furious if someone did that to me.\n\nSecond, this is probably a huge issue for her. How we're raised has a major impact on people even later in life. I doubt it even occurred to her that people can get legitimately sick. She's constantly on her guard for the faking because that's all she knows. Getting over it will be difficult.\n\nThree, she realizes she fucked up, and that's huge. Lots of people would go on saying you were faking it. This may be the event that makes her realize how wrong she has been all the time. It does happen. \n\nYou're 25. If you're at the point in your life where you were thinking about a future with her, then I think it's worth it to meet up and see if she is really sincere in her apology. Everyone has baggage, this is hers,is it's up to you if it's  something you want to deal with. If you haven't thought about a future with her and don't want to deal with anyone's baggage, then I don't think it's worth your time.",
            "She really let you down. You have every right to be mad/sad and I feel for you.\n\nYou have to have your beloved be there for you at times like these.\n\nHopefully she realizes now that she is going to need to get help in getting through the damage done by her parent's hypochondria. \n\nUnfortunately she potentially did irreparable damage to your relationship. \n\nDoes this feel like something you can get past if she genuinely sees her error and mends her ways?\n\nSorry you went through all that. Speedy recovery and good health to you.",
            "Run. Don't walk away my dude.  You have one life to live. Don't waste by going out with or marrying a headache.  ",
            "Just find someone who doesnt require formal apologies every time you ask for their help and they tell you to no, this sounds exhausting. ",
            "You're not overreacting.\n\nI'd tell her how you feel (still shocked and hurt she did that, still too angry to talk to her about this, ask for some more time to calm down before you can talk about this). Don't be petty about how much time you need, but don't be afraid to admit you need space to process what happened.\n\nIf she's actually remorseful and if everything else is going well maybe it's worth working through this one issue. If her wanting to talk is really about her just looking for you to make her feel better about everything (focusing on you apologizing, trying to justify her reactions and downplay what she did, or something along those lines) then I don't see this improving any time soon. ",
            "I say dump her. It shouldn’t be your problem that she can’t get over her past. Alot of people have grown up in homes where they’re physically and emotionally abused and are still able to grow out of it and move on. Not only does this girl has issues but she seems unable to empathize.\n\nIts like had the circumstances not been in your favor, you very well could have died and she doesn’t seem to realize how serious the situation was if she still wants an apology. ",
            "She's crawling with FLEAs and needs therapy stat. Hopefully this breakup will motivate her to seek professional help, because you're certainly not obligated to stay with her and she's not in a place right now where she can be a supportive partner.",
            "Health anxiety is a real and serious mental health issue. Growing up in such an environment I’m sure was traumatizing, but you have to be a damn sociopath to not only walk out the door on someone who is clearly ill, but to be pissed about it too. \n\nI wouldn’t continue the relationship unless she seeks therapy. ",
            "When someone tells you who they are, believe them.\n\nI'm sorry that she was raised by hypochondriac parents, but to project those issues onto you is unfair.  I'll be honest, my husband is a bit of a hypochondriac, but the two times he's been in enough pain to ask me to take him to urgent care, I've done so quickly and willingly.  \n\nI'm not saying she \"left you to die\", because on the surface back pain is often not indicative of serious danger.  However, she saw you in a lot of pain, threw a tantrum about you ruining her event, and then left you to fend for yourself.  That's just cold, and I don't think I would be able to forgive it.  She then doubled down by getting angry that you didn't call her when you were doped up post-procedure?  Nah, bro.  \n\nFinally, I wouldn't even be able to sincerely apologize for cussing out someone who treated me that poorly when they claimed to care about me.  Unpopular opinion maybe, but I think she deserved to hear how you really felt.",
            "You probably need to break up. She doesn’t connect to you in away that allows her to be nurturing. This woman can’t make a family with you. People don’t change because you want them to. People change because they need to. Even then it is hard and takes time.",
            "Damn. Even when my mom fakes pain for attention, I would help those in pain or sick because I'm aware my mom isn't those people.\n\nIt's understandable that she grew up with people like this but it doesn't mean everyone is like this. Especially if you have never lied before about being sick. Makes little sense to believe everyone is like her parents without rationalizing that it's just her parents that are like this.\n\nShe needs to talk to you about this. If she doesn't reflect and take steps to change this way of thinking than dump her.\n\nAdditionally: Like someone said, imagine having kids with a person who doesn't believe her own children are sick and in pain. ",
            "One of the reasons people pair up is for the compassion they receive when they are sick. She gives you no compassion. Speaking only for myself, I would end this relationship immediately. You have nothing to apologize for. And don't use the drugs you were on as an excuse. Had she remained and helped you, you would not have lashed out at her. She is 100 percent at fault here. ",
            "I think you did the right thing. Find someone more sympathetic and loving.",
            "I think telling her to fuck off is pretty reasonable in that situation, and her wanting an apology for that is pretty lame. Her carelessness and lack of empathy could've cost you way more than your hurtful words cost her. She should be remorseful, not trying to keep score",
            "Ghost this girl asap bruv.",
            "Have people in your life  you love and respect who  will \\*always\\* have your back. If I were in your shoes, I'd end the relationship. I've spent too much time in my life with people who aren't supportive to waste another moment with someone who isn't. \n\nNot only did she not believe you, she accused you of being sick as though your plan was to ruin her day. Then, despite your plea, she left AND had the audacity to read you the riot act for not contacting her sooner. She didn't call and say \"I'm so sorry I didn't take you seriously, what can I do to help?\" She was upset you hadn't contacted her already. \n\nAnd with a week to think this over and despite knowing you were in pain, loaded on drugs, and understandably upset she decides she deserves an apology, too. \n\nThe only apology she'd get from me would be \"I'm sorry I've spent so much time with someone with so little compassion and incapable of empathy.\"  \n\nLots of people have fucked up childhoods: that's not an excuse to fuck everyone over in your present. She needs to check that baggage and sort her shit. ",
            "First of all, I wouldn't apologize at all. If she has a problem with that, bail. This is all on her complete lack of empathy. \n\nSecondly, if you want to give her a chance, you need to focus on how she wants to change her behavior in the future. Especially kids, etc.",
            "You're getting a lot of good advice that I agree with, and I just wanted to throw in a little side note. When I had surgery last year, the pain meds they gave me (tramadol) seriously fucked with my emotional regulation. I had zero patience and was so angry all the time. It took about 3-4 days after I went off it to start feeling like myself. \nYou said you're still feeling super angry, and you have every right to, but if you're not feeling like yourself yet there's nothing wrong with putting off a discussion with your girlfriend until you feel like you can get through it without losing your temper. ",
            "She either legit thinks you are a liar (leaving you because you're ruining her day).  Or she doesn't think you are a liar, and she is psychopath (leaving you to die).\n\nNeither option is good.  Neither is marriage material, for sure.\n\nThe silent treatment is a cute addition too.  Sounds like she needs some actual therapy.",
            "Nooooooo. No no no.  You ruined something because of a medical emergency? I get being disappointed about plans but this is not okay. \n\nI can't get on board with the \"her upbringing\" crowd. I just can't. OP is nothing like her parents. OP asked her to stay. Then OP had to call his mother, or anyone who wasn't his GF as an option. She abandoned him when he needed it most. And then got upset when he didn't call her. I'm assuming because she got embarrassed being \"the last\" to know when in fact she was the first person to know that OP wasn't okay. \n\nI wouldn't grace her with my physical presence ever again. I wouldn't apologize for cussing either. People are asking \"what if\" questions and that's good moving forward but what about now? OP had kidney stones, something awful for sure, that often times can be given a period of time before seeking medical attention depending on the severity. If it were anything more time pressing OP could be dead. \n\nYou asked her to stay, and she didn't. If for some reason she lacks the mental capacity and thinks she deserves a second (?) chance, I hope you say no OP. ",
            "What makes me suspicious of her \"sincere apologies\" is that she demanded apologies from you too. I don't know her well enough, but you should ask yourself what would happen if you guys decide to build a family and she maintains the same dismissive attitude with your kids? It feels like she has a lot of issues that require therapy intervention, but is she aware of it? Is she willing to change it? And most importantly, do you want to go through all this trouble in your relationship? ",
            "Yeah, I would be pissed as well. There are a lot of layers here, but my simple advice is that I wouldn't meet up with her yet given that you're still pretty angry and still recovering and not feeling well, but give yourself and her a timeframe for meeting up if you want to make an attempt to salvage the relationship.\n\nThe one thing I'll comment on is your GF's lack of empathy for your situation. Sure, her care-meter was calibrated to \"uncaring shithead\" by her hypochondriac parents, but I think after being mad at you for not calling while you're in the hospital, and her making her formal apology couched in requesting an apology from you, are possibly more egregious issues than her leaving you alone in the apartment. Look, I'm sure you said some nasty things that you do need to apolgize for if this relationship is to continue, but who does she think she is demanding that from you? Like, it's fine if she expresses how your words hurt her, but she's trying to keep score and is making a situation that 99% about her being an \"uncaring shithead\" into issues with you. To the extent that you can understand why her care-meter is broken, surely she can understand (now, after learning everything and processing it) that you were drugged up and in the middle of dealing with a health crisis and were still reeling from the way she treated you. Here's the thing, while I'm sure that you said things that were soley hurtful and weren't just an expression of how she made you feel, you being angry was 100% justified and real and points directly to this character flaw she has. I wouldn't blame you for breaking up with her and never speaking to her again. Like, that may be the motivation she needs to get herself into a therapist to work on becoming a more caring person and how to be a partner to a non-hypochondriac person. Like, your anger and what you said should have been a wake up call to her. You don't sound like an emotional or verbally abusive person, and this was way out of your character, and she ought to have thought for a minute \"Why on earth is my otherwise kind and nice BF so mad at me? Is there a chance I did something horrible to him?\". This is something a good partner would do in this situation, try to get to the bottom of it rather than focusing on the symptom. This is why I think the latter two things (her being mad you didn't call and demanding an apology) are telling, and that she wants to talk to you to not understand how you feel and work on repairing the relationship, but to rules lawyer about what you did to her and make you feel bad for yelling at her, all with the goal of her not having to question herself and not having to confront what she did to you. I would be very careful when meeting her. Maybe have your sister there or something if you can trust your sister to have your back.",
            "Here’s what makes this a deal breaker for me. It’s not just that she didn’t believe you and left, it’s that she was *angry* with you for being sick and only focused on herself and how she was put out by your illness. And then she was angry again because you didn’t call her - again not taking into account how you were feeling and why you didn’t call. \n\nIt seems like she has very little empathy, and I wouldn’t want to tie myself to someone whose first and only concern was themselves ",
            "First and foremost, she abandoned you in your time of need. Regardless of her reasons or upbringing.\n\nI realize that she may have acted the way she did due to her encounters with her family, but it doesn't change the fact that she's using that as an excuse to project it on to you.\n\nIf she is sincerely sorry and wants to talk, I'd say give her that chance and hear what she has to say. But, her wanting and asking for the apology to be reciprocated makes me feel like at least some part of her still feels like you were wrong and she is being selfish. (Even though you were harsh in your response to her, I still think it was justified due to what you had gone through and her behavior during and after. Not to say there aren't other ways you could have responded to the situation, but I don't think you were malicious or had I'll-intent). \n\nAs others have said, if you feel like this is something the both of you can work on and move past, then therapy would be a good bet for the relationship to last.\n\nIf I were in your shoes though, I would seriously consider if it was worth it to stay with someone who can be so cold when you really need them.\n\nGood luck. ",
            "If she consistently uses her admittedly terrible childhood as an excuse to act like your needs do not matter in this relationship it might be time to rethink if the relationship is healthy for either of you. That said, whatever you decide, it is best to have a compassionate adult conversation about what happened and your expectations of one another. ",
            "The general comment section consensus seems to be 'work it out with her'. I disagree.\n\nWe all have trauma from our childhood. There's a difference between the people who recognise that and work on it and the people that don't.\n\nI'm nearing 25 and I've had to work through opposite trauma from my childhood - always believing I am fatally ill, health anxiety from not being believed as a child that I felt unwell.\n\nMy point is - I'm nearing 25 and I HAD to work on it. And grow. And get help/therapy. For myself and the people around me. It was hard! But I recognised I had a severe problem and knew I needed help if I wanted to live happily and have functioning relationships.\n\nShe's 26 and I guarantee her relationships failed before this because she treated other men the same. I'd BE SO PISSED if the person I loved more than anyone else in the world didn't believe I was sick. It's like calling you a liar.\n\nTo me, it sounds like she hasn't listened man. There's one comment saying \"she'll probably slip up time and time again\" but does that mean it's your duty to be a lesson for her? To put your life on the line in case you get fatally sick during one of her 'slip ups'?\n\nI think you should prepare for the fact that while you may be able to resolve this as a couple, she may never believe you too...or treat you the way you want to be treated while sick. I mean what if you get a chronic illness! That'll trigger her childhood trauma big time and she might even leave you because she can't handle it.\n\nUp to you how you deal with this but I wanted to offer the alternate perspective and say you NEVER have to stay in situations that hurt you to help someone through their trauma.",
            "- She left you there to suffer excruciating pain while insulting you for ruining her day. You could have died or lost something very important, she did not carr\n\n- After not hearing from you, she got mad because she still believed you were faking it and being dramatic.\n\n- She waited a week to apologize, but her apologize came with an agenda, she believed she also deserved an apology after she left you to suffer, and that her cruel attitude is the same level as you snapping at her because of her own actions.\n\nYour partner should be someone you can depend on in your most vulnerable state. It doesn't matter if she's always there when you're happy or need some small support. If you cannot depend on when you sincerely need their support then what's the point?\n\nI don't believe that she understands truly what she did was cruel, you can come and hear her out, but I have a feeling she might just be pulling up excuses.\n\n\nRegarding your outburst, I personally believe that you just reached your boiling point by her cruelty, plus you were on drug. I don't think you *owe* her an apologize for that, you can still offer an apology if you called her names, but do not apologize for the outburst itself.",
            "To me, it's a huge red flag that your girlfriend isn't insightful or introspective enough to realize that just because her parents were hypochondriacs, that doesn't mean that everyone else is \"faking\" being sick. It's not understandable at all that she doesn't trust you when you say you're sick. You're NOT a hypochondriac. She should be able to separate you from her parents. Anyone with an ounce of wisdom would be able to.",
            "‘You left me to die and YOU want an apology?’ Is what I would want to say, god. ",
            "Dude. Run for the hills. You have every right to be pissed. She does not deserve an apology.  It understand that her parents messed her up but she called him and got PISSED that he didn't call her? That to me is the nail in the coffin in this situation. Like, are you serious? That is all kinds of messed up...if my significant other had to have surgery of ANY kind I would want to see him and make sure that he was okay...not call him and be pissed that he didn't call me right away. I mean if she had blown him off and then called to apologize then yeah I would understand her point if he told her off in the way that he did...but to call someone after they went through surgery only to be mad that they didn't call you is just plain stupid and self centered. She needs help. ",
            "> If I tell her I'm sick/not feeling well/hurt she refuses to believe me.\n\nDo NOT stay with anyone like this, no matter how good everything else is.  ",
            "If I was you I'd hear her out, but definitely not apologize.\n\nYou communicated with her in a clear and responsible way and she ignored it.\n\nWhat would you be apologizing for? \n\nSounds like she might be the kind of person that doesn't understand the weight of a point until one had to scream and shout about it. Is that really the kind of person you want to date?\n\nFor me, I can't handle that. If I say something is important or bothering me, I expect to be taken seriously. If I need to rear my head and roar to show how important something is, I'd prefer to end things instead.\n\nSorry about your experience, man. That sucks!",
            "Sure, telling someone to 'fuck off' isn't the peak of maturity, but your girlfriend is kind of a piece of shit. You have never given her a reason to think you'd fake maladies, and when you begged her to stay she left. THEN she had the audacity to be pissed because you didnt tell her? is she fucking serious dude? \n\n&#x200B;\n\nShe's not going to be sorry, and she sounds like an idiot frankly, sorry to say. this is the equivalent of someone whose ex boyfriend would says, poison their food then assuming everyone who serves her food after is going to poison her, despite no evidence to indicate that. She has as fucking problem. AND she is incredibly rude and entitled to boot. \n\n&#x200B;\n\nI get that hypochondriacs are a pain in the ass (my grandmother is one. we've called ambulances to multiple family events for no reason), but its no reason to treat your partner like they're a lying annoyance. That she thinks she's owed ANY apology in this situation (even for your language, which was merited given the circumstance), means shes unfixably fucked in the head and needs some sort of serious therapy before entering into another relationship.\n\n&#x200B;\n\nIt is not your job to fix her, and it is not fair to you to be in a relationship with someone who is not ever going to help you when youre not well because getting sick eventually, however big or small, happens to everyone. My boyfriend is fit as a fiddle but a few times in the 4 years has come down with a crazy bad cold and needs to be cared for... it's a normal part of relationships. If her childhood has left her unable to fulfill that aspect of companionship... then she needs to kick rocks. ",
            "I have been in two very similar situations. I have cystinuria, which is an extremely rare genetic amino acid processing disorder that causes cysteine kidney stones. These stones cannot be blasted and have to be surgically removed if they don’t pass naturally. Luckily, I’ve always been able to pass them on my own and I am now on medication to prevent the formation of new stones. \n\nI had my first stone at 18 and my experience was very similar to yours. I woke up with excruciating pain in my back, unable to move or walk. I begged my dad to take me to the hospital because I thought I was dying. He refused, and when I threw up bile on my bed he claimed that I was just spitting out water. I finally convinced him to take me to patient first, where they diagnosed the stone but could not treat me. Throughout this I was screaming in pain and vomiting loudly. My dad told me to quiet down because I was grossing people out. By the time I got to the hospital I had passed the stone. I’ve had a very hard time forgiving my father for this, and I still hold onto a bit of resentment, but ultimately our relationship has remained strong because my dad apologized for not believing me, he believed me without question the next time I had a stone, and never once asked for an apology for my screaming and cursing at him. He understands that my yelling and my behavior was completely warranted in that situation. \n\nYears laterI had another stone, again in the middle of the night. My boyfriend took me to the hospital and waited with me for hours, but after several hours in the waiting room  without  so much as a glance from the nurses I felt like the stone had passed and decided to go home and go to bed. A few hours later I realized my mistake when I woke up and started vomiting from pain. My boyfriend is an alcoholic and was struggling with his drinking at the time. As much as I begged and pleaded, he refused to take me back to the hospital. I ended up calling his mom to take me. It was a humiliating and painful experience that nearly ended our relationship, but it prompted my boyfriend to seek treatment for his alcohol problem. After several attempts my boyfriend finally is sober and in recovery, and he feels extreme remorse for what happened. With my most recent stone he took me to the hospital the moment I expressed that I wasn’t feeling well, didn’t bat an eye when I threw up in his car, and stood by my side the whole time. We are now stronger than ever and I know that I can rely on him when I need it. \n\nMy point is that even though these people approached this situation in the wrong way, they have since made up for their mistakes with their actions and by admitting that they were wrong. They never once asked for an apology from me and understood that my anger and hurt were the appropriate response in those situations. Your girlfriend, on the other hand, doesn’t seem to feel this way. From what you’ve written in your post, it seems to me that she feels like you are *both* at fault. This is victim blaming. You do not have to apologize for how you reacted when she treated you like shit on the bottom of her shoe. For those who have never had the pleasure of having a kidney stone before, it can be incredibly scary to feel that pain without knowing what it is and that it’s not life-threatening. When I had my first stone I was mentally preparing myself to die that day. I thought that was it for me. I’m sure you were feeling the same way- remember that feeling. Hold onto it. Do you want to be with someone who not only rolls her eyes at you when you truly believe your life and health are in danger, but then doubles down and insists that you owe *her* and apology for your reaction? I suggest that you cautiously listen to what she has to say. Unless she apologizes, agrees that you are completely blameless in this situation, and takes some big steps towards changing her behavior, then it’s time to say goodbye. People can make up for a mistake like this, but only if they go about it with the right mindset. ",
            "You’re done with her right? I mean - that’s what I’m hearing. She ain’t the one.",
            "It's really cocky for her to ask for your apology for blowing up at her, when she hasn't made one that's been accepted yet, and she's the one in the wrong. \n\nWhatever cruel, out of line things you said, they came from a place of literal physical agony. She doesn't seem to appreciate that.\n\nHer first thought when she called you in the hospital was to get mad at you for not calling her, rather than to put the obvious two and two together that it was  her fault and only her fault you didn't rely on her for help. \n\nIt's your body, your pain, and your relationship. Whatever proportion you blow this situation to, you're absolutely justified for it. ",
            "Nope, your a man and there is about 4 billion of women. It's sucks but it's life.live to learn or don't. If you stand for that you'll think you know what true love but understand it only in movies. Just my 2 cents",
            "You may be together for a year, but she doesn't care about you. Not to be harsh, but how would you handle someone who had just experienced what you did. People react differently, but if you are rarely sick and then have a problem, you want someone there for you, caring about you. You need to make yourself a list of what you want in any relationship and then check out the attributes.\nI can imagine she turns off a switch when someone says they are sick, not not caring but she goes to a dark space where her parents wore her out and down.\nSo I would suggest if this is the only sore point in your relationship you a) apologize. To her because you will anyway. Don't pass it on the drug haze. The fact is you were angry and hurt when you needed her. You need to point out that you are seldom sick, so when you tell she doesn,'t  throw up that wall.\nIf you still feel angry do not meet her but do it later and in a crowd. ",
            "Going to show how the other side sees it. \n\nMy wife has an extremely low pain tolerance and is quick to go to the hospital(thank god my insurance is amazing). She’ll go for a bad cold/flu or if something hurts. She actually has thyroid issues so I give her some slack about it. But she goes to the ER or urgent care probably 3-4 times a year.\n\nI personally have been to the hospital/urgent care 0 times in the last 15 years. I just tough it out and my pain tolerance is abnormally high so being sick doesn’t knock me on my ass like it does her.\n\nThe problem lies in that she asks if i’ll go with her. I understand I got myself into this by marrying her but I just won’t go to the hospital with her. I can’t spend 5 hours not sleeping to sit with her at the hospital because she doesn’t feel good. \n\nIf it ever turns out serious we live 5 mins away from the hospital so she could call me and I can drive over, otherwise I wait at home so she can come back and tell me it’s an upper respiratory infection. She has become ok with this so no big deal.\n\nBut like I knew what I was getting into with my wife, you have to accept that if you stay with your girlfriend than every time you get sick you will be questioned. It’s part of being with her, she’s not gonna change.\n\n",
            "As someone who has suffered from kidney stones, I think you are 100% in the right to be angry.  When I had my worst bout with kidney stones, I called up my shitty ex boyfriend who I was not exactly on great terms with because he was the only person with a car that I knew that wasn't 40+ minutes away.  Even THAT asshole believed me and took me to the hospital.  I would be FURIOUS if I were you, OP.",
            "As a chronic stone sufferer I just want to say I'm so sorry to welcome you to this horrible club. It's the most horrifying pain imaginable and I wouldn't wish it on my worst enemy. ",
            "No. No, no, no.\n\n&#x200B;\n\nYou could hypothetically move on from this, but your level of possible trust and comfort will never be the same.\n\n&#x200B;\n\nMy husband has had to take me to the ER a couple of times, that should be the ONE THING your partner has your back on.\n\n&#x200B;\n\nI'm so sorry, OP. Hugs.",
            "I would ghost her and put her shit out on the porch. She doesnt even exist anymore.\n\nedit: shit not shut ",
            "Yeah break up with her \n\n",
            "Fuck that crap.   \n\n\nNow you got an 'apology', if you have a heart attack in the future you may not live to hear the next one because she will think you're pretending.   \n\n\nI'll drop this person immediately as she is a danger to you.   \n\n\n  \nIf you really love her and would want to make it work, she needs to see a therapist to sort out her upbringing. Like, now. ",
            "She bailed on you for a stupid event when you needed a trip to the ER and then has the balls to be angry because you justifiably got angry with her?  Dude, save yourself certain future headaches and hit the dump button on this one and find someone who's got your back, because she never will.",
            "Nah dude. Get out of there. If she can't believe you in a situation like that. She will always doing you. You can't have a relationship with someone that doesn't trust what you say ",
            "In the long run, being able to be  taken care  of by your spouse while you are sick is a major issue. We all go there in the end, unless we die suddenly.   Our bodies get frailer, more things go wrong.\n\nIt is also important in the raising of kids. Parents have to be sensitive to and responsive to their health issues.\n\nUp to you. I mean it is possibly something she could work through if she was willing to go to counselling with you and see that this is a her problem not a rest of world problem. But there will always be that uncertainty won't there? And you could use that time to find someone who doesn't have this extremely worrying issue.",
            "I had an ex who didn't \"believe\" in getting sick. \"It's all a state of mind!\" He'd say.\n\nOne morning I woke up feeling weird. Told him, \"Something doesn't feel right.\" He told me to toughen up and it'll go away.\n\nTwenty minutes later while driving down the street I have a seizure.\n\nI almost died. In the hospital do you know what he said to me? \"You really need to stop being so dramatic. You were fine when you left. Now I have to drive you around everywhere because your license got revoked!\"\n\nDated him for another six months and had two more seizures before I finally said \"Fuck this.\" Because every seizure basically reset the time before I could get my license reinstated (and it still hasn't been, it's been nearly a decade since).\n\nDon't be a chump. Don't enter into relationships with people who don't take you seriously.",
            "I have had 26 kidney stones. AND gave birth to my son without any pain meds. Kidney stones are worse, hands down. \n\nAlso.important to note-you can die from them. A stone can lodge in your ureter and block an entire kidney leading to sepsis. This happened to me, and with on six days of pain and fever went to the ER again. I was a day away from dying. \n\nYour girlfriend needs counseling to fix her lack of empathy and sympathy. She is broken. ",
            "Give us an update when you can please",
            "> Is this as big a transgression as I feel like it is?\n\nYes.\n\n> Am I blowing this out of proportion because I felt so shitty?\n\nNo. Fuck her and anybody who looks like her.\n\nYou could have been fucking dying or some shit, and she just walked out like no big deal. It showed a total lack of respect and a total lack of giving a flying fuck about you on any level.\n\nNow she wants you to apologize to her? Give me a fucking break.",
            "It's really up to you to decide if you can work through this. If you can't, I really can't blame you. The level of betrayal that comes with being in such bad pain you think you may be dying and begging your SO to stay to help you, only to have them abandon you in a huff--I think that would be an instant off switch for most people on the love and trust needed to sustain a relationship. ",
            "I’ll just echo everyone else here in the comments and say you have every right to be upset with her. You asked for her help and she left you alone, even if it wasn’t something so excruciatingly painful I would expect my partner to stay if I was so distressed that I didn’t want to be left alone. She acted immaturely and it makes sense for you to reconsider the relationship.\n\nThat being said, she did apologize and try to make things right. It doesn’t sound like she tried to blame you or make excuses, and I understand her wanting an apology for you saying hurtful things (even if your anger was warranted). If I were you, I’d at least sit down and talk with her. If the rest of he relationship is great and healthy this may be something she can work on. Get a proper in person apology from her, maybe apologize for losing your temper (though stand your ground that you had every right to be angry with her, maybe just acknowledge that saying fuck you to your girlfriend isn’t a productive way to communicate), and see what she can do to work through her issues. If she doesn’t want to truly apologize, won’t work on herself, or tries making the point of the discussion that you hurt her feelings, then you can feel confident that you did what you could to make it work and that it might be time to just walk away from a toxic person.\n\nOnly you know if you can forgive her for how she acted, but I think it’s worth at least giving the relationship one more chance.",
            "She apologized twice for not believing you. Clearly she understands that her behavior was harmful to you and she acknowledges her role in it. If you feel like you’d like to maintain a relationship with her, you can use this as a jumping off point to tell her that she needs to get some therapy to work through her shit, and she needs to trust your own assessment of your own health.  \n\nHowever, you don’t have to date someone if you don’t wAnt to, and you can break up with them for whatever reason you want to. ",
            "Jeeez, that's psychotic, break up with her and find someone who will actually care. That's absurd",
            "Certainly wait until you’re fully medically recovered before making a decision. But I do not blame you if you don’t speak to her until then. A year is a very short time for a relationship. Personally, I’d probably end it; you’re young and there are more compatible women out there. Curious what you  decide. ",
            "This is no way scientific, but I think people have no filter when they're doped after a procedure. You're pissed and your entitled to be. She needs to get over that. Now on to your bigger issue!",
            "Im angry for you. You're not blowing anything out of proportion. Fuck her. You deserve better.",
            "My husband grew up with a mom who had extreme OCD especially with throw up. She would hassle him anytime he was sick \"are you sick? Are you going to thow up? Please don't throw up, please don't thow up!\" He has such a fear of throwing up now that the other day when he thought he was coming down with something he had to pull over the car because he was shaking so bad. I have never in the 8 years we been together seen him even come close to a breakdown. But he was full on having a panic attack at just the idea of being sick. A guy who is generally very well together. But it is a real issue for him even after all these years. \n\nYour girlfriend probably had some legit PTSD from her parents and has strongly associated sickness with attention speaking. However, this should be her major wake up call that her parents messed her up. This is an issue she needs to deal with for very obvious reasons. What if she had kids and they got sick? Would she deny them health care because she thought they were faking it? \n\nYour hurt is totally justified and understandable. This is a pretty significant issue. Your loved one should be there for you through everything holding your hand, especially though the bad times. \n\nThat being said, this is her bad time as well. If you don't feel you can accept her for it, then ending things may be the right choice. But if you are going to love her you will have to accept that this is a big issue for her as well. She will need to learn the difference between a hypochondriac and a real emergency. For your own safety, and so that she can support you during those times. In return you will have to learn how to support her to overcome this PTSD. If you work together I think you will have a stronger relationship because of it. \n"
        ]
    }
]