[
    {
        "post_id": "517bj9",
        "author": "_sad_dad_",
        "title": "UPDATE: Me [60 M] with my daughter [19 F], she hasn't had a single friend since middle school and I am starting to get worried",
        "url": "https://www.reddit.com/r/relationships/comments/517bj9/update_me_60_m_with_my_daughter_19_f_she_hasnt/",
        "score": 4403,
        "num_comments": 63,
        "created_utc": 1473042599.0,
        "selftext": "My original post can be found here: https://www.reddit.com/r/relationships/comments/4l41q0/me_60_m_with_my_daughter_19_f_she_hasnt_had_a/\n\nMy apologies in advance, this got much longer than I anticipated.\n\nHello reddit,\n\nI debated for a while on whether or not I should post an update. On one hand, I don't want to violate my daughter's privacy and trust, but on the other hand, I received countless comments and messages from people telling me how they related to my Mia's situation and wanted nearly as badly as I did for her to find happiness. In the end I decided that while I am not going to tell Mia about this post, I think she would be okay with me sharing vague details in order to benefit other people like her.\n\nSoon after I made my post, I visited Mia and she told me about something she and her therapist had been discussing. Mia said that if she was going to be alone, even if it was just for a little bit longer, she at least wanted be happy with herself. (I think she worded it as saying that was the person she was hanging out with the most, so she needed to like them). So instead of pursuing friends for the time being, she was going to make herself happy.\n\nWe made a couple appointments for superficial things, she got her teeth whitened and her hair dyed. She also bought some new camera gadgets so she could start practicing photography.\n\nThen came the really big decision. She told me she wanted to start taking classes at a different college (film school). I don't know why it never occurred to me but it seems like a natural choice given her love for film.\n\nWe were only a few months away from when this school's semester started, but because they were small and somewhat under the radar they were very accommodating towards us and I managed to enroll Mia in 3 classes for the fall semester. I was very stressed during this time, but it ended up being worth it.\n\nAnyway, Mia started school and is absolutely loving it. The best part, and the reason I am making this post, is because she instantly attracted a bunch of new friends! Mia is very shy so I can tell she's a little overwhelmed by all of this attention all of the sudden, but she is obviously very happy. Instead of teary skype calls she now gushes to me about how her day is going.\n\nYou guys were all right. She just needed to find a common interest to meet new people and make friends, and that interest turned out to be movies. \n\nI hope this helps those of you who messaged me, and I also hope you now know that even if you think you will be alone forever, don't give up! Maybe you just haven't met the right people yet. \n\nThanks again reddit.\n  ---   \n  **tl;dr**: Mia has friends now!",
        "permalink": "/r/relationships/comments/517bj9/update_me_60_m_with_my_daughter_19_f_she_hasnt/",
        "comments": [
            "[removed]",
            "Aw this makes me so happy! You sound like an awesome Dad for doing your part in helping her out :) ",
            "Mia has a new haircut and friends at her new film school, that nice boy successfully asked out the cute deaf girl in sign language, this is just a really great night for me.",
            "I read the previous post about this, and now the update... I'll admit, this update actually made me a little teary.\n\nGood job OP, you sound like an awesome dad =)",
            "Excellent news!\n\nWe had a bit similar situation when it was the time to pick up upper secondary school. She didn't have much in common with her class mates and all her friends were in another school and they got to meet quite rarely.\n\nShe has always had interest in drawing and painting, and we encouraged her to apply for a school with art program. She passed the entrance exams and got accepted. Her new classmates are all of artistic type and they understand each other way better. She's got new friends as well and school is great again.\n\nI'm glad your daughter was able to find interesting subjects and new friends also.",
            "This post is the best. You're a great father.",
            "I remember your post! I'm so glad it all worked out well. Good luck to your daughter in her new school :)",
            "This is the sweetest update ever.",
            "Good on you, OP, even if she doesn't make a career in film, she'll get her confidence up, build friendships and that will help her get through life.  ",
            "awww I never saw this post, but I similarly had very few/no friends for most of my childhood and totally blossomed in college.  Actually maybe the reason I'm a college professor now....cause when I got to academia and I met people with my same interests I was like \"OMG these are my people!!\" and I never left. :) ",
            "I didn't see the original post, but after reading it and this update, I'm glad to hear Mia found her niche!\n\nOn a side note, I'm in my 40s and most of my friends wear a lot of vintage and retro wear.  If she likes dancing she can check out swing dancing in her area, or vintage clubs and societies, depending on the eta she prefers.",
            "I just want to say that this is great but stay vigilant. She may struggle when things get hard because if various life dramas that occur in all friendships which she has very limited experience with. A situation where she is stuck in the middle if two fighting friends, for example, is harder to deal with as an adult if it didnt happen to you several times in high school. ",
            "I wish I had a dad that cared about my well being like this.  No matter what, your daughter has something girls crave, a father who is there for them.\n\nI'm so glad your daughter is doing better 😊",
            "I'm so happy for the both of you! What a wonderful update.",
            "I haven't seen your first post but wow. You are a great dad. I hope it continues like this for Mia, I am really happy for her!",
            "I'm so happy to hear she is happy, I had a similar experience and college has been great for me! I wish my parent were as supportive as you!",
            "I love this! Great job, both of you!",
            "I spent two years at a college I thought was my dream college absolutely miserable and thinking something was wrong with me because I was having an impossible time making friends. Decided last minute to transfer and its been the best decision of my life. Happy to hear Mia is finding her way.",
            "Oh, I love it when OPs update with good news.\n\nSo glad that your daughter found a place to belong. She's really, really lucky to have someone like you. :)",
            "What a great update. Sounds like she has found her niche. :)",
            "Yay!!!! I'm so happy this worked out, I was worried this girl peaked in middle school or something.",
            "This is wonderful to hear! :)",
            "You are a fantastic dad, so supportive and caring - I wish mine was half the man you are!\n\nAll the best, and congratulations again.",
            "This makes me so happy! You're a terrific father! ",
            "It's so nice to hear a nice outcome",
            "You're a really great dad! Happy for you and your daughter (:",
            "This is exactly what dads are for.",
            "This warms my heart. You are such a good dad and an amazing person.",
            "Congratulations! I hope that I can be a father like you for my son(1y) when he needs me, and i wish i had a father like you. You are a Winner in your Life!",
            "Very happy for your daughter (and for you - what a relief to see her thriving.)\n\nHer joy and enthusiasm getting into a field of study she enjoys are probably infectious and attracting more positive energy and friendships. How awesome.",
            "A+ in Advanced Parenting! I'm really glad that you did the superficial stuff as well as the more important film school enrollment. Kids can be really superficial unfortunately, and a new haircut and teeth-whitening probably opened doors for your daughter and I'm sure gave her a lot more confidence. I'm really touched by this post and update. ",
            "You seem like such a wonderful dad, this is a great update!",
            "You will only be happy when you find happiness in yourself. Good for Mia!",
            ">(I think she worded it as saying that was the person she was hanging out with the most, so she needed to like them)\n\nThis is actually the best advice for someone who's struggling wtih not making friends or not finding a new relationship. Try to find a way to be happy with yourself. Which, believe me, I know feels impossible.\n\nIt sounds like she has a fabulous therapist, and a great dad. ",
            "Wow, OP. I wish all parents were as great, encouraging, and supportive of you. I hope Mia knows how lucky she is to have you for a father.",
            "Those 'worlds best dad' trinkets were made for you, you're a great person. ",
            "I am so very happy for her. It is SO hard to find your niche and form meaningful friendships, I'm 22 and I'm still figuring it out. Yay Mia! ",
            "Mia probably has aspergers"
        ]
    },
    {
        "post_id": "b3n6y7",
        "author": "TiredWife515",
        "title": "[Update] I (28f) am tired of fixing everything for husband (32m)",
        "url": "https://www.reddit.com/r/relationships/comments/b3n6y7/update_i_28f_am_tired_of_fixing_everything_for/",
        "score": 4395,
        "num_comments": 185,
        "created_utc": 1553149707.0,
        "selftext": "[https://www.reddit.com/r/relationships/comments/9wnsk7/i\\_28f\\_am\\_tired\\_of\\_fixing\\_everything\\_for\\_husband/](https://www.reddit.com/r/relationships/comments/9wnsk7/i_28f_am_tired_of_fixing_everything_for_husband/)\n\nIt's been a few months since I posted about being exhausted by my husband's lack of ability (will?) to makeup after arguments and/or saying cruel and hurtful things. Despite a brief period of \"improvement\" he quickly went back to his habit of what I considered abusive tendencies.\n\nI joined a support group shortly after my original post. A few weeks after that my coworker walked into our shared office and found me crying at my desk...again. I've been friends with CW for a while, careful to talk as little about my home life as possible and for some reason that day I just broke. I let out years of feelings on the poor man and he just sat and listened. Him just being a kind human made me realize how bad I had let things get. Simple kindness is strange to me. People asking how I am and actually caring is a foreign concept that I distrust. I felt (and feel) stupid and pathetic.\n\nIn the past month I felt myself very drastically distancing myself from my husband. He became suspicious, went through my phone, and read my Ejournal. He was furious when he read that I spoke to CW about my feelings, accused me of cheating, and threatened divorce. This time I just said \"fine\". So we're done. I moved into the guest room\n\nA few of the original commenters called BS on the autism excuse he used, they were right. A few nights after I moved into the guest room he stumbled in (very drunk) and said that he had been cheating on me. I don't even care if its true. The second I agreed to the divorce I just felt relieved. I also feel guilty for being relieved but the second I agreed, I realized his s\\*\\*t isn't my problem anymore.\n\nI'm made regular appointments with an abuse counselor at my college who's helping me sort through the nonsense I put myself through. I blame myself largely for enabling his behavior, maybe if I had tried harder to communicate earlier in our marriage we could have fixed it. Or if I had not been so afraid of the fighting and avoided raising issues, we could have made it. I'm not sure but it's not really relevant anymore.\n\nTL:DR: Original commenters called it, he just didn't care enough. Husband didn't change, threatened divorce again, I said \"fine\". We're over, and I just feel relieved.\n\nPS: Bought a lock for my bedroom door as well\n\n&#x200B;\n\nSmall edit: I realized that I failed to mention a few things on why I'm staying in the house: We do have a daughter (9), and kids make things a little trickier. I am in an intense nursing program and only work (very) part time as a tutor. He works nights so our interactions are limited to the two days he has off. I leave before he gets home and when I'm getting home from school, he's out the door. I know it would be best to find a place to stay but the resources in this area are extremely limited. My college is literally in a cornfield.\n\nI also want to thank you all for the support, I have felt so lonely for months and to have strangers be so kind means a lot to me. I'm definitely going to download  that book, \" Why Does He Do That?\", and make the time to read it. \n\nWe were married for 10 years and one commenter did the easy math....Yeah I was 18 when we married, 17 when we met. I was fresh out of a physically abusive relationship, and he was so nice to me.  Again, the kindness and support means more to me than I can express, I'm determined to be a stronger person and trust myself again.",
        "permalink": "/r/relationships/comments/b3n6y7/update_i_28f_am_tired_of_fixing_everything_for/",
        "comments": [
            ">I blame myself largely for enabling his behavior, maybe if I had tried harder to communicate earlier in our marriage we could have fixed it. Or if I had not been so afraid of the fighting and avoided raising issues, we could have made it. \n\nNope. It's more likely that abusers prey on people who are like you: people pleasers who want to go with the flow, who make up excuses when people treat them badly, who have porous boundaries that are consistently violated, and who are empathetic and desperately want to believe in the best of people so they give second, third, fourth chances. \n\nJust like a lion on the plains can sense the weakest, slowest gazelle, so can abusive people sense potential victims. ",
            "\"I blame myself largely for enabling his behavior, maybe if I had tried harder to communicate earlier in our marriage we could have fixed it. Or if I had not been so afraid of the fighting and avoided raising issues, we could have made it. I'm not sure but it's not really relevant anymore.\"\n\n&#x200B;\n\nMaybe if he wasn't such an abusive person, your marriage may have had a chance, but otherwise no, not your fault he's a garbage human being, don't you forget that ok? You're worth so much more than he made you think, once things have settled you'll have the tools you need to avoid the next guy being a dud, and when you're cherished properly you will flourish and love life again!",
            "Good for you OP. Follow through, and enjoy your new life, you deserve better.",
            "You’re going to need a lawyer. Stat. He isn’t going to actually go through with initiating a divorce, he only used that threat to manipulate you. \n\nAbusers are most dangerous when their victim tries to flee. \n\nPlease go to love is respect dot org and read read read. If you really plan to leave, you will need support. \n\nPs. Your situation sounds exactly like mine 20 years ago. I got out and have never been happier. ",
            "I was going to suggest you leave him.  Just saying.  Sounds like you've got a time ahead, but seriously falling in love with yourself is such a wonderful experience.",
            "Your last paragraph before the tl;dr is concerning. You still seem to be thinking that if you had done something differently, he would have treated you better. That's not how it works.",
            "As a person who's autistic and also used to have abusive tendencies (dad was abusive, learned it from him)\n\nHe had no excuse. No autistic person I've been with has never been this cruel. And I've never been this cruel. I have baggage, and I still get autistic meltdowns, but I've learned to communicate and take preventative measures because it's MY responsibility to be a good spouse to my husband.\n\nIf I treated my husband the way your husband treated you I'd honestly hope my husband would leave. I'm SO SO SO glad you left. You deserve so much better than that.\n\nThere's a part of me that hopes you don't get a bad impression of autism because of this, but I know that that might take a long time because you were with your husband for 9 years. \n\nAfter reading this it makes me so happy that you're going to get your happiness and emotional freedom back from this butthole. ",
            "Move out. Even if you have to stay with someone else. Nothing good comes from living with an ex.",
            "I went through something very similar. My ex has narcissistic personality disorder and being with him was hell. If you need someone to talk to, please don’t think twice about messaging me. It gets better, hang in there <3",
            "These books will help you restore yourself.\n\nEmotional Agility: Get Unstuck, Embrace Change, and Thrive in Work and Life\nSusan David \n\nSelf-Compassion: The Proven Power of Being Kind to Yourself \nKristin Neff \n\nRadical Acceptance \nTara Brach \n\n\nGood luck OP, you deserve it.",
            "It might not feel like it yet, but congratulations, OP! Don't beat yourself up too much about the past. Focus on your future and healing. ",
            "Hey i’m so happy for you!\nWhen i left my abusive relationship i felt this relieve too. It feels great to have your own life back :) \n\nOne tip: try to process what went wrong and what he did. Maybe talk with a therapist a few times. When i broke up with my ex, i went on with my life very fast, not looking back. But now, years later i discovered that i actually have a bit of trauma left over from the relationship, which caused some trouble in my current relationship. Now working through that.",
            "Since no one has said it yet. GET TESTED for STDs. Even if you don't think he cheated, you can't trust anything he says anyway. Better safe than sorry.",
            ">  I blame myself largely for enabling his behavior, maybe if I had tried harder to communicate earlier in our marriage we could have fixed it. Or if I had not been so afraid of the fighting and avoided raising issues, we could have made it.  \n\nNone of this is your fault. None of his abusive and manipulative behavior is your fault, and I hope you can move towards treating yourself with the love, compassion, and kindness you deserve. You are NOT stupid. You are NOT pathetic. You've been badly hurt and betrayed by someone you trusted, some who knew how to manipulate you. You're getting out now and that's something to be proud of. \n\nBe well. I am so glad that you have a counselor and a support group. I hope you are able to move out and get the divorce going very soon, and put this piece of shit behind you forever. TheHotline Dot Org has resources for survivors of domestic abuse. \n\nWishing you peace.",
            "Congratulations OP, you're on the road to recovery! That relief you feel? Roll with it. That can be your motivation and catalyst to follow through with the changes you'll be making. I think the lock is a great idea. After that you can start to plan your exit strategy. It will be hard but don't second guess. Getting out is priority number one. You can do this. I believe in you. ",
            "Here’s the thing, you can’t blame yourself in this situation because you really were just trying to make your marriage work before actually going through with a divorce. I don’t think anyone can say that’s wrong to do. Giving up easily and quickly on something you once loved and cared about wouldn’t be a choice most would make. \n\nI do believe that the word divorce should not come up, especially not as a threat during a heated argument. That word should be kept for when it’s really a concern or possibility in a marriage.\n\nAfter the first time that he mentioned divorce, I would’ve drawn up the documents online and just handed them over to see how he reacted. I think your husband would’ve signed them in the moment which would’ve told you a lot and you could have moved forward. \n\nI’m glad you took the steps now to get out of this abusive and negative marriage. It doesn’t sound healthy, happy or fun for either of you. He should seek therapy based on his actions and choice of words. And if he did cheat, which I’m believing he did based on everything you said, then he definitely should go to therapy to figure himself out.\n\nGood luck!",
            "I see you have a lot of comments so you might not see this, but i felt compelled to comment.  I saw your original post and the example you gave to your Husband of fixing cars.  I use that EXACT same example. I usually stress the \" maintenance\" aspect. He watches over the way the vehicle runs, listens for anything out of the ordinary, does preventative work, that kind of thing.  I have not heard anyone else ever use this.  Sorry you are going through this.  Good luck to you.  Believe me sometimes i really want that feeling of \" Relief' also . Hope you have an AWESOME life!",
            "Well good on you!!! Breath that sigh of relief you deserve so much more ",
            "you are freeeeeeee!!!!!! well done for making the hard but right decision !! you deserve happiness and someone to love and cherish you. Now you actually have a chance to find that person. The world is your oyster !",
            " I blame myself largely for enabling his behavior, maybe if I had tried harder to communicate earlier in our marriage we could have fixed it. \n\n&#x200B;\n\nTry to stop blaming yourself, he was abusing you emotionally, that's why you were afraid to raise issues. He literally set you up to ensure that you wouldn't challenge him in case he threw around the divorce word etc. He's a bad husband with abusive tendencies, good for you for walking away",
            "Man please be safe. With this kind of person, staying in the same house as him makes me really worried for your safety. ",
            "For some dumb fucking reason, I stayed in a dysfunctional and toxic relationship for 3 years. I ended that 2 years ago. The past 2 years have been the best years of my life. \n\nYou'll get through this bullshit. Get excited for the life you have ahead of you because it's going to be a lot of fun. ",
            "I’m sorry this is happening to you.",
            ">the nonsense I put myself through\n\n&#x200B;\n\nNope. The nonsense he put *you* through. This isn't your fault.",
            "OP, you did great. It is so hard to leave a relationship when it's been going on so long and you have a kid, but so important. \n\nI'm glad you were able to recognize him using his autism as an excuse to abuse you-- you're absolutely right. Autism doesn't turn people into abusers, he just wanted to justify his abuse. \n\nClassic, that he accused you of cheating because you cried in front of a co-worker, but then it turned out he has been cheating on you the whole time. Cheaters often try to flip the script like that to cover their tracks. \n\nThis was absolutely, 100%, not your fault, so don't take responsibility for his behavior. It sucks right now, and will suck for a while, but it will absolutely be worth it to allow you to heal. You would never be able to heal with him constantly twisting the knife. ",
            "I'm sorry that chapter of your life is over but you certainly should not feel like a failure in anyway. It's hard to move on from a long-term relationship and even harder when assets are involved and you have to delve into the legalities of divorce. \n\nSince you seem open to support groups I would definitely recommend a divorcee support group. There are millions who have been in your situation and struggle with finding direction or even with being able to trust again. It's not hopeless and you will be stronger for it. \n\nI'm sorry this happened but congratulations on being honest with yourself and not letting someone else hinder your happiness. Best of luck to you ☺",
            "I know exactly how you feel and admire you for sharing",
            "> The second I agreed to the divorce I just felt relieved. I also feel guilty for being relieved but the second I agreed, I realized his s\\*\\*t isn't my problem anymore \n\nThis is exactly how I felt the moment my first marriage ended. By the time we got there my ex and I were hurt, angry, blind knots of tension. Then, in an instant, the tension let go. Regardless of what we'd lost, and what we'd put each other through, it was over.\n\nDon't feel guilty for that. Have emapthy for yourself and yor husband, but don't feel guilty over relief. You ran a stress gauntlet. It's OK to be relieved that it's over. ",
            "I am in Your shoes too...I could just throw up in so disappointed I fooled myself into thinking he really cared how I felt. If he did I would have to ask for apologies and even then he doesn't know what he should apologize for. I just want to stab my heart over and over again because it wants so badly for him to love it like it does him and it keeps dragging me back for more. And I give him the same fresh start as always but his trying is going from maybe for a day to not a few hours after he said he would try. I am just tired of begging to be treated with the same concern I do him. I would literally die if I knew I made him feel the way I feel now and he doesnt think I should feel like this. Well I definitely don't want to so I tell him why and I'm being overdramatic. I don't know how he can tell me I'm a worthless piece of shit after knowing I was already having intrusive thoughts about suicide. Funny thing is he keeps saying I don't love him anymore yet I'm still here when I could have left and missed out on all the things he said to me.\n\nHow can you fix a problem in a relationship if when you tell the person what they did and how it made you feel and they turn it around like your attacking them for feeling what they caused....\n\nYou can't. I can't work for nothing. I can't stick around to just be given the few breadcrumbs of acknowledgement he wants to give. \n\nSorry doesn't mean anything when you keep telling me what I want to hear and still doing it again. I'm not asking for an apology I'm asking for a change. \n\nI am obviously not worth it.\n\nI am sad for my baby that I was stupid. I wanted to believe it so I ignored everything for peace until I literally had so much he said about me swimming in my head I started to blame myself. \n\nHit myself in the head because I was so stupid. Now not only is my bestfriend and love of my life tearing me down my brain is too. To cope ive gotten to were I have no memories of days before because the only way to move forward is to bury it. Why am I so in love with someone who can drop me so easily and not even care",
            "This hurt my heart to read. I'm so sorry you have gone through so much for someone who didn't respect you and treated you so poorly. In the end, he is still going out of his way to hurt you which just shows that you made the right choice in going through with the divorce. If you ever need anyone to talk to, send me a message - I'm sure you've gotten tons of offers but I figured I'd throw mine out there as well.\n\nAlso really proud to read of the healthy choices you've made with support groups and counseling. You've got this, the only way from here is up.",
            "You can do it; we're all rooting for you!",
            "I was just in a relationship like that. Your best bet is to leave. He's abusive and is projecting his trauma onto you instead of facing it himself. Run, run for the hills and never look back. You cannot raise a man. He's already grown!",
            "One of my sons is autistic, possibly with Asberger's. This makes him not have a filter when it comes to social situations, but in those situations it almost always leaves him at a disadvantage rather than the other way round. Autism is not a crutch to enable underperformance. If anything we put pressure on him to go beyond what he thinks he's capable of. It's not a license to be rude, annoying, or awkward, because even Aspies can and should learn how not to do those things like everyone else--they just have to work harder at it. We explain to people who may not be aware of his condition that he has these 'tics' but also do not pretend those behaviors don't exist, but try to teach him not to get carried away.\n\nIf your pre-ex husband can hold down a regular job and keep regular friends in his life, the problem is not his autism, because these high-functioning behaviors demonstrate he can turn off his abrasive personality whenever he wants. It also means he never turns it off for you, which should be the one person in his whole life apart from his daughter, for whom he \\_should\\_ turn it off.",
            "I'm really proud of you, OP. That must have been such a difficult choice.\n\n I have a co-worker with an abusive husband (not physical, so she doesnt see his actions as abusive) and I wonder how long she will stay. I fear it will be forever. She doesnt value herself enough to leave and it breaks my heart for her. She confides in me and it's so hard to hear.  Just really proud of you for making the right choice.",
            "> I blame myself largely for enabling his behavior, maybe if I had tried harder to communicate earlier in our marriage we could have fixed it. Or if I had not been so afraid of the fighting and avoided raising issues, we could have made it. I'm not sure but it's not really relevant anymore. \n\nThe way he **chose** to behave all through your relationship is not your responsibility and not your fault. Every time he treated you badly, every mean thing he said, every cruel comment, every single thing... he **chose** each and every one. He's a bad person, he's always been a bad person. There is nothing you could have done, no way you could have behaved, no magical words you could have ever said that could change his **choices or the fact that he is fundamentally a bad person.**\n\nHow do I know he's a bad person? Because NO ONE who is even just a decent person and who loves someone else, really, ever say's something mean/cruel/hurtful even in the most intense of emotional moments and then is incapable of apologizing and feeling terrible for what they said or how they behaved.\n\nHis abuse of you was not about some failing of yours, it wasn't about you, it wasn't personal, hell it wasn't even about your relationship. He has treated every past girlfriend like that, and he will treat every future woman in his life like that too. Because he's a bad person and this is how he treats intimate partners.\n\nHe chose how to talk to you even when he was angry. You think he never gets angry at his co-workers or bosses or random people during his day? He chooses not to speak to them the way he does to you, you think he'd last 5 minutes in a job if he was unable to moderate his behavior and choose his words?\n\nHe is a bad person. His behavior is not your fault. The end of your marriage is not your fault. Don't be so eager to scoop up all the shit he's dropped everywhere and carry it around with you as if it's precious. \n\nI wish you a wonderful new life once you're away from this guy. \n\nAlso, google \"Why Does He Do That Lundy Bancroft PDF\" and read it. I think it will help you out.",
            "You know you deserve better, OP. I wish you the best ",
            "good for you, I am glad you are getting out. I hope you find all the peace you deserve soon!  ",
            "Although my story is different in the details to yours, I recognise the freedom in finally being able to say, \"OK then\" when being punished with the threat of him leaving.\n\n\nGood for you. I'm so proud of you. You're a strong woman who has taken a hard step, but you can reclaim your life and your sense of self. Congratulations :) ",
            "I feel like I could have written this about the relationship I am extricating myself from. I totally sympathize with what you're going through. PM me if you want to chat.",
            "You couldn't have fixed it. Unfortunately you married a wanker. I'm glad you're out.",
            "Good for you! I wish you the very best moving forward, and I think you're on a really good path in terms of working on yourself. I hope your future has all the love and support and validation you desire.",
            "I’m sorry for the loss of your marriage. I am also so incredibly proud of you for realizing your worth!!!!!! ",
            "Proud of you! There are better things ahead for you, I know it :)",
            "Good for you for ditching him. \n\nI feel like I'm seeing more and more people who claim to be \"on the spectrum\" just so they can use it as an excuse to be inconsiderate jerks to others. With a lot of people like that it's not that they can't behave like normalish members of society, it's that they refuse to put in the effort to behave normally. Others are just straight up misanthropes who use aspbergers/autism as their get out of jail free card for acting like assholes. ",
            "I'm sorry if I offend you but I'm glad you left. You deserve better. ",
            "Good judgement comes from bad judgement. Some times going through the lessons really sucks. May your life be all happiness and light from now on.",
            "Wow... Autism might give you a pass on reading a reaction, but once someone tells you what you've said is hurtful, you know. The proper socially acceptable convention is to apologize and adopt that information into your behaviour.",
            "Get out of this situation as soon as you can.  He is not right for you. ",
            "OP there is literally nothing you could have done to save the relationship because a good relationship requires two committed people who respect and care about each other. Your soon-to-be ex husband didn't respect you and only cares about himself, and no amount of effort on your part could have changed that. \n\nYou are worth so much, and I'm so happy for you for seeking out better things ",
            "As a man that's done exactly this to my ex wife. I know where your husband is. I went through the same thing. I changed for a little while, but I just didn't care enough to keep it up. He will change eventually. I did. It took years. I didn't want to grow up. I finally did. You cannot wait for him. It will be on his terms not yours. You're good for standing up for yourself. I blamed her for a lot, but I look back on it a lot, and the more I do the more I realize what a piece of shit I was. How i hurt her. How i could have been better. It's not your fault. It sounds like you did your due diligence to fix things. Don't let him put you down for this. Good for you. Wish the best.  ",
            "Good for you OP! Keep us updated! \n\nIdk if he cheated or not but he definitely said it to knock you down again.",
            "Sending you lots of love OP.",
            "I've only seen this mentioned a few times in the responses, but please move out of the house as soon as you can and stay with a trusted relative or friend.\n\nAbusers are the most dangerous during/after their victim is finally leaving.\n\nIn the meantime, document, document, document.\nDocument anything abusive or threatening by immediately sending a message or text to a trusted relative or friend.\n\nGood luck!\n\n\n",
            "Please don't feel guilty about jack shit. He did wrong. And then he tried to be angry that you confided in someone about feelings you had because he didn't give a shit about how he treated you? He had some nerve. Be relieved. It should NEVER be just *one* person in the relationship that communicates well. That's not how a relationship survives. Calling people sensitive while being *completely* insensitive is a major red flag. Point blank him saying, \"I honestly feel nothing for you sometimes, and I find it exhausting to pretend I care\" should have been your ending point. Good riddance! Celebrate!\n\n&#x200B;",
            "🤗 HUGS for real tho\nThis is a bad time for you. Please, please take time for YOU and take care of YOU and make choices daily to cherish and nurture YOU.\nThat means-\nGood food and plenty of water\nRest/enough sleep\nRelaxing showers or baths\nMusic that brings a smile\nFriends that make you laugh\nMovies that let you escape to a different reality, even briefly\nWalks outside, even just around the block. Breathe deeply. Remember the good in your life and say it aloud. “I am grateful for my job” or whatever it is that makes you feel grateful.\nYou are taking the steps of getting out of a bad situation. On average, it takes 7 attempts for someone to actually get out of an abuse relationship. Why? Lots of reasons. Fucking LOTS. Be ok with the fact that this is a SUCK ASS time and this is one of the hardest things you’ll go through other than loss via death of a loved one. That’s why I am saying- while you are processing, grieving, getting help, assessing the past, etc...please, balance that journey with positive behaviors so you can keep going. If you can take care of you, and build up your own self, it gets easier to ward off the bullshit. Bullshit comes everyday, thousands of times per day...we chose if it gets in or if we say, gross no. \nSo, keep your chin up. Keep making the steps. And take care and love you. Don’t blame you. Love you for who you are NOW, flaws and all. Be your own cheerleader. \nHugs 🤗 ",
            "\\>I'm determined to be a stronger person and trust myself again.\n\nYou can get there and you will!",
            "I'm happy for you OP. you deserve so much better. ",
            "You still use Ejoural?! ... kidding.\nGet your kid away from him now.",
            "Stay strong babe and good luck with nursing school from one nurse to another future nurse. I cant even imagine going through what you are going through while in school, stay on top of things! xoxo.",
            "I’m happy for you and your daughter, OP. \n\nBe prepared for him to not let you go so easily. Make sure you are gathering evidence and keeping it somewhere he cannot touch. \n\nMen like him have a tendency to be sneaky and manipulative. It’s a huge red flag to me that he has been cheating on you. That means he is capable of lying and manipulating way beyond what you could have imagined beforehand. \n\nHopefully you have a good lawyer you can trust. ",
            "I'm not sure what kind of income he makes, but please try to divorce *before* you wind up earning nurse's wages. You don't want to wind up paying him alimony on top of it all. I knew one young nurse that had primary custody after a divorce from her marginally employed husband, and she still had to pay him alimony.",
            "You're doing the right thing. \n\n&#x200B;\n\nThe only thing you are doing wrong, in my opinion, is staying inside the house with him. ",
            "This isnt completely your fault, but you should've attempted to actually subside these issues and communicate. That is truly the only way to end those issues. If he is your husband he obviously loves you, so take it like that."
        ]
    },
    {
        "post_id": "oag0l1",
        "author": "ElegantFlamingo101",
        "title": "UPDATE My boyfriend (18M) drove away (18F) when he saw my wheelchair for the first time",
        "url": "https://www.reddit.com/r/relationships/comments/oag0l1/update_my_boyfriend_18m_drove_away_18f_when_he/",
        "score": 4383,
        "num_comments": 154,
        "created_utc": 1624996741.0,
        "selftext": "[original post](https://www.reddit.com/r/relationship_advice/comments/o2avud/my_boyfriend_18m_drove_away_18f_when_he_saw_my/)\n\nLots of people have asked me for an update, so here I am. \n\nLong story short, he is an ex-boyfriend now. I did some thinking and decided to break things off so I broke up with him over text. He tried to explain himself. He said he panicked when he saw me and didn't know what to do but I didn't think I could get past that incident. He begged me to take him back, but all his efforts were in vain. In the end, he ended up blocked.\n\nNow, I'm enjoying the single life!",
        "permalink": "/r/relationships/comments/oag0l1/update_my_boyfriend_18m_drove_away_18f_when_he/",
        "comments": [
            "Damn girl I hope you popped a wheelie after that absolute boss move. I'm so glad you're putting yourself first.",
            "When I first saw this update I hadn't seen your original post, so I figured this was maybe an online relationship and he's meeting you for the first time, saw the wheelchair and panicked then drove away.\n\nThen I looked at your original post. Nope, he knew you'd been paralyzed and when you asked him for help in getting your wheelchair into his vehicle when he came to see you, he got angry with you then drove away.  \n\nThat's not someone panicking about you being in a wheelchair. That's someone who was being an asshole that didn't want to help you with a very, very reasonable request. And who did something really, really crappy to you making it all about him. \n\nThe fact that he then doubled down on trying to excuse his reaction and to insist you take him back instead of being embarrassed or even having come back to help you says loads about his overall character. Not just in this one situation, but on a long-term basis.\n\nLife is too short for this type of nonsense or to be with people who pull this type of nonsense. Good on you for sticking up for yourself and not tolerating the BS. Also panic and stress don't cause people to become total jerks like that unless they're already jerks to begin with, or at least that's been my experience.",
            "Well, I’m glad you let that loser go. \n\nFunny story though..I was meeting a guy for the first time and after chatting online. He showed up at my apartment to pick me up (I know stupid, but it was like 8 years ago) and I get a text that says “I can’t come to your door, I didn’t know you have stairs.” I was confused and went to look for him. \n\n\nHe hid the fact that he was in a wheelchair. I let him know id be ready ASAP and meet him at his car. I went down and he was gone.\n\nHe texted me and said he was embarrassed. I told him not to be but it helps to be honest up front , so you can avoid those issues.",
            "Yes!!! I remember your post, I’m very happy for you, I agree with the others here I think you did the right thing- thank you for updating us xxx",
            "I think you made a good choice. A good boyfriend would wait to see if you get in yourself. Then if you don't say anything, ask you. Then if you asked for assistance, a good boyfriend would have asked what to do and then assisted.  You are young and a full life ahead to find a good boyfriend.  Be happy with yourself first. Looks like you on your way!",
            "Definitely made the right choice. My ex once told me he would leave me if I became 100% deaf which is a very real possibility. \n\nTwo months after I married my husband I became really sick, he learned all the best ways to look after me. I have to use a wheelchair for long distances and places with rubbish air qualities like conventions and he uses me as a shelf and battering ram (I started these jokes) and we have a great time.\n\nYou'll find someone who will see you for who you are and not your chair, enjoy being single and good riddance to him!",
            "I totally remember reading your original story and I remember a ton of people in the comments were piissed off at him. \n\nHere's my take, if he didn't want to be with you in the long run, that's fine, BUT he COULD'VE HELPED YOU IN THAT INSTANT where you needed to be lifted into his car. THEN LATER, he could've had a heart to heart talk with you and said look I can't do this in the long run, and either remain friends with you or not.\n\nInstead that motherphucker told you he wasn't your maid or personal assistant, I can't remember what he said, to do it yourself, THEN HE DROVE OFF, OH MY GOD. Who does that?! Even strangers would've helped you.\n\nBut there are seven billion people in the sea, YOU WILL find someone who will stand by you. \n\nI don't think you should have broke up with him over text though. You should've did it in person.\n\nIs your paralysis permanent or temporary? \n\nI'm glad you ditched a heartless person. You can't stay with someone like that, you will see his horns come out again in various situations, he won't stand by you or he may eventually leave. \n\nLife's too short, find positive people who will stick with you in the bad ugly times.",
            "I was curious as I never saw the OG story. GOOD FOR YOU OP. My jaw dropped as I read the original post. You made the right decision; I’m proud of you for standing up for yourself, you deserve it.",
            "What an asshole. You're better off. Glad you learned this about him so soon.",
            "I missed your post the first time around, but I think you made the right choice, though I’m sorry it worked out that way. I think he could excuse something like crying or being temporarily speechless as a panicked reaction, but not being a douche, snapping at you and refusing to help you, and then driving away.  That just goes to basic character.",
            "I'm really impressed by your resolve and strength! And glad you ignored the ableist comments that said the stress he was under in his life warranted leaving you and deserved understanding.",
            "I don't want to be a stereotypical gay but... Yaaaassss Queen. Sorry you had to go through that but it just proves how strong you are 💪",
            "I very proud of you OP. I know you'll be fine, happy and successful because you respect yourself and recognize you worth, keep it up.",
            "I’m sorry for what happened and proud of you for being so strong!",
            "Girl, yes! You don'tvdeserve that shit. Finally an emotionally-mature story in this sub. ❤",
            "Good. What a little turd",
            "Good for you. What an assclown",
            "You will never regret this, so proud of you",
            "Now *this* is the good ending I was hoping for.",
            "Missed your first post, but I am just going to say you deserve someone who will be in your corner. Clearly it wasn't this guy. \n\nMay you have better days ahead and continue to grow stronger, OP.",
            "Good job :) Doing great sweety and even I feel refreshed by proxy now that you are free.",
            "Good for you for sticking up for yourself.",
            "Been thinking about you, and am so glad to see this update!",
            "Well done! \n\n& good riddance to him.",
            "I'm not sure I would trust his feelings now, he may be acting remorseful out of guilt for being a total tool to someone who's handicapped.  Doesn't matter, at least you saw his true colors.",
            "Good for you dodging a bad situation.",
            "He left you at your worst, don't let him get back!",
            "him driving a big wheel jeep shouldve been the first red flag",
            "What a piece of garbage. You've done well to throw it in the trash.",
            "Honestly I'm glad to hear you were strong enough to break things off with him. A lot of people have a very hard time with that (me included) so it's nice to see someone stand up for themself. Good for you!",
            "Take no crap sis.  I'm proud of you!",
            "Really happy to read this update. There is no excuse for his behavior.",
            "Happy for you knowing your worth. 👏",
            "I am so glad you left him. I don’t know why I am so invested but I am happy for you! Good job!",
            "Ah yes I remember this post. A good partner would help you when you need help. Good on you for respecting yourself. Enjoy your freedom.",
            "as you should, proud of you!!!<3",
            "He didn't deserve you!",
            "Well, good for you girl!\n\nLife will be hard enough as it is in a wheelchair, no need to drag that extra weight behind you. You're a beautiful young woman who can do a lot better than him.\n\nThe very best of luck with love & everything else in life, you're strong and you've got this!",
            "I was trying to find a reason to not dump on the dude because I can imagine for a kid, this could have been tough for him. (Not as hard as it is for her, of course)\n\nBut the part on the original post where he said he couldn't be her manservant...That's messed up",
            "I’m so proud of you 💓💓❤️❤️❤️❤️❤️",
            "you go girl ! have a wheely good time !",
            "You did the right thing. Good on you.",
            "YEAH. That’s the way to do it.",
            "I remember your original post and I am so happy this is the update. You deserve far better and there are really no excuses for his behavior. \n\nYou’re amazing and I hope you’re enjoying the single life! Happy hot girl summer!",
            "Good. You know your worth. Don't put up with anyone who doesn't know it, too!",
            "Good for you OP!!!! Enjoy being a badass!",
            "Good choice, hope things start getting better for you.",
            "I am SO HAPPY to hear this.\n\nAlso consider jettisoning your shitty friend who said you should give him a second chance!\n\nYou are a goddess and don't ever forget it.",
            "Boss lady vibes here. Good for you!",
            "Glad youre rolling with it",
            "He was aware that you had the accident right?",
            "Proud of you! Don’t look back!",
            "Good on you. Thanks for the update!",
            "[removed]",
            "You're better off because you can do and deserve so much better. Yes it was likely a shock to see you like that but that's nothing compared to the life adjustments you've had to make in the last year. The fact that he just drove off and left you there was so horribly disrespectful that there is just no coming back from it. You will meet so many good people in your life and you're so young! In a few years you'll laugh that you ever considered him boyfriend material.",
            "I remember your post. Good for you! I hope you're living your best life and have *good* people around you.\n\nI'm sorry for the slow winnowing process to get the few who 'get it', and hopeful you make lots of cool new friends who can and will 'get it' forever.",
            "I remember reading this original post and shaking my head.\nGlad you're moving on. Find someone who will value you. Happy for you.",
            "You ROCK!  Wow, you are so strong, and will find someone who LOVES YOU for YOU, chair and all!  Work on you (sounds like you have great self esteem) and fulfilling your dreams, you don't need a man to do that!  Keep friends and family close and build those meaningful friendships/relationships!  I'm so proud of your strength and great inner beauty!",
            "Wasn't man enough, you are better off without him. You are alive and that's what is important, never let anyone treat you this way.",
            "You did the right thing. He clearly showed what he things of disabled people and his attitude was horrible.",
            "You deserve better anyway, gj and gl",
            "Good for you, hun. I'm glad you know you deserve better. Coming from a fellow disabled person.",
            "Before I read your OP I thought maybe he got freaked out seeing you in a wheelchair for the first time being online only and then even first read he was on his way to see his dying grandpa and was going to give him a bit of slack thinking he had a lot going on, but nope. This dude was acting like a complete ass that wasnt really portrayed in this post or title. Like he was not going to help you get into his lifted Jeep or help with your chair and even had the balls to say he shouldnt be your personal man-servant, like what the f\\*ck! So glad you got the right advice and dropped this asshole as it would have just gotten worse with things over time. He is just immature and hopefully he will learn heavily on how not to be in the future with others. You will find someone infinitely better, best wishes!",
            "I LOVE THIS. I didn't read the original post but as soon as I saw the headline of this one I was like \"drop kick him out of here. Punt him into the ocean.\" Life is too short to put up with ableist bullshit!!!!!!!!!!!!!!",
            "Winter must be cold for those with no warm memories.",
            "Didnt read your prev post. \nIf he panicked after seeing your wc and you hadnt told him about it - understandable. \nIf you told him, good for you, good choice!",
            "Didn't know what to do?  You told him what to do, and he said no.  I don't think so.  Congratulations on the end of the relationship, you did the right thing.",
            "Always stand up for yourself 😹",
            "It sounds like you did the right thing. Not everyone wants to be with someone with mobility issues and it's better to find out sooner than later.",
            "i just read your original post there are really terable people out there you just dodged. your last line on your update..Now, I'm enjoying the single life!, couldn't said it any better the fruit is there just grabe it..and enjoy",
            "Um he wasn’t your bf in the first place.  Sounds like some weird online fantasy.   Why was he surprised by your wheelchair?  Did you fail to mention this somehow?   Sheesh.",
            "I have a wife who is disabled, and even though she usually uses a walker, there are times when we were on vacation where we needed to walk longer distances and needed a wheelchair, and it wasn't a big deal. Even flying with it wasn't too big a problem (once we realized where they had the chair getting off at Vegas, that is). I think your ex boyfriend is worried about what other people think if they see his girlfriend is disabled. It shouldn't matter, even if they did judge him (people don't give a shit, trust me), and you deserve someone who realizes it doesn't matter.\n\nP.S. In my nearly 6 years with my wife(married almost 2), of all the people we've ran into over those years, I don't recall anyone looking down on us and judging her for her disability, if anything, people run over and try to help when they see she is having trouble. Then I end up feeling bad if I don't help fast enough to beat them to the punch lol.",
            "I would have done the same If I am interested in a girl without a wheelchair, and she’s permanently now in a wheelchair the workload goes up 10 fold and my attraction is gone",
            "If it makes you feel better. I mean i think breaking up over text is just as bad",
            "Well done..part time wheelchair girl here..whoever is that crappy to you doesn't deserve you.",
            "Seems you were hte one who could nto get over things. I mean 1 mistake and he is over and blocked? I woud not want a girl like htat. I mean that was a hell of a lot for him. He did apologize i mean you at least should have talked to him. I think its so childish to break up over text. I ever have a suitor that did that i would be that much more suspect of her.   \n\n\nI mean do you have guys beating down the door? I hate to say taht but he was willing to accept something many men could not. It is hard to get used to not just for you but also a bf. I mean you can meet someone who knows the situation and it can be hard for them.   \n\n\nI know reddit=dump them but i hope you did not throw away an otherwise good relationship. I am sure he will move on as you know what many friends will tell him \"Sweet heart or not there are many things you would have to deal with that you would not with the typical girl woudl not like being able to walk on the beach. He gives htat up\" Bets of luck dear. He was a jerk but one thing like htat does not make a guy a horrible perspective mate. The way you did it though blocking and everything both of you likely have and are going to move on and that might be the best. He just has many more options and that is sad but reality.",
            "You’re already going through a lot. Glad you didn’t put up with that bullshit.",
            "I don’t know if your injury is permanent or what the prognosis is regarding your physical injury. Regardless, what an absolute jerk. My wife was in an accident years before we met and will always been in a chair. She is an absolute unit. After the accident, her purpose in life just clicked. She knocked out a 4 year degree in 3, earned an MBA, works at a huge firm (is a rockstar), met me/continues to put up with me, and is an fantastic mother to our children. My wife transfers into her car easily, but I get to literally sweep her off her feet every time we take my truck somewhere. Yeah, there are other complications, but we’ve always managed to find solutions. You’ll eventually find the same, but don’t be in a rush. Enjoy yourself and get after it. This is 100% HIS loss."
        ]
    },
    {
        "post_id": "let91g",
        "author": "StudioSixT",
        "title": "UPDATE: M27 boyfriend won’t talk about the future with me (27F)",
        "url": "https://www.reddit.com/r/relationships/comments/let91g/update_m27_boyfriend_wont_talk_about_the_future/",
        "score": 4388,
        "num_comments": 200,
        "created_utc": 1612725424.0,
        "selftext": "Hi guys, I just wanted to thank you all for your love, advice, and support regarding my last post. I woke up yesterday morning and told my boyfriend that either we’re going to have a serious adult conversation about the future right now, or you can pick a time later today. After a bit of back and forth, he picked 5pm. At 5, we sat down on the couch and discussed each of our goals regarding marriage, children, employment, etc. We also discussed concerns that each of us had, I started out with mine and then I think that helped him voice his concerns, the largest of which involved my family (they are complicated). I think me forcing the scheduling of a time to talk helped him open up about his concerns.\nNo, I don’t have a ring on my finger yet, but my goal was to get him to open up about why he didn’t want to discuss it. We ended up talking for about 2 hours and I made clear my timeline requirements and he agreed. I feel like we’re in a good place now. Thanks again for all the love and support ❤️\n\nTL;DR finally got my boyfriend to talk to me about the future and I feel good about it.\n\n[Original Post Here](https://www.reddit.com/r/relationships/comments/ldajij/my_boyfriend_27m_refuses_to_talk_about_marriage/?utm_source=share&utm_medium=ios_app&utm_name=iossmf)\n\nEDIT: For everyone saying that this doesn’t change anything and I should have broken up with him, and giving an ultimatum is going to backfire, etc. I didn’t give him an ultimatum. I never threatened to break up with him. I told him what I needed from him and we talked through a lot of questions and concerns(from both sides). It wasn’t a one-way conversation like you all seem to have assumed. Thank you to everyone for your continued support! I hope those of you who feel like relationship issues can never be resolved find happiness in your own lives ❤️\n\nEDIT #2: For everyone saying that my \"timeline requirements\" sound controlling, you must not be women who want to have children. Sorry, but I'd like to have kids and unfortunately my clock is ticking; I think wanting to be married by the time I'm 30 is pretty reasonable. For everyone saying he's just telling me what I want to hear and will keep pushing me off, I understand your concern, but the conversation we had leads me to believe otherwise. I know that sounds fishy, but without relaying word for word what was said, I don't really know to explain it. Again, thank you all for your comments! You're really helping me think through everything from every angle.",
        "permalink": "/r/relationships/comments/let91g/update_m27_boyfriend_wont_talk_about_the_future/",
        "comments": [
            "This is a great update and I'm glad you two were able to talk. But coming from a person who has been married for 10 years and we still have communication hiccups, please work on communication before you get married. Communication in any relationship, at any time, is hard. And you cannot have a healthy relationship when neither of you are getting your needs met, or when you're not telling each other your concerns without pulling teeth.",
            "This is what I started to do with my husband, we would pick a day and a time for when we were going to discuss important topic or decisions. My husband did not like to immediately start talking about big life decisions in the moment but knowing that there is a discussion that was going to happen allowed him to think about it beforehand.",
            "I read your original post and I remember thinking uh, oh- that's not going to go well. I'm so pleased that I was wrong! Keep up the communication and good luck!",
            "Wow that's actually something that put a smile on my face at the end... The way it started it sounded like things were gonna turn sour at any point onwards.. I'm happy for both of you, that's actually something to look forward to, it's a good thing that u were able to come up with that hard topic that usually puts people on the verge of tears and discomfort and to come out of it unscathed, with a smile in your heart, well that's a Great thing, now your future is ever brighter, I'm deep down happy for you and yuur boyfriend, make the best of it.",
            "This didnt really resolve much for the big question? Seems like he is content with buying more time without giving you an answer to your question of marriage",
            "Do you really wanna be with someone you have to struggle that hard with just to have an honest and reasonable conversation?\n\nWouldn’t you rather be with someone who’s excited to plan their future with you after being together for 8 years?\n\nBig yikes on both the original post and this update. You deserve better.",
            "I understand that you want to get married and want a timeline, but I would strongly caution you against putting any kind of pressure on him to marry or commit to a timeline. Especially if he is the type of guy to not talk about things. It's just a recipe for huge disaster, especially for you. If the guy genuinely doesn't talk to you about marriage or the future, he isn't interested in it. You can create a timeline or say whatever you want, but in the end, you're only in a bf/gf relationship. This means that you and him only have as much say in each other's lives as you let him/he lets you have.\n\nIf you pressure him, mark my words, you're headed for trouble.\n\nYou might ask: What do I do then, if I'm wanting to get married? Then you go find someone that is as excited to commit on paper as you are.\n\nEdit: before you downvote, realize that I'm just speaking from my own experiences as a guy in her b/f's shoes and so I'm playing devil's advocate.",
            "So essentially he can procrastinate until your timeline and then keep pushing it out.",
            "When you say he has concerns about your “complicated” family, what does that mean? What are his concerns? What’s the dynamic? How does your family affect your life?",
            "Sorry, I'm going to be the bummer:\n\nSo, you're still considering marrying someone who will not answer a direct question.\n\nNow you know he will ignore, evade and deflect any problems until you badger him into SIMPLY a conversation.\n\nAnd do you want to live the rest of your life knowing not only that he will evade coversations, he will NOT bring a problem to you on his own?  \n\nMany people just do that.  Even men can say, hey honey I love you but we need to talk about your family.  And even the people who might not feel comfortable to bring it up can ANSWER THE QUESTIONS.  \n\nGive him about 8 more years and see how that goes.  Will he EVER confront a problem head-on?  (And please do NOT have kids with him until you know if he can be a PARTICIPATING Adult.)\n\nEven if he changes a lot but you ALWAYS have to take the lead...  Are you okay living like that?  Forever?\n\nI wasn't.  Sorry if you think I'm raining on your parade but when I'm seeing all these thunderclouds, I'm trying to pass out umbrellas.\n\nBest wishes and take care of yourself.",
            "Timelines dont end well",
            "Sorry, girl, he doesn’t want to marry you. You’re wasting your time. I would start planning my exit strategy. \n\nMaybe he’ll surprise you and get his act together, but I wouldn’t wait around any longer.",
            "OP never really answered the question about why he was not allowing direct communication and not being encouraging about it.",
            "He won't talk about it with you because he doesn't see you in it. You want us to tell you this I normal but you know it isn't, that's why you're asking strangers. Do what's hard (and good for you) and move on.",
            "You just put off the inevitable.  If he doesn't meet your timeline requirements then you need to break it off.  If you give someone an ultimatum, then follow through with the consequences.",
            "Hun you had to force him to tell you what you wanted to hear. Why would you ever think this was a solution? This is just a fantasy he’ll play along with but never fulfill. I’m sorry but this isn’t a win Reddit post. I’m sure more people here feel the same. Just a stall for you to get past it but you’re definitely in no plans for his future. If he alone didn’t come out with talking about the future he decided the future without you a long time ago.",
            "[deleted]",
            "Sorry but I still don’t see this relationship working out.\n\nHe’s gonna be one of those guys that’s given a deadline to propose and then keeps pushing it back and pushing it back until you resent him and leave.",
            "I am in your same situation and my mom and my older brother advised me to move on. I'm just waiting for March when we hit our anniversary, if nothing happens by then I'm moving on. Sucks but it's true, if they don't talk about a future with you it means they don't see one with you or just not ready at all. We have to move on and stop wasting our time.",
            "Why anyone wants to be in a relationship where you have to force someone to want to be with you through ultimatums or \"timelines\" is something I'll never understand. That type of relationship dynamic seems extremely toxic for both people involved.\n\nI only want to be with someone who is genuinely psyched to be with me and shows that through his actions without me having to force it out of him. But to each their own I guess....",
            "He gave you alotta talk. Awesome. Pretty sure that's all it will ever be.",
            "I would ask myself if you want to be with this person, whether or not you get “a ring on your finger.” Also, if someone wants to be with you you shouldn’t have to “put your foot down” to get them to talk to you. They want to be with you, or they don’t. It’s up to you to decide if you want to be with THEM. If you both decide that’s what you want, you make it work. If one person is on the fence, that’s their answer for you.",
            "I'm so glad you were able to have this conversation \nI had the same trouble with my boyfriend, who became my fiance, then my husband. Even after we were married for six years, he wouldn't talk about the future with me- not even about taking a vacation or looking ahead to replace a car that was steadily breaking down or deciding we didn't want kids or career goals or ANYTHING. It was exhausting and got increasingly lonely over the years. Nothing would happen unless I made it happen. No conversations would happen unless I asked repeatedly.\n\n He is now my ex.\n\nWhat I mean to say is not doom and gloom, but that it might be worthwhile to encourage him to get counseling to deal with possible anxieties he might have that could be impacting this kind of thing. I tried to get my ex to, but he didn't until I left him. By that point it was too little and too late. In my own experience, if this is an issue you can address and address thoroughly now, please do. You're not overreacting.",
            "> I think that helped him voice his concerns, the largest of which involved my family (they are complicated).\n\nExcept you failed to get from him the answer to the real question that is holding up everything:  Does he or does he not demand that you cut yourself off from your family before  he agrees to even consider marrying you?\n\nBecause I think he just told you that but didn't tell you in such an explicit way that would make him seem the bad guy.",
            "Ugghh this sounds all too familiar.\nIt's not going to work out in your favour, honey.\n\nBut I hope it does.",
            " I recently implemented scheduled conversations with my husband about money/budget/bills because this topic is stressful for me and when he brings it up at random times I tend to resist having any discussion.  Now that I've retired, and there are a lot of changes to our financial picture, I just can't afford to do this any more, o we agreed to \"lunch on Monday\" updates on this subject.  That gives me a chance to mentally prepare and manage my anxiety and takes away my excuse to avoid participating in this conversation.\n\nNeeding to schedule a conversation certainly is not a reason to end a relationship, as long as the scheduled conversations lead to progress that is satisfactory to you.",
            "Very interesting topics, I've read both of them. Respect to you that you put your own interest first, and you chose what is best for you, even if that is later than sooner.\n\nMy only gripe with this is: You said you guys were together for \\~8 years? It's frightening that in 8 years he did not ask you what you want from life, or expected that things are good the way they are. I don't know if that lack of proactivity might be a dealbreaker for me, but still, as a man, I would NOT wait for 8 years to find out if my partner is ok with me and if her end goal has already been achieved. I understand some people test waters and maybe at the beginning they are not sure about what they want in life (you were 19 when this started), but still. If you hadn't started that conversation, how much longer would have he waited and went on like this?\n\nI've read your whole post again and in the past \"He said he did not want to talk about it right now\", \"he shoved you aside\", and only after you put your foot down suddendly \" he agreed to openly talk and also agreed to your conditions and timeline\".\n\nI don't want to offend you and make a wrong guess, but again, very fishy.\n\nNote for self: Have the important discussion (future, end goal, marriage, kids) as soon as possible with someone. It seems marriage/kids is a big deal for many women, it seems low level just to run around the bush.\n\n&#x200B;\n\nAnyway, Congrats and good luck in the future!",
            "I hope you know he’s never going to propose to you out of his own free will.\n\nYou’re going to have to painstakingly drag it out of him just like you did this conversation.",
            "Yea well...so nothing changed. You still have no answers. You are STILL waiting your ass off. And you will be waiting some more then coming back on here and complaining again about this loser doing this again and again. Nothing changes. Congrats on giving him more time woopdyfuckindooo",
            "Congratulations!  Happy for you that this issue got resolved.",
            "Good on you for communicating your needs. However, please be prepared if he doesn’t meet your timeline. \n\nYour BF sounds like my ex who also never wanted to talk about the future. I said I wanted to be married by the age of X and guess what? He didn’t deliver. \n\nI am now with someone who excitedly talks about marriage and the future (we’ve only been together for a little less than a year and agreed to live together before making this jump). It’s a huge difference from the guy I used to pull teeth just for a conversation about where our relationship was.",
            "Timeline requirements? Christ that sounds like a red flag and controlling.\n\nHow the hell did you date for 8 years and not know this shit through natural conversation?",
            "You might enjoy r/waiting_to_wed because the people there are in a similar place of establishing timelines and such :)",
            "See you in a couple years when you realize this was a mistake and he backs out of the timeline.",
            "Sometimes it really helps to have a formal meeting and discuss things like you’re at work, doesn’t it? It sounds silly until you do it. Well done, really happy for you",
            "I'm so glad you had that conversation. Having an open dialogue is so important for any couple and I'm so glad that you guys were able to sit down and have it. I also think it's really great that he felt he could express his concerns and you also got to express yours all about building a strong relationship and that starts with a good foundation and communication. Keep talking even if you both take time once a week to sit down and have meaningful conversations. \n\nYou are 100% right. That it is not a one way conversation and giving ultimatums is not the way to go. Hoping for the best for you guys.",
            "I don't think you should give him an ultimatum and I think you are doing what is best for you. It's nice to get people's advice but I wouldn't listen to every single one. You gotta remember that a lot of people are looking at your problems through their life experience lens. So they will project a lot of their thoughts and feelings on to you. Hope this helps.",
            "I think this might be your go to in the future for serious conversations: \"I want to have a talk about X. What time do you want to do it?\"",
            "Stating your goals are to be married and have children isn’t an ultimatum. Saying you want to be able to start by the time your 30 bc of fertility may seem like an ultimatum but it’s a time limit set by our bodies and I completely understand. your not 21 giving your bf until the new year to put a ring on your finger, your giving both of you the opportunity to live the life you want by speaking up before time is wasted.",
            "Heyo, \\_really\\_ glad this seems to be moving in a positive direction for you! I can't agree enough with the counseling/communication work. It's important for all romantic situations, whether they're in a positive or negative spot.\n\nIn my wife's and my experience, counseling was a great way not just to have our concerns voiced, but to learn how to navigate addressing those concerns ***together***. This is the life that both of your are claiming you want to sign up for, so showing up together to do that work helps to solidify that commitment for everybody involved. \n\nIf you continue to respect each other's space, pace and feelings with things, there is a way to talk it out. I hope that both of you take this approach as a precedent for other difficult topics that will inevitably come up (life IS, after all, a constant state of un-satisfactoriness).\n\nGreat job to you both :D",
            "I really hate toburst your bubble here, I know time is of the essence for having children, but if you have to be the one who forces him to committ to you it will never work in the long run.  He will cheat or leave.  He's not excited to lock you down?  He doesn't like you that much and isn't sure about a future with you.  Sorry that's just the truth.",
            "I don't think that after being in a relationship for 8 years that wanting to have a talk to make sure you're on the same page regarding the future is at all unreasonable.  And the people hassling you for that - well, /r/relationships is just flat out weird sometimes. (Particularly with anything to do with traditional relationships/gender-roles - total red flag to a bull.)\n\nThat aside, I would be worried that you're not getting sucked into a sunk cost fallacy.\n\nYes you've invested 8 years of your life, and if you had to start over from scratch you'd be 35 when you get to this point again.\n\nBut if you sink another 5 years into this relationship before giving up and tossing in the towel, you'll be **40** by the time you get to this point again (if it takes you another 8 years).\n\nSo be careful that you're not being fobbed off with a minimal response that just maintains the status quo for another couple of months before some other minimalist token gesture is called for again.",
            "wow an actual positive outcome those don't happen to often on here nice to see it",
            "Yeah, this isn’t going to work out.",
            "Yay! I love happy updates!",
            "Shit haha. So you have set a deadline to get married? I cannot see this relationship going well. He's not committed and you're very rigid. Bad mix.",
            "Stop wasting your pretty!",
            "Timeline requirements? What",
            "I'm so sorry about the negative comments. I guess that happens because we can't see the positives that you can and are just judging based on the one incident.\n\nI'm glad you're worked it out, but as others have been saying, just make sure that you guys COMMUNICATE in future.",
            "My only concern is giving bf a timeline.  It’s forcing it.  You can say I want to go in that direction by spring in my way of thinking is a non-starter, I guess inorganic.  My simple analogy is pulling a gf’s hand onto my privates is not a loving act, no matter the end result.",
            "Ideally shouldn't people be able to speak whatever on their mind to each other and feel comfortable enough and encouraged to do so? This constantly creates a flow of prioritizing each other always.",
            "I recommend the book 8 Dates. It's a good way to get into some of these conversations in a more low-pressure way. Each chapter of the book is designed as a date with a specific topic (money, family, etc). It really helped me improve communication and build on my relationship with my partner.",
            "[deleted]",
            "OP, that's really good to hear!! Thatnk you for updating us",
            "So another relationship post where everyone screamed to break up, and that wasn't the right answer?\n\nWhere's that shocked pikachu face?\n\n\nAlmost like a bunch of people who've never had a relationship shouldn't dole out advice. Crazy.",
            "Great work. You are doing great job with being the great communicator.",
            "Honey, you’re 27. Your clock isn’t ticking to countdown quite yet.",
            ">For everyone saying that this doesn’t change anything and I should have broken up with him, and giving an ultimatum is going to backfire, etc\n\nThis is why this subreddit is so toxic...  \n\n\n>  I hope those of you who feel like relationship issues can never be resolved find happiness in your own lives ❤️ \n\nWell said!!",
            "I’m glad you two were able to work things out. My now husband did the same thing to me when we were only dating, even though it was for 7 years. I never figured out why, but now we are married and talking about having children in the next few years. It gets better!!!",
            "> For everyone saying that this doesn’t change anything and I should have broken up with him\n\nGood job, never listen to people on reddit about, \"FUCKING BREAK WITH HIM ALREADY\" advice, they have a mentall illnes that makes them think everything would be perfect in a good relationship",
            "That is so awesome! Happy for you guys!",
            "Good stuff. Yeah, don't worry about the people saying you should have broken up. If there's anything this sub excels at, it's wildly overreacting to any relationship related posts and telling people to leave their partner. It makes you wonder if those people have ever had a relationship that lived up to their sky high expectations.",
            "Let me first say. I am happy that you are happy with the conversation.\n\nThat said, do you really understand what you are asking from a man when you want him to commit to a marriage in the current day and age? This is a serious question. Do you really understand?\n\nI will leave it at that and let you think about it. \n\nI will be happy to give you perspective either on this forum or via messege, whichever you prefer.",
            "Thats awesome to hear if it dont work out just work it back in lol",
            "Good update. I think... Hmm... Maybe not...\n\n >I'd like to have kids and unfortunately my clock is ticking\n\nyou're only 27."
        ]
    },
    {
        "post_id": "bio854",
        "author": "uneasypeasy",
        "title": "My (31m) wife (34f) is ghosting our marriage",
        "url": "https://www.reddit.com/r/relationships/comments/bio854/my_31m_wife_34f_is_ghosting_our_marriage/",
        "score": 4379,
        "num_comments": 419,
        "created_utc": 1556536242.0,
        "selftext": "My wife left me on April 9. She came home from work early for the first time in months, said we needed to talk then said we love each other, we care for each other and we’ve never had a lack of affection, but that she’s unhappy and she’s leaving me. She packed a bag while I was trying to talk to her and she left. \n\nWe’ve been together for nearly 10 years. Nothing happened. We weren’t fighting, no skeletons in closets, she didn’t meet somebody else. We’ve both been digging in and trying to get through the grind lately but she did this completely out of the blue. She’s barely talked to me since. She never replies to me, only comes with prepared statements, says them (writes them) and ghosts again without actually talking to me. \n\nAll I can think is that last October her dad died and they were extremely close and it has been really hard on her. I’ve been trying to help as much as I can, I encouraged her to go to a therapist and tried to make her feel loved and comforted at home but instead she’s been throwing herself into work nonstop for probably 6 months at this point. I’m talking 6 am until 9 pm every day.   \n\nShe’s not only pushing me out but she’s pushed anyone who asks about us away too. From what I’ve been able to gather from mutual friends she’s working even harder now, and destroying her reputation at work while she’s at it because she’s micromanaging everyone. \n\nSince she left I’ve been asking her to go to couples therapy with me but she won’t. She refuses to even try and save the relationship. She said it’ll just hurt like this again when it happens next time, but I can’t convince her that there doesn’t have to be a next time. That no matter what we aren’t the same people we were before she left me and that if we try and work together we can grow from this and be stronger. She can’t see any of it and I’m afraid she’s completely ignoring what she’s doing by working so much she can’t think about anything else. \n\nI hoped her mom could talk her down but she threw me under the bus the second she realized if she pushed back my wife would cut her out, despite the fact I took a lot of time off of work last year to help her after the funeral and after she had some surgeries. My wife’s best friend from work and another of her close friends messaged me separately and both said she’s not acting like herself but they can’t say anything to her or she’ll push them out too. It’s like everyone is just giving her room to self destruct.\n\nI keep telling myself it’s going to be ok, she’s going to realize she doesn’t have to do this, but it’s been 20 days and I’m starting to lose hope. I don’t know what to do. I have my finances in order I know what I can and can’t do on my own, but I can’t leave because I’m not giving up on her but every day I wake up surrounded by the cold remains of “us” and it hurts so bad I can hardly breathe. \n\nTl;dr my wife is having a depressive episode (I think) and left me.\n\nEdit -\nI think I might have misrepresented what I'm doing. I've cut contact. I'm not spamming her or trying to make her talk to me anymore. The first few days I tried everything I could think of, but I do respect that she needs space and I've since cut all contact unless I absolutely have to talk to her and even then it's only about logistics.\n\nI've examined my financial situation and I've made plans on how to move forward and I plan on doing it. I'm going to the gym to help with the anxiety and stress, I'm eating healthier, and I'm trying to find a therapist for myself. I'm doing everything I can to actually move on and get through this.\n\nThe problem is just that I feel a lot of guilt about, what if she's actually in crisis and I leave. Everyone else is ready to just let her self destruct so they can pick up the pieces later and I feel like that's not what she needs. The other side is she won't let me help so I don't have a choice but to go and that hurts too.\n\nI also know I'm being unfair to her mother and friends in this post. I have told them all during our separate conversations that I understand why they're doing what they're doing but it still hurts all the same. I do want them to be there for her if she'll let them.\n\nAlso -- I 1000% agree that this is very one sided. I'm literally just saying what I understand to be happening and I fully accept that I don't know her reasons for doing this and that's part of what makes this so hard. I thought we were good at communicating to one another but apparently I thought wrong or something changed and took that communication with it and I didn't see it.",
        "permalink": "/r/relationships/comments/bio854/my_31m_wife_34f_is_ghosting_our_marriage/",
        "comments": [
            "Unfortunately you can't prevent someone from blowing up their own life if they are really determined to do so. People in depressive episodes often cut away their support network and that seems like what she is doing. It sucks, but at this point you need to worry about protecting you. I'd talk to a lawyer.",
            "Wow. Well she sounds very determined.\nI guess get some therapy/support just for you to make sure if what you think. \nThen prepare? You feel blindsided and want to get her back? Or move on?",
            "Had something similar happen to me and while it has worked out in the end, it took a full year. I obviously can't say with any degree of certainty your situation will improve at all. \n\nYou've made it clear to her you're going to give her space so do just that. Cut contact with her unless she contacts you first. Try not to think about her. Get yourself out of the house as much as possible so as to not wallow in the memories of you both in that space. \n\nIf you keep texting, mailing, phoning or whatever that is the opposite of giving space and she will resent you for that and it might make things so much worse. \n\nKeep yourself occupied.",
            "It sounds like a very depressive episode. You can't force her to do anything. It sounds like she needs space and is ignoring you to get it. I would just send her one last email- you're giving her space, you want to try counseling,etc.. but otherwise you should start seeing a counselor alone and start to process this.",
            "My boyfriend did this out of grief as well. I can say, trying to stay and fix it has only hurt us both and has been more to damaging the relationship in his state of mind. I wish I would have just taken the space but the same, no one could tell him anything or he would cut them off.\n\nYou know yourself and your wife so take this as you will, my advice, give her the space and give yourself the space as well for your mental well being (it will drive you insane trying to figure out what you did wrong, what changed, etc..)\nIt may take time or she may never come back to the person she was. As a partner you accept both outcomes but in this scenario, for yourself, take the space. You decide how you want to deal with it and how long you want to wait. You still have a say in all this even though it seems like its external factors affecting your relationship, you have a right to be happy.",
            "Does your wife have a history of depression? Of doing things like this, making rash, life-altering decisions without any apparent reason? Or is this out of the complete blue sky?",
            "You said she was really close with her dad, so she might feel that anyone who she feels really close to will just die and leave her feeling unhappy again. So she is cutting you out so she doesn’t feel hurt if you leave. I’m just a young person saying what I think is going on. I don’t have much relationship experience and probably can’t dissect this situation as someone who is older and wiser then me.",
            "I took a look through your previous posts and I think you're leaving a few keys things out here that I am wondering if they are the source for her sudden 180.\n\n&#x200B;\n\nI see you've been in an open marriage and you're bi. I have a friend who was in an open relationship for almost 10 years and they broke up a few months ago. He also said \"it's great, we're totally on the same page\" etc. etc. and she broke up with him from what his perspective was out of nowhere, but essentially she had been in an open relationship for him and suddenly realized that it wasn't what she wanted anymore and one of her partners helped her realize that. \n\n&#x200B;\n\nJust seems like this is an important component that may be influencing her decisions.",
            "You have run directly into three of the unwritten rules of life:\n\n1. Everyone does things for a reason and sometimes it's just not clear what those reasons are. You are trying to guess the reason your wife bailed but in time, the real reason will probably become clearer. I applaud you taking a big step back to wait and see.\n\n2. Blood is thicker than water. You should not hold it against your Mil that she sided with her daughter. That's just the way it goes, most of the time. It sucks, but that's the reality of the situation. Don't take it personally. \n\n3. You can't control how other people behave, only how you react to them. You are doing as well as could be expected with this one. You are entitled to feel extremely hurt by your wife's behaviour. No one could blame you for ending your relationship with her over this. That said, if you still love your wife and want to try to fix things, you need to put that hurt on the backburner while you give the situation time to play itself out. Only you can decide to whether to do that and if so, for how long. At some point, your heart will tell you enough is enough and you will be ready to move on.\n\nBest of luck to you.",
            "If your wife won't go, maybe individual counseling could help you get some perspective on this. I honestly don't know what's going on, but maybe if you talk through it all with a professional, they might have some more insight for you.",
            "looking at your other comments in your profile (open marriage, etc) i’m wondering if there’s more going on here than you’re representing",
            "This almost identical thing happened to me. The friends, the family, they all acted exactly the same. She met someone else. She didn't tell anyone until much later. Maybe that's not it in your case, but if she pops up in a serious relationship in 6 months, I'd have a tough time believing it's a coincidence.\n\nThe thing is, it doesn't really matter. Based on what you described, it's over and she is not on the fence about it. You should be turning your attention inward and start moving on. It was actually easier to move on when I found out she met someone but that's because I was like you and holding on to hope. Let yourself feel the pain, talk to a therapist, be with friends and family, and start the healing process today. I'm a happier and better person than I was before it all happened. Life does go on, and from the sound of it, there is probably someone out there that is better for you anyways. But most importantly, learn what you can from the experience and grow as a person.",
            "That's not what ghosting is. To be blunt, she dumped you. Ghosting would be if you came home one day and she was gone and you never heard heard from her again.",
            "I'm on the other side of this situation right now maybe I can offer some perspective.  I broke up with my gf of four years, from her perspective it was out of the blue.  I was unhappy in the relationship for a number of reasons, and was just a poor communicator.  She suggested couples counseling but I declined, counseling is for people who want to save the relationship, I don't.  I love her and I'm trying to limit contact with her to spare her feelings, dragging it out will only make it worse.\n\nThe prepared statements are interesting.  I'm not good at confrontation, i don't think on my feet while discussing emotionality charged issues, therefore I don't say the things I want to say or say them the way I want to say them, it sounds like she may have a similar issue and is coping with it.  You might have to do some self reflection here too, are you over baring when discussing things with her, she might be intimidated.",
            "She's not ghosting you.  She very clearly told you it's over.  I'm sorry.  You need to move forward with your own counseling and find your way to heal.",
            "This may be hard to hear. But I think she just realized she will never be happy with you. \n\nThis is certainly better than cheating, being unhappy for a lifetime or some other scenario.\n\nJust move on.",
            "Let it go. This isn't a movie. If she wants out this badly you can't win her back. Let it go. Live your life. \n\n\n\nHonestly the best thing to do in these situations is move on. Seeing you happy and maybe with someone else is the only thing that may get her to wake up.",
            "As much as we'd all like to have a postmortem on relationships that don't work out, we don't always get that. I think your wife has been pretty clear that she doesn't want to work on or continue a relationship with you. That's painful, and I really empathize with you and understand what it feels like to be totally blindsided like this. But you need to work on your next steps and healing yourself now. It sounds like it's a good time to try some individual counseling, and also to talk to a lawyer because if she's blowing up her life you'll want to make sure she doesn't take you out with her. You don't need to file anything until you're ready, but at some point one of you will have to. You can't make her stop self destructing or really even save her from herself, you need to worry about you right now. But you will be ok, and you won't always feel like this.",
            "Everyone seems to be covering the bases of depressive episodes and whatnot. I'm going to point out the counter and give you somethign to consider.\n\nI don't know you, just delivering a possibility. I was with my husband 13 years. It took me a LONG time to realize that he was emotionally abusive. I put everything into our marriage, absolutely everything. I begged for couples counseling, but he insisted no, we didn't need it. He blamed my mental illness for everything, when instead it was simply gaslighting (confirmed by peers). I decided to leave him when I was out of town on a vacation. It was a gaming convention he didn't want to go to, but my only way of seeing most of my friends. We had a fight on the phone the day before I was supposed to return. He asked if I wanted a divorce (it was very heat of the moment I know he did not expect my answer). Yes. I drove down the next day, grabbed my stuff, and left. He thought I was avoiding him, but I needed to finally break free. He said I blindsided him. I hadn't, but he had refused to see what I was trying to say for months. Honestly, I don't think he realized he was being abusive (again, despite what I would say, it would get shrugged off as me being \"crazy\", despite him meeting the checklist for both narcissistic personality disorder and emotional abuse). He begged me to come back, he reached out to my friends and family too. I'm not going to say you're abusive, because you've given no indication. Is it possible? Maybe. But I wonder if she's been giving off these signs for a while that she was over the relationship and you didn't see them, or didn't want to see them.\n\nAs for your wife's behavior after she left, it's possible she's looking for a fresh new start, or needs to bury herself in work and other stuff.",
            "Red flags everywhere brother...\n\nThe biggest: \"Prepared statements\"\n\nShe's done. No ifs ands or buts, it's over. After 2 ex wives and raising 4 daughters, I can tell you this: when they take the time to do that, there's no coming back, it's over, there's no \"saving\" anything. \n\nYou can't force her to talk to you, and talking to her family and friends will just drive her (and them) further from you. \n\nLike a lot of the comments already made here, it's time to look after yourself both physically and mentally, accept it and go on with your life. \n\nIt's not a \"good\" or \"bad\" thing, no one is evil here. She lost her dad, threw herself into her work...been there, done that; it's a hell of a pill to swallow, took me about a year to get somewhat right in the head after I lost mine.\n\nBest advice I can give ya: Tell her you love her, you understand and that you're there for her. Let her know she can stop everything and change her mind if she wants at anytime before the divorce is finalized. \n\nOther than that, get everything going and go on with your life as if she's not coming back.",
            "Beloved, you can't win here. She left you. You don't get to decide if that was a good decision or not.",
            "What might be going on here is some kind of mental break where the trauma of losing her dad has pushed her over the edge. At first I thought it was likely she had a side piece at work. But the more I read, the more I think she is trying to micromanage the world because she feels out of control. She very well could be pushing you away because she can't control you or she doesn't want to be vulnerable if (or in her mind, when) you either leave her or die (both of which are out of her control). \n\nIf I'm right, there's not much if anything you can do to change her mind. She has to see her behavior as a problem before she will seek help. Until she seeks help, you and your relationship are a threat best dealt with by going no-contact. Anyone else trying to help her will be seen as trying to control her.\n\nThe question is what are you going to do about yourself. My recommendation is individual counseling ASAP. A good therapist/counselor will help you stay centered, help you see her and yourself clearly, and protect you from further mental damage. Long term, she may come back once she's thinking clearly again. There's no guarantee, but I have seen where people go a little crazy for a few years after a traumatic loss and then have to come back and rebuild relationships. You have to decide whether you're going to hold out hope for that, or you're going to move on after giving her some time to figure things out.",
            "I don't think you need couple's councilling. I think she needs her own personal therapy. Maybe her mother could steer her that way. It doesn't have to be specifically related to you.",
            "Go to individual therapy first. Seriously, there were warning signs but you missed them.",
            "My (32f) wife (30f) left me the same way in October. I haven't laid eyes on her since she walked out, completely out of the blue. Shes textbook narcissist and I never saw it until it was too late. I still don't have answers and I never will. I'm heartbroken and confused, but take comfort in knowing that it gets a little easier once you start allowing the anger to come. I seriously thought my ex wife maybe had a brain tumor because it was so out of the blue. She even took our dog. She refuses to see anyone and now I hear Shes dating again. It makes me sick to my stomach every day. We may never know why, and it's awful. But just know, if she wanted your help she would take it. It was hard to hear for me, but it helped me just to almost make it a mantra \"she doesn't feel bad about leaving me and she doesnt miss me\" . it's not normal behavior and you deserve more. Im here if you need to pm",
            "Go on r/legal advice you can’t save a marriage that’s one sided",
            "The scripted statements definitely appear to be divorce lawyer recommendations. You generally don't want to give the other person any ammo to use against you.\n\nI'm sorry this is happening to you. It probably isn't what you want to hear; but it might be best to let this current take you to wherever it is leading and cease swimming against it. She doesn't want to take you down into the depression along with her; and there is nothing you can do to stop it. So honor her decision, and let her drown.",
            "The same thing happened to me with my ex-fiancee. Her dad had gotten cancer again and even though I was there beside her and her family through it all, she left me. She told me that she wasn’t the woman I needed in her life and I never heard from her since other than a text here and there. Her dad ended up dying and her mom died a few months later. She called me to say it was all my fault that she didn’t even get to spend time with them. I reminded her that we were there every day when her dad was in the hospital. That was about 2 years ago. Now I don’t let anyone get too close me because of all the pain I felt when she left.",
            "You mention that at the request of having marriage counseling she refuses because it'll hurt too much the next time it happens. So the question is the next time what happens? It sounds like she implies you've wronged her despite you saying nothing has happened. Even if she's not saying it or she doesn't even think it, it sounds like she wants you to feel at fault in some way. \n\nThis certainly could be just a bad depression, but be careful ruling out that nothing else has happened or will happen.  When people ate in a dark place the don't follow the same set of rules they normally a abide by.  I'm not saying she's cheating, but it might be more likely than you think, if she's at work all the time it might be a coworker (and could explain the self destructive behaviour as she punishes herself). People in a bad place are very secretive, other coworkers and close friends might still miss it. Maybe that's not it at all, just don't expect her to be herself, trust isn't a luxury you can afford her anymore. Like other posters mention, if she is done there isn't much you can do, get your affairs in order and move on.",
            "If she's writing stuff down for you, its so you will be forced to read it and take it in. Sorry OP, but it sounds like she isn't being heard and maybe you aren't as good of a listener as you think you are. She probably feels neglected.",
            " This will probably be buried, but here goes.\n\nI never married my son's mother (not for lack of trying). We had a young child, and she went off the deep end with drugs and alcohol after he was born. I blamed myself for our problems, even though a lot of them weren't my fault. I thought that I could repair our relationship, win her back, and everything would be all sweetness and light. Boy was I wrong.\n\n The tough, painful lesson that I learned was that relationships always need the efforts of two people if they're going to work. If one person stops putting in the effort, the relationship will fail, no matter how much the other person tries. If your wife has packed up and left, and told you it's over, well then it is truly over. There's nothing you can do about it. The reasons why don't really matter.\n\n I tried to hang on to my son's mom for months after she left. All it accomplished was to further alienate her, and humiliate me. \n\n When the realization that she was never coming back finally hit me, it was like having a huge weight lifted from my shoulders. I began focusing on myself and my relationship with our son. I went to school, started a new career, got married, and have custody of my son. She never got better.\n\n My advice to you is to just accept that your wife is never coming back. Focus on rebuilding your life, and bettering yourself. Don't waste another second pining for someone who won't give you the time of day. Life is just too short.",
            "Well, she's not ghosting you because she told you she was leaving you; I mean maybe it's depression, but also maybe you need to really reflect on your marriage and how well it functioned as a partnership.",
            "First of all, this should not have happened to you, not like this. I'm sorry that you were treated this way.\n\nMy mother responded to suddenly losing my dad in a similar way. She started grasping for control in all her relationships, going so far as to tell me that if I ever did some unnamed thing to her, she would have her lawyer tell me never to contact her again. Questions were meet with cruel accusations. I still don't know what the mysterious trigger for being cut out of her life would be.\n\nThe reason I'm sharing this is that my mother felt the loss of control due to my dad's sudden death so deeply that she went to crazy lengths to regain control in all other relationships. She threatened more people than me with the loss of, well, *her* if we crossed her in any known or unknown way. I couldn't get my mother to therapy, but I got myself there eventually. I learned to accept that I could not change her one little bit, and that she was never going to be the mother I had always hoped for.\n\nPlease, please seek immediate therapy. Tell them you are in crisis. If a friend is seeing a therapist, use that connection and ask the friend to seek a referral for a friend in crisis. Use the word crisis, because it's true. You need help, now.\n\nFYI, my mother did come around, but not until long after. Don't wait for that day and seek help NOW.",
            "You can not make someone like you or want to renew the relationship by chasing her. In fact, it may cause her to further push you  away or even feed her ego by you chasing her with open arms. Ignore her as well. Be pleasant and warm when talking to her but do not chase. Let her know your capable of moving on as well.",
            "Sounds like the death of her father broke her. Like she can't control anything and that things will never last. Then she starts to overwork herself and as you said micromanage everything that can be managed and be kept under control. Starting to see that everything has changed for the worst and that there's no point to things now since it'll all end. Because things can't stay the way they were.   \n\n\nInstead of couples therapy, she should probably see someone on her own. Aaaand hopefully she will put in the work there and start  to rework and manage her look on life.",
            "This is awful for you OP. I’m so sorry. You cannot help someone that will not help themselves. Maybe just give her space to grieve and heal for now and in the meantime go get yourself some therapy, self care is vital right now. Don’t look too far ahead and take it one day at a time. She may come back around, she might not. I think this is the hardest thing about it, you feel like you’re in limbo. Try and focus on you right now.",
            "So no one else has said this yet but I think what you said is pretty concerning. If she's behaving erratically at work, not getting enough rest, very suddenly tried to break up with her husband, threatened to cut off her mom and her friends are contacting you concerned, I would seriously be considering contacting authorities about a mandatory psychiatric hold. It may not help your relationship (she might be furious with you), but it sounds like she needs serious help. Do you feel confident that this episode isn't going to culminate in her hurting herself?   \n\n\nOn the flip side, keep looking out for yourself. Eating healthy and going to the gym are great, but this is a hella stressful situation and if you can see a therapist for yourself I think that would be great. Do you have your own friends you can talk to for some support as well?",
            "She's clearly been out of love with you for a long time and you were just too blind to notice.  \"Not fighting\" doesn't mean anything; sometimes that's actually indicative of someone not caring enough for there to be anything to argue about.",
            "You need to protect yourself legally. Go get a lawyer and file for divorce. She’s probably flirting with the threshold for spousal abandonment, if she hasn’t met it already.",
            "Maybe shes just accually unhappy and has been faking it, it might be the best for both of you?",
            "I'm really sorry, your wife is right at the age the women risk hitting a mid-life crisis, in this case triggered by the death of her dad. Much like when this happens with men, it can end up with a dramatic and total personality change. We don't talk about women's mid-life crisis, but they do happen (typically between 30 - 45 for women, & 45 - 65 for men). \n\nWe all wrestle with our mortality and aging impacting our sense of identity and & self confidence regardless of gender, and for some people the stress of facing these unstoppable inevitable things causes a break in personality as they try and escape acceptance. This break can look like a few different ways, but almost always involves completely abandoning the previous life and alienating everyone they used to know one way or another.\n\nAgain, I'm terribly sorry, but unless she's able to admit that there's a major fear she's wrestling with and gets the intensive professional help she needs to navigate this without blowing up her entire existing life, there's absolutely nothing that can be done for this and by trying to pursue her beyond where you're at, you're only going to perpetuate your own suffering. \n\nReally the best thing you can do right now is get yourself into individual therapy to help you cope with the grief and anger her behavior is (totally understandably) causing, so that you can extricate yourself with as little damage as possible and be able to build a new future for yourself. It may also be possible that a professional can help you word a last attempt to get her to accept what she's going through, but honestly that chance is extremely slim judging by how determined her behavior is at this point. \n\nFocus on yourself friend, I know this is utterly terrible and you're desperate, but there's no magic words to fix this :( you have done everything you can, at least you can be sure of that. Now it's time to look after yourself as well.",
            "OP.  First and foremost, it is OK to FEEL feelings.  Whether anger, sadness, quilt, or confusion.  Let yourself feel and be human.  Don't do anything destructive but you'll need an outlet for all that darkness. I.E the gym, gaming, or any hobby that occupies your mind and/or hands.  I've never been married officially but I've been in a common law one with my ex  She left randomly after 4 years. Like you, no underlying issues.   You can beg and plead all you want but if someone has made their mind up then you CANNOT do anything to change it.  It will seem impossible to believe at this point but trust me, in time everything gets put into a more acceptable reality.   I feel for you and I'm sorry you have to be going through this.   It gets better with TIME!!  Also get rid of anything reminding you of her that you can throw away or lock away for a few years.  It only makes things worse.",
            "Just playing devils advocate here - I left my ex husband 2 years ago. He was emotionally abusive and Gaslighted me for years. He spoke down to me until I felt worthless. Of course in his eyes, because he was a narcissist, he felt I was out of my mind to leave him. We lived in a small town at the time and he told the entire town I was depressed and left him because I was depressed about things that had nothing to do with him. I couldn’t talk to him without drafting well worded replies because I was out of practice at conversing with him rationally. Anything I would say, he would turn around on me. So my replies were rehearsed and guarded. \n\nI’m not saying your situation is the same as mine. There does seem to be some similarities, but I don’t know the inner workings of your relationship. All I can suggest is that you take a look at your own behavior, stop trying to phrase it to yourself that she could only leave you because of issues with her, and let her have her space. If she comes to a realization that you are her path, then great. If not, then I am sure she will find her way and you will find yours.",
            "I'm really sorry you and your wife are going through this. This post has made me reflect on my own past actions. My ex was in your shoes some years ago. My dad died suddenly. It hit my ex really hard, to the point where he had time of work with stress and felt he had to look after me. I, on the other hand, threw myself into my work and continued to live my life. I grieved privately, but didn't let it impact my routine. Cut to nine months later and we were having the \"I'm not happy in our relationship\" conversation and I left. I'd had doubts about whether I really loved him for months, if not years, but had always thought it was a phase. Outwardly, we seemed the perfect couple and my ex never suspected my doubts. Because of the relatively recent bereavement, my ex assumed it was a delayed response to that, I'd come around eventually and we'd get back together. In my mind, that was never going to happen. I'd taken a long time to realise that I wasn't happy and didn't want to be with him anymore. My mind was made up and I'd grieved the relationship even before having the conversation. No amount of counselling was going to fix how I felt. I now appreciate that to him this was raw and out of the blue and he thought he could do something to save it.  He was also shocked at the rejection after all the emotional turmoil my dad dying wrought on him.\n\nWhat I'm trying to say is that she may still be dealing with her bereavement, but this could be unrelated. \n\nAlso, she might be cutting you out because she doesn't have the emotional capacity to deal with her own pain let alone yours as well. All you can really do is make sure she knows you're there for her as a friend, but don't burden her with your pain. Easier said than done, you love her and want to keep her safe, but she clearly doesn't need that right now.",
            "\nShe may be in some kind of crisis but if you have reached out to her and she doesn't respond, then that's all you can do.  You should be the one she responds to the most, and she isn't.  It sucks to know but she has cut you out of her life right now.\n\nWeirdly, she hasn't asked for a divorce so she may think there is some chance to come back, but if you don't like this and you can't get any info from her about this kind of timeline, you can only proceed forward with what you think is a good option with the information you do know.",
            "Unfortunately, your wife is surrounded by people who would rather maintain the appearance of a healthy relationship than step up and confront her behavior. If she’s spiraling into a mental health decline, the people closest to her are acting like an audience. This isn’t going to help her. Individually you may not have an impact on her but as a group willing to support her, you need to come together and stage a “life” intervention.  You will need to rely on each other to come together to talk to her. This needs to come from a place on genuine caring, love, and a desire to help her *if she needs it.* \n\nAs much as it hurts, we can’t always save people from themselves. Sometimes people make poor life choices and they aren’t suffering any mental illness. If the group of you gather and approach her and realize she’s just decided she’s living her new version of an authentic life and she’s changed her approach to living as a result of her father’s passing, you have to accept what she wants for her life doesn’t include certain people or relationships. It could be mental health or it could just be her having a new perspective on life. I’ve had the latter happen.\n\nSeveral years ago, I salted the earth of multiple relationships, both family and friends. Everyone thought I’d lost my damned mind but the truth was, I was seeing clearly for the first time in years. They felt I was being irrational. Instead, I’d taken some time to think about what I wanted in my relationships and discovered I was surrounded by people who weren’t good for me. I went no contact with a father who’d been physically and emotionally abusive. I ended a 20 year friendship with someone who I had thought was my best friend but was really my biggest enabler for self doubt and negativity. I moved across the country, changed career focus, and set out to change *for the better.* Having been raised around bigots and abuse, I shed the racist, homophobic energy from my life and their inability to see they were flawed in their thinking meant I was the problem, not them. \n\nI had a small group of friends reach out to me and ask what the hell happened and that made all the difference between me feeling like I was completely alone and having a small but important circle of support. The love and support of that small group of friends meant the people in my life were positive energy while I was working very hard to divorce the negative energy. \n\nSometimes love and friendship is doing what’s best for someone else even when it isn’t what you want for yourself. That small group of friends was willing to risk alienation over the illusion of friendship.",
            "> We’ve been together for nearly 10 years. Nothing happened\n\nSomething happened.  You likely don't realize it, but there's been a change that created this situation.\n\n> she didn’t meet somebody else.\n\nYou can't say that.  And I'm willing to bet this is exactly what's going on.  It explains all her behavior.",
            "Are you SURE you have not missed something? Because it sounds like she has been self destructing slowly for a bit.\n\n&#x200B;\n\nYou cant do anything but lick your wounds and heal. I am so sorry this happened to you. Please find a therapist to work with to help you with this. You have a lot of things to feel and make sense of and you do not need to do it alone. <3",
            "I agree that it sounds like your wife is in a major depressive state. I am almost sure it's the grief and, unfortunately, there's not much you can do about it.  My brother in law is currently on a similar mission of self-sabotage after the death of his mother (my MIL), out of no where announced he wanted a divorce from his wife of 13 years, disappeared from family events, has not been open to helping out his newly-widowed father who lives 5 minutes away, has been working long hours, has been lying about his behavior, and is not receptive to any suggestions. \n\nI feel like, if you want to stay with her, you'll have to let her ride this wave and be there if/when she reaches out.",
            ">Nothing\n\nthat you know of\n\n>happened.",
            "You can not control the actions of others, you can protect yourself, your life, and your assets. You can go to therapy yourself. You can talk to a lawyer and protect yourself the best you can. You can not control her, her actions, or anything else. Maybe her seeing you take actions will break the ice, maybe it will make her double down, there’s no way to know.",
            "> she’s been throwing herself into work nonstop for probably 6 months at this point. I’m talking 6 am until 9 pm every day \n\nSounds like she's been running from her grief rather than confronting it.\n\n> she’s unhappy and she’s leaving me. She packed a bag while I was trying to talk to her and she left. \n\nA marriage requires two willing participants which you no longer have. She severed her marriage commitment to you with word and action. Sorry to say that you will have to now accept and grieve for this loss.\n\n> It’s like everyone is just giving her room to self destruct. \n\nYou can't stop her from destroying herself if she is intent on it. You can be there to help her when that happens, but don't let her drag you down.",
            "I agree with the suggestion that you get some therapy as well as legal guidance yourself. You've made a heroic effort to be supportive to your wife and it must be heartbreaking to watch her going through whatever it is she's going through but it's time to get some support yourself.\n\nSending both of you hugs and hoping you both find peace in this situation.",
            "She has spent a long time inside her head planning to leave you. That’s why she’s so prepared for it. It’s not shock. \n\nYou need to move on. For yourself.",
            "In my opinion she should get grief counseling. That is normal reaction after her loss. Just let her know you are there for her and give her some space. She doesn’t have control of her feelings right now.",
            "She must be afraid of losing more people. So she's trying to reduce the attachments she has with people in life",
            "I did this to a long term boyfriend. I thought that we got together too young and I’d never experienced life or other people. Looking back, I needed him out of the way so I could self destruct completely. I regretted hurting him—I realized I had made a terrible mistake. It took years to earn his trust again, but once he saw I was getting the help I needed, we were able to form a bond even stronger than before.\n\nI wish you the best of luck, I’m so sorry this is happening.",
            "Let her go. She's not on the fence. I'm just being transparent. But if someone is done, let them go. If they don't question their choices , they don't value their lives / relationships . Don't be selfish if it's only your heart in the game",
            "Go to therapy for yourself. She may have been unhappy in the marriage for a while even if you weren't fighting. Or this could be depression/something else. There's no way for any of us to know. And right now you're dealing with a lot of emotions. \n\n> I’ve been trying to help as much as I can, I encouraged her to go to a therapist and tried to make her feel loved and comforted at home but instead she’s been throwing herself into work nonstop for probably 6 months at this point. I’m talking 6 am until 9 pm every day. \n\nIt's definitely possible she's buried herself in work to deal with grief and depression and that she needs help. You can't make her get help, so hopefully with the support of people she hasn't pushed away, she'll realize she needs it. Her getting help may or may not save your marriage. \n\n> I hoped her mom could talk her down but she threw me under the bus the second she realized if she pushed back my wife would cut her out, despite the fact I took a lot of time off of work last year to help her after the funeral and after she had some surgeries. \n\nHer mom did not throw you under the bus. I know you're hurting a lot right now, but her mom's priority is her daughter, not her daughter's spouse. She's there for her child and will always prioritize her over you. It's not about you. \n\n>  My wife’s best friend from work and another of her close friends messaged me separately and both said she’s not acting like herself but they can’t say anything to her or she’ll push them out too. It’s like everyone is just giving her room to self destruct. \n\nOr, they're making sure they stay in her life and are there to support her through whatever is happening. It's better for her to have people there for her. \n\nAt the end of the day, if she wants to leave, you can't convince her to stay with logic or anything else. Sometimes relationships just end.",
            "I'm so sorry OP, my heart is breaking for you!  I don't have anything useful to say but I just wanted to send you *Internet hugs* 🙁",
            "fuckit.avi find someone better. Worst you can do to her is give her what she wants and ignore her.",
            "Depending on what state you are in you should file for a legal separation (like NC's divorce from bed and board) and seek post-separation support. You need to protect yourself. If the lawsuit doesn't help her see more clearly then the relationship is probably damaged beyond repair anyway.",
            "This will get buried cause I’m late to the party, and I don’t know if someone else has suggested it already, but what if you write her an email, letter, text, anything with all your thoughts laid out. You might not get answers but at least she’ll know what she’s doing to do and your marriage. She’s ghosting you but not asking for a divorce? Like others have said it sounds like she’s spiraling, but I would say it’s not depressive but manic. She might have some undiagnosed mental illness, bipolar disorder or something, and the loss of her father triggered it, leading her to extremes. Instead of couples therapy, it might be beneficial for her to go to therapy on her own or even see a clinical psychologist who can prescribe something if necessary. I’m sorry this happening to you though, but just remember, this isn’t about you. Her doing this sounds like it’s all her own issues, not anything you did or didn’t do. Hang in there man.",
            "I think you are correct that your wife is in the midst of a deep depression. Unfortunately, when tragedy hits, not everyone deals with it the same way. The fact that she's not acting herself, her friends are concerned about her, she's thrown herself into her work (avoidance), and has cut herself away from you... It all points to that. Additionally, depression can make you forget your love for your partner (until you get it treated), which may be why she's pursuing a divorce. Would it be possible to organize an intervention for your wife? Her friends, any of her relatives that are open to it--and plead with her to get professional help? It sounds like she should really be seeing a psychiatrist and a therapist at this point. I'm so sorry you are going through this.",
            "She definitely sounds depressed. And it sucks, but you're just gonna have to let her be. I know that sounds crazy, but if you try to mess with her process it will just make her resent you. Even if her process is self destructing. Just be there for her through it all and when she eventually comes back, she will realize you are good for her. I've dealt with depression my whole life and my mom has always told me that in order to get through it, you have to do just that, go through it. You have to feel every single bit of hurt before you can heal from it. Shes feeling it but trying to fight it. She just needs time and space to be able to break down and be with her own thoughts and hurt, to figure out how to heal on her own and learn how to live with this pain.",
            "I am really sorry this happened to you. \nSometimes you just need to let people go. Also for your own sake. \nStart processing so you can heal. \nIf she does come back, deal with it then. Right now you need to focus on yourself.",
            "Homie. I understand it's hard but maybe just let her go. If she loves you and comes back she will but you gotta live your life the best way you can. You're at the point where you need to know if they will be there for you. It's a mutual relationship and its cliche but let it be. You gotta stay solid bro. Much love",
            "You can't help someone who doesn't want to accept help. It incredibly hard to let someone you love fall on their own sword but it's for the best that they find their own rock bottom and figure out what they need to do to go from there and recover. It's part of the growth journey for many.\n\nShe communicated what she's doing and as much as it hurts and as much as you would rather pretend it wasn't happening, it is. You have to go with the information you have and presently that is that your marriage is over. I'm sorry, her delivery of the news was very blind-siding in fashion. Unfortunately, that's the only way some people know how to communicate through stressful stuff.",
            "Sounds like there IS someone else... I hope im wrong.",
            "No one just randomly decides to leave a person... things build up, and unfortunately for her, she didn't have enough respect for you to let you know why she was leaving. She's proven herself that she isn't the one for you, so get ready to move on with life.",
            "Do whatever you ca do to protect yourself that doesn’t overly hurt your wife. Legally separate so you’re financially and legally safe. Take care of yourself emotionally. You’re not just leaving your wife high and dry. You are just letting her have enough space so she can do what she seems like she needs to do. Taking care of yourself is good for you both. Let your MIL know that you’re open to your wife contacting you in the future and ask for her help in the future if things change. Maybe leave a letter for your wife with her if once she calms down. Your wife may come back in the future or not. You don’t know but the only saving grace is you don’t have to decide how to act to everything right now. Leave yourself open if that’s what your heart wants but close yourself (temporarily? permanently?) if things are too painful, then change things up the next day if you want. You decide and what you decide to do is okay. There’s no predecided best way to do things in this situation. If it’s painful and hard to breathe, concentrate on your next breath and no further. The next breath is your future and that’s okay.   \n\nHot baths help me when I’m scared and feeling lonely. Eat your favorite food. Take care of you for now, right now. If everything reminds you of her, change it until it’s okay. Move furniture around, buy a new thing, go to a hotel for a day, whatever you want that doesn’t make things worse again.",
            "People grieve differently people also change after some traumatic happens. You said she was really close to her father. And she's had surgeries as well. She probably is suffering from post traumatic stress disorder. \n\nI wouldn't be overbearing and clingy toward her give her some space. Suggest counseling but don't force her to go. Suggest that if she isn't comfortable talking with you or mutual friends about what's wrong to talk to a professional maybe it will help heal her. \n\nAll your doing is probably making her distant herself more with set ups with discussing things with her mom, friends, etc. \n\nI am sure she might come around and discuss things with you but people who suffer from things that happen want space and put their minds on work or other new things. Regardless if it jeopardizes relationships with marriages/friendships/coworkers/etc.",
            "My wife of 35 years pulled this one, but then came back about 10 days later. I tried to understand because **\"for richer, for poorer, ... in Health\"** and let it slide because she was depressed. Fast forward 10 years and she swears off of sex. Now what? It's been another 2 years. Now I have a 47 year marriage with lots of kids and grandchildren but now no sex and I still have the same old **\"for richer, for poorer, ... in Health\".**  All I can suggest is if you think she will recover then stick with it but in my case I should have quit 12 years ago.",
            "This all sounds really difficult. I guess during times like this, it's worth remembering that nourishing relationships help us grow as individuals. It's clear there's nothing you can do for her, but so so much you can do for yourself, and it sounds like it's about time you really looked in the mirror to determine how much better you can treat yourself from his point forward, what you can do for more compassionate self-care and what you can do to construct safe boundaries that help you move forward in a thoughtful, easier-to-get-around-in-the-world way.\n\nHer journey may take her any direction, so the best bet is to work on moving yours in one that most helps and supports your health and needs, especially right now.",
            "I really don’t know how to advise you, but I know how I felt when my dad died, which may be similar to what she’s going through.\n\nI completely lost faith in everything. My dad died, which means everyone dies. I’ll die, my friends with die, my partner will die. In 100 years we’ll be gone and that argument I had won’t matter. None of it will matter, so why bother, why invest in things when they just cause you pain and they don’t last. I started treating people badly, I didn’t take care of my self. It was a really dark, low time. \n\nShe needs therapy. I’m sorry you’re going through this.",
            "I'm going through something shockingly similar.  Girlfriend (I was going to propose) of 3 years packed up and left completely out of the blue while I was on a business trip.  She said she wasn't ready to talk right now and only left some cryptic messages with no details. I've put together the situation through talking to other people, and as it turns out she's depressed with possible suicidal thoughts.\n\nPeople deal with depression differently, and often times it leads to destructive behavior.  She could be throwing away her happiness as almost a form of mental destruction.  Her staying late at work is a lot like my work in the Navy with some of the senior people that have trouble at home - they would rather be at work than be at home, even if they're no more happy at work.  Work offers a distraction and catalyst whether it's a good one or not.\n\nFor you, you're doing absolutely everything right.  Do not fault yourself.  The only thing I can offer is for both of you to have support networks.  I imagine the pain you're going through.  Find people that will listen and offer good advice if you haven't already.  Talk to people.  A lot.  It sounds like her network is kind of lackluster, so I would suggest having a very serious conversation with her friends and mother.  In the end, there might not be anything you can do.  Give it time.\n\nPlease message me if you need someone to talk to.  Good luck, friend.",
            "This is so crazy my closest friend is going thru something so similar it's scary. From what I can tell this is some sort of mental breakdown where either her routine or life isnt what she envisioned and is bolting. Not only is she leaving but the blame is completely my friends fault no matter what he tries to argue she has prepared statements or mindless retorts that require no mental judgment or effort.  At  my best guess it seems she wants no responsibilities and has sabotaged every relationship in regards to anyone asking about what she is doing why etc. This seems so bizarre to me as there are plenty more details but for my friends sake I'm omitting but this woman seems so indifferent to any emotion or attachment to her old life.",
            "Honestly I think about what \"Dr. Laura\" used to say about these situations - \"Nothing happens out of the blue.\" If you are brutally honest with yourself you will know that this was coming. It seems we all need to live in denial just to maintain, but that means that occasionally we ignore the elephant in the room. Sounds like she has no intentions of changing her mind so just stop the suffering and move on... It doesn't really matter whether you figure out the real reason, it's too late to rectify it. So beating yourself up or rationalizing/attributing it to some other event will get you nowhere. My sympathy goes out to you.",
            "It sounds like you’re making judgements and assumption on what she’s going through. Ofc that’s easy to do if she’s not talking to you but I think you owe her to let her tell you what’s going on when she’s ready, if she ever wants to. If you love her as much as you say, you should see that making assumptions isn’t fair to her. Good luck dude.",
            "Are you sure she didn't meet someone? This all sounds like she has already moved on.",
            "Your MIL (and your wife's friends) didn't throw you under the bus. She is making sure that your wife doesn't burn all of her bridges. Your wife is refusing help and all anyone can do is watch her self-destruct. Anything more and she will push them away. She will need them when she hits rock bottom. Hopefully there will still be enough people around her who care.\n\nI know this sucks, but at this point, there isn't much for you to do now except look after yourself. By this I mean get your own therapist and divorce lawyer.",
            "That fast of a change. She has met someone she has feeling for and it's probably been going on a while. Sorry but that's what I'm.reqding by her behaviour.",
            "i like how everyone on here is so supportive of divorcing someone in crisis, like the lines IN SICKNESS and TIL DEATH didnt really mean anything at all.  you dont leave the people you love and care about, u wait for them to come back.  she didnt cheat on you.  she lost her dad.  dont listen to the ppl saying just move on.  she needs help.  and its only going to get worse b4 it gets better bc she may take a very long time to realize whats going on, ESPECIALLY SINCE NO1 IN HER LIFE IS TRYING TO HELP HER apparently.  i know its not fair to you, but remember the promises u made to her on your wedding day.  shes sick.  shes not well.  just bc her body is healthy doesnt mean anything.   you dont punish cancer patients for vomiting on your carpet or in your car, do u?  why would you punish a SERIOUSLY depressed person?  as long as she doesnt sleep with someone else or do anything else treasonous, i feel like u should wait for her.  move out if it helps bc u need to be healthy too.  but i wouldnt move on.\n\nmy husband went through a very hard time after his mom died.  thank god she hasnt gone his way (cheating and drugs, yay...).  idk what to do exactly bc we r still working through the things hes done, but some1 needs to be there when she hits rock bottom.  some1 needs to be there for her, even if it is in the shadows.  try to keep a good relationship with your mil maybe, so u can keep tabs on her.  thats a silver lining that mil isnt trying to push things with her.\n\nremember that shes your wife and you made a promise to her the day u married her.  now is the time to remember that promise.  cling to it bc at the moment its all u got.",
            "It's insanely hard to be married to someone who is depressed or having a depressive episode. \n\nSounds like your wife is doing whatever she can to destroy her life. \n\nNot sure what else you can do. Even if she does a 180 and comes back to you and apologizes for everything, will it ever be the same again? \n\nWill you ever be able to trust her again? What about kids? What if you had kids and then she ghosts not just you, but also the kids?\n\nIs this someone you can trust for the rest of your life?\n\nShe is probably going through some shit related to her dad. That doesn't give her a pass on being shitty to people in her life.\n\nI always tell say that it's okay to feel shitty and to feel awful, but it's not okay to treat others like how you feel. \n\nI think this is the hardest part about being close to someone who has depression. Everything is about them and how they feel. They feel like shit, so they cancel everything and just refuse to do what they had previously agreed to. \n\nWhether it's something fun like a movie or dinner or a party. Or if it's something more serious like working on something or being there to support the other person.\n\nEverything becomes about them and their feelings and their depression. It's exhausting for their loved ones. \n\nIt can feel like dealing with a toddler. It's impossible to plan stuff because she might feel depressed, so you will have to cancel and that hurts other people's plans. So you end up not planning anything just in case she isn't up for it.\n\nMy point is that for OP, it hurts right now, but this is probably better for him in the long run. He can find someone who handles stress better and his life will be better.",
            "Given that you seem to be trying to do everything right, and she's still insisting on putting space between you, I'm going to go off on a limb of extreme assumption here, and say something that people don't often address. \n\nYou might be manipulative as hell. \nSo much so that your wife realizes that she can't solve any problems with you because you'll just manipulate her, and she realizes that the only way to get through this is for her to quit you cold turkey.\n\nI really don't know you, and I might be way off base. If so, disregard. \n\nThat her behavior just sounds like the reactionary behavior of someone who realizes they have to put space between them and someone talks to them. And your story about the two of you makes you sound so innocent that it's almost unbelievable. You really seem to have absolutely nothing that you can think you might have done to upset her? Nothing at all?",
            "People are saying to divorce but I would wait. It sounds like an underlying mental illness rather than anything you or her did wrong. Definitely give her some space, and focus on yourself, but you never know. Wait and see.",
            "I'm really saddened to hear that. I am sorry you are in this situation. Much like a lot of others have said, I would put yourself first and try to heal from this the best you can. Surround yourself with friends or family that you have. Get a dog or other pet. Keep yourself busy, you've already told her you are there for her so you've done everything you can.",
            "Losing someone is never easy and we all handle loss differently.  Not to sound harsh, but maybe losing her dad got her to reflect inward/on her own happiness.  Maybe she was legitimately not happy in your marriage.  Starting over is hard so I can see why she's diving into work, but I am sorry to say - I think she's making this decision with a clear mind and heart.",
            "Fuck. That's a new one. That sucks.",
            "She’s depressed. Let her go.",
            "sounds like she's battling depression... hopefully she gets the help that she needs",
            "Sounds like she’s having a nervous breakdown. Might look into a period of involuntary hospitalization before she destroys her entire life",
            "I agree with allot of what people are saying on here. I don't Know much about mental disorders, but just from what you've described, you can lead a horse to water but you can't make it drink. I'm not saying to give up on your wife but clearly she wants to just be left alone. Some people need to hit rock bottom before they can go up. I would just leave her alone. Let her go back to you on her own time. Hopefully she will and things will work out. But there is the cold reality that they might not. For that, in your own time, you need to take care of yourself. Even if it means (for example) moving into a smaller house. You can definitely always be ready for her to return and y'all will manage with what y'all have at that time. But for right now there is no telling when she will return or if she ever will. Don't through yourself under the bus. That won't help anyone out.",
            "A lot of people are saying it but you are doing and have done everything you can. I am so sorry that this is not in your control and so sorry that she is hurting you like this. None of it is your fault.\n\nI have a close friend who went through a very traumatic experience and is now doing the same thing. It's horrible to watch and horrible to be a part of but sometimes there is literally nothing you can do but love them. If they want to destroy their entire life and won't accept any outside help you need to let them self destruct and then pick up the pieces.\n\nI've dealt with serious depression my whole life so now I'm talking from my own stand point but a huge thing that has helped me is my family and friends letting me handle these feelings on my own. Part of overcoming depression is building self reliance and as idiotic and unproductive as it may *seem* sometimes destroying your own life so that you can build it back up is necessary for people to see that they are in control of themselves and they can change their reality.\n\nIt's just so hard for their loved ones to watch. Again I'm really really sorry that you are being put through this. It probably has almost nothing to do with you and, if anything, you're the one trying to help the most and deserve it the least.",
            "Just finalized my divorce due to a similar issue. She hadn't been happy for a while and then things came to a head about a year and a half ago. \n\nShe had mentally checked out of the relationship.  Thousands of dollars of therapy did nothing.  But as the counselor told me, she's an adult who can make adult decisions and will suffer adult consequences.  She has a rough road ahead of her but she has no interest in my thoughts so I keep them to myself. \n\nFriend, family, and even my lawyer are all baffled. It sucks but life goes on.",
            "Well besides how this sounds so much like my ex and me (and he cheated for 6 months i found out after i saw the engagement ring he got for her when i was moving my stuff out).\n\nYou can't fix the relationship on your own - she has to be willing to work on it for it to have a chance.\n\nIt's not your fault. It's out of your hands. She won't do the work and that's the only chance your relationship had. Don't hurt yourself by trying to make her fix it - you deserve better. You deserve someone who will work with you.",
            "It sounds like she has her mind made up and that’s that.  So accept it.  Get out of your lease.  Or sell your house.  Move to a new area and move on.  It’s not easy but the hardest part is getting started.",
            "My husband kinda did the same thing... we were good told me he loved me that morning and that night he packed and left... he waited the period we had to for the divorce and that was it... I don’t understand how someone can walk away like that and not look back...  my heart goes out to you and I hope you can heal and learn to love again when the time is right for you",
            "Damn, I’m so sorry but if she’s dug her heels in then you’ve got to let her come to peace with it. Let her self destruct and drag herself down.",
            "Ex wife did something similar. We had been in therapy because she had been unemotional and cold for some time, and had become abusive (although she wouldn't talk about that).\n\nTherapy session #3, she just announced we were done, wouldn't give any reasons, and we were just separated. I talked her into making it a \"trial\" separation, but I found out that was just buying her time to take everything, have her live in our condo, and have me pay for everything.\n\nIt took 3ish months of separation for me to find out from a buddy that she had been cheating on me for the last six months of our marriage at least. And that was the reason for the separation, she just didn't want me in the way of her partying lifestyle any more. But she couldn't admit that, so she just didn't give a reason.\n\nI highly suspect there's another guy at the heart of this, and that it's been over for her for a long time. Your best shot now is to get a lawyer and protect your assets as best you can.",
            "Sometimes you gotta hit rock bottom before you can start to heal",
            "if she's responding that's not ghosting. She might just need space in order to get her head straight. Don't push her to do something she's not ready for.",
            "I’m sorry you are going through this, I know that empty feeling that you feel and the best thing is for You to move forward and if things are meant to be then they will be but you have to look out for your best interest and happiness. It sounds impossible to do, but it can be done. Cut your losses and start fresh. Good luck 💚",
            "Gotta remember, this jusy happened ypu you a few weeks ago. She has been thinking about it for months.\n\nTime to gym, social media, and get ready for a divorce.",
            "I was in a long-time relationship with somebody who simply couldn't imagine a life of happiness. She'd smile and put on a \"mask\" that she's content but she always seemed to find the place where she was lacking. Unfortunately, you can't prevent this or help this from going on with them. They have to not only take action to be better but they have to want it as well. Not for you or even the relationship itself but for themselves. Unfortunately, some people would rather drown in their sorrow than swim to breathe. For some people, it's all they know and they don't want to get out of that mindset because it challenges everything that they know.\n\nThe only part that I'm having difficulty with is that you didn't see this coming. That as far as you knew, everything was fine. There had to be some signals leading up to this. You mentioned the loss of her father. Did you notice a change in her since then? You also mentioned that you were able to talk before she left. Consider yourself fortunate, after nearly 20 years, my ex packed her things and moved out with nothing more than a phone call while I was at the airport traveling home from a weekend conference. In that talk with her, did she give you a reason why she's leaving?",
            "Im so sorry and I don't want to sound like and awful person, but reading your post honestly made me feel a little better. It's somehow comforting knowing that im not the only one who is dealing with this. See, I'm going thru this with my husband right now, too. His dad (who was very abusive and drunk during my husband's childhood) had a stroke 2 years ago in November and our marrige has been getting harder and harder ever since even tho we love eachother very much. We were moving out of state for a clean break from his family (toxic) so we could have a chance to start over a bit,  but i moved first and then he just never came up here to meet me. It's been 4 months. He won't answer my calls/texts since i left. He moved in with my best friend + her husband back at home, but they barely talk at all and if i come up in conversation he gets upset and leaves... she keeps me updated on him and I guess he is taking care of his father, even tho the man is awful to him and we had set him up eith a care giver situation.   He texted me 3 weeks ago and told me he knows we have a good marriage but he is depressed and doesn't know how he feels about things. It hurts for about a million reasons, but one of them us that i gave up a lot to help eith his dad after the stroke (even tho he has always treated me very poorly) and after almost 2 years of working part time to care for his father i have run thru almost all my savings and am now starting from sctratch. I had to move into my parent's basement because i couldn't afford the place we were planning on moving into. I feel so abandoned. Our dogs are even depressed. I can't do anything.",
            "My husband did something similar, but not quite as severe. And I have suspected for years he has untreated depressive episodes - maybe even just lingering depression. \n\nI gave him his space. He wanted out, I obliged. I moved on with my life. He came back and begged and pleaded to let him back in my life. I told him I'd do this, but never again. He continues to have periods of depression where I feel that my behavior (needy/clingy) exacerbates his want to escape. I find I have to give him space. And eventually he'll come back around. It's the hard part about living with someone who has mental health issues. They're sick, but they don't want to admit or acknowledge they're sick. And in case anyone is wondering, I had suggested to my husband that he was depressed and his was response was \"but I don't feel sad\". So, he believes some strange trope about depression - and no matter what I tell him he doesn't believe it because he doesn't FEEL like he thinks it should feel.\n\nNo matter what, you have to move on and do what you need to do for yourself. This is a form of emotional abandonment on your part and if she DOES come around you have to decide if you can trust her to not do this again to you, because I am going to bet in some way, shape or form she will do this again.",
            "I hate to say it, but I think it’s time you stepped back, man. I can’t say I understand why she would act like this, but I’ve been on self destructive benders before and there is absolutely no stopping me once I hit that roll. Literally, nothing. \n\nI think the best thing for you to do is give her the space that she wants and try and just work on yourself. You’ve done everything you can and if she doesn’t want your help and won’t take it then that’s your answer. I’ll predict that soon she may lose her job and some more friends and will hit rock bottom; that’s when she’ll come back to you. So just take some time for yourself, like she’s doing, and think about the relationship. Will it be worth it to salvage if she does come back? Maybe you’ll decide to move on too. Only time will tell.",
            "Sorry for your struggle, it sounds like she’s going through a type of bereavement dysfunction or having an issue coping with the loss of her dad. She absolutely needs to see a therapist to work through this. If she doesn’t voluntarily see a therapist or counselor then it sounds like she’s bound for a breakdown (emotion, physical, mental or all 3) which may put her in the hospital due to fatigue or exhaustion. At that point she may be offered inpatient treatment or if she comes to her senses she can opt for outpatient.\n\nI know it’s a stretch and a lot of assumption on my part but if there really is no other inciting event then it sounds like she’s suffering from some type of Bereavement disorder. She’s struggling with coping with the death of her father and is cutting out anyone she cares about as a defensive mechanism. \n\nAnother alternative is that she learned some bad news about herself (terminal illness maybe?) and she’s trying to isolate herself and protect herself and (what she thinks she’s protecting others)\n\nI really hope this works out for you both. Be patient and don’t do anything extreme or reactive. Be patient and present and supportive, but also at the same time, protect yourself. You should definitely contact a lawyer so you know your rights and responsibilities in this situation.",
            "It sucks, and i feel for you.  But there is nothing more you can do.  She is more than likely hurting from her father passing, and trying to bury it at work like she does with other pain (i did much the same but not to the same extent when i was going through a divorce, i used it as a means to not feel anything). The reason why she is pushing anybody away that talks about her relationship is the fact that she doesnt want to feel there too.  She probably realizes what she is going but cant stop it.\n\nAll you can do is better yourself.  Work on you, and what you want, and take the time to keep your perspective in this.  Give her time to burn out and crash and potentially come back, but if its over a year start moving on.  You may find the fact that you're not going to make it through this as a couple.  It may take YEARS for her to get out of the funk, and realize all that she had and come back to you.  \n\nI know couples that grew apart like this, got divorced, and then remarried 20 years later.  This may be your story, or it may not be.  But waiting around to find out is only going to hurt yourself.",
            "As others have said, you can't stop someone from blowing up their own life. Please get some therapy for yourself so you can help cope with your own guilt and learn how to be available, but not self-destructive, in your attempts to help your wife.",
            "This happened to me earlier this year. My husband came home and left to a hotel three nights in a row this January. He kept going back and forth in wanting a divorce or not, it almost felt like a fucked up game. \n\nI have PTSD and have been out of work for two years to deal with that; he reassured me over and over again that I didn't have to work until I was ready. \n\nI got better and better, since last October, honestly.. but there was always something that seemed to pop up on my better days or on his days off that would justify him being upset with me and the distance grew. I know he has seasonal depression and works retail, so I was just waiting for the storm to pass. \n\nI made it my mantra and my intention to \"PERSIST\" when the new year came around. January 1, Elizabeth Warren announced her campaign and her tagline was \"PERSIST\". I was like, alright, this is good! Things will continue to get better. \n\nWhen he left, he cut off all my access to our credit cards and our finances. I have been out of work for 2 years this August and I have $0. I had no groceries at the time as that was one of the things we were putting off due to his 3 day parade of coming and going... I was abandoned in our newlywed home with no money, no food and NO IDEA why he left and in such a devastating way...\n\nThis last Christmas (we're not religious, but our families are), we BOTH had expressed such love and such gratitude for the day, how we chose to spend the holiday and start our own traditions that fit us and our family, how grateful and happy we both were to be married... All of it... The next day he got in a car accident, didn't tell me for 5 hours and when he did, he came home and was just... Different. I don't know what happened. We had issues I was hoping to work out through a couple's counselor; but this? I didn't think he wanted out and I didn't know he would just leave me behind like this...\n\nI'm not sure why I'm writing this to you. I guess I was just feeling recognized and wanting to share my story with you through some cathartic impulse or something.",
            "There is no such thing as it came out of nowhere.  Usually this means she has met someone and leaving you.",
            "Just don't blame yourself for what she is doing. Sadly you can't do anything, she is just self destructing, and she won't let anyone contain her from doing it. A similar situation happened to me too, but we were not married. Now I have no idea what she is doing with her life, but it doesn't seem good, she probably just kept destructing. When I tried to convince her to try again she treated me like shit so I wouldn't try again. Now I found someone else (way better in every way) and I am happy with her! I know you don't want to give up but that's probably the only solution..",
            "Let her fuck shit up and just focus on you my dood",
            "She very likely is having sex with someone else. Sorry man.",
            "I am very sorry for this terrible situation OP, but it sounds like you know what you must do.\n\nYou cannot stop her, nor tell her what to do. You can only choose; either be there to pick up the pieces, or not. \n\nWord of warning, if you do decide to stick around, one condition must be that she will regularly see a therapist, AND couple's therapy.\n\nBut you are absolutely justified in leaving. No one could/should blame you. Take care of yourself, OP.",
            ">\twork nonstop for probably 6 months at this point. I’m talking 6 am until 9 pm every day.\n\nWork can be an addiction too. \n\nI’m sorry you married an addict. As someone in recovery, I can absolutely relate with the pain and suffering that addictions cause others. \n\nSadly, we addicts only care about ourselves whenever we slip out of treatment and back into relapse. \n\nThere’s nothing you, or anyone else, can do. The addict needs to want change bad enough for themselves.",
            "What if she’s scared that you might leave her one day ? You’ve said that her father died and that they were really close. She might just be very scared and is trying to act proactive in hopes of not ending up heartbroken. \nNonetheless she doesn’t seem to want any help, as of yet. I think it’d be best for you to give her space but be there for her, when she comes back needing you. It sounds to me like she’s developed some sort of self harming coping mechanism. \nAnyhow, chin up ❤️ don’t ever forget that it’ll be all good in the end. Hit me up if you need to talk!",
            "You have to face the fact that he doesn’t want to be with you. Whether she’s depressed or there’s another reason, she’s been very clear that it’s over. \n\nYour best bet now is to get a lawyer to deal with the legal stuff and move on with your life.",
            "Yup. It's fucked bro. \n\nShe's gnna go boom\n\nAt least she doesn't hold hate for you.",
            "Maybe it’s all just catching up with her finally. She probably feels like she wants to crawl under a rock or stay in bed and never leave. No matter how much you are there for her she seems like she has to do this in her own. It sounds like it’s by no means a fault in your part, maybe she has very bad coping skills and just never moved on from her dad dying. \nSorry that’s probably not very helpful but from the info you gave I’m trying to put myself in her shoes and see it how she would",
            "Hon,\nI sincerely say to you that it's going to be okay. Let it be. You are going to be okay and even better.",
            "I'm going with the assumption that this is related to her dad's death.  I would try to find that counselor for yourself as soon as you can.  Maybe someone who is an expert dealing with loss can tell you what approach you should be taking.  A counselor might be able to tell you whether riding this out is best or that there's a real danger here and your wife needs intervention. Also, long shot because of privacy, but maybe get an appointment with her primary care and tell her doctor what's going on.  At some point she may go into her doctors office and if the doc has info on what's going on they can ask the right questions and maybe order additional tests in case there's something they can look for (something out of balance).  I guess the lawyer up thing is a necessary evil but I'm looking at this as your wife has had some trauma and she's having a mental health issue and needs help.  I know you feel helpless but one thing you want to avoid if you can is looking back at this situation in 3 years and feeling like you didn't do everything you can to help her.  The guilt will eat you up.  Now go find that counselor.  Many employers have employee assistance plans that can get you free visits....  If you don't have one try finding out if your wife's company has one as they typically cover anyone in the same household.",
            "You might not see this but maybe shes scared of losing you like she lost her dad",
            ">The problem is just that I feel a lot of guilt about, what if she's actually in crisis and I leave. \n\nDon't use this as an excuse to indulge your desires to try to save your marriage.  Your marriage is over; when someone comes home, informs their spouse it's over, packs a bag, leaves, and is on message for the next three weeks, the marriage is over.  This does not happen in healthy relationships and there is no way a relationship survives an event like this in a healthy form.\n\nNow.  That said, you should consider that you are probably the last person in the world who should be trying to help your ex-wife right now.  Even if your motives were right - and I don't see how they could be given how she's wounded you - you're still not in a place from which effective help can flow from you to her.  She is going to need that help to come from some other direction, if indeed she needs it at all.\n\nI'm with everyone else who commented who thinks you need a therapist, a lawyer, and some alone time to clear your head and sort this out.",
            "This is how my ex-fiancé left me. \n\nHave you done your part? Yes. Has she done hers? No. She failed you. \n\nNo matter what the fuck else is happening in her life, or what else is happening in yours, you were the guy willing to do the work.\n\nYou’re a better person than her and you’ll be better off without her.",
            "That sucks brother. Sometimes in life you find yourself in a helpless scenario like yours. \n\nIm going through an ugly divorce that involves a 2.5 year old girl that i havent seen for 8 months and there is nothing i can do about it either, i wholeheartedly understand.\n\nThe only thing i can think of is wait it out and see what happens. If she comes back and explains herself then evaluate the reasons because it can happen again. Unfortunately since there is such an extreme case then you need to look out for yourself and not remain in limbo. Doesnt mean you start seeing other people but take care of your mental health and not obsess over why or when shes coming back. \n\n&#x200B;\n\nThe advice im comfortable giving is if/when she comes back dont welcome her with open arms. She needs to know its not ok, but dont be harsh.\n\n&#x200B;\n\nAll the best, hopefully it all works out soon.",
            "Sending virtual hugs, man. I have no advice, as u seem to really have as good an understanding as anyone could. I guess you could just make sure she knows the door is open (if it is). My heart goes out to you.",
            "One thing you might want to do some research about is \"schizoid personality/disorder\". Oversimplified, this affects people to push/keep people out of their lives out of the fear of getting hurt, whether it is knowingly or not. Sounds a lot like what you described your wife as.",
            "No matter how much you love her, she's shown you just how little you mean to her. It's time to start looking after yourself. Get a lawyer, get your affairs in order. She's determined to self destruct. Don't let her take you down with her.",
            "Just... don't give up.",
            "It seems your wife is going through a breakdown and she urgently needs help and I don’t have the answer to that specifically. I’ve had two breakdowns but they stem from domestic abuse but I think your wife is in so much shock at losing her dad that her brain cannot comprehend.\n\nBecause she’s pushing every one away I think she will burn out and if you just give her the space and tell her you’re there for her no matter what and to let her know you’re one phone call away.",
            "I’ve been through grief and did the same thing when my mother past away, but I made it worse and took it out on my partner and told them to never speak to me again. It’s still to this day (9 years later) my biggest regret.\n\nAll I can say is at this point, her mind is most likely made up. There’s plenty of Counselling for this. Go to it. Work through it. You are in my thoughts, sir. And hopefully knowing someone who did something similar  and they regret it can give you some peace of mind.",
            "I hope your wife will be okay. I work in the mental health field. Based on the way I read your story, I would be concerned that she is suicidal. She may not be and just severely isolating, and I hope that she is not. But its not uncommon for those that are suicidal to \"cut ties\" in an attempt to lessen the pain. Sudden changes in behavior is also often a sign. If it's something you think could be true for your wife, I'd consider talking to those still close to her a about keeping her physically safe.",
            "What I would do is tell her that you do not want to see her until she wants to do something to fix the marriage/her life. Clearly this is hurting you, and I think if she wants to ghost you and only give prepared statements you should tell her she is no longer welcome to unless she actually wants to talk.",
            "Honestly, you’ve probably done this, but perhaps let her know you will do what she wishes, but you have one request: Explain why she is doing it. That you’re struggling to understand and you need an deserve some explanation to help you sort through your emotions. That seems to be the biggest thing messing with you. Why? I would just want the truth as awful as it might be.",
            "I really feel for you. I had a very close, dear friend do something similar to me. All I can say is that, as hard as it is, you cannot force someone into therapy, cannot force them to confront their issues, and cannot love them hard enough to get them out of their shit. \n\nShe does seem depressed, but I wonder why this death has set her off so much? Does she have any background of trauma? Regardless, she seems determined to avoid any meaningful relationships and to throw herself into work. She is pushing herself to the edge, for reasons you cannot understand.\n\nYou can only grieve for the person you love, who is...not there right now. \n\nI am sorry, my friend, for what you are enduring.",
            "This may be way off but have you discussed having children to any great extent?  She is of the age that a deep maternal urge may have crept up on her and is all she is focusing on.  I could be v. Wrong but u can't underestimate how powerful this basic biological need is.",
            "Hello I'm really sorry for what your going through, at this point and time it's more important for you to concentrate on what is best for you!\nIf later down the line she comes back to you then so be it. But until such time you must  focus on you and carry on with your life. I know it will be hard and painful but it can be done be strong and have faith and courage, in time this will pass. 😊",
            "You don't need to feel guilty for leaving her or giving up on her. She left you and has already given up on you. There's nothing you can do, talking to her family, friends won't work and I'm sure it gets back to her, and you've tried talking to her with no success. My question is, since she has started working so much, are you sure she's working? \n\nAll of a sudden working so much, then leaving you so unexpectedly, she could be seeing someone. If she gets off usually at 5 but says she works till 9 that would give her 4 hrs a day to be with someone else. Just saying that might be a reason for her sudden exit from the marriage.",
            "Same exact thing just happened to my brother. His wife lost her mom, he helped her get the moms house and affairs in orders for 6 months after, and then on Christmas this past year she told him she wanted a divorce. Nothing else bad happened, according to him, and he’s not one to lie to me. Now he’s living in his own apartment. She also refused to go to therapy. I don’t know what to tell you other than you’re not alone. Sometimes people just really suck. I’m sorry.",
            "It sounds to me she is needing space and over working to block out the grief. \n\nIf I was you I would give her the space she needs but also send her something humorous once and awhile and say I thought you might like this. \n\nPeople that push others away subconsciously want someone to care but not be intrusive so humor works for many of us.",
            "Wow, i'm sorry you're going through this. She abandoned you, when things get tough in a marriage you stick together and work it out. She's cold that she can just cut you off like this without even trying. I wouldn't put too much effort in getting back someone who could do something like this. She's proved she can just get up and leave and she'll most likely do it again in the future if she comes back. You need to focus on yourself and your well being. She chose this. I know it's going to be hard but lean on your friends and family. Your wife had a change of heart and ditched you. It's time you start moving on and calling a Lawyer. She needs to know that you're not just going to sit around until she decides to come back. Whatever she's going through does not warrant this treatment. No explanation, just unhappy.",
            "Could this possibly be a medication side effect? If she was prescribed any drug to help her cope after the death of her father, it could be the cause of her behavior. Read \"Medication Madness\" by Peter Breggin, M.D., who is a psychiatrist.",
            "Some handle death differently and throwing themselves into work is one of the ways to distract themselves from the sadness.  That was in October though, so while still sad, she should’ve been a bit better by now.  Are you sure there is nothing else going on?",
            "Your wife sounds very similar to me. Space is going to be the best thing for you. Either shell come back or she wont. But bugging her and trying to persuade her is going to bot do anything but damage her idea of you. If she genuinely loves you, shell be back. \n\nIve been with my husband for 10 years (almost 11) we dont fight, we disagree a little bit but overall, we have a picture perfect relationship. (Im def projecting myself on to your -very different- relationship) ive been over our relationship for a while and have been looking for a way out when it would have the least impact on our family. If my dad died, id probably leave my husband too. Thats a really big, life altering event. \n\nIf its meant to be, it will be.",
            "Op, when my sister died unexpectedly last year, I pushed my bf completely away, and even blamed him for her death (long story), he stayed by my side through all of it, even though I didnt deserve him...it took me months to start being happy again and moving on....its a year n a few months later, and though it still hurts, I'm grateful to him and I know him being there is what brought me back...I was distant and cold, so caught up in my own grief I pushed him away and my family and friends. Idk if this will help, but maybe knowing it's not your fault will ease your mind a bit. When someone is so caught up in their own grief and themselves, i/they dont realize the damage they are doing to others. And when i/they do finally realize it, like I did, I thought I couldn't come back and didnt think I could fix the damage that I had caused. Be strong OP.",
            "Your wife is showing classic signs of clinical depression. She is not feeling sad, she is feeling numb and when someone feels that way you can’t talk her down or get through because you are emotionally involved. She needs therapy and some chemical help. Again you can’t force that or suggest it. All you can do is support and let her find her way. Good luck but I am afraid she will either come to the conclusion she needs help or she won’t. If she doesn’t then you best move forward.",
            "Had a similar thing happen to me... feels like the world is crashing down, I know. It's been a difficult five years since but am now as happy as I've ever been... keep your head up- no matter the outcome, you'll come through it!",
            "Im sorry you're going through this, that really sucks. I hope life gets better really soon.",
            "I’m really not saying anything new here. But looks like it’s been nearly a month. Time to move on. It really fucking sucks to have to end a marriage when nothing drastic even happened. No warning sign. No chance to fix things. But all in all, it’s within her rights to wake up one day and naturally change her mind. Fortunately or unfortunately this is the freedom that we have. I hope you take care of yourself and time heals your pain and whatever pain your wife is going through. Get your therapy, keep yourself busy but also do take at least a small amount of time to self reflect and be on your own. As much as it hurts.",
            "That sucks dude I'm sorry.\nNothing you can do she has to help herself you gotta respect her wishes and let her self destruct...\n\nYou can't wait around to pick up the pieces but you can be there to pick them up if you wanna come crawling back.\n\nThis is gonna be hard for you don't get nostaligic and move on.",
            "I really felt that last sentence.",
            "When you lose a parent, as I have, it changes your very being. You see things very differently and want to make things happen, good bad or whatever it may be. I was in divorce mentality for a long time, but after I witnessed my mother's passing it changed how I saw others in my life. I knew I had to make changes. Maybe not the best ones, but I needed them at the time. Good luck",
            "I'm so sorry! This is horrible. I'm happy you are taking care of yourself and moving forward, that is absolutely the best thing you can do! Good luck with everything matey",
            "When you said she didn't want to talk or work on things because it will hurt just like this again next time, I don't see cheating. It sounds just like severe depression. Perhaps her pain over her dad made her realize that loving someone so much can practically kill you when they die or leave, and she is cutting everyone out to protect herself. Of course, that's faulty thinking, but depression clouds your judgment. Sometimes, in depression, a person is barely hanging on, and composure is a full time job..Anyone bringing you up may have her teetering on an emotional breakdown. I would write a heart felt letter. Perhaps she won't read it right away, but she may read it when she feels stronger. Convey your support and tell her, you will step away. Then do so, and take care of yourself. Sometimes people need space to think.",
            "This does not sound like a depressive episode.\n\nDepressed people don’t turn into workaholics and decide to start putting in 60+ hour workweeks.\n\nShe’s making it seem like she’s having an affair.",
            "It's either:\n\nGrief\n\nMental illness\n\nGuilt\n\nAn affair\n\nOther secret\n\nOr combo of some/all. She's hiding something and not being true to herself hence why she can't face anyone and refuses to talk",
            "So many similarities to my situation its mindblowing. Only differences are we were together for 11 years. 9 of those years were great. We hardly ever fought or argued though we have albeit rarely (about 1 real spat about 1 or 2 times a year (about dumb stuff mostly). This is where our stories differ........about year 10 we started drifting apart. Our communication was scarce and our intimacy was almost non existent. On January 2019 she just came to me with tears in her eyes that she didnt want to be with me anymore and told me I would have to move out the house. It's now May 8, 2019 and I have come to find out she is now taking anti-depression anti-anxiety pills..........which is ironic, because while we were together it was ME that was on those meds and since we broke up I have had no need for any medication. I still love her and she probably still loves me, but when we now communicate via text her replies are very short like several word responses. \n\nSometimes it's hard to let go, I know we wont ever be together ever again. We are not enemies yet we are also not friends. I have only until recently accepted that. Since January if have lost 15 pounds maybe more just off the stress and lack of sleep alone. Your still young.......you will fall in love again. For me it's going to be tough to ever fall on love at my age of 45\n\nYour life will continue. Keep going foward and keep getting that workout in.....trust me, it helps. Best of luck",
            "Two possibilities:\n\nThe one you presented where one day she decided to up and leave in the middle of a workday for no reason and is just destroying her entire life for nothing. She ignores you and doesn't communicate except through scripted messages because that's just how she talks now. She was working ridiculous hours every day bc her dad died.  She's so depressed that her work life is completely uninterrupted since the breakup. It's all \"depression\".\n\nOR:\n\nShe has met someone else at work with whom she started an emotional affair when her dad died and was seeing him while she told you she was at work. He gave her an ultimatum that he wouldn't be dating a married woman. She came home, got her shit, and went to his place that night.  She now communicates with you through scripted messages to protect herself pending the day you discover her infidelity and she can have you served and protect herself legally by submitting these communications through the courts.\n\nI advise you to WAKE UP and do basic research. Check shared bank accounts for suspicious activity. Look at phone records.  Hire a lawyer.  Get advice on separation. I totally understand your desire to save your marriage, but it looks like there's no marriage left. You're groping around in the dark for a live grenade. Snap out of it and protect yourself, before it's too late and it blows up in your face leaving you with a lot of permanent scars.\n\nSigned, Been There",
            "Sounds like just one of the million things that can happen to a relationship bro. \n\nIf you're officially divorced go find someone else. Sounds like it's not you're fault and you can take you're good character to someone else. \n\nIf you're not divorced. Just wait for her to have an emotional break down. She sounds extremely tough. Her breakdown is going to be along the lines of near suicide. But that's where her standard lies and that what's got to happen because she's not talking to you at all. \n\nSounds like her relationship with her father was drastically more important than her relationship with you. Sorry to say. It's ok. That's her fault not yours. \n\nI believe she's working so much to avoid her emotions. And she's not going to counseling with you because the therapist will just dig up her emotions. When she breaks down she might pour tears for 24 hours and not be able to get out of bed for a month. Expect something like that to happen if she gets her emotions dug up. \n\nTotally tough. It's a mortality thing.",
            "You say there isn't anyone else.  That's doubtful.  Women don't just check out like that.  My mother in law disappeared kinda like this but she left the state for a guy she met on world of Warcraft.   You need to talk with a lawyer to protect your interests.  You may want to hire a private investigator.  They might be able to find out what's really going on.",
            "I feel like there is missing information here. Or at the very least this is a very biased version of what happened.",
            "Has she talked to a divorce lawyer? Do you have plans to meet with one? Giving her space and time to figure herself out is also hurting you. The stress...the worry... and the situation being out of your control has got to be extremely difficult for you. Ghosting you and not dealing with the life she chose to leave is not ok. She needs you now more than ever if you are all in and want to save the marriage, all you can do is do what you can and control what you can in a situation where you are not in control. Giving her support and space at the same time. Get yourself into therapy and gather your own support. Rally with her support and try to get your wife the help she needs. I hope you can reach your wife, help her, and save the marriage, if that’s what you want.",
            "Even though you say she hasn’t met anyone, I wouldn’t fully believe it. When there’s no convincing the other person, and the relationship is just dropped-no questions asked, that could be a sign that she’s found someone else.",
            "So many people in this thread are convinced your wife is depressed and that is why she left you.  If I read between the lines here, most likely she has left you for someone else. You never know what is truly inside another person's head, and it's actually pretty easy to be in a marriage but be living two different lives. It's shitty but it's common place.\n\nThe mere fact she cut off other people tells me she's hiding it.  I've seen this happen too. She has to ensure that no one you both know finds out about it. Just telling it like it *most likely* is.\n\nTake care of yourself, OP.  The death of a marriage is hard. I've experienced it first hand. But you can come out the other side if you take care of yourself.",
            "Well, she can’t ignore her problems forever and it’s all going to catch up to her....and you can’t protect her from that. Right now, she’s running...and if you try to follow her and catch up to her she’s only going to run further away. Nows not the time to take action in that direction....it’s good that she’s still in contact with her friends and her mother and you don’t want to loose that ability to know what she’s up to and that she’s safe. And it’s important that she has her friends and her mother to monitor her mental health. \n\nHonestly, I think you should go see a therapist. Both to unload about the burden that she’s put on you, and because they’ll be able to give you good coaching on how to deal with someone in such a delicate state. How you get her attention eventually is that you serve her divorce papers, force her to confront the you and the mess she’s made. Likely, it won’t come to that. It’s only been twenty days, and she’s going to crash and burn sooner or later because she can’t sustain this. And you don’t need to be afraid of that...she’s a grown girl and she has people really alarmed and vigilant who are monitoring her and making sure she doesn’t hurt herself. Her baggage is not your responsibility and her happiness is not your responsibility. I know you can’t stop from worrying about her and caring deeply about her, but she’s done something incredibly hurtful to you and if she doesn’t turn around and work on getting better...then she’s out of excuses past a point really. \n\nOk so I have Bipolar Disorder right...the more severe kind where I might walk out on my job, and spend my life savings chasing some delusional idea I had about being God or something and needing to buy a bunch of expensive supplies to create a tool to harness my powers if I’m having an episode. I mean that’d be the extreme of having a manic episode, but it’s happened before and I can’t help that it could happen again. But that doesn’t give me a free pass to hurt people and I’d still loose my job and all my money, and that would be permanent. And, at this point, it’d never get that bad because I know I have that pattern/tendency and so do the people in my life and they’d express their concerns. And even before I was diagnosed, I was scared- I knew there was something seriously concerning about my behavior and I knew my life was falling apart around me. And that doesn’t mean there’s no forgiveness or patience from the people around me...but if I hurt someone thru my actions once, I have to learn from that and owe it to them to work on my mental health. It’s always my job to ask for help, maybe I’m not in a place where I can get it together and check myself into the psych ward if things get really bad...but it’s my job to tell someone that that’s what I need. And the same goes for your wife, the grief she’s experiencing may make her actions understandable or forgivable but it does not excuse them. She can’t be protected from the consequences of those actions...and that’s  a good thing too. Sometimes you’ve gotta just let someone fall on their ass. The only thing I’d say is to make sure that her mom removes anything that could be used to hurt herself or someone else from the house. And I don’t want to alarm you by saying that...but just as a precaution and I think you’d sleep better at night.",
            "Kind of late but I have a theory, was she taking contraceptive pills before and has she recently stopped?\n\nTurns out the pill will fuck up who you are attracted to, but it's reversible if you were to stop taking it.\n\nTake my word with a grain of salt tho, I just want to see if this theory holds up.",
            "Contact a divorce lawyer and protect yourself. Whether she's having a mental break, seeing someone else, or something we haven't thought of, you must protect yourself first and foremost.",
            "It sure as hell sounds like she's been hiding some shit you don't know about and has now decided to end the relationship in a very calloused way. \n\nBelieve people when they tell you who they are. It's not a depressive episode. She dumped you.",
            "Bud, this sounds 85% like my story. He mum died last year and after a week she wanted out. I was hurt because for years I told her to keep a part time job and look after her mum because money will eventually come. I gave her the space to be with her mum because I could not be with both my parents so I thought it was the right thing to do but alas. \n\nI tried everything in my power to convince her otherwise, I thought that it was depression because she had a major loss, I proposed counseling but she said no and then I saw that she had court papers ready to move ahead with the divorce. I was hurt again but tried to ignore it and make it work, till an incident occurred 7 months after she wanted to split  and due to it I got a hold of her phone. I found out that night that there was someone else in the picture and the person was there a few months before her mum passed away. I was told that I was not there to provide emotional support whereas this person was. And here I thought I was looking after the finances to give her time to look after her mother. \n\nWe are about to file for divorce and after I found out I didn't really care and used that time to heal and be a better version of myself.\n\nI pray that you dont go through the same, but go back and try to piece together the events to see if there was any odd behavior that you ignored. Mine was not questioning the amount of time she was spending on the phone where even her mum who was on her last breath inquired about her long conversations.",
            "I see that most comments are assuming that your wife is going through some sort of self-destructing downward spiral. I just read through your post and comment history and I'm going to have to 100% disagree with the general consensus here. It does not sound like your soon to be ex wife is in crisis at all - it sounds like she has tried, for years, to be ok with a marriage changing into one that she had not originally agreed to. You flat out lied to her from the beginning: you knew that you were bisexual since you were 13 and had dated/had relationships/had sex with men - all of which you continuously *lied to her* by changing their sex when telling her about your past or just omitting them entirely. But, you didn't tell her the truth until *AFTER* you married, taking away her right to make an informed decision about choosing you as a life partner. That is *seriously* fucked up.  She hasn't ghosted you, she isn't having some sort of mental break. She has ultimately decided that she is very unhappy being married to someone who chose to lie to her repeatedly and is acting like she simply wants the marriage to be over.\n\n\nHer leaving did not come out of nowhere. You massively betrayed her by keeping your bisexuality a secret until *after* you two had gotten married. I think that perhaps you mistook her no longer bringing up your bisexuality as acceptance: \n\n>It took my wife a good while (about two years or so) before she was comfortable enough about my sexuality and our relationship to finally stop bringing it up in arguments and to actually embrace that it's just a minor part of our relationship\n\n\nThat does NOT sound like she was comfortable or embraced it at all...she simply stopped bringing it up during arguments, which sounds way more like she switched to just bottling her feelings on the matter up. Do you see how it sounds way more like it's something that deeply upsets her and she gave up even mentioning it because it was something you couldn't change? I mean, it's not like she could ask you to go back to being the straight male she thought she married. She had literally no choice but to accept who you were now telling her you were. It sounds like she tried to do that but realized that she wasn't happy about it.\n\n\nShe's telling you that she's unhappy in the marriage, doesn't want to waste time in counseling and she isn't telling you why because she knows it's useless and the two of you have hashed it out for *years* already - you aren't able to change your sexuality, she's not into it, and she doesn't want to be in this type of marriage anymore. So, for now she's throwing herself into her job and giving you scripted answers because she's just done.\n\nNot many marriage survive when they were based on a lie. On top of that lie was the pressure of this:\n\n>we were in a position where we either had to marry or had to break up because work obligations were moving us to opposite sides of the world\n\n\nYours was not a marriage based in truth and open honesty. I know it feels like this came completely out of the blue for you but you literally began your marriage based on a huge lie. The signs of a crumbling partnership were all there the entire time - the almost breaking up when you came out to your wife a few years ago? The *two years* of arguments between you two after you came out? Her just no longer bringing it up? Yeah, that was her quietly checking out of the relationship because she finally accepted that she was lied to and she isn't getting her original husband back. This was a long time coming for her and, sadly, there's absolutely nothing you can do about it.\n\n\nYou have embraced your bisexuality and you are loudly and proudly out of the closet. That's great! But, that isn't the person your wife married and she has every right to leave because she is ultimately unhappy remaining in the marriage. Let her go, don't make the divorce difficult.",
            "IMO you need to leave her alone. You can’t force someone to be with you if they don’t want to be.",
            "no one ghosts a long term relationship without there being someone else already. Takes one to know one. That's a big part of the motivation to just end it all.  When someone knows that they have other options and esp if there's someone else they are close to emotionally and/or physically, then they stop caring about their current partner and they start to see the grass as being greener on the other side with the new person. This pisses me off. Once the brain focuses on someone else it becomes kind of an obsessive fantasy that this other person is so much better than their current partner. Ghosting is an extremely selfish, heartless and uncaring thing to do. People who do stuff like this will not care what they do until someone they deeply love does the same in return to them one day (and it will happen in return). People who don't ghost or abandon their loved ones have already learned why they shouldn't ghost or are more mature and don't need to bother because they know how to work things out with people by communicating and because they care about people and know that things should be done out of love and respect for others. There is always room for improvement and relationships do improve with work and communication. No one should treat anyone as disposable. This type of thing is scarring for years, you can ruin someones life and sanity, they may even kill themselves. I feel for you. =(",
            "She met someone else. Long hours at work. I’m sure",
            "Yeah, she’s banging some other dude",
            "I'm not going to tell you 100% she met someone else.\n\nBut dude, brace for the blow now, because when I've been in your shoes or heard of stories of people who have been in your shoes, 9 times out of 10, there is someone else. \n\nThe reason why you have to start thinking this now is because you don't want to be unprepared for when you start hearing rumors of her \"moving on too quick\" from your marriage. There's someone else. Its rare in these situations that you don't find out that she \"moved on too quick.\" This is the entire reason she doesn't want to work on the relationship and just wants out right now. \n\nYou've got to brace for that blow now because its coming. I can almost guarantee it.\n\nIt's either she met someone else or she was never the person you thought she was when you fell in love with her and got married. Because that person would never just abandon your marriage without fighting for it or trying couples counseling.\n\nYou think her friends and mom are just letting her self-destruct. I guarantee you she's already justified her leaving you to them and made you out to be the bad guy so she can be with whoever it is she is about to suddenly be in a relationship with. They might not be actively sleeping together but I can guarantee you there was an emotional affair she's been hiding, or a co-worker/acquaintance who she was curious about who she is going to allow to pursue her.\n\nSo there's two options here and both are devastating, and its better you prepare yourself for the blow now rather than have a double whammy of grief when you find out.\n\nThere's someone else. Or she's so selfish as a human being that she'd break your heart and destroy your marriage without giving it a chance.",
            "You sure she hasn’t met someone else? Sounds like she has and is hiding it from you.",
            "When i read stories like this I'm more than happy to be single.",
            "Dude.. she's fucking someone.  Come on.",
            "I’m not trying to be mean, or read all these comments but, 6a-9p? \n\nSounds like she most definitely found somebody else. 🤷‍♂️ cut ties brother, she’s not gonna change her mind at this point. :/.",
            "Geez, no matter what shes going through to leave you when you've got no problems (by what you've said) seems extreme. I feel very sorry for you. Youre married and this seems very bizarre. Even if she comes back to you, I feel something like this is going to really impact you for a long time. If my husband did this to me I'd feel so hurt and would not be sure if I could forgive him.",
            "This is one of the main reasons I really only do casual relationships at this point. It is just really hard to count on someone else to share so much of your life in 2019. You can think everything is great, meanwhile your wife has told herself she is in love with the guy who brings her coffee in the morning, and that he is her true soulmate.",
            "She is probably getting the D from someone else. Sorry to say this man.",
            "Sorry you had to go through that. But from the sound of everything and past experience there is a third party involved. She has scripted her talks with you that's a tell tale sign. She had this planned for a long time and her friends and family knew what was coming and have been told directly what to say to you (even if they say different). She knows you love her but she doesn't feel that way about you anymore, so she pretty much doesn't care about your feelings anymore. It's really unfortunate but most likely met someone at work probably started with a emotional relationship and turned into something greater. Or maybe did see a therapist and fell for the therapist who knows. But women are strange creatures they tend to do things there own way and I mean that for every single one. It's better to worry about you and find someone who loves you for you.",
            "How can you be sure she hasn’t been with someone else this whole time.  I know your going to get defensive but I highly highly doubt she’s been working everyday from 6 am - 9 pm.  The fact you even believe that is just showing how blind you are.",
            "Let her destroy her life.",
            "Most likely, there is another guy involved.",
            "Time to find someone new.",
            "Take her on a surprise vacation. This woman needs to have fun. You guys need some time together. You're her partner, I think you're right that you need to fight for her even if she won't. She's become a workaholic and she needs an intervention. Call her boss, family, get a fun vacation secretly planned, have it so you meet her at her desk one morning and whisk her away. Maybe I'm just a romantic but might just be enough to snap her out of the malaise.",
            "Dude! She's  been having  an affair. Not more complicated than that! One of two things  can happen she will eventually  realize  her passion was mistaken for love and return or He or she is the one (not likely) ifyiu had a good relationship. The painful  part is that women are very feeling driven not moral nor logical by nature so you never know what they will do! You could be the most thoughtful  compassionate man and they are so unstable  with their emotions that you will   be punished. . .",
            "She's too old for you anyway. Just upgrade.",
            "Your wife has succumbed to what so many women these days do. Shes ignoring all the things you two have built together because she thinks that she can do better. She thinks that she can go out and find a better looking man who can give her more. She might be right, but she is most likely wrong. \n\nUnfortunately, theres nothing you can really do about this.  Trying to talk her out of this will just result is either you being ignored or her yelling that you cant control her. Itll hurt a lot. \n\nThe only thing you can do is do you, man. Save money, improve yourself, and pour yourself into something you enjoy and is productive. Go your own way. Itll be hard at first, but it's so rewarding in the end",
            "Send.   Her.   Some.    Flowers.    And.   Wait.   For.   Her.    Reaction.    Then.   You'll.   Finally.    Have.  Her.   Comeback.   Or.   Have.   The.  Closure.   You.    Deserve.    By.   How.   She.   Responds.   It's.   Just.   An.  Idea.   At.   Least.   You.   Can.   Say.   You've.   Tried",
            "[removed]"
        ]
    }
]