[
    {
        "post_id": "h0dhsh",
        "author": "endless_pastability",
        "title": "UPDATE: I asked my bf for alone time and he told me to pack my stuff and leave for good.",
        "url": "https://www.reddit.com/r/relationships/comments/h0dhsh/update_i_asked_my_bf_for_alone_time_and_he_told/",
        "score": 4378,
        "num_comments": 250,
        "created_utc": 1591803824.0,
        "selftext": "Update in regards to: my original post that \"[I asked my bf for alone time and he told me to pack my stuff and leave for good](https://www.reddit.com/r/relationships/comments/g7x81m/i_asked_my_bf_for_alone_time_and_he_told_me_to/).\" \n\nWell, as a likely shock to no one, we (me, 30F and him, 29M) broke up. It wasn't as swift as some comments encouraged... we reconciled after he insisted he hadn’t meant to end things and had overreacted out of emotion. We gave it another shot living in our own places again for a few weeks. Things went well enough, but unresolved trust issues became exacerbated as I was not in his physical proximity as often and he felt insecure about the distance between us. \n\nUltimately, a few weeks after reconciling we ended up in another argument after dinner one night. There was once again a very disproportionate reaction to a situation that should have been more calmly communicated about, and I realized if we reconciled again I'd be in the same position a few weeks later... it had become an exhausting cycle.\n\nWe aren't in contact this time. He found the original thread I posted and was (understandably) hurt by what I wrote and for not sticking up for him. I am sad, mourning ending the relationship, and feeling bad for hurting someone I care about. Frustrated that it was so messy, that it didn't work out, etc... just taking things a day at a time and trusting that I made the right choice (which is hard when there's no answer key for life to check against.) Send your most encouraging and hope-restoring love-after-30 stories. \n\nTL;DR: we tried again and then broke up.\n\nEdit to add context/clarity to the first paragraph.",
        "permalink": "/r/relationships/comments/h0dhsh/update_i_asked_my_bf_for_alone_time_and_he_told/",
        "comments": [
            "My after 30s was filled with dating, travelling the world and ended up with my heart broken again at 39.  I’m now 43 and engaged to a wonderful man.",
            "The thing that stood out in the original post is that he complained when you were upstairs, then complained when you came down to hang out. \n\nThere is no winning with people like that. No matter what you do they will find fault and keep you in a perpetual state of contrition to them. It's controlling and meant to leave the other person exhausted trying to make up for perceived wrong-doings.  And you can never make things right because expectations shift and often contradict previous demands. \n\nTrust you made the right decision.",
            "I’m sorry you’re sad now, but I can assure you it will pass. You’ve made the right decision, and it doesn’t mean that either of you are bad people, just not compatible.\n\nAs for the 30s, it’s actually super weird but all of my closest female friends, including my sister, found their amazing partners in their early thirties. After struggling with douchebags/ people who are not the best for them/cheating FIANCÉS in their twenties. I think it’s something to do with finding your own comfort zone, accepting yourself finally, communicating your needs/boundaries and in general less fucks given about other people and their opinions. I wish you luck and honestly I’ve no doubt you’ll find a great partner as just as I’ve said, 30s is where it’s at!",
            "Someone who asks you to pick your stuff and leave, in the midst of a pandemia nonetheless- is not long term relationship material. Anyone who asks you to leave the home instead of talking is not someone you can trust.",
            "> He found the original thread I posted and was (understandably) hurt by what I wrote and for not sticking up for him \n\nSo he wasn't hurt by the fact that he was causing you so much pain that you needed to go to an outside source of support, just that you made him look \"bad\".\n\nYeah, you're better off without him.",
            "First, you are better off without him.\n\nLove after 30. My best friend has had a string of serious boyfriends but recently she (at 34) got together with a friend of hers from college and she got pregnant on the first time they were together. She opted for aborting and he came with her to the appointment and they had a little ceremony where they read out something to the fetus and said goodbye to it. Both of their jobs lead to travel, but they always make time to call and text with each other and she made certain when they were first together to make sure that his priorities are in line with hers. They're planning to officially move in once the first person's lease is up for renewal and starting a family soon. \n\nMy husband's aunt didn't meet her husband until 36, married at 37 and had her kids at 38 and 40. Those kids are now in their mid-late 20s and getting married themselves. \n\nMy friend K got married in his late 20s but it didn't work out and he was divorced with a young son by his early 30s. He and my friend S ended up falling in love and getting married about two years ago. His ex is also remarrying soon.",
            "I ended a 13-year relationship at age 30 and I was utterly convinced I'd die alone - but I'd rather live and die alone than with my ex by my side. Without even trying I met my current boyfriend not even 6 months later and we've been together for 6 years.\n\nI think the secret is to take some time to reflect on your life and just go out and have fun with no expectations. Don't put pressure on yourself to find someone, take a breath and do enjoy life. Don't settle out of fear or pressure (or God forbid you get back together with him), you'll regret it. You've been just given a fantastic opportunity to restart your life and truly be happy, this is the time to do all the things and more!!",
            "Don’t be discouraged! It’s possible to find love at any age! All of that “if I’m not married by the time I’m in my 30s, I’ll be an old maid” shit is tired. Now is the time to fall in love with yourself. I truly believe if you focus on loving YOU first, a healthy romantic relationship will follow when you’re ready.",
            "Ending a relationship always hurts because you don't stop caring about someone just because you've realised that dating them isn't right for you. But the world isn't black and white and you're right, there's no answer sheet. Ultimately all that matters is that you're happy. And I think you know that you wouldn't be happy if you'd stayed with him, or else you wouldn't have been able to bring yourself to break up. \n\nYou might feel crappy now, because your lifestyle and future plans have become uncertain, but please look at this as a chance to start over and fulfil your own needs and desires! Take some time being single, build yourself back up, and then start again with a partner much more suited to you, one you'd never have met if not for this break up. \n\nBe grateful to your ex for showing you what you don't need or want, and don't be afraid to put your foot down about these qualities in future relationships. You're still young! Definitely young enough to find love but old enough to know what you want and to not settle.\n\nGood luck!",
            ">  I’m feeling frustrated that I attempted to handle this in a productive and proactive way and somehow screwed up. \n\nYou are internalizing this way too much. **You didn't screw up.** You can't control his reactions. He behaves according to his nature, and there is no magical combination of words and actions that would change that. When someone tells you who they are, believe them the first time!",
            "You deserve a partner who's as willing as you are to be introspective and considerate.",
            "I’ve been seeing a therapist, and after processing a bad breakup, I said to her recently “I’m done hurting myself to make him feel better.” \n\nYou had a need to be alone, and he wasn’t willing to respect that. It’s good you were able to see the pattern of exhausting arguments. Why should you have to minimize or disregard your personal needs to appease him? Of course, a relationship will have times of giving and taking but it sounds like you were doing all the giving and he was doing all of the taking. \n\nThere’s no time limit or deadline for you to find a relationship, you’re not too old at 30. It’s so cliche but for me, putting in the work on myself, loving myself, finding out what I truly love and enjoy, finding out more about my personality and quirks and attachment style, pouring into new hobbies, all of that has been incredibly healing to me. You can be sad and grieve the loss of the relationship and also be happy and optimistic for a better fit in the future.",
            "> Send your most encouraging and hope-restoring love-after-30 stories.\n\nI'm 40. My best friend did a ton of online dating, looked for someone throughout her 30s. It never worked out. She stopped looking and figured she liked her life, she liked her career, she was cool being single and that was that. Then a couple years later met a friend of a friend and they've been joined at the hip ever since. He's amazing and we all love him. They're talking about a fabulous destination wedding when covid is over. I can't wait. He's a great guy and he's so good to her (and her elderly father). She had a good life before and he just enriches it.\n\nYou shouldn't have to deal with so many compromises. Relationships are work, but they shouldn't be as hard as yours was. When I started dating my now-husband, I couldn't believe how ... easy it was. It just worked and we make each other's lives easier. Not harder and more frustrating. And he'd never make me cry over a mattress.",
            "He found the thread, read the comments, and his takeaway was that he was mad you didn't fall on the sword for em?\n\nI don't think you're really missing out on much.",
            "I'm sorry that it didn't work out!   \n\n\nBut I can tell you a love-after-30-story. \n\nIt's about my SIL (sort of. Her brother and I are not married). She has (had?) a difficult relationship with food, and underlying issues. She felt like her life was not starting off the way she wanted it to for a long time. She went to a pretty intense, long therapy program. After about 6 months, she started to feel better. After another 6 months, she fell in love with another guy in the program. They moved in together last winter. She is 31 (I think) now, and they moved quite quickly. The advantage of being a bit not-20-anymore is that you know what you want. It's great!",
            "[deleted]",
            "Love-after-30 story!\n\nWhen I met my partner on OkCupid, I had just turned 30. He was 43 at the time. He thought I was too young to date, but he thought my profile was hilarious and messaged to tell me so. We decided to try dating despite the age difference and fell crazy in love. I’m almost 33 now. \n\nOne of the most delightful moments in our relationship was when I was musing on June being a really great month. It has my birthday *and* our anniversary! That’s when I realized that his dating profile had 30 as the lower bound for his age range — we fell in love as soon as we met, but OKC only showed him my profile once I aged in. \n\nHe did not find this as amusing as I did.",
            "I’m sorry you’re hurting. You’ll look back and see the situation with much clearer eyes. You’ll be okay.",
            "I would be thrilled to hear these love-after-30 stories, as I'm now 33 and single again after four years.  It seems like there have been a lot of posts lately (or maybe I'm just relating to them more?) about people breaking up when they realize that, despite the love, it won't work out long term...either because life goals are different, or personalities don't mesh.",
            "The soda machine needed to be rocked back and forth a few times before it could fall over. This is a beginner's end-move. More experience will bring cleaner resolutions when you see the red flag wave. Trust your gut. You're going to be awesome.",
            "Lol did you lie in the original thread, or are you being emotionally manipulated again into feeling bad that you said he did what he actually did?",
            "[deleted]",
            "I (m34) was in a similar cycle with my 6-year ex (f30), until, the fourth time we went \"on a break\", I called the whole thing off, started looking for my own place. I was trying not to seriously date anyone for a while, my sister had just passed (its her birthday today, happy birthday, Lily) and I wasnt sure my brain could be trusted. I met the most amazing woman (f35) I could have conceived of. We are now happily codependent and joining our lives together. \n\nThe really amazing thing about dating in your thirties, i found, is you have a much, MUCH, better idea of what you want, what you need and what you need to avoid. Is seven months too soon to move in? Maybe, I don't really care. Haven't thought about my ex in months. \n\nAlso, you didn't hurt your ex, from what I've read. Your perspective of his actions challenged his sense of self. A year or two into my last relationship, I did find it hurtful that she would always talk through our problems with others before she came to me with them. But by the end? I would have expected her to take desperate means, such as airing our dirty laundry on reddit, if i thought she actually wanted to fix things. Oh, and slutting around between relationships is fun, but not required, despite what sitcoms may have led you to believe. If you find your person and its only been like 4 weeks, that doesn't change that theyre your person.",
            "I just wanted to say I’m at the love of my life at age 35 and we are married and have a family and I could never ask for anything more",
            "Hello fellow MDer,\nTake your time to feel everything you need to feel.\nI'm also happy you have enough self love to know that this was unacceptable behavior and did not tolerate it.\nKinda want to see your dog lol. I also just finished a good book if you're into a psychological thriller!\nTake care. 💕",
            "Not quite after 30... Long story short I met my current husband when I was a single mom of 2 at 28. We married a year later and shortly after my 30th had our first child together. The second followed 13 months later. Nearly 13 years later we are still together and looking forward to many years to come.",
            "You seem like an articulate, intelligent person.  As hard as this break up is, it's near impossible to end any relationship on perfect terms , so try not to think about the mess. Maybe in a few months or however long, you guys may be able to contact eachother as friends /acquaintances and tie up any loose ends ... Or maybe you'll find in yourself that it's best left to rest .  The latter is probably the best option in my honest opinion.  Your (ex) partner sounds a lot less mature than as you come across.  He shouldn't have been angry about finding your last thread either. You simply reached out for help and didn't paint him in a bad light at all. It was just very clear that he was in the wrong and he got embarrassed. You didn't hurt him , he hurt himself.  \n\nWell done for recognising the pattern and ending things btw.  You seem as if you have a vested interest in self-preservation .  A lot of people (me included) probably would have tolerated this kind of behaviour, forgiven him/ let him have his way and suffered the consequences until we physically couldn't take it anymore .",
            "Try watching he's just not that into you. \n\nAlways picks me up after a breakup.",
            "My dad's two main relationships stated at 38 (for 9 years) and 63 (married for 14 years so far) \n\n30 is not the end.",
            "That ain’t messy. That was an adult, conservative process.",
            "You don't need to stick up for him when he is the cause of the heartache in the situation. I hope he will read this thread and see other people's continuing responses in support of you and your actions, rather than him and his reactions.\n\nHowever, in his defense, I do have to say that this COVID situation that causes some people to continue to be busy with work, and others to not be as busy without work, does create a situation in which the not-busy partner may feel like he or she is not getting enough personal or romantic attention.\n\nIt was something that could have been solved or resolved, even after a time of 2 or 3 months, maybe slightly more when people who didn't actually lose their jobs, will start going back to work at those jobs, but instead, one or both let it become the thing that affects the relationship negatively.",
            "My wife and I have been married for well over 30 years. Our most difficult time was in our 20s, because no one ever told us how to manage difficulties. So, we made our mistakes early in life. \n\nYou will look back at this one day and realize how much you’ve gained from going through this failed relationship. You will go forward knowing how to better manage dealing with your partner. You will come to understand how important that calm, reasonable communication is. And honing those skills will give you a much better ability to find and keep someone who shares your love and wants to meet your needs. \n\nNow, get out there and start looking!!",
            "I met the man I’m going to marry at 31. I had agreed to go blues fusion dancing with some friends of a friend of a friend. I don’t know how to blues dance, much less blues fusion dance, and I was not trying to meet anyone. He says he started crushing on me pretty much the moment he laid eyes on me, and he asked me to dance. We have been killin it ever since. \n\nOne great thing about dating after 30, at least dating someone emotionally mature after 30, is that there is no bullshit. We knew each others’ stance on marriage and kids before we even got out of the hookup zone. I had a lot of feelings about being on the wrong side of youth at 30, especially because the guy I was with at that age was pursuing 24-year-old models. But B thinks I’m the hottest person he’s ever been with no matter the age, and I think the same of him. And since we were already both whole, competent adults when we met, it’s been so easy to build a life together. I'm still afraid we may end up having age-related complications when we get to the point that we're trying to start a family. But that possible future no longer seems as bleak as it did when I was 30, because I know that I have the right person at my side.\n\nI absolutely believe there is someone waiting for you who will make all of the things you are going through now worth it.",
            "Reading through your previous thread and this one as well, I'm glad that you realised that you are worth more than a never ending cycle of argument over inane things with someone who didn't seem to take your interests and career seriously.",
            "Girl how you gunna let him manipulate you even in the break up. What do you have to feel bad about? Do you know how bizarre it is to break up because you want space???",
            "You've made the right decision. He has to understand what alone time is.",
            "You made the right choice.  This guy had big issues and you didn't know the dance.\n\nI don't know if he was aware that you could hear him when you were upstairs but maybe he was.  Then when you came down  “ugh it was quiet until you came down”.  Was a snipe.\n\nYou hand complained about needing quiet earlier and he was punishing you for that.\n\nUnfortunately your ex is kind of childish and sees rejection in anything that isn't catering to his own needs.  Your need to have quiet time or quiet when you work doesn't suit him.  He could have worn headphones.\n\nWhen you needed to go home for a day he took that as a rejection too and so rejected you harder by telling you not to come back.\n\nI don't know why he's like that; maybe how he grew up.  But you can't have success in that situation because normal behavior doesn't work.",
            "I dont have a \"love after 30\" but i do have a story that involves me almost marrying someone and that ending. I was engaged to someone for 2-3 years. We lived together all during that time. He was an awful person and when he needed his space he would send me back home for a week or 2, then id figure out that was his way of breaking up with me. We'd talk and then he'd pick me up to go back to our (he called it his house even though we bought it together) house. Literally it was horrible and i thought i really loved him. (A lot more went on that was abusive) I was extremely depressed when i finally ended things. I couldnt take it, it took an extreme toll on my mental health. (that part of my life feels like a whole past life). Years go by and i have the worst luck with love. I literally gave up. I was sick of relationships and i only wanted to be with myself. I get hired at starbucks and the guy who used to stare at me in the grocery store but could never say hi, and used to turn around to talk to me in high school.. was there working at my new store. We would check the schedule to see when we would work together (we did this without the other knowing) and he asked me out when we finally did work together. We have been together ever since. Literally he kept asking me out every single day because he missed me, and i missed him so much that id agree. We both found out too that we've always liked eachother but nothing came of it until last year. He even screenshotted when i followed him on instagram a few years ago. We both thought the other was too good. This is the healthiest realtionship o have ever been in. And i thank god every day for him. There is always hope for love and I someone who gave up on it and was completely destroyed by it, found someone who makes me forget all that. You'll be ok ❤️ there isnt a time limit on love, and there's no age limit. Sometimes it comes out of nowhere and sometimes it takes time to build. Love yourself for now and i promise you things will be ok ❤️",
            "You cant control anyone but yourself.  Respect yourself.  Focus on improving you.",
            "If two people decide to move in, it should not be forced upon them by a quarantine.\n\nYou’re entitled to your space.\n\nYou’ll be fine. You’re not responsible for his feelings.\n\nEven couples in long term relationships need space. Mrs. IMaGrownAssWoman will retreat and take time to herself and thank god that she does. I want to be left alone as well. We’re in our 50s and crazy about each other. At a certain point we get to an age where we like to be alone, but together. Does that make sense?  \n\nThe important thing is...\n\nAlways show respect for yourself and your space and you’ll naturally attract people who will demonstrate the respect they have for you and the space you need.\n\nGood luck.",
            "He wasn't your person and that's ok.  🤗",
            "This thread is giving me so much hope. Almost in my 30s and just got out of a 4 year relationship. I needed this, and sorry OP but you did the right thing. Be kind to your self",
            "I’m literally about to ball. This thread has so many people opening up about their post 30s love. I just turned 30 and have been in a real emotional rollercoaster of a relationship for the past 6 years. He was my first. It started off horribly as I thought I was in love, but over time he showed what (in hindsight) a little douchebag he was. Can’t say that didn’t change over time as he seems to have matured some, but the sparks are gone with only a strange questioning left. In any case we try to work it out but every month there’s a super turbulent period, it’s an exhausting cycle and though I’m glad it’s improved some, i keep being told that there are others who can just jive with me, who can “flow” with me. I can’t help but wonder what that feels like, the true love must be nice compared to the toxicity and messiness that everyone (including OP) speak of in their past relationships. If only everyone had the courage to press on..",
            "Love after 30: Met my SO (I'll call him KH) seven years ago at a gathering, after spending the afternoon being screamed at by my then-partner. Upon meeting he was funny and kind and I smiled for the first time in days. We briefly became friends, though by no means close ones. He was kind and calm and funny and mynchild also adored him. Then suddenly he fell off the radar. Partner at the time told me that I was loathed by all in the group, especially KH. Came to find out he had told said group I loathed them. \n\nFast forward four years, finally broke free of shitty partner and moved on, renting a house next to KH (was reluctant due to proximity but didn't want to pass up a haven on the water for my daughter and I). Was too shy to talk to him for months, due to letting my ex's manipulation get to me. Then one day KH went by with his paddleboard and smiled at me, stopping to say hi. We ended up talkin for hours. Every day. Every day since.\n\nWe got married on May 4th. He is the best man I have ever ever met. \n\nI promise. Love after 30 is possible, and worth the wait.",
            "Love after 30 story for you!\n\nFriend of mine dated a guy who mildly sucked for at least 4 or 5 years (they’d been dating for a while when I met her so I’m not sure how long). Every time I hung out with them they constantly bickered and it was always the same arguments. When they finally broke up, she was 31. So what did she do?\n\nShe traveled the freaking WORLD by herself. She took the next step in her career and started making boatloads of money. Then, a few years after they broke up (so she was like mid-30s), she found a much better, much hotter dude and they’re doing great! The first dude was holding her back from living her best life, tbh.\n\nYou’ll be great, don’t worry! Live your best life and be a good person and good things will happen.",
            "I ended a toxic 11-year relationship at 35. I later reconnected with a former co-worker, discovered we were the loves of each other’s lives and are now happily married.  We’ll hit 5 months of marriage on her 40th birthday in July.",
            "Pretty much almost everyone I know (including myself)  ended up finding longterm partners in their 30s.",
            "Best I can tell you is that love after 30 will be the best love you ever loved. Being that age makes good and bad people easier to spot from the beginning. And the more relationships you have, the better you get at knowing yourself and knowing what you want, and the more swiftly you will act to take it or let it go.\n\nAnd once you get a taste of a true, supportive, nontoxic relationship, you won't need anyone to tell you what's so good about it...So happy that you opened up yourself to receive it. Congrats on the 200lb weight loss, it looks great on you :)",
            "Find time and support to work on yourself. I have never been happier to be able to know who I am and my self worth after working on myself post break up. Everyday just focus on the small wins and positives. Easier said than done I understand but it’s what you have to work with.",
            "You're going to definitely find more love! I met my current partner at 31 and after a few relationships that didn't end up working; I now see relationships in such a healthier way and have loved the times I have been single. This is just another stepping stone to learn and grow. Proud of you for recognizing that negative cycle and getting out of it. I went through a similar one years ago. It really does get better because you get better. Good luck out there!",
            "I'm 34 (35 later this year) and last year I started a relationship with a woman soooo probably you won't end up alone :)",
            "Hey u/op, thanks for posting an update! May sound futile, but really means a lot! We get involved in people's stories also emotionally, and most of the times we never get to know their evolution/ending.",
            "It's not easy after a breakup OP, but it WILL get better over time!\n\nI met my partner in my late twenties when I had an alternate plan - to live my life, learn to love myself and how I would fill my life going forward (fostering cats and kittens!).\n\nI was happy and content, dealt with the baggage from my previous relationship, and was ready to make friends to expand my social circle!\n\nThat's when I met my current partner through our mutual friends (who never really thought to play match making) and we just hit it off really well! Here we are (nearly) 3 years later!",
            "My mom is almost 60, and found someone she loves dearly 3 years ago. They bought a house together and she's so happy. That after a really shitty marriage with my dad which took them ~30 years. So you're probably still good to go!",
            "My in-laws met when they were 34 and 37, and had my hubby at 40 and 43. They just celebrated their 30 year anniversary on May 27th. They are still going strong, and still love each other very much. Don't worry about your age. You're only 30. You are a wonderful and intelligent woman, and you deserve to be with someone who will treasure you, instead of just settling.",
            "Please let me know how you feel after a few weeks of no contact. I’m in a similar boat with my gf where the cycle keeps repeating. Big fight, reconcile, repeat. I am being extremely weak and not ending it when it’s probably best.  Good for you for realizing the cycle keeps repeating!",
            "You did the right thing",
            "For hope on love after 30.... i spent 9 years divorced from a man just like your guy. I kept ending up w the same type of guys.... when i stopped dating, and took time to learn me and decide i deserve more? Thats when the magic happened",
            "I never had a good relationship previously. Met my current boyfriend just before I turned 31 on Tinder. We've been together almost two years now. This past weekend we had a pretty rough patch with communication issues. He's moving and I was in a rough spot and neither one of us communicated properly to each other and I got upset.   \n\n\nSunday morning we had coffee and croissants and talked it out. He listened to everything I said, I listened to everything he said. He never once blamed me and said we have to talk to each other otherwise will erode the foundations we're building with each other.   \n\n\nI promise you there is hope. Good men are out there and you can find love at any age.   \n\n\nMy other friend met her now boyfriend after a horrible abusive relationship/marriage in her early 20's. She is now 60 and been with her partner for 4 years and counting. I have never seen her happier and he is a wonderful man with two grown sons she loves (she never had kids). There is always, always hope.   \n\n\nGood luck OP, I've no doubt someone out there will scoop you up who is worth your time and love.",
            "Sounds like he had an anxious attachment type of personality.",
            "Your original post reminded me a lot of my narcissist abusive ex and he’d often make snide manipulative comments like the one to the dog and accuse me of cheating for wanting to go to my house for a night which he refused to go to. I’m soooo happy it ended and you can breathe easy and move on to a much healthier relationship when you’re ready.",
            "Hope-restoring-love-after-30\n\nI was married at 29 divorcing when turning 30, met my future wife around then. Been married 6 years and together for 8. \n\nYou could say this dont count because i was just turning 30, bu i say tomatoes.",
            "I’m sorry for your breakup! FWIW though I found who I think will be my partner for life at 30, and our 30s should be the best time of our lives ❤️",
            "35 and I've found love within the last year. You have plenty life in you yet - don't settle for less than you're worth though, or just for the sake of it  (it's easy done).\n\nYour posts portray a caring, kind, self-aware, grounded and reflective personality - you'll find another guy that suits you well (and will be delighted to have you).",
            "Oh you definitely made the right choice. I can't believe a 29 year old is acting like he is - this is kid behavior.",
            "Live you're life. ... Jesus Christ",
            "That's a good outcome for both of you, it seems like you had not much in common.",
            "Here's apiece of advice you REALLY need to follow - when someone disrespects you like he did and basically tells you to get lost, you don't swallow your pride and \"reconcile\" with that person.  You didn't reconcile - you simply ate the shit sandwich he served up to you and still clung to him, hoping he wanted you - and  not  surprisingly, it didn't end well.  Of course it didn't - I could have told you it was the kiss of death the moment he first said it to you.\n\nNext time, don't swallow your pride.",
            "You gave it another try and ended up in the same place. He is clearly very insecure. So now you know that you made the right decision and can move forward without regret. It’s not easy. You had good times too. But it’s for the best.",
            "I was married for 10 years, three kids in with a classic narcissist. We split when I caught him cheating....again. Jumped into a horrible rebound relationship that I pretended was good for me. Another two years wasted and I just turned 31. I had pretty much given up, was trying to get content with meaningless dating a few weeks at a time then starting over. Then out of nowhere I met a man who was exactly what I wanted, what I needed. We dated, he was freshly divorced and still scared of his ex wife presiding over his life, we were madly in love and were moving super fast. We dated for two and a half months and it was bliss, until he went to a counseling session with his son and the counselor pretty much told him he was wrong for being in a happy relationship so quickly and he should break up with me and focus on his kids. Sooooo he broke up with me a week before Halloween. It wasn’t a typical breakup, we still talked every day and reassured each other it would all be ok, deep down we knew what we wanted and I was dead set in seeing this thing through. We slowly start dating again but don’t put any labels on it, we go on a weekend getaway in December and see each other on Christmas. He stays at my house when he doesn’t have his kids (50/50). His birthday comes around in January and he goes into a depression because his ex wife left him on his birthday and she was also talking about moving their kids three states away and he was worried, he breaks up with me again. I am heartbroken but I try to understand where he is coming from and try to give him space. I spend the weekend at home with my kids pretending I’m ok and he goes to his best friends a few hours away with his kids. He comes back home and calls me to check in, decides to come over to talk and we decide to stop letting fear get in the way of happiness. We decide to get married and start planning a wedding.He moves in permanently and we set the house up to accommodate 6 kids. We take the kids on an awesome spring break, go on our first out of stare adult vacation, his first plane trip. We ended up ditching the big wedding and eloped in June, went on a Bahamas cruise in July for our honeymoon and my birthday. We started looking at buying a house in July but got denied because of credit, we thought it would take 1 or 2 years to clean it up and qualify but we closed on our dream home in a gated community December 23. Kids had no clue, they thought we were just looking for a bigger rental, we got to surprise them all on Christmas Eve with our brand new home. We can’t have anymore babies so we got our first puppy on Memorial Day and our one year anniversary is this Saturday and we are taking the little on a weekend road trip to the beach and to see his best friend. From given up to living out my dream life with my dream man in less than two years. Don’t give up, listen to your gut, not your heart, your gut.",
            "I met my husband at 34. Married at 35. Had a baby at 36 and then again at 38. Just turned 40. \n\nWhat's nice about dating in your 30s is that you're settled into who you are, you know what you want in life, and when you find someone compatible, things can move quickly.\n\nWe got engaged after 10 months of dating and married 6 months after that. \n\nI was able to travel, be independent, buy a house, meet people. It was great. You'll be great too.",
            "Read both, agree it was for the best. Take it as a learning experience, and you know what's more compatible for a future partner. He'll learn the same. Don't end it on hate though, and hopefully months down the road you two can be friends that grab coffee once or twice a year or something like that lol.",
            "I like to think that people become more critical thinkers, in their late 20’s and early 30’s. \n\nI was in a horrendous relationship with my ex, for over 7 years. Right after my 27th bday, I knew it was over. The physical, mental, sexual abuse was just way too much on me. As I imagine it would be on anyone. \n\nI wasn’t necessarily looking for anyone else at the time, but I just needed an escape plan. I realized that I was in my late 20’s, and it was time to stop fucking around, so to speak. I met my bf I am with now, and I never looked back. \n\nI’ll be 30 in two months, and being with my bf, is the smartest decision I’ve ever made. He makes me the happiest I’ve ever been, and treats me the way I deserve to be treated. Finding love after a tumultuous relationship is very possible.",
            "My husband was 31 when we met. He had loved and lost or whatever many times. He told me if it hadn't have worked out between us he didn't ever want to date another person. He was just exhausted of dating but than we met and clicked and it was wild love from the start. You'll find a love for you. Good luck.",
            "A few years ago, I read that, in the under-15 age cohort, white people are no more a majority in the US. After reading the stuff on this subreddit for a while now, I understand why.",
            "I skimmed through this and basically it made me tired. I don't even know how women are dating those men things. I use to do it, but it was tiring and I wasn't excited about it so I hang out with me now and we love each other.",
            "He sounds like a needy manipulative asshole. Good for you and hope you find someone who deserves ya",
            "I have realized it doesn't hurt to be single I left a ten year relationship was single a year and then met an amazing dude. You are sad now but imagine being stuck in a relationship where you feel on edge all the time FOR the rest of your life. I think this is best you probably are both great people but sometimes great people aren't meant to be great together",
            "So I also had my share of ups and downs in my 20's. Became a single mom at 24, and mostly had just stopped looking by the time I was 30. I had a friend whose mom was supposedly psychic tell me that I would meet my husband within a year, and we would have a daughter. Riiiiiight......\nSo anyway one weekend I was out with some friends and I saw this guy, he was cute and very muscular--i mimicked the SNL skit Hans and Frans to my friend, kinda making fun of him. To make a long story short we were engaged 3 weeks later, my son gave him permission to marry me, we married 2 months later and I found out just before the wedding that I was expecting. Needless to say, it was a girl, and we've been married for over 17 years now.",
            "I (42f) met my beau (40m) when we were 31 and 29, respectively. We're still together with accidental twins (whom we love very much) born five years ago. \n\nLove after 30, even 40, 50, 60 happens all the time!",
            "Hey there. Just wanna say I’m sorry you’re suffering but I would like to think everything happens for a reason.  Two months ago I (26F) ended my 7 year relationship.  We were similar in that we would reconcile, then something disastrous would happen then reconcile again. I finally realized that I was unhappy and didn’t want to be on this same path 5 years down the road but now trapped in an unhappy marriage and with kids brought into it. So I left. It’s been hard, he was my best friend. I would be lying if I didn’t say I was lonely as fuck pretty often. But I’m also proud of myself for sticking it out and not being codependent and I hope you can get to that point too.  I’m starting nursing school in the fall and realistically won’t be done for 2-3 years so I will be 29-30 when I am finished.  The odds of me finding my dream guy in that time are slim. So I’ll be right there with ya. But I think 30’s are beautiful and it’s never too late to find someone. Best of luck dear!",
            "I didn't see your first post, but if I had I would have told you that that would have been immediate means to break up and leave it broken. I dated a guy and we spent time together every day, all day, until one of us went to bed, which is honestly never healthy. It also wasn't something I enjoyed. Maybe for the first few weeks, but after that, it was time for life. I asked him if I could just spend a few hours to myself every day and you know what he did? He accused me of cheating, lol. Because I wanted a few hours to myself. I'm the type of person who needs time to recharge from things and the fact that the first thing he went to was cheating was a red flag, for me. Later on, he told me he had been cheated on, so he was suspicious of someone wanting time to themselves. I knew that wasn't going to work for me. Like you, we tried to reconcile, but it really just got worse. Now, when I was having my \"alone time\", he'd text me and ask me to send a picture or call him, so I could confirm I was where I said I was. I ended it again because I wasn't planning to spend my life either having to be tethered to him every day or having to prove I wasn't cheating.\n\nYour ex overreacted and it's proof that he would overreact a lot, so you are smart to realize it was going to become a pattern and just left it alone. Unfortunately, I have no love-after-30 stories because I'm focusing on me and not really worried about love right now. Maybe not ever because, while other areas of my life may not be great, I'm happier than I was in my last two relationships, anyway, and I'd like to keep it that way. I'm finally really coming into my own and, unless someone is truly going to add to my life, I'm not interested. That's probably one of the best things about turning 30; you're less likely to put up with crap, but that also means you're more likely to find someone better for you.",
            "I just really enjoy your writing.\n\nSomething calming about how you convey/structure your thoughts :)",
            "Just want to say my love life was a hot mess \n\nI met my now husband at 30, got married at 34, and had a baby at 35 \n\nDon’t worry about the timeline, the important thing is that you don’t waste time on people who don’t appreciate and energize you",
            "You’re doing amazing! Honestly. You sound like you’re very well adjusted and that you ultimately know what you want/how to take care of yourself. It’s a huge step to know when you’re falling into old patterns and saying no, stopping yourself, and choosing the healthier road. Your story helped out this reddit user today lol. Don’t worry about age, everyone has their own pace for life.",
            "Girl, dating in your 30s is way better than in your 20s. The men your age are finally starting to get some sense! I’m 41 now and found my partner at 32. It made me regret wasting time with all the losers I did in my 20s.",
            "Make a list of the qualities that you're looking for in a partner.  Life is too short to be miserable.  Don't settle.  Your person is out there.  It took me 50 years and three marriages to find mine but we've been together for four years now and I'm the happiest I've ever been.  ❤️😃❤️",
            "Love after 30 is something story worthy? I’m not sure which country you’re from that being 30 makes you feel some sort of old but where I’m from, 30 is when people START thinking about MAYBE settling down and finding love and POSSIBLY starting a family. I mean, I found the love of my life at 30. My partner was 38. My mother found her big love at 39 and her partner was 53. \n\nAs an added bonus, divorce rates are much lower in people who marry when they’re actually mature and reach a certain age.",
            "You did make the right choice. It sounds like this relationship was not the right fit for you. Once the sadness fades, you will begin to feel better and maybe even find yourself relieved that you got out of a situation that wasn't working for you. Take it as valuable life experience; you now have a better understanding of what you wan't and don't want in a relationship.",
            "Heartbreak sucks. But you did and are doing the right thing. I held onto a guy for 18 months (where we broke up 3 times) because \"when it was good, it was so good\". Trouble is, it was toxic as fuck. Ended things a month after I turned 30, met my husband halfway through my 30th year. If I'd still be hanging on to the toxic relationship, I'd have missed the love of my life.\n\nIf you're caught up in something that makes you unhappy, it's likely you'll be too busy to see what brings you happiness.\n\nHope you feel better soon xx",
            ">We aren't in contact this time. He found the original thread I posted and was (understandably) hurt by what I wrote and for not sticking up for him. I am sad, mourning ending the relationship, and feeling bad for hurting someone I care about.\n\nI'm really confused as to why he's so hurt? He acted unreasonably and you asked for advice.",
            "Sorry to hear that. I'm 38 and my 31 year old gf ended our relationship saying that she can't do the relationship thing,  that she's a hermit and it stresses her out having me relying on her as my only contract in a new city. We're still friends with monogamous benefits and I'm moving home to my city 1000km  away. I'm heartbroken it hasn't worked out. Sorry to jump on your thread,  just wanted to share\n\nMoving back to my city to be with ll",
            "(Nearly) after 30 love story: I didn’t start dating, period, until I was 24 and I didn’t start dating my now-husband until I was 29. He had just gotten out of a toxic relationship. I had recently ended my FWB status with an ex-bf. As I knew I wanted marriage, we talked about all the important things - kids, careers, life plans - within the first month (no sense wasting time when I knew what I wanted). It didn’t scare him away. He lived in St. Louis and I lived in NY. I moved halfway across the county to live with him because it made more sense financially and in terms of where we were with our careers. We then moved in with my parents when we moved back to NY. We got married at 31. We bought our house last year. We had a COVID-19 celebration of our third wedding anniversary last month.\n\nIn living together, we figured out how we work together as a couple, how we fight as a couple, and how we make up as a couple. Our last big fight was a little before the wedding. We have disagreed on things since, but we literally have not fought again. Even when we did, our commitment is that we will always work it out, so we knew it would end up okay, even in the midst of screaming and crying. I think that since we’ve had that commitment since the beginning, it’s become so ingrained that really, why fight anymore? We present our opposing sides and compromise since we both know how we want it to end. I adore him, and he shows me his love everyday. Sometimes he’ll fall asleep on the couch at night while I’m on my phone or laptop and he’ll just hug my legs as he sleeps. These little things make me love him more.",
            "I remember your original posting. A pretty large amount of my friends and my wife's friends all met and got married after being 30. It's not that unusual especially where I am in the DC Metro area. It feels like a lot of people treat their 20s as a getting set up and established time and look to meet someone and get married in their early 30s. My wife has a friend who didn't get married until she was 40 and then had two kids.",
            "You’ll be okay! I didn’t meet my husband until 31! Four years later we now have a beautiful baby girl. Six months before meeting my husband, I was dating someone that I thought was going to be the one for the long haul... it ended badly and I was depressed. But I picked myself up and carried on. You can too! Much love to you!",
            "The exact same thing happenned to me, we tried seperatley, but I didn't feel secure and the trust was gone. If it comes to this it can only go one way.",
            "Late 20s/early 30s I spent on someone who sounds very like your ex...and got real clear on what bullshit I will never again tolerate. I met my now husband at 33. He's like...just everything the ex was not. Thoughtful and kind and generous of heart. And it's not constant work to be together, because we value a similar lifestyle and also because I'm not always monitoring my own choices and behavior to avoid setting him off. Also my husband is much hotter than the ex ;) . Love after 30 is grand. But so was the year in between that I spent single! The whole thing is live the life that works for you - single is way better than trying  to smash yourself into a relationship that doesn't fit.",
            "Where you screwed up in all this is not accepting the fact that he broke up with you.\n\nI went back and read the first post; he kicked you out. You two were done. Why did anything continue after that? \n\nLet people dump you. Seriously. \n\nAs per who was right or wrong or all that that’s a red herring. It’s unimportant. Being incompatible with someone is enough without it becoming a question of morals. \n\nYou want my advice for dating after 30? Learn to listen to your partner. When they say you’re done, you’re done.",
            "I mean if my family gave me a job I barely had to show up for and a house and season NFL tickets I wouldn’t want to quit and move to DC either damn.",
            "Just curious babydoll, is he a Gemini? Lol",
            "I’m not sure what to say. A year is a long time, mate. She might be feeling financial stress like a lot of us are these days. I understand not working the last few months- but what’s up with this year of unemployment? Did you work at all? \nNo attacking you but we gotta keep it real. Not trying to get you down. Trying to see both sides",
            "Got all the alone time you need.....",
            "[removed]"
        ]
    },
    {
        "post_id": "9zpoag",
        "author": "None",
        "title": "[UPDATE]I (37F) feel bad not inviting my sister (39F) to Thanksgiving because I don't want to be around her husband (38M)",
        "url": "https://www.reddit.com/r/relationships/comments/9zpoag/updatei_37f_feel_bad_not_inviting_my_sister_39f/",
        "score": 4361,
        "num_comments": 124,
        "created_utc": 1542990687.0,
        "selftext": "Link to original post:\n\n[https://www.reddit.com/r/relationships/comments/9ya9d4/i\\_37f\\_feel\\_bad\\_not\\_inviting\\_my\\_sister\\_39f\\_to/](https://www.reddit.com/r/relationships/comments/9ya9d4/i_37f_feel_bad_not_inviting_my_sister_39f_to/)\n\nI want to say thank you to everyone for all the wonderful advice. I had a lot to think about and consider.\n\nTwo days before Thanksgiving I decided to ask my mom if she knew what was going on with my sister. She told me that she just found out from the kids that my sister and her husband took off to another state for a last-minute vacation, without the kids. She didn’t tell anyone and left her kids pretty much alone. My parents live nearby and would have been happy to have them over. Apparently, my sister’s mother in law lives on the property in an RV with no electricity. Mother in law has schizophrenia and does not take her meds. I didn’t mention in my original post, but the kids are 16M and 15F, the older kid does not have a driver’s license. They also live out in the woods, a good distance from the closest town. At this point, I had decided not to invite her over. \n\nThe day before Thanksgiving, my dad called and told me that he believed my sister was under the impression that she was coming to my house with her family, even though I haven’t spoken to her. I told him that her husband was not welcome, and he said I needed to tell her because he didn’t want to stir up trouble. I didn’t want to call her because she was alone in another state with her husband and I didn’t want that to start a fight. My dad took it upon himself to call her and ask her directly what her plans were for Thanksgiving. She said she was coming to my house and he told her to call me first because there are issues. She never called me and told my mom later that night that she wasn’t coming home until after Thanksgiving. My mom invited both kids to my house for Thanksgiving.\n\nMy nephew decided to go to his cousins (on his dad’s side), where there is absolutely no supervision. My sister and husband are apparently okay with this. Thankfully, my mom was able to get my niece to come with them to my house. I took the opportunity to spend some time alone with her. She opened up about her problems at home and asked for a lot of advice about college, jobs, etc. I told her she is always welcome in my home and invited her to spend some time with us on her Christmas break. I gave her my number and told her to text me anytime, especially if she needs a break from her home. I don’t know if she will take me up on my offer, but it’s there. \n\nI’m pretty disappointed that my sister would leave her kids on Thanksgiving. Her daughter was hurt by this, but now she knows there is someone that will support her and be there if she needs it. All in all, we had an awesome, drama free Thanksgiving.  \n\nTL;DR: Did not invite my sister to Thanksgiving because of her abusive husband, but was able to give my niece a lifeline which might make all the difference. ",
        "permalink": "/r/relationships/comments/9zpoag/updatei_37f_feel_bad_not_inviting_my_sister_39f/",
        "comments": [
            "Thank you for doing what you could for your niece.  Might I suggest a weekly \"check up\" text and occasional get togethers (lunch, coffee, homework help?).\n\nIf he is abusive to his wife, that girl might also be in trouble (emotional abuse us very damaging), and being there to monitor might help her more than you realize. ",
            "You need to call CPS and report all of this. Protect those kids. They don’t deserve it. ",
            "Is there a chance your sister could be being held against her will on this vacation?",
            "I’ve been in a terribly abusive relationship. \n\n\nFirst, until you know otherwise you should assume your sister was not given a choice about the vacation away. In all likelihood he decided for her and going against him was not safe. \n\n\nYou should also know that it takes an abused partner something like 9 tries on average before leaving sticks. Leaving is the most dangerous time for an abused partner. Even when the abuse isn’t physical, while leaving the possibility of *dying* is very real. And in these situations the abuser often doesn’t just kill the partner, but the kids and/or family trying to help. Your sister needs to go to a domestic violence shelter where they will hide her and help her in all the ways your family is trying to help too. They will help with resume, child/spousal support, going to court, therapy for her and her kids, getting her own place or relocating her if that’s necessary, etc. \n\n\nWhen she leaves she puts your parents in danger by staying with them. She doesn’t mean to, and it’s entirely understandable why she would want to go to them but she really needs to go to a dv shelter for all their safety. \n\n\nWhen I was leaving an ex-boyfriend who was a federal law enforcement officer, shelters across the country helped me relocate to a safe state one by one until I was about 3,000 miles away. Me and each shelter worked together to find the next shelter until I got far enough away. It was terrifying knowing that he had the reach to find me nearly anywhere. But it was also empowering to get away and start a life without him. It’s been like 10 years now and I’m in a much better place but not without repeating my mistakes until I figured myself out. \n\n\n",
            "I was in an abusive relationship myself, but what came to mind & God I hope im wrong. Be careful the reason he left the kids & they just went on vacation is he may try to hurt her out there. It's sad, but it's e the reality & how u must think.  I hope shes ok ",
            "Damn, read your original post.\nGlad you are reaching out to their kids. It's sad as hell that your sister is trapped in that cycle of abuse, and it'll only end if he goes to jail, or one of them dies, most likely your sister at his hands.\nSo, you can either get super involved, which will probably require someone beating the shit out of this guy, or wash your hands of it, and wait until you get the call that he finally beat her to death.\nThis situation is way bigger than a Thanksgiving dinner. Tough situation I wouldn't wish on anybody, but that's the reality. ",
            "Everything about this story is so heartbreaking, and I hope that your sister is able to get away from her husband eventually. Good for you both for not tolerating his abusive behavior and presence, and EXTRA good for you for reaching out to your niece. \n\nIt’s so hard to watch the people we love cycle through these destructive patterns. All we can do is be there when they’re truly ready. Best of luck with the rest of the holidays.",
            "Thanks for thinking to update here",
            "I agree with the other post about calling CPS. The man is an abuser and he and your sister are neglecting them by just leaving them like that. Maybe she was manipulated into it, maybe she wasn’t. In either case, the kids deserve better.",
            "This is a sad situation and I’m sorry you’re all going through it. Especially those kids. Good job auntie. I hope she does reach out to you. ",
            "I'm glad there was an update. I'm so worried for your niece and nephew. ",
            "I think it might be a good idea to start keeping documentation of this kind of stuff- printing out multiple copies of text messages etc. In case you need to get your niece and nephew out of this situation, call CPS, or take the husband to court. Do it on the DL of course. Not sure what state you’re in, but what your sister and her husband did might legally fall under child neglect-15 and 16 year olds can be left alone for a night or two but not for a full week alone in the woods without anyone to stop by and check up on them regularly...and you know...were they left with enough food and money? As they cant drive, imagine what could’ve happened if one of them had been badly injured somehow. Perhaps even worse, is leaving an unmedicated elderly schizophrenic woman alone without a care giver or an adult guardian. She’s a victim of this abuse too...and I know that schizophrenia sounds scary and it’s grossly misrepresented in media- but schizophrenics are actually much more likely to a victim of a violent crime than a perpetrator. This woman is incredibly vulnerable, and, seeing as she is unmedicated and I’m assuming she has difficulty with day to day functioning from your post, she needs to be in a home or in the care of an in-home nurse. God fuck this scumbag. \n\nYour doing the right thing by focusing on the kids.  Your sister is in denial of the true horror of this situation right now. Hopefully she’ll come around for real, but there’s nothing you can do to force this change. What you can do is have these kids backs, protect them, and be ready to step in and pull them out of that situation if the time ever comes. ",
            "I’ve just read both of your posts, it’s so similar to my sister in law it’s unreal.\n\nShe’s my boyfriends sister - her husband is vile, we’ve had so many problems the last few years, she’s left then gone back then left then gone back so many times. Then the police were involved and so was a restraining order, but she went back yet again. We’re at the point now where we don’t ever see him. She goes to their parents house with the kids - which sadly means that’s the only place we ever see her. I don’t know what will happen when eventually his parents pass away.\n\nThis is probably not much help to your situation, but just saying I can relate. It’s ok to get to a place where you only see her, as much as it’s limiting and it sucks. You sound like you’re doing great with your niece, I know I’ll try to do the same with our nieces and nephews when they’re older. \n\nBest of luck to you and your family, it’s horrible to  witness ❤️",
            "im glad that you reached out to the kids",
            "I would be so scared to be anywhere alone with him. ",
            "YOU ARE A GREAT PERSON. keep loving these kids even when it's hard. it won't get easier, but they obviously need you in their lives. You can only give as much as they accept from you, so keep you generosity permission based. but you can change a loved ones life with a little bit of love at the right time. You are giving these kids a fighting chance just by offering time. keep doing it. even if they have poor coping skills and can't tell you how much it means till they are older. Thank you. Someone like you saved me too. ",
            "I hate to say this but I'd be looking into this deeper. Your sister is in an abusive relationship and isn't in her right mind. It's very hard to leave when you're under the thumb of an abuser. Have you thought of getting you sister in therapy? I also worry her kids aren't safe. Teenagers or not. They've seen this happen most of their lives. Are they truly okay? Have your sisters back and collect all evidence of any abuse he shows. This will help her in the future because this does not end here.",
            "I absolutely understand your disappointment that she left her kids, but please remember that she is being brainwashed and manipulated by her abusive husband. On average it takes a person 6 tries to leave their abuser, seeing them go back time after time is painful, but try to keep contact with her as her abuser probably wants to isolate her from you guys because your love is getting in the way of his manipulation. If he can isolate her it’s much easier to control her and much much harder for her to leave. Keeping contact with the children is also very good! They’re also victims of the abuse. ",
            "Try to find some type of domestic violence support group in your area and get that info (discreetly) to your sister. She's making shitty choices right now, but 20 years of abuse can really grind you down. 1−800−799−7233 - National Domestic Violence Hotline.  Beyond that, there's not.much you can do - she's an adult that makes her own choices. Do try to be their for her kids. ",
            "You seem like a really great person. In the original post you wrote about your sister getting back with her husband after all he did to her. But instead of completely cutting her off, you let her know you are always there. It takes a lot to be able to do that given the circumstances. Also love that you got some alone time with your niece and were able to tell her that you are there for her and she is always welcome.Sorry you and your family have to go through this, especially your niece and her brother. At least they know they always have you. you are a great aunt and sister! ",
            "I didn't invite my sister yet she showed up anyway and took a couple of plates for her shit bag boyfriend. She's miserable already or I would have stopped her.",
            "I think your sister not leaving her abusive husband mostly stems from financial issues and her kids’ wellbeing because her husband controls all the money and if she were to leave him she would need full custody and it’ll be difficult to be a single mom of two without a steady income.  The thing about emotional abuse is the victim starts to believe their abusers and they feel so hopeless that they think they have no other option than to stay. \n\nThe trip was probably her husbands idea that she agreed to join because he convinced her it’ll “fix” their marriage and she would do anything to do that or maybe she’s afraid he would get violent with the kids if they went along. He sounds very desperate to make her stay and she probably senses that instability and is afraid that if she were to leave now it will escalate into attempted murder. It’s just hard to predict with domestic violence, so it’s very risky to leave without a solid plan and a safe space. \n\nEither way she needs support because it’s impossible to leave without it and that’s why abusers love isolating their victims. You should  maybe try asking why exactly she stayed (in a non accusing or judging way) and what her concerns are if she left to find out what is stopping her. \n\nEvery time she almost leaves it seems to stem from her having a potential job offer so I think finance is the main thing keeping her from leaving. Her husband probably convinced her that she can’t leave without hurting the kids or suffering even more. He might’ve told her he will get full custody because he controls all the money and will lie on the stands like he did when he accused her of abuse to hurt her chances of getting a job. Before she can leave she needs to know that she will have a job, a place to stay, will get full custody and her husband won’t hurt her or her kids after she leaves. Right now she probably thinks none of those are possible and the only way to convince her otherwise is counter these doubts and negativity that her husband put in her head. \n\nYou’re a great sister, some people would have been frustrated and left her alone and isolate her further.  I hope she’ll find the resources and strength to leave him.  Leaving an abusive relationship is difficult especially as a mother and she definitely already blames herself so please try not to shame her for not leaving no matter how ridiculous you think she’s being because I know that’s what most people do and it just makes them feel worse.  Domestic violence is a very complex thing and emotional abuse is something that victims have a trouble noticing until they’re in too deep, but at least she recognizes she needs to leave which is already a huge step.  Fuck your bother in law, I hope your sister finds peace one day. ",
            "I'm so glad you updated. Do your best to help the kids however you can, that's all you can do at this point.",
            "The kids are old enough to stay at home but it's not cool they left their kids at home on a holiday. My then 16 and 15 year old kids didn't want to come on a trip with us last year so they stayed home. I don't think that's the issue though. Sounds like your sister and her husband just don't care and ditch the kids whenever they want. That's very different than something mutually agreed upon by the kids and parents. ",
            "Hi OP. \n\nI know I’m late to this and it’s already been resolved (on its own). But I felt the need to comment because something EXTREMELY similar happened with my aunt and her piece of shit husband a couple of years ago and I can STRONGLY relate to your situation. \n\nThere is no easy answer. To everyone else, it’s obviously clear that your sister needs to leave that man. But it’s tricky because she keeps going back. You can’t shit talk her husband because that just makes her either resent you when their relationship is going well, or afraid to tell you things when the relationship is going bad because she doesn’t want to hear an “I told you so.” But no way should that man be allowed in your house or your lives. Your sister is making the decision to keep him in her life, but that does not mean you have to.\n\nThis is how my family handled it. I’m not saying it’s the right thing to do, and I’m not saying it will work for yours. But maybe a shared experience will at least help give you a direction to head towards (or to rule out, your choice):\n\nMy mother has made it very clear to my aunt that her husband is not welcome around our family. My mom explained to her how she doesn’t want to subject herself to that for her own mental well being, and will not allow him around our family ever again for our own safety. On the other hand, my aunt and the children are always welcome to come over and to attend our family events, but never the husband. He is a nutty, manipulative man, and we have the right to cut that toxicity out of our lives, even if my aunt doesn’t want to.  Additionally, my parents make sure to reach out to the kids and provide the structure and support they never received from their parents. \n\nHopefully this helps in some way if an issue ever comes up with not wanting the husband around again. Best of luck, OP",
            "I'm concerned for your nephew. Does he gave a close relationship with a trusted adult like your niece does?",
            "Please please please call child services on them. If her husband is abusive it be much better to get those kids out!!! Please do it for them. Abusive people don’t stop at their spouse.",
            "I think you did the right thing and I think that you probably *will* be hearing from your niece at some point. I’m glad she has someone to call. You might want to let your nephew know too. \nIf I was you I’d also start keeping a record of every text, email, and phone call (write down what the call was about- don’t forget to date your notes), and voicemail. Any communication from any of them should be documented from now on. \n\nI hope she’s able to get away from him soon. The most dangerous time in a woman’s life is when she’s trying to leave an abusive partner. I hope she’s able to get away and stay safe. ",
            "I am so so sorry that you are going through this. \n\nIt's a horrible truth that we can't stop our siblings from making unbelievably self-destructive choices, and choices that hurt their children. It's so painful. \n\nThe best we can do is have our own boundaries (like you did about Thanksgiving) to protect our own lives, and reach out to try to help their kids in every way we can. \n\nI feel for you!",
            "What your sister and BIL did to their children was fucked up. You don't leave kids alone in that kinda situation. \n\nIf you can, talk to your nephew as well, he might be being abused as well. \n\n\nr/abuse\n\nr/raisedbynarcissists\n\nr/narcissisticabuse\n\n\nSome subs your should check out for your sister and her kids. ",
            "Glad you reached out to the daughter, but you shouldn’t have put your parents in that position and just talked to your sister.",
            ">I told him that her husband was not welcome, and he said I needed to tell her because he didn’t want to stir up trouble.\n\nWow, way to be a total coward and throw your daughter under the bus, Dad.",
            "Why didn't the niece already have your number? I feel like you should have made sure both of the kids had your number as soon as you found out the husband was abusive. ",
            "I was sympathetic to your sister in your first post, and I still want to be, but, knowing how she went back to this man after court AND left her teenagers to fend for themselves is unacceptable. She is now actively choosing him, over them and they are old enough to know that.\n\nI've been in her shoes, I know how hard it is to leave, and how terrible of a hold an abusive partner can have over you. However, she needs to put her children before herself, and him. She chose to bring them into this world, with a monster for a father, and now she is choosing to keep them traped and abused.\n\nI won't be surprised when her kids leave her never to return, and or end up abused/abusers themselves. And, it will be her fault as much as her husbands.",
            "I'm glad there was something good that came out of this. ",
            "At this point it seems reasonable to file for a protection order against him so he can never step into your house",
            "Everything about this story is so heartbreaking, and I hope that your sister is able to get away from her husband eventually. Good for you both for not tolerating his abusive behavior and presence, and EXTRA good for you for reaching out to your niece.\n\nIt’s so hard to watch the people we love cycle through these destructive patterns. All we can do is be there when they’re truly ready. Best of luck with the rest of the holidays.\n\nI hate to say this but I'd be looking into this deeper. Your sister is in an abusive relationship and isn't in her right mind. It's very hard to leave when you're under the thumb of an abuser. Have you thought of getting you sister in therapy? I also worry her kids aren't safe. Teenagers or not. They've seen this happen most of their lives. Are they truly okay? Have your sisters back and collect all evidence of any abuse he shows. This will help her in the future because this does not end here.\n",
            "Please call CPS.\n\nIf your sister is too stupid to leave this abusive scumbag for her own sake then that’s her problem but she has kids that she’s dragging through this shit with her. That’s not fair.",
            "Good work with the kid, that's going to be so good for her. Even if it's just what you've done.",
            "You should feel bad for not wanting to put up with a person one day to see your sister. Sounds like you need to not let people get to you as much. And also you abuse power it shouldn’t be up to you ",
            "My brothers cut ties with me for 8 years because they didn't like my husband. The fact that they were such self-righteous asses that they couldn't deal with my choice of spouse really says a lot about how much they didn't care about me. I'm divorced now and remarried to someone they do like. They still don't come around. I've learned that if something as simple as not liking someone is enough to keep you from someone you love, you must not love that person as much as you claim you do. ",
            "I stated pretty clearly I don’t believe the OP. It’s one side. "
        ]
    },
    {
        "post_id": "3ra005",
        "author": "mybfisanurse",
        "title": "[happy!!! UPDATE]: I [30F] am a doctor. My boyfriend [29M] of 1.5 yrs is a nurse. My dad's [50M] wife [48F] of 4 years continuously makes fun of my boyfriend for his profession and I'm tired of it.",
        "url": "https://www.reddit.com/r/relationships/comments/3ra005/happy_update_i_30f_am_a_doctor_my_boyfriend_29m/",
        "score": 4327,
        "num_comments": 278,
        "created_utc": 1446506327.0,
        "selftext": "link to original! https://www.reddit.com/r/relationships/comments/3qv74a/i_30f_am_a_doctor_my_boyfriend_29m_of_15_yrs_is_a/\n\nMy first post blew up in a way I didn't expect it to, but I wanted to thank you all for your advice. You gave me a lot to think about so when it came time to talk to Cindy, I wouldn't trip over my words or anything.\n\nI took her out to lunch yesterday (Sunday), and just very matter-of-factly told her how I was tired of her disparaging my bf, how I was tired of her putting down nursing as a profession and dismissing it just as \"women's work\", and finally told her that despite her insistence that she was just joking, I found her \"jokes\" offensive and was done with hearing them. I made it very clear that my boyfriend hadn't sent me to defend him but that I was the one who was offended and tired of it.\n\nShe started to cry a little (which was alarming) and broke down and told me why she was doing what she was doing. Apparently, long story short, in her first marriage, Cindy's income was more than double of that of her husband. After a year or so of marriage, he quit his job and ended up just mooching off of her. He became incredibly emotionally abusive and ruined her financially until she was able to get out and leave him. Basically--she was nervous that the same would happen to me, and she hoped that her \"jokes\" would sway my opinion enough to leave my bf. \n\nI was kind of ??????? about her explanation, but she told me that she knew the jokes were childish and offensive, but she didn't know how else to go about it. She said that I was the closest thing to a daughter she had, and that she loves me very much and that she felt awful about everything.\n\nI started getting teary at this, and I told her that the jokes especially hurt from her because she's someone I care deeply for, and she apologized profusely for having offended/hurting me. She said she really thought my boyfriend was a nice guy and that she wanted to get to know him better, which thrilled me. \n\nI went home, told my boyfriend (who didn't know why I was gone, I wanted to be covert about it), and he was thrilled. He told me that secretly he WAS upset about the jokes, as he knew that Cindy was someone I cared a lot for, but put on a game face because he didn't want to drive a wedge in between us. He told me he loved me, and thanked me for standing up for him, and said he's looking forward to getting to know Cindy better too! And my dad is over the moon as well :)\n\nThank you for your advice, all! <3 Communication really is key.\n   \n**tl;dr**: Cindy and I talked, she apologized, my boyfriend is happy, my dad is happy, and my family is the best :)",
        "permalink": "/r/relationships/comments/3ra005/happy_update_i_30f_am_a_doctor_my_boyfriend_29m/",
        "comments": [
            "Awesome all around.\n\nCindy's reasoning is...flawed, to say the least. But I'm glad it was something easily dismissed and handled. You rock.",
            "Whew, reasonable people for a change.  Congrats!  At least you don't have to make everyone breakfast.",
            "This is also a fantastic example of a strong, healthy relationship with your partner. He recognized your delicate position, you cared about his feelings without needing him to force you, and you both proved yourselves considerate of one another. How happy. You two are pleasantly mature and functional.",
            "I'm really impressed on how quickly you nipped this in the bud.  It seems like there are so many posts here about SOs feeling hurt by their in-laws.  You didn't even wait until you thought it was an issue for your BF.  An insult to your SO was an insult to you, and you handled it with grace and maturity.  Fantastic job, OP.",
            "WOOT!\n\nI love happy endings.",
            "[deleted]",
            "26 Male pediatric ER Nurse here. Best profession in the world. I get a ton of respect from nearly everyone when they ask about my career. Occasionally some guy will laugh about me being a nurse but when I tell them how much I make, the opportunity to get a job anywhere very quickly, and having a great work family, they generally shut up and don't compare their 9-5 lame desk job to me. Also being a single male in an extremely target rich environment is every mans dream. ",
            "Thats some pretty evil/manipulative shit from Cindy. I wouldn't trust her moving forward.",
            "So she's gonna apologize to him right?",
            "Sounds like bullshit, but hey whatever, problem solved.",
            "As a 6' 2\" bearded man nurse with a successful wife, you're cool.",
            "She's an ass.",
            "In all respect to you, that explanation is complete bullshit. Glad she apologized but what she's doing psychologically is playing victim when she has a feeling of being attacked. It's a natural response, but you shouldn't feel sorry for her whatsoever as it will only fuel the behavior.",
            "Her explanation makes no sense at all. But she knows she is in the wrong, which is something.",
            "Just tell her that male nurses know where to stick it. ",
            "Good update, but man what weird reasoning ",
            "So Meet the Parents was a documentary.",
            ">I made it very clear that my boyfriend hadn't sent me to defend him but that I was the one who was offended and tired of it.\n\n>he was thrilled. He told me that secretly he WAS upset about the jokes, as he knew that Cindy was someone I cared a lot for, but put on a game face because he didn't want to drive a wedge in between us. He told me he loved me, and thanked me for standing up for him\n\n\nThis is what it looks like when both members of a couple prioritize their partner's feelings. \n\n\nGreat job! ",
            "\"I'm a shitty person with shitty past relationships, so here, let me help you by fucking your shit up too\" - Love, Cindy",
            "Cindy sounds like a nut case.",
            "As a male student nurse, fuck them. This is the hardest shit I've ever done. ",
            "This is such a wonderful update!!!!!  It seemed at first like she might be malicious about it, maybe just kind of snarky, but what a confession.  Incredibly heartfelt and from a tough-as-hell spot!  I'm so sorry that she went through that - but she had genuine care and desire to help you, just not really knowing how to best get that across.\n\n\nGlad to hear that you guys communicated and figured out the heart of the issue.  I'm sure it will bring you guys closer together and have a deeper appreciation.  Her intentions were good.  She didn't want you to go through the things she had in the past, and if it was so bad for her, then I can't honestly blame her for not wanting someone she loves to go through the same thing.",
            "I've been following this and I am honestly thrilled at how you handled it and how it was resolved. You are one badass chick, and I mean that in the good way. Bravo!",
            "I respect nurses, whether male or female, because I hate needles and someone has to do a bloody job.",
            "It sounds like you're happy - which is great! - but wouldn't you be worried that she was trying to break you up when she didn't even know the guy? Sorry,  I know you think it's great and all,  I would just be horrified and then REALLY offended if my mum or step mum told me she was secretly trying to break up my relationship - sorry maybe I read it wrong or am misunderstanding? ",
            "You're a really good partner. Standing up for your SO is a really great thing, especially without being asked.",
            "That anyone would make fun of a nurse is boggling to me. That it would be dismissed as 'women's work' diminishes both the profession and women. \n\nglad you spoke up but she doesn't sound like the brightest light on the tree.",
            "It's so refresing to see a partner with a backbone willing to stand up for their SO, even if it's against their family.\n",
            "I wonder how she would feel if she knew some nurses end up bringing home more money then doctors.\n\nRegardless though, it sounds like Cindy needs some professional help. With all of the abuse she's gone through and whatnot, she might benefit from therapy in some way. It might help her learn how to properly communicate issues like this in the future.",
            "Idk man. This seems really disingenuous to me. Like, did she even apologize to your boyfriend? It doesn't sound like it. ",
            "Wow, what a great update. Just shows how awesome good communication can go such a long way. And cheers to you for standing up for your boyfriend!",
            "She sounds ridiculous but I'm glad it's aired out. \n\nBesides, nursing is really pussy work. All that saving lives and being the heart of the medical industry and all.",
            "Very nice!  So brave of you to be open and honest, good job!",
            "You're lucky to have Gaylord Focker in your life.  Circle of trust Greg",
            "I'm a sucker for a feel good ending sometimes. Great to hear about sensible people who are willing to listen to and respect the feelings of those they care about!",
            "Wow, what a nice update.  Nice that you got an explanation beyond \"Well Cindy is an asshole\".  Hope she can get over it and be more kind and respectful to your BF.",
            "Oh, good for you and him!  I love happy updates.",
            "This is s happy feel good story. Thanks for sharing.",
            "This outcome made me happy for everybody ",
            "You can milk anything with nipples.",
            ">He told me that secretly he WAS upset about the jokes, as he knew that Cindy was someone I cared a lot for, but put on a game face because he didn't want to drive a wedge in between us. \n\nNot surprised.\n",
            "Your boyfriend sounds like a dead set bloody legend",
            "So.....the plot for the 'Meet the Parents' film??",
            "am i the only one suspicious/worried?",
            "It's great that you stood up for him without him asking, even though he secretly wanted you to do it or wanted to do it himself. \n\nSounds like you two have a good thing, I read your first post and was pretty taken back by how your step mother was treating him. \n\nGood on him for putting on a game face but it sucks he had to do it. Good thing he has you as his enforcer (not really, just making a joke). \n\nTo me that is awesome that you felt strongly enough to defend him, and it was even better finding out that he really was offended and that you defended him. Great job! ",
            "Who the fuck thinks a nurse, male or otherwise, doesn't make bank?  I've known nurses who specialized in assisting during neurosurgery who made more than doctors (GPs) I know now.",
            "A nearly 50 year old woman that uses insults, bullying, and poor behavior social and otherwise to make a point \"because she cares\"  Yea, nope.  Watch your back OP, these kinds of manipulative people engage in destructive behavior because that's what they are, destructive people.",
            "Communication FTW!!!",
            "Crocodile tears.....they're all the same.",
            "I'm not sure if I buy her explanation really, hopefully this is over but I could imagine her acting up again.",
            "Cindy is fucked in the head.",
            "Good on you for having the confrontation now, in an uncharged moment.  I wish you all the best!",
            "You all sound like wonderful people. Congratulations for existing!",
            "Well done.   You rock.",
            "My son's an LVN. I approve.",
            "This post and the original made my day, glad everything worked out in the end!",
            "Wow! I'm a senior in hs and im planning to become a nurse. I have a gf who wants to be a surgeon/doctor. This post has really calmed my nerves about the future. Thanks for the post!",
            "10 out of 10 OP, well done. ",
            "Happy family, good luck to you both with your careers. ",
            "> Communication really is key\n\nEspecially if all parties are invested in the same and as rational as we humans can be.",
            "Thank you for this post! im [32M] halfway through nursing school and worried about what my buddies really think. ",
            "It makes me happy reading everything worked out well for you!",
            "It's good that you managed to get it out of her in a grounded manner, I always find that when you do these head on confrontations it really puts them on the spot and can even make them uncomfortable. When they start getting uncomfortable it's because they know what they're doing is wrong and they'll keep playing it off as a joke.\n\nOP you did really well in conveying that you're not putting up with another inch of her fuckery and that's when she knew you meant business.\n\nSome people are speculating that your step mom only said the second part to weasel out. Whether or not that's the case isn't really important for now, as long as the disrespectful behavior halts you can figure out how to cross the other bridges when you get there.",
            "Little does Cindy know docs in residency make less than most nurses do.",
            "So many problems can be solved like this! talk about it! :D good work",
            "Well done you for bringing it up. Fyi, some of the best nurses i've come across have been men.\n",
            "This reads like an after school special.",
            "Have you seen Meet the Fockers?",
            ">  but put on a game face because he didn't want to drive a wedge in between us\n\nThat right there is the sign of someone who truly does love you and has your best interests at heart. Marry him.",
            "I am also a female physician, and the income disparity can be a little bit challenging.  Two of my female physician friends have stay-at-home husbands (not dads, just 30-something guys hanging out at home), and I and another female physician friend have husbands who make sort of average incomes.  I can imagine it might be hard for my husband to plug away at work all day knowing that I can just pick up a moonlighting shift and make as much as one of his paychecks.  I think you are in a somewhat better position being with someone who is in health care, and understands (a) how important their work is and (b) how hard you work at your job as well.  In any event, I think Cindy does have a bit of a valid concern - the income disparity does have potential to cause an issue in your relationship - even if she did not handle it as well as you would have liked.  I agree with other people who have said it sounds like you have a strong relationship based on your sensitivity to each others' needs, and that is a great place to start.",
            "This is why I come here, fucking happy endings",
            "Wow Cindy sounds batshit crazy. Who the hell deals with their problems by starting a passive-aggressive war without even stating the real problem :/ She's showing the emotional maturity of a sixth grader.",
            "all of you -  Stop this bickering right now.   ",
            "Mother fucking awesome! ",
            "I hope this guy puts a ring on your finger. You sound like an amazing partner! Congrats to your success with the situation.",
            "Title is the plot to Meet the Parents. ",
            "Wow, she was making sexist, disparaging jokes all the time because she was feeling protective of you? I did not see that coming. Well handled!",
            "I think she's lying.",
            "I would lessen the amount of time that you spend around her, and make her earn her place among the company of yourself and your boyfriend. I also wouldn't invite her in your house, because it would be disrespectful to your boyfriend (if you two live together). She tried to justify doing whatever she could to break up you and your boyfriend and admitted to trying to insinuate herself into your private life. A person who looks at you like a daughter would see that you are happy, and be supportive. I don't care what she went through. It doesn't give her the right to meddle in the affairs of others. I'm glad that you stood up for him. Also, if she wanted to meet him, and/or really thought that your boyfriend was a nice guy, she would have made an attempt to help you two stay together, not try and rip you two apart from each other. It really sounds to me as though she is just attempting to save face, and that her statements should be taken with a grain of salt. ",
            "Im so happy for you. Sorry for calling her a b... I truly hope you guys end up together doe ;)",
            "I am glad she apologized. The excuse seemed a bit forced. Cindy needs to SFTU.",
            "Male nurses are hot",
            "Wait till he spaypaints the cats tail.",
            "Until, she has a heart attack and he saves her life.  ",
            "Nice, I would've killed them all and moved to another city but you managed to avoid this. GJ",
            "Can we all just take a minute to appreciate everyone handling this like adults, and Cindy having the insight to know where her shitty behavior was coming from?\n\nDamn, thanks for the hope for humanity, OP.  :)",
            "Really love this update",
            "And your dad is Robert De Niro and your fiancé comes over and your dad doesn't like him but he tries really hard anyway and hijinks ensue also Seth Green is there he played Joker in Mass Effect, we know Jan!   ",
            "Tell her to fuck off. Assert yourself. Jesus christ you are an intelligent doctor. Why are intelligent people so bad at relationships. Here is the order of disagreements with other people (since being cordial is classy, at first). \n\n1. Right after nasty remark,\"Hey I don't appreciate those comments. I still love you but please dont joke like that anymore. Thanks!\"  Then give them a hug. \n2. Still doing it,\" This is the second time I've asked you to stop making disparaging remarks. I won't say it again. \"\n3. \"Hey, Fuck off with the comments, I'm sick of your shit\"\n4. Still? Leave. No contact. If they don't apologize then don't talk to them. \n\nGrow some god damn testicles and say what needs to be said. ",
            "DAE think Cindy's \"reasoning\" sounds kind of like an Alford plea?",
            "Go Murses! (male nurses :))",
            "Late the party but you guys should rage.\nJk lol.\nBut seriously.",
            "I'm in tears this is so sweet omg",
            "AWWWW! I am happy to read this, internet stranger :-) Good on ya!",
            "I'm glad you came out of this how you wanted, but Cindy seems like a disturbed individual.",
            "Gaylord?",
            "Oh lord all these commenters are idiots. Poor Cindy went through a traumatizing experience and her actions were completely understandable. Glad everything is good and your boyfriend sounds great!",
            "Good for you. He probably wouldn't have stayed long if you hadn't stepped up. I wouldn't have",
            "THANKS OBAMACARE",
            "Is his  name Gaylord Fucker ?\n\n\n\n\n\n\n\n\n\n\n\n\n\n;",
            "Gaylord did amazing on the mcat but he enjoys  patient interaction. \n\n",
            "At least you know you're not dating an adult who can handle his own problems.",
            "lol u dun goofd",
            "I am guessing everyone involved in this is Asian.\n\nWell, maybe not the boyfriend.  He might be a hot other race.",
            "...women are insane the way they go about attempting to communicate anything. ",
            "As a doc, i can see why he makes digs at your BF. 2/2 to society expectations. Hope all is better. ",
            "It says so much about how dumb people are that they need to come to Reddit and ask strangers for advice. I mean what the fuck, people. Are you really this dumb or just desperate for attention?"
        ]
    },
    {
        "post_id": "kju0nt",
        "author": "samurai5764",
        "title": "UPDATE: My (32m) best friend (34m) helped a woman (24f) cheat on the father of her child (1f)",
        "url": "https://www.reddit.com/r/relationships/comments/kju0nt/update_my_32m_best_friend_34m_helped_a_woman_24f/",
        "score": 4319,
        "num_comments": 46,
        "created_utc": 1608875230.0,
        "selftext": "Original post: https://www.reddit.com/r/relationships/comments/it2bwy/my_32m_best_friend_34m_helped_a_woman_24f_cheat/?utm_medium=android_app&utm_source=share\n\nUpdate: So I know not many people read the original post but I figured I'd give an update anyway. After trying to talk to my friend through October and the beginning of November I finally threw in the towel when he started being a dick on the 1st anniversary of my father's death. I kicked him out of my place and have had zero contact since. While it hurt to cut off a friendship that had lasted as long as ours did ultimately I think it's for the best. It's been 26 days since my last drink and I'm feeling more confident every day. I've discovered other friends that have been quietly supporting me and realized they were better friends than my now former roommate.\n\nTl;dr: Kicked my former best friend out of my condo and out of my life. Found life to be slowly improving due to that decision",
        "permalink": "/r/relationships/comments/kju0nt/update_my_32m_best_friend_34m_helped_a_woman_24f/",
        "comments": [
            "It’s amazing how much more clearly we see things when we don’t have someone clouding our vision. \n\nIn your case, you held your loyalty to your best friend above all, and then you were crushed to find out he’s not who you thought he was. \n\nI’m sure if you reflect on your relationship with him, you’ll see other things you let slide that you probably shouldn’t have. The cheating thing was your proverbial line in the sand. \n\nChalk it up to experience. It wasn’t all bad. The relationship served you for that time, in the way you needed. It wasn’t a failure. \n\nKeep\nMoving forward, and finding new friends. You’ll be amazed at how many good people are in the world that you haven’t even met yet.",
            "I'm in a similar process of trying to kick out a roommate/old friend that I have basically outgrown. She is SO ANGRY,  all the time, and my home needs to be my sanctuary. She's made it so unbelievably toxic. She's pissed that I stopped smoking weed, and that I have been working towards education and getting a better job. A real friend would be happy for me to have goals. I'm sure it sucks, and I'm sorry that it's happening to you. But it's good to get people with so little morals that he would help someone cheat out of your life. Here's to the next chapter of yours. 👍",
            "I had a friend who was fucking a girl... and he was friends with her boyfriend. There are some moronic types that think only the person making the commitment are to blame. They are the person you should direct most of your anger at, sure, but the other person is still a steaming pile of shit.\n\nI stopped being his friend because that isn't someone I want in my life. No reason to waste your time and energy on someone who has shown they have no regard for other people. They are trash, so good riddance =]",
            "You know you did the right thing. Curious to how much notice you gave him to leave? I'm sure he acted like an ass the entire time",
            "Mazel tov on your 26 days of sobriety! That's huge.  I'm proud of you.  Keep it up!",
            "Good for you! Once you change your surroundings, life can get much better! Congratulations on getting sober!",
            "Exellent decision, I hope things continue to improve for you, and you get better friends!",
            "What do you mean helped her cheat? There seems to be no clarification to what that means",
            "I also had a similar experience. One of my best friends had an affair with a married woman. They were both caught since it was being done at work and were fired.  Husband of the woman found out and girlfriend of friend found out too. Both couples decided to work on their relationship, but my friend was still secretly seeking the other woman. She ended up asking me for the woman’s new number and I said that I didn’t think it was fair that she was still seeking her out after her girlfriend gave her a second chance. She told me her relationship was none of my business, so I decided that I no longer needed her as a friend. \nIt is still hard right now to not talk to her whenever I see something she would like or find funny. But I think it’s for the best. \nSometimes you just discover you have different morals and friendships are broken.",
            "This is a great update. I'm sorry he turned out to be such a shitty person, but I'm glad the ordeal of trying to.decide how to proceed with him is over.",
            "Congrats on 26 days! If you think it would be helpful, check out r/stopdrinking. When I first quit drinking the support I found there was invaluable. So proud of you!!",
            "Thanks for saying \"every day\" instead of \"everyday\". Oh, also... good job. Onward and upward.",
            "Good for you have a merry christmas.now do the correct thing and tell that guy his girl cheated .\n\n\n     P.S.tell him she cheated.",
            "In my opinion a situation that really did not involve you at all is not a good reason to end a long friendship, seems really petty. It's not your place to tell him who he can and can't sleep with, you're not his dad you're his roommate. Friends don't always agree with everything each other does.",
            "It sounds like you're conflating several **unrelated issues** here. What does your choice to end the friendship have to do with your understandably heightened emotions on the anniversary of your **father's death?** What does your **recent sobriety** have to do with your decision to end the frienship? What does your sudden recognition of other **supportive friends** in your life have to do with your decision to end the friendship? \n\n\n\n\nIt sounds like you're making excuses to justify ending the friendship. You're trying to make your friend seem like a **bad guy** so you feel better about ending a 10-year friendship. You're making something about you (his \"helping\" a person cheat, whatever that means) that has **nothing to do with you whatsoever.**  That's your choice, of course, but you should be honest with yourself about what you're doing.",
            "I’m happy for you. You did the right thing. It can be very hard to cut someone off that you’ve been close with forever. However, you were able to do it not only for yourself but to let him know that what he did was wrong hopefully he’ll learn from this and you will have less stress on your back.",
            "Frankly I agree with you.\n\nI have cut friendships and even family (only 2 did this but I was close to them) For cheating on their spouses.\n\nI am wholly against cheating and those who enable it and I have hated cheaters since I was about 8 I saw some friends families torn apart because their mothers cheated.\n\nSince that day I have decided cheaters and those that help them are unwelcome around me.\n\nIt is to the pooint if I find someone cheating I alert their spouse.\n\nSorry but cheating destroys lives.\n\nI am still in contact with the friends whose families were destroyed when a child and they My friends are still devastated and never forgiven their mother and that was over 40 years ago that it happened and they had a hard time with relationships going forward.\n\nLuckily \"frankie\" and \"Denise\" not real names I took the names from a book i am presently reading.\n\nHave found some really great Souses and are happy. But it was hard for them.",
            "I read your original post, I remember it and thanks for the update! Yay for you."
        ]
    },
    {
        "post_id": "e8l8zb",
        "author": "mrsgulch",
        "title": "UPDATE: I left and you can do it too!!",
        "url": "https://www.reddit.com/r/relationships/comments/e8l8zb/update_i_left_and_you_can_do_it_too/",
        "score": 4322,
        "num_comments": 128,
        "created_utc": 1575949691.0,
        "selftext": "UPDATE: I left and I just wanted to shout it from the Mountaintops!\n\nMy first and only Reddit post  is here [I need to leave my husband](https://www.reddit.com/r/relationships/comments/d1licq/i_know_i_need_to_leave_my_husband_but_im_feeling/?utm_source=share&utm_medium=ios_app&utm_name=iossmf)\n\nAnd I am just so thankful for the insights I gained there. There was some blunt reality but it felt loving and it’s a big part of what made me realize I was fooling myself in thinking my husband would change or that his habits and behaviors wouldn’t negatively effect our kids.\n\nI was encouraged to start seeing a therapist which I did. The first one I tried ended up being a beautiful fit which I regard as nothing less than a miracle. She was blunt and insightful and gave me the courage I needed to face my guilts and fears and put my kids first. \n\nHe’s an addict. That is a lifelong battle. And because of everything else he has put me through and let me do alone, I just do not have the love necessary to want to face that battle together with him forever. \n\nIt took me just under 3 months from feeling totally conflicted to conquering my doubts, making a plan, and getting the hell out. Making that plan was seriously my biggest obstacle. And I let it be, I think I used it as a crutch. Finally, I sat there for 2 hours and went through every possibility till it just clicked and I went “duh! That can totally work!” 5 days later I took all my stuff and the kids while he was at work. \n\nHere is what I want to share with those who face similar situations: my therapist let me know as kindly as she could that although I did a great job of protecting my kids, there was no way I could guarantee 100% that they would always be safe there. And if they ever got into any of those drugs or were harmed because of them, my kids would also be taken away from me for staying in a home where I knew those dangers were present, for subjecting them to it. \n\nThat shattered my perception of control real fast. Because its true. We cannot watch every movement every minute. \n\nI just wanted to stand proudly and say that after 7 years of desperately clinging to any chance at happiness, equality, and a partnership, I was finally able to leave the man I have been in love with for 16 years. I truly believed with every fiber of my soul he was my one true love. \n\nAnd I almost didn’t make it through the first week away...it was much more difficult than I expected having grown to hate him so much...it still hurt...but I did make it through and already I am so much happier, so much freer, my kids are more loved (he is finally giving them attention), and I can see hope for us all. \n\nI made excuses for his behavior because I felt I could see the nuance of it all...But what others helped me realize is that some behavior needs no nuance to it. Some stuff is just fucked up no matter how you slice it.\n\nSo I just wanted to encourage anyone else who is in a similar situation, you might need to start talking more about your problems so that others can help you see how little control you have and how horrible it really is. Then put yourself first, don’t let them manipulate you back in, and get the hell out if you know in your heart you should.\n\nTL;DR my husband is a lazy, selfish drug addict who I could just never quite convince myself to leave. But I finally shared my struggles with others who helped me see the real problems and accept the solution: taking the kids and GTFO. Already we are so much better off ☺️",
        "permalink": "/r/relationships/comments/e8l8zb/update_i_left_and_you_can_do_it_too/",
        "comments": [
            "Congrats on getting out of a toxic, unhealthy environment! How is your relationship with his family now that you've left? You said you were very close with your MIL",
            "I'm so glad you got out of there! When I left my husband after 10 years I couldn't understand why I was sad. I didn't love him, I didn't want him back but I wanted to cry for some reason. I realized that I needed to grieve the loss of the relationship that I had worked so hard on. I needed to recognize the dissapointment I felt because all my dreams of growing old with my high school sweetheart were not going to come true. I needed to forgive myself for my failed marriage because I was the only one in our marriage that was trying to make it work and one person can't do it alone. After I went through all those emotions and had a good cry about it I was refreshed and ready to build a new, better life.",
            "Good on ya.  It's awful and terrible for a long time, and then eventually it gets better.",
            ">some behavior needs no nuance to it\n\nMore people should hear this. Inexcusable things are inexcusable no matter the reasons. Untreated addiction & following abandonment of the family is inexcusable, no depression or childhood abuse (most commonly cited issues for addiction) is a justification for behavior like that. \n\nYou're a champ, OP. I am proud of you getting out of that hole.",
            "this is so good to hear! proud of ya for overcoming this!",
            "Respect to you for leaving, OP.\n\nJust try to make sure that your husband's newfound interest in the kids isn't a ploy to try and get you back with him. After all they've been through, the last thing your kids need is to suddenly think daddy's come around and started caring for them, only for him to disappear again once he realises you're not coming back. Unfortunately, even though you're not together in the same house any more, you're still going to have to protect them from him as an unstable, addictive personality in their lives.\n\nI'm sure you're aware of all this (and obviously know him better than I do!), but as someone who grew up with a very manipulative parent-figure, that part made some alarm bells go off in my head. Just be cautious about fully embracing this change.",
            "I’m so glad you were able to find the strength and get out safely and your children safely. I’m glad you have such a strong support system around you. You did it and every time you feel tempted to go back just keep reminding yourself how far you have come.\n\nWere you able to maintain a relationship with his family? Were you able to retain your job?",
            "[deleted]",
            "Way to go girl. \n\nI am also in the process of leaving my boyfriend who is an addict, who I’ve been with for 7 years. I understand how hard it is. And how hard it’s been to carry the weight of everything on your shoulders. But it is so freeing to be done. I am never trapping myself into that kind of relationship ever again. \n\nWe have a baby together who is my #1 priority. I appreciated the reminder about your child being taken away if you knowingly subject them to living in a house where there’s drugs. That’s a really important reality check.",
            "This is one of the best updates I’ve seen! I’m ten years removed from that situation, and happily married to a partner who is fantastic. \n\nI wish you a lifetime of happiness.",
            "For some reason, we are taught that there is only One True Love out there for us. It's the premise of every Disney movie ever. It's a lie. Love is ever changing, and there will be someone else for you if that is what you desire. It is certainly what you deserve.\n\nCongratulations on getting help and getting out. When things hurt and you feel like you should go back or that he's better now, reread your first thread.\n\nGo you!!! So awesome!",
            "I am so glad for you!!!!!!",
            "Hope his family is not giving you a hard time for this.\n\nGood luck with the  future.",
            "Congratufuckyoulations!! I bet you didn't know how strong you were until Reddit and your therapist told you you have been all along.\n\nYou know you did the right thing. He will probably be trying to get back with you. Always move forward, not background. He had his chance for YEARS. Don't let the incredibley enabling (so so harmful) MIL guilt you for this brave, right, and difficult situation.\n\nOut of curiosity, what kind of job can he hold with being such an addict?",
            "Wow! You did the work. You're doing the work! Keep going. ❤️",
            "Good for you, mama!! How are things with the ex’s family now?",
            "I bet if you told your MIL what your therapist said about your kids getting taken away if they got hurt in that environment (or honestly if someone ever tried to report you) it might help her look at this in a way that would help her understand.\n\nShe was trying to protect her son in a very twisted way, and enabled him to a dangerous point. I see why she struggled with you leaving him, but he is beyond any one person’s help. At this point she had to choose between her child and grandchildren, because unfortunately she can’t choose both.\n\nI don’t know what the status of your divorce and custody will be, but it’s possible for your MIL to be in their life without the father. Maybe if she knew you’d allow her to stay in their life as long as she didn’t let them anywhere near their father, she’d be happy to oblige. I don’t know the legality of anything, but I’ve definitely seen grandparents kept in the loop even when the parent has been pushed out. Good luck!",
            "Good for you!\n\n> I truly believed with every fiber of my soul he was my one true love. \n\nYou will find, over time and therapy, that this isn't true.",
            "very happy for you! good luck! Just dropping a comment because in your original post you wrote\n\n>but I know if I end this marriage, we will never be a family again.\n\nand I want to say (and I hope you know) that this is not true. I'm glad your husband is paying more attention to the kids since the separation, but even if he didn't change at all, you will still be happier in the long run without him.\n\nYou will still be a happy, intact family even without him. If the family unit shrinks, it's still a family. And it will be a happier household without everyone walking on egg shells and feeling the looming presence of an addict.\n\nYou said,\n\n>my 6 yo often tells me we should just live without daddy\n\nKids are way more perceptive than we give them credit for. Your child knew the solution. After the first few tough days, you will come to see that you plus your kids are far happier than you'd be as you plus your kids plus your husband.\n\nThis actually IS the way to keep the family intact and happy.",
            "So happy for you, and especially that you found such good support in your therapist.",
            "Congratulations.  Your ex husband sounds a bit like my ex boyfriend.  I broke it off with him when I envisioned a similar future with him.",
            "Im so glad you did what was best for you and the kids!!",
            "I’m so proud of you. I know how hard it is to emotionally let someone go, even when they are toxic. Please take care of yourself.",
            "I am so proud of you. You are being the best mom to your kids, and not only showing them what a mother's love looks like, but that they don't have to tolerate unacceptable behavior from a partner. My mom stayed - in a much less dire situation but still an unhealthy situation for kids - and I regret it every day. Will be thinking of you as you continue on your journey.",
            "This is amazing. I'm very proud of you! I have to ask, how did you leave when it comes to finances? Did you move in with a friend or something? How's your relationship with your MJL?",
            "I dated an addict this summer. I hated it, lasted 2 months. Good for you!",
            "you're an inspiration",
            "Don't trust his behavior. It's an overcompensation to the very real changes in his life. He will slip back to being a bad father pretty soon I believe. I'm so proud of you for having the courage to leave this toxic situation.",
            "Wow... powerfully courageous. \\~ Troy",
            "You go girl!! Sorry that you had to deal with that shit for so long. Time to start a new chapter in your life. Enjoy it and stay strong! 🙏🏼🙏🏼✌🏼✌🏼",
            "Thank you for sharing this....so glad you were strong enough to leave. I wish you the best❤",
            "I don't know you but I'm proud of you. ♥️",
            "This gives me so much hope for my situation... After 6 years I am ready to let go but afraid of the hurt that I know will come as it did the many times I have tried to leave before. But I have to remind myself that I will hurt only for a while and then I can heal. If I stay I will hurt in constant waves, only having small tastes of happiness rather than actually being happy. I have been thinking of my plan... It is still very murky... As I am pregnant and due in April. I still am so confused and lost. I have applied for housing, wait list number 1605, and have been job searching. I want to attempt to save money and hang in there until income tax to try to get him to give me at least half. It is hard though being around him because I still crave his attention and affection yet he ignores my existence until he wants something. I know what he is. He is a narcissist with a few addictions as well.  But its hard breaking that perception that I had, of two separate men. One I love and one I hate. But they are not separate...  Anyway, thank you for sharing. Very inspiring and motivational.",
            "I don't know you at all but *I AM SO PROUD OF YOU*! This is something SO many people are struggling with in the world at this very moment. There are always a thousand reasons you feel you can't leave. Thank you so much for sharing this so that others can see that they can leave, too. Congratulations and best of luck in this brand new chapter of your life <3",
            "Congrats on getting out! You're amazing!\n\nSo what's going on with him now? Is he still using? What's the custody agreement (sorry if that's nosy, don't have to answer ofc, I just wonder how it works with the courts when one parent is an active drug user)? What was his reaction to the divorce; has he been acrimonious with you or anything, e.g. fighting you for custody, calling you names, etc.?",
            "Good job. Stay strong. Don't go back ever.",
            "You won't regret it! Here's to a more stable and more empowering future.",
            "This is the first step in your journey. It will be full of hope, self love, and creating the best environment for you and your children to thrive. You did the right thing. So proud of you!!",
            "Congrats. Rooting for you and your strength as a survivor!",
            "AMAZING!!  Well done.  And in case you need to hear it again/more - YOU DID THE RIGHT THING.  \n\n\"Sometimes the hardest thing and the right thing are the same\".",
            "I read your story before and after, you are an inspiration to all people who are in your predicament... you reminded me of a caterpillar turning into a beautiful butterfly...\n\nMuch love to you and yours",
            "One of the ideas we have to let go of when dealing with an addict is that we can control the situation or the addict. We can't. We can only control ourselves.",
            "I'm very proud of you, because not every woman can do what you did.Talking about it and finally putting action to it, that's amazing. I really want you to be happy and finally have some fresh air and new chapter with your kids. For your husband i hope he seeks for help and figures that the drugs aren't worth losing a beautiful loving wife and wonderful kids. Stay strong for them and yourself ❤️",
            "So happy for you. Congrats on having the courage it takes to choose happiness and safety for you and your kids.",
            "Congratulations! That isn't a way to live. I'm very glad that you've found a good therapist that you click with as well. I don't know if anyone has mentioned it yet, but you might also give your local Al-Anon a try. You will forever be connected to him and his family and addiction truely is a family disease whether people are actively using or not. It might be helpful to you and your children when they are old enough for Ala-Teen.  \n\nGood luck in finding your bliss.",
            "I needed to read this. I've been having second thoughts about my decision. Thank you so much.",
            "Sometimes this is what addicts need. To lose everything to show them how much they took for granted. Hopefully he will get this wake up call and be there for his kids now.\n\nI'm so happy that you left, and got you guys safe! Congratulations mama bear, you got your babies out of that situation! Enjoy the moments you have now like you wish you had when they were born.",
            "Congratulations, have a happy life",
            "I wish my best friend had your strength! You are amazing and brave and so damn stong. Welcome to the best and rest of your life!",
            "I was wondering if you kept your job and how your living situation has changed in regards to previously living rent-free. Has it been easier to use money for living expenses since you're no longer living with an addict?",
            "Congrats on freeing yourself and your children from that environment! Thank you for this update, your story is inspiring to those of us in similar situations <3",
            "I'm there right now, we dont have children but hes always choosing drugs or alcohol over his plans he had with me. \nHe seems to think its perfectly justifiable \nI am worried he will get better and I will leave and screw up his progress and he was right on the edge there...\nI know this is most likely an excuse",
            "I'm glad you've managed to get your life on a better track. Couldn't have been easy, and won't... But you're amazing for managing to take that step.\n\nJust don't be fooled into the, you leaving made me see things, I've changed, problem.  You remember why you made this decision and you stick to it.",
            "This storie takes place 3 weeks ago 8th grade me and this kid well let's call him Jake were best freinds. We told eachother everything. On day we decided to get into a to watch a movie but over facetime. Jake decides to add a girl we will call her Diana. Jake adds Dianato the facetime I barely know her but she was real popular dated multiple guys. Shes says that she doesnt have Netflix and me and jake didnt know our passwords to Netflix. So we had to take turns to hold up the phone to screen for her to watch. I had the better phone and wifi so she preferred me to hold it up.\n\nWell the movie ends and we still stay in the facetime its 2 in the morning and were just talking. Diana decides to say that she had a crush on me in the beginning of the year. She leaves at that caused I just ignored it she bring it up again and says I think me and Heda (me) might date this year. I dont believe but at the same time I really wish it would happen.\n\nFast forward a couple of weeks I start to take a interest in her. Then out of luck she breaks up with her boyfriend. 4 days later its friday I go home I get in a facetime with them I leave. Then me and her  were texting at 2 in the morning Diana asks me if I like her in say yes and shes says she likes me to. She ask if I think that Jake knows that that she likes me and if she should tell him. While this all just happens I was in a facetime with Jake. I'm laughing my ass off and I'm so happy that she likes me. Jake ask what's up I tell him and I can see his face that he is jealous or something. We hang up a hour later and I go to ask Diana out. She says yes we start to date the very next morning Jake is ghosting us. Not even leaving us on read.\n\n Monday comes and I go up to Jake and ask what's wrong and he ignores me and just leaves while my freind are asking what's wrong to him. That entire day I was depressed that I just lost my best freind my homie. And it had made no sense because he had a crush on her in 6th but then got over it. He Also had a girlfriend in 7th grade and he always talked to me in 8th grade on he much he misses her and he wants to get back with her. So I thought I can shoot my shot. I did and I got what I wanted if I had known he would have acted like that I would have never dated her. I date her for a week and she breaks up with me cause she still cant get over her first love we will call him Eric.\n\nMonday comes I cant go to school cause I felt sick and depressed. Tuesday comes (which is today) I go to school and I talk to my freinds and she ignores me and is trying to get at another guy. My friend told me that on monday after school she had told him that she was trying to get at Eric. I was pissed and I go to my first class and I remember I have her for my first. I'm trying to figure out how can ignore her. While I'm walking to first I see Jake and Diana talking as if they're best freinds again. I go up to him and they both ignore me. They walk off and I'm just in shock and I felt like crying. I got to the bathroom and I start to feel sad. Then I start to feel rage. I'm telling myself why the fuck did I date her she ruined everything. I'm punching everything and I just want revenge. I just wanted to get out of school. Then I  call my dad to pick me up. While I'm waiting I start to think of killing myself but then I shrug it off and gets get the depressed.\n\nThe Tuesday party happend 2 hours ago idk what to do I'll keep you guy updated. If anything happens on Wednesday I'll edit it. If you guys can leave some advise it will be much appreciated.",
            "How did you plan your escape? Are you staying with family?",
            "How did you handle the finances part. And if any children part.",
            "I am so happy for you. I am a 48 year old woman in a toxic abusive relationship and I know I need to leave. I dont know why I fear leaving and why it is so hard to realize I deserve better.",
            "I am a 57-year-old man who was addicted to opiates because of debilitating headaches as a young man. My irresponsible doctor just prescribed Vicodin, instead of working to find out WHY I was having the headaches (which later, another doctor did and treated them, helping me to find a way out). This doctor wrote me a prescription for 50 \"Norco\" Vicodin (2.5 mg of Tylenol and 10 mg of hydrocodone) with multiple refills. At one point I was taking 50 every 4 days. This went on for months, until the pharmacy I went to refused to refill my prescription. I won't go into my story about that, but things went on like that for 3 years (this started about 6 months after our first child was born). My wife and I had a 3-year-old son and a newborn (I got sober long enough to make her feel we could have another child, but I relapsed soon after her was born). I had no job, and hadn't worked in 2 years. The opiates made me angry, short-tempered and depressed. I isolated from everyone, my friends, my family, my wife and kids. I know my wife was so sad about it all, because this just wasn't me. I had always been a very vibrant, engaged, gregarious and loving person. The opiates totally changed me into a lazy, self-pitying, emotionally-abusive monster. When things got too bad, I would kick off the pills (which was some of the worst experiences of my life). I would start to become my old self, but the headaches were too much and I would relapse, becoming a selfish, obnoxious a-hole once again.\n\nFinally my family staged an intervention, which I rejected by justifying that without the opiates I would return to the debilitated state I had been with the headaches. Finally, my wife packed up the kids and left me. I was furious. I said ugly things on the phone to her, things I can never take back (thankfully my wife is very forgiving and doesn't throw that up in my face, but she would be totally justified if she did). After 2 weeks without my family I finally agreed to go to rehab. It was horrific. The headaches returned with a vengeance. Thankfully, the staff there introduced me to a doctor that actually cared and did the work to try and help me rather than just medicate me. To this day, we really don't know what was going on, but the migraine medication Imitrex helped my headaches. When I left rehab, which only lasted 1 week (yeah, great insurance) I relapsed. I relapsed several times. The difference was, I was now resolved to be clean and widened the circle, going to N/A and involving my friends again so I had accountability. I kept relapsing, though, until someone suggested a new program with a drug called Suboxone and I made an appointment with a doctor that prescribes the drug. I thank God that I decided to go to that appointment, because Suboxone stopped my headaches and completely ended my cravings and drug-seeking behavior.\n\nAfter five months, my wife and kids moved back in the house (they had been staying at a friend's house, who was so kind and gracious during all of this). I got a job, which required drug testing, but Suboxone doesn't show up on the drug tests. I was my old self again, and thankfully this happened soon enough that we have many wonderful baby and toddler memories (sadly, we also have bad memories, but the good outweigh the bad). \n\nMy wife absolutely did the right thing. In fact, she actually waited too long, but really that was my fault. I would keep her from leaving by kicking and becoming (somewhat) the person I was before. It was just enough to string her along for 3 years. It was all my fault, NOT HERS, that this happened. I love her and admire her for leaving when she did, because it took a lot of courage. Her leaving was the impetus behind me getting sober and getting my life back. She left to protect our children, and to protect herself, and really to try to get me to wake up and take action... and it worked. Her leaving was the most loving thing she could have done. She has told me how hard it was and how devastated she felt doing it, living in a one bedroom apartment with our friend, with my little son wanting to know where daddy was and crying for me all the time. She has forgiven me, but she could never forget how it was... feeling so alone, my little son crying, not knowing if I would take action or just vegetate on the couch and throw away the rest of my life. We had always been very close. Because of our religious beliefs, she was a virgin when we got married, so I was the only man she had ever \"known\". She told me later that she had no intention of being with someone else, but resolved to live out her life as a single mom. Would she have done that? Who knows, but what a wonderful woman she was (is) to love me so well! Oh my god, just writing those words... I'm sitting here crying. How sweet she was, saying that, meaning those words!\n\nThat was over 22 years ago and I've tried to love my wife well so she would never regret giving me another chance. I haven't been a perfect husband, not by a long shot. She has been pretty darn close to a perfect wife, and I thank God that she was strong enough to do what she needed to do to protect our children, to protect our family. To the OP: you are absolutely doing the right thing. It's a wonderful thing that you had the courage to do this, because I can only imagine how hard it was and is. Never beat yourself up about not leaving earlier. I look back at how low I got and wonder how in the heck that happened? I would never have chosen to live that vacant, selfish existence, but it wasn't a single choice. It was a collection of choices that led me sinking deeper and deeper and ultimately becoming only a shell of my former self. That is how it happens; it's like a frog in boiling water. It happens little-by-little, choice-by-choice, and pretty soon you look up and go, how in god's name did I get here?! You are to be commended that you found the courage to make this incredibly difficult, life-changing decision. My only suggestion is that you surround yourself with those that support you, that will help you stay strong and keep you accountable to your good choices. Going to a therapist was such an amazing first step (wow, I'm amazed by you). Keep it going. Don't stop going, if you can afford it. Stay strong, but remember that you are vulnerable and you need support. Posting here was smart and shows that you are making good choices and doing what you need to do to support yourself and your children. Keep being smart and strong.\n\nIt won't be easy, because we drug addicts are really good at lying and manipulating. Your husband can make your life really difficult, so make sure you have people in your life to insulate yourself from his toxic garbage. Even though I would get angry at my wife and say mean things on the phone, inside I was so ashamed of myself. I was so in awe of her and I f\\*\\*king hated myself for putting her through that. She cried so hard on the phone, trying to convince me that she was doing this because she loved me and our children. I threw it back in her face and tried to make her feel guilty for leaving. I tried to convince her that leaving me would ruin her life. It was awful, but deep inside I was admiring her and dying... dying.. dying because I was hurting her. Finally, when I cracked and agreed to go to rehab, I cried like a baby and begged for her forgiveness. I told her how much I loved her and admired her for leaving and she was stunned. She thought I didn't love her anymore and now hated her! What a PIG I was to make her feel that!!! She stayed the course though, and unbelievably only got stronger the more nasty I got, because she knew I was finally cracking. The apathy and hopelessness gave way to anger, which gave way to sadness, and my horrible actions finally made me realize how sick I was and how I needed help. When the wheel finally turned and I admitted what a mess I was, she amazingly supported me and loved me, but remained firm. In my lucid moments I told her  not to give in, to not listen to me, to stay strong and don't listen to my lies. She did stay strong and whew... how I love her for that.\n\nYour husband might never get well, and even if he does, you might never want to even think about taking him back. Sometimes the damage is too great and you just have to move on. His actions destroyed your relationship and now he will have to live with the consequences. You have to do what you need to do to protect yourself and your children. So, feel good for doing that and never let him make you feel bad. He knows he's wrong. He knows what a monster he is, even if he won't admit it. I'm so very blessed that my wife chose to take me back, but she would have been totally justified to divorce me and move on with her life. Sometimes that is the most loving thing you can do for you and your family.\n\nSorry I wrote so much, but your story really touched me and reminded me what hell I put my wife through. I'm so fortunate be sober and still married to my sweetheart. I'm so sorry that he's put you through this. I'm sorry that you have to start over. You did the right thing, though! (I hope this doesn't sound condescending, but) I'm proud of you! God bless you and your children. My wife and I are praying for you! Stay strong and take care of yourself and your babies. Keep us posted on how you are doing as you are able.",
            "[removed]",
            "[removed]",
            "You go! Make me a sandwich."
        ]
    }
]