[
    {
        "post_id": "4potyb",
        "author": "throwawayandpanic",
        "title": "UPDATE: My(25) BF(28) won't ask for my hand in marriage so my Dad(51) is staging a family boycott of my wedding. Is my BF being disconsiderate?",
        "url": "https://www.reddit.com/r/relationships/comments/4potyb/update_my25_bf28_wont_ask_for_my_hand_in_marriage/",
        "score": 4321,
        "num_comments": 554,
        "created_utc": 1466797618.0,
        "selftext": "original post is here,\nhttps://www.reddit.com/r/relationships/comments/26pydf/my_bf_m25_wont_ask_for_my_hand_and_my_dad_m48_is/\n\nThe wedding went on as planned.  My parents stuck to their guns and boycotted.  One of my two sisters attended and is now happily blacklisted from our family.  Nobody else from my entire family showed up including my two brothers.\n\nThe wedding was a little unconventional.  My sister walked my husband down the aisle and then his sister walked me down the aisle.  I wanted this because my SIL actually introduced us and helped me get my first date with him.  There was no questioned about who gives away the bride or even about objections.  It was normal other than that.  There has been no contact between me and my family, other than my one sister.  My mother has made it a point to send me a card every time that they have a family gathering for holidays or birthdays at their house to let me know that my father says I'm not invited.  I get one almost every month.  I don't even read them anymore I just toss them.  I don't why they keep sending them because I've made no effort to contact them and I live over three hours away so it's not like I will run into them by accident.\n\nThe reason I came back to post this here is because some people here made a prediction that came true (that they would come crawling back when we had children).  I am now expecting our first child, a girl :).  She will be the first grandchild for my parents.  My parents found out about the pregnancy a few months ago through a family friend.   They didn't waste anytime in making demands, not requests, demands.  My boyfriend and I are not religious but I had a Catholic upbringing.  I don't practice at all by choice.  My mother called me back in April telling me that my father wanted our daughter's middle name to be his mother's first name.  I said no.  My father was listening in on speaker so I went ahead and told them that they were officially uninvited from all birthdays, graduations, and any other important dates in her life.  My father called me half an hour later crying and begging me to come stay with them for the birth so my mother could care for me.  I said no.\n\nHe also said that he had already made arrangements for his priest could baptize her at his church but that I needed to agree to naming her after his mother if I wanted this to happen.  He said he'd already planned a big celebration for the birth and the baptism that he was paying for.  I said no to all of it.  He went from meekly trying to sweet talk me to raising his voice at me and I hung up.\n\nHe called a couple of more times to apologize for losing his temper and again beg me to reconsider giving birth at a hospital near them so they could visit us.  He denied having any knowledge of my mother sending me cards to uninvite us to any family functions and even said that he specifically asked her to invite us but he was told I declined every time.   He lets my mom do the dirty work so he can later hide behind her and deny he had any knowledge.  He's done this since I was a little girl.  He does this every time he wants to drop the hammer on somebody but be the good cop also. He'll never change.  He denied having any knowledge of why anybody in the family missed my wedding.   I told him our daughter would not be baptized, or catholic at all (no offense to Catholics).  I told him he was too manipulative and controlling and I didn't want my daughter exposed to that.  He's too toxic and just venomous.\n\nCoincidentally, the day and for several days after that phone call I got tons of calls and emails from my brothers, their wives, my sister, and all my aunts.  They all wanted to apologize for missing my wedding, and all had specific excuses, and wanted to make plans to be there for my daughter's birth.  I banned them all from her life until she's old enough to decide for herself to let them in.\n\nMy husband was a little surprised and not sure about banning everybody forever.  He's more leaning towards supervised visits if they want to drive to us.  My dad has been calling him like crazy but we are a united front.  My husband is deferring to me but giving me ideas as to how I can give a little if I decide to.  But with my family there's no giving a little.  They want it all.  For now, they're all banned.  I will reconsider when the youngest of our children turns 18 :).  For now my dad will have to settle for sucking up to my husband while I stick to my guns.  Unlike him, I don't mind owning my decisions even if it means I'm bad cop.  I'm not ready to give up a relatively drama free, stress free life to allow my dad and all his sheep back into our lives. \n\n   \n**tl;dr**: Nobody in my family showed up to our wedding other than one of my sisters.  Everyone is banned from our lives.",
        "permalink": "/r/relationships/comments/4potyb/update_my25_bf28_wont_ask_for_my_hand_in_marriage/",
        "comments": [
            "Wow your parents have a lot of nerve! They want you to give birth at a hospital convenient to them! They think you'd trust them to look after you. \n\n>My mother has made it a point to send me a card every time that they have a family gathering for holidays or birthdays at their house to let me know that my father says I'm not invited. I get one almost every month.\n\nThis is frankly amazing that she'd go to that effort.",
            "Is there anything more satisfying than reading about assholes having to deal with the consequences of their actions? I don't think there is. Good on you, OP, for setting your boundaries and sticking to them. Keep building an awesome life for you, your husband, your daughter, and your chosen family. Don't waste another thought on those jerks.",
            "Your father is a control freak. Continue the no-contact. Your marriage and family will be so much better off without his interference. ",
            "See if you can block all their numbers. Send any letters back unopened. Be prepared, because it's likely they will up the ante in their efforts as you get closer to your due date. They might try and force a visit on you in hospital if they can figure out roughly when and where you'll give birth. They'll likely come to your house when the baby is born.",
            "You are a total badass, OP. \n\nI'm sorry you're having to go through this kind of thing with your family. I'm also glad and impressed that in under three years you've been able to recognize how terribly toxic many of your immediate family members are, draw up reasonable boundaries, and stick to them even over time. My spouse had to go through a similar process and it was really tough on him. So here's an internet hug of solidarity for you if you want it. :) Best wishes for you, your spouse, and your growing family!",
            "This is the very best kind of update. It also took YEARS. Congratulations, OP. May you and your husband always communicate and defend the other this beautifully. You sound like you'll be a great mom.",
            ">  But with my family there's no giving a little.\n\nYou've got it, sister. Also, you think you're strong now? Wait until your baby is here and see how you react to bullshit.",
            "Just remember when you give birth to notify the hospital that these family members are banned from visiting you.  I guarantee you that they will try and find out where you're giving birth, and ruin your first moments with your child.  It's better to just think ahead and let hospital security deal with their narcissistic drama.",
            "I can't believe they didn't see this coming after they tried to make your proposal and wedding all about themselves and *didn't show up.* I guess they thought you'd come back for more of their abuse. \n\nStay 100% strong against these people. They weren't there to witness your union so they don't get to witness the development of your family. Your parents and siblings (besides your sister) deserve absolutely nothing from you. I'm proud of you for having such strong boundaries, so many people on this sub let their controlling psycho parents stomp all over them again and again and again expecting a different outcome.\n\nThe last thing you want is for these people to be involved in your life while you're raising an infant. ",
            "Wow...that is *quite* the update. (Congratulations on your marriage and pregnancy, btw!) \n\nI think you're doing the right thing. Given that you understand how your parents operate, and can thus infer what's going on behind the scenes, I say continue with your current game plan. Your parents know *exactly* how this all came to be. I'd take the liberty of explaining it to your other relatives if it comes up - although their autonomy seems to be at your father's disposal. :/ \n\nAlso, you might enjoy the subreddit /r/justnofamily. Best of luck! ",
            "> He's more leaning towards supervised visits\n\nNOOOOOO.\n\nPeople who haven't endured incredibly abusive families just don't get it, and they never will. It's a nice thought, but reality doesn't work like that. You open that door a crack, and all manner of poison seeps through. \n\nCut contact entirely, and live a happy life.",
            "This was the most satisfying followup I think I've ever read in this sub. You are badass OP. Congratulations on the wedding and the coming baby!",
            "Biggest frucken justice boner I've had in a while. Let them keep begging, they didn't care and it looks like they didn't care for 2 years until now. \n\nYou're doing good OP! And take that advice above about sending a baby shower invite to your mom and dad saying they're not invited. ",
            "You need to find the source of the info leak (who told them you're pregnant), and address that. You don't want that person giving them info about the baby, pics, etc if you don't want them to have those things. \n\nYou and your husband need to decide what your social media policy about the baby will be. If you don't want your parents having any info at all, then you may want to consider having a \"no baby stuff on social media\" stance. Because pics rarely stay private and if they're truly determined to get info about the baby, they may be able to convince someone you're still in contact with  to get that from your Facebook. \n\nNot all hospitals have a policy about disclosing if someone is a patient or not. Some will tell a person who calls and asks for you that you're a patient there. Make sure the hospital you give birth in knows you do not want your name disclosed and give them a list of people who are absolutely not allowed to visit. \n\nI've got a batshit crazy father so I've got a lot of experience with making sure he and his family can't get personal details. One of his brothers went so far as to find my maternal grandparents on Facebook and since their profiles are not set to private was able to pull pictures they'd posted of me and my husband and my sister and her son. I had my cousins show them how to lock down their profiles after that. ",
            "[deleted]",
            "This will become especially important once you become parents: *make damn sure you have wills.*\n\nYou'd want wills anyway in the context of simplifying the transfer of property within your family. Beyond that, though, it's clear from context that in the event something happens to both you and your husband, you do *not* want your children to end up in the custody of your father. All the more reason to have contingency plans in place and in writing before any tragedy might happen.",
            "Justnomil would make you their Queen. ",
            "How's your sister under all this? (the one who showed up to your wedding)",
            "Yikes.  I'm sorry your family is such a narcissistic nightmare.  I'm glad you have the sense to keep them out of your children's lives, though.  They would pull the same crap with them as they have with you.  I would block them on all your phone numbers, email, social media, and send all post communication back \"return to sender.\"  ",
            "Wow. Your parents are incredible and I mean that in the worst way possible. The sheer *audacity*. Good on you for staying strong and having the biggest set of brass balls ever!",
            "WHOA now, hold the phone....  Can I just comment on this ridiculous little nugget?\n\n> beg me to reconsider giving birth at a hospital near them so they could visit us\n\nYOU, *in labor*, are supposed to drive 3 hours.... while in labor.... to deliver the baby at a hospital where it will be \"convenient\" for your parents to visit?\n\nIs this hospital in Crazytown? \n\nSo let me get this straight..... he thinks it makes sense that *you should get in the car mid contractions and with amniotic fluid dripping all over the place*..... so that he gets a quick drive to visit the baby?  \n\nWhat the what now? \n\nWait, what? \n\nNo, seriously, what?!?!?",
            "It's incredible how wise you are to all of your family's manipulations. How your father uses your mother and then denies knowing what she did. All of that knowledge that you have is serving you well. You won't be pushed around by them any more.  \n\nThe thing to remember is that YOU are not the one preventing them from seeing your baby (Congratulations!!) They are the ones who did this. It was 100% their actions that caused this rift. They don't get to backpedal and apologize and say they never meant it that way, and expect you to then cave in to their demands.  \n \nReading your post makes me feel like Superwoman. GO YOU! ",
            ">My mother has made it a point to send me a card every time that they have a family gathering for holidays or birthdays at their house to let me know that my father says I'm not invited.\n\nWhen they ask for baby pictures, send them shitty MS Paint sketches.",
            "Wow OP, your update gave me a warm fuzzy feeling all over. Good for you for sticking up for yourself",
            "> My mother has made it a point to send me a card every time that they have a family gathering for holidays or birthdays at their house to let me know that my father says I'm not invited. \n\nHoly shit. \n\n>My mother called me back in April telling me that my father wanted our daughter's middle name to be his mother's first name. \n\nThe nerve these people have. Wow. ",
            "This is really petty and you shouldn't do this but I would get great joy out of sending them a baby shower invite (with no identifying date or place) that just lets them know they're not invited",
            "You are fantastic! Life without their manipulatiions and demands agrees with you. Stay strong!",
            "Good for you and your amazing titanium spine!!",
            "Not that I think you should do it (the no contact thing seems to be working pretty well) but I'm kind of in love the idea of making your father ask your husband for permission to see his grandchild.\n\nYou know, maybe over dinner, at a nice restaurant.",
            "OP congratulations on your pregnancy as well as standing up to your manipulative and toxic parents. Continue standing up to them! \n\nOther then referring you to /r/raisedbynarcissists , I would heavily recommend getting a lawyer and start a paper trail of their toxic behavior. Even documenting their behavior. Why? Because I'm worried your parents may try and take you to court once your baby is born and fight you for custody or grandparent rights. \n\n",
            "It's probably been said a million times, but in regards to the original post, all those things that your father did in his mind that we're accommodating, were actually manipulative methods to regain control, by a control freak. As for what your mother said, it's disgusting. They assume you automatically agree with them, and that your boyfriend is not letting you have a say... They did not ask you how you felt before making up your mind for you, and then they have the nerve to say your boyfriend isn't letting you speak... They are the ones not letting you speak.",
            "[removed]",
            "Never, ever, think that someone who has demonstrated that they are a pathological liar even after \"apologizing\" for how they acted has ever changed.  He may say he has changed and you aren't accepting his apology, but he still expects the natural order of things is to make your decisions in his best interest and he does so while lying about rather than owning and apologizing for his past deeds.  ",
            "You're smart to get them out of your life, because they would STEAMROLLER you over everything about that baby if you gave them half a chance.\n\nOP, you are incredible to have come out of that family and be so strong and functional. Kudos to you!",
            "Wow, OP. Way to rock the Mama Bear thing. Well done.",
            ">He also said that he had already made arrangements for his priest could baptize her at his church but that I needed to agree to naming her after his mother if I wanted this to happen.\n\nHa.. haha... HAHAHAHAHAHA\n\nYou are bad ass. Keep on doing what you're doing. ",
            "You are giving your unborn child an incredible gift by keeping her away from these terrible people in the formative years of her life. Good on you and your husband for being a team and doing what's needed for the health and well-being of your little family!",
            "My justice boner right now is so huge it's almost painful. Well done, OP.",
            "Make sure your husband understands that in many places, if you start giving your crazy, controlling parents visits, they will then be *entitled* to their grandchild's life. If you never start they're as good as strangers.\n\nIt is best for all three of you, and any future additional children, for you to cut ties with them permanently. I think you understand this, OP, and you've done an amazing job doing what's healthy and putting your foot down against these abusive people. You didn't sound quite so certain in your last post, but I'm going to guess that time and distance made your parents' actions a bit more clear. \n\nBest wishes!",
            "r/justiceporn\n\nBut seriously, good for you ",
            "You need to cut contact with everyone while you're pregnant and after or they're going to show up at the hospital, post photos on FB, etc. You need to cut them off totally. Take everyone who is on your parents side off facebook. Delete them as a friend AND block them so they can't even see that you have a profile. Block them on Instagram and any other social media you use. Tell the hospital the names of the people you want to be allowed to visit. Give them your parents names and tell them under no circumstances are they to allow them in.\n\nMake sure the friends and family who ARE on your side know not to post on FB or send any photos of the baby to your parents. If they do, cut them out of your life. I'm serious, OP. You have to protect your child now.",
            "> He also said that he had already made arrangements for his priest could baptize her at his church but that I needed to agree to naming her after his mother if I wanted this to happen.\n\n\"Still making unreasonable demands then, Dad? I see you haven't changed much.\"",
            "Almost same thing happened to me too sister! They didn't come to the wedding and now my mother has made plans to come stay when I give birth (on her own, without asking me)! Well they are banned for life for how manipulative and destructive they are. \n\nThe important point to remember for staying strong is: as soon as you give an inch they go a mile. They completely ignore everything that has ever happened and start acting like one big happy family. Of course while manipulating you and putting you into your childhood role again. My parents wouldn't hesitate to use any vile method to cause discord in my marriage or other relationships, that's all they've ever been doing. \n\nIt is obvious that they are still being selfish. They don't care about you or your child, only their own demands. Stay strong OP. We are many who have been through this and you are doing the right thing for you and your child. ",
            "OP, do you know who leaked the news of your pregnancy to your parents? that person needs to be told not to carry information to your parents if they want to be in your life.",
            "I feel as if this post would also be at home in /r/raisedbynarcissists",
            "Good for you!!!  A million times over!\n\nI wouldn't let ANYONE in that family anywhere near your child.  If your dad gets her, she WILL be baptized against your wishes (nothing against Catholics, but it's not the grandparents' right to do this).  In fact, with all this extended family ganging up on you, I would seriously consider the possibility that your child would go \"missing\" if any one of them got their hands on her.\n\nYour father is insane.  I mean it, bullying and insane.  I would go NC with each and every one in that family.",
            "[deleted]",
            "Very toxic family.  \n\nWherever you are i would be careful that your family didnt try to use the police and government CPS against you to gain control of your child or to make your life miserable.   \n",
            "Hey OP. Since it seems that neither you nor your hubby are on terms with most of your families, make sure you guys have the facts set up for your children in case the worst happens to both of you guys.   \nAlso make sure that schools and such know who are approved adults for pick ups and such.",
            "You should totally fake a check in into a hospital two states over on facebook.",
            "You're amazing! Not only are you owning your decisions and standing up for yourself, you're very astute in identifying their motives and potential problems in the future. Based on their past behavior, I think you are doing the **best** thing for your family (meaning you, your husband, and your little girl on the way).\n\nHow lucky for your baby girl that she's going to have such a wonderful role model raising her to be strong and have self-respect. And good job to your husband for weighing in, but understanding that, ultimately, you know your parents best and that you need to stay a united front. Ugh, I love it. CONGRATULATIONS on this wonderful growing family of yours and all the best wishes for you guys in the future ❤️",
            "This internet stranger is proud of you",
            "I like you! You are determined. It's all in your court sister ",
            "OP,your daughter is a lucky girl.\nyou will be a great mom.",
            "Wtf is the matter with your family? They all sound like monsters.",
            "Your husband is the perfect guy with whom to raise a daughter.  You lucked out!!",
            "Since you're still in contact, make sure they're on an information diet (tell your sister and husband and anybody else that knows about the birth that could tell them that they are not to leak any details about the birth until well after it happens).",
            "They ALL didn't come to your wedding because your father told them not to. The ONLY reason why they are reaching out now is because he told them to. Do not talk to these people about anything involving your life or child because it will get back to him. At this point, I wouldn't even bother to answer the phone. Change your number and enjoy your freedom!",
            "> He also said that he had already made arrangements for his priest could baptize her at his church but that **I needed to agree to naming her after his mother** if I wanted this to happen.\n\nHahahaha! The chutzpah displayed here is just magnificent! Good for you on banning them from your daughter's life; this level of toxic manipulation should be banned. And your father brought this all on himself by boycotting your wedding over nothing. \n\nThank you for an amazing update! ",
            ">He denied having any knowledge of my mother sending me cards to uninvite us to any family functions and even said that he specifically asked her to invite us but he was told I declined every time. He lets my mom do the dirty work so he can later hide behind her and deny he had any knowledge. He's done this since I was a little girl. He does this every time he wants to drop the hammer on somebody but be the good cop also. He'll never change. He denied having any knowledge of why anybody in the family missed my wedding.\n\nwow... so he's lying to try and cover his ass... And your entire family is covering for his ass also? They are a Fair weather family if there ever was one... They boycott your wedding and Blacklist your Sister for going and then think they can just walk right back in? Did your sister get the same \"uninvites\" as you did(I assume you are still in contact with her)? I hope you kept at least one or two of those as a F-you's for this day. If you want to be incredibly petty, you can make up a few of your own and send those to your parents.. ",
            "What amazes me is that they all seemed completely unable to predict that you would have a child in the future and that they might want to maintain a positive relationship if they wanted to be involved in that child's life.  Absolutely insane.",
            ">Unlike him, I don't mind owning my decisions even if it means I'm bad cop.\n\nOP, you are an actual grown-up. Congratulations. I'm serious, 99% of people *never* get to this point. ",
            "From one expectant mother to another, congrats and you are my hero. Good luck with everything!",
            "I mean, I get them wanting to see her, but they can't seriously act like nothing happened and start bossing you around about your own child.",
            "Keep doing what you're doing! Make sure to be clear with your husband that letting in these people just a little will give them the opening to continue ruining your life. Make sure none of your friends are Facebook friends with any of your family members, you want to keep where you're giving birth and any other announcements under wrap. Congrats on your new family! ",
            "Good for you for sticking to your guns and not rewarding them with having contact your daughter after they treated you so horribly. If they want to act pouty, throw a temper tantrum and refuse to go to your wedding, then you have every right to refuse to allow them into your child's life. We're proud of you OP. ",
            "You are fucking fantastic. Please continue. ",
            "GOOD FOR YOU.\n\nThey will never change, OP. You can't fix them. All you can do is enforce your boundaries and protect your new family.",
            "OP this is badass. Well done!!",
            "I'm seriously more shocked that your siblings folded about your wedding. What a bunch of wusses. At first I thought your fiancee could have just done the small ask but you two knew that this was bigger than that ask. Good for you for recognizing that and sticking to your guns. Maybe rewarding the folks that did attend your wedding as well as the relatives that have apologized will get your parents to shape up. But, honestly if my sibling boycotted due to this bullshit I'd need a serious apology and explanation before I welcomed them back into my family. Good luck with this situation - sounds like you two have good instincts.",
            "I would send one last message: \"unless you can invent a time machine and travel back in time to my wedding, where you would have behaved like every other normal father, welcoming my husband into the family and walking me down the aisle, I am FINISHED with you. My lawyer has obtained for me a restraining order that prohibits you from contacting me *in any way*, or you will be arrested. And tell the rest of those idiots in the family who failed to show up for our wedding; they can stay away too\". Then block him from all social media and your phone number(s). You need to make your own life away from these toxic people. My own father would have cut off his own arm than hurt me on my wedding day. That's how *normal* fathers are.",
            "Good for you - they're toxic as hell. Going NC is the right decision for your family, I wouldn't do supervised visits either in your shoes.",
            "Fuck yeah you are my hero!!",
            "Hope you still get on with your one Sister at least.",
            "> My father was listening in on speaker so I went ahead and told them that they were officially uninvited from all birthdays, graduations, and any other important dates in her life\n\nmy cackle is hearty indeed!\n\nBut if you haven't already, you should stop answering their calls and texts. \n\nAnd you should probably have a talk with your husband about what to do if your family starts crossing boundaries later on in the pregnancy. Start documenting now, so that you have a nice long list showing that there is a definite pattern that is worsening. ",
            "> beg me to reconsider giving birth in a hospital near them so they can visit us\n\n\nSo they want you to travel three hours while in labor! give birth in an unfamiliar hospital! then travel three hours home with a newborn! Because otherwise they can't visit you? \n\nThey don't care about getting to know your baby, they just want to use her birth as a foot in the door.",
            "I normally don't chime in, I just usually hide amongst the letters. But for this, I have to add my two cents.\n\nEverything action by your parents and family, including their excuses and pleas, are so completely out of line... I could write tons about this alone. But I haven't seen many people talk about how your father, who's trying to apologize and get back in your good graces, has the nerve to suggest that you drive 3 hours towards them (while almost ready to pop) just to have your child near them. Any loving and caring father, who truely wanted to be their for his daughter's first child birth, would travel any distance needed so that he could support and care for her. I just can't believe your father, he just keeps digging that hole. kudos to you op for sticking to your guns, I completely agree, these people should have thought about their decision back before your wedding. You don't pull something like they did, and then just have it forgotten a few years later.\n\nAnyways, congratulations on your expectant baby girl. Never give up, never surrender. 😁",
            "Take legal precautions to make sure that in the event of something happening to you and your husband, your child(ren) will not live with your family. ",
            "Oh my gosh. I'm so sorry that you have a horrible family, OP. I'm a happy, practicing Catholic (I actually work for the Church too) and am horrified of all the demands your parents are making regarding baptism and naming. This would never be acceptable at my parish. We have a requirement for all the sacraments and classes that the parent (for infant baptisms) or individual (for \"becoming Catholic\" classes) MUST be the one to give their full consent. No amount of parental involvement would ever be allowed to push the faith on people because in the end, we want people to be Catholic because they love it, not to appease anyone. I don't even let the confirmation kids bullshit their way through the class. So, on behalf of the church, I'm so so sorry that your parents think it's even remotely acceptable to force your hand. They are acting 100% contrary to the spirit of the church, that is, to love completely—unselfconsciously—without ANY regard to what they get out of it. /rant",
            "I love that horrible attempt at bribery.\n\n\"I'll give something you really don't give a shit about if you'll do something you really don't want to.\"\n\nWorst negotiation ever.",
            "I don't see why you are being so harsh! I mean, they only demanded your BF ask their permission to marry you. You are their daughter and  therefore belong to them to give away! I'd argue that legally your marriage is not valid because husband stole you! They were gracious to boycott your wedding which helped keep the guest list and costs down. I mean it's not even a real wedding so why attend?\n\nThey cut contact with you because you dis-honored them. Clearly there was no other option. Your poor mother desperately hoped you'd come to your senses and  crawl back with an apology. This way you could all finally be happy! The only reason she would let you know about all the wonderful events you were missing and come to your senses. \n\nPop-Pop and Gramma are sooo  excited about the baby that they are willing to overlook your callousness these last few years. The least you could do now is find an OB close to them, so you can deliver where they feel more comfortable. This is only a slight inconvenience to you, the mother who is going to birth the baby... You really could be more considerate and make it easy on your lovely parents. You don't want them to have to drive to you. This way they can easily come visit you and shower you and the baby with love! In fact, why don't you find out what day of the week is best for them, so you can schedule a C-section? This way it works for their schedule!\n\nI believe some hospitals only allow one person in the room with you. Ask them if your husband should be there, or if they prefer to pick someone else. They probably want your mother dearest there so she can help! She is a woman and has done this before, sounds like the obvious choice to me!\n\nOP, can't you see that your parents are only trying to help? Your dad even tried to save you the trouble of finding a name and picked it for you, saving you from stress and all that pesky name-planning! \n\nJesus, it's really astonishing that they probably think this way. The nerve they have!",
            "Think about leaving the door open to siblings in the future.  They may break free and contact you in the future. It takes some people longer than others to get out of a toxic relationship.",
            "[deleted]",
            "Happy endings for you! Congrats! \n\nOn a side note, I hate the \"tradition\" of asking the father to marry his daughter. You are a person, not property. ",
            "Man I almost feel bad for them. It sounds like they actually want to be a part of this kid's life but they aren't self aware enough to realize how ridiculous they're being or respect boundaries in any way.",
            "You deserve a standing ovation, lady.\n\nCongratulations on everything!",
            "Oh my god this is so good.  I don't think I will ever be able to do anything so satisfying in my entire life as you did boycotting your parents.  You go!",
            "I'm so sorry your own parents treated you that way!! My parents didn't even meet my husband until after we got engaged 😳 \nBut anyway, it sounds like they're toxic and they don't need to be involved with your child. Missing your wedding is unforgivable. There are certain life events that when people who supposedly love you purposely ignore them...it's a wrap. \nBest of luck to you with your pregnancy and delivery. Don't let your dad stress you. Block his number if it's getting that bad. Your girl should be born surrounded in love and happiness, not stress and hard feelings. ",
            "You and your husband are strong, and brave. I'm so, so impressed you have decided to create your own life and not put up with your Father's manipulative bullshit.  Well done.",
            "All communication about your dad seemed to be going through your mum, any chance that she actually was twisting the truth the whole time (like from around the wedding)?",
            "You and your husband are fucking awesome.  A LOT of people can learn from you two on how to deal with toxic families.  Huge kudos.  ",
            "I have to say, I'm super proud of you for not caving back at the wedding. You made the right decision and your life has been better for it. I think you're making the right call again. Your daughter will be so much better off without your controlling family poisoning her childhood. Congrats on your growing family!",
            "I'm impressed. Way to stick to your principles and do what is right for you.",
            "Make sure to send them birthday cards telling them they're not invited. ",
            "Those monthly cards you get are atrocious. That's harassment. You could easily ask them to stop, then tell them to stop, and then if it continues you could have the police involved",
            "Great update. I wish I could just ban people from my life sometimes. ",
            "You're a badass! Thanks for sharing, needed to read those one after a long week. Congratulations to you both on the little girl!",
            "Great job sticking up for yourself, your husband and your daughter! Life can be so amazing when it's filled with supportive, caring people that you choose to spend it with.",
            "Jesus what the hell is wrong with people? Good riddance.",
            "How are things with the sister who came to the wedding?",
            "You are making the best decisions for your family. I know personally how hard it is to go no contact with toxic people who just want to control you. Your children are so lucky to have you. Stick with it. Being free of their manipulation is amazing. ",
            "Sounds like you are doing the right thing and that you should continue with the full NC. Letting these sort of people into your lives is just asking for trouble.\n\nBlock phone numbers and emails, gets new phone numbers and emails hand them out sparingly to trustworthy people. Don't bother reading messages or letters but do save them in case you need to go to a lawyer.\n\nInvest in good home security, especially security cameras outside and nanny cams inside.\n\nConsider moving when possible.\n\nAnd congratulations on a happy marriage and a baby!",
            "Your parents have some nerve. You did the right thing honestly. When you decide to let them meet your child or associate with her in any capacity is your choice! \n\nBeing raised by a controlling father this hits home for me. I don't plan on inviting him to my hypothetical future wedding anyway (haven't seen him in over 6 years!)",
            "OP, from your post two years ago to this one, it is easy to see by your writing and diction how much you've grown. It seems that in the past two years you and your husband have had an amazing start to your marriage, and now with starting your own family. I'm so happy that you're sticking to your guns on this, and I wish you the best of luck with dealing with your predictably unpredictable sheep-family.",
            "> My husband was a little surprised and not sure about banning everybody forever\n\nI agree a bit. You are the one to judge of course, but you could consider having a case-by-case decision. For example, how old were your other siblings at the time of your wedding? Were they old enough to take their own decision? If not, you could consider having them back in your life when you're sure they are grown and independant adults (with the condition they don't bring or tell your parents aoout it for example).\n\nEDIT: but this can wait after the delivery of course :-)",
            "[removed]",
            "Your relationship between your husband and family members sounds a lot like mine....and my father did what you're planning on doing.\n\n\nTaking away your daughter's opportunity to get to know your family may unconsciously work against your favor. Yes, your family is being cruel, controlling, and disrespecting your husband and you no have no reason to trust them. But trust your child may grow a similar resentment for you if you don't give her the opportunity to make a decision on she would feel about them, no matter how good the intention is. I love my dad above and beyond, but I actually felt that was controlling as well. \n\n\n",
            "UGH! you may want to cross post this to r/raisedbynarcissists \n\n",
            "I hope your husband stops trying to get you to cave a little. His guilt doesn't need to be your guilt. You know your family best and if giving in a little gives them a way in and makes them think you are weak,  don't give at all. No doubt they want to get their hands on your daughter to undermine you. When you do give birth, make sure the hospital knows they are not allowed and I would not tell this family friend anything further since they seem to have a big mouth. ",
            "I admire you to sticking with your bf. ",
            "Your Dad, and possibly most of your family. is seriously mentally ill. I'm sorry you've had to go through this, but you've come out on top despite them. Good for you.",
            "This may not be a popular opinion:\n\nFamilies fall apart for all sorts of stupid reasons. Your fam not coming to your wedding is vindictive, hurtful and horrifying to think adults act this way. What I would also offer as someone who has lost a parent, would you miss them if they passed on? There is a point in our lives when we realize our parents were immature kids when they had us and are still trying to grow up. If any part of you would cry at the thought of losing one of them, maybe you should find a way to be the best person? Out of my father's three kids, I was the only one in touch with him when he died. I am also the only one who has a clear conscience after. I see how it has impacted my siblings who could not forgive him for his behavior. I would not wish that pain on anyone.",
            "You aren't born into a family, you choose your family. It is clear who your family is and I sincerely hope you enjoy the life you now have, minus the negative bastards who will always put their own needs before your own.",
            "You are a badass!  I'm really impressed.",
            "Just in case, pasting this post in the comments: \n\n> original post is here, https://www.reddit.com/r/relationships/comments/26pydf/my_bf_m25_wont_ask_for_my_hand_and_my_dad_m48_is/\n\n> The wedding went on as planned. My parents stuck to their guns and boycotted. One of my two sisters attended and is now happily blacklisted from our family. Nobody else from my entire family showed up including my two brothers.\n\n>The wedding was a little unconventional. My sister walked my husband down the aisle and then his sister walked me down the aisle. I wanted this because my SIL actually introduced us and helped me get my first date with him. There was no questioned about who gives away the bride or even about objections. It was normal other than that. There has been no contact between me and my family, other than my one sister. My mother has made it a point to send me a card every time that they have a family gathering for holidays or birthdays at their house to let me know that my father says I'm not invited. I get one almost every month. I don't even read them anymore I just toss them. I don't why they keep sending them because I've made no effort to contact them and I live over three hours away so it's not like I will run into them by accident.\n\n>The reason I came back to post this here is because some people here made a prediction that came true (that they would come crawling back when we had children). I am now expecting our first child, a girl :). She will be the first grandchild for my parents. My parents found out about the pregnancy a few months ago through a family friend. They didn't waste anytime in making demands, not requests, demands. My boyfriend and I are not religious but I had a Catholic upbringing. I don't practice at all by choice. My mother called me back in April telling me that my father wanted our daughter's middle name to be his mother's first name. I said no. My father was listening in on speaker so I went ahead and told them that they were officially uninvited from all birthdays, graduations, and any other important dates in her life. My father called me half an hour later crying and begging me to come stay with them for the birth so my mother could care for me. I said no.\n\n>He also said that he had already made arrangements for his priest could baptize her at his church but that I needed to agree to naming her after his mother if I wanted this to happen. He said he'd already planned a big celebration for the birth and the baptism that he was paying for. I said no to all of it. He went from meekly trying to sweet talk me to raising his voice at me and I hung up.\n\n>He called a couple of more times to apologize for losing his temper and again beg me to reconsider giving birth at a hospital near them so they could visit us. He denied having any knowledge of my mother sending me cards to uninvite us to any family functions and even said that he specifically asked her to invite us but he was told I declined every time. He lets my mom do the dirty work so he can later hide behind her and deny he had any knowledge. He's done this since I was a little girl. He does this every time he wants to drop the hammer on somebody but be the good cop also. He'll never change. He denied having any knowledge of why anybody in the family missed my wedding. I told him our daughter would not be baptized, or catholic at all (no offense to Catholics). I told him he was to manipulative and controlling and I didn't want my daughter exposed to that. He's too toxic and just venomous.\n\n>Coincidentally, the day and for several days after that phone call I got tons of calls and emails from my brothers, their wives, my sister, and all my aunts. They all wanted to apologize for missing my wedding, and all had specific excuses, and wanted to make plans to be there for my daughter's birth. I banned them all from her life until she's old enough to decide for herself to let them in.\n\n>My husband was a little surprised and not sure about banning everybody forever. He's more leaning towards supervised visits if they want to drive to us. My dad has been calling him like crazy but we are a united front. My husband is deferring to me but giving me ideas as to how I can give a little if I decide to. But with my family there's no giving a little. They want it all. For now, they're all banned. I will reconsider when the youngest of our children turns 18 :). For now my dad will have to settle for sucking up to my husband while I stick to my guns. Unlike him, I don't mind owning my decisions even if it means I'm bad cop. I'm not ready to give up a relatively drama free, stress free life to allow my dad and all his sheep back into our lives.\n\n>tl;dr: Nobody in my family showed up to our wedding other than one of my sisters. Everyone is banned from our lives.\n",
            "I like your your boyfriend. I also, think that banning them forever seems a bit extreme, but then again you know your family, and if you say that if you give them an inch they will take a mile, Ill go with your judgement. I'm glad the wedding went well, and sorry that your family is acting this controlling over you. Hopefully, they will grow to understand. Best wishes! ",
            "As an aside, start calling your parents by their first names. Let them really know how far gone they are from the parent spectrum. ",
            "Good for you. Well done.",
            "I'm sorry about your family, but congrats on the wedding, your husband and your baby!",
            "Honestly, I would have just put \"Return to sender\" on her little dis-invites. Just to make the message clear. And I wouldn't ban them til your child is 18- just until she is able to understand what all brought this on. 12-14 most kids seem to be able to handle if grand/parents are jerks and if they want to have a relationship with them.\n\nI'm glad you guys have a good united front.",
            "I can't wait until her daughter posts 18 years later about her family and whether to let them into her life",
            ">  I banned them all from her life until she's old enough to decide for herself to let them in.\n\nLate to the party, so you may not read this, but my advice is to be honest with your child(ren) as early as possible for their own protection. They need to no why grandma and grandpa are not nice people and should not be trusted because I wouldn't put it past your parents to try to abduct them one day. So, whenever you enroll them in school, it would be in your best interest to inform school officials that their \"grandparents\" are not approved guardians and should never be allowed to pick them up from school.  Same goes for any future daycares and babysitters.\n\nIt may be a bit overkill, but based on their previous behavior, I wouldn't put it past them to start to see you and your husband as the enemy, as \"unfit\" parents and try to \"save\" their grandchildren from you.",
            "All this over your family freaking out that your husband didn't ask for your hand in marriage.  Sigh.  Perspective, some people just don't have it. ",
            "You make me proud OP. Sounds like you and your husband are the only sane ones. F them all",
            "The baby's name should be Justice. ",
            "OP, you are full of class and grace and alpha AF. I wish you, your husband and daughter the very best.",
            "You should spend time on this board teaching people how to set clear boundaries and follow through! I'm sorry your family had been so shitty, but you're awesome and your daughter will learn the value of boundaries and autonomy!",
            ">He lets my mom do the dirty work so he can later hide behind her and deny he had any knowledge\n\nThis is so common but it's not well understood here. A huge majority of justnomil is brought about by that.  Fathers who subtly manipulate their nosy wives from behind the scenes....so they can get what they want with no blame.",
            "Props for being such a good daughter. I would have told him never to call me again, that my father (essentially) died right before my wedding.",
            "OP, if there was a hall of fame here for this sub I'd put you in it. You have done a fantastic job up standing up for both yourself and your family against your horrible, narcissistic parents. I can already tell you are going to make a great mother. Keep staying strong.",
            "Power to your good sister. She'll make a good aunt. ",
            "That's some nuclear-option retaliation right there. I didn't read through the first post, so I'm not going to comment on how deserved it is or isn't; my own family has a very similar level of allowed interaction with me due to their behavior, though, so I get it!",
            "Damn your parents are dense.",
            "Just a thought... is there any course of action your dad could take to start to rebuild?\n\nFor instance, if he were to apologise in front of the entire family and take ownership of everyone black balling you would you be willing to allow your mum and siblings back with a long term view to eventually allow your father back?",
            "Damn, 2 years later and OP delivered!  Nice to see you handled the situation well",
            "How the hell did you manage to remember the password for this account after 2 years, OP?",
            "Other people have covered a lot of ground about your parents, I want to comment about the other relatives involved: I gotta say, I think that banning all of your relatives for life is a little harsh without trying a few things first.\n\nThey definitely owe you an apology and some sucking up (if they truly skipped the wedding out of spite and not because they legitimately couldn't make it because of expense/prior engagement/etc), but it seems that they are doing that. So, as long as they make it clear that they are willing to reconnect on your terms, rather than be overly controlling as your parents are, I don't see why you can't accept their apologies and take it one step at a time, increasing contact if they continue to show that they can be respectful.\n\nYou could try laying out really clear limits for what you think is acceptable contact, such as \"Aunt Sally, you are welcome to visit the new baby as long as you come to our hometown/hospital, agree to stay for only x amount of time (which the nurses can enforce for you) so that we can rest, and agree to not discuss any issues regarding baptism\" or whatever conditions would make you comfortable. Your husband and the nurses could help you enforce the limits and kick out/uninvite anyone who refuses to play nice, but if your brother/aunts are truly sorry and want to be better to you, this would give them a chance to show that they are willing to do it and slowly build back trust.\n\n>I'm not ready to give up a relatively drama free, stress free life to allow my dad and all his sheep back into our lives.\n\nUnlike what a lot of people on this sub say, I think that totally cutting people out and placing blanket bans usually causes a whole lot more drama than it solves. There are particular cases where it's necessary (I work with abuse/trauma victims, so I do know about abuse cycles and that sometimes abusive families have to go), but it is a nuclear, last-resort option after all of your reasonable attempts have failed. I can't say whether it's time for that with your parents yet (it may be), but I think for your other relatives, at this stage in the game a total ban will only increase the drama level in this situation.\n\nI think that people are really gung ho about your response because it can feel really gratifying to watch someone take a big stand against overbearing people. Many of us DO need to speak up more in a lot of situations so it feels great to watch someone just go balls to the wall. But in your actual life, taking the middle road is usually more effective, even if it's less satisfying to read about on the internet.",
            "I just wanna say that this made my day! Toatally awesome",
            "Consider posting this to /r/raisedbynarcissists ",
            "Hah, wow, they sound CRAZY! Glad you are free to avoid them! You could happen to move across town so they really won't be able to find you and mess with you! ",
            "first of all congratulations to both of you! \n\nSecond dam your parents really are cocky, your dad was so sure you would bend he got it cleared with the church and everything.\n\nGood for you for sticking to your guns!\n\nSo your child will only have 1 relative to visit when young the only sister who came to your wedding! ",
            "Good lord, your parents are crazy cakes. \n\nGood luck with bub! :)",
            "This should also belong in /r/raisedbynarcissists",
            "Jesus christ.\n\nWasn't there for the original post but just reading it, I was skeptical about the extreme of just cutting them out but damn...really glad you did OP.\n\nCongratulations on your baby and I really respect you for staying resolute through all this. ",
            "/r/raisedbynarcissists \n\nYou need to spend some time in that sub because this is all text book narc behavior. ",
            "Your husband, good for him and sad for you, just doesn't have the experience with awful family members that you do. Listen to your gut.",
            "You should post a fake birth announcement about a week before your due date.  That way they don't try to track you down at the hospital.",
            "Go girl.\nAnd don't give in to your dad. He still has conditions attached to his requests, no matter how he makes them.\nYou can also post this in /r/ProRevenge. They will love it.",
            "YAY OP! This is fantastic news. Your daughter's going to have the best mom ever. Talk about firm and decisive! Woo hoo!!! :)",
            "i'm sorry you have been dealt such aweful parents",
            "You are going to be an amazing mum!",
            "After reading both posts, I must say, your family sounds eerily like half of my family. Controlling, toxic, demanding, manipulative, etc. From what you've written, they have no redeeming qualities, save for your sister who did attend your wedding. The part of my family that's like that have absolutely no redeeming qualities, and I've long ago made the decision to ban them from my wedding and my kids' lives (if I ever get married and have kids). I've been mentally and emotionally scarred for life because of my family's crap, and I absolutely refuse to expose my significant other and kids to those toxic people. You're doing the right thing, and your husband was absolutely right on his reasoning not to ask your dad's permission to marry you in the first place, and your family's reaction to it only further proves that they didn't deserve a say anyway. The whole premise of the archaic tradition is the belief that women are property, and that is sexist and quite frankly disgusting. People are not property. What they initially did was bad enough, but now they have the audacity to demand back in so they can expose their grandchild to the same toxicity they've shown you? Keep them banned. Even supervised visits would be damaging to the child. Once she turns 18 and is done with high school, if she decides she wants them to be a part of her life, that is her prerogative, but no child needs that sort of negative influence growing up.",
            "Glad to hear this. All I can say is Family is not choosen and you got a pretty selfish one. Hope everything goes well with you and your new family.",
            "Mad respect to you and your husband ✊",
            "I felt so good for you and your real family reading this. Have a good time together OP. I would do the same.",
            "You and your husband are awesome! ",
            "Oh my god. The hubris of your parents is astounding. This is some next level shit right here. Wow. I'm so sorry that these are your parents. Jesus...",
            "I think your daughter (congrats, btw!!) is going to be curious about her grandparents long before she turns 18.\n\nI'm assuming her paternal grandparents are not banned? \n\nI would leave the option of contacting her grandparents up to your daughter. When she is old enough to ask questions about them and has some autonomy over decisions in her life, you can give her the option to meet them.\n\n*If* your father **ever** wants the option to meet his granddaughter before then, the first requirement is that he has to own his behavior, and apologize for all of his actions going back to prior to the wedding. ",
            "I'm happy you stuck to your guns and kept them away. They are only in it for themselves.",
            "Inconsiderate, was the word you were looking for. Your parents were being inconsiderate, not your BF/Husband.",
            "Good for you! You sound like you have serious clarity of insight. I wouldn't budge a SINGLE #$%@ING INCH until they did a 180 and started talking about involvement that's 100% on your terms. But, that's not likely to ever happen. So good for you in kicking them to the curb. It's worth it and and it sounds like you know that. \n\nP.S. Your husband sounds great. So glad you traded bad family for good. ",
            "Well done on sticking to your guns through all that. It can't have been easy. You've just set the first of many examples of strength of character and how to stand up for yourself for your kid. You got this.",
            "I don't even know you and I'm so proud of you. Good job! You're damn right your daughter doesn't need to be growing up around that kind of environment. That's just ridiculous.",
            "I know you're putting on a brave face here but I can't imagine the hurt and turmoil this has been for you. I'm so sorry :( I hope you have a glorious future. ",
            "Just remember that they need to live with the fact they missed out on their daughter's wedding. ",
            "Don't change anything to your plan and keep being a great team with your husband. Let your children decide on their own when they are old enough to understand the nuances in the story.\n\nJust because they are related to you does not mean you have to have them in your lives or love them. Best thing I did was cut out 90% of my narcissistic familly about a decade ago.",
            "Please stick to your guns. These are unhealthy people and you do not want them teaching your child very backwards ways of interacting with people.",
            "OP, you are so damn awesome. You're like the most bad-ass OP ever and I respect the hell out of you. Im glad you and your husband are sticking together. I promise your future family will have so much less stress now that you've removed the assholes",
            "I totally understand your decision to cut them out of your life and your daughter's. They sound overbearing, manipulative, controlling, and tremendously unpleasant. I'm so sorry it came to that. I wish you many years of joy with your husband and little girl.",
            "Nothing better than a two year later update that was the right choice.",
            "OP, amazing update. As long as you are happy, Reddit is happy.",
            "Great that you're sticking to your words, and being a truthful and consistent person. You have no idea how rare and important that is for children. They can learn all about deceit and manipulation from all the poisonous people they'll meet in their lives, but having a place to come to at the end of the day, a place and people they can trust no matter what, is a life-raft they can keep with them for any surprises that life will have to offer. Just like how it took your stay away from home and with your boyfriend to realize that your family wasn't normal, so too will your children learn from you what is normal until they're old enough to figure out for themselves what's right and wrong.\n\nAnd just in case you haven't thought of it yet, you should be aware of the trouble that comes with 'free' gifts. Manipulative people like your father will often use gifts to secure favors. They give it freely with a smile on their face, telling you it's a gift and something they want you have because they're awesome like that, but the moment they need something from it, they'll invoke the debt you inccured by accepting their gift. You can always tell them to fuck off and keep the gift, but it'll still be a cost to your mental health.\n\nNot only that, but it could also spell trouble depending on what it is they're gifting you. For example, in the case of school, care and medical expenses for children, it might give them authority over choices made regarding those services. Keeping track of it all and guaranteeing that you and your husband are the only ones capable of acting as guardians for your children will probably be a headache, and even without the 'gifts', you'll probably want to ensure that you two are the only ones allowed to pick up your children from day-care, AND that your parents in specific are not allowed near your children. If you're in financial trouble, however, it might help to arrange for your parents to gift you the money so you spend it yourself. If they spout sayings like \"beggars can't be choosers\", you can tell them you disagree with that. Parents can chose to support their children and their families, but it's a terrible parent that would sell their childrens autonomy.",
            "If you haven't already, I think you might benefit from r/raisedbynarcissists .\n\nI'm so sorry!",
            "All the high fives and hugs, OP!  Congrats on your pregnancy as well!  Your stand with all of this solidifies my feelings about my FMIL being a total shit to us during our engagement.  She's coming to the wedding, but she has made no effort to hide her feelings about me ruining her family by taking her ONLY SON away from her (barf).  I told my FH that if she cannot be respectful of our marriage, then she doesn't get to enjoy any positive moments that come out of our marriage.  Keep doing you, OP!  All the best!!!",
            "Your family is a piece of work. I'd say continue no contact. Not even supervised visits. That just lets them in and they can little by little entangle themselves in your lives and continue to make awful demands. They can go screw themselves ",
            "Holy crap...what a manipulative and shitty bunch of people. As if they are still making demands to you. Did nobody learn anything from you being ghosted out by them? They put this wedge in your family and you held your head high and stood your ground, much to their surprise I'm sure. Good for you standing up to these assholes. Family is important- but not necessary. Send them an uninvite to your baby shower, her birthday parties, etc. ",
            "What a great story! So happy you were able to break out of this abusive cycle. There are so many people who I'm sure wish they had your strength. Your boyfriend sounds like an excellent companion sticking through all this. Best of luck for you and your future family!",
            "That was incredibly satisfying to read. Props to you OP.",
            "Your parents are awful and petty human beings.\n\nCongratulations on your pregnancy. Life truly, TRULY is too short to be petty and blackball loved ones out of your life for the reasons your parents/family did.\n\nLike ... what the fuck, man. Your siblings too? Good on your sister for showing up.",
            "I'd say return all the cards to sender with something like Moved No Forwarding Address.",
            "I think it's wise and noble of you to cut out toxic people. I see so many people on this subreddit try to maintain limited contact, but it's still out of guilt and obligation. I'm so happy your kids will not exposed to that while they are young and impressionable. Good for you.",
            "Your husband seems to think contact with your family is important for the children. Please, please stick to your guns.\n\nMy parents thought that contact with their asshole families was important for us children too. You know what happened? \n\nMy dad's mother tried to break up my parents' marriage by spreading lies that my mom was having a lesbian affair. She and my aunt also tried kidnapping us kids. My mom's mother never said a nice word to me during my entire childhood. She also disowned all of us when she got mad at my mom for speaking up about a pedophile relative. \n\nMy childhood was **traumatic.** It would have been 1,000x better if I'd never had contact with any of those narcissistic, manipulative vipers. \n\nYou're absolutely making the right choice. It sounds like your husband means well, but please don't buy into the myth that you have to accept abusive assholes as family. Family are the good people you choose to surround yourself with, not blood relation. \n\nKeep banning the assholes. Protect your kids.",
            "Do not cave. They'll play nice for now... until they want to force you to do something again. (Not just naming the baby or forcing a baptism, but birthday parties on the date they want or holidays must be spent at their house or even parenting styles...) The bottom line is that they aren't sorry. They're trying to manipulate you to get what they want. They'll keep doing it. And they'll do it to your child too. As hard as it is, you're doing the right thing. Sometimes you have to let family go to live a healthy and happy life.\n\nP.S. In my book, organizing a family boycott to your own daughter's wedding, because you didn't get your way with HER proposal? Unforgivable.",
            "> My sister walked my husband down the aisle and then his sister walked me down the aisle.\n\nI think this is beautiful. My father is dead, anyway, but no fucking way was he going to walk me down the aisle (I'm not married). I like seeing other ways that people perform this tradition.",
            "Best update this year!",
            "Sounds like most of your blood relatives actually don't qualify as family members - welcome to the team!",
            "I read this and just go \"holy fucking shit who is gonna be the bigger person here\"\n\ntrust me on this: its better to have a family than it is to not have a family\n\nim guessing you only think of yourself so heres some selfish reasons why you might want to keep contact with your family\n\nyou and your boy friend die in a car accident and your child who is 12 years old and never met his grandparents now goes to live with them and is even more fucked up\n\nyour husband and you split up and you fall on tough times and have nobody to support, you go crawling back to your parents for financial support and they use this opportunity to hit you when your low because you kept their grandchild away from them\n\nfree babysitting\n\nparenting advice (although yall fucked so...)\n\njust forgive your family, they love you and brought you into this world\n\nunless you hate being alive and curse the day you were born you owe them something\n\nand you can knit pick my reasons why they dont apply to you but heres some other reasons you might wanna get back together with them\n\nyou will have a hard time self actualizing with this kind of guilt and pain of a seperated family (its important for your subconcious to feel like your a good person and taking an opportunity to exploit power for petty reasons will not resonate with your true self)\n\nfamily is all you got in this world...\n\nwhatever... i doubt you're reading this with receptive eyes but honestly the self actualization part is the most important... \n\nnobody can live with spiteing their parents out of their grandchild, its a shitty thing to do no matter what they did to you it just wont sit well trust me\n\nor dont\n\nyou're shit",
            "So you just... I feel like you guys made this into something super big while it was something really stupid but ok",
            "Good for you! Reading about how you stuck to your guns and denied them after all that awful behavior just caused such a justice boner. Congratulations on the baby and belated congratulations on the wedding. You and your husband both sound like keepers for sure. ",
            "make sure you make a will and name SIL (or other member of your husband's family) or your one fellow-blacklisted sister as your preferred guardians for your kid(s). I'm so sorry but sounds like you are doing the right thing by standing firm. ",
            "Seems like all the ones with negative opinions about your decision might be religious or don't understand this kind of family dynamic lol. I like that your husband didn't want to partake in a seemingly sexist tradition. You are not property. I did find it funny that even though his decision started this (don't mean that in an accusatory way), he thought complete no contact with your family was a little much. Damn, all the stuff the immediate family did, not to mention the fact the rest of the family fell in line, sucks. People who have never been victims of manipulate and abusive families wouldn't understand. They should keep their opinions about your decisions to themselves if they can't at least attempt to have empathy or understanding. \n\nI would say that based off another person's comment, if you have any extended family that has been good to you but just went along with the boycott (maybe they were fed lies?), maybe reach out to them. Make sure they apologize and mean it and give boundaries. If you believe they will feed info or pictures to immediate family you want no relationship with, keep info limited or continue with your boycott. It's a very nuanced situation, especially if there is family you wanted a relationship with but your still mad about the wedding. If you choose to keep them all out of your life, good luck. Only you know every detail about how they are, so don't mind the negative opinions of people who aren't effected in any way. I wish you all the best and hope you make the best decision for YOU and your new family. :) \n\n(I'm not very good at articulating my thoughts, so sorry if it's confusing and all over the place lol) :)",
            "Better question:  Is \"disconsiderate\" a word?",
            "I know Im late but I respect OP so much , I think alot of people crumble when it comes to their parents just because they are an authority figure or they cant imagine living an independent life financially or emotionally without rents , but you sticked to your guns and now they are calling your phone. Let me tell you what your parents thought would happen, they thought you would crumble for whatever reason and im so happy you didnt. OP give us an update if there is one!",
            "Wow your parents are insane. My roommates recently had a baby and both of their sets of parents live about 5 hours south of us. At least once a month their parents come up for a weekend to see their grandchild because they know how difficult it can be traveling with kids. Some people are so selfish.",
            "Good for you!\n\nKeep sticking.\n\nYour dad initially was trying to domineer everything, now he is, again, grasping to control the situation - but he can't.'\n\nBaby will feel the stress you go through so maintaining piece sounds like a great idea. \n\nAlso, this: sometimes blood family fails us majorly; friend-amly, aka framily, is sometimes a better choice.\n\nHave a very happy rest of the pregnancy!",
            "Ephesians 6:4\nFathers, do not provoke your children to anger, but bring them up in the discipline and instruction of the Lord. \n\nPsalm 27:10 \nFor my father and my mother have forsaken me, but the Lord will take me in. \n\nPsalm 68:5\nFather of the fatherless and protector of widows is God in his holy habitation.",
            "OP you delivered after all this time, you the MVP.",
            "God damn are you a badass.  You're going to be a great mom.  Stay no contact, block their calls, return any and all mail (especially baby gifts), and keep on keepin' on.",
            "Fuck yeah OP! Good for you. You don't need those people in your life at all. Congratulations on your baby girl. Enjoy every moment :) ",
            "I'm sorry this happened to you, your parents sound crazy. Good for you for sticking to your guns, impressive. Hope it all works out. ",
            "I mean, I get that your family are assholes and you definitely shouldn't let your parents around your child, but waiting until your youngest child is 18 to even consider letting any of your family near them is pretty harsh. Your life, your decisions, your family sucks, but maybe you should think about reconsidering with your brothers or sister or something at least a little. 20 years because they were bullied by your parents into boycotting your wedding? Yes they were wrong but wow ",
            "Man, this is such a sad post. I can't believe you guys let something so silly as pride between two guys get in the way of a family being together. I hope you guys can figure this out, because not seeing grandparents over a silly fight is depressing. ",
            "This is probably one of the most overblown issues I have EVER read on r/relationships.",
            "Going to have to go against the grain here. I think it's all a shitty reason to destroy a family on both sides of the argument. Both you and your parents are and have been ridiculous. Your husband appears to be level headed and you'd probably be wise to really consider his point of view on this. Very sad post for all involved. Especially your daughter. ",
            "Hello, I've only just read your update and whilst I'm glad that you and your husband have made a stand, I'm also very sad as well because the *while* situation could have easily been avoided if *one* of the parties (your BF or Dad) were to simply swallow their pride and stubbornness.\n\nI just think that it's a shame that pride and stubbornness have completely torn your family apart.\n\n ",
            "I'm all for holding your ground, and I don't know a whole lot about your relationship with your parents/family before your engagement, but it sounds like your relationship has been nuked because your boyfriend (now husband) refused to have a nice dinner with your parents and talk about marriage.\n\nI met with my wife's parents before proposing, just to give them a heads up and assure them that their daughter would be happy and loved. I did this not because it was something that was important to me, but out of respect to my wife and her family.\n\nI agree that your parents reaction after being stiffed was immature and petty, but it seems like the original conflict that caused this huge riff was a small one. I'm sure your boyfriend had his justifications for not meeting with your parents, I just can't understand why that would be the thing that he would choose to burn the bridges.\n\nI feel very sad for your daughter, who appears to be missing out on a full family childhood because of a feud that seems to have originated over something that very easily could have been worked out with any semblance of maturity.",
            "Wow this is a messed up, heartbroken, and fractured \"family\". No wonder divorce rates are climbing... no one makes rational compromises for each other anymore. Everything is about \"me\" and \"freedom\" and \"independence\". I honestly feel sorry for your parents, for you, and for your daughter."
        ]
    },
    {
        "post_id": "f7ikcz",
        "author": "stephandkdhater",
        "title": "My (M 26) parents (M 65) (F 60) disowned me because of my choice of career - now my mom wants to reconcile",
        "url": "https://www.reddit.com/r/relationships/comments/f7ikcz/my_m_26_parents_m_65_f_60_disowned_me_because_of/",
        "score": 4302,
        "num_comments": 416,
        "created_utc": 1582322715.0,
        "selftext": "I got kicked out by my parents a few years ago because of my choice of career. I'm a cinematographer. When I tell people that I got kicked out because of my occupation, they always think I went into something drastic like porn or something. But nope. I'm a filmmaker.\n\nSome context - my parents are African immigrants (Nigerian dad, Kenyan mom). I have three older siblings. The oldest is a doctor, second oldest a lawyer and third oldest an engineer. I was supposed also to into engineering (structural). I studied it in college. My parents were dead set on me becoming an engineer like my sister.\n\nA lot of African immigrants who come to the West want their kids to have jobs like those my older siblings have. When I graduated, I told them I was going to try my hand at filmmaking. When I was in college, I dated a chick who was going to film school. She was an editor and she introduced me to filmmaking. I fell in love with it and began learning as much about it as I could. That summer I worked my ass off and bought myself some equipment and just started shooting. Everything and anything. It's amazing how much you can improve at something when you do it over and over again. Even shooting things as mundane as flowers made me a better cinematographer.\n\nI began gaining ability with the camera and during college in my free time, I started shooting stuff like music vids for local artists, corporate videos, short documentaries. By the time I graduated I felt confident I could make a living in this trade. \n\nI was so scared to tell my parents of my decision. My dad had been talking to his friend (also an engineer) and they got me an internship at his firm. Around the same time I was offered to shoot a feature length documentary in a few countries in South Asia for six months. I chose the latter.\n\nIt didn't go down well with the rents. We had a big argument and they kicked me out. They told me I was wasting my time with filmmaking and that it would leave me penniless and on the streets. At my sister's wedding (a year later) they refused to talk to me. Acted like I didn't exist. That was the last time I saw them.\n\nWhen I got kicked out I had just graduated from school. I didn't have much. My brother (the lawyer) took me in and I stayed with him for 16 months while I worked in order for me to get my own place. I'll never forget what he did for me. My other two siblings also thought I was wasting my time with filmmaking and but he was the only one who was so supportive and had my back throughout everything.\n\nThings are good now. I'm financially independent. My career is in a good place. Getting a steady flow of jobs. I'm also engaged and get married next year. \n\nThe other day I got a message from my mom, asking how I was. She also apologized for everything that went down. She wants us to meet next weekend. She said my dad is too proud of a man to say that he wants me back in his life, but that is certainly the case.\n\n**tl;dr**\n\nI haven't decided on the course of action I'm going to take. I'm inclined towards meeting her. I do miss my parents. Even though I am still hurt and angry towards what happened. And smug too, I'll admit. They thought I would fail. Almost prayed for it to happen. It didn't. How do you guys think I should approach this thing? How do I approach the meeting with my mom? I've been thinking about it over and over again. I'm nervous.\n---\n**tl;dr**: Mandatory summary/question",
        "permalink": "/r/relationships/comments/f7ikcz/my_m_26_parents_m_65_f_60_disowned_me_because_of/",
        "comments": [
            "First off, congratulations. It sounds like you worked really hard and are doing well. I'm a writer / director and I know how difficult the hustle can be. \n\nMeet with your parents, see what they have to say. You are in the drivers seat, if they aren't contrite or don't offer any sort of apology -- you don't have to let them back into your life. They are the ones who have to prove to you that they're worthy of being in your life -- not the other way around. \n\nAlso, having them see you as a successful DP will prove how wrong they were. \n\nGood luck!",
            "What is the best case scenario for this meeting? What is the worst case scenario? Do you want closure? Is there something that you've wanted to say to her for years? Something you wanted to hear? If you go and you don't get the apology you've been wanting what will you do going forward? Whatever you do decide to do, don't bring your fiance until you've had a few successful meetings under your belt.",
            "Why not meet with her and see what she has to say? Take things slowly, expect some growing pains. Since your parents kicked you out, you really get to dictate what level of involvement you're ready for them to have in your life.",
            "The more important question is: Do YOU want to reconcile with your parents? \n\nIf you do, be sure to decide your limits in advance, and don't allow them to cross the line. It's 100% your choice what level of apology you want and what level of contact or communication you choose to have with them.",
            "Reminds me of that funny Family Guy cutaway with the Asian dad and is 12 year old...\n\n\"You doctor yet?!?\"\n\n\"No dad, I'm 12.\"\n\n\"You talk to me when you doctor!\"",
            "I can totally relate as the child of African immigrants (and an immigrant myself)\n\nI'm impressed that she reached out.... Lord knows African parents LOVE to bear a grudge. \n\nNo harm in meeting with her and seeing what she has to say..... Nothing ventured, nothing gained.\n\nMore importantly.... Glad to hear that you are happy and thriving in your chosen career :-)",
            "Wow. First of all, congratulations! It sounds like your life is going in amazing directions, and it must have taken incredible strength, courage and talent to pursue your dream with such fetters in place.\n\nI can see so much of my husband in you. He comes from a strict Asian background where he was expected to be a doctor like his father. I know the pain it caused and still causes him when he is constantly looked down upon for his choices. But you know what, he is HAPPY with what he does. He loves it. And that is what is important to me. I do not know what he feels and went through because my parents are so supportive of me and let me pursue whatever I wanted as long as I was happy and able to grow and stand on my own. I love so much what I do (teaching) and am thankful everyday for that support. When you love what you do, it's never a job. It's so much more, and you are one of the lucky few in the world who have that!\n\nI am so sorry you did not have that support except from your brother. He is the one who stood by you and truly has your back. I always say in any relationship, whether it be love, familial, amicable, whatever, you should always want to support and never tear down. Ever. You should want what is best for the person for sure, but toxic and destructive behavior such as what your parents and other siblings showed is so very destructive, and sometimes irreparable.\n\nIt is up to you how you want to proceed. If you feel like you are in a good place to reestablish contact, go for it! Talk it over with your fiancee, whomever. Look at all of your options. But also be prepared (as was in my husband's case) that old demons will pop up again. You may face the same discrimination and toxicity again from them and make sure you are ready to deal with that as well.\n\nSorry for the novel length answer, lol! I wish you the best and hope you are able to find peace in all aspects. But know you are loved and supported by your brother and fiancee--that is true. Your parents and siblings need to EARN that love and respect back from you. If you are ready, then start walking across that bridge. If not, by all means, do what is best for you. Best of luck and let us know if you have any films coming out! :)",
            "[deleted]",
            "Hey so my father is an immigrant (Pakistan). I had really hardcore ideals of what I was supposed to be pushed on me. I was not a doctor, engineer, nurse, or anything he wanted of me not even a Muslim. I had so much internalized guilt and shame, I ended up homeless and on drugs. But I turned my shit around and have it together now. I’m a parent now and I see things a little bit differently. Bringing kids to a new country and working their asses off so we can have a better life does bring a sense of pride, however it’s so toxic to hold children to be what we want because of what we do for them. My dad couldn’t see past that for a long time, his life has honestly been very sad. Now days my dad has learned to accept me for who I am, despite his cultural narrative and his pride. We have an authentic relationship now, with plenty of boundaries and no longer hear judgements. I’d say give it a try but be firm on what you will and will not listen to or be treated right.",
            "Hi \nKenyan here .\nimmigrant parents with the exact same mindset.\nYour parents were definitely wrong but they are not exposed to the idea of careers outside the norm (not justifying their actions)\nTake your time with it\nI wish you all the best.",
            "[deleted]",
            "Only meet with your parents if you feel that it will provide *you* with emotional healing. Don’t do it out of reluctant obligation. If you really miss them and are interested in the potential of reconciliation, I think it wouldn’t hurt to see them.",
            "I was disowned by my father for dating a black woman - I am white. After bring disowned, we got married. That was 25 years ago, and still they will not relent. Forge your own path.",
            "If you feel you can mentally handle meeting with her, do so without expectations. Hear what she has to say and go from there. I think it's important for you to think about what you want/need from them in order to proceed with allowing them back into your life (apology, acknowledgement that what they did was wrong, etc.). I also think it's a good idea to set up boundaries with them to start",
            "[removed]",
            "Sorry, but I don’t have the same level of forgiveness that others do in these comments. I might go as far as meeting with your mother, but I’d make it very clear that I wasn’t going to be reincorporating them back into my life because they decided it was the right moment to do so. They threw you out when you needed them. They turned their backs on both you and who you wanted to be. And now that you are doing okay, getting married, may potentially have kids, and perhaps are capable in assisting with taking care of them in their older age, they may have a use for you. \n\nMy family did something similar to me, and the problem with people in general is they are apt to repeat the same behavior. Sometimes they grow, change, mature, but often times they hold true to themselves and make the same mistakes because that is who they are.\n\nGood luck. You know your situation better than any of us, I’m sure you will make the best decision. And above all else, congratulations on thriving in a world that was against you.",
            "What I take away from what your mother said is that your father still values his pride more than he values having you in his life.   If he wanted you in his life, he'd apologize. At the very least I would want an apology and have them admit they were wrong to do what they did before I'd considering letting them back in my life.",
            "Wow ok so im going to say im white and from Scotland in the uk and the way different cultures treat there children blows my mind! I have three kids 23,19,10 my oldest daughter is gay and happly married to a amazing woman! People ask me if im disappointed that my beautiful daughter is gay! And I honestly want to slap the stupid out off them! As a mother all I want is for my children to be happy and healthy! Im sorry your parents treated you this way and if you never spoke to them again no one could blame you! If you do meet your mum then well done for being the much better person but please dont allow them to make you feel you are in any way to blame for the falling out your fathers pride will make him a lonely old man in the end",
            "So now that you're rich and successful they will \" recognize\" you as their son, but not before? I thought they said you were wasting your time??? And then literally pretending you don't exist? \n\n*My* petty ass would just message her back and be like\n\n\"Sorry who's this? My parents disowned me years ago I don't have a mom and dad that I can think of off the top of my head!\" \n\n\nTBH your parents are assholes, and it sounds like now that you are successful and have money, you're an acceptable route if they require you for care/financial assistance when the become too old to care for themselves.",
            "A few specific red flag scenarios to watch for.\n\nBecause they disowned you partially for financial concerns, the reunion may be motivated by financial concerns. If the main purpose of this turns out to be to ask you for money...then they are back because they want to use you.\n\nAlso beware the bait and switch: likely starting with a love bomb to lull you into trust and security...followed by renewed attempts to control your career choices. This would  mean they want to regain control of you and realized they can't do that without maintaining a relationship.\n\nThey owe you at LEAST an apology for withdrawing support from you as a control attempt when they should have been supportive. If they go in expecting an apology from you for not becoming an engineer like they wanted, this is another sign they are here to try to take back control of you for their own purposes.\n\nHere's hoping it's nothing like that and all good. But be prepared to stand up for yourself if you find yourself having to against them.\n\nP. S. If you do meet them, meet them in a public place, and take your own ride there (have a way to leave without them whenever you want). And don't bring your fiancee at this point. If they can prove to you that they are genuine and *respectful* of you, then is time to consider introducing fiancee. (One of the rules of surviving a relationship where at least one side has problematic parents: The one with the problem parents is solely in charge of both dealing with their parents and protecting their partner from any negative influence from their parents. Another rule is fiancee's wants and needs come before those of your parents, always. Stick to those two and it'll give you and your marriage a stronger backbone.)\n\nP.P.S. r/raisedbynarcissists can provide more specialized support with this issue, and will respond with more depth and detail than I did. I suggest joining and posting there.",
            "[deleted]",
            "I am in my 70s. I left my family (not dramatically, just making life choices that kept me at a distance) when I was 18. I so much miss having a family around me now. However, at the time I felt I needed to save myself from them. It seemed the only choice I could make. My advice to you is: if you can have a relationship with them and still create a life that feels right to you, you should forgive them and maintain a relationship. But always continue to make choices that are right for you, don't be their puppet. They may treat you differently now.",
            "My dad disowned me and refused to pay for my schooling due to my choice in career. Once I graduated my dad and entire family guilt tripped me into treating him for free. So I did. \nFuck fuck fuck. Not good for me. Make sure she truly apologizes.",
            "if your dad values his \"male proudness\" more than apologizing to his son himself then he is not someone you should talk to",
            "I think you should consider: would your mom be interested in reconciling if you hadn't been successful? Is her love conditional? It was before and it most likely still is in many ways. Like others have said, I wouldn't outright refuse, but take it one step st a time and set boundaries. You didn't deserve to be kicked out the first time and you don't deserve to have yo go through that pain again.",
            "This is actually a positive thing. My friend (West African parents) was cut off from her parents over career as well. It helped her realize how controlling and overbearing they had been her entire life. She still says to this day that she wouldn’t have ever been able to get married and have an independent life if they hadn’t have had the fight they did when she was 22. They eventually made up, but it was on HER terms. She was able to tell them they could be in her life IF and only if they respected her, her husband, their choices, etc. No more unsolicited advice, opinions, etc. It was either a pleasant visit with smiles and support, or none at all.\n\nHad it not been for the big fight, she said she never would have had the wake up call to set those boundaries with them.\n\nMeet with your mom and explain your boundaries. Protect your fiancée otherwise she will be the next “not good enough/not who we think you should be married to” battle. Remind them that you are an adult and will make your own decisions. Invite them to be a part of you life only if they are respectful, supportive, and loving.",
            "Editor here. It amazes me that people don’t understand the amount of work and talent that goes into being financially stable in this field. Congratulations on your success! I myself would be inclined to politely say thanks, but no thanks, but that’s me. I wish you luck in everything. Sorry I couldn’t be of much help!",
            "I’m in no way trying to say what your parents did was right, but you should really think of giving them another chance. Being a first-generation child of immigrants is rough. There’s a lot of pressures and expectations that are thrown at you and a lot of people just wouldn’t understand. My parents were the exact same way. My entire family was made up of engineers and nurses, so my parents thought I was insane when I mentioned to them I wanted to be a teacher. They tried many times to pressure me into another career or re-think my decisions but I stuck it through and now I’m about to wrap up my 2nd year of teaching. My mom finally came around and she is one of my biggest supporters. I always text her when I get nominated for awards/honors at school or if I’m having a bad day. I’m glad I didn’t fixate on all of the things in the past my mom has said to me. We would have missed out on our great relationship now. Sometimes parents just get so fixated in wanting the best for their kids.",
            "There are two things you can do and neither of the choices are wrong honestly. If you are not ready/do not want to ever reconcile that is totally okay and you have that right. I myself probably wouldn’t just because I would feel that the two people in the world who are supposed to be there for you always failed at that. But I do hold grudges so could be that. \n\nThe second choice is go and see what she has to say. This isn’t a wrong choice but so be wary of being sucked in because you are worth more. \n\nGood luck to you",
            "Go to your older sibling for advice.  The one who helped you out when no one else would.  It seems to me that that is the person who has your well being at the top of their list of priorities",
            "Go get yourself a brand new stylish outfit, some new kicks and set up a date. Go see your parents and reconcile as best you can. Flex a little, let them know you don't \"need\" them either, just like they showed you. You'll be on mutual ground and can move forward without them treating you like a baby anymore. \n\nGo on with your bad self 😉",
            "My (35f)parents are middle eastern immigrants and tho they didn’t disown me (I’m an engineer but I work in a different field because of the financial crisis wiping out every contact I had). So I didn’t get disowned but I do recognize some of the things you’ve been struggling with.\nOur immigrant parents move to another country and become a more extreme version of what they would’ve been had they stayed I their own country. They hold onto ideologies and culture like it’s the last thing they have (which to be fair, in some cases is actual true). They pressure their children because they sacrificed a lot so their kids could have a better life than they would’ve had.\n\nIn all this struggle and hardship they forget that their kids are not what they would’ve been if they’d stayed in their own country. The kids grow up with western mentalities and culture (normal of course). \n\nSo I’m not trying to excuse away your parents treatment of you, which was terribly unkind. However, I’ve seen in my parents how age can mellow them and see the error of their ways. They’re now no longer in the thick of raising children and worrying about them, which leads to more time for self reflection. Revisiting old memories and rethinking old ways. It’s possible that your mother truly feels bad. It’s mostly fear of the unknown. And people who live and make decisions that are fear based don’t make the best decisions.\n\nLook if you meet with her and realize they’ve not changed you can always limit contact again. I’m writing this out because I recognize the hurt you describe, and to me it was very important to understand why they did what they did and why they said what they said. Hope everything works out between you and your parents :)",
            "Fellow Nigerian here. I completely understand every bit about your story. However, something I always tell my sister is that our parents are old and stuck in their ways, we don't have to be. We can see their, albeit flawed reasoning, but no reason to respond in kind. I always choose to forgive because in immigrating they sacrificed so much and just wanted the best possible life for us.",
            "\"That career will leave you on the streets!\"\n\n\\*proceed to leave their son on the streets\\*",
            "Nothing wrong with accepting the apology and giving them a try again.  \n\nYou knew  what to expect from your parents.  You perhaps still love your parents.  \n\nThings worked out - No need to continue the cycle of negativity if you don't have too.",
            "Whatever you do, don't send something like I would send. Something like...\n\n\"Oh, hi! It's good to hear from you again!\n\nTell me, what was it that made you remember that I exist?\n\nAnd, while you're answering that, what was it that made you forget that I existed?\n\nI'm just curious, because - you might be astonished to realise - I've been existing all this time, and it's bewildering to me that my own parents might not have noticed that.\n\nLove you! xxx\"\n\nDon't do that. Be the better person and meet them half way.\n\nIf they turn out to still be entirely unaccepting of who you are and what you've chosen for your life then you can still walk away with the high ground.\n\nAs most other people have said, there's still a good chance that they want to mend the relationship, and that is a good thing for everyone. But if that doesn't happen, don't go looking for reconciliation where it can't be found. Listen to what they say, gauge their sincerity, and take it from there. You're the only one who can decide whether what they're actually offering is an olive branch or some kind of nasty spiky talon.",
            "I'm going to advise that you meet with your mother... but be cautious about it. They disowned you over a very dumb reason. Now that you are on your feet and successful, they suddenly want to wipe the slate clean?  \nMeet her someplace other than your home. A public place, like a park, a restaurant, the mall. Take the fiance with you. You are going to want their opinion later, because if they don't get along, you will be the one expected to be the peacekeeper between them, and frankly, that's not going to be fun.",
            "\\>  I'm also engaged and get married next year.\n\nNothing wrong with going to meet with her and see what she's got to say for herself--as long as you're careful not to apologise for anything, and to not cede any control back over to her. Especially because this: **she is not sorry for what she did. That's a lie. She wants back in your life because you're going to get married and over the next few years, might have kids. She wants access to those grandkids.** I don't think she has changed at all--she's just doing anything she can to get back in your good graces. At best, this whole thing may wind up with her and you staying on cordial, friendly terms with her being respectful of you and your husband, enough for her to have a relationship with you and any future grandkids going forward.\n\nAt worst, it could end up with her returning to her old patterns of emotional abuse, controlling behaviour, meddling in your career, your marriage, and how you choose to raise your kids. I'm betting things might wind up somewhere in the middle, but as long as you stand your ground on any boundaries, things may get more stable with time.\n\nBy the way, congratulations on building a career in a difficult field, through your perseverance and hard work!",
            "It really depends on what she has to say. \n\nIf she is of the \"we will let it go and not talk about it\" method...I would continue being out of contact. \n\nIf she actually wants to apologize and your *father* wants to apologize too, that might be different.",
            "I'm also a child of immigrants, and would like to add something. The thing is, most migrants leave their homes behind because they want better for their children. Normally it's because their homeland is economically limited, politically volatile or geopolitically unstable. For them, better means a secure job with a guaranteed high pay. Job security is just social necessity. If you're a doctor, you could be the world's worst doctor but you'll get a job. You could be a fucking terrible lawyer but you'll still make money. A job like in cinematography is different precisely because it relies on several very volatile requirements - you need to be very skilled, highly motivated, and very lucky. Fortunately, you are those things and you are doing very well for yourself. I don't think your parents disowned you because they truly meant it, I think they disowned you to try and control your decision making. That is of course problematic and I'm not denying that. I'd just like to remind you that even that shitty decision was made because they love you, and had your best interests (in their mind) at heart.",
            "Please don’t give up on bringing your vision to the world... ESPECIALLY to please someone else...we need creatives today more than ever.\n\nI’d love to see what you do in the future! Please DM me when that time comes.\n\nGood fortune, my friend.",
            "Whether you want them in your life and to what degree is completely up to you. I personally wouldn't be able to trust someone who has shown me that their love is conditional, let alone someone \"too proud\" to apologize. To me, that would be a recipe for it to happen all over again the next time they decide money is more important than your happiness. But you know your parents best, and you know what you need, too.\n\nIf you do decide to meet with your mom, I'd do it somewhere neutral like a coffee shop. I'd decide beforehand if there are any topics you don't want to discuss, and be willing to leave if she pushes them. If she switches positions on the apology and suddenly you need to apologize for following your passion, leave. Oh, and don't take your fiancee; meeting the parents is a different conversation, to be had if and when your relationship with them stabilizes.",
            "So the tricky part here is you have achieved a state of vulnerability\n\nYou want the validation and closure you were robbed of. You want to accept her back in, it would be good for your mental health and self esteem. On the other hand, if you don't get that validation and get more abuse instead, it will be even worse for your self esteem\n\nAnd right now, you're Schrodinger's Esteem. It's better and worse at the same time, you just don't know which one it is until you open the box\n\nSo if you meet her and she's like \"sorry we kicked you out. Couldn't have a loser son, I'm sure you understand. Lucky that didn't happen!\" Are you going to feel better? No! Because it's just doubling down on the treatment they served you, they get to treat you like garbage and still get to have a son and possibly grandchildren without offering any of the emotional support necessary for raising a successful child. You had to find that on your own, against all odds\n\nWhat you want is for her to meet with you, realize that she loves you because you are an artist, loves you even if you *were* penniless, loves you because you are her son and because you are and have always been a good person that has always deserved that love. What you really want is for her to apologize, take ownership for the pain they caused you and make amends\n\nBe really real with yourself. Do you think that's going to happen? How much would the first scenario hurt you? How much would it hurt you if you kept them on ice? How much would it hurt you if you kept them at arm's length? Weigh that pain out. Test it out before you buy it\n\n I've opened enough boxes with metaphorical dead cats and now I just don't open them anymore",
            "Hi man. Congratulations on your success in cinematography. As for reconciliation with your parents. I think you should do it. They kicked you out that means they were either worried as shit about your life or have a controlling nature. Just keep your head calm and go for it. By the way, did they know that you were going to get married? I wouldn’t say but it could be that they just want you back because of something. Now, I am not sure about this but please keep the worst scenario in mind. IF it happens it will help you to get through. Tip:Don’t bring fiancé to a few of your meetings.",
            "Seems a bit ridiculous to tell you not to reconnect with your parents because you only get one mom and dad, but if I were you I’d be cautious going forward. I grew up with a narcissistic, pathological liar of a mother who attempted to manipulate me into hating my father and his side of the family from a young age (they divorced shortly before I was born) and for the longest time I tried to maintain a relationship with her based on the premise of “she’s your mom, you have to deal with it”. \n\nI’ll tell you this, and please take this advice as much as you can: family or not, bad people are bad people and you do NOT have to deal with toxicity simply because somebody is related to you. Relation is out of your control, how you act isn’t. \n\nThis doesn’t go to say that your parents are entirely “bad” people, but they did a very bad thing to you. And even upon the point of attempted reconciliation, your father is “too proud” to admit that he wants you back in his life? Too proud to admit he did the wrong thing to a child of his? Looks and smells like bullshit to me, OP. Protect yourself in this situation. If you must forgive, never forget.\n\nI understand it’s a tough situation and giving advice via Reddit with no personal relationship to you and your family is easy, but speaking from experience; your family isn’t inherently good for you just because you’re related.",
            "I think the problem will be your dad. Your mother will be running interference because\"he's too proud\", soo he won't be expected to put in the effort to contact you, ask for forgiveness, or, even listen to you maybe? Them your mother might end up being a flying monkey for him, and that's not good for anyone, especially you.\nI strongly suggest, to treat them as separate entities. If your mother reached out, meet only her. Don't allow her to talk to you about your father and guilt you into reaching out. He's the one that should do the work. In many traditional families it's the mother who does all the emotional work (and gatekeeps relationships as well), and the father gets used to the wife just cleaning up his relationship messes by running interference and asking others to \"be the bigger person\" \"he's your father\" \"we're a family\".\n\nThis might not be the case, but just beware the possibility and don't fall for it.\n\nEdit: also, read about proper apologies. Someone saying\"I'm sorry\" is not necessarily an apology if it is followed by \"I'm sorry but....\" 'im sorry IF...\" \"I'm sorry that YOUR feelings WERE hurt\". Notice that none of this puts the responsibility on them, but rather on you and your feelings, by something that happened, passively. A proper apology should go, \"I'm sorry that I... \" Admitting responsibility without trying to justify it. Could be something like \"I thought I was doing the right thing, but I now realize that I was very wrong and I should not have done that, I am trying to understand why I did that, because I want to never do that kind of mistake again\".",
            "Before meeting I would definitely recommend thinking about what you would want a future relationship to be like with them, what requests you have, what boundaries you want to set to insure this doesn’t happen with your future wife or grandchildren, and so that they are fully aware that they can not control what decisions you or your future family makes, nor can they do anything to sway you. They need to agree to accept that you will go your own way and live your own life",
            "Is she just coming around now because she heard you're financially sound? If you hadn't been, would she still be asking to be back in your life? If the answer is no, I'd tell her to pound sand.",
            "I would see her and gauge whether it's in your interests.\nI would be curious to know why the sudden change of heart for her and you want time to consider your options as sorry doesn't erase the pain their narcissim caused",
            "Your parents may want you back in your life because they love you, but bear in mind that their fundamental personalities are extremely unlikely to have changed. If you're in a good place right now without them, then you have more to lose by letting them back in and having them potentially destabilize your hard won success. If you want them back in your life take it slow and accept that the things that led to the original conflict will still be there. It's up to you to impose boundaries. Good luck",
            "Hmmmm... tell then what you want.  An apology? Relationship? Respect, ect.  And be definitive. If they can't redirect you and your career as an adult they will only bring toxicity into your life and they will think it's ok to belittle your profession and intrude on your personal boundaries. Best of luck!",
            "You can have a relationship with them and still let them know that they had a choice to support you in your dreams or abandon you and they chose to abandon. \n\nDo what you can to repair your relationship with them, but keep in mind the choices they have made and make sure they know you haven't forgotten. \n\nIf they take the meeting as an opportunity to excuse their behaviour, be even more wary. They will not have learned the lesson and might continue to be so dramatic during other choices in your life.",
            "By the way, congrats on all the good things happening to you right now, you worked hard and deserve recognition",
            "Okay, so this happened to me too and it was because I wanted to be an artist. In my case I moved countries to deal with the disownment. When I actualised my chosen dream after years and all their friends knew of my work, my parents wanted me back in their lives. \n\nI would say go and hear her out (but go alone don’t involve your fiancé yet.). Just be cautious. It sounds like you’re doing very well in your field and I am now naturally suspicious of parents who don’t support their child when they are new/struggling but want to know them when they start doing well. Parents aren’t supposed to just dip in and out of your life as your career thrives or fails. \n\nI would go but be cautious.",
            "In all honesty, I’m pretty sure they want reconciliation because your career is actually taking off and there’s a chance you might become a well-recognized professional. I’d be very surprised if their “remorse” didn’t come with strings attached. \n\nLike, they probably won’t want their child giving interviews about his origins as a filmmaker saying “ah, yeah, no... no family to speak of except for my brother, they disowned me when I chose this career path.” Like... your whole family’s reputation would take a huge hit, especially that of those professional golden children siblings of yours.\n\nI mean, if you do reconcile right now and happen to become somehow famous, they’ll expect you to be like “yeah, LOL, my parents didn’t talk to me for SO long after I became a filmmaker, but we’re cool now.”\n\nThink of it: unusual career or not, you ended up following the steps of most professionals (college, graduation, gf/fiancé, financial stability). Would your parents be seeking reconciliation if their “prediction” (you homeless on the streets) had become true?",
            "Many children of immigrants are thrown into doing things that they don’t want to do because their parents want bragging rights. They see their children as an investment as opposed to...well their children. As a result the children of immigrants are mostly unhappy doing things to please their parents as opposed to living their truth.\nYou lived your truth and with a Nigerian father is just so proud that you did what was right for and now you’re seeing the fruits of your labour. \nYour parents shouldn’t have kicked you, they should have supported you as their child. \nIts weird because ask your siblings what they really wanted to do and I promise it’s not what your parents wanted them to do. I think that they were jealous you essentially stood up to your parents and told what you wanted to do with your life.\nYour mum has reached out and most importantly she has apologised, you know African parents do not tend to do that at all.\nI say give her a chance and it will be on your terms, because she wants you back in her life. After almost ten years. \nTake it slow because you may regret if you don’t take the chance to clear any bad blood between you.\nWhen you meet explain how being disowned made you feel and how they missed out on important moments in your life.",
            "I’ve said it a thousand times and I’ll keep saying it. There is nothing better than proving someone wrong when they say you can’t do something.\n\nI’d say meet with them, if they start asking for handouts/help/ anything about you “owing them for raising you” then ditch out of there as quick as you can.",
            "I think you should meet them. Your parents sound like the type that want the best for their children, or at least what they think is best. The jobs they had in mind for you are typical for ones that lead to a \"better\" life than what they lived. This rejection of the kid chosing another job, especially one that harbours a realistic potential of not bringing stability, especially not easily, is not uncommon. It is often a panic reaction, with parents fearing their child will fail and suffer. It might not even be that they think one can't have success in that field, but rather be all too aware that it is not as easy as in technical fields (engineering, medicine, even law is a career based on need, while anything entertainment related is a \"nice to have\" basis. This also goes for things like camera and sound crew, but especially for the creative parts.) to be successful and stable. Mind you, even the other careers have potential for failure - there always is. But I think you get what I mean.\n\nSo parents might panic. Their way to deal with it might seem tyrannical, but see it in the way that to them not too long ago, you were a child, a toddler even, that needed guidance. Letting children go on their own is hard, and not always instantaneous. They might not even realise this fully. Sure, kicking you out seems rather irrational if they want to protect you. But this can be compared to grieving. You know, shock, denial, grief, anger, acceptance (not necessarily in that order). They might try to argue, when arguing doesn't work, they might try punishment (\"Go to your room!\"), in the hope the kid might allow them to \"Do what is best for them\". It can take time to realise what they were doing there, and there might be several conflicting motions going on in their heads  - even just simply things like \"Protect the kid and guide it\" versus \"Let it fly and find its way\". Both are really not wrong, I think you'll agree, but they don't always work together. And since  one cannot call either one wrong, the parent find itself in a quandary. Add to this pride, emotion, and immediate reactions, and stupid stuff happens easily. \n\nThat your mother reaches out to you sounds to me like this was the situation. Conflicting options, and how to deal with it. It is highly likely they realised they chose the wrong option, but it took some time. It might seem like they contact you only because you are successful now to make goody goody happy happy. But it also could be, that the message of you being well and successfull eased a long worry from their minds. The worry that their child comes to harm always in their back of their minds. And they might even have realised earlier they were wrong, but that also meant that offering to \"help\" might lead to further rejection as it can come across as a display of supposedly knowing better. But with you doing well on your own, this could have eased that fear, and they dared approaching you again. Sure, help earlier might likely have been appreciated, but unless the realisation came soon enough after the inital fallout to say without too much awkwardness \"Hey sorry about that, please come back home\", the above fear would apply. No longer worrying, no longer fearing, eases the fear induced paralysis in that situation. \n\nGo meet your mother see what she has to say, and the make your decisions, I'd say. \n\n\nAlso, something to consider. You say your father has pride. The question is, what kind of pride. Pride that makes you reluctant to actively admit fault is always tricky, but as long as they can admit it themselves, it is something you can work with. They might not say the words but they will not try and argue their faulty side any longer. Maybe even show their admission of fault it in other ways without words.\n\nIf the pride of your father is merely preventing him from directly admitting he was wrong, then I say really give them the benefit of the doubt.\n\nThen there's also a thing with pride tied to accomplishments. Parents can be proud of their kids, and usually want to be. The question is in which way? Are they proud of their kids for what the kids accomplished? Basically being proud *for* them. It is also coupled with happiness caused by seeing your kid happy. \n\n\nOr are they proud of their kids *because* of what they accomplished. Being proud *that* their kids are successful, mabye even seeing their kids success as a direct success of their parenting. That last one is a dangerous one, as it often comes with seeing a kids failure as your own failure. How someone deals with that is also relevant, be it with sadness, or anger. Sadness is preferrable, but not ideal either. But anger is particularly bad, as it often ultimately leads to a toxic environment. But I digress. \n\n\nAaanyway. Your father sounds like the type that can admit fault to himself, but has trouble voicing it to others. Not ideal, but still okay. Your parents also sound like they just want you to have a secure life - often called \"what is best in your life\", but that is something based on opinion. Usually it is really just wanting safety for the other, and not yet having figured out that that is actually what the real intent was always (Human minds are beautiful, chaotic, and stupidly irrational things often. It really should come with a manual. \"'Why am I scared that you don't let me help you, and why can't I properly express this to you?' and other emotional messes\" or something like that). And then just panicked when they already saw their kid falling into a canyon before even getting on the train. I think the perfect term is \"Fret\". Give them the chance, meet them, and you can decide on further steps as things become clearer.\n\n(Reposting this comment as one phrasing went against the rules, so I rephrased it. Technically an insult, though not directed at a person but rather used in a description of a bad situation.)",
            "Do you think they would have reached out if you didn't end up successful?",
            "> She said my dad is too proud of a man to say that he wants me back in his life, but that is certainly the case.\n\nYour dad kicked his youngest son out of the house because he was working hard to establish himself in a field that he loves instead of fitting the mold they pre-conceived for him (as if they know a damn). He doesn't deserve a single shred of pride, and his inability to admit he was wrong shows that he hasn't changed. I hate to say this, but your parents weren't really there when you needed them. It's easy for them to come in now that the dust has settled, but would they have otherwise?\n\nYou may love and want the approval of your parents, but don't turn them into deities. If they were actually apologetic, perhaps you could move on, but if they just want to sweep it under the bridge, fundamentally nothing has changed. Proceed with that in mind.",
            "Are they reconciling because youre successful, or because theynrealize they were wrong.  Ask them if they'd still have contacted you even if your career hadnt worked out.  Or would they have been all \"i told you so\".",
            "I'm a big believer in personal responsibility. They made a horrific mistake in completely torching their relationship with you, and it doesn't really seem like they've taken full responsibility for it. They're gonna need to do a hell of a lot more than half a letter (half, because there are two of them, and only one has reached out). Your mom agreed with the decision to make you homeless. She was all for that shit back when they were soooo sure you would fail, that they did everything in their power to actually make sure you would fail. You didn't. \n\nYou don't need them. That's what's really bothering them. They ghosted you at your sister's wedding, so don't think for a second that they actually want a relationship with you. What they want is control. Tell them you're busy with work. Let them see you succeed from far away. Win an oscar, and thank the brother that helped you, while mentioning *why* his help was necessary in the first place. Don't give these monsters a pass for abandoning their own kid. They don't deserve it.",
            "I think you have nothing to lose. Why not even film it?",
            "Hey, I reconnected with my parents after 7 years of NC. We had an excellent, excellent therapist who helped facilitate and helped us process our emotions individually and as a group. At first my parents were REALLY defensive because they couldn't admit they had fucked up, and that was a challenge. We wound up all kind of just... moving past that. They apologized, I apologized (for the hurt they felt in the situation, not because I did anything wrong), but there was no \"closure\" in the sense that we never really went back over what actually happened too much. We just moved forward, with new boundaries, and as equals.\n\nIt was really scary taking the risk to let my parents back into my life after they hurt me so much, and it was very stressful for a while, but it's been one of the best decisions I've ever made. There was definitely a learning curve and I couldn't have handled it without my supportive partner.\n\nI wouldn't have let them back in if they weren't invested in learning how to respect boundaries for the first time ever. I also had to learn to be less reactive. Like I said, learning curve. \n\nHappy to answer any questions if you're interested.",
            "Hey OP , nearly a month have passed , do you have any update on how things with your parents have progressed . Also how are these days , gow are you holding up and what are you doing ? ( sorry too curious not to ask many questions 😃) Anyway i hope you're in a good place and congtrants on the engagement . And please give us an update if you can and if ( respectfully) there's any to be given that is  of course 🙄",
            "You should go and try to reconnect life is short and in a blind of an eye they could be gone, but if they don't apologise for disowning you and throwing you to the wolves or show any sign of remorse walk away and don't look back it won't amount to anything but hurt and anger.",
            "Try not to let anger and resentment have a place in your decision, they are as poisonous as your father's misplaced pride. Make the meeting, hug your mom, and if possible work toward forgiving them. Good luck.",
            "Your parents messed up so they have to be the ones to ask for forgiveness, and that includes your \"too proud\" dad.  Lots of parents are narcissistic control freaks, they can excuse it away by blaming culture, or doing what's good for you, but at the end of the day, they want control and they were willing to stoop so low as to kick out a child out of their home to do that.  That is never ok and you should make it a condition that they fully apologize before restarting any kind of relationship with them.  This apology should be unequivocal, they must BOTH (not just your mom) admit they were wrong, that you knew better than they did on your career decision, that they are sorry, and they will never question your business again.  \n\nYou may think that's harsh because you want to run back to your parents and have a relationship with them again, but guess what is a bigger decision than career for most people?  Marriage!  And you're doing it without their consent or blessing!  What if they don't like your choice of wife?  What if you parents want to dictate how your wedding is handled?  What if they don't like your future child, or where you decide to live?  Just take a look at /r/JUSTNOMIL for how bad parents get while trying to control their adult kids.  You may be in for a world of hurt if you get back under their control without them admitting they're wrong and giving up their plan to dictate your career.  \n\nThat's why they need to fully admit wrong and ask forgiveness.  Otherwise, their control freak tendencies may manifest in the future.  What if they don't like your future child's haircut, or what he does with his career?  Would grandma and grandpa disown their grandkids?  They did it to you, what makes you think they won't try this again?  Make sure they own up to THEIR mistake and make sure its sincere before you decide anything.  Or else it may not just be you who suffers but your wife and kid next time.",
            "Your parents probably realize people are going to notice their absence at your wedding and want to save face.",
            "They disowned you for following your passion... Fuck them. My parents forced me to do what I didn't want, I failed at it, they blamed me, even though I tried hard, and I hate them for it.",
            "Meet. Reconcile. I missed a decade with my parents after they threw me out. But once my life choices had proven I would be at least moderately successful, they started trying to reconnect. \n\nThat was 10 years ago. I've had a great relationship with them every since, and I wouldn't trade it for anything. And it almost completely makes up for the lost years.",
            "Congratulations! You should be very proud of where you're at! As far as the stuff with your parents, never feel like you have to. If you want to and you feel like you're ready and in a place to forgive them then by all means go and see them. If you're not in that place then don't. It is not your responsibility to forgive them for being shitty. \n\nIf you do go see them do your best not to gloat or be petty about it. I'm sure your parents feel bad enough about what happened.",
            "Congratulations on your success in a very, very hard industry!  As far as your Mom is concerned you have the upper hand here. Your parents were solidly in the wrong when they turned their backs on you. It’s up to them to try to heal the harm. If you decide to give her a chance approach with caution and have an escape plan. Good luck.",
            "Hi OP, I hope I'm not too late to the party!   \nI just wanted to suggest that you right down or at least deeply think about what YOU want to say. Like a basic script so you can be the one controlling the conversation.   \nThink about the ideal meeting vs. the worst case scenario, I'm sure the real event will be somewhere in the middle and awkward. I'm sure you're excited but also wary of the situation. If it's going exceedingly well, don't agree to meet them again at a specific time. This will give you more time to breath and digest the events. If they say something grading but overall the mean well, try not be flippant, as it's probably an awkward situation.  \nI'm assuming that they are genuine, and learned over time that their hill wasn't worth dying on, but it's not so easy to shake off traditional sentiment.",
            "Dude, what a story!  Super sorry to hear about your parents reaction. I don’t have any advice about the relationship but I just wanted to say I’m glad you chose to follow your dreams!!!  Also I’m an AC in the biz so hopefully we end up working together sometime!",
            "Good luck with everything, I hope most of all that they see your value and contribution to the world. You are a beautiful person to commit so much time to things you are never sure will pay you back. Thank you for all you do.",
            "I echo all the positive things here. Take it slow, be open but dont be to quick to forgive. Hopefully by the end of the talk you get closure. All the best OP! I hope we can get an update.",
            "It sounds like they equated your career choice with no money, no stability and avoidance of everything they wanted for their children. Now look - you've shown them they were wrong, and you could actually build a successful and financially stable career doing what you love. \n\nUntil you meet your mother, or both your parents, you won't know how much of their attitude came from misplaced concern and how much was sheer control.  You don't need their help or approval, although it would be nice to be at peace with them. You can explore the possibility of a reconciliation, knowing that you are approaching them as a strong and independent adult.",
            "Congratulations on your success.  How wonderful it is that you have a sibling that  has  always stood with you as support.  That is truly wonderful thing to have.\n\nGo listen to your Mother - then you  can decide if you want to have  a slow re-establishment of a relationship with her or if this closes the door entirely.  Your parents and your other siblings broke your trust -  you are in control.",
            "In my opinion, they and the siblings who hoped for your failure don't deserve you.\n\nHowever, it does not do anything to remain angry forever at them. At the same time, I find it hard to forgive people who would abandon you like that. \n\nBut no matter what , only you know what is best to do. Best of luck",
            "Honestly I like this. My grandparents were that way about my chosen path in life, and reconciling with them was a godsend. It changed their views on a lot of things and we have an awesome relationship now and we respect each other. I hope you at least talk with your mom and see where that leads, good luck with what you choose!",
            "Just want to say that I'm sorry your parents aren't supportive of your career and what you want to do. I wish I didn't know what that's like, but I do. Congrats on your success and keep doing what makes you happy. If my parent had their way, I'd be a miserable accountant. I've mostly come to terms with the fact that I chose a career I love, even if my parent thinks I'm foolish. I'm getting too old to let it affect me anymore. I wish you a lot of luck and success, and please don't let your parents disrespect you. You're an adult and they need to realize that.",
            "I would go into this meeting with NO expectations. And then listen. Listen hard and to what they say, and what it says about them as people. Is there awareness of the impact their actions had on you, how they made you feel? Any regret, remorse? An apology? Are they being honest with what their thoughts and actions were, and where they were coming from? (Fear that you'd end up penniless, or caring too much what others think) Do they accept you now? Or, are they saying things that are self-serving and condescending and trying to justify what they did?\n\nTake what you've learned from that meeting and make your decisions about how you want to go forward.\n\nP.S. and update us :)",
            "Your passion and drive is admirable",
            "I think you will be happier having a a good relationship with them. It probably took a lot for her to gain the courage to contact you after what they did. She feels bad I'm sure.",
            "Be humble and stay cool. You have nothing to prove. It's nice that they want you in their lives again, family is real. Most people don't understand filmmaking as a profession - they think you're a big star or a nobody without being aware of all craftsmanship and trade work, not to mention just how much content is being produced these days. I'm an editor and while my parents never disowned me, they were certainly skeptical from time to time.\n\nThe point is you have an opportunity to begin an adult relationship with your parents - be the bigger man and don't make a big deal out of the past. They know they were foolish - look forward.",
            "You can decide to build a relationship again while having those feelings. Wanting to meet again does not mean every resentment and pain is erased like that. It just means you are ready to work on them and to begin a new chapter. Letting go or even just wanting to let go of the pain and the anger is very freeing. I've been there and I'm still not over some things but I've told myself that like any human, parents do the best they can with the cards they have in hand at the time and mistakes happen. I'd recommend starting therapy.",
            "Some family therapy sessions could really help to move past this in a healthy way and prevent recurrences in the future.  Good luck to you, and congrats on earning the life you wanted.",
            "I’d hear her out at least. If she’s leading with an apology that’s got to mean something.",
            "I say meet with them. You followed your dreams and made them come true, even though they were against. Anything they say now really is just words, clearly you have the power to create your own reality regardless of opposition. I say make your peace and if they try to bring you down or just make you feel negative by being around them, just go back to living your regular life with your fiancee. I say do it because either you reconcile and they don't bring you down or you face your fears and make your peace and cut them off for good due to their decisions. You win either way homie",
            "I know it sounds easier said than done and I can only imagine what you’ve been through emotionally. I would ask that you ask and answer this question to yourself. How would you feel if tomorrow you found out your parents are dead? Will you feel sadness? Remorse? Angry? Or will you feel emotionless? What about a year, 5, 10, 15 years later? \n\nFor all we know we only have one life. I personally wouldn’t want to live it in regret. Hope you won’t either. Good luck with whatever decisions you make man!",
            "Tell them how the previous drama made you feel. That your decsion was to follow your passion, not to \"rebel\". Sounds like your parents were following what they knew, although outdated, and watching your progress from.afar has probably given them the courage to take these baby steps. Come on, it's mom and dad, they make mistakes just like everyone else. If they are willing to move forward from here and be proud of you for being your own person now your life will only be richer with them in it. Good luck to all of you!",
            "Parents: We want you to follow this career we've chosen for you, it'll pay well and be secure, we never want you to be on the streets and broke.\n\nSon: No thanks, I have my own ideas about my career.\n\nParents: Well in that case we'll kick you out right now, even though you have no money or accommodation.\n\nIt's mad, it just doesn't make sense.\n\nAnyway OP, you seem like a forgiving kind of man and are leaning towards meeting up with your mum. Why not take your supportive brother with you too? I don't think you need to worry too much about how to approach it, as you are in the \"I told you so\" position here.\n\nGood luck with everything.",
            "I'm gonna go against the grain and say meet up with your mum anyway, when you are ready. She has asked forgiveness so it means she has recognized that her past actions were wrong. Yes it hurt, yes it must be painful but you'll find healing and freedom in forgiveness and reconciliation. At the end of the day, she is still your mum. Life is short to harbour anger and grudges. Let it go.",
            "I fell it is very bad for parents to influence their childrens choice of career. I also passed through something similar. Everybody wanted me to become a Doctor- And infact it was a great Job to save lives but I love Programming better and working on Computers. However Today I'm building my version of being a Computer Engineer. Please Do what you would be best at. Parents! let your children choice their career but you can guide them.",
            "For starters, congratulations on living your dream and sticking to your guns in that! That takes a lot, especially when you have no one in your family who went down that path and you could have had a cushy career path if you had just done what was expected. \n\nThat being said, our families and cultures just aren't used to this level of independence. I'm not saying that's a good thing but we can acknowledge that there are growing pangs. The fact that your mother actually reached out is insane. She must be really really contrite. They had a tough time with your brother and then you, and in our worlds, we know they think they failed as parents. It's wrong and problematic and all that but also human. They mess up. Your mother wanting to meet you IS her apology. That's probably all you'll  get for now. They may never come see your movies but they may at some point just start stocking them in their house. Your father may never swallow his pride. But if he is OK with your mom coming to see you, that too is immense. I mean seriously - the number of Hindi/Bollywood movies that are based on this exact same thing are absurd. If you ever want to watch the Bollywood version of your life, start with Kabhi Khushi Kabhi Gham. \n\nAll this to say, it's complicated from your parents perspective as well. Not to say you owe them forgiveness. If you don't want complicated, or you want an actual apology, that is fair too!! And I support that! But if you do actively choose to go back, know that this is about as big a step as they can make right now. That may evolve and change, but maybe don't go in expecting much more than this. That sets you up for disappointment. It's fine if you don't want to venture into this world at all. But if you do, keep in mind all the limitations that come with so many players of so many conflicting opinions and values and mindsets. \n\nWishing you all the best and all the happiness because you have a right to all of it.",
            "As a guy who worked in the arts for over a decade, remember, you’re just starting out - you still have plenty of time to wind up penniless and on the streets.\n\nMeet with your mom, and try not to be too smug lol  Everybody tells their kids it’s very hard to make a living from art, because it’s completely true!",
            "As someone who wishes they’ve received a much deserved apology from a parent, I would at least see what she has to say. Life is very short. If they continue to be toxic and unsupportive, then maybe low contact or no contact would be best. But you never know how it will turn out unless you meet with her.",
            "Hey. Parents sometimes are terrible.  Lots of parents are always terrible.  \n \n\nRegardles if parents are good or bad they still raised us and we will never forget them no matter how hard we try.\n\nSo, you have a chance to make new memories. Hopefully, memories you don't want to forget.",
            "This story is fake lmao. Good read tho",
            "Question here: were your parents paying for your college where during studying you were getting your camera skills?",
            "You can meet with her and share your feelings. What they did to you is hurtful from a child's perspective. They need to understand that despite being your parents, they cannot live your life for you. You could also share with them stories of professionals that have gone into a profession they didn't like to become successful and fulfilled in another field after leaving the profession. These stories are plentiful. It reinforces the fact people should do what they love in life. Money only drive and motivate people for so long. If you don't like what you do, no amount of money will bring you joy and fulfillment. If they are level headed, open to the conversation, and if they are not stubborn, they should be able to understand and appreciate you made the right decision for your life. Also, cinematographer can do very well financially in their craft. The entertainment industry deals with big $ and if you are good at your craft and people notice you will get your share of that pot eventually. Good luck.",
            "Your mom has apologised. Be gracious. Life is short.",
            "dont talk to them ever again. if they only want you when you're successful and don't trust you enough when you wanna risk something for you dream career then they are not good parents",
            "Regardless of anything, do your own thing and be happy. Doing what you enjoy is way more successful than being an unhappy engineer working for a company they don’t like or being a doctor if you’d rather be creative",
            "If I was in your position I don’t know if I could see them the same away or be able to trust them. But depends on your relationship with them. Meet them and start slowly to get a sense of them, and desire after if you wish to continue with them.",
            "don't hesitate to meet her. Everything is aligning behalf of you. never miss a chance to make happy her. Because you are a loving son . Everything will be all right",
            "I read many of the comments and I think some fail to consider the cultural difference between what is expected from you vs them and why is that so. Not all people are evil and manipulative and abusive. Some just do stupid shit because they are raised in a certain society on certain values at a certain point in time, which does have an effect on their belief system. All the professions your siblings carry a certain status, and imo it is good that they pushed you into engineering (which is also a good profession if you like it, not so if you don't like it). However, your parents shouldn't have kicked you out when you realized it's not what you want. Maybe it was a way of control as some other commentators mentioned, but not with malice. For them going into filmmaking instead of engineering probably was equivalent to going into porn and they wanted to make you \"realize your mistakes before you throw your life down the drain\". Parents from different cultures expect different things from their children, while I don't know enough about your family dynamic, based on the post I think calling it straight out abuse is too much. \n\nWhile I understand your apprehension and you're right to have it, you should at least go see your mom. That way you'll get a feel of if they understand what they did and if there is the possibility to fix it. However, if you have to swallow your pride and go meet them after essentially disowning you, and your dad hoping for your failure so they can say \"I told you so\", **your father should at least be man enough to admit his mistakes and apologize for it**. And then you can make an informed decision if its worth it or not.",
            "You get to do what you want. Now that you want to, you can. If you didn't want to, you don't have to.",
            "I think if you can meet with your mom and be an adult about it then you absolutely should do that. She probably misses you just as much as you miss her and maybe this is the first step towards having a good relationship with her. Smugness won't make you feel better in the long run. You know you're successful and you've made it so you don't need to push it in their faces to make it true. I wish you all the best with meeting them!",
            "I think you should talk to your parents because Life is short. Think also about your brother's feelings.",
            "You know African parents. They may say they want you to have a specific career but what they mean is they just want you to be successful. You did your job as the child - you showed them that there are several ways to be successful and they see that. Yes, there is a part of them that wants to claim that success, but they don't know any better and I believe there is a part of them that knows that what they did was very dumb and selfish. Give them a chance to talk, but keep them at an emotional distance. Love them because they don't know any better. \n\nMy brother will not talk to our father because our father was and is still a condescending person. I spoke to our dad because I knew not speaking to him won't do anything for me or my mother. I keep him at a distance, but I'm still cordial and he has started to give me good advice on things.",
            "I would see her, but be prepared to enact boundaries (like leaving or whatever) if they try to overstep again. Now that you're independent and about to get married, I bet they're trying to get on your good side in case there are grandchildren. I'd be very careful how much you let them be involved in your life, marriage and kids' lives if they were hoping you'd be homeless and penniless for not obeying their wishes. Especially if your father is too \"proud\" to admit he was wrong and apologize to you for it.",
            "OF COURSE you should meet her !!  They were really awful to you and you deserve a huge apology, but you may not get that.  Take what you can get now.  Be polite and a little distant but also respectful.  Bring your supportive brother.  Best wishes, and congrats on your successful career.",
            "People make mistakes.  People sometimes handle things badly.  What your parents did, they did out of love.  You chose a career that was outside their realm of knowledge and they were scared for you and your future.  They tried to manipulate you into leaving that and going back to something they understood as a secure future.  \n\nThey were wrong. Very wrong.  Your parents have learned a very valuable lesson.  I hope you will give them a second chance.",
            "I think you should meet with her if that is what you want to do. However, I would emphasize that your reconciliation with your father should be its own conversation, and you should not let him get away with letting your mom smooth things over and the one to swallow her pride. If he wants a relationship with you, he also needs to own up to his actions.",
            ">  my dad is too proud of a man to say that he wants me back in his life\n\nSounds like too \"proud\" of a man to be any kind of positive addition to yours.",
            "So I would not reconcile until your dad also apologises for kicking you out it doesn't mean anything if your mum is the only one apologising your dad needs to do it aswell as he was also present and actively taking part in kicking you out and treating you like you do not exist.",
            "Fuck them. They don't get to be a part of your life because your career doesn't embarrass them now. People like that are toxic and your life is better without them. I know this all happened once you're an adult but from a parents perspective (theirs not mine) they truly abandoned their child. Not \"okay you try this out and have engineering to fall back on\" just \"you're a piece of shit and I won't even have the decency to talk to you in public that's how much you have shattered my ideal of what you are\" these are shitty people and if it was anyone else in your life you'd tell them to fuck off.",
            "I don’t have a ton to add but reconciliation without justice isn’t really reconciliation. An apology without change is manipulation. I don’t know what justice looks like to you but your parents did you a great injustice in the way they treated you. So keep that in mind if you approach any sort of re-establishment of relationship with them.",
            "I'm certainly no expert on African families but I worked with many African immigrants (most Nigerian Kenyan Sierra Leone).  To a person they were loving and protective of their kids but also had quite high expectations of them.  I can see a few of my former collegues kicking out their kid for not meeting expectations but not many.  OP I think those high expectations are a big reason why you're at the point you're at.  No you didn't wind up being an engineer but because of your parents you did go to college and find your passion.  Now your parents are realizing their mistake.  You should do what you want to do as far as reconciling (just like you did what you wanted with your life and career).  Personally if they're big enough to apologize I would meet with them.  They sound like they're ready to accept you as an adult and not look at you only as their kid that didn't meet their expectations.  I wish you luck whatever you decide.  Plllease give us a follow up if you feel like it.",
            "If you are blessed with immigrant parents you already know the story: \"we didn't bust our ass to come here and work like dogs, for YOU to waste your time and *our* money on some silly hobby. You're going to be a PROFESSIONAL and make real money!\" In their shoes, it's real easy to understand their rationale. Here you have the opportunities they never did, and you are \"squandering\" them on silly pursuits and Hollywood dreams. That the American Dream very specifically includes \"the pursuit of happiness\", well that can wait until after you have a career and a big house for them to visit.\n\nKeep in mind even if your career takes off and you GET the big house for them to visit, it still won't be a \"real job\" like your siblings have. The Oscar on your mantle *might* change their minds, but it's just a statue and it's not even real gold, is it?",
            "Meet her if it gives you peace, but ask yourself (and her) why she feels like it was ok to pretend you don't exist as a response to your decision. Are they only interested in a child they can control? Your parents don't need you to forgive them for how they feel, but they should absolutely apologize for the way they behaved. They're simply isn't any kind of excuse for that. They made their decision and they have to live with it, I wouldn't bother speaking to your dad until he actually apologizes because in his mind he hasn't done anything wrong.",
            "I would consider having this meeting with a therapist. This is very sensitive ground on both sides and a professional would help to navigate. Best of luck either way! Congrats on engagement!",
            "I think regardless of the outcome (and be prepared for it to be negative or positive) you should go meet them, otherwise you might regret it in the future. Not to be morbid, if they died tomorrow would you regret not talking to them one more time?",
            "Everyone makes mistakes. They may have hurt and abandoned you at that point but they took care of you for years and years before it. Definitely give them a chance. They are imperfect people but they're you're only parents and they are trying, however clumsily to make up. Your connection or lack of one with them will impact your relationship to your other relatives, your own future kids and your ancestors. As you age and they age you will not regret reconciling with them.",
            "I’d give it a couple more years frankly",
            "Ppl make mistakes and parents are no different. If they apologise then good. If they don't but u can see they want you back.  Also good. If they have the same mentality then I'm sorry. Either way there is a lot to gain and nothing to Lose. Go meet them and best of luck.",
            "I too would be inclined to see what they have to say. \n\nMy dad is also a proud man, and he doesn't always talk about things or express everything even when he wants to do so. Sometimes it takes him a little extra time to be able to verbalize his thoughts and feelings, but I've always personally felt that that trait makes the things he does express mean more. That being said, maybe your dad will have something to say if you meet up with your parents. \n\nMy dad has softened as he's gotten older (my parents are currently in their 50s), and his outlook on many things has changed as a result. He isn't necessarily any more communicative, but he shows more in his actions than he did when I was a kid. Perhaps your parents have softened as time has gone by, and they've realized they want to be in your life in the future, especially since you're getting married. \n\nI agree with the other posters in that the worst case scenario is that you end up in the situation you were already in, and you already know how to handle that. Best case scenario is you're able to have your parents in your life again. I don't personally think you have anything to lose in seeing them again. \n\nRegardless of what happens, I'm really proud of you for going after the career that felt right to you, even in spite of not having the approval of everyone around you. It's really hard to lose any of your support system, and it sounds like you dealt with it beautifully. What you've accomplished is amazing, and you should be incredibly proud of yourself, regardless of how your parents ultimately feel about your cinematography. \n\nCongratulations, on your career and in your starting a family of your own with your partner!",
            "I'm going to throw this out there, but maybe the sudden passing of Kobe Bryant had something to do with them wanting to reconcile and make peace with their son. Here you have a world famous basketball player with 4 lovely daughters and a beautiful and supportive wife, money and fame, and a passion to do more with his life after basketball. Even with the fame, money, and the accolades, death doesn't wait and comes for him at the young age of 41. Cut to Shaq crying his eyes out, coach Doc Rivers before a game barely able to compose himself as he speaks to the media and breaking down, and grown 7 footers crying on the basketball court when they first heard of the news. Multiple NBA players saying to make peace with your loved ones, because 1 day they are here and in an instant they are not. Just, just maybe, Kobe's passing made them realize, death comes for everyone young and old.",
            "Coming from someone who had a crappy childhood, mom died of OD a little over 10 years ago but we had a terrible relationship when she was alive, and dad abandoned his relationships with us when they split when I was 8 and I haven’t been able to carve out a good relationship with him since, and all I crave and can’t have is good family relationships... take the steps to rebuild. It sounds like they’ve realized their mistakes and have regrets and their hearts are in the right place. \nI’m a parent now to a 19 year old and a 14 year old who are both steadily wandering down an artful path. There’s part of me that’s fully supportive and yeah go get it! And there’s that parental logical side of me that’s like, yeah.. maybe make that a hobby until you can make money with it but until then, what will you do for money? It is so hard. I’ll never kick them out for such things, but I can see that side and where they came from and the fact that they are reaching out really shows they understand they messed up and that is huge and totally worth accepting. Rebuild and enjoy your family!! :)",
            "I do hope you choose to see her. I think it would be foolish not to see her. Especially if she is saying she is repentant. I'm not discounting how painful the event might have been for you but to just remember to error is human. And that we learn from our errors.",
            "Aw man, I have west african parents too. I understand how tough it is (and I think people from asian cultures can agree too), where what the parents want is the end all be all. Congratulations on following your passion and succeeding at it.  In the end it all leads down to you.\n\nWe grew up with our culture really valuing family and personally I think I would slowly let them back into my life, but don’t allow them to insult you slyly",
            "Bro just because they're your parents doesn't mean they get to be assholes. This isn't West Africa, \"disobeying\" your parents got you where you are at. You can thank them for giving you that grit to see it through. You should make a list or even write a letter about how it made you feel when you got kicked out. The meeting could be the beginning of something restorative between your and the rents.",
            "Approach the conversation knowing that you don't have to prove anything with your words, as your actions have proved them wrong on multiple occasions. Maybe approach the conversation in a way that highlights (without blaming which is very hard) the negative emotion you had with their lack of support for something you care so much about.",
            "Would you kick your kid out for not conforming to your wishes? How controling is that? Do you believe people like that can change? It might happen... But I don't think that's the case here.\n\nThey know they cannot control you, and they know they've lost the war. What do they hope to gain from getting close to you? Maybe they dread having to tell their friends they weren't invited to your wedding. Maybe they want to show off any potential children you may have, and even try to control them, too. Either way, they won't show any respect for you, because you are still a child in their eyes.\n\nI would check in just to see what is going on, but if they disrespect you or your fiancee in any way, just get up and leave. You are not under their control anymore, you control the situation.",
            "Just because someone is blood does not mean they have the right to be in your life.\n\nDo what feels right and best for you. Also, be absolutely honest with your mother.",
            "I do hope you can find it in your heart to forgive your parents. Congratulations on your success!",
            " I feel you should meet when your mom, yes everything they did was horrible and unfair andaybe u can't forgive then yet, what really matters here is that u value them, yes your relationship doesn't have to be the same as it was before but it could sort of start here and see what happens next.\nI think what's important to note here is that your mother regrets what she did, regret is a good negative emotion, whereas guilt is a bad negative emotion which I hear that maybe one day you might feel guilty about if u don't meet then now, that being said if u army ready to meet your mom don't otherwise meet and talk and see what happens.\nAll  the best.",
            "I'd rub it in my mom's face about how well I was doing and tell her how much it hurt me when she ignored me at the wedding. She may say excuses most likely but I wouldn't listen. And that's it. They were cold to you why should you be warm?",
            "God, I don’t have much advice but I’m so sorry. I can’t imagine seeing my parents at a WEDDING and having them ignore me.. you didn’t deserve that.",
            "Be open to it. Parents are human. Sometimes they only know one way. Like humans they also learn. Life is way too short just ro keep hurt",
            "People are complicated and parents are no exception. In the end,no one can tell you what to do because this situation depends on what you want.\n\nI had a very confusing,tough childhood and really resented my parents for the longest time... It took being away from them a while,working on myself,going to therapy,and us all willing to work on our relationship. \n\nIn the end,it will only work out if you all hash out your issues,resentments,and other negativity. Otherwise it'll just fester and will only make you all upset again. The most important thing is to not force a relationship or to make things happen faster. \n\nI really do wish you luck since family is always so complicated.",
            "I always say that falling out is easy, it's the falling back in that's the tricky part.\n\nThey're your parents and yet they are fallible. Ultimately, they wanted what they believed was best for you. Kicking you out and not talking to you was not what was best for you. The difference between the two is their belief system. Hopefully that worked out well for you in lots of other ways, over the years.",
            "Tell them to read East of Eden.",
            "I can tell you from experience it was hard for your mom to send you that message.  Her love for you was at war with her pride, and her love won.\n\nTake things slowly.  Don't try to assume the same frequency of communications you once had.  Make it a short meeting, maybe no longer than half an hour, and if things go well (meaning you can get through a half hour without yelling at each other) end with an agreement to get together for a second meeting.",
            "Your parents have made a big mistake. Choosing to have no son for so many years. I believe you can choose to have a better relationship with your parents. Life is very short. When you have the opportunity to connect- do it.",
            "Life is too short, try to make amends but by no means do you let them try to control any aspect of your life. Good Luck and congrats🎊",
            "Where does she want to meet?  If you can, go to a neutral site in a public place like say a restaurant.\n\nAnd don't go alone.",
            "If you’re leaning towards wanting to meet up to investigate whether you think they would be a healthy addition to your life, you should do it, albeit cautiously. My main piece of advice would be not to divulge very much information about finances- I’m not saying that your folks would try to take advantage, but I’ve been in similar situations where people that discouraged a particular career path were much friendlier and more interested in reestablishing relationships when they figured out that the person was now comfortable financially, or that the field was more lucrative than they had initially thought",
            "I think it would be good to meet up with her. It might help heal some wounds of yours and you might get some closure too",
            "Hey, congrats on everything you've accomplished!\n\nI just want to tell you something from my past that might help in this situation. \n\nI am gay and I kept that hidden from my parents for a long time. I knew they wouldn't agree with it and that it would be a really shitty experience for everyone.  over time I harbored resentment towards them that I couldn't be who I am around them.\n\n One day, I was talking to my dad and he said something homophobic. I honestly dont remember what exactly he said, but that was the last straw for me. I just told him that I was gay and that if he couldn't respect me for who I was then I wouldn't be able to find ot in myself to respect him. \n\nAnd if you knew my dad, he is a man of honor who always tries to conduct himself in a way that aligns with his own morals and ethics (even if I dont agree with them) and so this was a brutal stab back at him. \n\nThis is one of the biggest regrets of my life. \n\nI wish I could have shown him kindness and respect. Finding out your son is gay as a devout catholic father is not an easy transition and instead of handling that situation with care and courtesy, I lashed out. I basically told him the same thing that I had heard from the church my entire life: if you dont do x, then I dont love you. I wish I had been strong enough to go into that situation with love and understanding of my dads situation. \n\nI'm not saying my dad was right and I was wrong. I think we were both in the wrong, but I just wish I handled that better and I would like to encourage you to take whatever time you need to make sure you fully understand your emotions before going into the situation. Maybe talk to a therapist beforehand. A lot of people are saying to go and hear what your mom has to say, but I think this situation requires a little more planning and preparation than that. \n\nWhat would the relationship be like between you and your parents after this? If they apologize? If they dont apologize?\n\nDo you want a relationship with them?\n\nWhat kind of people are they?\n\nDo you want them in your future kids' lives? \n\nSince then my relationship with both my parents have gotten much stronger. I dont really talk about my sexuality with my dad, but he knows it and knows there is nothing he can do to change. I would like him to become more comfortable with it eventually, but he has shown his support and love for me in countless other ways. So maybe you wont get the verbal apology from your dad that you want, but maybe he'll offer to come help fix your house or car, or however your father shows love. \n\nHope this all works out and everyone ends up in a happier place.",
            "Hey man, i will tell you in creative professions you have to self motivate way more than beaten path to become great. So this has been very very hard for you, but it forced you to take your decision seriously and in the long run I hope this gave your career a real kick in the ass to go be amazing :)  \n\n\nAs for parents, its hard. You grieved. You were angry. But also our time with them is limited. My only advice is do what you will regret the least, looking back.  \n\n\nThat may include giving them a piece of your mind.  \n\n\nAlso, a couple joint sessions with a therapist as a mediator is quite useful in these situations. Sometime you need to tell someone something but cant say it to their face.",
            "Considering everything you've been told, meet your folks. Our (African) parents are a proud lot. They only know what they've been exposed to, that medicine, engineering etc are the best careers. They don't know better. \nFrom all indications, the only thing you ever disagreed on was the career choice. Yes, there's anger, feelings of betrayal and neglect. \nBut you're already halfway through saying you want to meet her. That you hope you guys can talk it through and process all the negative emotions. \nYou're already way better than many of us who would not be willing to meet a parent because of the anger and grudge we hold towards them. \n\nAnd I'm pretty sure they now want to see their grandkids. African parents 😏 smfh. So, that's something to look forward to since you are getting married. \n\n\nAll the best.",
            "I'm not sure I would even be willing to meet them.  Tossing you out on the street and then trying to welcome you back with open arms after you went through all the trials and came out as a success. That's infuriating to me. Actually the whole story is. When I told my parents I wanted to be a musician, they paid for my lessons and for my music degree, and when I wanted to go back to school for audio engineering they took money out of their retirement fund so I could afford tuition and equipment. Half the reason I work so hard to succeed is to prove them right, much like you worked so hard to prove them wrong. The idea of what my life would have looked like if I hadnt had that support...I have no clue where I would be right now. Sincere congratulations on everything you've accomplished.",
            "Hi OP, here’s a perspective from someone who went through nearly exactly the same thing. My mom kicked me out of the house directly after college. I struggled so hard. Just like you, I luckily had family to take me in for a year. We both made it through that difficult time! We made our careers while financially struggling without a home to go to. I met with my mom years later and I’m so happy I did. We were able to build a relationship again and I feel like I have my mom back. She admitted to really messing up and living with the regret. I appreciated that and forgave her. I think your instinct is right... meet up with her. It’s a good first step. And don’t feel bad if it takes time to forgive! That’s only natural. Good luck OP! I hope your family is able to heal and move on from this.",
            "I have a very rocky relationship with my mother. It's never really been great since she struggled with addiction and in the process me and my sister ended around horrible people. As you can guess I have a really hard time forgiving her. It took years for her to finally become a decent person and apologize. And just like you are now, I'm on the fence of meeting her and giving her a chance to show shes changed. \n\nMy advice would be to meet her. Give her the chance. We only get one set of biological parents and I think it a shame to not at least try to create a bond with them in some way because one day you'll never have the chance. Plus, at least then you can look back and said you tried.",
            "I'll be frank, Often I when I see drama like this it's usually I put don't go see them, but in this case I would go with a take it slow with seeing your mother and hear what she has to say and after she has finished tell her what you have to say and don't hold back the truth of what you feel even if it hurts her feelings because a lot of times putting your foot down and hearing people saying family is family always brings conflict when you choose what you like to do over what your parents want. As for your father it's honestly after reading this it's not worth with him so just do what you love and appreciate what your brother has done over what your siblings did not and continue to see the big picture.",
            "Lots of very good advice here. The thing that sticks out for me is that they don't understand the value of cinematography. It's just as important for society as any other profession. The arts are so so so important. The ability to convey a message and tell a meaningful story in an impactful was is not something to be dismissed just because it's not financially secure.\n\nIf they continue to push back, be armed with examples of african and/or immigrant filmmakers and their work, much of which is impactful and powerful. Show them that your unique perspective is necessary in being able to tell stories that will last generations. That we desperately NEED more people from diverse backgrounds telling stories and reaching people.",
            "Sounds like a movie script you should write in detail.",
            "Do you want them in your life?  Maybe not now, but sometime down the road maybe?  Turn the other cheek and reconcile.  You can always dump them if it turns toxic again.",
            "I have a similar story so i can, in a sense, relate. The brief version: i was raised in a cult, and leaving means severed contact from literally everyone i knew, including family. I've been no contact for several years, and my parents reached out to try to establish some contact again recently. \n\nI've decided to take things slow. I love my parents and would like to enjoy a relationship with them. Many of the things i love about me, i owe to them. At the same time, the generational and ideological divide is real. I dont expect our long distance overtures are going to bridge that gap. It will take work and effort from both parties. Right now, the desire to connect is flickering, we will see if it grows and if my family is willing to do the work and if i am willing to do the work to build that bridge.\n\nI've had a couple conversations with my mom, and i'm going to see what happens moving forward, but keeping my expectations low, and managing the expectations of my parents has been wise. \n\nIn my case, my mom still is very much in her narratives about the world and i dont really hold hope she will ever see me as \"acceptable\" really, but its something. If nothing else, i know their narratives arent able to erase their familial connection, and that is validating. It helps. \n\nMy advice, such as it is: keep your expectations low. Dont focus on your feelings when you meet, you'll be in a better place to deal with them later. While together, show curiosity about her life and you family. If nothing else it will show them you still care. You've got a right to feel guarded and  you dont need to feel forced by them. Dont accept their attempts at leverage, but recognize they're coming from a place of compassion. When they see that you understand them, and love them but are not controlled by them, and will be an individual adult human being, just like they are, you will enter a new chapter in that relationship. I'm curious what yours may look like. Parents transitioning to peers takes time.",
            "Congratulations on your achievements! It's not easy to make a living in the arts, so I'm incredibly proud for you generating your own success.\n\nTread slowly with your parents. You don't have to visit them and immediately rush to a reconciliation. You can have a very short and very formal meeting for the first visit, see how you feel, then plan your next move. Life is long, and the decision you make tomorrow might not reflect how you feel in another decade. So just tread slowly.\n\n(For your own piece of mind, watch the Community episode \"Introduction to Film\", season 1, episode 3. Abed's story is very similar to yours - he wants to be a filmmaker against a lot of opposition from his immigrant father. The story wraps up very neatly in 20 min, which is certainly not the case for you, but seeing Abed facing against a similar struggle to you, and seeing him succeed, might make you feel a little less alone.)",
            "There is a saying, Would you rather be right or happy?",
            "Your parents are assholes",
            "Idk man, they're reaching you because of what you accomplished or because they realized they were wrong? Thing might still the same if you hadn't achieved things.\n\nIce cold bby, meet them or only her and listen what they have to say. Don't act like a puppy begging for their love.\n\nAnd for your brother, give him a beer. He's the best.",
            "[deleted]",
            "I'd reconcile.  What you're describing is pretty common among immigrant families from Asia and Africa.  Your dad is stubborn and prideful but you don't have to be.  Everything can be as it was if you're willing to take your parents as they are, warts and all.  I'm not saying don't express your anger, disappointment, and other feelings to them if things come up, just be ready and willing to accept that they see the world with a different lens than you.",
            "I think you should go meet her. After all, the time you were away hurt you and had its toll on them as well. They surely missed you, wanted to know what you are doing and were asking your siblings about you. They were just too proud to be the ones apologizing. They thought they are recommending what is best for you depending on their lofe experience and wanted to know that you will be ok and in their head the formula of stability has being a dr or engineer in it, so they didnt wa t to harm you. Meet with her and have an open heart, try to not dwell on what had happened and focus on the future. Having your parents in your life is surely a good thing.",
            "*It didn't go down well with the rents. We had a big argument and they kicked me out. They told me I was wasting my time with filmmaking and that it would leave me penniless and on the streets.*\n\nDifferent people value different things. your parents value financial security over \"fulfillment of dreams\".\n\nThis is about what they wanted for you. The path you chose looked like a dead end to them, nothing more heartbreaking to a parent than to see your child throw-away a sure fire path to what they think will set you up for a life of happiness to pursue a path of difficulty.\n\nNot speaking to you is just hoping tough love will work.\n\nYou might have a kid someday you will understand almost instantly aftr that.\n\ntalk to them say they hurt u and u hurt them- but that this is an issue of different values",
            "I'm also an artist who came from a family of scientists and I sympathize with your situation. I'm very sorry that they acted this way and I agree with all other posters about how cruel it was and that they need to make a real effort to get back into your life now.\n\nHowever, there's one thing I see nobody mention. Forgive me if I missed something in your post but do I understand correctly that you finished the studies for a profession you didn't want and never once mentioned to them during that time that you want to take a different path? Now, I understand why you'd do that, from your perspective it makes sense to play it safe. But have you considered this might have hurt them? And I want to be clear here, I don't mean this excuses their behaviour but I can understand them being upset since they probably put some money into it (if west means USA it must have been a lot) and you threw it all away last minute. They didn't believe in you but you didn't trust them either. Might be something to consider.\n\nAnd congratulations on successfully doing what you love! It's a great achievement.",
            "I believe that their fear of you not doing well drove them to it..im sure their upbringing was not priveliged..compassion and understanding are in order. I notice many here have that American cultural reaction of suspicion and jadedness...in America it seems all about individualism...they want you to do well. Approach with compassion and love...and forgiveness...you will feel better for it...so will they....",
            "I hope you understand that I make this comment without hostility or undue prejudice.\n\nIt is American modern culture to disown our family if we feel disrespected beyond what we deem reasonable. Block and go no contact. \n\nLook, I've known a few Nigerians and actually a Kenyan too, all first generation, and my God their parents broke their backs doing all they could do to provide a better life for their children. It blew my naive American mind to learn about it.\n\nThis is a key cultural difference. To your parents, due to their enculturation, your decision was the ultimate betrayal of their lifelong sacrifice.\n\nMan... they had no other choice than to behave how they did. Just like you had no choice but to follow your passion, their reaction to your choice was birthed during the first shift of the first job each of your parents took on to make a better life. Years of emotions contributed to them disowning you.\n\nThey were wrong, no doubt. But dude, the question is not can you forgive your parents. The question is can you forgive the culture that made them the way they are.\n\nWell, can you? You know the answer, and frankly I think you owe it to yourself to attempt to reconnect (it is clear from the deeply mature and thoughtful tone of your post that your curiosity must be sated).\n\nPatience and luck to you.",
            "What do you want? Let that be your guide. If you want a relationship again, go for it. If you aren’t ready, that’s okay too. Either way though, you have to forgive everyone. That will fester and ruin you. Everyone acted out of love, they just did it extremely ineffectively and in a harmful way. \n\nI’m sorry you are in this situation and wish the best for you.",
            "Your parents are a victims of their cultural upbringing and expectations of american dream.",
            "I would suggest meet up with your mum and talk to her so then maybe it will make you feel better and hopefully it will take the anger away with a better understanding.\n\nI understand that parents who have migrated from overseas always want the best for their kids but they don’t always go about it in the best way. I would say there wasn’t a day they didn’t regret kicking you out.\n\nI don’t know about your parents but mine are also immigrants. It wasn’t until recently I came to understand how hard it was for them to get us to this point.\n\nAnyway, that’s my opinion as I see it, family is important and you don’t want to leave anything until it’s too late. ie, God forbids, what if the last thing you spoke to them was when you got kicked out ? I’m sure that might not be the sort of memory you want to have.\n\nTake this as an opportunity, see how it goes, like some of the comments say, sus it out as you’re in the driver seat. Also your brother is a freaking G.\n\nAll the best my dude.",
            "Meet your parents.  I had something similar but different happen to me. My Dad has been gone for 10 years now.  I never regret reconciling with them.  Today to see my mom with my kids, it's magic.  If there were a bridge before you, allow these past issues to flow under it.  Trust me.",
            "Never regret what you have done in life, only regret the things you haven't done.\nTalk to her and tell her you love her.\nThere's a lot of things I wish I would have said to my mom and now I can't.",
            "I'm in a similar situation, because I didn't become what my parents wanted. they have yet to talk to me though. I know they have hurt you, but at the end of the day they are your parents. At least hear them out. Then decide from there. Sorry you had to to go through this. I know the pain of being the black sheep of the family. Any benefit though from the experience however, I will be better for my children and will accept what they want to do, so long as it makes them happy. My mother is Korean. I think sometimes the cultural difference causes different expectations. My mother kicked me out originally because she found out I had a tattoo- which was usually associated with criminals in korea back then. In the US it is fairly common. Good luck to you ❤",
            "It well cost you nothing but your time to listen.\nThe worst case is, you go and decide nothing has changed and to remain where you are now.",
            "I think a lot of people might say don't go, but I really think you should. Family drama happens, and it's not cool that they kicked you out. However they probably sacrificed a lot to move to America so their kids could have a better life. I think in the end they just didn't want you to end up like them, and to be fair film making is not super stable. At least go talk to her and see what she has to say.",
            "I’m not going to read the comments but you should forgive your parents for the really bad parental choices they made. Trust may take awhile but being in their lives again would be good for all.",
            "While its certainly easy to hold your parents to a higher standard and expect the best to them, we have to remember that they are still human and therefore, will make mistakes in their lives. They also grew up in a different time and place from you so their values are vastly different.  I would absolutely encourage you to go see your mom and give her a chance to apologize.  You never know how long they have and you dont want to miss the chance.\n\n I lost my father when I was 29 and it was very quick. He was a normal, healthy person and then cancer hit and 14 weeks later he was gone. In his final days, he was in a tremendous amount of pain and refusing pain killers which lead to him lashing out at me. There were days I left furious. The last day, he had been mean and instead of getting mad, I told him I loved him and kissed his bald head. I'm thankful it ended on a good note.",
            "Congratulations on the choices you made. You stuck to it, and because of your perseverance, dedication, talent and grit, you are now a successful and financially independent cinematographer. Well done mate. As for your situation, I would go and meet my mom and dad. They had their concerns but you have proven them wrong. Be the bigger man and reconcile with them. Life is too short my friend. And we do not what's around the corner so to speak. One day our parents are still here, then the next time, they're gone. Build that \"bridge\" and start making memories (and videos) with and of your parents and family. Goodluck.",
            "This is a hard one but I'm gonna go with a good old classic. They are gonna die one day better make the best of it now. All the emotions you mentioned are things you will have to work on at some point (cuz that shit tears at  you). Sounds like you have an opportunity to work on it now but with one of your parents. I'm not saying that everything is fine now that she is trying to reconnect but you taking a long, hard look at your feelings and disappointment could allow you to put it to bed. Talking with or to your mother could help getting some kind of closure. \nIf you do it, do it for you",
            "Are you (kind of) me? \n\nMy elder sis is a doctor, younger is an Engineer and I am (kind of) a lawyer. We’re AFRICAN as well. When I chose to not practice law my dad went batshit crazy for a while. And I was blackmailed into going to grad school law ... or else; they would have kicked me out. I was staying with them at the time.\n\nI then moved in with my then boyfriend but still felt the pressure from a distance. I caved in. \n\nAnd I promised myself that was the last time I would do something I had been forced into.\n\nNow, I started my own startup in the tech space. They don’t understand what the hell I do. But then started becoming supportive when I landed gigs in London, Nairobi, Berlin, etc. They just wanted to know that I wasn’t gonna throw my life and brilliance away. That I knew what I was doing and was going to be just fine. It was fear more than anything. Me being okay made them relax. \n\nI didn’t like them for a long time. But I still loved them. I went into depression and desperation. But I still loved them. I wouldn’t have survived it without my now boyfriend who supports me emotionally and $$ when I’m down (startup life)\n\nFor a lot of us Africans, ‘fancy’ careers are more for your parents than for you. They wanted what they thought was best for you. And we know how the pride thing goes esp with Nigerian dads (and Kenyans too!)\n\nBe gracious. They love you, even if they weren’t too good at it. If you can forgive, please do. Go get your family back. You mum probably misses the hell out of you.",
            "I know it is kind of cheesy but when my grandma died, my mom (her daughter) told me that the only regret she had was to not enjoy my grandma enough. I always think of that when there is a big fight with my parents/siblings/family in general.\nI think you should consider that and meet her. Despite everything, they are still your mom and dad ans just wants what is best for you.",
            "That really sucks, being essentially disowned for being a creative is so heartbreaking. On the plus side, if you decide to film yourself flipping the bird in their general direction, it'll probably look stunning.",
            "I agree with you, I would see her. People do stupid shit sometimes, overstep boundaries, act like utter assholes...but they did it because they have tons of cultural pressure and expectations and wanted “what they thought was best” for you. We have to let people change if we want change. You don’t even have to think about what comes after that now. \n\nAnd you have all the power in the situation. Remember that when you feel nervous. Let us know what happens.",
            "The fact your parents reached out says alot. I say you hear them out and try not to be too bitter. Also try to understand parents just want what is best for their kids and some parents are more controlling than others and when you are under their roof only can see their method as the best. But it sounds like you forged a path and made something when they were not exactly the most supportive. Try not to hold that against them and be open to the idea of slowly reconciliation.",
            "OP, please remember the fear that your parents live with. They made a huge huge sacrifice leaving their home particularly so that you could get better opportunities. They don't know of careers outside of typical \"successful\" careers; I bet they would have been upset if you studied sociology. So for them, it is almost like you threw away a diamond. I understand that you do have a real job but they don't. Keep this in mind when you do talk with them.",
            "The brother that took you in got lucky and loved being a lawyer I bet and he sees the value in doing something you love. Other two siblings probably don't care much for their jobs and unconsciously don't believe that jobs can be something you like. \n\nI don't have any solution for you but I feel like what you're feeling will guide you best in this situation. If you want your parent back in your life go for it. If you hold too much of a grudge keep them at a distance like they did you. \n\nI'd personally want to reconnect, to a point. Holding a grudge would only make me feel worse when I could just let it go.",
            "Yes, yes, yes, absolutely meet with your mother. She is still your mother, and the only one you will ever have. You do not want to grow old with bitterness in your family.\n\nYes, you have every right to be hurt by what they did. You have every right to be hurt by the continued attitude of your parents and two of your siblings. Yes, you have the right to your own happiness. And yes, the best revenge is a life well lived.\n\nIn a perfect world with perfect people this should not happen. The facts are, that this is not a perfect world, and there are no perfect people. Your parents made a huge mistake, however, based on their culture, that is what they knew about how to act. It doesn't make it right, but it does explain their actions.\n\nMeet with your Mother, listen to what she has to say, and if at all possible, forgive her for what she has done. This would be a huge step to repairing the damage to your family, that they caused. You are on the path to a good career, you are getting married soon. Reuniting with your family, will be a blessing for the future of all of you. \n\nIf you have children, they will be blessed, if they have loving grandparents and loving Aunts and Uncles. \n\nYou have nothing to lose by meeting with your Mother, and everything to gain.",
            "Another redditor above was very harsh. He wrote ,\" don' t let your mum be' the mouthpiece of your father\".\nI live in a culture where women are expected to take care of emotional needs of their families, to not mention the daily cores.  So, when you look at our role in the family, you can never tell if we are hostages or the masters of our homes. If you think she is used by your father this is a very wrong way to restart your relationship. It is a clear he don t want to discuss his past decisions. I think you have in any way to meet your mum. We makes big mistakes but we can learn from them.",
            "I understand it's a pain but honestly just be proud, wear the axcomplishment on your sleeve but don't rub it in, that is your ego talking, instead reconnect with your family, watch them change their minds and grow as people as they realize how happy you are doing what you are doing, if they don't grow from it then don't keep in contact with them.\nTrust me when I say that I know what you feel but rubbing it in their face or continuing to resent them will only cause you further pain, embrace and be open to them and your relationship will be stronger than ever. Good luck :)",
            "Forgive them why miss out on your inheritance.",
            "Meet with her. If she’s ready to apologize, accept it gracefully. Catch up. Let her know your happy to forgive your father, too, if he’s able to bring himself to ask. Family is too important to let it slip away over pride. \n\nAnd honestly, you shouldn’t be al that smug. You wouldn’t have made it anyway if your brother hadn’t subsidized you for a significant amount of time. You owe a big piece of your current success to him. Reconciling with his mom and dad is one way you can pay some of that back.",
            "Forgive. No matter what happens, they're still your parents. I just hope you'll be able to do it before they die because some live with this regret and I'll pray it won't happen to you.\n\nCongratulations on your beginning of your career. It's not easy but you seem to make things work.",
            "One thing about African parents like yours is they genuinely believe that your career was a reckless choice guaranteed to give you a bad life. They probably took it as a personal insult that they immigrated to give you a better life just for you to actively pursue a worse life.\n\nNow they have to admit they are wrong, which is very hard for African parents to do since their parents almost never did this for them. So they put off the conversation in order to work up the humility to do so. Now 1 is ready. I'm not saying they're wrong I'm just saying they're normal and hoping you approach this understanding their perspective.",
            "You only have one set of parents. You don’t have to get along, but don’t forget each other too. Otherwise you may regret it later in life.",
            "You should accept the apology from then but don't give up your dreams. Those expectations of engineering for you are their expectations. Not yours. I recently went through that breakthrough. Life is really short dude. Do what you want. Go places you want to go and do things you want to do. Money doesn't actually matter very much. You don't have a connection to every dollar you make, and your actions don't reflect on anyone but yourself. Live the life that you want to live and only that life. We all get one life. Live the one that you want to. If they can't accept that, then it's their issue and not yours. It sounds like you're very passionate about filmmaking and you'd be dumb not to follow that. Even if you fail, you probably did a lot of really cool stuff along the way. As well as meeting some really cool people who will impact you for the rest of your life. If you spend your whole life trying to be as successful as other people, you're going to fail. But the conversations and experiences you have along the way are really the part of life that's even worth living in the first place.",
            "Congrats man! Nothing better than proving yourself in a difficult, competitive field. \n\nThis is an age-old tale - parents spend 18 years busting their ass to ensure you have a better life than they did, you decide to forgo their advice and live your life how you want to live it (good on you!) and they react by any means necessary to keep you \"safe and happy\" (their definition of course). \n\nUltimately, it's a shitty way to parent, but it's also coming from a place of love, as twisted as it is. The good news is that you've got some leverage here. At the very least, they need to accept it's your life to live, and while they are entitled to their opinion, you really don't give a shit. If this is just some scheme to make you feel like the bad child who spurns his parents, I would be back on the no contact plan",
            "Filmmaking isn't a wise career choice *generally speaking* and I understand where your parents are coming from, having left a third world country to offer you a better life here. You may not understand them now, but when you forgo your own enjoyment in this harsh ride called \"life under capitalism\" and save every dime for your kids college and only operate with what your culture and experience tells you, and you see your kids blowing your money on something your life experience has told you may not work well, you'll understand them. They aren't perfect. They didn't know you'd be the outlier that lives well in this career. Good for you for succeeding. But they were understandably upset. Go in ready to forgive. You'll make similar mistakes with your own children, and would want their forgiveness as well.",
            "I think this sub is very, very quick to jump to “cut these people out of your life forever! They were wrong!” And your parents were wrong. But it’s OK to talk to your mom and open up the possibility of them someday finding a way to make it up to you. It’s ok to want to forgive your parents and to still love them even after they do bad things. \n\nIt’s extra-tricky for immigrant parents who have such high educational/career wishes for their children to reckon with the idea of a creative. You chose your path and you’ve made a life of it - congratulations. Seriously. You have nothing to prove to them. But it’s OK to give them a chance to admit they were wrong (and only rub it in their faces just a tiiiiny little bit).",
            "I really need more information for perspective please.  I just feel that your story about your parents lacks some perspective.\n\n1.  You say you are 26 and a few years ago, you were kicked out.  Now a few years could be 2-4 years, meaning they kicked you out when you were 22-24 years old.  How old were you when they kicked you out?\n\n2.  Did they give you notice?  Were you kicked out immediately, or did they give you a timeframe?  This makes a big difference.\n\n3.  Did they financially support your education?  Did you complete your degree?  Do you have any student loans or do they have any loans for money they borrowed for your education.  If they spent several thousand or tens of thousands of dollars on your education and you did not complete it, that is very relevant.\n\n4.  How are you REALLY doing financially?  Do you have your own place, own car, and an emergency fund.  How much debt do you have? i.e. student loans, credit cars, car loans.\n\nI just don't want to make a judgement or give advice until I have a balanced perspective.",
            "Ignore the smugness. Your pride will only be your downfall. As for the anger. You may still be angry but there time on earth is running out. You really dont want regrets like missing out on memories with them. They will eat you up.",
            "You're only 26, you gotta let the anger and resentment go.  You already won by showing them you were right you will be just fine if you forgive.  In a culture such as the one your parents are from where it is the norm to disown over career choices, then it is a huge deal for your mom to reach out like that.  Everyone makes mistakes and she is trying to amend for hers I think she deserves at least a meeting.  If she tries to make you feel bad for your choices then bounce the fuck out but at least see what she has to say.",
            "Just let it be, see your family and accept Mom’s apology. Its worth getting to have that time than to regret it later. Trust me.",
            "I think you should give her a chance. I’m sure they’ve both been holding back guilt since that happened. I can only imagine they have suffered enough as Is. I’m sure it’s been hard for you, but that just shows the effort you can put in for yourself. You didn’t need them to be successful. So be your own man if they question your profession. You’re a grown ass man that has proven he can be what he wants. You seem confident, so show your mom who you are and don’t hold anything back. Show her why they should be proud of what you’ve become! Best of luck, I hope you give them a chance!",
            "Kiss and make up. Your parents are in their twilight years and you will highly regret it if one them passes without having reconciled over something so trivial.",
            "[removed]"
        ]
    },
    {
        "post_id": "48hn2k",
        "author": "Protegeus",
        "title": "[UPDATE] Me [19 M]. My grandfather [84 M] has passed away and asked me to play Taps at his funeral.",
        "url": "https://www.reddit.com/r/relationships/comments/48hn2k/update_me_19_m_my_grandfather_84_m_has_passed/",
        "score": 4295,
        "num_comments": 139,
        "created_utc": 1456854468.0,
        "selftext": "[Original Post](https://www.reddit.com/r/relationships/comments/4721tr/me_19_m_my_grandfather_84_m_has_passed_away_and/?ref=share&ref_source=link)\n\nI got so many kind words of encouragement on my previous post that I figured a follow-up post would be appropriate.\n\nAs the edit in my original post read, I followed through. I got to the grave site before the funeral procession so that I could go over the event proceedings with the conducting officials. They were very nice and understanding of me wanting to play. They told me what my cue would be to begin playing, I took my place about 10 feet behind the grave (everyone would be gathered in front of the grave), and waited for the procession to arrive.\n\nI was very nervous, but I knew that I wanted to follow through with this no matter how it went. Once everyone was there and the casket was set in place, a pastor stood before the crowd and offered some final words while the two air force representatives stood on either side of the casket. After the pastor was done speaking, the representatives saluted and I knew it was time to begin.\n\nI took a deep breath, brought my horn up to my lips, closed my eyes and began to play, starting on a D, as some people suggested (it is a lower note, and is easier to play, and no one knows the difference).\n\nWell reddit, it was perfect. I couldn't be more happy that I was able to honor my grandfather as he asked me to before his passing.\n\nI just wanted to thank everyone for the kind words and suggestions. They were a great encouragement and I don't know if I would have ended up doing it if it wasn't for everyone here.\n   \n**tl;dr**: I did it! It was perfect and I will forever remember performing this honor for my grandfather just like he wanted.\n\n**edit:** Wow thank you kind guilder! That's a first for me.",
        "permalink": "/r/relationships/comments/48hn2k/update_me_19_m_my_grandfather_84_m_has_passed/",
        "comments": [
            "I'm not crying, you're crying. \n\n",
            "[deleted]",
            "Way to make your Grandpa proud, OP. That's awesome. ",
            "This story touched me. You really stepped up. Your grandfather would be so proud. Well done, OP.",
            "He gave you two last lessons that a soldier would want to teach. To be brave, and never doubt yourself.",
            "Bravo :)",
            "Fellow trumpet player here. Lost my dad recently. I'm here in tears man. Good on you, OP. Very happy to see this update. ",
            "I wish I had seen your original post; I would have offered words of encouragement.\n\nMy son (now 25) played trumpet in high school and college, but three years ago he stopped playing and started pursing his career.  When his grandfather was diagnosed with terminal cancer, he asked my son to play taps.  Son was nervous about it, but neer thought about backing out.  He practiced for a week in advance.\n\nThe day of the funeral, as the sailors presented a flag to his widow in appreciation from a grateful nation, Dan stood and delivered.  The sailors told him how well he played.  \n\nI'm sorry for your loss, as now I'm feeling mine again.  What an honor you had to be a part of his sendoff.",
            "Good for you OP! I knew you could do it!!!",
            "Your grandfather would be very proud of you.",
            "Well Done.  Very.  Well.  Done.\n\nI am lifetime singer in choirs, and small groups, like my two barbershop quartets.  But I *hate* singing solo.  I detest the sound of my own voice.  It's not a solo voice, at all.  But, I have always kept a policy, that I sing, when asked, at weddings or funerals.  You can't refuse those requests - whether joyful or sad, they are *irreplaceable*.  So far, one wedding, three funerals.  I'm in my 40's, so I'm sure there will be a few more of both...\n\nAs an aside, preparing for these things has forced me to improve my singing, so I've got that going for me, which is nice...\n\n>  I did it! It was perfect and I will forever remember performing this honor for my grandfather just like he wanted.\n\nYes, you will.  From musician to musician, well done.  You have given a great gift to your grandfather, and all in attendance.",
            "I played for my grandfathers funeral. Similar background - he was a WWII vet and accomplished trumpet player, he taught me to play and I played pretty seriously for a long time.  We both played taps for Memorial Day, vets funerals, etc. over the years and it was something we shared.  Only seemed right to honor him when it was time. Everything went fine until the high note, which I of course cracked. I wanted to cry but could only laugh. He would've thought it was hilarious. God, I miss that guy. \n\nGood on you for playing, and sorry for your loss!",
            "Way to go! \n\nHaving done it a few times myself (including the funeral of my grandmother), it definitely can be a little nerve-wracking because you want to do it perfectly to honor the person.  Even as an adult, it can be a bit challenging!  \n\n",
            "We're proud of you, OP ",
            "I'm sorry for your loss, but I'm happy to hear that you played, and I'm sure your Grandfather was too. ",
            "Woo hoo! I'm so pleased this went well for you. Your grandpa will be so proud of you. To be fair I am, and I don't even know you.",
            "Feel the fear and do it anyway!! OP, well done. Thanks for the update.",
            "Great job my friend, proud of you",
            "So your beloved grandfather gave you one last gift, the knowledge that you can step up when it's difficult and do that thing which needs to be done. He would be very proud of you. ",
            "This is a great update.  I'm sorry for your loss; you playing for him is a wonderful tribute to him and to your love for him.  Good on you for stepping up like you did!",
            "Hooray! So happy for you! Your grandfather would be proud :)\n",
            "I'm really glad you did this. I had something similar happen to me - my grandmother passed when I was 17, and a few months beforehand she asked me to play \"Jesu Joy of Man's Desiring\" on my clarinet. I did so (barely - hard to play when you're crying, amiright?), and am eternally grateful that I did. It is a moment that will stay with me forever, as I hope this moment stays with you.",
            "We're all proud of you.  ",
            "That's great. Well done! ",
            "Congrats, I am happy that it went well for you! You honoured your grandfather's memory in a really special way and Im sure he is super proud of you!",
            "Much tears.",
            "I got a bit misty eyed reading the original post and the update. Holding the first and third valve and hitting the notes is a wonderful thing. I am glad you did it. You will remember it the rest of your life. ",
            "I didn't even read the original post and still cried at this.  \nGood job.",
            "Hi OP,\n\nI didn't comment on your original post although I meant to, so I'll just leave you with my story now. When my grandfather died, I was a teenager and I had inherited his violin, which his mother spent a summer scrubbing floors to pay for when he was growing up. As the only member of the family who plays, it was only appropriate that it go to me. I played his favourite song, \"Danny Boy\" at his funeral and I remember crying throughout the piece, but feeling the same way you did: like I'd honoured his memory by putting myself out there.\n\nI'm really happy you went through with it and I'm sure he would be too. :')",
            "well done for being so brave, he'd have been so proud and happy. I'm in a similar place at the moment, being 20(f) and my grandpa just passed away at 78, with his funeral this morning. so this really chimes with me right now. I'm so happy for you to have had the courage to pay such a beautiful tribute :) ",
            "I am so proud of you, Internet stranger,  and I know your grandpa is to.   :)",
            "Good on ya, son! Proud of you!!",
            "My grandfather passed away recently, and he was a WWII veteran so they played Taps at his funeral too...Brought all the tears.\n\nI'm sorry for your loss, and I'm glad that you were able to honor your grandfather.",
            "So your Grandpa  helped you deal with a fear you had. Pretty nice last gift he left you there. Good luck to you, OP. ",
            "Oh wow.  I wish I'd seen your original post, I would have offered all the encouragement in the world.  But it sounds like you did fantastic without it!\n\nYears ago (Jesus, has it really been 8 years?) I delivered the eulogy at my sister's funeral.  I was a complete emotional shit show the entire week leading up to the service, and I have had many a shit show moment since the service (truth be known the shit show moments still come every now and again).  But for that hour I went to a mental place that allowed me to maintain enough mental clarity that I could give her the sendoff she deserved.  It was the most important thing I've ever done, and I had to find some kind of emotional center or I would have fucked it up by blubbering through the whole thing.  No way.  People who were there still talk about it to this day, how funny and warm and sentimental and irreverent and charming my eulogy was.  I don't say that out of arrogance, I say it out of sheer disbelief given the debilitating severity of the shock and grief I was suffering at that time. That anything coherent came out that was miraculous.  And I am honored I was able to do her memory some sort of justice.  It was my duty, my final gift to her.\n\nGood god, I don't mean to hijack your thread.  I guess my point is this - in the future when you are in doubt, when you aren't quite sure you have what it takes to accomplish whatever task you have ahead of you, remember that you pulled your shit together in your darkest moment, when it would have been perfectly understandable to melt down.  But you didn't.  You handled that shit like a boss, just like you're going to handle the next thing like a boss.  Because that's what you do!",
            "That is awesome. Good on you for following through. Your grandfather would be so proud of you!",
            "Thank you for giving us an update. You're awesome :)",
            "I'm crying at my desk.  I'm so glad it went perfect for you.",
            "You fucking smashed it! Love this update!\n\nAnd sincere condolences. I'm sure it was a tremendous send off. Well done guardian :)",
            "I knew you could do it. ",
            "So glad to hear this.  Good for you, OP!",
            "Well done!",
            "Good for you. I am sorry for your loss, but I'm glad you played it. ",
            "What an amazing way to honor your grandfather that I'm sure you'll always remember. \n\nYour post made me tear up, reminding me of my own grandfather's funeral.  I did a reading during it and choked up quite a bit, but looking back I know I would have regretted not doing it.",
            "Shortest post to ever put me in tears. Good job OP.",
            "This is so touching. I'm proud of you, stranger. And so is your grandpa, I'm sure of it. ",
            "I got a little teary-eyed reading your story.  props to you",
            "Kudos.  What a grandson.",
            "I wasn't around for the original but I'm so glad that everything worked out. You're a good lad, and I'm sure you poured all your heart and Seoul into it.\n\nYour grandfather is definitely proud of you. Well done.",
            "We knew you could! :) ",
            "Its great to read such an awesome update. \n\nYou will remember that for the rest of your life, and know you did good by honoring your grandfathers wishes.",
            "You're awesome.",
            "This warms my heart. Your grandpa is very proud of you and so am I. Bravo.",
            "He would be very proud of you.  The Reddit community sure is.  Way to go man.",
            "Proud of you. And he is too.",
            "Your grandfather would've been very proud of you. I hope you are of yourself. Playing an instrument in front of people is tough. Doing that while in such an emotional state is 100x tougher. Good job. ",
            "Hey, great update! Congratulations. I am sure your grandfather would be proud.",
            "Hey, great update! Congratulations.",
            "Im so happy to hear ths good for you! Best wishes!",
            "This is a perfect \"when Story Corps meets /r/relationships\" post.",
            "Oh, that's wonderful and it made me tear up. Good for you.",
            "Beautiful",
            "I firmly believe that your grandpa was there in spirit, and is very proud of you. Not only did you honour him, but you have a memory of that moment for the rest of your life. \n\nGreat job. ",
            "I'm sure he is so proud of you and I am too!!! Your post really touched me.",
            "I am glad you were able to honor your grandfather in that way. He would be proud of you.",
            "tearing up while reading update. look away to get a grip. read comments and tear up again. op you did a truly wonderful service to your grandpa. know that it gave him solace to have a solemn tribute from someone he loved dearly. you overcame fear to do it. keep that in mind as you go forward. your grandpa gave you an excellent life lesson. tackle your fears head on. very proud of you, young man.",
            "I'm proud of you and hope you are feeling good about it yourself. I'm certain it meant a lot to the people in attendance too.\n\nYour Grandfather would have been so very proud of you too. :)\n\n\n*Nana internet hug*",
            "Well done. I hope you treasure this last act you could do for him for as long as you live. You have honored his memory as best you could, and we are so proud of you, as your grandfather would be.",
            "Good job!! I'm sure your grandfather would have been so proud— you're a wonderful grandson!",
            "What a beautiful thing you did for your grandfather.",
            "Proud of you, homie.",
            "You did a beautiful thing, OP. Remember him with respect, appreciation, and gladness for being able to adequately fulfilling his request.\n",
            "I got goosebumps reading this.  What a great moment for you.",
            "Awesome! I can only imagine how nerve-wracking this was, I'm glad it went so well. ",
            "I played taps at my grandfather's wake about 10 years ago. I was so nervous and worried that I wouldn't do it justice. When I finished, I was feeling like I screwed some stuff up, but everyone I spoke to afterwards was so happy that I played it, and was able to honor my grandfather one last time.\n\nEven though you may not have done it perfectly, I'm sure it was a perfect moment for everyone else there. :)",
            "Awesome job, OP. I'm a vocalist, and when both of my grandmothers died, I sang for their funerals. The first one was the hardest, she and I were exceptionally close, but by the time the funeral came I had honestly cried so much that week that I had no tears left, it was like I dried up. \n\nYou did your grandfather, and your family an amazing service. As someone who sings for funerals frequently, the impact you have on those grieving is profound, I've had people thank me months later for giving them a small amount of comfort in such a horrible time in their lives. I'm sorry for your loss, but proud that you came through!",
            "I am so glad to hear you did it!  You are awesome.",
            "Good job, buddy.  You made your grandpa proud ",
            "Nice one man :)",
            "SO PROUD OF YOU!!!!! Great job!!!!",
            "Amazing job.  Well done.  What a buzz for you! ",
            "I got chills and teared up, that was beautiful!",
            "Fist-bumps for you bro....nicely done.",
            "I'm not crying because I have the emotions of a war robot, but I think it's pretty awesome what you did.",
            "I got emotional when I read the title of the post. I think your grandfather would be proud. Awesome. ",
            "This gave me the warm fuzzies- I am so glad you played and that it went well. I'm so sorry for your loss. My grandfather was an Air Force Chaplain and a Korea and WWII veteran. The flag from his coffin is always proudly displayed front and center over our fireplace.",
            "I was a bugle player when I was in the military, so I know very well the situation you have been in. However I have never played in a funeral where I knew the deceased. It must have been very emotional. I was in during the Afghanistan war, so I was one of the bugle players that came and did the ceremonial receiving of the casks when dead people arrived home. There is certainly a lot of pressure on you when playing at things like these, but when you play well it becomes perfect. Happy to hear that you did well. ",
            "I am so glad you did this.  I am sure your grandfather heard it and was smiling down on you.  ",
            "So glad to hear you went through with it. I've been hoping you would update. What a fine young man you are and I'm very sorry for your loss.",
            "I'm so happy for you, well done OP. You're so brave, and I'm sure your grandfather would be incredibly proud of you. ",
            "That gave me the feels. Your grandpa would have been proud of you.",
            "Good stuff. This is what lives are made of -- good, bad, sorrow, anxiety, and relief and pride, all of it mixed together.",
            "Were you the one that posted on /r/ trumpet a while ago? I remember saying something like this. ",
            "Trying not to cry, I'm sure you did great!",
            "I may be an internet stranger but I want you to know that I am so, so proud of you.",
            "Bless you for being able to do that for him. He'd have been proud as punch.",
            "My (then) 10 year old son played the trumpet at his great grandmother funeral (my grandma) at his own request.  It was the sweetest most poignant moment ever.  There wasn't a single dry eye ... from happiness instead of sadness.  He chose the piece, practiced for 2 days and did a wonderful job.  I accompanied him on the organ.  \n\nWell done preserving your grandfather's last wishes.  ",
            "I buried my grandfather today, a WWII veteran and army Colonel. When they fired the guns and taps played that's when it all became real to me. Thank you for what you did today.",
            "I don't know who you are but I'm proud of you bro. I know your grandfather would be too. That was a great thing you did.",
            "Congratulations and I'm sorry for your loss",
            "No condescension intended, \n\nI am so proud of you. I hope you are proud of yourself. Good job lad.",
            "I am a retired soldier.  Infantry, hard as nails.  I cry every time I hear TAPS.  Good for you to honor your Grandfather.  I am sure he is sitting around the table with his comrades telling them about his amazing Grandson.  ",
            "I know this is a an older update, but I just read it. Your story made me cry. I am amazed with you being able to pull off Taps at your grandfather's funeral, and I was in band for years, I know with the trumpet, it is all able muscle control with face, mouth and lips. I know, I couldn't have done it at my grandmother's funeral, I could barely talk without crying. ;) \n\n I am glad you did get to honor your grandfather the way he wanted. You are amazing!! Your grandfather is proud of you. :) ",
            "Congrats! I kind of regret not seeing your original post, as I went through some of the same things whenever I had to play piano at my grandmother's funeral. Regardless, I'm glad you got some good emotional and musical advice (starting on D makes it infinitely easier), and that it all worked out for you. Hope there are some good pictures for you to show your kids in the future :)",
            "So proud of you. Sorry for your loss.",
            "OP I am SO happy for you. I agree with other commenters that your grandfather left you with a great lesson with this experience. Be well.",
            "Uuuum what is taps??? \nSounds like a top funeral. Ur grandad would be proud 😆",
            "I missed this days ago but just thought of you this morning and wondered if you had played yet. I don't know you but I'm SO proud of you and I know your grandfather would be too. I'm glad you decided to go for it. And now it will be a very special memory for you. ",
            "So how does that work, playing on a D? Isn't Taps just playing through a C chord (G, C, E)?\n\nDoes that mean you played through a G chord instead (D, G, B)? \n\nAnd by the way, bravo for doing this. It surely meant a lot to him, and was undoubtedly very moving for everyone in the audience. Your pappy would have been proud."
        ]
    },
    {
        "post_id": "arp6jn",
        "author": "waplxilz",
        "title": "(UPDATE) My [23F] boyfriend [29M] keeps making my depression about him and it only makes me feel more hopeless.",
        "url": "https://www.reddit.com/r/relationships/comments/arp6jn/update_my_23f_boyfriend_29m_keeps_making_my/",
        "score": 4291,
        "num_comments": 167,
        "created_utc": 1550438205.0,
        "selftext": "Original Post: https://www.reddit.com/r/relationships/comments/9q3b3p/my_23f_boyfriend_29m_keeps_making_my_depression/\n\nNot sure anyone would care for an update, but I figured I'd make one anyways.\n\nAfter my post, things kept going as they were. He kept making my depression about him, not really listening to me or empathizing with my feelings. I just got a little too overwhelmed by him. He started to blame me for my feelings \"affecting\" him so negatively. He was upset that my depression was making *him* bummed out. I started going in to a downward spiral of depression. \n\nThe long story short is that we broke up about a month ago. It started off as a \"break\" so I could just deal with it on my own without \"affecting\" him, but now it is permanent. \n\nAnyways... About two days after the break started, I immediately started noticing I wasn't feeling as depressed anymore. I know the depression will always come back in swings, but at least I don't have to deal with him digging in the way he was. He's upset that we won't be getting back together but I feel infinitely less stressed.\n\nTL;DR: Boyfriend was digging in and making my depression about him. We split up and now I am no longer in a downward spiral. ",
        "permalink": "/r/relationships/comments/arp6jn/update_my_23f_boyfriend_29m_keeps_making_my/",
        "comments": [
            "> About two days after the break started, I immediately started noticing I wasn't feeling as depressed anymore\n\nFunny how that happens when you get away from someone who is toxic FOR YOU.\n\nStay the course, and be proud of yourself. You've got this.\n\n(edit because apparently I wasn't 100% clear. Sorry about that.)\n",
            "\"Before diagnosing yourself with depression or low self-esteem, first ensure that you are not, in fact, merely surrounded by assholes.\" - Debi Hope\n\nGlad you're doing better, OP! Thanks for the update. Here's to a stronger life and a happier time for you. ",
            "I'm so glad to read this! Some people take years to get out of situations like this, because they're more destructive than they realize. Good for you for taking a break and for realizing it made you happier and doing what had to be done. ",
            "This is a happy update. Now you can focus on taking care of yourself without him sucking the energy out of you. ",
            "[deleted]",
            "Happy updates are good updates. \n\nYou keep doing you. ",
            "I’m glad to see this worked out. Going forward I think it would be a good thing to remember that balancing a relationship with your mental health is going to be tricky at times, as you’ve said in previous comments that you were diagnosed years ago meaning you were depressed before your ex. Relationships are a new challenge when dealing with depression but one I want you to know that when met with great persistence and understanding from both sides is something that can work. My greatest piece of advice for when the time comes is to know yourself, know your limits and remember that your life isn’t just your life anymore, you’re sharing it with someone else so you must take their thoughts and feelings into consideration and yes, that means sometimes they come before your depressive episodes.\n\nSource: have experienced a lot of anxiety/depression and just want to save you some struggle. Much love ",
            "My stomach knotted up reading this. My ex was notorious for pushing me further down by  making me feel guilty about something I couldn’t help. He would get all dramatic and it would make my head spin. Small spat’s or down feeling days would led to back and forth bs about how it’s all about him. My heart would race, head throb. I would be so confused that I didn’t even trust my own feelings. It was awful. I would tell him to please just try to be supportive and not think it’s him, that I couldn’t cope with trying to console him, to no avail at that, over nonexistent issues while dealing with my own stuff.  I look back and so regret the years I was with him. \n\nWe broke up once and I told him I could no longer deal with the above things. He agreed to change it. However, it didn’t change it only manifested differently. Still miserable. I finally just stopped caring. I ran out of fucks to give. He would go as far as telling me everyone is better off without him and he’s good for nobody. He would make me think he’s going to kill himself. He never said it directly but just hint around. He would carry on for days and I remember how angry I got when someone would call or come over and he snaps back to normal. \n\nHe tried the whole ‘I’m gonna off myself’ shit when we split. I said that I’d call the police and his parents and hung up. He frantically called back to stop me. Lol. ",
            "*hug You did the right thing, even though it must have been hard. It’s hard to find people than relate, especially when they don’t deal with something like that themselves.",
            "There will always be someone who will like an update. He'll, I didn't see your original post but I'm really happy for you to see this follow up one. If you feel like sharing, do it. On Reddit, you'll most likely find someone who'll read you and reply back.",
            "I just read your original post - it’s exactly the situation I am in. It’s difficult to explain to someone who has never experienced depression themselves, or who has never had anyone close to them go through it, how it really isn’t about them.\n\nGood on you for making yourself a priority. I hope I can do the same.",
            "I just did the same with my boyfriend! Good for you! ",
            "As a male in my twenties, I have experienced a week, two weeks, and several weeks apart from my girlfriend, and every time it has brought me perspective toward and appreciation of her. It sounds like the time apart didn't do that for your ex. Congratulations on the positive outcome. ",
            "Wow, congratulations! ",
            ">He's upset that we won't be getting back together\n\nWell... doesn't *that* proof you weren't bumming him out, but he just wanted to be coddled for being poor him, the boy with a depressed girlfriend.\n\nWell done OP!",
            "So in other words, you now feel less stressed as you are no longer with him. Proving to him that he was an addition to your depression, and that he was right on some level when believing it included him.\n\nHonestly, imagine switching the roles where you are so happy with your parter then all of a sudden this wave of unhappiness hits and all you can think is it's got to be you.\nAnd I'm sorry but you cannot expect or even take your shit out on your partner, its not fair. Sounds like you are both better off without each other",
            "To be fair,\n\nMaybe you were toxic and he didn’t want to deal with you moping around anymore when he is just trying to live a normal and healthy life.\n\nMaybe the man isn’t always abusive just because you’re sad.",
            "You had to. Good job. ",
            "As a man, I'm on your side. Only because I have had my share of depression and so did my ex. Needless to say, she was ",
            "Be glad you got out when you did!",
            "I didn’t catch your first post but I’m proud of you. I was in a similar position. I went on a break with my ex because I was dealing with a lot of mental health stuff (a lot of it stemming from the fact that he didn’t support me the way I supported him), but I got back together with him because he was too sad without me. I never gave myself time to heal from being hurt, and for the last few months of our relationship I was incredibly depressed because he wanted to be dating someone that wasn’t me anymore. I wanted to tear myself apart to be a new person for him, but everything fell short. When I broke up with him for good I was so much happier. My suicidal thoughts basically evaporated and I could breathe. My only actual advice would be to make sure you don’t let the way he treated you color your other relationships. It’s been over a year and I still expect my SO to treat me like my ex did and I still tend to put my depression in a box so he doesn’t have to see it. ",
            "I'm glad you're feeling a little bit better without the added stress of your ex. Depression can be such a bitch, and I hope you take care of yourself. \n\nIf you have a therapist, it might be worth talking to them about this stuff with your ex. The way he blamed you for your depression was fucked up. If you don't have a therapist, I recommend seeing one if you are able. Therapy helped me through some pretty low times in my life, and even though I was ashamed of being in therapy in my youth, taking a self care step like that now just makes me feel more empowered.\n\nGood luck OP!",
            "I'm so glad you are feeling a bit better! I can tell you, I was in the exact same position and we broke up about 6 months ago. It was so incredibly relieving and I was finally getting better and healthier again, since he annoyed the hell out of me for 2 years. Keep it up!",
            "I had this exact situation! Something that helped me process the situation was realizing that someone who blames others to that degree isn’t someone you can grow with. You did the right thing by moving on, best of luck and enjoy this period of rediscovering who you really are. There are other guys out there who want a partner they can grow with. ",
            "Idk if it's happened to you yet (or if this is a hard and fast rule for breakups) but you may start to miss the person. Just try to remember *all* aspects of his character so you don't try to hit him up and undo the progress you've made. Continue to do your best with everything!",
            "[deleted]",
            "So, here's something crazy. I didn't see you first post, but I see this now. So I'll tell you a story that might have made more sense in your first one. \n\nI had a big group of friends in college. We were like, you normal outcast group. We weren't partiers, we weren't this or that. We just were. And we were friends. \n\nTwo of my friends ended up moving in together for our final year of college. One was my old roommate, who I knew had a handful of issues. Agoraphobia and anxiety/depression being the main issue. The friend who she moved in with had always seemed like a normal, typical friendly guy. He was getting into med school. He was smart. He was friendly and so easy to talk to. I loved him, and still do to this day. \n\nBut when they moved in together. Oh god. I couldn't spend any time with them. Both of them would enter my living space and just suck the life out of everything. My old roommate would hear someone say something positive, and she'd talk about her negatives. My old bubbly med friend would do an exaggerated sigh and talk about how even though he's been accepted to these med schools, he'd obviously never make it and was never going to be smart enough. It was SO EXHAUSTING. I even felt awful after hanging out with them, but it took me a while to realize why. \n\nSo I took a break from them during that time. We still talk to this day, and I honestly love them so much, but you never realize how much the people you're living with bring you down sometimes. Some people just end up feeding off of each other's emotions. Be they negative or positive. You did a good thing by removing him from your life. Never doubt that. \n\nTo be the best you, you must believe that a better you exists. You can't do that with someone breathing down negativity on your neck all day. ",
            "My husband used to tell me things like \"You're not depressed, you're just lazy\" and \"You were never in any REAL pain\" and \"I don't feel like dealing with your stupid problem (depression) right now\" and \"you're such a pain in the ass\" to the extent that I would have to find somewhere in the house to hide from him when I had to cry (which was every single day) because if he saw me in tears he'd make things worse. I was in such bad shape, hurting terribly, and just dying for any small words of reassurance or physical gesture to show that he cared about me. He ended up dying fourteen months ago from an aggressive incurable cancer and he continued to invalidate and minimize my feelings until the day he died. I'm still struggling with depression but it's gotten so much better since I don't have him constantly throwing salt on my wounds. ",
            "I’ve been in the same situation. It got to the point where I could not stand him touching me during panic attacks, it would literally make my skin crawl. A year later, I was in a better relationship and had a panic attack and all I wanted was for my new bf to hold me. Having his arms around me while he just repeated “you’re okay, you’re safe” felt entirely different than panic attacks with my ex. I’m glad you were able to find your way out or a bad situation and promise that the next time you’re ready to date, you’ll be more able to find someone with qualities that only lift you up! ",
            "Loving someone with depression is tough, especially when you care too much and cant control your desire to fix problems. ",
            "Wow I wish I had seen your original post because I went through the same thing! I'm so happy for you that you got out of the relationship. I did too and I have felt sooo much better ever since! Wishing you the best!",
            "Good for you. Reading your first post reminded me of growing up with my mentally ill dad (depression and bipolar). When I was little, I thought if I was better, or if my dad loved me more he wouldn’t be depressed... but I was a child and your ex was an adult. I’m glad you’re feeling better! ",
            "Good for you.  He was trying to milk the pity gravy train so that you’d try harder to make him happy.  He didn’t seem to make an effort to make you feel better though.",
            "I'm so proud of you girl! Stay strong and keep working on yourself. Good luck <33",
            "I’ve been in the same boat myself, I know how hard it can be. I know I don’t know you but proud that you made the decision to take a step in the right direction! ",
            "Wishing you the best. It’s tough. It’s also a lot of pressure to figure out what you want— maybe a couples session could be a time for you to sort through those thoughts and feel supported. Love and mental health are such tricky things, esp when combined. I hope you’re able to move in a direction that’s healthy for you",
            "Wow this post struck me right in the soul. After reading the first post and coming back to read this one, I feel less bad. Im the same age and my boyfriend of 3 years is 29 as well. I was shocked to read of his remarks and it made me hurt for you. It took more than a year into our relationship for him to consider that depression isn't all in my head, and all I have to do is flick the thoughts switch. To me him just considering it in our conversation was a success.\n\nBut even today, and after that small success which only lasted about a week, he nags and groans that I'm not constantly chipper, or that I'm just doing this on purpose, because I'm complacent and I stay in my sad feelings instead of getting up to workout or do something else he randomly suggests. \n\nAnd I crumbled when I read your comment about resentment. I've been trying to Google this to figure it out. I dont know how not to resent him for telling me terrible things when he is sick of my depression being in the same house as him. He resents me too and I cant Google how to fix that.\n\nI guess I'm just saying thanks for the read and even though I cant say I can consider leaving the relationship right now.... you give me hope.  \n\nIt is so great that you got away from that situation and I am so glad you are moving on contentedly with your life. ",
            "All the best for the future, I'm glad you are feeling a bit better now you don't have to worry about the relationship situation.",
            "Good for you it take a lot of strength to walk away from someone you care about for your own good especially when you care about them more than yourself ik i dont know you but im proud of you for that and i hope you continue on your good path you put yourself on",
            "Preach. Been there! \n2 years later and I'm with someone who will hug me when I need it, give me space, knows I have bad days and that sometimes I am just sad.  Honestly, I've felt never happier. I hope you feel better too! ",
            "I heard that. You think you can’t get through it but you really can move on and I’m in the same situation and I’ve made my mind up to move on . I feel so much better just after excepting that no one is going to make me feel so depressed ever again when ( after all  ) they are the low like cheater  and that’s all they will ever be because no one wants to be with someone who has such an ego that they actually think the other person really has the problem when it’s really them that need to seek out professional help. Grow up losers it’s not high school. Geese,  lmao right now because I’m already out and he doesn’t even know it or does he? Mr. 69 the professional cheater is on this site and he thinks I am  really stupid and continues to lie give me a break go on with your bad self man. Join another dating site go get you some. I’m out ",
            "I’m glad you are feeling better 😊",
            "Little steps, one after another, and you’ll get better little by little. Thanks for the update!",
            "Congrats on escaping from hell!\n\nCan confirm that the majority of people's stress and depression is the shitty people that they are living with.\nI noticed this when I moved out of home away from my toxic as fuck mother,  (when I was about 20) who continuously put me down,and then later from my equally toxic partner of 20 years, who was also a nasty, high lvl narciscist.\n\nWhen I decided to block both from my life, amazingly, the majority of my crippling depression went away.\nWhile it's still there a bit, I am no longer fed upon by vultures such as those. I call such people energetic vampires, because they love to feed on others' misery. If they can't find some, they create it.\n\nYou dodged no so much a bullet...but a cannonball, lol! Well done!\n\nNow you have a real chance of healing, and thriving!\n\n I would reccomend looking up narciscist traits, just so you know what to look out for next time. All narcs follow the EXACT same script and behaviour. It's uncanny! Once you know their tricks, you become immune to their bullshit.\n\nAgain,congrats, and I wish you every strength and happiness! :) ",
            "I'm so sorry you went through this. It does sound like it is for the better though for probably both of you. Similar thing happened to me recently. A few months back I started really struggling with anxiety. After my first panic attack, my boyfriend was so supportive, and then just a few short hours later he was telling me he hadn't been feeling supported enough, plus a lot of other things I needed to work on. Basically I spent the next two months trying to support and love him more, while I got no love or support for my anxiety, which just made me more anxious. A few weeks ago he actually broke up with me (which still angers me after everything I tried to do) but I do feel much less anxious despite the fact that I still miss him immensely. I am not entirely sure what happened as up to that point, he had always been so loving and supportive and it just seemed to flip like a switch. I just keep reminding myself that it is for the better, at least for now, and I need to take time to work on myself. Remember that everyone deserves someone who will be there for them through any and all struggles they may go through and will be willing to work through it with them. And take time to yourself for a while and show yourself some self-love because it is much deserved. ",
            "Toxic people do terrible things to us. I went through this last year when I got divorced. It was one of the best decisions I've ever made. ",
            "My depression was bad with my ex, we were together for five years. I started on medication thinking it was college getting to me. But I needed to finish. Once I finished I got off all my meds and was like “I’m done feeling like a crazed zombie, all you people can deal” \nOnce I was off my meds the relationship got worse, I was irritable all the time (guy was a piece of work, that’s for sure). He told me to go back on my meds. \n\nI told him I’m not medicating myself into a relationship, so if we can’t make it work now, then it won’t.\n\nWe got divorced a year or two later. \nStill not on meds. Still just fine.",
            "Be your own person. I love the final line in this. Spiral upwards. 😁📈. ",
            "Definitely better you got away and am glad you feel better. I also hope your ex reaches out and gets some help of his own as I think he was trying to emotional use you in a way to cover his own problems. I don't think he intended to do so or for it to negatively affect you, but without good self reflection skills these things can happen easily.\n\nEdit: I don't want this to be taken as me suggesting that you should go and teach him those skills. Never do that as it's his own personal problem, but I just didn't see anyone else in this thread try to understand his behavior. Instead everyone was condemning it when in reality I think negative behaviors leave great room for growth when self realized.",
            "Good for you on that decision. I can so relate. It's draining to be in a relationship where the other person is so self-absorbed that they always want to steer the focus on them. It's what I call: *reverse narcissism.* It's the kind of narcissism where they aren't trying to prove how awesome they are but more about how much their life sucks in comparison to you. Always trying to steer the conversation back to how it affects them. Making it clear that their problems are far more significant than yours. When you finally get to express how you feel, they acknowledge it for just long enough to suit their purpose (keeping you there) and then it's back to the old \"what about me\" focus... I wish that I had as much bravery as you right now.",
            "So to start well done on getting away from unneeded toxicity. Had you still been in the situation I would have been yelling at my phone/computer for you to run not walk to some support structure whether that was a family member or friend(S). Been down the depression road before and it's reared it's ugly head every so often and I take steps to minimize the effects so it doesn't hit as hard as it has. Usually comfort in music or hobbies.\n\nIn the future if you find another significant other then slowly start to discuss what you have dealt with and what you may deal with so that in time they can be your support structure. Like giving you your space or being there with pizza and cheesy movies. ",
            "Thank you for taking care of your own needs and putting your health first. <3 You deserve better than him. ",
            "I hope this doesn't get lost in the comments, but I want you to know Im proud of you! Ive been in a similar situation before and getting out of the relationship to allow myself to think more logically and not allow my emotions to affect me is what helped me overcome my depression. It can be hard at first, but its the best thing you can do for yourself right now.",
            "Glad your improving he obviously wasn't the right person for you and you will find someone better one of my best friends also had depression and I would never want to think someone was making things worse for him and that's the same for you. Keep going as you are and keep going strong.",
            "Being with someone very neurotic can get old fast. I know that because I was the neurotic one in several romantic and non romantic relationships",
            "[removed]",
            "I went through this exact same thing back in July except my ex went crazy and said and did horrible things to me. I hope you continue to feel better! ",
            "It's so hard to realize that people are toxic sometimes. Congrats and good work",
            "Had the same thing happen with my ex. Life started looking up again when I left him. Toxic people can be hard to spot, but once they’re out of your life it’s like seeing the sun again after months of clouds. There might be tougher days, but you made the right choice breaking it off. Keep moving forward! ",
            "You go girl! as a person who went through something almost the same, you're going to look back and take pride in this decision. No matter what, always make yourself a priority, it might sound selfish but it's the truth. You'll get clarity and peace of mind when you finally free yourself from toxic people.  So proud of you. Take care",
            "glad to see this update! i feel like people on this subreddit like to think that anyone with mental illness shouldnt be in a relationship when thats clearly not true. really glad youre feeling better and that those comments didnt get you down!",
            "I just read your original post; I don't know if he was doing that to you on purpose or if he had any experience with depression, but I found myself having similar thoughts when my ex and I had a similar situation a year ago. Except she called it off without doing a break first. As someone who experiences bouts of depression throughout my life, I kicked myself after realizing what I was doing to her months after the break up, I should have known better. But during that period, all I thought was that I should help her get happy as best as I can, while she kept getting distant. I attributed that to being my fault, when in actuality it was her depression, and all she needed was space to herself so that she could get through it. But my constant pressuring and presence kept making it worse, and helped no one.\n\nI'm sorry that it ended between you two, OP, but it's probably for the best, as I've learned. And I hope he learned too on how to actually deal with someone undergoing depression, let alone a significant other because it's really hard. Though it may be difficult, it should never be a blame game either. I wish you the best OP, stay strong.",
            "[deleted]",
            "I guess your depression was about him \\*Ba dum tss\\*",
            "Good job. If someone’s dragging you down you gotta leave. ",
            "Misery loves company ",
            "[removed]",
            "Enjoy your new freedom.",
            "When,like I said in my post, you are getting serious and no it’s not really that hard to have (uncomfortable at times..yes..but not impossible) I have  had several of these convos myself...besides when you truly love someone you’d be willing to have “tough” convos (it really isn’t tough more like letting someone know of a chronic illness/ medical problem which that’s what it is) also I’m glad for OP because if someone “cracks” under the “pain” they are going through,they are only thinking of themselves, there will always be hard times in relationships but the ones who are worth it are the ones that stayed through it all",
            "I've not even read your post yet but I feel this shit so much just from the title",
            "As the saying goes “If you can’t handle me at my worst you don’t deserve me at my best” \nGood for you OP stay strong and find someone worth your time and will stay through the good and bad ",
            "You need a partner. Someone who will be there to help you.",
            "I had a similar but opposite experience. I was going through a lot and no matter how much I told my girlfriend that she was one of the only positives at the moment she wouldn’t stop trying to take the blame. It honestly made me feel worse",
            "Remember to treat yourself as the queen you are! Buy a pastry, give yourself a foot massage, write down the things you love about yourself on the windows with whiteboard pen. You deserve it.\n\n\nAnd when you start feeling down, do these two things first \n\n\n- Eat something\n\n- make sure you're not just as happy as you were. Like if I am on 100%, if I go down to 75% it will feel terrible, just because it is less than before. If that makes any sense. \n\n\nAnyway, you've got this! "
        ]
    },
    {
        "post_id": "3sant7",
        "author": "saltymuffaca",
        "title": "[UPDATE] Me (Intern, 21M) with my boss (41M), I forgot to cancel a $600 software subscription on his credit card and he's asking for reimbursement",
        "url": "https://www.reddit.com/r/relationships/comments/3sant7/update_me_intern_21m_with_my_boss_41m_i_forgot_to/",
        "score": 4294,
        "num_comments": 161,
        "created_utc": 1447176417.0,
        "selftext": "[Original thread](https://www.reddit.com/r/relationships/comments/3rs0rh/me_intern_21_m_with_my_boss_41_m_i_forgot_to/)\n\nSo pretty much all of the advice in the original thread was useful, but some of the best advice came from users like /u/frehsprints (who pointed out that I was probably misunderstanding what my boss meant by \"reimbursement\") and /u/mawkish, who stressed going through every available channel with the software company to get a refund and making my boss explicitly request money.\n\n\nAnyways, on to the actual update. After I emailed the software company and they refused to refund it, I emailed my boss letting him know that, and that's when he dropped the reimbursement line. I still don't know exactly what type of reimbursement he was looking for, but I'm fairly certain now that what he meant was that he'd have to get it from the budget of the small team I work in and he runs, which would be a waste of money. He also CC'd our office assistant and told her to help me figure this out.\n\n\nA few hours later, she emailed back saying she'd talked to the software company on the phone and they stuck to their guns and offered a credit, and that was the best/only option. After seeing all the comments in the original thread, I gave it another shot and called the company. I basically reiterated that we've been loyal customers and would like to continue, but that wouldn't be possible if we weren't refunded. I escalated to a manager, who was more than understanding and got the refund processed!\n\n\nI then emailed only my boss (didn't wanna make the assistant feel like I did something she couldn't) saying the refund was being processed and sent him a receipt. His exact response was \"Good job /u/saltymuffaca. Stuff happens, the key is that you were adamant about it and got it fixed.\" Luckily, my boss thinks I handled the situation well, and all is well!\n\n\ntl;dr - happy update, I escalated the situation, got the refund when others couldn't, and my boss thinks I handled everything well",
        "permalink": "/r/relationships/comments/3sant7/update_me_intern_21m_with_my_boss_41m_i_forgot_to/",
        "comments": [
            "Well done! I'm sure this reflects well on you and your future employment there",
            "Good for you dude. You made it out of a seemingly impossible situation.",
            "Great job! HR here--you just learned more and got yourself a better reference than if you'd never made the mistake!",
            "Nice.  That \"store credit\" bullshit is becoming general policy these days I'm finding.  Had to return an item the other day & the guy was all \"all I can do is store credit\".  I simply flat out refused in the most polite way possible & stated I probably wouldn't be back in the store to spend the credit at any point in the future.  Credited my card on the spot.  ",
            "This is an example of one of those stories you need to remember for future job interviews. When they ask \"tell us about how you resolved a tricky situation at work,\" this is a great example. You made a mistake, did research on what to do, fixed the problem, and learned a lesson. Good job :)",
            "you should also acknowledge to your boss the work the assistant did, im sure that it is was because of the additional calls she made that helped yours get escalated to someone who would deal with it.",
            "You didn't CC the assistant, but perhaps you should have at least spoken to them about your resolution, like \"Hey, admin, I appreciate the help in getting this problem solved. I must have gotten to talk to the right person and now it's taken care of woot woot!  *~high fives~* Thanks again for your help.\"  \n  \nTHEN jet off the email to the boss, being sure to cc the admin. This placates the admin and reinforces their role in the team, and shows your maturity to your boss, as he can see the CC'd parties. After all, the admin emailed YOU to tell you they hit a brick wall, not the boss (and wisely so), thereby exhibiting good interoffice diplomacy.  \n  \nWhat you did could be seen as upstaging to both parties, so try to exercise better judgment towards your team in the future.  There is no love for a team member who doesn't (exernally, at least) acknowledge combined effort (even if, and *especially*, \"when\", others' efforts are/were fruitless).  On top of that, not being apprised of the resolution before taking it to the boss would understandably piss someone off a little.",
            "You've also learned a valuable lesson with dealing with people that answer the phones in these situations. They're reading off of a script and might even be doing support for multiple companies at once. Their main goal is to get you off the phone as painlessly as possible. \n\nI used to do insurance billing at a pharmacy, and on the phone with insurance companies I would be either sweet and charming or hostile as the situation warranted until I got a manager and got what I wanted. (I always got what I wanted.)",
            "Good for you! My boss is similar, he says it's how you fix the problem that's the biggest thing.",
            "It would have been VERY strange if your boss demanded that YOU pay for a mistake that happened at work personally. That's what insurance and the company guidelines are for. Imagine every employee would be directly responsible for every mistake they made and had to shell out the money to fix them...nobody would work anymore.",
            "Great job OP. You've really done an excellent job here.",
            "The secret of success is not that you never fuck up. It is that they can trust you to step up, admit it, and do your best to rectify the mistake.\n\nI'd hire an honest fuckup over someone that claims to have never made a mistake any day.",
            "Nice job.  Understanding boss.  The only thing you could have done better is to copy the office assistant on the email and include her in the glory...essentially that you were able to do it and how but that you both worked on it together to spread the credit and thank her for trying to help you out.  Boss will be happy and the office assistant will owe you one as well as think highly of your competency going forward.  ",
            "love bosses, will blow 250 in wages to get a 200$ refund sometimes.",
            "Awesome! Talk about turning a negative into a positive. Keep that attitude up, it will serve you so well in your career. Your initiative is great.",
            "> I basically reiterated that we've been loyal customers and would like to continue, but that wouldn't be possible if we weren't refunded. I escalated to a manager, who was more than understanding and got the refund processed!\n\nWell done-sometimes you've just gotta play hardball and go to a higher up!",
            "[deleted]",
            "Now your coffee's gonna get spiked by the assistant when she finds out :(\n\nBut seriously, good job OP! Solving and fixing problems they've made is exactly how people grow as people, and you've shown your boss that.",
            "OP is a red piller who's GF regresses in age, per account history.",
            "Nice job!  ",
            "In the future, try to handle these kinds of things on your own or ask help from a coworker or direct supervisor first before going to the boss. Higher ups don't like being bothered with essentially petty things that create more work for them. People that take initiative and solve problems responsibly are generally looked as invaluable employees. Glad you got it done this time!",
            "It's called a chargeback. Reoccuring payments are almost always overturned.",
            ">His exact response was \"Good job /u/saltymuffaca.\"\n\nAll at the cost of your boss knowing your Reddit username... Nice knowing you OP! /s",
            "One of the key things to take away from here is that now you fixed it, don't let it ever happen again. You know, fool me once shame on me, fool me twice shame on you kind of deal. Keep a book or a notepad or something with the programs you are using, what you are paying for and make sure this doesn't happen again.",
            "Never accept a \"no\" from someone not authorized to give you a \"yes\". \n\n-some dude one reddit's dad",
            "Wahoo!! Must be a great feeling to have gotten that refund back!! Congrats!",
            "Congratulations on the win!!    \n\nSo much of a good working environment is understanding how your boss works, and I think you've got a good one: tough but fair, gives you the opportunity to first find a solution, then if it's a challenge, provides additional support as they see fit. \n    \nFinally, gives you the kudos for getting the win. Sounds like a winner.",
            "Good job! If only you could put this kind of thing on a resume.",
            "That's great! And definitely keep that in mind for future job interviews. You could have given up and just taken the credit, but you went further and got what you wanted.",
            "Like a boss.  Good job.",
            "You handled this perfectly.  Good job.",
            "Damn dude good job, you didnt even sound as unnerved as I would have been! \nI kinda did the same thing a few times at work,though the amounts were in the thousands, definitely putting in the effort to find a solution looks great. Good job yo\n\nYour boss sounds like a really decent guy, other bosses wouldnt even acknowledge your efforts, or demand that you pay him back directly. Appreciate his fairness yo",
            "Your boss thinks you handled the situation well because you did handle the situation well. Job well done OP.",
            "Beast negotiations on your part but always keep that boss on your \"fuck me over\" radar. Just reading your stories tells me your boss is not to be trusted. Don't ever let your guard down with him and from now on make sure you triple check anything involving him. \n\nSource: i work for the government and see bosses like this all the time. ",
            "Woo hoo!\n",
            "According to your original thread, it sounded like you were concerned that he'd get you to pay for the error in some way.\n\nNo. Full stop. They hired you, and your errors are THEIR financial responsibility. And if anyone reading this has a boss like that.... Leave. They are shit people and the company will fail gloriously. Don't put a losing situation on your resume.\n\nAs long as you feel guilty enough to try and correct your mistakes, then that's all you can do.",
            "How do you know how old your boss is?",
            "That's awesome!  I interview applicants at my job and the question that tell us the most is \"Tell us about a mistake you made at work, and what you learned from it\". We *expect* people to make mistakes, but some people recover well and learn well, and some don't. ",
            "Your boss thinks you handled the situation well, cause you fucking did champ.   Walk back in there, lose that intern tag and go buy yourself a new car. ",
            "Always always threaten to take your business elsewhere. I don't know why most people don't know this. ",
            "Good job! You handled that like a boss.",
            "Im reading this for the first time so my advice is only something that might help in the future but here it is:  With all the types of repeating charges, credit cards have recognized this type of situation as a burden on the account holders.  If the company wouldn't have refunded you, you could have gone to the credit card company and reported it and the card would have reversed the charges.  \n\nGo job sticking with and getting it refunded, glad everything worked out for you.",
            "The general rule of dealing with customer service is to use the 'I've been a loyal customer for so and so years, but if this problem can't be worked out then I will gladly take my business somewhere else.'\n\nAlso well done.",
            "Hell yes!  You did a great job as a professional and handled this with diligence and politeness.  You're a champ OP and this WILL reflect well on you as someone who can make things happen.  So super proud of you!",
            "You handled the situation perfectly. You made management aware immediately, offered to help with the solution, and even were able to pull out a positive result when others submitted to defeat.\n\nExemplary.",
            "shitty people and their no returns excepted garbage. glad it worked out.",
            "Nice one! We all make mistakes [some more costly than others] and we just need to learn from them going forward :) You stuck to your guns probably more than I would've!",
            "Eff yeah!  I couldn't be happier about hearing this update!  You seriously knocked that one out of the park.  Good luck on your endeavors; hopefully that got you some cool points. :D",
            "[deleted]",
            "You probably gave him a pleasant surprise. ",
            "Nice work. ",
            "And then you fucked him?",
            "I hope you cleared beforehand how far you can go with the company.  \nYou can't just call a manager and bluff that you won't work with them anymore if you don't get money. What if he said he can't give you money? ",
            "Now ask him for a raise. ",
            "Don't  forget to  thank Redditors who helped you  during this ordeal.",
            "It's not whether or not you make a mistake. It's how you handle it when you do make a mistake. You handled this admirably.",
            "The thing to take away from this:\n\nif you have a problem, don't take no for an answer until you are SURE that you've talked to the highest possible level person. ",
            "Go kick his fucking ass if he pulls that stunt on you.",
            "Good job! I've done something similar and it's so stressful when your just trying to get your foot into an industry. ",
            "Congrats, that's really great.  Glad they decided to be reasonable.  ",
            "The ability for you to solve your own problems will talk really good when he keeps you in mind.\n Now he knows you're self capable and can handle problems fine.\nGood job ",
            "Congrats saltymuffaca\n\nWhat inspired the name ?",
            "aren't you a good little wage slave!!! congrats bro!!",
            "Why is this on r/relationships"
        ]
    }
]