[
    {
        "post_id": "hpkndz",
        "author": "frances694",
        "title": "UPDATE: My [24F] boyfriend [25M] is being passive aggressive about my injury since it happened when I was drinking and is also accusing me of \"overplaying\" my injury",
        "url": "https://www.reddit.com/r/relationships/comments/hpkndz/update_my_24f_boyfriend_25m_is_being_passive/",
        "score": 4284,
        "num_comments": 155,
        "created_utc": 1594512057.0,
        "selftext": "[original post here](https://www.reddit.com/r/relationships/comments/hoeaet/my_24f_boyfriend_25m_is_being_passive_aggressive/) \n\nSo first off, I appreciate everyone's advice. I broke up with my boyfriend! I just couldn't get past him not taking my injury and pain seriously and basically blaming me for it. It was really hurtful that I was in pain and he didn't seem to care at all. It was a relatively smooth breakup. There was no arguing or anything. I told him how I felt and all he said was \"sorry\" but it wasn't a sincere apology. It was more of a \"sorry you feel that way.\"\n\nSo I'm moving out. I'm in the process of beginning to move all my stuff out which I think is the worst part. It's especially not fun on a broken foot! My aunt and uncle live about 40 minutes away and they are more than happy to let me stay with them while I look for a place. \n\nAgain, I really appreciate everyone's advice. I'm happy with the outcome and think it was for the best. If he couldn't take me seriously now, I don't think i could ever trust him to take me seriously or be supportive in a medical situation again. \n\nTL;DR: Broke up with my boyfriend today after he didn't take my injury seriously. I am moving out and feel good about my decision.",
        "permalink": "/r/relationships/comments/hpkndz/update_my_24f_boyfriend_25m_is_being_passive/",
        "comments": [
            "Oh man. I broke my foot last year on 4th of July and that's when I learned my ex didn't care. Kudos to both of us for getting out!! Yay for broken feet? Lol",
            "Yeah, he was treating you like garbage, and deserved to be thrown out as refuse in response. Leaving toxicity is so freeing once you're away. As I said to an earlier poster, when I left that asshole, I was over it. Almost immediately. Just couldn't give any less fucks. Good on you.",
            "This is a moment where you can take a whole new road, or stay on the one you’re on. Because he will be super sorry tomorrow and you’ll realize you can maybe work it out and stay together, or really follow through with it. You’re pissed right now (rightfully). \n\nBut If you’re like me, that anger will wear off and you might start double guessing this break up. Which might be fine. I just keep thinking of a similar relationship I had in my 20’s and there was a long time of being unhappy, getting mad, working it out, being unhappy (I even had a similar injury/guilt trip thing). \n\nThen one time I just stuck to it and moved out. It wasn’t even that huge of a fight that spurred it, just the realization that although my boyfriend wasn’t terrible, he was just kind of a jerk and even though starting with him was easier, it wasn’t really fun. \n\nAnyway, getting out of that cycle was the best thing - I ended up meeting someone way, way more right for me. Good luck to you and I hope your foot heals quickly.",
            "I’m proud of you, what an asshat that guy was.\n\nI fractured my foot *entirely sober* getting out of a bunk bed, had to wear a cast on it for almost a month. That shit is a broken bone, and since your ex couldn’t take that seriously I think he might’ve had a broken brain.\n\nCongrats on your escape from his toxicity, girl. It’s not easy to call a spade a spade sometimes.",
            "Good for you! I fractured my wrist while very drunk, at a punk bar, in a mosh pit (I was 26 too, not even a kid 😂) and my husband laughed at me, but was very supportive otherwise. Shit happens, and being salty about it isn’t cute.",
            "As someone who also broke something on July 4th and whose partner has been the most wonderful angel through it all, well done ❤️",
            "Having fractured my foot before as a kid and requiring a boot, it is very serious and requires the same treatment as a break, the only thing is it didn’t break all the way through. A fracture is still incredibly painful, I doubt this fool even understands what a fracture is. He probably thinks it’s akin to a bruise. My Ex was this way when I had a knife fall into my foot on his birthday, complete accident that happened while unloading a dishwasher, he treated me like it was my fault and I did it on purpose to ruin his birthday and take his attention away. \n\nI’m glad you broke up with this boy, he is completely selfish and you deserve so much better than that. He’s not thinking about anyone but himself and showing you his true colours. You’ll find the right guy some day, who treats you right and looks after you when you’re injured, I found one and he’s so kind and caring almost to the point of it being annoying. \n\nTimes are hard right now, but try to keep your chin up and love and care for yourself, be kind to yourself, at the end of the day you are the most important person to yourself, so don’t worry about the loser who couldn’t appreciate the great person that you are.",
            "Usually I mock /r/relationships for pushing breakups, and honestly I didn't go through the comments to see if it was pushed or not, but regardless, good for you!  Way to have some self esteem, I think you made the right choice!",
            "Real friends/significant others step up when you're ill or injured... he should have taken it seriously. He showed you he didn't care about you. What if you had broken your leg and needed serious assistance... luckily it was a fractured foot and you can hobble around in a boot. It sucks you have to move with a broken foot. Please rest it and ice it. I broke my foot in December. It still bothers me. But my best friend came over 3 times a day for over a week to walk my dogs while I was on crutches. My other friend got me a giftcard for the grocery store because I was out of work. It brings me to tears to think about how kind they were during my time of need... your bf didn't even take your injury seriously. Probably for the best he's gone.",
            "I’m so glad to hear that you’re doing this! Super super proud of you! After your last post, I was worried about you, but you seemed to have a very good head on your shoulders. You’re gonna be just fine! I’m so sorry you had to go through this to get there but one day, you will be in a much better place and you can think of this as a positive experience. Again, super proud of you! Good luck!",
            "Good for you!  That guy is trash.  I literally fall down the stairs every other week, no alcohol needed (I’m just a clumsy ass).  And if anyone made me feel any worse than I ALREADY DO for being clumsy, that would be really difficult for me, and heartbreaking if it’s someone I love!",
            "I can see why he would be a bit down but I wouldnt be upset or mean just a bit disappointed and then move on with life. So him being passive aggressive and being childish kind of showed you who he is at this point in life and you did the right thing by not dealing with that bullshit! He should have used his adult conversation skills, said how he really felt and accepted your apology with no more hostility of any kind from him all while helping his hurt girlfriend feel better in any way during and after.\n\nIm glad you wont have to deal with that behavior and hope your next SO is more understanding and acts more like an adult! Best wishes!",
            "I broke my ankle last November playing rugby. My fiancé doted on me and helped me without question. He literally had to help me shower and stayed overnight at the ED when I needed a revision. I’m so glad you figured this out before you had kids or was hella deep in a marriage. Reading your story pissed me off.",
            "I'm so glad you broke up! My ex husband and I had a similar thing early on when we were dating, I brushed it off and guess what...he was ALWAYS like that and worse. My pain meant nothing to him. I was in the hospital for food poisoning and when I got out I asked for some seven up. When I got home he was like no I didn't buy it because soft drinks make you fat. Really. You did the right thing. Dudes like this don't get better they get worse. I'm an Internet stranger but I'm so proud and happy fo you!",
            "I used to date men like that. Then my current boyfriend and I started dating and it's wayyyy different. I'm clumsy and fell down a flight of stairs and badly sprained my ankle at his younger brother's football game like 20 minutes in and even though it was the only one of his games he would be able to make it to that year he took me to the hospital and took care of me. Yes he was frustrated but he was also loving and understanding. I hope you get a relationship like that. A partner that cares for you and raises you up rather than what your ex did. You deserve to be unconditionally loved",
            "How can anyone think a fracture is minor. It is a literal bone break. I'm glad you broke up with him even if it was just for the fact he is not very smart.",
            "Well done! Relationships like this just aren't worth it. If your partner can't support you when you're not well, over themselves... especially for an injury which is temporary and will heal, than they're obviously not going to do better if you end up with something not so temporary.",
            "Well done! You deserve someone who'll treat you like a human being, one who has unintentional accidents and suffers pain like everybody else. That guy was not that guy for you.\n\nMy husband jokingly calls me a wuss because I get sick or hurt easily, but he understands I'm not playing it up and he takes care of me. Likewise, I take care of him. He's my person; I take care of the people I love. I hope you find that person one day, too.",
            "This guy sounds like a Piece of Shit, I also bet he won't bother to help you move out while you struggle with your broken foot since \"it was your decision to break up,\"\n\nFuck that guy.",
            "Good for you. I didn’t leave in similar situation; it took me years to realize how much that damaged our marriage. I’m old now, and have given up.",
            "Yeah you have to get away from people like this. Every time I was suffering, my ex wife used to find a way of it being my fault. I stayed with her too long and it broke me",
            "You did the right thing. How they treat you when you are hurt or ill is a huge deal. You were lucky to find out before you got serious with him.",
            "My gf tore her ACL a year after we got together. 2 years on and she's currently working out with more mobility than ever. She's never been stronger since she got her surgery and started taking care of herself. It was a shock. \n\nShe tells me I'm a big part of being able to bounce back but I know 90% of it has been her and her spirit. You don't need anyone other than yourself. You're the only constant in your life. If he wasn't willing to help you heal and help take care of you then you absolutely do not need that negative energy around you when you need to heal. \n\nI'm just a stranger and I'm fucking proud of you OP. Take life into your own hands and bounce back the best can. You're capable of more than you will ever know. 💚",
            "> I told him how I felt and all he said was \"sorry\" but it wasn't a sincere apology. It was more of a \"sorry you feel that way.\"  \n\nYeah, that doesn't sound like an empathetic person. Anyone who apologizes like that is out in my book.  \n\nKris Gage has a good blog post on Medium on How To Apologize:  \n\n> If you apologize for their experience, and not what you did to impact it, you didn’t apologize.  \n\n> And if you apologize and then add any kind of disclaimer or explanation — but, except, however, just, etc. — then you did not apologize.  \n\n> You just did enough to get their attention, and then you used that podium to explain away your behavior. You didn’t take responsibility. And if you don’t accept responsibility, you aren’t apologizing.",
            "fuckin good riddance. This was a blessing im disguise! Glad you got to see how he handled a tough situation now rather than later! Hope you heal quickly and manage to rest your foot!",
            "Good thing you caught how toxic and unserious he was. He's a narcissist... and never cared fuck all about you.",
            "Good for you!!  \n\nStay strong, and find someone who will support you through the 'serious' medical stuff, AND the 'stupid' medical stuff.",
            "Good for you. It shouldn’t matter how you got injured it hurts. I broke my foot in 2018 two and a half months before my wedding and my husband was nothing but accommodating and sympathetic. I’ll also note that I broke my foot in a stupid way doing something he told me To stop doing because I’d fall and hurt myself so way to know what you deserve.",
            "My first marriage ended 20 years ago, when I look back now I can see how my ex wife used my back injury against me. The injury required a lot of physical therapy, something that was not available at home so during the weekI stayed with a friend 2 hours away. Since the injury was caused by driving  a semi 8 to 10 hours every day, it was very painful to drive home. She used that ad an excuse for her to cheat on me.",
            "Sad. If my wife was injured I would hurt for her and go out of my way to accommodate her. In some ways I would “feel her pain” because I love her and worry about her when she’s hurting.",
            "I broke my foot almost a year ago and when it first happened, I don't think my boyfriend immediately understood that I really was in a lot of a pain and also that I genuinely couldnt walk. At first, I needed help with everything, even showering and I couldn't drive because I broke my right foot so he had to drive me to all my doctor's appointments. I could walk after 3 months and stopped limping around 5......and now it doesn't hurt me at all anymore. It took him some time to reconcile the idea that life as we knew it was going to be very different for awhile. I'd say be patient with your boyfriend and see if he comes around.",
            "My collar bone was considered fractured but i saw the xray and the bone’s break was several cm apart. Not a small injury. But what a jerk yo",
            "Yay!  So happy for you.  You deserve better.",
            "A good way to think of this is.. if you never got hurt would you stay together? Who knows maybe this was meant to happen so you can see what a jerk he is.\n\n But now you know how he acts and can see how manipulative and passive aggressive he is all while you’re recovering from an injury! \n\nYou deserve someone to wait on you and take care of you when you’re down, because you would also do the same for your partner. Good riddance to garbage partners!",
            "This reminds me of when i twisted my foot while stepping off a curb, which fractured the side of my foot, three days before my friends wedding (of which i was a bridesmaid). She was extremely annoyed, accused me of being drunk and told me that if i cant walk unaided down the aisle that i wasnt allowed in her wedding. Our 15 year friendship became much more distant after that. People who begrudge you over accidental injuries suck.",
            "My ex once told me that he knew my foot wasn't broken because he watched a lot of medical shows. He was pissed that I insisted on going to the doctor, where the xray showed that my foot was indeed broken! Apparently the media is not doing a thorough job educating our couch potato MDs.",
            "I broke 2 bones in my foot just walking my new puppy, basically they started as fatigue breaks that then got worse because I couldnt rest my foot. I couldnt not walk the puppy, since he was training to pee outside, but it took 3 months before my foot was back to normal, because I had to keep walking on it, and the boot wasnt really the main part of the healing process, rest should have been.\n\n&#x200B;\n\nAnyway, it hurt like a mofo, so 100% fuck your ex. What an ass.",
            "I fell down a few steps, completely sober, and tore a ligament in my ankle in April that still swells at night and is painful 9 weeks later. I can’t imagine the pain if I fractured the bone. Glad you got out smoothly!",
            "First of all, you did well. Second of all, as a girl who also hurt her foot while being drunk, you’re right to take it seriously. It messed me up pretty bad (it was 4 years ago and I’ll have issues for life bc doctors didn’t take me seriously). So, yeah, you and your health come first! Take care",
            "Imagine your bf when someone asks about you. “We broke up-she broke her foot and well that was the last straw.” What a loser.",
            "Off tangent but my ex would almost always apologise with \"sorry you feel that way\" instead of \"sorry\" and I only just grasped the difference between the two when I read your post. Glad you  put yourself first & focused on your health!",
            "I've fractured my foot before, and it is NOT \"minor.\" I had to take a month off work while it healed and when the boot came off, had to take it very easy as my muscles were weak and not able to hold me up properly. It is very obvious he did not care about your health with this mean injury downplaying comments and behaviour. So glad you are taking care of yourself and leaving this guy. I wish you all the best!",
            "You have been saved from a lifetime of misery. Go celebrate it!",
            "Foot fractures are no joke.  Broke mine a year ago.  Needed 2 operations on it.  It’s never going to be right and was painful as hell.  You are better off without him.",
            "I broke my pinky toe a couple of years ago and even that, just one digit, was almost as excruciating as childbirth. And they couldn’t do anything but tape it up. \n\nHe sounds like a huge ass and I’m glad you’re free of him!",
            "I was a bit hesitant to respond to this but I still believe that different perspectives are always good to grow and understand people.\n\nMy immediate feeling was sympathy for your boyfriend but please hear me out.\n\nI am a child of alcoholics. My father was an alcoholic his whole life - my mother turned slowly into a even more emotionally burdensome person over the course of years.\n\nRecently I had a huge fight with my girlfriend when we were both drunk. When she is drunk I tend to babysit her - she would do whatever pleases her in that moment - steal a bike, go somewhere, keep drinking. She is not a bad person in any way but when she is drunk she is uncontrollable.\n\nI always thought I am kind of okay with that but then I blew up and got very mean to her while she puked her guts out. It turned out I shoved away the trauma with my parents - I had to always function while they behaved like crazy and then the next day they denied any responsibility \"because they were a bit drunk\".\n\nWhen I was reading your post I was reminded of my mother falling and breaking her foot when she was out on a festival. She said she just casually slipped and thats how it happened. The next morning we had to go to the hospital - I was around 13 I would say - and I had to wait for hours while she got scanned and diagnosed with a fracture.\n\nI dont know why I am telling all of this but when you wrote your first post and said \"I dont drink often but I get tipsy quickly\" I was asking myself if you actually are in control of your drinking. Getting in a different state of mind quickly is a big problem when you drink. Falling and breaking your foot while drinking is problematic.\n\nI just wonder if your boyfriend might felt like I do when my girlfriend gets drunk and I have to deal with the results of her evening. \n\nAnyway I hope you are doing better and maybe in your time to heal from this relationship you could soul search a bit and ask yourself if there might be a problem you have that you are minimizing.",
            "there’s a pandemic, you guys should not have been going anywhere for 4th of july anyway. \n\nglad the bfs been tossed out though.",
            "Good for you girl. You dodged a bullet. That’s great that your aunt and uncle can take you in <3 best of luck to you!! Here’s to a bright future of new, more loving people!!!",
            "Your BF was right that you were being irresponsible. Being drunk is not an excuse for being clumsy.\n\nBut he shouldn't have acted out harshly, and instead taken your fault in stride. After all, relationships are a compromise.\n\nYou were right to break up. Regardless that being drunk was your fault, no one should be in a hostile relationship.\n\nOf course there's always the route of perseverance with patience and communication to see if a conflict is salvageable. But that is a hard goal to set for someone just from a single post.",
            "Good on your ex bf. It sounds like you don't take responsibility for your actions. We don't have much information about your lives, but you moving out means he's paying the rent and is working. This means he was looking forward to that trip and you don't show any empathy for him. If he was taking days of for this and paid upfront then yes, he has all reasons to be pissed off. Your drunken self ruined all of this. Being drunk doesn't mean you're freed of any responsibility.",
            "Hope you learned a lesson here about your limits with alcohol.",
            "Good luck! I think your boyfriend acted appropriately. I'd probably feel the same way if my girlfriend \"broke\" her foot while drinking and ruining our plans.",
            "Honestly, you sound like your throwing yourself a bit of a pity party and seem to be using pretty over dramatic language...regardless, if you decided to move out over this, the relationship probably wouldn’t have worked out in the long run, as that seems to be a fairly minor relationship dispute to move out over.",
            "[removed]"
        ]
    },
    {
        "post_id": "c2sc74",
        "author": "hospital_throwawei",
        "title": "[UPDATE] I'm (27F) scared my friend (50M) is becoming isolated during a long hospital stay, but the stigma surrounding his illness (AIDS) limits what I can do",
        "url": "https://www.reddit.com/r/relationships/comments/c2sc74/update_im_27f_scared_my_friend_50m_is_becoming/",
        "score": 4281,
        "num_comments": 167,
        "created_utc": 1561010764.0,
        "selftext": "In the original post, [I described](https://www.reddit.com/r/relationships/comments/bmb8j3/im_27f_scared_my_friend_50m_is_becoming_isolated/) the predicament of my dear friend, a >30-year HIV survivor who suffered massive inexplicable treatment failure and was alone all day in the hospital because his husband was at work and he'd kept his condition a secret. I also described my quixotic effort to become his one-woman T cell cheerleading squad.\n\nI'm sorry to report that my friend has died. After all that could be done was done, he went home and passed away surrounded by his loved ones.\n\nHis suffering is over. That's supposed to be the important thing. In the original post, I avoided talking about the suffering. How his intestines had filled with abscesses and bacterial films and Kaposi sarcoma and God knows what else to the point where he vomited fecal matter. How he weighed \\~80 pounds and had a bedsore that showed bone.  How the virus had invaded his brain in a way that might have condemned him to Alzheimer's-like deterioration had he lived, even with the newest and best drugs. He'd stolen three decades from HIV and that bastard was out for revenge. Call me a sweet summer millennial child if you like, but it was the worst thing I've ever seen.\n\nNonetheless, I'd be lying if I said I was taking his death well. I'm writing this  from inside the Pillow Fort of Grief I built in my living room. Redditors have no way of knowing, but he was a wonderful, special person. I opened my heart to him for a reason. The world is a worse place without him.\n\nI'm grateful for the advice of some of those who commented on the original post. I did ease  up on the presents. When I visited the hospital, I focused on just spending time with him. We watched a lot of HGTV, and I would try to  make him laugh by making fun of the questionable taste and skewed priorities of the couples on House Hunters. I held his hand, brushed  his hair, stuff like that. The last time I saw him, I told him I loved him and kissed him on the forehead. He could speak faintly at that  point. He said, \"you're so good to me.\" You probably have no idea what that meant; I've always thought of myself as a robot and a moral failure, and he knew it. He was the gift-giver in the end.\n\nOn social his husband is maintaining that he died of freak complications  from routine surgery. I wish I could tell him he didn't have to do this, but this very week an authority figure in town went viral for a deranged homophobic rant in which he said, among other terrible things, that AIDS was God's punishment. I feel like I'm trapped in an '80s time warp, but minus all the fun parts with the synth music and crazy fashion. \n\nI don't know what happens now. Clinical depression? Volunteer work? Befriending the husband? There's a big old void right in the middle of my life. It's the price you pay for caring, sometimes.\n\nTL;DR rest in peace my beautiful friend\n\n&#x200B;\n\n\\*\\*\\*EDIT\\*\\*\\* Wow, this post exploded. I am overwhelmed by all the condolences and well wishes and unusable throwaway karma coming my way. You're all the kind heart of Reddit. And you like my writing? That's too much. Stop it. \n\nPeople are asking why I think I'm a bad person. The answer is that I was diagnosed (probably correctly) with an autism spectrum disorder in my teens and told that my social deficits were caused by failure to develop the capacity for empathy. There is now tons of pushback on this theory of autism, but it was dominant at the time. I was vulnerable and impressionable and I thought, \"Oh no, I'm a sociopath. I'll have to spend the rest of my life hiding how rotten I am inside.\" I mope about my moral fiber the way other women mope about their weight. I'm doing it right now, fretting over whether this post is narcissistic. \n\nMy friend showed me another side to myself, a bright mirror. He changed my life. Losing him is heartbreaking.",
        "permalink": "/r/relationships/comments/c2sc74/update_im_27f_scared_my_friend_50m_is_becoming/",
        "comments": [
            "I'm so sorry for your loss. Any terminal person wants to be surrounded by friends and loved ones til the end, and you were no doubt one of the people he was happy to have. You weren't afraid to touch him and give him simple physical intimacy of held hands and a kiss to the forehead. That must have meant so, so much. \n\nI'm also sorry your town has a case of the Terminally Stupid Ass-Pustule in the form of that homophobe. I'm a vindictive little queer so I'd like to think that he probably won't die surrounded with love and attentiveness like your friend.",
            "Thank you for being there for him.",
            "As well as being a very kind and caring person, your writing is wonderful. I don't know if you already do, but maybe you could use it as an outlet for some of the things you are feeling but can't share. It's beautiful - maybe that would be a nice way to share your support with the husband of your friend, too (if you think it would be appropriate). I'm sure he would love to have such a thoughtful reminder of how special his husband was to other people as well.",
            "What happens now? A career in writing. Start with writing down all the stories from the course of your lives together and share it with his husband, to help remember him. Stories from people’s lives are some of the most precious and ethereal things in this world, and you have the mark and style of a powerful storyteller.",
            "You are a lovely caring person, OP.\n\nI'd say let the husband know you're there for him if he needs/wants, but otherwise focus on yourself now. If you find yourself depressed for longer than two weeks, try to find a counselor or perhaps even a grief support network. The hospital might know some specifically tailored to relatives/friends of people who've recently passed. Sometimes the act of simply talking about your feelings and experiences and/or listening to others is what you need to process them and begin to move on.\n\nVolunteer work also seems like it could potentially help. Be careful of what kind of volunteer work it is though--volunteering at hospitals or with the homeless can invite the same \"price you pay for caring\" feelings re: the situations that various people are suffering through. It's easy to feel frustrated that you can't make more of a difference.\n\nWhatever you decide to do, take care. :)",
            ">I've always thought of myself as a robot and a moral failure, and he knew it. He was the gift-giver in the end.\n\nYou have acted the opposite of how you think of yourself here!  \nYou stood by a terminally ill person until the very end for the sole reason of giving him your undivided attention and lovingkindness. To simply make him feel loved and seen, without any personal gain. Being present with someone who is terminally ill is a very hard thing to do. Yet you did it anyway. You gave this man your unjudgemental support when he suffered. The best of gifts and, in my humble opinion, there is not much to top that off when it comes to morality.",
            "Thank you for being there in his time of need. \n\nPeople take HIV far too lightly these days. Many that should be on PREP are not and play with fire. Yes, it’s likely you’ll live a long and healthy life with it; but, your friend shows that drugs can and do fail at which point it progresses to AIDS.\n\nSeeing someone die like this changes you. Imagine a whole generation of gay men dying because people weren’t sure what was up at first, and when we did we had people who didn’t care. Politicians doing nothing or calling it God’s wrath. \n\nNow, there are countless people of all sexualities infected. It’s treatable. But we need to remember how easily that can all go awry in the right circumstances and your life will wither away. \n\nAgain, thank you for being there and to witness his life.",
            "I am very sorry for your loss. June 30th will be 5 years since my oldest sister died of AIDS. It was probably the worst thing I have ever seen, and I had seen death before. Afterwards, my family all decided to tell people she died from pneumonia.  It's 2019, the disease has been around for decades. Did they think it would be more honorable had she passed away from cancer? I don't advocate, and I don't tell people on purpose, but I'll never lie when people ask. I'm so happy that your friend was able to live as long as he did.  I really hope in our lifetimes, they will continue to make advances for treatment and maybe vaccines or heaven knows, a cure. Sending good thoughts your way.",
            "That was a big kindness to him. Let your friendship and the solace you showed him be a balm for your heart now. It's going to be tough so just mind yourself x",
            "I would just like to say that people who lost loved ones during the AIDS crisis would probably agree with you that it’s one of (if not the very worst) things they’ve ever seen. I’m so sorry for your horrific loss and that your dear friend had to suffer through one of the absolutely worst viruses imaginable. I hope that you can find comfort in the things you both enjoyed and the happier memories you have of him. I hope his husband can one day openly speak about what happened without fear.",
            "I’m so sorry for your loss. I remember your original post. You absolutely did everything you could, and it likely meant the world to your friend and his husband. \n\nYou can just rest for now. That was a lot of pain in a very short amount of time. A pillow fort of grief sounds exactly right. You can take on the world once you’ve caught your breath. In the meantime, take it easy, and be kind to yourself.",
            "I'm so very sorry for your loss. It's not fair to victims of HIV/AIDS to have to suffer in silence. It's a chronic illness and should be looked at with empathy, not fear or shame. It's horrifying to look back at all the young lives that were lost in the early days of the epidemic. I can't imagine losing all my friends to something so awful on top of the ignorance and homophobia that they had to face. It breaks my heart and fills me with anger. There needs to be more of you out there. I'm sure it meant the world to your friend that you were there for him. Please take comfort in that. No one should die alone in such an agonizing way. It's terrible the way society looks at this illness as something to be ashamed of. In turn, it forces victims to suffer more (needlessly) and take their secrets to the grave. If your friend's wish was to keep it private. I would respect that. It just shouldn't be that way.\n\nThank you for being there for him.",
            "You made his life better and that's all anyone can do. I'm sorry he's gone. :( \n\nTake care of yourself, OP.",
            "[deleted]",
            "I am so sorry for your loss. You are very much allowed this time to grieve; don't let people make you feel like you need to \"move on\". It sounds like the world lost someone very special. \n\n&#x200B;\n\nI work in the medical field and have been a caretaker for many end stage AIDS patients. You are absolutely right about the stigma; it's revolting and ever present in society, even healthcare. I hope what I'm about to tell you gives you some semblance of comfort.\n\n&#x200B;\n\nNearly every AIDS patient I've had spends their final days alone. They are often suffering from addiction, mental illness, and the lifelong social isolation that comes with this horrible disease so there aren't too many friends and family around. I have sat and held their cold, boney hands too many times to count and the single thing they always express is that they \"wish X loved one was here\". You did more for your dear friend than you realize. Gifts and cards are nice but people know when they're about to move on and it's terrifying; I didn't know your friend but I can assure you that the time you dedicated to him in his final days meant more to him than you can ever realize.\n\n&#x200B;\n\nAlso, about your autism diagnosis: for whatever reason, the idea that people on the spectrum cannot feel empathy has been paraded around for a long time and it is absolutely false. Any experienced specialist will tell you that while you may experience empathy in a different way than neurotypicals, you are certainly capable of having feelings and loving others. It is blaringly obvious from your testimony to your late friend that you are both 1) capable of feeling love and empathy as well as 2) being able to express it in the way that people need. Being an empath is a gift to this world...use it, and do not let anyone, including a doctor, that you are incapable of feeling because your brain works differently.",
            "I remember your original post and it stayed with me. I'm crying for you now, you are a wonderfully caring person. Love and take care of yourself now.",
            "I didn't see the original post when you put it up, but regardless, I am so sorry for your loss. Know that you were a good friend, and make sure that you look after yourself. If you can afford it, therapy is a good step to take - you're grieving and you will need to talk to someone, and a therapist will be confidential and detached. And I'm sure his husband and sister-in-law would appreciate having you around as someone who was close to him, and if you're able to be emotional support for them, do that, but don't feel like you can't ever step away and if there's any part of that you need your own emotional support for, make sure you have that in place. You deserve the best chance of getting through your grief, and your friend would want that for you too.",
            "This story is beautiful and crushing. Nothing quite like loosing a buddy and the circumstances sounds shitty. Really sorry for your loss and thanks for being one of those wonderful friends that we all need.",
            "Oh, OP - I am so sorry.  I was already crying while listening to the Freddie Mercury version of \"Time Waits for No One\".  A very dear friend of mine's daughter passed away from AIDS in the early 90's when the stigma was at an all time high.  I feel like it isn't as stigmatized now (except for the few vocal assholes who believe it is God's punishment towards gays) and that people have started believing that every case of HIV/AIDS is curable (I think I read recently that someone in England was actually cured?).\n\nThank you for being a rock for your friend.  Stay in your pillow fort and have a good, cleansing cry when the feeling hits you.",
            "It's all the more awful to have gone through that during this particular time in history, when all of the bigots are crawling out from under their rocks. I'm sorry and I wish there was more I could do. I would reach out to the husband and see if there's anything you can do to help him. Take care of yourself.",
            "Hello OP. I'm so sorry for your loss.",
            "I am so sorry to hear about your friend. So hard to just try and act normal when you know the other person is probably wishing they'd die already due to their insurmountable suffering... It's heartbreaking.\n\nYes, his husband will probably need support, but you need to ask in what form he'd like to receive it. Would he like to reminisce with you, or maybe prefer to be left alone to deal with his emotions first? Or would even seeing you be unbearable for a while, because you remind him of what he misses the most? Ask him how you can help. Most of the time, just being there works, but some people prefer to keep alone. In that case, ask if there's any practical stuff you can do for them. Don't know how close you are, but you could offer to clean up, cook, pay the bills, get groceries, do the laundry, or take care of their pets' walks etc.\n\nAs for the guy on the news and the homophobic assholes, there's nothing we can do. Some people are just like that. Other people hate fat people. Others are racists. You can't fix stupid. Just pay them no mind when they spill their hatred, and try to live your best life.",
            "> Befriending the husband? \n\nFor some reason this stands out to me as something to seriously consider. FWIW or not from a random (lesbian) reddit stranger,",
            "Wow, I'm sorry to hear this update and for your loss. Thank you for being so kind and for being there for your friend. It couldn't have been easy.",
            "I'm so sorry for your loss. I'm further sorry that your friends suffering was complicated by people being stupid. You are a good person.",
            "I am so, so sorry for your loss. He sounds like an amazing person, as do you for everything you did for him. You could talk to his husband and tell him you’re really struggling right now. I’m sure he is too. Maybe being around each other will help you to both cope with the loss. \n\nTake comfort in knowing you were a tremendous friend and he very much loved you. Try to focus on and celebrate his memories. Go to some of his favorite places, speak openly to him, write him a letter, anything to help you deal with your grief and NOT fall into depression. He would not have wanted that for you love.\n\nLove and hugs to you friend.",
            "I missed your first post and I regret it. You are the farthest thing from a robot and failure. You are the hope I see for humanity. In this world where is seems no one cares you still do. I think you’re a unicorn!\n\nAs for next?  You grieve. Anyway you see fit and for as long as you need to. Just take care of yourself during the process. Remember to eat at least a little and get some sleep.   Try not to fall into bad choices. The day will come when you smile again and know that it’s ok. He’s smiling too.",
            "Very sorry for your loss, OP. I hadn’t seen your original post but just read it—you’re a good person. The world needs more people like you.",
            "You are the best kind of friend. My best friend from High School died from AIDS in 92. No one should have to struggle and die alone.\n\nGod bless you.",
            "I'm so so sorry for your loss. You did the right thing by spending time with him and just making him feel better. Next is what's going to be harder: moving on. Any of the methods you said can be used to that. You can befriend the husband.  Or do volunteer work. You could write. The post you actually wrote was beautifully written, and writing out your feelings (or \"mapping your journey\") goes a long way. And dont forget about yourself. Try to make yourself smile. Do things you normally love to do. I'm not a medical professional or anything, so I cant tell you how to prevent clinical depression or anything like that, but I know a lot of people, and I know how it feels to lose someone you love more than anything. I hope you feel better soon.",
            "I’m so sorry to hear about your friend’s passing. One of the hardest things I’ve had to encounter is watching someone wither away from the person they once used to be, something you’re describing here with the weight loss, vomiting and bed sores. It’s heartbreaking beyond belief to watch someone go through that and suffer at the same time. \n\nI know for me, it truly traumatized me and changed the way I viewed life. I really recommend doing some talk therapy with a professional to simply process it all. I watched my previous partner go through it nearly two years ago, and I’m watching my grampa currently go through it, and it haunts me from time to time. Be proactive with this, don’t wait to talk to someone. The sooner you deal with your feelings, the better.",
            "I am so sorry for your loss. But WTF, do people STILL associate HIV with homosexuality? Your fuckwit citizen should know that it is very much a heterosexual disease in Southern Africa, with the numbers of straight men and women with HIV being very similar. God's punishment my ass!",
            "The doctor that told you that you would not be able to develop a sense of apathy is just as wrong as the homophobes calling AIDS God’s punishment on homosexuals. You have shown yourself to have extreme empathy in way many people never will. You gave your friend comfort in the end. You also witnessed a horrible, body mutilating death that will take time for you to recover from. You can’t change the world, but don’t let the world change you. When you get your center back go out be the person that that speaks up when others say false things about AIDS and HIV so that more people will support its victims.",
            "I’m very sorry about your friend. \n\nYour writing is beautiful. I can feel the love between you and your friend through it. I hope you can take peace in the fact that you made a huge difference in this man’s life.",
            "I would like to offer you my condolences on the loss of your friend. You did a good thing in visiting him almost every weekday, and not being afraid or shaming him for illness. I know a lot of people who wouldn't be so good and kind. \n\nIt's ok to mourn him, the feeling of sadness never really leaves you. It becomes less immediate and all consuming. It's ok to cry if you need to.",
            "Sounds like he saw what was truly inside of you and was helping you learn how to live. \n\nSo live.",
            "Goodness that teared me up. I'm so sorry for your and the husband's loss. Take care of yourself, honor his love for you by loving yourself. You are worth it.",
            "I'm so sorry for your loss.",
            "I'm so sorry, but I'm glad you could be there for him. It's horrible that there's still this stigma.",
            "I'm sorry about your friend. You did an amazing thing for him though.",
            "I am so sorry for your loss. You are a kind and caring person and we need more people like you on the world. Grief counseling or a grief support group may be very helpful for you. Sharing your loss with others who feel similarly may help you process what you are going through. Thank you for your love and kindness u/hospital_throwawei.",
            "This is so rough. Just surrender. Let it wash over over you. I spent so many years struggling against grief and pain. I’d really bottle it up and try and distract myself. I finally learned to stop fighting and let myself feel. Rather than distracting myself? I let myself go through the pain. Some people are just worth grieving for. It’s the fastest way I’ve found peace.",
            "I am so sorry for the loss of your friend. I am in tears, it’s clear in both of your posts that you two shared a beautiful friendship ♥️",
            "My love and sympathies. You’re a wonderful friend. Keep that love and energy he inspired in you emanating from you like a beacon. The thing you need to do to get through this will come to you eventually, and you’ll know it when you see it. I was a kid when the AIDS epidemic hit, I remember the fear and grief that was all about. I’m sorry you’ve lost your dear friend to this horrible disease.",
            "I'm so sorry for your loss.\n\nPerhaps letting his husband know you're there, when he's ready, when you're ready, would be good for both of you. Having to hide the truth like this could be very isolating for both of you, and it's such a brutal, horrible truth. It was (as I understand it) very hard for the whole community to bear 30 years ago, I'm enraged on your behalf that you have to bear it alone now. \n\nHe sounds like he was beyond wonderful. Sending love and hugs to the Pillow Fort.",
            "I am so sorry to hear this.  I am happy you were so good to him when he was passing.  It sounds like you are doing well and grieving \"normally\" (although there is never one right way to do it).  Maybe it would be good to talk to a therapist or counselor to work through feelings and decompress after these events.  They can probably help you better choose what to do now.",
            "I'm so sorry for the loss of your friend. Sending you and everyone else involved lots of love and warmth. I am sure he knew that he was loved and he is free of pain now.\nI'm a Jewish lesbian. I know how evil homophobes are, and how quick they are to weaponize religion.\nHowever, in Judaism there is no hell. Especially not for good people like your friend was. He lived and loved, and because of that, heaven is a place for him. not for any vile homophobe. He is at peace, and he is not suffering anymore.\nAgain, I'm sending you a lot of warmth during this painful time.",
            "I can feel you pain through this screen and I am so sorry. I hope that you find peace and solace in time and know his suffering is over. So so sorry.",
            "I'm sorry to hear he passed.  Don't let yourself get caught up in how unfair this stigma is.  It's only going to make things worse for you.  Just focus on the fact that you lost a loved one and grieve appropriately.  Maybe one day his husband will tell everyone the truth.  However, it sounds like he died the way he lived -- privately -- and sometimes we can take comfort in that.",
            "I'm so sorry for your loss. He sounds like he was a beautiful person. Sending you and his husband good vibes.",
            "I'm really sorry for your loss. Accept my condolences. It might be a good idea to see a therapist. And please don't think of how to cope tomorrow,  take it one day at a time. I hope you heal soon.",
            "I’m sorry for your loss. You sound like a wonderful person and your friend knew how much you loved him. Take care.",
            "It sounds like he was an amazing person who touched a lot of people's lives. I'm sorry for your loss. I hope you have someone you can speak to about your grief.",
            "I am so very sorry for your loss.\n\nI also wanted to let you know that this was beautifully written.",
            "Thanks for being there for him. If I went through what your friend did I would want someone like you there for me. I’m very sorry for your loss.",
            "Your post brought tears to my eyes.\n\nI'm so sorry for your loss, but I'm so full of hope knowing even in the most repressive corners of the world there are people willing to be open minded, open hearted, and ready to care for those who are being ostracized.",
            "I'm so sorry for your loss and for the suffering of your friend..\n\nI have no doubt that the time you gave him and how you were there for him was a gift of immeasurable value, I hope you can someday believe that and take some comfort from it..\n\nI don't know his husband, but consider sharing this with him.. As someone grieving, knowing how much his ;ate husband meant to you and how cared for he was by you may also be a gift in a terrible time..\n\nGood luck, and please take care of yourself..",
            "🌺 I’m sorry, keep strong 🌺",
            "I'm so sorry for your loss. Thank you for being there for him, in my book you are now the coolest person ever. \n\n&#x200B;\n\nWhat happens now is that you hurt, and you cry, and you grieve. And after a while, you learn to live with the empty hole left by them. And after a while longer, you start filling the hole with his memories, and with his love. \n\n&#x200B;\n\nGive yourself time and give youself care.",
            "Your words about your friend are beautiful and made me cry. I'm sorry for your loss.",
            "Reading this post made me tear up. Hugs OP, I hope you know your friend cherished your friendship. I wish you the best in dealing with your grief",
            "What you did was truly wonderful, it's one of the only things on Reddit that's really touched me. \n\nLet his husband know you care, but you also need to be mindful of your own wellbeing. \n\nI work for a charity that helps young trans and male sex workers and the homeless, and as a charity we need people like you, the people I work for need people like you! I'm not saying go volunteer, but speaking positively about people with HIV is better than nothing. I fully understand why your friend and his partner chose to live a life of secrecy, but it's so saddening. \n\nWell done for being a wonderful human being!!!!! Don't ever forget that",
            "OP, I'm so, so sorry for your loss. You gave him the things too many people deny those visibly suffering from AIDS-- presence, love, and, most of all, touch.  With the advent of anti-retrovirals, so many people think that the AIDS crisis has passed. But it is still a horrific disease.\n\nYou are such a beautiful writer, maybe you should think about writing down the memories of  your friendship with him, a little at time. His partner might love to have a copy of that.   \n\nBe easy on yourself and don't worry about jumping into \"doing something\" right away. Also, don't be afraid to seek out help if your sadness becomes debilitating depression.",
            "I'm sorry for your loss.\n\n&#x200B;\n\nAnyone who knows the story, read this story, or saw you visiting someone such as your friend and everything you did, and still thinks you lack empathy is a jackass. You are a very selfless person, and one with an amazing amount of empathy and just being a good human being to your fellow man. Grief is horrible, but know that you made someone's last bit of time here memorable and worthwhile. Help yourself now OP, go talk to someone if you need to.",
            "There's not much I can say except that the story of you and your friend really, genuinely moved me and it takes a lot to do that. No one should have to suffer that way. On the one hand I want to cheer for him because he beat it for 30 odd years from a time when it was practically a death sentence, on the other hand I'm so sad that it still claimed him.\n\nYou are a good person and I am so genuinely sorry for your loss and that of your friends family.",
            "Post isn't narcissistic at all (especially by todays standards). Came here to say that you write beautifully, but while I am here best of luck and everything else to you. You seem like a beautiful soul",
            "This post is beautiful and not narcissistic and thank you for sharing. I have dealt with ASDs - my brother and aunt have Asperger's - and I don't find them lacking in empathy, just quirky and different. I love them to bits, and you deserve love too. It's understandable to mourn your friend, and I think reaching out to the husband is a fantastic idea, once you're up for it. But grief is tough. Seek a counselor if you need one, or even if you find you need one later. It's ok to find the grief continues even after you feel a bit better. It will go up and down. Thinking of you.",
            "You are a wonderful friend.   Why don’t you create a nonprofit that provides emotional support to people suffering with hiv?   Or if one exists already- go work for them.   You can create a career out of the experience if you want.",
            "I suspect you have more empathy in your little pinky than most humans do in their whole body. You are something special, don't ever doubt that. You have more light to give to many others in your lifetime, especially to those that need it most. 💙",
            "I'm so incredibly sorry for your loss. Seeing a loved one deteriorate physically is always shocking and heartbreaking. He was right, you were so good to him. He trusted you and confided his status to you, and you never broke that bond of trust. You were there for each other - he when you were lonely on campus, and you through his illness up until he cross the universe. \n\nYour experience made me think of a song from the musical \"Wicked\". The song is \"For Good\", I listed to it after I lost my cat I closely bonded with in January. He was young and it was unfair, but the song is beautiful and a tribute to a close bond between friends. If you do decide to listen, I advise waiting until you feel a little stronger emotionally. Also look into some form of grief counseling outside of his husband and social circle. Everyone grieves differently and those close to the loss can feel adverse to how others are grieving which can have negative impacts.",
            "He was so lucky to have a friend like you ❤",
            "I'm very sorry for your loss, and wanted to say I'm so happy you are getting past the trauma of having been led to believe you lacked the capacity for empathy.  From what I've read of what you've posted, you're a very caring individual no matter how you believe you present, and I am confident your friend recognized this capacity you have for love and empathy.  Wishing you the best :)",
            "I watched my brother die as a result of aids. Watching someone who used to be so strong and full of life, slowly wither away. It seems at the end they become childlike, with wonder and love for those who pushed through with them until the end. Death is not pretty, but there is something to be said about watching someone take their final journey, so filled with emotion and love that’s beautiful. At the end my once strong brother was a mere skeleton with skin stretched over, 68 lbs. I loved him. Thank you for being there in your friends time of need, thank you for showing love when others shrink away. AIDS has such a powerful stigma attached to it still to this day and that’s because it’s such a scary isolating disease. It’s so sad.",
            "I'm sorry. It is important to cherish the memories you have of him and always remember that he appreciated you being in his life and I would think that his husband appreciated your affection for him as well. Your post isn't narcissistic or lacking empathy, if anything it shows an abundance of it. Grief is an expression of empathy after all, and it sounds like your friend was a big part of your life. If you are on good terms with his husband, reach out and see if there is anything you can do.\nInfinite hugs friend",
            "This post alone shows you are capable of immense empathy. I know how hard it can be to convince yourself you are a good person, and what would strangers on the internet know - why would you believe them? But it's very clear from the way you worry - people who don't have empathy do not worry about things like this. The beautiful thing about a friendship like this is that it does change you. Befriending the husband is a great place to potentially start - you both know what an impact this person can make on a life, and aren't likely to forget soon.",
            "Well written! Please write a book on this, it can start or rather end with \"journaling\". Not to be selfish, but would love to read more about your relationship, seeing the impact it had on both of you, as well as on this platform. It might also serve as an outlet for your \"healing\" in whatever way you might see it. You are a beautiful person and did indubitably contribute positively to his life.\n\nI have been going through a lot lately. Sometimes l also question my capacity for empathy or my ability to be vulnerable with my loved ones, which has made it difficult to cultivate some of the new relationships (platonic) l had(ve). A while ago l met someone at a concert, had deep conversations, danced and ended up spending the whole  day with them. When we parted they repeatedly told me how nice, kind and genuine of a person l was, which made me uncomfortable as l struggle with receiving complements lol. They were relentless and l ended up taking these complements in and said \"thank you\". This person is in my city for a couple more months, and we've kept in touch. God knows l needed to hear that in that moment. You need to believe those kind words he said about you, you kept him \"alive\" in a way. I am sure you will make / are contributing positively to someone else's life nommatter how small. Sorry about your loss, it must be really tough. 😔",
            "\"Call me a sweet summer millennial child if you like, but it was the worst thing I've ever seen.\"\n\nIt doesn't matter what generation you're classed as. Death is death and it's hard as shit for anyone.\n\n&#x200B;\n\nCondolences.",
            "You are such a sweet and wonderful person. I was beside my grandmother last week when she passed (14 years of cancer) and it was hard. She went peacefully. I can only imagine the struggle of pain you are having. I am sending a big hug to you and please be kind to yourself. Grief pops up in unexpected places and there's no time table when it will be over. <3 <3 <3",
            "The world needs more people like you OP.",
            "It’s not often that something on Reddit makes me cry, but this made me bawl. You’re a good person. And he sounds like he was a good person too. I’m glad you had each other. Life is really fucking unfair.",
            "I like you. Keep being you. And maybe embody a little bit of your friend.",
            "So sorry for your loss. You are clearly a great friend.",
            "Please take away from this that so, so many people in internet land wish they could tell your friend that AIDS is nothing to hide. Reading the post, I wanted to badly so visit, send flowers, to do anything to show him that dying is scary enough, he doesn't need to die alone. \n\nI have watched someone die slowly of cancer. She was 80 pounds when she died. It changes how you view death. It's rest and a release from a body that is no longer serving as a good host. \n\nI would suggest contacting the hospital or local hospice about a bereavement group. \n\nI also suggest you heal some of the wrong you saw in the world by volunteering with an AIDS organization or seeing it there is a program with your hospital where you can visit people who don't get visitors. Visiting people without family in nursing homes is also helpful. \n\nIf it feels healing not traumatic, see if your local hospice center would let you come in and visit people. My friend used to go and play piano music on the piano in the main room. Reading aloud, or just sitting with someone can be great. Dying is scary. Waking up a lone in a room people can be disoriented, and having someone there with them to orient them is so valuable. \n\nMy friend died in hospice, and it was an amazing place that didn't tiptoe around death.",
            "You gave amazing gifts to one another and now have profound memories to treasure forever.  My condolences on your loss.",
            "your friend would be glad he brought you to that bright mirror. \n\nit’s ok to grieve. if you were really a sociopath, you wouldn’t be grieving. \n\nsorry for your loss. hold his memory close. and if his husband is amenable to friendship, start there. even if it’s just ‘hi, thinking of you’",
            "You are a special, wonderful person and I would literally hug the breath out of you if I could. \n\nI am so sorry for the loss of your dear friend, he is free from pain now. Let your heart be warmed to know that he knew you loved him.\n\nWhoever claimed you were unable to develop the capacity for empathy didn't know what they were talking about. \n\nYou are the kind of friend people who value friendship wish for and hope to be. \n\nLots of hugs to you ❤",
            "Your friendship seems as if it were a needed gift for you both. You showed your friend unconditional love, and loyalty through to the bitter end. Your friend showed you that what you had believed about yourself to be true for so long, was purely an antiquated grasping of people to understand a complex condition. Your post doesn’t seem narcissistic at all. It’s a beautiful story of how friendships change and save our lives, and the importance of human connection. I know you’re hurting, and it’s ok to be sad. Your friend sounds like he was worthy of your grief. If you can build a friendship like this once, chances are you can again. Take heart, and thank you for sharing. ❤️",
            "You're a good and kind person OP. Your friend was lucky to have you with him. There is someone else who needs your kindness right now, and that person is you. Do things that make your mind and body comfortable and peaceful during this time of grief. I'm sorry for your loss.",
            "Hey, OP, I'm autistic and I love you. Like, honestly, you're amazing. I'm sorry for your loss. I'm so sorry, it is the most awful thing I can possible imagine and I'm so sorry that your friend had to endure it and I'm so sorry that you had to witness the destruction of a human\n\nBut I'm so relieved that you found the words and the strength to write this up and post it. That I could read it and find it and understand that there are people my age, that are like me, that think the way I do and feel the way I do and write the way I do, and worry that deep down they're just a little shit like I do\n\nHe's right. You're so good to us.",
            "Oh your heart. Big hugs to you, I am so sorry for the loss of your friend. There is nothing worse that I can think of then seeing someone you love very much suffering and there is nothing that can be done about it. Please be good to yourself and seek support! Grief is a beast. <3",
            "I'm so sorry for your loss, OP. You're right tho, he's no longer suffering and that so important. I watched my uncle slowly succumb to AIDS when I was in my early teens and it was fucking devastating to watch him be in so much pain and discomfort. Know that gees watching over you and proud of you and all you do. ❤❤❤",
            "I can tell you have more empathy than a lot of people I met, and I don't even know you. You were a blessing to your friend and I'm sure he was so, so thankful to have you in his life. Reach out to his husband, nothing is more comforting in a time a grief than commiserating with other loved ones and sharing stories together about the person's life. I'm so sorry for your loss, and never let anyone tell you you aren't empathetic- your compassion and empathy were most definitely a great comfort to your friend in his last weeks.",
            "Thank you for being there for him. That honestly probably meant the absolute world to him - especially considering how adamant he was that no one else knew the truth, you were clearly one of the most important people in his life. He let you not just know what he had, but allowed you to see it all. I am so sad he felt he couldn’t tell anyone - I do not know anyone (or I’m not aware of) anyone with the disease, or admittedly even that knowledgeable about it and I would never think of any sort of stigma attached to it (although I know he grew up at a different time). \n\nReaching out to his husband may be good - you don’t have many who understand your loss and grief like he will. Maybe you would like to reach out to r/RandomActsofCards - so many of us would love to send you one I’m sure even if it only brings you a temporary smile <3\n\nGrief sucks because you don’t know what to do with it. And you never really figure it out you just learn to adapt with it being around. But allow yourself to grieve and do whatever you need to right now. Practice a lot of self care - see your doctor if you need to. \n\nPerhaps in the future you will want to contribute somehow to getting rid of the stigma surrounding HIV/AIDS and getting awareness out.",
            "Thank you so much for making this world a better place.\n\nSorry for your loss.",
            "I am so deeply sorry for your loss. I can only imagine what you have gone and are still going through. You did that man a great service, and he to you. I really have no words. \nThank you for being there for him. Thank you for your heart and kindness. Thank you for allowing him to help you, too. You did a beautiful thing that is far too rare: you showed genuine kindness and humanity. We need more people in the world who are of your nature. \n\nI wish I had concrete advice for you. Take care of yourself and work outward from there. You are resilient, and that will always show. Don't let this make you jaded, as hard as it might be.",
            "I'm so sorry for your loss.",
            "OP, I wish I could wrap you up in a big hug. Your presence in his life was just as impactful as his presence in yours. You are richer for having experienced that deep level of friendship and I'm sure your love and support was priceless to him. I wish you all the best, you're one of the good ones <3",
            "OP, I give my deepest condolences for you. It's very tough to lose a good friend. You need to remember, that you are not rotten. Everyone shows grief in various ways. Do what you need to do to heal, but I do suggest going to a grief counselor about it.",
            "Hey, it seems like you've given a lot of time and care into this whole situation. You are so appreciated in the world, please know that. I'd like to offer you time/ a letter/ some books or whatever it is I can spare and you'd like. Private message me, I'll sort a nice treat. You're a wonderful friend and person, and it's okay to be suffering over this loss.",
            "I'm sorry for your loss. You both are beautiful people.",
            "I'm so so sorry for your loss. You wrote & conveyed your feelings so beautifully that I'm crying feeling your pain. He was very lucky to have someone like you in his life & to feel your love at the end.",
            "All the internet hugs for you. <3",
            "I am so sorry. \n\nYour writing about your friend is truly beautiful. I hope you continue to write in commemoration of him, and beyond. You are a bright mirror, too.",
            "I read this subreddit a ton, but very few posts bring genuine tears of sympathy to my eyes. Sending you lots of love, my friend! \n\nAnd please keep writing!",
            "I read this update before reading your original post. Hon, you are an absolute angel. I'm sad his husband feel it's not safe or comfortable to discuss the real circumstances of his loving partner's death. As a 40+yo woman who grew up in the 80s, I thought we had moved passed this. But I live in a blue state in the Northeast. Your friend didn't have to die alone and feel shame. He had nothing to feel shame for.\n\nAs for you, I want to wrap you up in a blanket and snuggle with you on the sofa so you don't feel alone and depressed. You were a good friend. A great friend.",
            "This post isn’t narcissistic at all. You asked for help, and you let others know how your friend was doing afterwards. I hope you’re recovering from the trauma of losing your friend. You inspired me to reach out to an old friend who I had a similar relationship to once, so thank you.",
            "As a 35yo one year into widowhood, one of the things that has helped me the most is friends who were arguably my husband’s friends first, or closer with him, taking the time to continue to show up, to honestly tell me they are sad too, and to tell me stories or memories I might not know in as much detail. \n\nThe people who keep making an effort after the initial  weeks or months of condolences fade are treasures and it helps me so much to know they haven’t forgotten, and are still deeply affected and cared for my husband and still want to support me. Grief is very isolating. \n\nI can tell you really loved your friend and he had a huge positive influence on your life and I’m sure his husband would want to hear more about that. \n\nMy dearest friend is a godsend because I can comfortably cry in front of him and he’s not afraid of seeing grief. I can be honest. Your friend’s husband might need that even more if he has almost no one to talk about the illness with because it sounds like you are one of the only people with whom they felt safe telling the medical truth. \n\nAbsolutely befriend your friend’s husband if you can and if he seems to welcome it. And if you’re not sure about something, just bluntly ask if it is working for him, reminding him that you’re not going to be offended if he says he doesn’t want to talk or doesn’t want to see anyone right then.",
            "I’m so very sorry your friend has left us now, but you were so kind to visit him. I’ve spent a lot of time in the hospital, and during one stay, it looked like I wouldn’t make it (obviously I luckily did) and those who came to see me during that time meant everything to me and made all the difference. \n\nOh a more related note, from my time volunteering at the local AIDS resource center, I know how much of a difference just being there to support people can make. \n\n\nI can’t afford to buy you gold because I spend all my money in healthcare these days, but I want you to know that you’re a good person and did the right thing.",
            "This sounds really hard to deal with, and it’s really great that you’re trying and you’re there for him. ❤️",
            "I'm so sorry for your loss! And I don't know where you live but I'm so sorry AIDS has such stigma there. It sounds the like the *Angels in America* era. Awful.",
            "I'm sorry for your loss. Where do you live where it seems so backward and hateful?",
            "The sad reality is that people still think that HIV is only a gay thing.",
            "I’m so sorry for your loss. I’m rarely moved to comment but your post struck me to my core. I am weeping. I have no words to help you fill that void, but all I can say is your friend is right. You are so good. Bless you for keeping his secrets and making his last days comfortable and loving. There is no greater gift. Bless you. You are amazing.",
            "I think you, and the others, gave him the best last days any person could ask for. I don know how I would cope, maybe you don't either but it doesn't matter right now. Grieve all you need, but know that at least you made his death so so much easier! I know I would have been happy, even if in pain.\n<3<3",
            "As a woman with autism who has the same insecurity about my own moral fiber and fundamental goodness, I see you. You are good though.",
            "You write wonderfully.",
            "i'm also autistic and struggle with my empathy at times, not necessarily because i am incapable of it, but rather because i feel too much and have to compartmentalize it so i stop feeling it or because i simply don't relate, like i address the problem logically and thus have no problem where others address it emotionally and do have a problem. you're not broken. you're just wired a little differently, and that's perfectly fine. you see the world differently...just as everyone does. we just come with a whole ass label for our views.\n\nalso, i'm a bit curious about the raging homophobe? are you referring to the detective/preacher in knoxville? i'm close enough to him that he was on my news, but i'm in a major city so he was just a side story. my *favorite* part of that story? all the protestors out there, who far outnumbered him and his supporters, especially the woman who said, \"i just feel sorry for anyone who's heard his words and his message because that's not who jesus is. jesus is love.\" no matter where you are, there are people who support your friend's husband in his GAY grief. his husband died of AIDS complications, and that's real. being gay is still dangerous. end of. i'm queer myself. i understand reality. but if he can't even tell who he's friends with on facebook, he needs a new community. \n\nyou did everything you possibly could. it's time for you to grieve as best you can. you clearly are drowning in the feels. you're not broken. you're really, really fuckign sad because your friend died a long, miserable death. that is perfectly acceptable. be sad. grieve. go to a therapist if you can. start building the path to move on, and remember your friend in all your own friendships going forward.",
            "Why are you friends with a guy twice your age?"
        ]
    },
    {
        "post_id": "92ssov",
        "author": "amydsd",
        "title": "My [28/F] friend [41/F] announced she is getting married next week. I have reason to believe she is lying.",
        "url": "https://www.reddit.com/r/relationships/comments/92ssov/my_28f_friend_41f_announced_she_is_getting/",
        "score": 4273,
        "num_comments": 454,
        "created_utc": 1532844463.0,
        "selftext": "Wendy and I have been friends for several years. We used to live in the same city and see one another often. I knew she had a history of traumatic relationships and had hence decided not to date, but I also knew she had a pretty intense crush on a friend of a friend I had never met, James.\n\nWhen I moved to another state, we stayed in touch via phone calls. She told me that her feelings for James were becoming stronger, despite the fact that they had no contact. Soon, she began telling me that they were in love but his ex-girlfriend was preventing them from being together. Because these conversations became so odd, I stopped the calls and stepped away from the friendship. \n\nThis week, I visited my former city on an impromptu trip and met up with Wendy. She told me the exciting news that her and James were finally getting married after this ex had kept them apart so long. She showed me photos of a home he bought her, of horses he bought her, and of her in a wedding dress. She told me the name of the venue and invited me. Then she dropped the bombshell that James is apparently a millionaire. \n\nAll of this seemed off to me and when I got home, my concerns mounted. Her house was not packed despite the fact she is supposedly moving imminently. Money seems tight for her, she is living in relative squalor, if she has a millionaire fiance, why isn't he helping her? \n\nI did some digging. I found the house she showed me on Zillow, still for sale. I found the horses on a website for a local ranch that does tours. I called the venue and they told me they are unbooked on the supposed wedding date. All the available evidence tells me that she is not getting married. My gut tells me that her and James are not even in a relationship or have any contact. \n\nI don't know what to do next. Do I confront her? Do I warn James? Are these simply lies or are they delusions and the symptom of a serious mental illness? How do I help her?\n\nTLl;DR: My friend claims to be getting married, all evidence points to that being a lie or delusion. ",
        "permalink": "/r/relationships/comments/92ssov/my_28f_friend_41f_announced_she_is_getting/",
        "comments": [
            "My sister tells fantastic lies kind of like this. She's never invented a millionaire fiancé, but she has a whole story about how at age 14 she leapt into a flooded river to try to rescue a drowning kayaker, and another story about how she was doing sound for a famous band and in the middle of the show the lead singer stopped the show to talk about how beautiful she was.\n\nI guess what I'm saying is that, based on my experience with this kind of thing, the person telling the lies is not exactly delusional but more driven by a pathological need to impress other people and to portray their self and their life as better, the best, just so amazing. \n\nI suspect your friend is having a fairly bad time and really, really does not want to admit that she's single and poor.\n\nOf course I may be wrong and James may end up locked in her basement.",
            "Please do an update, I’m so intrigued about this. I used to date a guy who literally made up everything about himself, and I found out at the end that he was a wanted felon. ",
            "If you've never met him he almost assuredly doesn't exist. Your friend is either having some kind of mental health episode or is a pathological liar. You should probably make a small effort to find out which. ",
            "Oh man, a real life Morello from Orange is the new Black.",
            "If I had to guess, James will die in a tragic accident shortly before or after the wedding. That's just based on my experience with this sort of person, anyway. If you know any of her family, I would ask them about the wedding and then pass along the knowledge that she is unwell.\n\nI personally wouldn't bother confronting her, though. Pathological liars, which is probably all that's going on here, will just double down or come up with excuses. There's really no getting through to people who are THAT good at lying to themselves. Hopefully ther's not something even crazier than that going on here.",
            "There's honestly not a whole lot you can do, but if you have a method of contacting James, I think you should. For confirmation and possible warning. ",
            "Please keep us updated on this story, i have no advice but would love to hear what happens on the 'wedding day'",
            "I’m not sure how you would even go about this — but my grandmother went through the same thing when she was in a manic episode (bipolar). She created this whole fantasy where her and my grandpa divorced. “Paul” was going to whisk her away on a private helicopter to their new life. She packed her things and waited in the driveway for him to never to come. She went back inside “oh he will be here tomorrow”. I don’t know your friend, but as I was reading all I could think about was my grandmother. IF this is the case, try to visit with her on/around the day. Don’t feed the delusion, just ask questions to help them see the delusion.”can I see your wedding dress (day of)” “why haven’t you packed yet!” — good luck OP",
            "Could this be because she sees you as the winner in the relationship between you two? My thought is that she has become desperate to appear as a success to you. ",
            "Ohhhhh boy.   \n\n\nHow close are you with this \"friend\"? It sounds like you pulled away from her when you moved and are more of acquaintances now. If you know anyone who's close to her (a family member or mutual friends), I'd try to talk to them. \"Soooo, Wendy told me she's getting married next week. Have you heard anything about this?\" If you have any contact with the mutual friend that connects her to James (the friend of a friend you mentioned), reach out to them. Do you have any contact with James himself?  \n\n\nOtherwise, if there's no one you can reach out to, and if you're not prepared to call a wellness check on her, there isn't really much you can do.   \n",
            "Am I the only one here who thinks that James is obviously catfishing this friend of yours?\n\nHeres what will happen: something will go wrong right before the wedding, and he will be somehow stranded without cash. Your friend will have to forward him a couple of thousand to make bail/get tickets/etc. He promises he will be good for it because he is a millionaire after all, evidenced by all of his fake pics of which she showed you some.\n\nBe careful. Either she is a fake, or he is. Either way, she needs your help. If she is the fake then she is a disturbed person who needs help to be normal. If he is the fake, you better have some tissues ready.",
            "The only single piece I say isn’t proof is the Zillow thing.  We bought s house and Zillow listed it still as for sale for almost 9 months\n\nBut otherwise everyone else is right, either run for the hills and abandon her or get her help.",
            "Reach out to any mutual friends and ask if they have heard about anything. If no one else has heard anything about this (and still is friends with her) maybe it’s some odd way to try to impress you.  From the way this story had progressed though I’m assuming this is a mental health emergency. I would be worried about her safety and the safety of others. You also aren’t in a position to be the one coordinating everything that should be happening right now, and would need to find family or friends that live closer to help coordinate maybe. Maybe a call to a local-to-her hospital might have some ideas as well. ",
            "Is she being scammed? ",
            "Double check this James dude doesn't come up on some scammer website.\n\n...the 'ex girlfriend keeping us apart totally' makes me think erotomania or a dude with a girlfriend lying out of his ass though.\n\n> She told me that her feelings for James were becoming stronger, despite the fact that they had no contact. Soon, she began telling me that they were in love but his ex-girlfriend was preventing them from being together.\n\nLike, this is straight up something a person with erotomania would say, look up erotomania/de clarembaults syndrome.  Alternatively, she's just lying and escalated to even more grandiose shit because you stepped away.  I had a friend like that and because I was so fucking nonplussed at everything she kept going and going and going with the reveals that, in hindsight, made no sense.  A 'you're invited to wedding' is designed to be hard to ignore and merit a response.\n\nI'd confront her with the evidence *just in case* its' a scammer trying to leech her money.  If she's erotomanic the guy is potentially in danger, if he's scamming her she's at risk and needs a dose of \"the horses/houses aren't real\".  Once you figure out wtf is going on you're safe to just pull away - you're valid to just pull away and want nothing to do regardless.  You already dropped this friend and now she's trying to rope you back in with dramatics.  But yeah I'd personally confront her with the disrepancies (Painted as concern for \"hey I came across the house/horses online and think you might be being scammed, what's going on?\")and see how it goes.",
            "Reach out to mutual friends. \n\n\nIf none of them know anything, it's probably a lie to impress you after being apart for so long.\n\nIf they do know, see if any of them have met him, or are invited too. \n\n\nIf this is a wide spread lie, I'd be worried about her mental health, especially on the day in question. \n\nIt's very important you don't confront her about this, it could trigger a mental health issue that you're not equipped to deal with.\n\nI get why you're concerned, and you're right to be. \n\nThis could be a lie she knows she's telling, or one which she's delusional. \n\n\nJames may or may not be real. If he's real, he needs to know. It could become dangerous for him.",
            "I suffer from Bipolar Disorder, and during a manic episode I had a delusion that I was married to someone I barely knew.  This fantasy is called \"Erotomania\".   You friend Wendy could definitely have a serious mental health condition.  I would suggest contacting NAMI (do you live in the USA?)  maybe they can help you. ",
            "If James is a friend of a friend you should be able to find his contact info yes? Call him to say congratulations and ask if you can help with the wedding orpretend you want to plan a surprise gift for your friend and you need his help, whatever. That way he gets warned of the situation.\n\nI would want to know if I were him.",
            "After a toxic friendship of constant drama about made up things my tolerance for this nonsense is super low. Unless she’s going to hurt herself or somebody else just drop all contact, you guys aren’t friends anyway, why spend all this time getting involved? ",
            "Warn James if he is a real person. ",
            "Go to the wedding. Post an update. ",
            "My sister has borderline personality disorder, and one of the signs I've observed that she needs imminent help is that she pathologically lies. She has lied about our parents divorcing, our grandfather fighting for the Axis in WW2 (his entire family has been in America for generations, and he enlisted in the US Army but never left the States), her getting raped, and a homosexual relationship with a friend of hers, among other smaller lies.\n\nYour friend needs help, until she realizes she needs the help or hits rock bottom, you might want to distance yourself in order to protect your own mental health. ",
            "Just wait it out. Wait for the date and see how it plays out. Let things develop naturally and confront her when you feel like the moment is right.",
            "Does she have any family that you know of? You could tell them you are worried about her state of mind. ",
            "How much of her history regarding the divorce, trauma, relationships, etc do you know with reasonable certainty is true? I’m not saying she’s been lying to you for years, but this massive falsehood raises the question. If she’s actually had a long hx of trauma without good therapy to help her unpack emotions, then maybe she is having a breakdown/delusion. \n\nPlease, If you ever chose to confront her, DON’T do it in a secluded space or where any weapons are and be prepared for anything. I’m not saying she’s dangerous, impulsive, or violent. But having worked with many behavioral illnesses, i can say first hand you never know how people react when you confront their lies or delusions. \n\nIf you know any of her family or other close friends, maybe reach out to them to see if this is something they know about and go from there. If she seems a danger to herself that day, then find out where she’s at and call the local 911 so a safety check can be done. There’s just a lot about her and her history unknown, so I don’t know what else to say. ",
            "This may not be an illness, I've had friends who've made up elaborate likes just to appear cool so think before you do anything about this ",
            "James sounds like a Nigerian scammer",
            ">  She told me that her feelings for James were becoming stronger, despite the fact that they had no contact. Soon, she began telling me that they were in love but his ex-girlfriend was preventing them from being together. \n\nMy guess: his 'ex' is his current girlfriend, he is not and has never been in a relationship with your friend, and she's having quite serious mental problems. ",
            "Some commenters here have brought up that James might be a catfish, and while I don't think that's the case, it could be a good way to bring up the subject of the inconsistencies in the story with Wendy.\n\nWhat if, the next time you met up with Wendy, you mentioned that you had looked up this fantastic house she showed you out of curiosity, and found that it was still for sale? Basically you can play dumb and say that this confused you, and ask her if James isn't being totally honest with her about the house and horses and wedding etc etc.\n\nSadly from there it's on you to decide how you handle her reaction - is she an important enough friend to you that you feel the responsibility to confront her with her delusions? Or could you reach out to her friends or family and arrange some kind of intervention?",
            "She sounds delusional. My mom believed something very similar about the singer Richard Marx. Seriously, if you find out for sure it's not happening, do not confront her about it. In her mind this stuff may be real and there's no telling how she will react. ",
            "My experience with people who lie about things like this is very similar.  For some reason, they feel inadequate or embarrassed by themselves as they really are.  On some level, I think they believe they would endure mockery or just be unable to find people who accept them the way they are.  So, they conjure up stories to handle it with some of those stories being amazing and some being remarkably \"mundane\" to people who are around them (such as just going to a college when all their friends have gone to that college or achieving a certain career milestone when their friends are starting to accomplish the same).\n\nThey aren't delusional.  They're just so deeply insecure in how their life has turned out (possibly in comparison to those around them) that they think the truth would make them \"less than\" those around them.  People like that are constantly comparing their lives, even in miniscule ways, to those around them and thinking that they come up short instead of realizing that we all have our insecurities and compensations.  \n\nHer lies are pretty wild mostly because these are easily fact checked AND she gave you a date/time to be a viewer at the wedding.  What is she going to do if people actually show up?  Pay a guy to be James?  How long is this going to last?  She's willingly created this weird intersection in her storytelling where people will actually possibly \"interact\" head on with evidence of her lie (lack of wedding, lack of groom, lack of anything).  \n\nIf there IS a real James (not a groom, but someone she has built these fantasies around), then warn him for sure.  When liars involve real people into their lies, it comes crashing down rather quickly because the real person isn't willing to play a part in this game.  However, it might send her into a tailspin.  It's one thing to be a liar who thinks everyone believes the shit they're selling because everyone is too polite to say anything.  It's another to be a liar embarrasingly caught in the web of lies.\n",
            "Well, she invited you. Tell someone where you are and for how long, and go check it out.",
            "I would wait until you are out of the area, and then try contacting some of her mutual friends. See if they heard anything about this upcoming wedding. \n\nLet them know you are concerned because of the evidence you have found. Do you know her family at all? Perhaps get them involved as well.\n\nThis could be a simple thing where she is lying because she wants to feel special and is insecure she doesn't have much going on in her life. Or she truly does believe James is going to marry her. If it's the latter, then you need to let her family and friends know.\n\nThis could be a mental health issue and she may need some professional help. ",
            "You should invite them out to your house in the Hamptons ",
            "I would really like an update on how this pans out",
            "Why bother calling her out - the story goes *poof* after the wedding date, correct? It may be worthwhile to wait and reexamine the situation then.",
            "Does your friend have any history of mental illness that you're aware of?\n\nMy mom has bipolar disorder and one of the delusions she always has during every episode is that she has a new boyfriend or is getting married. Always, without fail, a man that doesn't exist enters our chaotic lives.\n\nAnother of her \"tells\" is when money becomes no object and she suddenly claims she has access to millions. She once tried to convince me to travel to NYC to help her spend her windfall that definitely didn't happen.\n\nI would contact a family member or close friend if you know of any. See if the wedding is real or a farce. Walk away if it's real; Tell them what you know if it's a farce, and encourage someone to help her seek medical attention.",
            "Op, we’re definitely going to need an update on this one. ",
            "My wife had a friend like this.  It was always the same setup, too, like she couldn't make up a better story.  It was always this:\n\n1. She is dating a military guy, LDR.  She always had a photo of him in his dress uniform.  He was always on tour of duty, stationed far away.\n2. She would ask my wife to take \"boudoir shots\" of her for her boyfriend.  Nothing more than PG-13 rated, though.\n3. The relationship with LDR military boyfriend would get rocky.  Much weeping.\n4. He'd visit her in person, but either it got canceled at the last minute or he'd come and go in a day that my wife would be told about later.  My wife never once met one of these \"boyfriends\" in person.\n5. If he visited her, she always got pregnant.\n6. She always miscarried/lost the baby\n7. They always broke up.  Much weeping.\n\nMaybe a year would go by, and it was the *same story* with a \"different\" guy.  This happened 4 times when my wife was a teenager (her friend was about 10 years older, and lived in a trailer in a small town nowhere near a military base, the nearest was a 2-3 hour drive away through mountains) and then one more time when they ran into one another as adults.  The final time, my wife did not go on with it to step 2, just felt really sad for her, because at that point, her friend was in her late 40s and never had a boyfriend anyone ever saw.",
            "A friend of mind is going through something weirdly similar. However, I interpreted all of the signs differently. I think the guy is leading her on. I think he’s telling her all this stuff, sending photos of everything and building up their future together, but will suddenly find a reason to back out last minute and she’ll be heartbroken.\n\nMy friend is over the moon excited about how great this guy is despite dozens of red flags. Could your friend be in a similar position?\n\nIf so, I’m trying to make sure my friend knows that she has somewhere to turn if everything falls through. I don’t want her to feel isolated or embarrassed if things go wrong.\n\nI would be cautiously supportive until you find out who is the one lying... if she’s being catfished or misled, she’ll need friends when reality strikes.",
            "My daughter does this. She's 22 & constantly tells me ridiculous crap  about her rap career. Last month she had been signed with Illuminati & how by the end of the year she'll be a millionaire. \nWhen she was in 3rd grade she told her teacher I was pregnant with twins. I've no other kids. Its endless with the lies & sadly I can't believe shit she says. ",
            "I once worked with a girl who told me she was dating Michael Hutchence. Her coworkers even said they met him. I always \"just missed him\". She would invite me out with them when I was already home in bed, saying the band (!)  was there at her apartment.\n\nI NEVER believed her and honestly wondered if it was some guy pretending to be him or if she was just a total liar. I never found out.\n\nYour friend is obviously delusional. Perhaps just embarrassed? Maybe she believes her lies and maybe not.\n\nYour friend has made up a story that makes her feel good.  You can call her on it-\"when am I going to meet your fiancee?\" or just humor her \"Wow, good for you\" or be honest \"Hey I wish you the best, even if this does not work out\".\n\nDoes this James even exist?????????????",
            "Wait so you saw her in person, she talks about the wedding and her fiance but doesnt show you the engagement ring?? ",
            "Could she be getting catfished?",
            "Confronting her has no logical benefit.  Especially if this is some mental break confronting get is only going to accelerate a crash.\n\nI would reach out to any known family or a local health and wellness professional and see if there is any way of getting somebody involved that has experience and credentials to navigate this.\n\nIf I were you I'd just slip slowly into the background and stay clear of whatever is going on.",
            "Uhhh...this is a story from Orange is the New Black.",
            "I have a friend who is currently having some major delusions. She believes there is a massive conspiracy against her when the reality is that (among other things) she had a violent criminal living in the same house as her young daughter which resulted in a police raid and the loss of her kid. It is an incredibly tragic situation but a lifetime of drug abuse has its consequences. \n\nThis is part of what I sent her after she kept trying to get me to help her go after the police and the government. \n\n> I know this is not something you are ready to accept right now, and I understand if you are angry with me for saying this, but you are currently experiencing delusions and are not perceiving things as they exist. This is nothing to be ashamed of, but you need help if you are going to get better. \n> \n> When you realize this, even if only a little bit, please remember this message and call me. I will help you however I can and we can get you the help you need. I know this is not the kind of help you want right now, but it will still be there when you do. \n> \n> I care about you and want to see you recover.",
            "If you have any way to reach out to her family and locally-located friends, you should let them know she might be in serious need of mental health help. She might escalate and put the man's life in danger, or the man's \"evil ex\" (probably his real partner).",
            "She seems unwell. It would be nice to try and get her some help.\n\nIt would be wise to get as far away from her as possible, then go quite a bit farther away.",
            "I'd be worried if she's living \"squalor\" it means she isn't working (?)  Does she normally not work or on disability assistance? Do you think he could be taking drugs I find my friends in the past have these deluded ideas and fantasies of training for the MMA or just really unrealistic goals of grandeur for a person in their situation and if it's not drugs it could be a mental illness that had to finally shows itself, though a little late to the party but not by much she's 28. Honestly, if you can contact family or perhaps research what you can do for her to see someone, soon.",
            "This story reminds me of Lorna's backstory on Orange Is The New Black. \n\nI hope that your friend doesn't end up stalking James.\n\nIt sounds like she is mentally ill. Almost like a form of Munchausen Syndrome, except she's seeking attention for something positive (a wedding) rather than something negative (illness, typically).  ",
            "This sounds exactly like that one character on orange in the new black who pretends to have a fiancé and plans her wedding constantly only to find out he’s married to someone else and she’s been stalking him for years even from prison.\n\n\nSo yeah maybe check out that basement, but we both know it’s most likely a delusional stalker situations. Both seem like they should be addressed",
            "This might get buried but I had a friend who began telling stories that seemed plausible but eventually got more and more outragious. Sadly it turned out that she had a debilitating mental illness and she ended up committing suicide years later. If you care for your friend maybe get in contact with her immidiate family and ask them to check up on her.",
            "She sounds like a bunny boiler. Does she have family you can contact to check on her and get her evaluated?",
            "That's a big \"Yikes\" from me dawg.",
            "Why is no one saying you should report this? You have good reason to believe she is not well. She is heading to a crisis of one sort or another. Either she will self-harm or really go off into a delusion after the 'wedding' or else James and whomever he may be involved with could potentially be in danger. \n\nIf you are in the US, I suggest calling the local police non-emergency line. Explain that you concerns about the  mental health of someone and give details and just that you are pretty worried. They may ignore you, they  may hopefully do a wellness check and keep an eye on her. If things get really bad, and they ignore it, you can call Adult Protective Services, or you can google your local Mental Health mobile response unit, which can go to people's homes and do a quick evaluation and force treatment at a lower criteria than police can use. \n\nI'm sorry so many people here are getting popcorn ready in anticipation of the drama. This sounds like a bad situation for your friend. You unfortunately have few options to help. ",
            "Kind of hoping she’s lying for whatever reason. Otherwise, it sounds like she’s stalking James, or that James is setting her up for something.\nAlso, James’ “ex” may actually be his current gf & needs to be warned & protected.\n\nI’d reach out to those closest to her, if you don’t know them, try to find them through her FB page or her family.\n\nHer trying on a wedding dress is so sad & deeply troubling.\nThis is a lousy position to be in, but I think you do need to let other people know & get your friend a support system ready.",
            "Your friend is mentally ill and their delusions are affecting the people around them (namely, you- but you are probably not the only person she is telling this lie to), and it's especially problematic because she is involving another person in this charade without their knowledge or consent.  \n\n\nShe needs to get help, and if you are not close enough to her to have that conversation, I would suggest maybe reaching out to her family and expressing your concern.",
            "At first I thought it was just harmless lies to try and impress OP, but now I'm not sure... It takes a lot of foresight to have pictures of a house /horses /wedding venue /dress on your phone ready to go. Maybe she really is obsessed with this guy. If I was OP I'd send a message to the mutual friend with James to be like \"just saw Wendy, what's up with all the James stuff\". Maybe he already knows and is dealing with it in his own way, but if not this would be a good way to raise a flag on this issue. ",
            " Show up to the wedding.  Bring a bag of popcorn.  ",
            "Find ways to compliment things about herself that are true. She is having such a hard time being happy with what she has and who she is that she's inventing a life she can respect. If you start showing respect for her true reality, it may help ground her a little bit.\n\nThere are times she's fully aware of how bad her life is and any way you can show admiration for something true will be something she will think back on. Show boredom and disinterest when she's lying, and initiate conversation about things you can show appreciation for. \"Shelly, I love that tamale recipe of yours. Can you send it to me?\" or \"Remember that time we got lost on the way to the concert? You kept such a level head and made me feel safe.\" Get her to talk about things she doesn't feel she has to lie about. What are her opinions on news or music? If she brings up James, just say, \"Yeah, but I'm more interested in what YOU think!\"\n\nWithout a lot of contact between you two and willingness to change on her end, she'll keep going more and more into delusion. You don't have to contribute, but just be a little reality anchor each time you interact with her.",
            "You should warn James. His “ex” girlfriend is in danger. ",
            "Man, I would love an update on this if you ever get one!",
            ">I guess what I'm saying is that, based on my experience with this kind of thing, the person telling the lies is not exactly delusional but more driven by a pathological need to impress other people and to portray their self and their life as better, the best, just so amazing.\n\nI had two friends like this back in elementary school/early high school. One invented a boyfriend (she had his photo because he was the son of family friends of her parents) and that lie went on for months to the point that she'd claim he was \"hiding in her basement\" after I visited her (\"didn't you hear him knocking on the pipes??\" - seriously) and he'd buy her gifts and send her flowers. Another friend once claimed that someone raped her in the back seat of her car outside her place of employment. I also knew a girl from university who told me that she had an abortion and that the doctor let her, and I quote, \"hold the embryo after it was sucked from her body so she could say goodbye\". I swear to God.\n\nYour friend seems incredibly sad. I am sure others are going to suggest a way to help her but honestly, I suggest getting the hell away from her and letting her ride out this pathetic fantasy on her own. Don't get sucked into the crazy. No good can come of it.",
            "OP do you know for sure that James is a real guy? Do you know anyone other than Wendy who knows him?\n\nI’m leaning towards her being catfished, if she’s gone so far as to invite you to the wedding. Maybe she is delusional and has made it all up. Who knows.\n\nAsk her if she’s ever sent him money. ",
            "Is there no picture where James and Wendy are in together? Generelly every happy couple is shooting so many pictures or videos ( selfys ) anywhere they go or do things together. Doesn't Wendy do that ? ",
            "Do you know that James is real?  Is Wendy friends with him on Facebook, or does he have other public social media?  You could look at his page and see if he's made any posts about a wedding.\n\nI'd also reach out to Wendy's closer friends and/or family and ask about the wedding.  If this is a mental health crisis, they will be in a better position to help Wendy than you are.  If you don't have their contact info, again, you could try to get it through Facebook.",
            "A long time ago, I read a book that helped launch my career and my life to the level I'm at today. One of the things this book said was \"to remove all things and all people from your life that do not add value\". \n\nThis is such a simple problem to solve. Over the next few weeks/months make yourself less available to this women until such time as you've just totally disengaged from the relationship.\n\nYou can't fix her. But you can fix yourself. Eliminate all things and all people from your life that do not add value, starting right now.",
            "I think you can help her by saying ,\"that's wonderful\". \n\nI know, I know...Most likely, she's playing make believe, but unless it's hurting someone, I'd say just let her play pretend.\n\nOver the years, I've realized that ALL of my girl-friends (I'm a female as well) have *something* that they embellish, or are a little delusional about, and I've come to the conclusion that it's best to be the type of person and friend who understands which embellishments it's good to call them out on (gently) and which ones you know that they won't ever give up on, or tell the *reality based* truth about. So, I just feel like if it's not hurting anyone...just let her have her little fantasy life.\n\nOr, you can tell her, \"you're poor, alone, and living in squalor\". I mean, what's the worst case, here? She's photoshopping stuff and saying it's hers? She's trying on wedding dresses alone? \n\nNow, if it turns into her asking you to be a bridesmaid and putting up money for the dress and travel, etc. THEN, you'll have to quash it. Until then, though, I'd just say, \"that's nice, hun...I'm happy for you\".\n\nEdit; added- I'm reading some responses and I'd tread lightly in regards to telling family or friends that she's mentally ill, or alerting others to this situation. There's no evidence of her stalking him, right? I'm under the impression that her photos are all of things that's she's doing alone (trying on dresses), or from her home (pictures horses, house).\nI'm not getting a scary/stalkerish vibe, just more juvenile, immature than anything",
            "It's just a fantasy she wants it to be true so she think it was real",
            "I knew a guy who was a compulsive liar in college -- mostly about his parents' careers and family wealth. \n\nThis sounds more serious and like a delusion rather than insecurity to impress some acquaintances (college friend eventually confessed to making things up and he's doing well many years later -- he didn't *believe* what he was telling people.) \n\nIn this case, I would be concerned that she's stalking this guy and would be tempted to reach out to him to let him know what she's saying. On the other hand, this may be a fantasy she's only told you about, not something that affects him or anyone else. Is she posting this stuff on her social media? Is she actually inviting people to this wedding? I suspect she'll probably have an excuse for why it doesn't happen (a made up dramatic breakup or tragedy.)\n\nI honestly don't have great advice. I know another person who had similar delusions (I think she is bipolar) and her parents were aware of the things she'd do and say, but she was an adult living independently. She did call up a professor of another friend and make up some strange things, but the friend let people know that she was troubled so nothing really came of that. \n\nDo you know your friend's parents or siblings? I guess my concern would be that they're not aware she may need some help or may not be taking medication. \n\nShe could just be lying to impress you like the guy in college, but since you say this is ongoing and \"odd,\" it seems as if she could use some support from people close to her like family. ",
            "well it will be easy enough to verify next week.  for now, let her have her fantasy that she tells you, and when you see that she doesnt get married next week, then you can cut her out of your life if you feel this was a strange thing or strange person to be involved in or involved with.\n",
            "Tell him anonymously - Id want a heads up if crazy was possibly around the corner.  ",
            "Sounds like Histrionic Personality Disorder to me. People who do and say things to put attention on themselves. You just need to keep doing what you’re doing and walk away. ",
            "Do you know James to be able to warn him? Is there any way to contact him? Are you ready to break off that friendship entirely?",
            "Does anyone \"simply lie\" about getting married? She sounds like a nightmare.",
            "You know.... I read some of the comments and I’m gonna go the opposite way here. \n\nThis woman needs help. While it’s healthier of her to make up delusions of a lavish life and taboo love than it would be to say... make up delusions of suicide attempts and living in utter despair, I think at her age a person should to be able to realistically distinguish fantasy from reality. At her age - at YOUR age - as we mature we tend to keep those fantasies to ourselves or share them in “what if” or “wouldn’t it be great if” contexts. We don’t actually play them off as reality. We know that behavior is irrational and affects our peers’ views of us. \n\nWhat does your gut tell you? Does she think you’re gullible or do you think she needs help? I wouldn’t say CONFRONTATION is the thing to do here.. but I think she may need a friend right now who can push her to make the right choices (you know, seek medical help or stop making up lies). Whether you want to take this up as your responsibility is up to you. It could be something simple, it could be something detrimental with her. Do what you think is right. ",
            "This sounds like the guy my former coworker dated/\"married\". The guy went by James but apparently his real name was Auby. Also claimed to be a millionaire. We think that he has some sort of mental disorder.. We don't know about the coworker, but I think that eventually they broke up. It was hard for her to find anyone, let alone someone who would help her through a pregnancy (not his)...",
            "Could your friend be suffering from a mental disability? Maybe reach out to a family member or mutual friend and see if they have noticed any changes with her. My friend started behaving bizarrely a couple years ago. Extravagant lies, deppression, not in touch with reality etc...and ended up she had bipolar and schizophrenia. And as she got older it progressed untreated. ",
            "Wendy sounds like she is suffering from a mental illness of some kind. Please don't confront her with anger or judgement - she needs help. \n\nDoes she have any family or friends who can help find her support? Seeing a psychiatrist would be great if possible.",
            "Honestly don’t think it’s your business. Don’t confront her. If you don’t want to be her friend you don’t have to be. But confronting her will do nothing. ",
            "This is happened to me or is happening to me at the time. We’ve (33f, 34f) been friends on and off since middle school. On and off because we both went to different high schools and colleges. She’s been through a lot. Family drama, pursuing a PhD, consistently having no money, and having boys use her. We got into a minor argument, which both of us share fault but was definitely exacerbated by her insecurity. (Group of friends went out to bar. After a while a few of us went to use the restroom. There was a long line then after that stopped on our way out to the bar. I underestimated the time that I left her alone and she was upset that I’d left her by herself)\n\nWe stop talking for a year then reconnect in May to tell me that she’s in a relationship and that last a few days prior he proposed. She wanted to tell me ahead of time because a Facebook post is imminent. \n\nI haven’t seen any pics of her and this dude or reference to him, not in her account or her familiy’s account, idk \n\nFunny thing, since then the bf and I actually got engaged and then eloped. ",
            "The term for folks like this is pathological liars. Knew this guy from the gym that constantly talked about how many business dealings he had making tons of money and constant name dropper. Finally has enough of his bloviating  ways and asked him to prove it and show me. Never heard from him again. Saw him get into this pos busted old model Durango. \n\nPathological liars are not worth your time. Don’t waste your precious time listening to their delusional reality. ",
            "Turn up to the 'wedding'. When no one is there, call her and ask what's going on. She will have to explain herself then. ",
            "She just needs shit to post on Facebook and Instagram. ",
            "I had a buddy who was a pathological liar when we were in kids.  He was the center of our social circle for a long time. It all came crashing down late in high school and a lot if that core group just stopped talking to him one day.  Nobody was really intentionally ignoring him, but talking to him about anything important seemed like a waste of time?\n\nAt one point, we ended up at a party at his home which I think a lot of the old gang attended out of a sense of obligation.  A handful of us left the main party space to get some drinks and snacks and overheard the guy's mom talking to his girlfriend about the councilor he was seeing for it, how it was a pathological thing and he couldn't really control it, etc.\n\nBottom line, OP: your friend might actually need serious help.  This all sounds very similar to the situation that blew up on my friend -- he had a few interesting people in his life who turned out of be wholly invented, they started emailing is, it was a mess.\n\nIf you aren't close enough to her that you feel like you should intervene, maybe reach out to someone who is?  Good luck",
            "Have you talked to this friend of James?",
            "I've got old friend that's married to a famous guy but they keep it secret for some reason. Her husband has a restraining order and if she shows up at one of his shows all of security knows what to do.\n\nIf this James guy exists, he deserves to know that he is being stalked.",
            "She may be a liar because she is unhappy with her life and probably see you and other friends finding true happiness. You can't try to confront her and say \"you're lying to me\" and go on the attack. This friend of yours probably wants someone to step in and say \"everything is going to be okay\". Take the high road as a friend.\nIt does not benefit anyone but her with this lies if indeed they are. If she is lying she still does not have a great house or millionaire boyfriend. You can confront her but what will it solve? You being right?",
            "Show up for the wedding! She invited you right? But seriously after two weeks either something will have happened (wedding called off) or.... I don’t even know. That person set her self up big time. Gonna be hard to dig outta that hole. ",
            "She sounds delusional. Like, does this man exist? Would she kidnap or hurt him?",
            "lots of the replies here are saying she's just a liar, but based on my personal experiences, i'm more inclined to say she's delusional and she needs professional help.",
            "Your friend sounds like she has some mental health issues. Possibly bipolar, schizophrenic or boderline personality disorder.\n\nThere is a difference between compulsive lying (lying about things that dont really matter for no reson. \"I delivered a baby in an elevator while drowning and then i had to the save mom.\" and pathilogical (lying for a motive and reason \"ted of course i paid you back the 50 bucks i owe you. You were just to drunk to remember).\n\nUsually when its that delusional outlandish lying, there is a whole set of mental health issues combined. The living in squalor and stealing internet pictures are also hints at delusional/hallucinations/hysteria is another big one. \n\nSorry but i would contact her family, maybe they know what to do.",
            "My ex-boyfriend was a pathological liar, he could make you believe the blue sky was actually green.     He constantly made up stories for attention.  I got away from him, sadly his short life wasn’t a very happy one.",
            "I wonder if she's stalking or cat fishing James, maybe she does have contact with him but only online. The rest is some pretty deep lying, I dunno what to tell you besides you made a good choice stepping back from the friendship. I might try to find out who James is and if he's safe before leaving again. ",
            "Something similar happened with a former colleague of mine. She showed off an engagement ring (turns out she bought it herself) and talked about imminent plans to marry. She ended up having a psychotic break and landed in the hospital.",
            "Why do anything? At this point, this is a non-issue.",
            "Narcissistic behaviour, I have relatives and friends with these symptoms they do not take kindly to being corrected, most say to run. \n\nThey believe in their imaginary world almost like if it was reality. \n\nWe correct our friends but we have decades knowing each other and it is still tough for them. ",
            "Who cares? It sounds like you’ve already moved on so just let that friendship fizzle out entirely. ",
            "She's probably lying, but what does it matter to you? She's not really your friend anymore. Is it that you're concerned for her well-being? ",
            "Phew. At least I'm not the only one who feels like telling the truth about her life to others will be a let-down! In all seriousness though, can you not just ask to add James on Facebook so you can congratulate him? Or ask another friend to hook you up with him and check his side of the story? It would suck if you had to tell him she was making stories up and he told her off for it, but if that's what's happening she needs to get a wake up call from someone and he presumably deserved to be warned. Maybe she's stalking the man and this is evidence he could use to get a restraining order. Or maybe she lives on the other side of the country and is no real threat at all. Either way, allowing her to nurture these lies (if that's what they are) is far less healthy than facing them.",
            "It sounds like your friend may have a mental illness. She might not be lying in the sense that she knows it's not true - is it possible these are delusions she's having? Do you know what supports she has? ",
            "If you're worried that she's having a mental break, you could send a quick note to one of Wendy's close friends of family and say, \"Hey, Wendy tells me she's getting married next week, but it really doesn't seem like that's true?  Do you know if she's okay?\"",
            "From the few people I've known like this I can tell you there's basically 3 options. Ignore/play along, which is what you've been doing and what many people do. It's the easiest, but doesn't help either side. Cut contact, easier for you but doesn't help them. \n\nFinally, confrontation. Honestly though, this usually doesn't work. Many people with this issue will respond to confrontation with either anger or more lies, sometimes both. Though, every so often, calling them out is enough to get them back on the right path. \n\nHad a friend like this, who was otherwise a wonderful person, but lied all the time about the weirdest stuff. Finally we couldn't take it anymore and sat her down saying, \"You don't need to lie for us to be friends with you. We like you just how you are, and if anything the lies will be what pushes us away. We know (specific story) didn't happen, and you spreading it around is hurting (person involved in story).\" At first she denied, came up with different lies, got a bit pissy. Then we showed her all the proof and she finally gave up. We'll catch her exaggerating every so often now, but it's pretty easy to remind her.\n \nThat story is very uncommon with liars, I think us having undeniable proof was the only reason it worked. I'd still be very careful, but since you do have proof (the pictures you found), the option is available for you. \n\nThen again someone I knew posted ultrasound pictures, I sent her the link she got it offline from. She blocked me, though the guy she said was the father didn't, so I sent it to him. Totally destroyed any friendship I had with the girl but was worth it to save the guy. ",
            "Your friend sounds like she's delusional. The \"ex girlfriend\" is probably the actual girlfriend and she's dreamed up this whole relationship.",
            "The kind of extravagant lies she's telling point to overcompensating for intense feelings of failure or feelings of fear that she on her own is not interesting enough to be friends with, so she's fabricating this stuff to keep you interested in being her friend. \n\nIf you really want to help her and really care about her a lot, you could gently tell her \"You know, sometimes our lives don't turn out exactly how we hoped, and we worry that others judge us a lot for that. I just want you to know that I love you and care about you regardless of success or failure in your life. I hope you know that you can tell me the truth about things, I'll be there for you.\" - don't push her about \"the truth\" and don't call her out on her lies either, that could shame her a great deal. \n\nDon't feed them either, by asking a lot of questions or giving her a lot of praise for them. Just be nonchalant and change the subject to pull her away from them \"That's great, anyway what have you been watching on Netflix lately?\" get her to focus on mundane things, so she realizes slowly that you're interested in her as a person, and that's where her value is, not on the extravagant \"exciting\" things in her life.  \n\n\nPeople who tell lies like this are desperate for attention and usually afraid they're not interesting enough to have friends just on their own. So you could reassure her and give her attention just for her. Keep telling her you enjoy her company and reinforce praising her talking about non-lie things, the minute you get the feeling her topic of conversation is straying into fake territory, redirect it to something else.",
            "Omg love all this drama",
            "She even invited you to the wedding which leads me to believe\n\nOk so either she's telling the truth or more likely based on what you're telling me - she's going to drop a bombshell that James has left her for the ex or some wildly unbelievable story like that he was murdered or something just before the wedding. I've known people sort of like this but not quite this extreme. They make up constant little lies all the time for attention. \n\nIF you know James at all call and congratulate him on the upcoming wedding.. see what he says and go from there. ",
            "This could be a mental health issue, and she could be having a delusion that she is in a relationship. I would keep an eye on her because if she develops any (more) psychotic symptoms it could become unsafe. Is she taking care of herself physically? Showering, eating?",
            "The question is whether Wendy is lying or being lied to. You've heard from a lot of people who've had experience with pathological liars, but I haven't found any posts from people claiming the title themselves.\n\nHi.\n\nI used to be the kind of person you suspect Wendy is. I would lie all the time, sometimes about little, stupid things and sometimes about big, important things and I can just about guarantee that if Wendy is 41 and this deep into a fabrication, this is likely not her first whopper. \n\nIn the years you were friends did you notice a pattern of drama? Were there always emergencies or important things going on in her life? If so,though not conclusive it would be a point in favor of this being a fabrication of hers. It's also possible that she's become obsessed with James over the years, in which case he should be gently tipped off because taking photos of yourself in a wedding dress to prepare for the imaginary wedding to your  years-long crush is a level of disturbed that I never achieved, and even as a (recovered) liar that worries me. \n\nI would say go ahead and go to the wedding, just to see what is up. If it's all in her head she'll have an excuse already planned out, if she's being set up for something then she'll be devastated (and most likely a transfer of cash from her to him will be involved). \n\nIf she's telling stories my next step would be to contact James. Normally I wouldn't advocate getting involved in a pathological liar's web because it really does no good, but again, the level of obsession she's displayed over several years is concerning (I could never invest in a lie that long). ",
            "She's either a massive liar or mentally ill.  I used to have a neighbour that said the same sort of things. She was actually a princess of some obscure country that know one has ever heard of but living here in hiding because of some incident, but her wealthy husband is coming back for her. \n\nHonestly I would just leave it, there's probably nothing you can do to help. Maybe notify her family if she has anyone.",
            "If you’ve never known her to lie like that before it sounds like some sort of hypomanic episode. ",
            "Lies or delusions... either way she needs therapy",
            "I've experienced something like that before when a person comes up with a narrative they wish was true. They aren't necessarily delusional, but like someone else posted, she is desperate for someone to believe she has good things happening. If you know anyone in her family, it might not be a bad idea to reach out, butt if you speak to her, personally, don't confront her alone. She's probably not harming anyone, and the guy she's been talking about for years might not even exist. ",
            "I had a friend who would make up grand stories like this in highschool. She \"got stabbed in a mugging and they took her phone\" but she showed up to school the next day. Tried to make us all believe she had a secret sister that no one in her family knew about. Very puzzling at the time but after studying 4 years of psychology, I find this consistent with certain personality disorders, particularly the Histrionic kind. It's difficult to go about this, but they should seek professional help if things like this affect their work and relationships. You could suggest that during a sit down with them. Confrontation is tricky because you can't predict how it will go, but it is up to you. Make sure your intentions are not out of anger for lying but rather to help her. Also maybe tell James, since it does concern him in a serious way, but after you have sought some more information from your friend. ",
            "Had a friend like that, he would make tall claims that made no sense and everyone knew were lies. \nAt the start everyone thought it was just due to low self esteem and wanting to look better , but as time progressed they kept going on and getting more ridiculous. He wouldve had two girls hitting on him even tho he was obese, he would tell tales on how he threw some guy into a river for picking on another guy, he wouldve been offered a rare comic book worth millions by some old lady and refuse it due to the kindness of his heart. \nThe thing with people like that is that they dont get better. Theyll keep escalating and escalating and eventually theyll be telling people tales about how you were hitting on them but they refused to bang you and how they are specialists at literally everything you do.\n\nYou are going to stop respecting her as a person as things keep escalating, so its probably better to have a heart to heart to her if you care about her. \nNon confronting them leads to the escalation.",
            "This just makes me so sad. Poor Wendy. Maybe give her an \"out\" to admit she's not really getting married? Just be there for her and perhaps strongly hint that if she needs to tell you something, you'll be there. ",
            "I have had both personal and professional experiences with this, and my feeling is that you should challenge yourself to imagine just how bad, how lonely, and how desperate a person must be to develop these kinds of stories and lies. It doesn't sound like a delusion to me because she had to consciously come up with these photos, etc. It sounds more like she is in a bad place and developing these fantasies for herself and others is a way of coping. I personally would caution against confronting her because I don't think any good can come of it. I would just go along with it and congratulate her on her good fortune, say she deserves it, etc., and then just redirect the conversation elsewhere. I think people get really stuck on wanting to call someone out in these types of situations, but letting it go is usually for the best...\n\nBTW, depending on how close your relationship is, if you can gently guide her toward psychiatric treatment, that would probably be for the best as well... maybe you could say something like \"Wow, moving, marriage, and new horses! You are going through a lot of transitions right now! Maybe it would be good to have an outside party to talk to about how you are adjusting to all this?\"",
            "Much like the other commenters have suggested, I'd speak to her family and perhaps contact James as well to let him know whats going on. Beware repercussions though.",
            "> Do I warn James?\n\nOP, it's highly likely that there is no \"James\". If you've never met him/seen him, and she's apparently \"not in contact with him\", that means he doesn't exist.\n\nThink about it. She made him a \"long distance relationship\" because she knew people would see into her lie if he was never around. Him being long distance or just as ambiguous as she can means she had an excuse every time people ask \"where is he? can we meet him?\"\n\nI had a friend just like Wendy back in high school, but instead of it being a millionaire boyfriend looking to get married, it was some guy from New York (long distance so we wouldn't ask to see him) who apparently got her pregnant, until she eventually miscarried about a month in (so we wouldn't wonder why she's not visibly pregnant after a few months). She even fabricated emails from him and his also fake brothers (when I caught her in the act of faking emails, she didn't even admit it was all a lie; she just made up ANOTHER lie claiming she had to pretend to be these people to \"protect their identities from the people who wanted to hurt them\". yeah ok lol) Eventually the boyfriend died from some heroic act involving police brutality (dying so we would NEVER see him) and she started dating his brother who also lived in New York. Did I mention she used their names for her characters in her fanfictions? By the next year, the story had fizzled and she had stopped talking about it. I'm assuming she grew out of it.\n\nThe difference between her and Wendy is that Wendy is an adult (my friend was like, 14/15 at the time). Everything about her story, including James, is a lie (and if James is real, then that makes it worse because she's obviously making up stories about the both of them) and shouldn't be chalked up to \"silly high schooler nonsense\".\n\n\n\n",
            "She didn't invite you to the wedding, right?  That's also a huge red flag.  ",
            "[removed]",
            "Just say good luck and you are happy for her. Why waste your time and energy on something thats not real. It will play out eventually. ",
            "I personally have this need to impress people as well. Luckily I noticed this trait of mine in the age of 15, and demanded to get psycholocical help. Professionals confirmed I have several personality disorders. \n\nI know my way of thinking are usually unhealthy and destructive. I’m so happy some of my friends have forgiven me, but I’ll always tell them that if I ever get too much for them, then they MUST give up our friendship. \n\nAlways take care of yourself, before you take care of others! \n\n\nDon’t know if this comment is making any sense, just wanted to give my insight in pathological lying.  ",
            "This is exactly like desprest housewives. She ends up in a psyche ward after reality hits and she stabs herself and blaming him to keep him away from his real wife... Anyways.. Id let her mum, adult children, or sibling know so they can gently tell her to see a doctor \n",
            "Ask yourself, who is at risk of being hurt or having harm done to them here? \n\nWendy is lying, who knows why, but she isn't going to get her heart broken. She knows she's lying. Confronting her will probably make her defend herself, not admit to a lie and seek treatment for mental illness. \n\nJames may not exist, in which case no harm can come to him. \n\nHe may exist, just as the house and the horses do, but she doesn't actually know him. In which case, there also isn't really much harm being done to him. \n\nIf he DOES exist and is dating her, or thinks they're getting married, they're both delusional, but that seems unlikely. \n\n\nSo your friend is a pathological liar who is making up a story. \n\nDrop contact with her. ",
            "It has absolutely nothing to do with you.  Keep your nose out of it.",
            "Just so I understand this correctly, you stepped away from the friendship, then for some reason, you got back with her, she lied to you, and now you are here asking, why exactly? You are done with her, what the hell do you care what she says, thinks, eats, or anything else?",
            "After reading OP story a couple of times, I do not believe \"James\" is scamming her. Either she is dillusional (Morelli OITNB) and stalking \"James\"  Or She's actually got a crush on O.P and is trying to make him Jealous. I wonder about that because he stated she had had some pretty traumatic relationships , and that's why he/they didn't date. It makes me think that otherwise he would be attracted to her and the stories of other \"traumatic relationships\" might fall right in with this big story about James. My guess is she started out telling O.P these terrible stories about other men, trying to garner sympathy...he was  kind enough to make her think he may really like her as more than a friend, She took it as him being \"interested\" in her and is trying to make him \"jealous\". Yes she IS dillusional , but it's not a new thing, their relationship started out that way....he just wasn't aware of it until it intensified. I don't think anyone rational is going to think some guy who she obviously hasn't spent enough time with to have a photo of them together would take it at face value he bought her a mansion, and horses she's never seen. He has planned the wedding, picking the venue without her present. All while she's poor and living in squalor.  She is the one with issues. He just hadn't noticed until now. He needs to respectfully decline the invite. Then wait and see what happens afterwards. He can always text her asking about the new house....get \"confirmation \" she's moved. All while parked accross the street from her old house to see if she's still there. If she is...she's been playing him from the beginning. Drive away and change your number. Lying is not a crime, and there is not much he can do for her mental health as he is a \"target\" . If he keeps in contact with her he is feeding the fantasy. She could start getting angry with him for some nutty reason, and  he could potentially get in some version of a fatal attraction. I'd be willing to bet if he were able to contact any of her old friends or co-workers, even family members...he would find out she's done something similar. It would definitely be wise to see if anyone has ever taken a restraining order against her. Maybe one of her \"traumatic\" previous relationships involved HIM taking out a restraining order on HER. Especially if she told O.P there had been abuse. I could just be full of sh*t....but I don't think so. I too would like an update. ",
            "It really does sound like a mental illness. Do you think she is capable of hurting someone? If James is real I would be worried for his safety and the safety of his \"ex\"",
            "Honestly I’d *completely* cut contact with this person. If you want to try to reach out to this James person, that’s not a bad idea. But regardless, definitely fully withdraw from this friendship. Best case scenario she sounds like a pathological liar.",
            "No need to bring it up because you are going to cut off all contact with her now. Crrraaaaazyyyyy. ",
            "I don’t think there’s a lot of value in letting her know you know this is all BS. If she’s delusional, she’s delusional and needs professional help. If she’s just lying and aware of that, then she knows that she doesn’t own any horses or a new house and you’re just going to upset her by letting her know you know it’s all talk. Patho liars just double down when confronted, they’ll try and cover their lies with more lies and then get upset that you’re a bad person for questioning it. IMO it’s just not worth it. You won’t get the satisfaction of hearing her admit it, your move is to cut and run. \n\nAside from having a social media account, are you sure this guy is a real person? As other people have mentioned, it could be that he’s a catfish/scammer. If you have any doubts about the legitimacy of the account I would not contact it. \n\nIf you’re sure he’s a real person, I would  contact him to give him a heads up because when this “wedding date” doesn’t happen next week, if she’s cray your friend might act out. He, or his GF, could be at risk. Sounds like his girlfriend is being blamed as the person “keeping them apart”... if your friend is a delusional/crazy/stalker you should give them a heads up in case she merges fantasy world and real world. ",
            "The important thing to determine here is if James is a real person or not. If he is, she is either being scammed or she has developed an obsession with this person. \n\nMy guess is that she made him up, and the biggest clue is that she showed you pictures of various items, even very specific ones, but she didn't have any of him. As a friend, the most helpful thing you could do in my opinion is to contact someone who knows her and talk about the situation. She might be living a \"normal\" life apart from these clearly pathological lies, or she might be fading into mental illness. If the latter is the case, then she needs help.",
            "I mean, it seems pretty clear she's not getting married. Was she always such a compulsive liar? Was she always so delusional like this? \n\nIt could be that she's lying to save face bc she knows she came across as crazy, but it does sound more like a delusional thing. \n\nI wouldn't confront her if I were you, there's no point, unless you sincerely care about her and want her to get help. Don't warn James right away. What you should do is keep in contact with her over the week, talk about James, see if she seems increasingly distressed and/or violent. If she doesn't, don't say anything to James, no point in embarrassing your friend if her delusion is not a danger to him, but if you get the vibe she's about to go off the deep end and do something insane, warn him. \n\nHere's something else you should do. Google her name and check the court records in her county if they are available online, see if there's any arrests or restraining orders concerning your friend. If there's a history of violence or she has a history of restraining orders, warn him. But if not, no. ",
            "I am really bad at reading people, which has made me a magnet for pathological liars for most of my life. I once had a friend who made people and situations up so often that I literally didn't believe anyone new she mentioned was real until I met them in person. \n\nWhat I've learned is that the reasons are more important than the actual lies. The friend who made people  up? She was desperately lonely and depressed. She found interests and hobbies that helped her genuinely connect with people and she stopped lying so much. She works in politics and is actually a somewhat well known social activist now. I had another friend who lied all the time to create drama and keep herself the center of attention. I can't tell you what she's up to now because I have no desire to check in on her even from a distance.\n\nFrom what you've said your friend is going through a tough time. This lie might be her way of dealing with that. You should be honest about what you've learned, but also make it clear that you value her friendship and want to be there for her.  How she responds will reveal a lot. If she doubles down, it's either a manipulation or a genuine delusion and either way you should keep your distance. If she comes clean, you just need to set boundaries so she knows that this isn't acceptable and there are other ways to reach out to you.",
            "Doesn't sound like a mental illness.\n\nIt sounds like you two aren't that close, so why do anything at all?",
            "I didn't check all the comments, but I haven't seen anyone mention this so far - there's a film about this! In English, it's \"He Loves Me, He Loves Me Not\". It's about erotomania. And (spoilers, if anyone cares) the object of desire ends up having his relationship and career destroyed and unborn baby killed by the woman who believes they're in a relationship. Sooo...if you can find him, warn him.",
            "It's called pathological lying. It's a mental illness for sure, but it's not necessarily dangerous (the liar knows they are lying, it only becomes dangerous when they begin to legitimately believe it)  \n\n\nStill, sever the friendship. Pathological liars, like many mentally ill, can't help the NEED they have to do what they do. But they do it for attention and praise and it's still kinda gross. \n\nAlso like many here I also have a friend who I know inside out, really well. Known her for about 6 years going on 7. Yet every now and then depending on the discussion, I'll get a random story about herself that is really dramatic.  \n\n\nLike the fact she's a 100% hetero woman who does not find attraction in other women, but she told me a tale recently that she slept with TWO women and had girlfriends in the past (despite telling me - her gay female friend - that she does not and has never wanted women).  \n\n\nOr the time she told me she stood up to the office bully who made a girl cry and 'everyone clapped'.  \n\n\nYeah the clapping stories don't just pop up on Tumblr lol.  \n\n\nEnd this friendship. Seriously, let her deal with herself and her own crazy brain.  \n",
            "I've known a couple of people who compulsively lied like this. Chances are this James person doesn't even exist. \n\nBest thing you can do is just step away from the friendship again and have nothing to do with her. People who compulsively lie tend to drag others into trouble with them. ",
            "[deleted]",
            "Why is it any of your business? Oh that’s right, it’s not. ",
            "Your friend has a form of Münchausen syndrome.\n\nIt’s nothing to be worried about. It’s a learned disorder, typically from a parental source. Unfortunately it can’t be treated unless the person in question is willing to admit and confront it. Most people who have it don’t realise they do.\n\nIt’s worth looking up online. To put it as basically as I can, she has learned her entire life that people respond to her positively when she lies. Her lies are fanciful suggesting that she isn’t happy with her real life and your opinion matters to her. The sad thing is that she will (in time) fabricate that this all happened and even convince herself to an extent. \n\nI recommend reading : “the woman who fooled the world” \n"
        ]
    },
    {
        "post_id": "l9jhzy",
        "author": "throwaway52120",
        "title": "UPDATE: When I 34f told boyfriend 36m I frequently feel judged/scrutinized by him he told me there are “millions of things” he doesn’t say. Do I need to change my perspective or are we incompatible?",
        "url": "https://www.reddit.com/r/relationships/comments/l9jhzy/update_when_i_34f_told_boyfriend_36m_i_frequently/",
        "score": 4265,
        "num_comments": 180,
        "created_utc": 1612120448.0,
        "selftext": "Original Post: https://www.reddit.com/r/relationships/comments/go2t88/when_i_34f_told_boyfriend_36m_i_frequently_feel/?utm_source=share&utm_medium=ios_app&utm_name=iossmf\n\nFirst, thank you to everyone who responded to my original post. I remember exactly how confused and mentally exhausted I was at that point. Reading the responses and having my feelings validated by a bunch of internet strangers gave me the confidence to know I wasn’t being too sensitive (f that). It also got me out of a constant state of rumination about what was happening to me and why I felt so off and not myself and led me to act.\n\nI told him I wanted space and that if we were both trying our best and our relationship felt like this we had a huge problem. I also told him that at some point he had stopped treating me like his girlfriend and started treating me like a defective human being and I was over it and wouldn’t continue to invest my time and energy into someone who treated me this way. \n\nThose first few days I spent alone were like an f-ing vacation. I couldn’t believe how amazing it felt to do simple, every day things without his constant interference and judgement. At the same time,  I did start to notice some of the things I was blaming him for being critical of me were really areas I was insecure and being critical of myself. I spent more time over the next few months investing in myself and and improving certain areas of my life.\n\nOur relationship seemed to improve slightly over the next few months. The micromanaging and criticism really improved or I thought they improved. He might have just changed tactics. I think he started triangulating and upping the ante with the “innocent” insults. I think I had also gotten better at dealing with it and probably lowered the bar even more.\n\nIn the fall I had my first ever sciatica flare up. It was agonizing pain almost constantly. It lasted 8 weeks and I was trying everything - physical therapy, anti inflammatories, bio freeze, ice, not moving, powering through the pain. He was over it all after a few weeks and starting treating me like I was a lazy slob. I felt so scared and helpless about how much pain I was in and if It was ever going to get better or would I need surgery. The added stress of still trying to be a good partner was horrible. \n\nI’m not sure why this instance of his selfishness had more impact, but I felt something change inside of me in a profound way. Of course when I tried to talk to him about it, it went very poorly. The argument ended when he mocked me for crying and asked me why I couldn’t talk to him like a normal person .\n\nI can’t remember when it started but I began to have physical responses during any kind of conflict with him. Sort of like fight or flight maybe? My hands start shaking, I start feeling overwhelmed and confused, my stomach is flipping, and eventually the tears come.\n\nThis comment from my original post rings true:\n\n“It seriously sounds like a low key gateway to emotional abuse. I can't imagine his BS only starts and stops at just hacking away at OPs self worth and then gaslighting her about what's happening.\n\nThose people get worse as the relationship goes on, not better.”\n\nThe BS certainly didn’t stop there. There were so many instances during our relationship where I felt he had lied to me. There were constant interactions where my instincts told me he was being inauthentic or he was hiding something or not giving me all the details. The addictions. The attention he gave women on social media. Always needing someone to blame. An almost embarrassing inability to take accountability.\n\nI still feel pretty conflicted about what I did. I went through his phone. I started by looking for a couple specific times in the beginning of our relationship where my mind had flagged something as off or a lie but I had no idea why. Like when he insisted we go drop a bottle of champagne off to a friend of his as a congratulations for getting a new job. At the time I couldn’t place what felt off about this. I looked at texts from this specific date and now I know that we were really there to deliver cocaine. When I was able to confirm what my instincts told me were lies it was off to the races.\n\nIt was all pretty bad. He was on tinder for the first 6 months we were together, bumble for 9, and plenty of fish 11. All texts with other women deleted. Secret drug use. It’s hard to even remember everything but I tried to just confirm what I had felt to be lies. \n\nThere is definitely a ton of anger and sadness but more than anything else I felt relief. Everything my instincts have been telling me since the beginning have been accurate and I have been fighting a losing battle against them. It felt freeing. \n\nWhy have I continued this relationship in spite my instincts for 2.5 years and endless stress and chaos? My hair has been thinning since the 3 month mark in our relationship. I’ve had brain fog and memory problems despite being known for my iron trap memory. Sleeping issues. Weight fluctuations. My body has been physically rejecting this relationship. Somehow I either couldn’t admit that it was him or I was really that out of it. I’m starting to try and unwind it all in therapy.  I have had 3 sessions so far and am scheduled weekly for the foreseeable future. What I have learned so far is I was taught to not trust my feelings as a child by my Dad, who is very likely a narcissist. I’m really excited to work on my toxic patterns and behaviors in therapy and make the relationship I have with myself better and my priority.\n\nWe have been living in separate bedrooms for a couple weeks. The initial confrontation was horrible and I hurled some really rough insults and names at him. A few weeks ago I was thinking that I would have a final discussion about why we were breaking up and the logistics of him moving out etc. It still almost felt like I was going to have to convince him that this was a good enough reason to break up. \n\nAfter a deadline for work is over in the next couple days I’m going to tell him the relationship is over because I want it to be. And I do. I’m going to offer to pay for movers so I have an exact date he will be gone. I am nervous about his reaction and scared of what he might say to hurt me but I have never been more certain I’m making the right decision  so I know I’ll be able to handle whatever happens.\n\nAgain, thank you endlessly to anyone who took the time to comment on my original post or reached out. I felt seen and heard that day in a way that woke me up and nudged me to really start paying attention and stop turning everything inward. \n\nTL;DR I wasn’t being too sensitive; we are incompatible. He was not only making my life a living hell with all the criticism, gaslighting, and passive aggressive jabs, he was also a liar and a cheater. Coming to terms with all of it and working on myself in therapy.\n\nOh and one more thing - In my original post I played dumb about what he was insinuating when commenting about the shorts with the wet waistband. I was so paranoid at that time I wanted to see if other people came to the same conclusion that I had. When I reread my post that stuck out to me as sad.",
        "permalink": "/r/relationships/comments/l9jhzy/update_when_i_34f_told_boyfriend_36m_i_frequently/",
        "comments": [
            "I think you should have someone you trust present when you tell him it’s over.",
            "My best friend's husband snapped one night and brutally murdered her and her unborn child.\n\nWe don't know why but I think she told him she was done as he was abusive. Do not be alone with this man when you break up with him. Also, have a locksmith nearby to change the locks immediately after he is gone. \n\nDo you have a father or brothers who can be with you?",
            "I remember your original post. I'm so glad you are resolved to get away from this man and begin to heal.\n\nI would be very cautious going forward. He has already shown you he us willing to lie, gaslight and manipulate you, and abusers are most dangerous when they think they are losing their control. Tell some friends what's going on so you have back-up if necessary.Think about storing your most important documents and possessions elsewhere until he's gone. Get a lock for your door that only you have the key too. Don't spend time alone with him.",
            "Please be safe, please stay away, and preferably do the breakup by phone in a safe location or at the very least with another person as a witness.  Very rarely the women who got killed by their partners thought they would be killed by their partner and the family and friends are \"shocked\" and \"never expected it\" and \"he was a good neighbor\"",
            "Well I’m glad you’re working on healing your relationship with yourself and plan to end it with him! You’ll feel so much better. Good luck!",
            "I feel like other commenters have covered a lot of safety concerns and I second all of their advice. Don't only trust your feelings-- he's gotten you used to downplaying his behavior. It's not \"overly paranoid\" or whatever to prioritize your comfort and safety in situations like these, especially because you aren't used to making your feelings a priority right now, and that's on him, not you.\n\n\nI do want to add, as someone who is finally in a loving, healthy relationship after managing to leave one that sounded a lot like yours-- please don't give up on fighting for yourself because it can and does get better! I never knew that it was possible to be with someone where looking at myself through his eyes always makes me feel *better*, not worse, and if I can do it you can too. When you're in the mindset of exhaustion and constantly picked-apart and ignoring what you can to get through the day, it can be impossible to think of what a different life could be like, or feel you're worthy of one. From one stranger to another, I'm so excited for you to experience life on the other side.",
            "Get someone else involved whenever you have to interact with this sick fuck. This mofo was holding you back :(",
            "I'm a survivor of an abusive relationship, one that started out just like this. I'm not gonna take over this post with my story, but from personal experience, please listen to the people telling you to have someone present when you break up with him. I think you also should change your locks as soon as possible after breaking up. I ended my relationship with my abuser in a restaurant parking lot, and he punched the door of my vehicle so hard he broke the armrest on it. I know exactly what would have happened if we'd been alone. Please have someone there.",
            "You’re doing the right thing. No matter what happens, remember that. You come across as someone who is intelligent and eloquent. I have no doubt that you will become a much more secure person within yourself with therapy and having the toxicity out of your life. You will flourish and when the time is right, meet someone fantastic that deserves you. Do not waste any more time on this piece of shit.",
            "The most dangerous time for a victim is when she tries to end the relationship. \n\nOften ending with DEATH. \n\nYou are in danger, and please treat this seriously. Have someone with you when you tell him. Have someone, maybe two someones, actually staying the night on the sofa if possible. \n\nYou cannot underestimate an abuser whose victim is trying to get out of their control. Please stay safe.",
            "Don't pay for movers. Hand him a 30-day written eviction notice.",
            "A year ago I was in a very similar sounding relationship-lies, drugs, cheating, stealing from me, etc. When the veil lifted and I felt the shift within myself like you described I did this: I calmly approached and told him it was over and I wanted him gone. I walked out and drove to the uhaul rental place closest to me and rented a big ass truck. At that point I didn’t give a fuck about cost, I knew he wasnt going to go in his own. I came back and started loading up his stuff. I didn’t speak to him or answer his battery of\nquestioning and I didn’t stop. He actually just sat there and watched me packing and loading for a while. It wasn’t until my entire family came in support and helped me load his shit out of my house and back to his that he seemed to get how serious this was. As he was finally leaving, my big brother and dad told him that if he comes around again or contacts me in any way the cops were going to be called and legal action will be taken. Haven’t seen him heard from him since. \n\nMy life is so much better now. Hang in there. Have courage, you got this.",
            "I didn’t see your original post but I’m so god damn proud of you. PLEASE make sure you have someone checking in on your regularly or even there with you when you make him leave. Even if it feels unnecessary or silly. It’s not silly and you can never be too safe.",
            "[deleted]",
            "Please be very careful, OP. Someone like this could manipulate you at best, hurt you (or more) at worst. Please tell at least one other person about what's going on. The time when a woman tells her abusive partner that it's over is the most dangerous and deadly time for her. BE SAFE.",
            "The answer to \"Am I being too sensitive?\" is almost always \"No\".",
            ">he mocked me for crying and asked me why I couldn’t talk to him like a normal person\n\nI'm seeing red\n\n>we were really there to deliver cocaine\n\nWell holy shit that was not what I was expecting.\n\nYou've put up with that too much. When you break it off, avoid the temptation to lay everything out for him. This gives him huge amounts of fuel for him to argue against, and honestly I expect him to get ugly and scary if the \"baby\" stays determined to split up. Have a safety plan in place for the breakup, including a plan to change locks/install cameras, etc. \n\nThis guy didn't lie: he's genuinely capable of being worse. Stay safe, be strong, update us again later!",
            "Be strong. He's going to try to change your mind about ending the relationship. Remember that you DO NOT NEED HIS PERMISSION and you DO NOT OWE HIM ANYTHING. It's over because you say it's over.",
            "[deleted]",
            "Try using a heating pad on your lower back during a sciatic flare up. I have sciatic issues from my muscles hitting the nerves and only a heating pad helps. My favorite is a weighted massaging one.",
            "Do you have anyone you can just go stay with? I think you should leave. He no longer warrants a conversation about why it’s over and honestly I’m scared for what his reaction may be. I’d suggest grabbing a few personal items and leaving. Bring a friend with you to go back and get your stuff later. Just get out.",
            "You should have a supportive person there with you when it’s time to tell him it’s done and over. He smells like fire",
            "Good for you!! This is an incredible step towards recognizing your worth and not taking all this BS from someone who doesn’t value you. Quick question- in your original post, you said he still paid rent at his but mostly stayed at your place. If he still has his own place, who not just rip the bandaid off? Get rid of this POS like yesterday.",
            "Be really careful about your exit strategy. Tell three or four people what's going on, get someone there to physically help you move your boxes and furniture. Buy pizza for everyone including him, pretend it's normal, and get the hell out of there in one piece.\n\nIf he's as smooth as he was in the beginning, he's manipulative and smart. Piss a guy like that off, a person, things can get ugly quickly. You need people physically there with you, and you need to keep everything as pleasant as possible. Within reason of course.\n\nCongratulations, let us know how it turns out.",
            "Congrats on your divorce, we hated him.",
            "OP my heart breaks for you. I’ve had sciatica for 5 years and it is the worst thing ever and I can’t believe he would belittle you during such a difficult time. I don’t know you but I am so unbelievably proud of you for choosing to end this relationship and focus on yourself. Be safe with the way you end things and remember you deserve the world and he wasn’t even giving you dirt. I hope your life improves vastly and that you find all of the joy that you deserve. Best of luck!",
            "Honestly had to scroll back up to see if you were dating my ex (don't worry - the ages don't match up).\n10 years later and cutting him out of my life was the best decision I ever made. You're on your way to a better life. Congratulations.",
            "Just a small health note, some of those symptoms you mentioned (hair thinning, brain fog, weight fluctuations, sleep issues) can also be key symptoms associated with hypothyroidism. This may be unrelated, but I thought I'd bring it up just in case it's something you haven't been checked for yet.",
            "Reading your original post reminded me of my ex bf who I lived with for a year. Exactly same feeling and treatment by him. He’s a recovering addict too and it is emotional abuse.",
            "I am positive your ex isn't my ex husband but jesus, the similarities in personality are so incredibly similar. It's really disgusting how many people can be this way. If you are scared of the breakup then don't do it home with just him. I know it's a pandemic but try to find a way to do it publicly or with support. Good luck.",
            "First, I am so happy to see this has gone well for you and that you are getting out! A couple things jumped out at me in your post that I want to draw your attention to as well. \n\n>I wasn’t being too sensitive; we are incompatible.\n\nNo honey, you are not incompatible; he is a lying, abusive fucknugget. Incompatible suggests that no one did anything wrong; it just didn't work out. That's not the case here. He did things wrong. A lot of things. Lying, cheating, insulting, manipulating, gaslighting, to name a few. That's abuse. Call it what it is - it hurts at first, but I promise it's empowering in the long run. \n\n\n>Those first few days I spent alone were like an f-ing vacation. I couldn’t believe how amazing it felt to do simple, every day things without his constant interference and judgement.\n\nThis is the moment when you know there is something deeply, deeply wrong with the relationship. This happened to me the one time I dated someone who was (I think) a proper narcissist. We'd been together for about 6 months or so, and things were rocky. A festival came to my town related to my passion (I don't want to say hobby, bc it's way bigger than that for me), so I told him I was going to be super busy for that weekend (I think thurs-sun) and that I'd see him on Monday. I even took the time off work so I could properly focus on the festival. To my surprise, he respected that and left me alone. It was SUCH AN ENORMOUS RELIEF. I felt more alive than I had in basically our whole relationship. More energy, less stress, the whole 9 yards. Stupidly, I went back and spent another two months trying to \"fix\" us, and made several other bad decisions before finally breaking up with him in a scene like nothing I've ever seen outside of reality TV. But I learned that if taking a few days away from your relationship makes you feel relief... It's probably time to end the relationship. I hope you can also take some important lessons from this so you know what not to tolerate in future relationships!\n\nETA: I also second what everyone is saying about having a friend there when you end it. The giant scene that was the end of my relationship was when my friend and I came to get my shit out of his house (yep, there's one of the stupid decisions - somehow, I ended up moving in with the fuckwaffle). The only reason we were successful is because we tag-teamed my ex. He would come to me and beg and plead, or stand in my way, and my friend would grab boxes and take them to the van. Then he would stop to yell at my friend, and I would grab more stuff. It would have been physically impossible for me to do this on my own.",
            "[deleted]",
            "This isn't related to your relationship but I just wanted to say that I have felt that brain fog, poor concentration and poor memory as a symptom of my depression and anxiety. \n\nI just wanted you to know, in case you had doubts like I did, that those are real diagnosable symptoms as a result of what is happening. They do improve and get better, although it can take a while and some practice for the concentration and memory. \n\nI felt so stupid and incapable but learning it was part of my stress and my illness rather than a personal failing was important for me.\n\nI'm really happy for you, that you can now see this relationship clearly. Keep yourself safe and good luck!",
            "I think people have really hammered home the point of “bring someone with you for your own safety” which is so true. Please do that. \n\nAdditionally:\n1. Talk to your therapist. Tell them you are planning to leave him and ask them to help you craft your statement. They can help you figure out exactly what to say, consider his potential responses, and practice addressing any of his inevitable manipulation tactics. \n2. Seriously, BRING SOMEONE ELSE AND TELL OTHER PEOPLE WHAT YOU ARE DOING AND WHEN. Please. At the very least have them wait right outside the door. Then up your security at home, change locks, etc. \n3. Be prepared for a mental crash. You have been in survival mode for YEARS from the sounds of it. Once you are truly free and safe, you will have to deal with the constant stress you’ve been under that will now suddenly be gone. I can tell you from experience, the immediate aftermath of leaving an abuser can make you feel crazier than he ever did. You will get through it. Go to therapy often, interact with loved ones, be gentle with yourself. Don’t punish yourself if you can’t immediately embrace the joy of your new freedom- there is a weight and unfamiliarity to it, too.",
            "Wait, why are you waiting to break up with him? Because of a work deadline?",
            "safety first! do whatever you can to ensure that you do not see him again. ever.",
            "Have someone there for the break up, and the move, and for God’s sake do NOT pay for movers. Make him figure that shit out.",
            "Oh god I remember your original post. I’m really happy you are getting out of this, but please be careful and safe when you do. I’m rooting for you! Update is when it’s done? And don’t be too hard on yourself these narcissists are masters of manipulation. He knew how to push your buttons and control you. You’ll be great once you are out! Best of luck",
            "Have the police parked out front when you break up and then change the locks. This is NOT going to end as nicely as you think. Don't take a chance. And do not pay for his movers. Just move everything of his to the street and change the locks.",
            "what does she mean with the wet waistband shorts thing?",
            "Just saying as a victim myself who underwent a ton of the same physical transformations, good and bad, as I left:\n\nYou are unquestionably being abused. The physical reactions your body had were the same as mine, at every stage. The weight change, the body breaking down, the brain fog, the slipping memory, that’s a panic attack when your stomachs flipping when he’s yelling at you, you know. Abuse comes with physical symptoms beyond bruises. Bruises are easier to avoid than the other symptoms but sadly not many watch for them. You are right to leave. You need to. I don’t want to discourage you. I also don’t want you to get hurt. You must be very careful.\n\nDo not tell him where you leave to. He will try to do the most damage he can to you for leaving. Run. Don’t even tell him you’re leaving. At best do it by note, by text, or in public. Do not tell him when you’re alone. Tell your work if you’re concerned he’ll go there. Tell the people around you what happened. Buckle up. The worst of him may be yet to come. You’ve seen what he’s done for your “smaller” crimes. To an abuser the most evil thing you can do to them is leave. Even if it would kill you to stay. Mine made me homeless. I don’t know what yoursll do to you, if he does anything at all, but brace yourself. I got off easy with temporary unstable housing.",
            "Seconding all the comments who tell you to be as safe and careful as you can when you break up with him, don’t do it in person, have someone present, etc. But be equally prepared that he may not flip out violently—instead he may morph into the man you’ve always wanted him to be, saying all the right things, doing all the things you begged him to do for years. If he goes in that direction, it’s a huge mindfuck. But stay strong. It’s a trap. You know who he is. You have years of evidence and the receipts! \n\nI also support you paying for movers, whatever it takes. I paid my ex out of our lease, let him keep the apartment, TV, expensive new bed, and well over half of our large savings account. I’d do it all over again to get him the fuck out of my life.",
            "Dude is an emotional abuser. I dated a guy exactly like this, to the point where reading this is extremely eerie. I wish I'd gotten out sooner. Don't wait anymore. Get rid. Life was soooo much better without someone constantly scrutinizing me and criticizing dumb bullshit.\n\nAnd I mean ... Dude's a drug dealer who took you along on deals. Do you want to go to prison for him? Because that's what will happen if you're with him and he gets caught. They're not gonna buy that you didn't know, even if it's true, and he's not gonna tell the truth to protect you.\n\nLeaving my emotional and verbally abusive ex is literally the best decision I ever made. Six months later I got together with my now husband, who is amazing. You have no idea what a relief it is to be with someone who makes my life better instead of worse, who builds me up instead of cutting me down constantly and trying to neg me. It almost seemed too good to be true. 14 years later, he's still awesome to me.\n\nGet rid of him now and have someone you trust there when you do it. Do it for yourself. You need to put yourself first because this dude won't.",
            "This person sounds like a real asshole and a narcissist in medical terms. And if your dad was a narcissist, it’s natural for you to stay with someone who is a narcissist because our psyche wants to heal. By changing this person, the psyche thinks it will change what happened to you as a child. There’s a lot underlying here to discover. \n\nAnd for this dude, do not feel anything for him. Let him move out, change the locks, and wipe him out of your life. There are bad people and you met one, as simple as that.",
            "And remember strict “NO CONTACT “ when he leaves.  He should be blocked on EVERYTHING immediately",
            "Good god I’d go nuts if I was micromanaged like in your original post. And trust me, this IS emotional abuse he put you through and it would definitely have gotten worse if you stayed/got married. He sounds like he has some strong narc traits. You dodged a bullet.",
            "*\".. sense of uneasiness when I’m doing practically anything in his presence.\"*\n\nDo you still feel this way being around him? If the answer is yes, then get out ASAP. Simple as that. He has some serious issues.. and things will only get worse. I was with a guy who was extremely critical to the point where it drove me insane and it made me sick. I should have left him long before he finally broke up with me after a year and a half, but I was relieved when it was over.\n\nEDIT: It's not about if you're compatible or not, he's just an emotionally/mentally abusive asshole. Really reminds me of my ex.. controlling, condescending, mind-numbingly critical, nothing is good enough, gaslighting, invalidating feelings, etc. These kinds of men are very insecure and have some kind of superiority complex.. they must be avoided at all costs. I learned my lesson the hard way by ignoring the red flags early in the relationship. The peace of mind I feel with him gone is indescribable.",
            "OP I am seconding (or thirding) all the comments that you need to have someone there when you do break up with him. I went through a similar relationship that I ended back in October and it was a fucking nightmare even AFTER I broke up with him as he would not accept it and kept showing up at my apartment until I threatened him with a restraining order. The final straw with me breaking up with him was an outburst where we had a fight and he became violent (not with me, but easily could have been) and he threw stuff around and screamed. Please please please go through with leaving him, you will be so much better off without him. Lean on your reliable friends and family to help you through it. Best of luck.",
            "GAHHHHH THIS IS FUCKING AWESOME!!!! Babe!!! I am so proud of you!! I am crying. I freaking felt this to the CORE. You are an amazing angel and I am so excited to see where you go! And you already taking the steps you need through therapy is outstanding. You are going to sky rocket, baby!!",
            "Please have someone there with you. This is obviously the safelink thing to do. Possibly record the event.",
            "He cheated on you. That's it. Just leave him. No one deserves to be treated the way you're being treated. Gas lighting, emotional abuse, manipulation and cheating! Girl my ex was exactly like that. Calling me an ugly ass pig, throwing the cookies I baked to dogs, and telling me how great the girl he cheated on me with was n all that, I became suicidal, n then one fine day, I found courage and just walked out on him. And that was it. I never looked back. Not once. I think it's high time u leave this person, because he doesn't value you and you deserve much better than that.",
            "I only created an account just now to say good for you. I am so glad to hear you're in therapy and are healing. May you have a happy and HEALTHY 2021!",
            "Look, I have left a relationship like this. It almost completely destroyed me. Here is the thing.. with ppl like this they think they own you. As in.. he wil very likely still try to have you in his life even if you don't want it. My ex still tries to contact me even through fake accounts where it is obvs it is him and he emails me and sends me money I never accept and it has been 3 years. I have told him never contact me again and it has gotten to the point where I just have to no contact him. I think that is what u r going to have to do. It's also important to know that u might be addicted to the dopamine of when he is actually nice to you. They can make ppl addicted to being in contact with them and addicted to their love bombing through the emotional abuse cycle. So be strong you can do it and if you want to talk msg me anytime. Especially during times where u want to reengage with him or he is blowing up your phone or email. I would change everything. Every email, your phone number etc",
            "He didn't exactly reassure you with his response. Does he care about you?",
            "So, OP, that “dropping off some cocaine” thing—is your soon-to-be-ex a drug dealer? If so, did you save screenshots of his texts where he conspired to break, and then broke, the law?",
            "Anyone who doesn't take your sciatica seriously is someone you should not have in your life any longer than necessary. \n\nI've been having severe 24/7 sciatica pain for over 18 months now. If someone I cared about were to laugh at my sciatica or treat me like I'm just being soft, my response to them would be...extraordinary.",
            "Poor guy just need to say what he wants to say. Personal vent:  I have someone who says for example, do you want to cook up steak tonight? In my head- No, I don't want steak tonight.  But what it really means- I want steak, you're cooking it, so say you're going to cook it bc I left it out for tonight.\nI just say sure, I'll cook it. But I wish he would just say for once, this is what I want, will you do it? So much easier! I do get told what I look homeless in too.  But I don't care, I work a LOT. And he doesn't buy my clothes. As for hair styling, well it's nice when they could just say, you look good today, instead  I get why don't you do this everyday?  I feel all relationships have to go through this lost in translation bit until you don't care anymore.",
            "The right person will love your flaws, not love you IN SPITE of them.",
            "[deleted]",
            "I was in an emotionally abusive relationship with very similar features to yours.  Its a long road to recovery with therapy but it's very worth it.  \n\nHave courage,  stay safe,  and remember that life can and does get better after this.",
            "I had a similar problem with my ex",
            "Be careful. All you know about this man is that he doesn't treat you like a human, but a defective piece of equipment. And he lies.\n\nIf you need to change the locks \\[and you're the one on the lease\\] or if you need to just move out without talking to him, please do it. This guy doesn't have a conscience.",
            "incompatible, ditch him",
            "Your (soon to be) ex sounds like a narcissist. Hardcore. Deflecting blame, quick to judge, still able to keep you emotionally close enough to stay with him for 2.5 years. Doing/dealinh drugs (I assume cocaine was one he was taking). Messing around with other women.\n\nIf he's a narcissist, this is all part of his high. He feels on top of the world (un)consciously manupulating people and situations and juggling all these activities.\n\nNot to mention the emotional part. Him making you feel less than, saying he's been holding back and in disbelief you're hurt, and of course, when you're sick, he's going to call you lazy. Everything you've described about him says he is extremely selfish and is quick to put himself first (a narcissist).\n\nWill be so happy for you when you break up and have him move out.",
            "So glad you are moving on... it won’t get better.   Thought I’d mention to be really careful when you move out and make sure you have help.  Most post say this bc they fear for what his reaction might be.  I’m saying this bc packing and moving can cause another sciatic flair up.  You’ll keep praying thru to get out but you don’t want to have a relapse.  Pull in favors from friends and family.   Hugs",
            ">In the fall I had my first ever sciatica flare up. It was agonizing pain almost constantly. It lasted 8 weeks and I was trying everything - physical therapy, anti inflammatories, bio freeze, ice, not moving, powering through the pain.\n\nAs someone who lives in chronic back pain, I just want to tell you I understand the fear. The fear it will never get better, the fear you might live a crippled life because you can only imagine it can get worse. \n\nFor whatever it's worth, over time, I do have good days now. Not all hope is lost. The pressure man.... I check the weather apps and mentally prepare myself for an increase in atmospheric pressure. That triggers flare ups for me sometimes. I hope you find a solution that works for you.\n\n> There were constant interactions where my instincts told me he was being inauthentic or he was hiding something or not giving me all the details. The addictions. The attention he gave women on social media. Always needing someone to blame. An almost embarrassing inability to take accountability.\n\nNever let a man ever again sway you from your intuition. It's a gift that's more often right than wrong in these kinds of circumstances. It may take time to heal, a lot of things might be hard at first, but that intuition is there to serve you. With healing, you will get better mind and body.    \n\n> What I have learned so far is I was taught to not trust my feelings as a child by my Dad, who is very likely a narcissist.\n\nDing, ding, ding. \n\nHere's the thing, as much as you want to confront him all they do is DARVO. By him, I mean this excuse for a man you unfortunately ended up dating, trauma bonded to, and somehow stuck with I would guess in the kindest way out of honest ignorance. You don't know and you can't see these things until you do. No it wasn't your fault. Now that you know, you can take your own power back.\n\nConfronting nasty people about their nasty behavior tends to get them just trying to deflect onto you rather than ever take any accountability. It's not worth it. No contact + breaking it off and getting away with someone you trust NOT to be a flying monkey is as /u/Sedorner said, good advice. I would take their advice. \n\nI'm really sorry you're dealing this and you will be a stronger, more confident person in the end for it.",
            "From everything I’ve read, I think you’re making a solid, don’t-look-back-decision that’s best for your physical and emotional well-being. \n\nNot saying he has NPD, but maybe come on over and check out r/LifeAfterNarcissism if you need more support after he’s gone. Have a friend or trusted family member on standby when you tell him that he has to move out. Just in case. Remember, as hard as it will be, look forward, don’t look back. You’ve got this.",
            "Classic narcissist, he sounds like",
            "Congratulations on the start of your new life! Things are going to get a whole lot better once he's gone.",
            "You should plan your escape, then tell him it's over, with witness, just one hour before the movers arrive. And never stay alone with him at all. Never. \n\nNarc flip between being sweet and violent when they can't have it their way. \n\nEven if there is only 1% chances that something bad happens, you need to be safe. \n\nSeriously.\n\nSecure your values and especially papers ASAP.",
            "please be safe, op 🤍 you sound like such a sweet soul and i want you to be protected. have someone there",
            ">I’ve had brain fog and memory problems despite being known for my iron trap memory. Sleeping issues. Weight fluctuations. My body has been physically rejecting this relationship.\n\n\n\nMight be nothing, but thinning hair and your symptoms above are all also symptoms of hypothyroidism (might be Hashimoto). It's your body physically rejecting your thyroid.\n\nTo check this out, ask thyroid panel blood works from your doctor.\n\nAlso, thank you for the update. You did great. Good luck!",
            "omg this all sounds horrific i.e. the insane amount of stress being with someone so callous. Internet hugs OP :( I hope you have your freedom very soon. Best of luck. Please be safe too.",
            "I don't know you, but I'm so damn proud you took this step! Here's a virtual hug for everything you've been through and the best of luck in therapy! Please be sure to listen to the other comments and have the breakup in a safe place with someone you can trust there.",
            "Hey - I only have a second but HAD to say: if you're willing to pay for movers, AND this guy has his own place already,  just get out of your lease and hire the movers for yourself. Last Jim know that he has X amount of days to retrieve his belongings (once you're already out)  before thre lease is up and keys back to management.  Get out of there. And make sure your friends, even acquaintances!, and any loved ones are aware of the situation and keeping an eye on you.  Props to you,  OP, good luck in your path back to wellness. Please be careful, and enjoy having your own safe space.",
            "Please make sure you leave safely - have an exit plan and trusted person there! I had an ex who was similar in giving insults constantly. He even sounded much milder than your guy. However I found out it stemmed from his extreme low confidence in himself (he’d blow up if I pointed out he needed a breath mint!). Anyway when I had enough and left him - that’s when he got PHYSICAL VIOLENT and pushed me over twice. He couldn’t comprehend how someone like me could reject someone like him. Good that you are out of the fog! Best of luck with the rest of your life",
            "He will manipulate you into continuing this hot mess otherwise you would have already left him.",
            "Make sure to have other people there — friend or colleague — when you talk to him about moving. Possibly even therapist if needed",
            "Incompatible suggests you just aren't right for each other. That's not the issue, here. He is an abusive narcissist and isn't compatible with anyone as he is now, that's the problem.",
            "Good for you for ending it! Just wanted to say that you should get your thyroid checked. All those symptoms you listed are the hallmarks of thyroid problems. Not saying it is unrelated as thyroid disease is often autoimmune and can be triggered by stress.",
            "Have someone with you when you end it. \n\nPlease take care, OP, and keep us updated ❤",
            "Please have someone there with you when you break up with him. And thank you for these posts, I think you have and will help a lot of people with this. I’m so glad you’re getting out of this relationship and wish you the best 💕",
            "Your first post passed me by but I just wanted to jump in and say that I dated this guy for 2 years as well (well someone very similar). Your update really chimed with me as well as I've had to work so hard to understand and undo all the damage he did and why it was even possible for me to be in that relationship for so long.\n\n\n\nAfter about a year of working on myself I am happy. I learned to trust my instincts and that has really been such a gift to myself. I am now in a loving relationship with a wonderful man. Being in a relationship is not the be all and end all but it's gratifying to know I am able to have a loving, supportive and enriching relationship with someone.\n\n\n\nI've spoken to him a bit about my own toxic relationship with my ex and he's said to me more than a few times \"I find it hard to believe you were in a relationship like that for so long\" because I am so different now. I trust myself, I have self worth and self acceptance. I've a few snags I need to be mindful of but I feel whole and loving towards myself and by extension, of him and us.\n\n\nI am so proud of you and the big things you are doing. Please don't ever beat yourself up over what happened, about allowing it to go for so long etc. You had to grow in these ways and your life will be so much better now that you are. You are a wonderful, strong, loving, kind and wise woman. No one can take that away now that you've realised it. That will be yours forever and your life will be richer for it.",
            "Im glad you're going to end it.  Leaving an abusive partner is hard but you are better off once you get over the feelings.",
            "Good luck op keep up the strong resolve, just remember how better u felt on ur break! Take care sending u strength and love ❤️",
            "My ex was verbally abusive  everyday and it only got worse as time went on. Walk away. He doesn't appreciate you.",
            "I really would end this for good. You took a break and were happier, I wish for your sake you had made the break permanent then. He sounds awful.",
            "Don't do this alone & be prepared that he will not accept or agree to it.",
            "Please don't let this breakup get pushed by big events. Don't let the work deadline turn into after Valentine's day, then after the next holiday, then after his birthday.\n\nDon't wait, just do it now. You've already waited 8 months.",
            "So glad OP is dealing with this.  The comment about brain fog had me really worried the awful bf was slipping drugs in OP’s food...",
            "You are worth more than this asshole is treating you.  Please go through with breaking up with him and getting him to move out, but with a good person you trust present.  You deserve someone to really love and care about you,  who will help you during your lows, not dig you deeper into them.  \n\nGood luck,  I truly hope you find your happiness without him.",
            "OP, ANY reason is a good enough reason to leave a relationship if you’re not happy. ESPECIALLY when it’s abusive. Do NOT let him convince you to stay with him. And echoing what the commenters said above, have someone you trust nearby.",
            ">TL;DR I wasn’t being too sensitive; we are incompatible.\n\nYou need to say this to yourself outloud and often: \"We weren't incompatible. Compatability didn't even come into it. He is abusive. He is a liar. He is a cheat. It was intentional.\"\n\nCompatibility is mutual and unintentional. You didn't bring any of these issues. He did. Intentionally. I could have written your post 5 years ago. I remember the physical reactions you described so well. Therapy was a wonderful and incredibly insightful experience for me. I'm now at peace and happy and have a wonderful partner and with all the work you are doing you will have that too. \n\nIs it possible to call anyone to be with you when you kick him to the curb?",
            "> TL;DR I wasn’t being too sensitive; we are incompatible. \n\nMore precisely, you two were incompatible because he's an asshole.",
            "I don’t understand what he meant about the wet waistband, but I am really proud of you for everything you’ve done. You should not have had to go through this.",
            "Know this because I've been through something similar. This shady dirtbag is not going to do away quietly or easily. He has no substance and nothing to lose. Please be careful and have a third party involved. Do not continue to live with him after the deed is done.",
            "Learn about greyrocking. It might help keep the peace until you get out and go full no contact.",
            "If you're worried about him being violent by the breakup or moving date, you should consider having some friends there or on standby in case it goes bad.",
            "Yeah I would pack up and find an air bnb while he’s moving and stuff. Don’t trust him with any pets you have. $5 says this escalates in a BAAAAAD way. $5 on this NOT going smoothly on the day. Please take care.",
            "Please op let us know you are safe and that you broke up with him with someone close to you.\n\nMy ex tried to run me over when I accidentally runned into him (this was 4 months after the separation) so please be careful!",
            "Get your shit and get out and maybe leave a note. Or don't. That guy is trash and doesn't exactly deserve a note or anything."
        ]
    },
    {
        "post_id": "djp7r1",
        "author": "theforgettableguy",
        "title": "[UPDATE] I [24M] think my girlfriend [25F] is cheating on me",
        "url": "https://www.reddit.com/r/relationships/comments/djp7r1/update_i_24m_think_my_girlfriend_25f_is_cheating/",
        "score": 4257,
        "num_comments": 529,
        "created_utc": 1571413007.0,
        "selftext": "To see the original story, I’ve linked it\n[here](https://www.reddit.com/r/relationships/comments/dihwh9/i_24m_think_my_girlfriend_25f_is_cheating_on_me/)\n\n[MOVING UPDATE]: She left an hour ago and got all of her things. She brought her friend, who was also my friend too, and they were packing her stuff.  But also giggling like a couple of teenagers? All I did was sit and catch up on some emails from work, not paying attention to either of them. After about 3 hours, she had all of her things in boxes. She tried to take some things that were mine, and I told her calmly that she didn’t pay for it, so to please leave it with me. I contacted the nice couple we rent our house from and they were extremely supportive and are letting me change all of the locks, so my buddy and I are going to do that tonight. He is also helping me move my desk and electronics to the spare bedroom, since my ex used it as a closet and storage space. When she left, I finally saw some remorse, but I think she was just being nice to me because she was happy to be going to that guy’s house. She hugged me goodbye, and I let her because that’s my way of getting physical closure. Whenever she hugged me, she would run her fingers through my hair, and she did it for the last time today. As she left I felt sad, but I also felt optimistic because I can now live in peace without carrying that burden of wondering if she is cheating on me. From now on, my life is just me, my family and friends and of course my pets. Thank you all for the kind words and encouragement. If anything else happens, I’ll try to remember to update. But until then, I’ll see you all around. \n\nEdit #2: Wow thank you guys so much for the words of wisdom and support. To answer some frequently asked questions, since there’s too many responses to reply to individually I’ll post them here. \n1. After this, I don’t have any intentions to ever get back together with her. She made it known who and what she wants, so I am going to put all of my energy towards my job and family and friends. Even if she does come crawling back, I will not have her number and she will have no way to contact me.\n2. I wasn’t her first boyfriend but I was her first serious one. We got together when we were 19. I met her while I attended college and she worked at this restaurant just outside of campus. We were each other’s first couple milestones. Such as moving in together, getting animals together, giving a good part of our lives to each other.\n3. I know there is better for me out there. Thank you guys for picking me up. For now, I will only focus on furthering my career and being the man of my family since my dad passed away in July. When it’s time for me to date, I will know. In time, I will find the right one, a great one. \n4. With the suggestions of my friends and most of you, I am going to get tested Monday morning. I don’t think there was anything being passed around, but you can never be too careful. So yes, Monday morning I’m going to make sure nothing is wrong. \n\nEdit: I appreciate the advice about how NFP is not a form of contraceptive, I get that. It’s definitely not something to do if you don’t want children. However before this cheating and sneaking around began, we were headed towards marriage (me planning on proposing for our 6 year anniversary in January) and wanting to start a family right away. For us and the state of our relationship at the time, and specifically for my latex allergy, we were comfortable with doing that. We were committed to it and had no problems or scares during the 5 years we were doing it. It doesn’t work for everyone, so please be careful. Please, guys, the last thing I want is to be scolded that I shouldn’t have used that method. I’m just looking for some pick me ups and kind words. Let’s put all that other stuff aside. Thank you.\n\n\nSo update as of yesterday, I asked her how come she had grown so distant. She didn’t give me any sort of answer, so I just asked. “Is there another guy?” I got her to confess she had been seeing a guy she met on tinder. She told me that I just wasn’t the one for her. She got no satisfaction from me anymore and that I was just a weight in her life that kept her down. For the record, I haven’t stopped her from pursuing her dream career, even though we sacrificed an income for her to do so. I have always been respectful of her needs and wants. I like to think I have been a decent boyfriend to her. She asked for an immediate break up, because she was gonna move some stuff into the new guys house. I told her that was fine. But she had to get her stuff out at once. I didn’t want her to come back two and three times a week to get her things. She wants nothing to do with our pets so I am keeping the cat and giving the dog to my mom, who could use some company since my dad passed away a few months ago. It’s really hard to see how cold she was. No tears or sense of regret. So tomorrow (Saturday) she is taking all of her stuff in her dad’s pickup truck and moving to that guy’s house. I asked her how long this had been going on, and she said 2 months. It’s a little bit nauseating because we had still been sleeping together in that time. I appreciate those of you looking out for me, telling me to use condoms, thanks! But we were doing that Natural Family Planning, where she tracked her fertile days and all that, so we weren’t gonna get pregnant unless we actually tried. I’m sad because this is a woman I’ve grown to love and essentially have grown with as an individual. I just can’t believe how much she’s changed over these past couple of weeks. Hopefully she finds what she truly wants and is happy.\n\nTLDR- my girlfriend I suspected of cheating on me confessed. We broke up and she is moving in with her new guy.",
        "permalink": "/r/relationships/comments/djp7r1/update_i_24m_think_my_girlfriend_25f_is_cheating/",
        "comments": [
            "when she comes back, because oh, she will, she may make a stink over the pets once you reject her (oh god PLEASE reject her). if it’s not your name on all the vets bills and electronic chips, change it to only yours asap. ideally, get it in writing from her that she is ceding full ownership to you with no future rights or claims. and good luck, man. you deserve so much better than this, and i know it’s out there for you.",
            "lol she’s moving in with a guy she met on tinder after being with someone for 5 years?\n\nwhen she realizes the mistake she made and begs you for another chance, remember how you’re feeling right now",
            "Can you imagine being the other guy in this?  Why would you get into a relationship with someone who is still living with and sleeping with her boyfriend and let her move in after so short a time?",
            "You should get checked for std’s if you weren’t using condoms.",
            "I’m sorry bro. That’s savage and I can imagine how much it hurts. Ask her why she didn’t just tell you she’s unhappy and breakup like adults? Why cheat and hide and lie and neglect her animals? (You dodged a serious bullet here. And THANK GOD you didn’t get her pregnant.)\n\nRemember the adage: “how someone treats you is a reflection of them, not you.” \n\nMay you both find peace.",
            "She's scum. She met a guy in Tinder and after 2 mos of dating moved in with him. LOL she's asking for a world of hurt, and she's going to get it. Just desserts here, you dodged a bullet.",
            "I had a feeling this was going to be the end result. So she is perfectly ok with throwing away a half a decade relationship for some chump she met off Tinder, you know what? Let her sorry ass go and have no regrets that you're free from this toxic waste of space. That just show's what kind of a terrible person she is and count your blessings that you two never married or had kids together. \n\nJust remember, when her new relationship fails when the new wear's off, remember this day and what you're feeling now. Make sure that you block her on everything.",
            "I'm sorry to hear this shit, dude.\n\nTwo bits of advice:\n\n1. STD test, asap. Who's to say there aren't other guys? And you don't know how clean any of them were (or him if it's just him).\n2. When she tries to come back to you when they collapse, do ***NOT*** let her back in. Remember how hurt and betrayed you feel right now. Know that she had no qualms in cheating on you for two months. Know that she threw away y'all's relationship for a quick fuck. This isn't your fault, this is her's.",
            "Sorry you're going through this. You're better off now knowing the truth, but that doesn't make it easier for you now.\n\n> It’s really hard to see how cold she was. No tears or sense of regret. \n\nWell, that kinda makes sense, no? She's already gone through any issues she's had with the relationship and moved on. It's fresh for you - it's old news for her. \n\n> I appreciate those of you looking out for me, telling me to use condoms, thanks! But we were doing that Natural Family Planning, where she tracked her fertile days and all that, so we weren’t gonna get pregnant unless we actually tried. \n\nOh boy... um, please, PLEASE do not be this naive in the future. First of all... she was cheating on you, so you already should have realized you shouldn't have trusted her. Second of all... NFP isn't anywhere nearly as effective as actual contraceptives. I have a friend - devout Catholic - who practices NFP with his wife and they both swear by it. They've had 4 kids in the past decade, which they explain as \"God knowing it was the right time(s) for us, when science told us it wasn't!\" The human body is weird, and can human observations can be faulty. Use actual contraceptives unless you want to have a kid. \n\n> Hopefully she finds what she truly wants and is happy. \n\nHoping the same for you, mate!",
            "Please OP, when she comes back (let's be serious, a 5 year relationship to 2 months of Tinder to moving in already? hahahhahahahahahahahhahahaha) tell her, coldly, to get fucked and never show her face again.",
            "I can almost guarantee you she will come back begging in a few weeks. Just remember your words in this thread when that happens.",
            "Dude, be glad you know for a fact without a shadow of a doubt that she cheated. You can move on now. Feel sad, feel broken, feel down but know that that is just temporary and it will pass, her cheating will not. You will be better",
            "Yeah that relationship is going to work out.  Block her number for when she calls in 3 months looking to move back in.",
            "Remember, she will be back once the reality of the situation hits her. \n\n&#x200B;\n\nYour biggest loss will be allowing that to come back.",
            "I know it hurts but she said the things she said to releave herself of the guilt from what she did wrong.  It's what cheaters do.  They deflect the blame of the cheating to you like you did something wrong to cause the cheating.\n\nYou may have had your issues in your relationship but instead of choosing to work through her issues with you or at minimum, leaving, she chose to go behind your back and cheat.  Believe me, you are so much better off.",
            "Oh son.  Natural family planning is great, but it's not foolproof.  You do NOT want to get pregnant until you're 10000% ready for it.  Please, use non-latex condoms in the future.",
            "Natural family planning isn't effective like condoms. Semen can hang out for a couple days, menstrual cycles can change for a reason and no reason at all. Please do some research and stick with condoms! :)",
            "So she actively went out of her way to find somebody else while she was with you. \nI personally have little respect for people who have to have somebody to fall onto to leave a relationship they're in. \nWhat, couldn't she stand the thought of being alone? \nIf she was that unhappy couldn't she have done the right thing and left you months ago?\nEven leaving behind your pets like that says a lot about her character imo.\nKeep on keeping on, op - I have the suspicion that you dodged a bullet, and even if right now it smarts, one day you'll thank the stars that you were so lucky.",
            "I’m so sorry and I agree with other comments, don’t let her come back because she will definitely try when she realizes she messed up. \n\nMy husband and I did NFP til we were ready to have children. Then when we were ready to try for our children, we conceived each time in a month or two. We have 3 kids and it worked for us for years and we got pregnant easily when we were ready to, all three planned. He did have a vasectomy when we were done having kids though. \n\nAnyway, just saying don’t let people birth control shame you lol, we felt the same. An unplanned pregnancy would have been fine but it all worked out for us.",
            "You should also block her on all forms of social media. I had a girl cheat on me and when I would see photos of them together it was gut wrenching. Eventually I blocked her on everything and just sort of forgot about her.",
            "No contact and show no mercy when she wants to come back.",
            "It sounds like she thinks a relationship should be fireworks and butterflies 24/7.\n\nShe has committed such a major fuck up that I'm cringing just thinking about how hard she's going to regret this. You sound like a nice guy, you were going to propose and have kids with her, you supported her pursuing her dream job. And she threw all that away for some random stranger she met online.\n\nI cannot even imagine the sheer amount of regret she's going to feel when the honey moon phase with this guy wears off.",
            "> It’s really hard to see how cold she was. No tears or sense of regret.\n\nTry not to feel too bad. If she's been cheating on you for a while, she went through the breakup a while ago. She's had a long time to emotionally process it. She's just going through the formalities now.\n\nWhereas for you, everything is fresh and raw.\n\nAt least she came out and said it instead of continuing to lie to you.\n\nCongrats on your clean break.",
            "Damn dude, that's rough, but I'm glad you are getting away from her.  \n\nI'm really sorry things worked out this way for you.  I'm here if you need to talk.",
            "> It’s really hard to see how cold she was.\n\nThis was the real her all along. Don't ever sacrifice from your career or your ambitions for a woman again.",
            "you may not listen to this but don't date anyone. for 6 months to a year. i suggest a year to just work on making yourself better at something.",
            "I don’t see why everyone is giving you shit. You were in a committed relationship together, and you said yourself that if you guys got pregnant, it wasn’t an issue. What works for you works. Fuck everyone else giving you a hard time about it.",
            "I'm sorry that happened to you, OP. Truly, it sucks to be cheated on and lied to. But be prepared for her to come crawling back to you when it inevitably doesn't work out with the new guy. Stay strong, and be sure to tell her you're not taking a cheater back and that she's on her own.",
            "As much pain as you are in now, I really believe that after a little bit of time passes, that you will look back and be glad this happened. She was checked out of the relationship, seeing someone else, putting your health at risk, lying to you, making you feel bad about yourself, and too cowardly to be honest and up front with you.   We have very little insight to the dynamics of your relationship and who both of you are as people, but I have no hesitation in saying that your ex is garbage.   I think as time passes you will see this too.  Best of luck to you in your healing process.",
            "There are non-latex condoms too mate.\n\nOther than that I'm glad you got that weight off of you. I'm sorry that it sucks but its better off that you find someone who is open and direct with you.",
            ">She told me that I just wasn’t the one for her. She got no satisfaction from me anymore and that I was just a weight in her life that kept her down.\n\nYet she didn't end the relationship? You were her back-up plan in case new guy didn't work out. And it won't. She's only known the guy for 2 months and is already moving in? Yeah... remember this when she comes crying back to you.",
            "once a cheater ... Took back a girl, once.  Never again.\n\nWhen she comes around to realizing what she lost and starts cheating on him, looking for what she lost, maybe you should get the guy's contact info, because she will, and it will be you all over again.",
            "She'll have a sense of regret when the honeymoon phase wears off and she living with someone that things aren't working out with. As much as it hurts, she did you a favor. It would be a lot more difficult with marriage and kids. Just remember that this is the hardest part. Take this time to work on yourself and things will get better every day. There's a day coming where you are happy and with someone that won't do something Like this. While she hurt you, you've probably learned a lot about being a good partner from this relationship and that is experience that you carry forward to your future relationships.",
            "Hey OP, while I think she is totally in the wrong here i did notice you said your dad passed away a couple of months ago. I'm no therapist, but you now had two traumatic experiences in the last couple of months. So maybe it would be good to talk to someone? I guess that depends on how you feel mentally but at the same time you might not even be in the best mental state to notice that you are not doing well. \n\nI guess you can talk to your family or close friends to see if you have been different the last couple of months? It might be nothing but what harm can come from checking",
            "you know what you call people who use natural family planning?\n\nParents",
            "Please please please when she comes back crying and saying that she made a mistake, tell her to fuck off.",
            "I'm so sorry to hear this, it is heartbreaking when one person ends a relationship in this way. I know you won't realize it until many months or years later but she has done you a favour. You dodged a bullet. She has shown you her true character and it isn't pretty. Take the time to grieve properly and then move on. She'll probably realize very quickly she made a mistake but don't take her back.",
            "You were still having sex in those two months.\n\nShe could have given you STDs. That’s disturbing and disrespectful to you.",
            "You are so mature in this scenario. I would be losing my shit personally. And to be so logical and coherent in thinking and decision making is a gift. You are young, and have so much time ahead of you. Good luck!",
            "Just remember - your feelings aren't dependant upon her actions. How you feel about her is just how you feel. Love is unconditional, positive regard. Her cheating and saying she doesn't want to be with you is a condition. If it doesn't change your regard for her, that's ok.\n\nShe won't be the last person you fall in love with. But, she may be the SHITTIEST HUMAN BEING you'll fall in love with. \n\nBecause how you feel about someone doesn't CHANGE who they are. Feelings and their character, failings, emotional and mental health... these have nothing to do with your feelings either. Sometimes people love other people who do not \"deserve\" that unconditional positive regard. That happens, and even though I'm a stranger...\n\n&#x200B;\n\nI'm proud of you.\n\n&#x200B;\n\nI'm proud of you for loving yourself enough to stand up for yourself, follow the truth, and deal with the painful experience of ending that one-sided relationship so that you can be happy and healthy. Because you deserve those things. \n\n&#x200B;\n\nAnd please, remember, not all people are like her. Not every person is going to cheat. Not every person is dishonest or cowardly.\n\n&#x200B;\n\nYou're enough and you will be just fine. It's ok to feel sadness and pain, but please try and focus on why you should be GRATEFUL this happened now rather than finding out after she got pregnant or something. You are 24. You have PLENTY of time to find a partner who is WORTHY of your integrity, patience, and self awareness. You'll find them.",
            "Make sure  you spare a dollar for when you see her on the street in a week or two. Moving in right away? Yeah thats gonna bite her in the ass.",
            "Is it weird that the part I don't understand the most is how she wants nothing to do with the pets and was actively neglecting them, she just sounds like a shit human.",
            "It is VITAL that when she tires of the novelty dick that you remember this feeling and tell her to fuck right off when she tries to slide back into your house and life.  VITAL.",
            "Wait\n\nShe's moving in with someone she met 2 months ago?\n\nWhen she comes crawling back, tell her to fuck off\n\n&#x200B;\n\nYou're single now. My advice? Get fucking SWOLE",
            "Do not take her back even if she begs.  She may do this again later down the road and it is alright to forgive her, but never forget how she made you feel at this exact moment.  Now is a good time to focus on yourself and focus/better yourself (you did nothing wrong but this will help your mental health), and to find happiness in yourself right now.",
            "Well, just be prepared for the scenario of her blowing your phone up because the New Car Smell wore off new guy.  Moving in after two whole months, hoo boy.",
            "I normally try not to judge people based on them making their own choices and mistakes in life, because nobody is perfect. But holy *shit* has she made a mistake.\n\nDon't forget how cold she was when she left you, because this will most definitely not be the last time you hear from her.",
            "Damn. A very similar situation happened to me over the last two months.\n\nWe were living together and she became distant and argumentative over several weeks. I handled it very poorly and now we are broken up. I don’t think there was another person in my situation but anything is possible, maybe a emotional cheating situation. I deeply regret my reaction and I suspect we will be getting back together at some point, once she figures out her shit and I figure out mine. \n\nI am doing better now and I am working out a ton, running a half marathon this Sunday on only a few weeks of training, and I am going extra hard at work and my future career goals. Do all these things and more. Pick an instrument etc. \n\nJust reflect everything inward and realize everything she is doing is a reflection of her relationship with herself, and nothing to do with you. \n\nGo see a therapist, hang out with your friends, say yes to every opportunity. Go hang out with your mom. \n\nDownload tinder/bumble and just have some fun, doesn’t have to be anything serious.",
            "If you take her back she's gonna have even less respect for you",
            "> She told me that I just wasn’t the one for her. She got no satisfaction from me anymore and that I was just a weight in her life that kept her down. \n\nThis is the line that matters. She is the weight that keeps herself down and is looking for a scapegoat. You're unfortunately the scapegoat.",
            "It's incredible how people act when they're operating from a perceived position of strength. If she didn't have another place to go I imagine she wouldn't be so cavalier about exiting the relationship. Especially considering she was going to let the situation ride for who knows how long.\n\nSorry for what you're going through, that's really hard. I'm also sorry you have to give up your dog :(",
            ">I got her to confess she had been seeing a guy she met on tinder. She told me that I just wasn’t the one for her. She got no satisfaction from me anymore and that I was just a weight in her life that kept her down. For the record, I haven’t stopped her from pursuing her dream career, even though we sacrificed an income for her to do so. I have always been respectful of her needs and wants. I like to think I have been a decent boyfriend to her.\n\nShe had to blame you because she's too weak to accept that she's a garbage human being. If it was your fault somehow, she doesn't need to feel guilty about being this shitty of a person.\n\nIt was nothing you did, she's just a pathetic weakling. You should feel relieved you found out now what kind of person she really is. She's a complete loser and you're better off without her.",
            "The thing I hate the most about this is you don't accidentally meet someone on Tinder. There were so many steps here to get to her not only cheating on you but starting another relationship while still in one with you.",
            "You should put your edits after the original body of text",
            "This is fucking horrible and I'm sorry it happened to you. People seem to take advantage of those who truly care for them and it will only be a short time until she realizes her mistakes. It's not easy after being with someone for five years but I truly hope you find someone better. \n\n1) take a break from relationships and just take a few months for self reflection\n\n2) when you're ready you can get back in a relationship, and only if you absolutely want to\n\n3) DO NOT have a friendly relationship with her. She's not one of those chill exes you can be friends with. long before you know she will be taking advantage of you once again and lure you back into a relationship. Block her on all social media and block her phone number. Do not ever look back.",
            "Heads up bro she's going to come back I have a gut feeling and when she does you will be so far in life to even look back, from now on carry yourself like a high value man and be careful who you let in your life, I'm going through a break up too so with you brother!",
            "Please provide updates on everything!!!\n\nI can guarantee you, GUARANTEE YOU 100% that this is not the last that you have heard from her!\n\nShe's going to come crawling back, crying, begging!\n\nPlease don't take her back! Don't even respond to her at all. However if you must responds, Just be smooth and say \"Really I thank you for everything because the last X amount of time I have learned so much about myself and I am really in a great place, I hope you're well, take care\"\n\nOoooou it's gonna cause her blood to boil that you're doing so well without her!\n\nEither way chin up and do you my guy!",
            "Find out his contact info,wait until she has moved in with him, and then let him know the last time you two fucked. If she ever contacts you again, do not respond. If she approaches you personally, walk away. If she persists, restraining order.\n\nHe may have had no idea, and deserves a heads  up.",
            "Sorry man, it sucks but if they'll cheat once then they'll cheat again. Its better to cut someone out of your life their willing tk tell you tell love you, then mess around behind your back and then tell you your nothing but a weight in their life. Ive got so sympathy for cheaters and your better off having figured it out.",
            "As shitty as cheating is regardless there is something even more gross about making a tinder to seek it out, it’s like the difference between 1st and 2nd degree murder.",
            "try r/survivinginfidelity\n\n\" But we were doing that Natural Family Planning, where she tracked her  fertile days and all that, so we weren’t gonna get pregnant unless we  actually tried \" this doesnt work and is not really reliable.\n\ntake an STI test",
            "Just remember when she comes crawling back to kick her to the curb immediately and not give her the time of day.",
            "This was not your fault, you didn't do anything wrong. Sounds like your gf was a jerk and you are better off without someone that cheats, lies, and wouldn't break up with you even when she felt you weren't right for her (spoiler alert: no one will ever be the right one for that kind of person.) \n\n&#x200B;\n\nAlso, natural family planning is NOT a very effective way to prevent pregnancy. In the future, condoms and birth control should always be used to avoid unwanted pregnancy.",
            "Dont ever do natural family planning again. You dodged a major bullet not getting her pregnant",
            "I'm sorry. You sound awesome. At least you know what's up and didn't waste any more time and effort than u had to. Good luck",
            "This is what she has chosen and even though it sucks (and is most likely a mistake) it’s meant to be. Sorry for your situation though that was really hurtful of her.",
            "I'm really sorry this happened to you. At least you know now and move on and another reminder to get check asap!",
            "Go get STD tested.  You haven’t been sleeping with just her if she’s had sex with someone else.  Sometime STDs can be asymptotic so even if you’re not showing symptoms you may still have one.  \n\nChances are good that you’re clean, but a co-pay is a small price to pay for piece of mind.",
            "Please make sure you get tested for STDS who knows what her new fling has....",
            "Probably for the best man, keep your head up and keep working on yourself. \n\nOh and you should just pack her stuff out and leave it by the curb before Saturnday comes. It will help avoid unnecessary drama/ e. Otions being stirred. \n\nGL",
            "Wow.. I am so sorry man. You've handled this very maturely. Your ex girlfriend is an idiot, however. I'm willing to bet that one day you will look back on this and be glad it happened, because this is just another step in the direction of where you're meant to go. She showed her true colors. Now go live your life to the fullest :)",
            "The same damn thing happened to me. The coldness, five plus years of thinking things were great when she hadn’t cared about me for over a year, all the while still sleeping with me while also sleeping with another guy. A guy her friends basically set her up with while still pretending to be my friends as well. She lied and took money from me over all that time. Made it near impossible for me to ever trust anyone again.\nDO NOT take her back. No matter what. People like that don’t change.",
            "Your a young dude with plenty of opportunities...the time to yourself can.make or break you. Make sure you are taking advantage of the opportunities of being single and continue to work on yourself as an individual",
            "I’m curious as to why people think she will come crawling back to him. I don’t have much relationship experience is why I’m wondering.",
            "This sucks, but you dodged a bullet for sure. At age 24, you have plenty of time to go find Miss Right.\n\nI dated a girl off-and-on for 4 years when I was in my 20s. Thought I would marry her. But she was a bit immature. At one point she took off to go wait tables in London for 6 months, basically putting out relationship on hold. Even though she was college educated, she did volunteer work, and basically screwed around. No interest in starting a serious career.\n\nFinally, she breaks up with me over frivolous reasons. Was she cheating? I don't know, and it doesn't matter. Like your girl, she was pretty cold about it too --just walked away. Over a year later she calls me up one night and tries to get back into my life. By that time, I was dating the girl who would become my wife (married 19 years now). I gave her the cold shoulder and pretty much sent the message to get out of my life.\n\n8 years later this girl married some seriously ugly dude that must have been 10 years oder than her. So once she was done partying, some low-quality guy now fills the void.\n\nSo don't worry. Trade up and never look back",
            "When she realizes how bad she messed up, please don’t take her back. \n\nI’m proud of you. People can be horrible, even the ones you trust the most. I hope you find someone good for you. In the meantime, you pick yourself up and you grow from this. Hats off to you, stay strong.",
            "man......two months and moving in with him. Some people are crazy.\n\nI've told my gf I'm not even sure at a year that I'll be comfortable moving in with her.",
            "The tone you write this down with, I get the feeling you're handling this so maturely that not a lot of people could do in similar situations. I hope you get to feel at ease soon.",
            "Delete her everything, never speak to her again.",
            "Don't take her back when it doesn't work out with the other guy. It's a her looking for happiness in all the wrong places thing not your problem now.\nYou deserve better and someone who has more ambition she clearly didn't appreciate u.\n\nAs a child who had a dad like u and a mum like her she's not worth it do not have kids with this woman.",
            "I can’t even change a habit in two months. I look back and cry at the me who thought that was an acceptable time to know someone before living with them.",
            "She was never yours. It was only your turn.",
            "Been there, done that, my dude. \n\nHer relationship with some random tinder fellow probably won’t last forever. When it turns sour, she’ll realize what a shitty person she’s been. That, or she’ll keep swinging from one guy to another to avoid confronting the real issues at hand. \n\nEither way, it’s something that I’m glad you dodged before entering marriage or having kids. Take it as a positive.",
            "!remindme 2 months that's how long I'm giving her and the dude off tinder. Good luck King 👊",
            "now she's his problem.",
            "1. Get tested. 2. I am so sorry this happened. She's such an asshole for doing that. I'll never understand why people don't just leave. The pain of being cheated on is such a deeper cut than just breaking up.",
            "Really sorry that’s what was going on! It’s good that she’s leaving soon. \n\nI don’t know what kind of boyfriend you were but the way you talk about the situation is very respectful, while her behaviour is deplorable. So I’m taking your side on this one.\n\nNo good partner starts surfing Tinder, cheating, and then moves in with a guy she’s only known for 2 months without any tears or remorse. As sad as this is for you, it sounds like you dodged a SERIOUS BULLET. These are not the actions of a stable person with empathy and integrity. And that’s the bare minimum you want in a partner and mother to your children, right?\n\nGood luck to you. You sound like a good guy and I’m confident that you’ll have someone new and wonderful and be back on track for a lifetime partnership in the relatively near future. Please don’t let this horrendous experience tarnish your view of love. There are good women out there and I hope you’ll be able to reflect on this and see the early warnings signs of her personality so you can avoid that type in the future.",
            "At least it is done and over with and you can grief then move on.",
            "Silver lining.. this did t happen after you guys married..",
            "T-Minus 2 weeks she’s hitting you up.  Stay vigilant my friend.",
            "this is so sad..:( sorry OP",
            "she was a true sneaky cheating coward. good riddance",
            "wow, bullet dodge, my friend.",
            "This may not seem like it but you dodged a bullet. Imagine if this happened after you married her, or after you've had children so much more complication. Sucks to see people you love not care about you anymore but nothing you could do. Mourn the relationship and move on and if and when she comes running back, laugh on her face and close the door.",
            "This is shitty but I am really excited for you to be able to start a new chapted in youd life. I hople you find someone that would never tdeat you with such terrible apathy.  Focus on your dreams and start a new hobby.  Your life is your own; find things to be grateful for. She wasn't one of them.",
            "> It’s really hard to see how cold she was. No tears or sense of regret.\n\nTry not to feel too bad. If she's been cheating on you for a while, she went through the breakup a while ago. She's had a long time to emotionally process it. She's just going through the formalities now.\n\nWhereas for you, everything is fresh and raw.\n\nAt least she came out and said it instead of continuing to lie to you.\n\nCongrats on your clean break.",
            "Holy shit man! I'm so sorry you're going through this. It really bothers me when people are that callous and cold. She was so matter-of-fact about it when asked. It'll hurt, especially because her attitude seems so unaffected but you totally deserve better!",
            "Keep your head up. When you reach your peak again, just think about the hard work you went thru to get yourself out of that valley of a low. You will be the strongest person backing you up.",
            "She’s setting herself up for a rough ride, just remember how you feel when she asks for you back. A",
            "Take solace in the fact that when this relationship with her new guy implodes in short order, you'll be able to remind her of all the stuff you told us about how supportive you were, and then tell her to get lost.\n\nYou deserve better.  Go find better.  But take some time first.",
            "Her loss dear. And she's awful for cheating on you. Give yourself time to heal and NEVER take her back. Hang in there. It will get better for you.",
            "I'm sorry OP. You definitely deserve better. That new relationship is most likely not going to last, and she will realize it when it's already too late.",
            "You will meet someone that will respect you and love you equally. You deserve that and good on you for being logical and calm even in this situation. You will find the right love for you, not someone that will break your trust! Hope you're well!",
            "lol i rmb reading that book from Lori Gottlieb where a lot of people sacrificed a good relo for contemporary butterflies.",
            " The reason why there were no tears was because she already broke up with you 2 months ago. It's so fucking shitty man. I'm so sorry to hear this. Betrayal is really rough. You're dealing with a completely new reality that she's been living for 2 months. What played out during the course of 2 months all got fed to you within seconds. That is so much to deal with at once. Hang in there. Things will get better. I've gone through similar things. I think you really dodged a bullet. Imagine you never said anything, got married, and you had no idea that she was so heartless. As truly horrible as all this is, I'm glad you got out before things got even more serious. Good luck with everything moving forward!",
            "OP good redience of tha piece of crap. now your a free man to improve and date better quality women",
            "From experience. \n\nIt always seems happy on the outside because its new and exciting. \nWhen its not and it crumbles she will be back. \nDo not be disrespectful,  do not be vengeful.\nThe best revenge is living a happy life without her.",
            "I’m really sorry. It’s so hard going through these kinds of things and really challenges the amount of mental strength we have/can achieve. That’s what I hate about relationships.. that uncertainty of not knowing. Someone can say they love you and want to be with you all they want, but words are words and the actions will always speak louder. It’s very sad when two people (or one person) grows apart as well. \n\nI try to remind myself that life is always changing, everything in this world is always morphing. Nothing ever stays the same, including us. It’s inevitable and something you can’t avoid. So although you may be feeling terribly sad right now, it’ll pass...because it has to. Keep caring for you and someone will come along who you didn’t even expect and I guarantee it’ll be more amazing than the last, you’ll see.",
            "Bruh, it's gonna hurt hella bad. Allow yourself to feel the hurt because there will come a day when you won't even think about her much less feel anything for her. Remember that it's her loss and not yours. You deserve someone who doesn't give up once things go sour.\n\nKeep your head up! You'll get there!  \n\n\n\\*P.S. I love how the reddit community is so supportive. Love you all",
            "This is my biggest fear tbh",
            "Her story doesn’t add up, she gave up 5 years and ready for kids over 2 months? I don’t think so, she must’ve been cheating for months and months and months",
            "How long was she going to wait to tell you if you hadn’t asked? \nI fucking hate cheaters. Have a backbone and break up before you cheat.",
            "Don’t take her back if she comes crawling to your door. Fuck that shit. She’ll only do it again. And shit like this isn’t easy to move past trust me. Let her go and know it’s her loss. Move on and find a good woman who won’t fuck around on you.",
            "Oh man she's fucking cold hearted. I am so sorry you're going through this. The fact that at this stage you can even say you hope she finds her happiness... Well it's a lot nicer than I would put it. But you seem like an alright dude. I'm just wondering, you seemed almost okay with all her responses? Not in the sense that it was alright with you,  but to me you seemed passive - like all right this is happening I guess, goodbye then. I may be wrong on that but - did you stand your ground and let her know the pain you went through and how wrong she was? Or were you just fed up at that point?",
            "Bro, 100% she’s going to come crawling back. It’s not if, it’s a matter of when. Don’t go back when that happens. Once a cheater, always a cheater. It’s hard now but you’ll get through it.",
            "What a trash bag of a person",
            "Remember to post here when she decides she wants you back, and show her the replies\n\nEdit:spelling",
            "She’ll run back to you eventually, OP.\n\nDo yourself a favor and don’t take her back.",
            "Sorry to read this dude. This is going to sound odd, but the universe gave you a gift of this happening now instead of down the road. If you two were married and/or had kids, things would have been a lot worse.\n\n5 years is a long time to invest in one person. Take as much time as you need for yourself and take it a day at a time with your emotions. You'll get through it. :)",
            "Hey, I'm really sorry this happened. I'm sorry for the loss of your father as well, and it seems that a lot of people don't know how to handle it when their partner is grieving, and they end up distancing themselves and causing even more hurt. Sounds like you're better off without her. She wasted 6 years of your time, but now you can move forward and you no longer have to worry about her and what she's doing.",
            "Bro. Man. I went through that 2 years ago. My gf of 10years left me suddenly, me and my daughter. She moved in with new bf really fast and she had a baby with him within the next year.\n\nMoving out of a relationship to get in another one is almost never a good option. She might be cold because she denies what she needs to face. It will come back to her quicker than she thinks.\n\nAs for you, I am really sorry. You are strapped in the rollercoaster of emotions and you cant get out. You are in for a wild ride, but stand strong and take care of yourself. You will get out of this a better version of yourself. Believe me.\n\nTake care bro, these shitty feelings will pass , I promise. Something bigger is waiting for you.",
            "I’m so sorry. In the long run this is a good thing, especially how callous she was- but I can only imagine the mixed bag of big feelings you’re dealing with right now. Shitty, mindless tv is your friend right now. \n\nOn another note that should be said even though it sucks, go get tested. Not just right now, but in six months and a year. Some things take time to pop up and if she was that callous about the one guy, there’s a good chance there have been others.",
            "You made the right choice.\n\nShe tried putting you down to dampen her own guilt, she knows she is wrong but her selfishness propels her towards her own wants.\n\nContinue to be strong. Congrats on losing her.",
            "I had this happen to me about a decade ago. My ex was about 25 as well, and I was too busy working to really notice. I knew we weren't in a great place, but thought we were working on it. Until she called me while I was on my way home to tell me she had moved out and would be living with her new bf..\n\nI wish I could tell you it ended the way your relationship did, it would have been much better for me. But my ex ended up coming back the very same night, because her living arrangement fell through. I felt bad and let her stay and she moved into my guest room for the next year. I am not a smart person sometimes!\n\nGood luck, it will get better. Plus being single in your twenties is a great time!",
            "So sorry dude. I just hope you realise that she's not the person you thought she was. Think how little she must think of you to treat you this way, when you treated her well. In reality you had a lucky escape. I was seeing a girl recently for a few weeks, all going great, then I suddenly get ghosted out of nowhere. No idea what I did wrong, if anything. Some people are just like this. Just think, now you are free to focus on yourself, and when you're ready, find a person that will truly love you.",
            "It was extremely shitty of her to put her toe in the water while still with you to see if she found something. Even with what she said about you and your relationship she didn't want to be alone to sort out what she wanted. Her dating life will go down hill for sure \n\nBest of luck to you OP. Hopefully you find someone with your time when you're ready. Don't rush the through the feelings of the breakup because they'll come back to bite you on the booty. Now would be an excellent time to invite friends over and talk, have a BBQ, or even some beers while smashing some video games",
            "As someone whose been cheated on....don't take her actions as a reflection of your own character. People who cheat are just shitty human beings, and it certainly doesnt mean that theres anything wrong with you.\n\nIts okay to be sad though, dont try to fight those feelings they will pass organically with time. Block her number, and all of her social media. I also threw away old pictures, gifts, and anything that was a constant reminder of my ex. Work on improving yourself and surround yourself with people you enjoy being around.\n\nAlso small silver lining here, but at least this didnt happen when you guys were married with 3 kids. You deserve to be with a better partner. Goodluck OP.",
            "My ex-wife of 7 years did this to me as well. She met a guy when she decided to start working at the 6 1/2 year mark? She quickly decided she wanted a divorce after a few weeks so I gave it to her. Guess who came back around for a little while? Yeah...no. Remember how you're feeling right now and stay strong once shit hits the fan with this.",
            "This is so fucked up. I feel so sorry you. Unfortunately you have spent so much time on a girl who made her bed because of short lived lust. You are clearly worth so much more, emotionally and socially. This is in no way your fault and she should’ve had the guts to end it before pursuing something so quickly. \n\nIn the end, you are better off without her. \nI hope you find happiness!",
            "Unfortunately, this is all text book stuff man. This same thing happened to me, and I don't regret any of it. We need these lessons to help jostle us out of the fairytale lives we make up for ourselves. People grow apart and change, especially at such a young age. She's probably so cold because that's what she needs to do to help herself move forward as well. The best thing to do is forgive her, move on and focus on yourself. Get to the point where you know you can be happy and take care of yourself. Don't worry about finding a replacement partner, do the things that make you happy.",
            "Yeah dude. You're too nice. Girls hate that. Boring. How do you think that is attractive? It isn't. Next time have some balls and make a girl wet.",
            "From your writing, I can tell that you are very positive and mature man. I hope you'll find your love of your life soon.",
            "WOW I am so sorry this happened while being simultaneously impressed by how you handled it all. You are a wonderful person. I know this probably sucks rn, but dang, you dodged a bullet by not marrying her, or starting a family etc. You will be so much better off. She truly sounds like a narcissist and she is discarding you because she has found a new supply. Also sorry for your loss, my mom died a couple months ago, I can imagine that makes all of what’s happening now even harder. Reach out if you want to vent! Find support from those who are healthy and love you, there is no space for toxic people and I am excited for you to realize how much better things will be without her. ❤️",
            "Can you just box her shit up and on Saturday have it out on the porch or hand it out? You don't need her in your home arguing about what she wants. No contact and communication with this... you know what, is better for your mental state.",
            "Don't ever let her back in your life. Trust me this isnt the last you've heard of her. Shell probably be cheated on at some point and then shell see what she did to you and will want you back.",
            "I'm really sorry this happened to you. Honestly it sounds like you dodged a bullet, and when she comes running back, don't let her back into your life.",
            "My ex gf of 3 years did something similar. We were doing long distance and she just kind of fell out of love with me. Started talking to this other dude before our relationship was over and started something with him as soon as we broke up. I didn't find out until about a month after we had broken up. I was just a sad sack of crap because I thought it was all my fault for losing her up until that point. Even after that point it felt like it took over a year before I found myself again. Until it got to a point where I was somewhat proud of the person I was.\n\nI remember the lack of closure being one of the reasons that prevented me from really moving on. I never got my answers and I dont think you should expect to get yours. \n\nI just moved on knowing that she decided to cut me off from her life. She had a choice to be a human being and a friend, but she decided that being cold was the best way to get what she wanted.\n\nShe chose to stop caring about you. I know it's going to take a while to really get over it, but I hope that one day you'll be able to choose to cut her out of your life and head space. She doesn't deserve that attention anymore. \n\nUse this opportunity to improve upon yourself. Are you happy with your health? This is your chance to treat yourself better by learning how to cook or exercising. Are you happy with how you look? Best time to start figuring out your sense of fashion is now. Do you wish you engaged in more hobbies? Figure out what you like and start having fun experimenting. Did you lose contact with some good friends and wish to hang out again? Take initiative to include these people in your life again.\n\nIt's ok to feel emotions about this. I fucking cried, got mad, reminisced about happier days. There will be some days where you feel fine, happy, jolly without her. And you will have some days where you miss the fuck out of her and wish you could talk to her. It's not going to be a constant up and up. Don't talk to her. Make it harder for yourself to talk to contact her. She already made her decision to leave you in such a cold way, and after 5 fucking years of your life. \n\nAt one point you'll realize that you're both not the same ppl that started the relationship. Things change. You'll realize that maybe what you miss isn't really her, per say, you just miss being in a relationship.\n\nI know it might be hard to see now, but you'll get through this. If you ended up reading this, know you're not alone. Better days will come, but only if we work towards it. Good luck man.",
            "My boyfriend’s ex cheated on him, while they were married, with a man that she met at a local arts center. She was modeling there to try to launch her modeling career, since my boyfriend is like you and promoted her chasing her dreams, and his guy photographed her. After my boyfriend divorced her, she married this dude. This all took place about six years ago. \n\nFew months ago she cheated on her current husband with a coworker of his that he invited over. She left him in the night, left a note saying she hadn’t loved him in a year. They have a son together. \n\nMy boyfriend also has a son with her, my stepson. I’ve been there when they trade off (she double books us now, it’s fucking awkward). She treats him like the next customer in line. Really cold and unemotional.\n\nSome people are just this way, man. It hurts now but you will move on to better things.",
            "Get checked for STDs.",
            "You deserve better. Her claiming that you are, \"dragging her down,\" is her own made-up justification for what she has done. People in committed relationships don't get on tinder.  She got bored and cheated. Don't let her use you if/when it doesn't work out.",
            "Don't take her back once she comes crawling on her knees begging for another chance. Become the best version of yourself and find a great gal who knows what she has when she has it.",
            "You know? This is the hardest part, but in so glad you confronted her and talked about it. I’m also glad that you insisted she get her shit out ASAP, and I’m glad that your mama is gonna have a lovely new companion pup. You did really well with all of this, fucking well done. And many blessings, too.",
            "Don't take her back. It'll be messy",
            "At least she isnet one of those people that just toys with multiple people at a time never intending to tell any of them those people suck",
            "Two things, you don’t accidentally meet someone in tinder. She made a plan to cheat on you.\n\n\nAnd the condoms are about more than pregnancy. If she’s running around on you there’s no telling what STIs she could bring home. Get tested.",
            "My boyfriend assumes this is what happened with his ex (who he was with for ten years). He finally left her after an extremely unhappy relationship, four or so months later she married an ex she's been in contact with the entire time.\n\n\nSometimes dumb shit like this is meant to be, and I hope it leads to a happiness that fills you up! Let time take it's course!\n\n\nGood luck friend!",
            "NFP isn't the most effective contraceptive, but you've got a more pressing issue. She has been fucking a Tinder match for months while still fucking you. It's possible that she's passed on an STI to you. Get checked as soon as you can. And don't fucking tell me that you haven't seen any problems. A lot of infections can be asymptomatic, especially the big hitters for your age group: chlamydia and gonorrhea. So make some time to get checked.",
            "I won't scold you for the NFP thing. But be aware that when her new fling goes south it's possible she'll come crawling back claiming she's pregnant so she has extra leverage. Make sure you get proof by having her pee on a stick. Don't trust any ultra sound she tries to give you because that's easily faked.",
            "I am very sorry about what happened to you.  Feeling worthless sucks, especially when it is caused by the ones we extremely care about. \n\nI kind of want to make you feel a little better by showing you that all the comments agree that nothing in all that is your fault. It's easy to blame yourself and overthink the question \"am I not good enough?\". From what you wrote I can see that you are very mature and generous. You didn't assume the worst immediately and tried to figure it out slowly, which is good! Also I don't want to say mean things about your ex, but it was clearly a very ugly act. She hurt you and acted/faked something and was very insensitive. \n\nYou feel betrayed and backstabbed, which is justified. Allow yourself to be angry and sad. Also I am pretty sure your cat can be a great support for you. My cat is slowly becoming my safe haven and helps me with my depression and anxiety. \n\nHugs :)",
            "I’m so sorry this happened to you. You sound like a decent human being just based on your post.  I don’t know you or your relationship but leaving a 5 year committed relationship to move in with a stranger of two months sounds like a big mistake to me.  Can’t imagine what’s going through her head. All you can do is put your chin up and keep going. I hope you can find a partner who appreciates you.",
            "Ahh, and a bodybuilder was born",
            "God, I can only imagine the pain that you're going through right now. I hope it gets better soon, and I'm so sorry it had to end this way. Shooting good vibes in your direction!",
            "I am so sorry. You obviously didn’t deserve this. She seems like she’s lost herself and is hurting a lot cause she doesn’t know what she’s doing with her life. Just remember, what your feeling now is what she’ll feel when her relationship goes down the tubes at an extreme.",
            "You hope she is happy, after that?  She is garbage.  I hope that guy kicks her out in the street.  Good riddance is what you should be saying.  Never take her back.\n\nBecause instead of expressing that she had problems with the relationship. She acted like everything was fine, while she found a new shiny toy, thinking that is the answer to all her problems. She did not treat you well, she treated you like shit even though you did nothing.\n\nFind yourself a good woman. Someday, she is going to look up your future wife's face book, and see the pics of your happy kids and cry.",
            "You missed a bullet brother this is good",
            "She'll come crawling back most likely, don't let her back in.",
            "She’s moving in with him because she can’t or doesn’t want to pay for her own place. Either way...good riddance",
            "women like her give us all such a bad name and it really ticks me off because it makes a lot of people in general very skeptical of the opposite sex when it comes to relationships . props to you for handling it so well, as much as it hurts you’re better off without her because now who knows how long she had felt that way . i learned this lesson the hard way .  \n\nalso: i would go through after she leaves and toss anything she may leave behind that isn’t actually necessary to be in your home . clearing her out entirely will be good for you in the long run.",
            "Were you her first boyfriend?",
            "Honestly I see a bunch of comments saying “screw her” and “she deserves whatever happens”. \n\nHere is some more productive feedback; don’t be concerned with how she is doing. Be concerned with readjusting to your usual routine. \n\nIt’s so easy to fall into a vengeful cycle for what she did to you, but it does nothing but waste mental energy. Do whatever it takes for you to recover and overcome. Just waste your time being mad",
            "Man I usually lurk but this one hit me.  I hope you're doing well man and hopefully you heal through this.",
            "Yeah she's gonna break up with that guy soon I can feel it",
            "I know it feels bad right now, but congratulations on avoiding something that would have only gotten worse the longer it existed.",
            "Okay, I lurk a lot here and you genuinely sound like a nice person, a kind of decent person.\n\nThis was hurtful to read:\n\n> She told me that I just wasn’t the one for her. She got no satisfaction from me anymore and that I was just a weight in her life that kept her down.\n\nI have recently (a month tomorrow) broke up with my ex. 5 years of love, moved together 2 years ago.\n\nAnd that's how both me and her felt about each other. Yes at some points we recognized the other person wasn't what we were looking for, we felt dragged down by that thought in our life, with that feeling, and we weren't satisfied at all.\n\nWhat I wanted to tell you was simply that you shouldn't take those words from her too personally or as things you lacked, or as it was your fault.\n\nSome people aren't made to be each other ones, no matter how many good memories you hold.",
            "Dont be too hard on yourself OP, being cheated on can make you feel like a failure. \n\nBut it sounds like you didn't really do anything wrong, and her decision is more to do with her and her wants. \n\nA lot of people change from the ages of 18-25, they find themselves, discover their values and often grow apart from their friends or partners they had in these years.\n\nA lot of people marry their first and because it was the milestone relationship, so there's a lot of investment. They stick it out for years and years but end up being miserable and feeling trapped at 30 or 40. Be glad this won't be your future. \n\nTake the opportunity to expand your dating experience (when you're ready) and discover yourself and what you want in a partner. Being mid-twenties, you're a lot more mature now and will be a more confident individual with his own identity. \n\nYou're young and have plenty of time to start over.\n\nWish you all the best!",
            "The pure lack of empathy or sympathy is really disturbing to me. That long and nothing? Hmm.",
            ">appreciate those of you looking out for me, telling me to use condoms, thanks! But we were doing that Natural Family Planning, where she tracked her fertile days and all that, so we weren’t gonna get pregnant unless we actually tried.\n\nOh no. I hope this is a satirical post. People who get VASECTOMIES can still knock someone up, pulling out using the Vatican Method isn't proper contraception.",
            "Get everything relating to the pets (microchips, tags, vet records, licenses, etc) in your name for the cat and your mom’s for the dog, in case she does a 180 when (not if) things go south with the random Tinder dude. Hell maybe even get her to sign something saying you’re taking full ownership. Double hell maybe get that notarized.\n\nAlso I just noticed how recently your dad passed I’m sorry you’re dealing with these two things back to back.",
            "What goes around, comes around OP. She’ll get hers. \n\nThat same guy who was cool with her sneaking around behind your back will be cool with doing the same with someone else.",
            "So basically she started cheating on you with some dude from tinder right after your dad died??? Holy shit dude, I am so sorry. My dad died last year and my boyfriend was my rock...I can’t imagine going through this so soon after losing a parent. You deserve so much better. I know it hurts now but I’m so glad you got away from such an awful person.",
            "It’s really hard to see how cold she was. \n\n\nThat part is easy for women because they can not love you the way a man love a woman. When they have determined that you no longer provide what they want they turn off their emotions for you.",
            "She will be back soon. Do not be plan \"B\".",
            "Don't take her ass back if she comes back.",
            "I'm sorry to hear that man. Specially since your father passed away not so long ago. I'm sure it must be hard to be in your position right now. But things will get better, and trust me, you are a good person and worth it. If she really did all that, being so cold, then she really has some issues. Nothing you could do to prevent that.   \n\n\nWish you all the luck and a happy life, wish I'm sure you will have. :)",
            "Well, if she ever realizes what she did was wrong, and messages back to try and reconcile, you can respond with:\n\n\"You could not live with your failure. And where did that bring you? Back to me.\"",
            "I know exactly what kind of dude just preyed on her, she is gonna be fucked up yo. He told her every sweet nothing she wanted to hear and she is infatuated, moving directly in? I that's gonna be hell of a shit storm. Well if she was looking on tinder you dodged a bullet and 18 years of child support.",
            "Branch swinger detected.\n\nI’m sorry this happened but it’s over now and the best thing you can do is block her on everything and move on with your life.",
            "Once she's moved out, change the locks.",
            "Honestly... good for fucking you man! I’m sure it does hurt that she was so emotionless but this dude she met was off tinder. I GUARANTEE she will be with this guy for a bit and then realize what a great guy you were. But by the time she figures it out, you would have built a great life for yourself and find a girl that will love you correctly.\n\nBuild your empire and thrive mf.. you should look at this as a blank canvas!",
            "She’s doomed so naive of her to move in with a guy she’s only met for two months lol!!!. you dodged a bullet right there! Have an excellent life!! You deserve much much better.",
            "This is really sad. But I'm sure you'll get through it. I hope you take time for yourself and just heal from what happened. And remember there was nothing wrong with you. Most people who are cheated on, tend to think that but it's not the case. Cheaters are just bad people who don't know what loyalty is and have their own issues. She was the bad one and isn't the one for you. It's probably going to suck for a while but just focus on everything good in your life. And you got to keep your cat, which personally I think is a great. I know you'll heal from this and be much much happier. \n\nAnd if, she does come back(which is likely), stay strong . You can forgive her but that doesn't mean you have to take her back. Never forget, like they say. You're better off without someone like that.",
            "Very sorry my dude, but bullet dodged. Take time to yourself and work on healing. It'll take time, but you'll be fine. You're young enough you'll have no problem with your future",
            "I really don't understand people. All the best bro.",
            "Wow\n\nFirst of all, OP, you're a champ. Not a lot of men would be as level headed as you are and I'm proud of you for being calm and assertive through all of this. I'm proud of you for drawing the line with your ex and making her get the stuff out immediately and in one trip. \n\nSecond of all: I'm sorry. I'm sorry for having to be affected by the faux convenience of dating apps rather than a partner willing to put work in to salvage what you build. I'm sorry she didn't seem sorry or care at all about what this does to both of you as well as your pets. I'm sorry the standards of relationships seem like they force you to keep your partner entertained before someone else does it better. \n\nLastly, I'm happy for you. I'm happy that you were able to dodge this bullet without children. I'm happy that you're so hopeful of the future and positive about the potential it entails. And I'm happy that you're an example of a bad thing happening to a good man and not changing the type of person you are because of it.\n\nYou're an inspiration to many and I hope you continue to be awesome. Here's to happiness, my friend.",
            "You are thinking the right way. Keep it up and you'll be good.",
            "OP, please give us an update after she moves on Saturday please?",
            "She's been seeing this guy for two months, so essentially she started cheating right after your dad died? What a horrid piece of shit. I'm sorry for loss, OP. Good on you for confronting this- you seem like a very nice person, and you deserve much better.",
            "Wow moving straight in with a new guy, thats amazing. I honestly believe most of the population are walking around with some short circuit or mental disorder. Incredible!",
            "WOW!!! Moving in after 2 months. That healthy relationship will surely be long and prosperous!",
            "Guaranteed she will come crawling back, and when she does give her the boot but be kind and courteous about how much better you are without her.",
            "The thing is with cheaters, if they cheat on you they’ll either be cheated on or live a horrible life of thinking they will be, as trust will never be fully there for them in a relationship. So glad you’re away from this. I wish you all the happiness in the world!",
            "Reading your story has really hit an struck an emotional chord for me. I really feel for you man, 6 years together and she just leaves you for some random on tinder? That just goes to show how fucked up dating is for our generation. The fact that people will up and leave a life they built with each other and to have been cheating on you with him for two fucking months while still with you? Fuck her, you deserve so much better then that and later on down the road when this bullshit tinder relationship falls through she’s gonna be crying alone looking back on her life and wishing she had that safe place with you and your pets, I guarantee it. I wish you happy healing OP, it’s gonna be a rough ride for many many months maybe even years but personal growth often comes from those uncomfortable places. It’s time to put yourself first and become the greatest version of yourself you can be! Best of luck to you.",
            "Left you for a guy she just met on Tinder two months ago?\n\nGuaranteed she'll be back.\n\nBe sure to remember all this when she is.",
            "*bro hug* \nSo sorry my dude. It'll get easier with time. When (not if) she comes crawling back come read these posts you made. You deserve better.",
            "This sucks but looking on the bright side, better now than after being married (with kids). You’ll find the right partner in due time and this will be a blessing in disguise when you spend the rest of your life with the person you are meant to meet and be with.",
            "You should thank the lord for not getting her pregnant.",
            "Stay strong OP! Ure amazing!",
            "Remember sir. Remember that feeling when she waltz back into your life in some fashion.",
            "57 years maybe and ask her why",
            "Wow, she is garbage. Nobody deserves to be blindsided and discarded like that. Props to you for being so strong dude, that would destroy me.",
            "I’m late to the party. But I wanted to congratulate you on your maturity on the situation. I’m 22F. Broke up with my ex a year ago. My mind could not formulate thoughts properly on how to deal with it. I’m ashamed of it. I’m just now out of the rut. \n\nI don’t even have the positivity that you have in finding another. But I should stop saying shit like that. Good on you for being a bigger man and not talking bad about your ex on the internet.I’m sure it’s hard, and be well.",
            "You have done the best thing for you, now move on and wish the best for her.  There is enough hurt in the world to wish hurt on each other.",
            "I like how she didn't have the decency to break-up with you before deciding to install Tinder. \n\nCoward. And the giggling was disgusting.",
            "Wow i’ve read the original post and this one and you sound like a really nice guy. Best of luck in moving on!",
            "I'm sorry about what she did, and you seem like a really great guy.  You will find the right person, in time.  I feel like I need to say, though, thatthis:\n\n|Natural Family Planning, where she tracked her fertile days and all that, so we weren’t gonna get pregnant unless we actually tried.\n\nShould not be your primary form of birth control. Period.  It needs to be either her birth control (IUD, pill, etc), or condoms.  NFP is not going to be a safe way to ensue children don't get created.",
            "Well, it looks like you dodged a bullet. \n\nBy the way: natural family planning can work depending on who's doing it. Many, many (I would say most) people's bodies won't adhere to the assumptions people make when they plan their sex. I wouldn't rely on it at all. You two got lucky here.",
            "Holy shit, this is what nightmares are made of. Fuck her I would have burned all her shit right then and there",
            "Woooowww that's so crappy calling you a dead weight? Jesus good thing she left you shes a freaking sociopath.",
            "> But we were doing that Natural Family Planning, where she tracked her fertile days and all that, so we weren’t gonna get pregnant unless we actually tried.\n\nThere’s a special name for people who use method of birth control. It’s “parents”. Please find another option for future relationships such as non-latex condoms.\n\n> We broke up and she is moving in with her new guy.\n\n1. Go and get tested for STIs immediately.\n\n2. She’s probably going to try to come back to you in a few weeks or months when the reality of her new life sinks in. Be prepared for this and **do not take her back**.\n\n3. Once she has moved out her stuff, get the locks changed immediately. Even if she gives back your key she could easily have a copy. You do not really know your ex-gf anymore and you should not trust her.\n\nGood luck going forward. Remember, you were lucky to see the real her *before* you got married and/or she got pregnant.",
            "> But we were doing that Natural Family Planning, where she tracked her fertile days and all that, so we weren’t gonna get pregnant unless we actually tried.  \n\nlol what",
            "NFP also knows as \"Time to get an abortion\" or \"Mommie & Daddie.",
            "\\>Natural Family Planning \n\nIdiot."
        ]
    }
]