[
    {
        "post_id": "c7y2iu",
        "author": "3Dbabble",
        "title": "UPDATE: I've [M26] decided to break up with my fiancé [F26] of 8 years. Need advice on how to proceed.",
        "url": "https://www.reddit.com/r/relationships/comments/c7y2iu/update_ive_m26_decided_to_break_up_with_my_fiancé/",
        "score": 4249,
        "num_comments": 164,
        "created_utc": 1562007143.0,
        "selftext": "Link to original post https://www.reddit.com/r/relationships/comments/bylrpo/ive_m26_decided_to_break_up_with_my_fiancé_f26/?utm_medium=android_app&utm_source=share\n\nI appreciate all of the advice on my last post. i didn't expect to get so much attention on it. But things went about as expected. She cried, I cried, she begged. It wasn't pretty. But for two weeks we've been broken up and she moved out today. The first few days were aweful. But afterwards we were able to talk to each other like normal people. And I helped her with everything I could. I let her take the room while I slept on the couch so she could have space and I tried to make myself as scarce as possible.\n\nIt's been a sad time and a sigh of relief. She also admitted to me that the reason she never tried to fix anything was because she didn't believe I would ever actually break up with her. She apologized and promised to work on herself. Which I appreciate. I told her there wasn't a chance we could get back together. We just aren't right. And she even said she is willing to try being friends after a while and I told her she is free to talk to me anytime but I won't bother her while she is getting over things.\n\nI'm going to have to work things out properly with my financial status. But this is all for the best and I'm glad It happened. I only wish I could have done it earlier.\n\nThanks again for the advice. It helped a ton.\n\nTL:DR I went through with the breakup and we are both doing fine now. Thank you for your help.",
        "permalink": "/r/relationships/comments/c7y2iu/update_ive_m26_decided_to_break_up_with_my_fiancé/",
        "comments": [
            "> She also admitted to me that the reason she never tried to fix anything was because she didn't believe I would ever actually break up with her. \n\nShe deserves a lot of credit for not only realizing but vocalizing this.  Most people either don't realize it or are too proud to admit it.",
            "[removed]",
            "Glad you're both doing fine - a positive outcome for you both. All the best!",
            "The way I look at it people know us through our boundaries. And our boundaries are made up of what we like and what we don’t like what we want and what we don’t want. If someone is giving you what you don’t want or not giving you what you want, you have an obligation to let them know, courteously and kindly. If they refuse to respect your boundaries, that disregard threatens the integrity of the relationship. If you fail to inform your partner of your preferences, you are just as much at fault because it’s unfair and infantile to expect someone to read your mind. Clearly stating your wants and needs gives your partner the opportunity to strengthen the bonds between you. Failing that resentment and silent scorn and then anger and contempt will arise and gradually the relationship will transform.",
            "Been in your shoes before. \n\n&#x200B;\n\nWe were 25/26, told her we will never get back together, it was very messy and we did live together as well. \n\n&#x200B;\n\n6 months later we got back together and we are now married lol. The time apart gave us time to think and work on our issues alone. Made it a better relationship.",
            "Hey, at least she had the courage to admit that she wasnt trying to fix stuff because she was taking you for granted. I wish you the best, may you find a partner that makes you happy or even your ex fiance if she works on herself",
            "You made the right decision. \n\nGood luck in the future, and take some time before getting into another serious relationship.",
            "Well done! I just read your original post and I've been her before, but we got married. And a year later, divorced. Best of luck for your future!",
            "You did the right thing.  She obviously does not want/like to have sex.  Nothing to fix.   If she worked on it, best she could do is have sex without wanting to.  Who wants that ??",
            "Pretty much the exact reason my ex and I broke up. I was unhappy with that and she didn’t put any effort into fixing it because she never thought I’d break up with her.\n\nIt’s gonna be hard, but time heals all wounds.",
            "I wish you the best OP. I saw where you mentioned you felt like you were “wasting her time”. What would have really been wasting her time is marrying her, maybe having kids, and either being unhappy for the rest of your lives, or leaving her years later. \n\nI was in a marriage that had a myriad of issues, but lack of sex was a huge problem too (porn addict). Regardless of the reason I never felt attractive and my self esteem was garbage when I finally left.\n\nNow, I have a fiancée who could not be more attracted to me, and whom could not be more compatible both in and out of the bedroom. I always feel beautiful and wanted. \n\nYour ex deserves to be truly loved and with someone who is truly happy with her. You gave her a gift by leaving.",
            "In a somewhat similar situation, my fiancé and I’s relationship was a nightmare at the end. He was brought up with the mentality that you ensure the misery because we had a child. My mental health was at an all time low and I didn’t think I had a choice. We even tried counseling, which always ended up with us fighting on the way back. We had a random fight, had a few days apart and when we finally spoke again, we both finally had the guts to call it off. I guess that was the last straw for both of us. We were both so relieved the other felt the same way that we cried as we hugged. We’ve remained good friends in order to coparent our son. He’s almost 7 so he’s been asking more questions about why his parents, who seem to get along just fine, don’t live together and never got married. We just explain to him that we are both happier as friends and that’s far better than getting married and arguing all of the time for the sake of “staying together for the kids.”",
            "The only sad part is,that she will probably start working on herself like you did but you will never benefit from her improved self. My ex told me how he used my comments during our break up to improve and I just thought: that's great, why not earlier when we had all these problems and you did nothing. Now somebody else will someday enjoy your better self",
            "wow thats shitty. she basically banked on the idea that u wouldn’t have the strength to leave her...? so she was totally cool with u being unhappy as long as u didn’t leave her? good riddance",
            "Good luck in the future for both of you",
            "Congratulations,  this not really an easy decision.  My strength",
            "Honestly, I think you handled this PERFECTLY. You were honest and straight to the point with her and I think she will respect that one day. Nothing is worse than when you \"keep in contact\" because it lingers on and on and I love how you said you will talk to her, but YOU wont reach out. I think you did exactly what you needed to and congrats on the beginning of a new adventure!!!",
            "Thank you. I understand 100% what you wanted to convey in the oh post, you made feel thankful and less guilty for breaking up with my boyfriend and not letting it go for longer.",
            "I've recently had a situation where I broke up with my gf of almost 4 years. We still kinda love each other, had our small family with our cat in a place we rented, but we loved each other not the way we should really. We wanted to take care of ourselves, but we had differences that were kinda splitting us apart, apart from when we were home together and chilling but this can't be your whole life, locked inside a safe space. Still fresh, still hard, for both of us, but we agreed and with a help of my parents advice I came into a conclusion.\n\nDon't let her totally go out of your life. Unless you guys are in a fight or smth, give yourself a break, but maybe try to stay in touch later on. Those memories we had, were beautiful, those were really good and magical times. It all already happened and formed what we are today and forgetting it or going against it is not only disrespectful for a relationship that was, most of the time, everything for me, but also it just means you're going backwards and won't do any self progress in terms of understanding yourself. As much as you want to let go for now to get over it, never forget the times you spent together, especially if you had good times. Later on when you're all cool, talk about these memories sometimes, remember them. This will shape you for the rest of your life and will let you understand what you want from other relationships in the future. Also, at least personally, no matter how much I want to get over it, I'll never fully do, luckily. How can you forget someone you spent years with, living together, who was taking care of you, who you were taking care of, who was there for you always, everyday. With whom you actually felt more at home than you're feeling right now with your own parents at a place you grew up.\n\nI'm sorry, not sure if that's at all relevant in your situation, just I guess had to vent out and share my early after breakup discoveries.",
            "Last year I broke up with my fiancée of 5 years and it did not go as smoothly as possible. She would beg me to take her back then verbally attack me when I didn’t. For a few weeks I couldn’t block communication because we had to sort some financial things.",
            "Did she ever explain *why* she was never sexual with you???",
            "Bravo! You’ve done a very difficult thing and you did it for you, to improve your life and your future. That is commendable. \n\nI sincerely hope you find someone who gives you the sexual excitement and fulfillment you deserve. You sound like a very level-headed person and in-tune with your emotions and the kind of person you are",
            "Congrats, hope you both do better and stay as friends.",
            "So glad this all worked out for you man 🙏🏽",
            "I am so sorry OP that you went through 8 years of this.  Shame on her for never working on anything because she thought yo uwoudln't leave.",
            "Props to you, even dating casually break ups are really hard to initiate.",
            "Nailed it! Good luck!",
            "Well don’t do what my ex did and end it over text and you’ll be fine",
            "Congrats! Breaking up is never easy and I sincerely hope that she will respect your choice and be a decent person towards you long after the break up.\n\nI say do a lot of independent and family/friends hangouts, solidifying your non romantic relationships with others and yourself! Take advantage of the alone times too (new hobby or just self reflecting/thinking!)",
            "Congrats man, 26 is still young, I'm sure you both will do fine without each other",
            "Stay strong OP. It seems like she is aware of the problems you had in your relationship. Make sure to cut all contact for at least a month. You and her needs that time to be able to heal. Also after that month you will see if she is dedicated to actual change. If she is then you will have a decision to make if you are going to give her a second chance, I know that seems like something that won't happen but trust me as someone in your position your feelings will soften a bit if she is actually willing to change which is a small probability, or try to make a friendship of it. If she isn't well I guess you never need to talk to her again. \n\nYou need this month to live life on your own for awhile. Just cut contact and stay strong because she might try to bargin a bit, but I don't think that's the case because she probably did this the last two weeks while you still lived together.",
            "Yes it is honest, which is what matters. It isn’t a good excuse as you’re damaged and are only creating more damage in the world (I can relate). However admitting means you can prevent it in the future. \n\nThanks for answering and honestly without making yourself out to be the victim. Serious props, not enough self reflection in these situations. \n\nHope the best for you in the future.",
            "my husband and I did everything but put the divorce papers in front of us. With the end option being virtually there, we were able to communicate openly without feeling there would be any repercussions. \n   It saved our marriage.",
            "\"...she never tried to fix anything was because she didn't believe I would ever actually break up with her. \"\n\nBeen told this myself. I found that incredibly inconsiderate of her to say she wasn't going to bother stop doing the things that really bothered me because she thought I wouldn't break up over them.\n\nWrong.",
            "Good on you OP it takes guts and a lot of maturity to do what you did. It is far better off now than getting married and having your partner leave you a few months later ( speaking from experience). So hats off to you for doing it right.",
            "I'm glad it worked out, OP. What I'm really wondering, though, is why did you get engaged if things were already so bad?",
            "this hits me hard because I was in the same scenario, except on the female side. my boyfriend broke up with me and honestly it was all my fault, I was too full of myself thinking I was \"too good too perfect\" for him to ever leave that I didn't realize I was being toxic and putting him down throughout the time\nbut even with that I loved him and appreciated him so much, that when he told me he wanted to break up it completely shattered me, I was destroyed\nfor days I didnt believe it was true, and then finally about a week later he said he just doesnt love me in that way anymore, and doesnt see us being together\nafter he said that I took a step back and had finally realized everything I did wrong.. and what was worst is that it was too late to fix it\nit really hit me hard because he was the first and only person ive loved\nso I just could do nothing but better myself and relationship with people around me\nafter a while he started talking to me and trying to get close again - with caution, probably scared I still had same unhealthy behavior (unneeded distrust, not giving him any space, my way or no other way -type of thing)\n\nto not make this any longer - after 3 months of being broken we got back together, and weve been better than ever. theres mutual respect & I love him even more than before, hoping he does as well!\n\nnot sure if that's the case for you but maybe itll help you see things from the other perspective",
            "I'm glad you are both okay and I hope you both find people you are more compatible with.",
            "This sounds so wholesome.",
            "Fiancé?\n\nHow do you spend 8 years with someone, ask them to marry you, then decide you’re not into it? \n\nDid you critically think about the relationship at all before you proposed?",
            "[deleted]",
            "> I told her there wasn't a chance we could get back together\n\nSee I never think that it is a good idea to shut the door like this. Me and my ex broke up a few weeks ago and I was very open that we could get together again if we could make things work amicably.\n\nI hope everything goes well though.",
            "I asked you if you critically thought about the relationship before you propose. You didn’t outline why you proposed when there were obviously issues..."
        ]
    },
    {
        "post_id": "3v0qwm",
        "author": "throwawaymistak",
        "title": "[Happy Update!] I [35 M] feel like I made a huge mistake by marrying my wife [30 F], but I also feel like a huge hypocrite because I was the one who changed.",
        "url": "https://www.reddit.com/r/relationships/comments/3v0qwm/happy_update_i_35_m_feel_like_i_made_a_huge/",
        "score": 4221,
        "num_comments": 178,
        "created_utc": 1448990398.0,
        "selftext": "I made [this post](https://www.reddit.com/r/relationships/comments/3nv9fc/i_35_m_feel_like_i_made_a_huge_mistake_by/) a few weeks ago about the resentment I started to feel towards my wife after I had been promoted at work. I just want to say thank you all for the advice and I have a very happy update for you all.\n\nI took a week to think about the post and my own feelings. I talked it out in therapy and I came to the conclusion that I could not keep working 70 hours a week. It was destroying my relationship with my wife and son and it was also destroying my happiness. I spoke to my boss and he was very understanding and told me that there was enough in the budget to hire an assistant for me. My assistant started two weeks ago and my work load has been dramatically reduced. I have been able to work a normal 40 hour work week and I am now finally coming home before 6:00 PM each weekday!\n\nI spoke with my best friend about my wife and he knocked some sense into me. He told me how jealous he and the rest of our friends were over my wife and how lucky I was to be with a woman who is super-model attractive, yet driven and kind and compassionate like my wife. Later that night, I drank a bottle of scotch and got sloppy drunk. My wife found me puking in the bathroom and in my drunken haze I confessed to her everything I was holding back. I told her about how I felt left out because I wasn't around for our son, how I didn't feel connected to her like I wanted to be, the whole nine yards. She held me and let me cry it out and she told me that she loved me.\n\nThe wife and I are headed to couple's counseling, but we also signed up for cooking classes to build a common hobby. She says that she will stay by me as long as I stay be her, no matter what happens. I love her and she loves me and I think we are going to be okay.\n\nOne last detail that I can't think to put anywhere else: All three of us are taking a month-long vacation after Christmas in order to have family bonding time. Wife and I both agree that we need this vacation.\n   \n**tl;dr**: Pulled my head out of my ass and told my boss that I had too much work to handle. I got an assistant and relieved myself from that stress. I spoke with my best friend who knocked some sense into me about how wonderful my wife is. She and I are going to counseling and we are going to work it out.",
        "permalink": "/r/relationships/comments/3v0qwm/happy_update_i_35_m_feel_like_i_made_a_huge/",
        "comments": [
            "Good for you (and your family). I love happy updates.",
            "[deleted]",
            "Good for you!  Now keep it up.  Don't do the stoic, suffer-in-silence type.  Trust your wife to listen to and care about your problems.  A SAHM can still be educated and sophisticated.  Encourage her to grow intellectually with you. ",
            "Your wife sounds like a keeper. And you know the old cliche, \"the grass is greener where you water it.\" Glad you started watering your lawn.",
            "I'm so glad that you have decided to cut back on your work hours and reconnect with your wife and your family as a whole. \n\nI just want to suggest something that perhaps you haven't really considered: being a stay at home parent is hard work, too. Since you were only seeing your wife later in the evening when you got home, you missed all the tasks she did that day before freshening up and settling down to await your arrival while playing with Baby. You were gone early each morning, before she got up and her own workday began. \n\nI've been a stay at home parent before. Every time you try to do some task, the baby or toddler comes along and messes it up again or creates a worse mess than before. Your couch gets scribbled on with pens when you're not looking, you sometimes clean urine and vomit and poop off your own clothes multiple times a day. Things get broken, things get dirty, things get very untidy in only a matter of moments. It's not as easy as it looks from the outside. And while you're caring for the baby, you're also rotating through the daily/weekly housekeeping tasks like interminable amounts of laundry, cooking, shopping, running to the dry cleaner's, cleaning the bathrooms, mopping the floors, cleaning up spills and puke and diaper accidents. It can be difficult to even get a chance to shower yourself. \n\nIt can be extremely difficult to get things in order enough so that by the time your husband gets home from work, he sees his wife and baby both showered and clean, quietly playing in the living room together, with dinner on the table. A stay at home wife and mother typically has had no adult conversation all day long unless she spoke to a cashier at the grocery story and she's probably aching for a normal conversation with you.\n\nYou're probably already aware of all of this, but it's very difficult to compare your office job with what LOOKS like sitting around playing with the baby all day. It's not a fair comparison.\n\nPerhaps you could sit down with your wife and ask her what her days are like, what her daily routine is. Tell her you want to know everything, from poopy diapers to the sippy cup that somehow got milk on the ceiling. I think that once she opens up about how much she actually does on any given day, you may feel a lot less resentful of what appears to be an easy job. \n\nYour wife sounds like an honest, hardworking, lovely woman, and I'm only saying these things to suggest another perspective, not to be judgmental. After having been a stay at home parent in the past, if I was offered that choice or a full time job to choose between on scales of effort, I'd take the full time job any day of the week!",
            "I actually came out of lurkdom just to comment on this. I read your last post, and I have to say, my (ex) husband was you. He felt exactly the same way about me, his degree was in engineering and mine in psychology, and we had always discussed and planned on my staying home. In fact, once our daughter was born he INSISTED on it. But he also hated me for it. I could tell something was wrong and just begged him for years for counseling. But no go, he wouldn't admit things were less then perfect, but he also became nastier and meaner and more derisive the longer we stayed together. At the end, I left him. I didn't want to but I did it because he would not adress the issue. Your update made me cry, what I wouldn't have given to have him have your attitude, and our two kids would still have their parents together. Good for you, your wife, your kids and your future self will thank you for it. ",
            "Awww okay, that made me tear up a bit. Good on you for communicating :) Keep the lines open!",
            "I remember your post! I'm so glad you got your work hours reduced because 70 hours is insane for anyone. Also glad that you told your wife what you were holding back. That's often the hardest part (to just say what you're feeling) but often the most needed.\n\nEnjoy your family time :)",
            "This is like the adult version of Inside Out. Everything gets better after you open up. ",
            ">taking a month-long vacation\n\nNow this is good news my man. I hope this really pays off for you and your family. Glad to see you working on your problems! \n\nAll the best for the future OP!!\n\nNow to talk to my boss about that leave....",
            "This is probably one of my favorite updates EVER.",
            "I feel like I am laying in a bed of warm fluffy quilts just out of the drier. ",
            "First of all, congratulations on your assistant and good on you for communicating and problem solving your way toward a better marriage.  These are things that seem so simple, but as you know are so hard to do in practice.  I'm glad everything seems to have worked out and things are looking up, but BOY could that drunken confession have gone terribly awry.  I know you were probably in such a shitty emotional place that it really took the alcohol to bring those feelings out of you and into the open, but please don't make a habit of this!  Hopefully now that you have aired some of your grievances and are in therapy, which will help you to be more honest and forthright about your feelings, those confessions will be a lot easier to make when you're 100% sober.  Because YIKES sloppy drunk is not a time to talk about big feelings like the ones you were having. Had me sweating over here, OP!",
            "Finally a happy ending to marriage problems. I've seen too many fail because of ppl not willing to actually try and fix it. Good for you guys.",
            "Well this is a lovely update! Congratulations!",
            "So happy to read this update, but at the same time so terrified for your assistant's life the month you are off work!",
            "You married a saint. That is about as rare as being eaten by a shark. Buy her something nice for Christmas. ",
            "On a sub where so many things often end in disaster, it's really nice to read something like this.  ",
            "Good luck, my friend.",
            "What an excellent update.  Your wife sounds awesome but honestly so do you.\n\nReading the original post and this update has been very helpful for me to process some of my own feelings, so thanks for that.",
            "Hey man you got yourself a goddamn awesome wife. Take a look around here and you see all these relationships where nobody wants to work it out and drunken confessions break the camels back.\n\nThis relationship is going to be so fine",
            "I love happy endings.  ;)",
            "It's so lovely when these things head down the road to improvement. ",
            "I love these updates! I am so happy you've were able to be honest with yourself and your wife about how you were feeling. \n\nAnd I'm glad you have your life back on track. Balance is so important. Have fun on your vacation!",
            "bravo! bra-F*ING VO! ",
            "Congrats and good job! Everyone likes happy ending :)",
            "I actually said \"Yay!\" outloud. I'm so happy for you guys. ",
            "I'm so happy everything worked out for you and your wife!",
            "Oh man. I didn't see your first post but I would have told you to cut back on those hours.\n\nI've seen many relationships destroyed by that kind of work schedule. Especially the 10on/5off fly in/fly out jobs, it's tough work and a lot of times ends up in divorce. I've only seen a handful of people who were able to maintain that kind of work schedule and have it not affect their relationships. One guy skyped home to his wife and kids every day after his 12-13 hour shift and he was just about ready to get out of our line of work pretty soon and get a job in town to spend more time with his family.\n\nWhen you're young and need quick cash then it's fine for a bit but don't let work rule your life. You spend all this time at work, why don't you enjoy it, take it easy, and be able to get away and relax.\n\nI'm actually glad I got out of my industry (after being able to wipe out my debts) and moved to another career patch even though it's lower paying (for the time being) but I actually have a career path that gives me a real work/life balance.",
            "this literally just made me cry. Having someone who is there for you no matter what you're going through is all anyone could ever ask for. I'm happy for you OP.",
            "I am glad you fix things for yourself, because most of the time most of us can't. Also, I understand that the one you love most is sometimes the one that is hardest to talk to. (well for me anyways)",
            "this made me tear jerk and im a man. Marine.",
            "Coming from a similar situation right now, working 60 to 70 hours a week. Not seeing my family, carrying the guilt of my wife basically being a single mom. This update makes me happy to read. I hopefully only have about another month of working like this, and can find some family time coming up. Also planning a family trip to help bring us together. I hope everything continues to go good for you. ",
            "Good job man!  It's easy to fall in the grass-is-always-greener mindset, way to step back and reevaluate",
            "This brought a happy tear to my eye, congrats :')",
            "My goodness, upvote times a million! I'm so happy for you and your family!",
            "Way to go! It's wonderful to see a happy update! :) ",
            ">She says that she will stay by me as long as I stay be her, no matter what happens. I love her and she loves me and I think we are going to be okay.\n\nAnd this is how truly long term, permanent relationships are actually built. You decide you're staying together no matter what, and you mean it. Congratulations!\n\nThe feeling of being in love may come and go. But your love will continue to grow as long as you nurture it.",
            "Brilliant! On all counts. It would have been better if you could have talked to your wife without puking your heart out (!) but the main thing is you shared what you were feeling and you look like you're on the right track to a more solid relationship. I wish you all the best. (I know I don't know you, but it gives me a lift when I hear these experiences.)",
            "Holy shit, you were working 30 extra hours that can be handled by an assistant! I wonder how much of that exists in the corporate world... really nice to hear your update. You wrote with complete honesty and balance - and seem intelligent. Great going!",
            "I'm so happy for you two! Good luck.",
            "I also recommend spending a few days alone with your kid, to see exactly how much work it takes to keep the kid fed, clean, safe, and happy while doing all the housework as well.",
            "Good job! Sounds like you've handled the situation perfectly. Enjoy the vacation, cooking classes, reduced workload and getting to reconnect with your family!",
            "Well done sir! Excellent that you looked for opinions, guidance etc, from a range of places. Very impressive action you took. All the best going forward - if you keep communicating you'll be doing great.",
            "Scotch therapy, not the most common way to get your feelings out, but it worked! Really good to hear things are on the upswing. Almost no one lays on their deathbed wishing they had worked more hours. ",
            "Very happy for you.",
            "Communication wins the day again! Hope everything continues on this upward trajectory for you and your family.\n\nAnd have fun on your vacation! What a great idea to relax and feel close to the famjam for a while.",
            "Great update! You have an awesome wife, boss and friend too.  Really you are very blessed.  Appreciate what you have.",
            "YAY! I'm happy about where this went. I'm glad things are looking up!",
            "This is great news. I'm not judging but no job would keep me from seeing my kids. I'd rather dig holes by the side of the road if it meant I could see them everyday.",
            "Cooking is an awesome couples hobby, wife and I have been together for 6 years but half of that was LDR due to military service. She couldn't boil water when we met but now we love cooking together a couple times a week. Good luck bro! ",
            "You usually don't realize how good something is until it's gone. Glad you found out sooner than most. ",
            "Great news! ",
            "I am so so so happy for you and your family. I hope you have a wonderful vacation and a very Merry Christmas! ❤",
            "YAY! Merry XMAS. hope you enjoy the vacation! JUst found out my hubby has a mandatory 35 days he needs to take- use or loose- so I am propsing a weekend trip somewhere.",
            "Good on you for manning up OP, find creative solutions to your issues, bust ass and work hard for your family and the love of your life, and you'll keep being properly rewarded. Here's to many years of happiness I hope are coming your way.",
            "the most heart wrenching part of this story was drinking, then puking up a bottle of scotch... NOOOOOOO!!!!!!\n\nI'm glad you got to figure things out with your wife though :)",
            "This is such a happy update. I'm really glad that you were able to get this resolved through much needed communication! I wish you all the best of luck. I hope you thoroughly enjoy your vacation.",
            "That was so amazing to read. I'm really happy for you. Really.",
            "Make some amazing memories on that vacation, sir.  All of you *do* deserve it. Take lots of pictures. ",
            "Great to see a happy update on this sub, not enough of these. ",
            "What a happy story",
            "Good for you! Lucky that your drunken confessional was well-received. I would be wary of those.",
            "Sometimes all a guy needs is to get sloppy drunk to let out his emotions.\n",
            "Very happy for you. ",
            "Happy updates are such a nice change. Thanks for sharing!",
            "I am close to tears, this is the best post that I have read in so long. I am happy for you, and please always keep in mind communication is key. There will always be ups and downs in relationships, but those are the things which we look back fondly on and laugh when we are much older and have experienced and overcame those times. Work is important but it is not everything, I know that. \n\nHigh five, and keep up the good work. ",
            "Congratulations. Make it count!!!!",
            "\"She says that she will stay by me as long as I stay be her, no matter what happens.\"\n\nOne day, I hope to be this woman to my husband. I'm really glad things worked out, OP. Enjoy your holiday and cherish every moment. ",
            "yay:)",
            "All really good first steps (except for maybe the drunkenness.  Maybe skip that next time).  But don't make the mistake of thinking that you're done.  These are probably issues that you'll need to continue to work on for a very long time.  That's not a bad thing.  All relationships have issues.  Now you know some of yours and can keep an eye on them.",
            "I love it when it works out.  That's awesome.",
            "This is great news. I'm glad you're not taking your wife for granted and you see that it's possible to have a life/work balance. Good for you! ",
            "I had to downvote your post just so I could upvote it again. Seriously OP, I am that happy that you're doing this. Best of luck and warm thoughts to you and your family. :)",
            "Glad to see you're putting effort into keeping your marriage and not just giving up. Hope the best for you",
            "NICEEEEEE!!! Seriously good on you OP, that's awesome to see that you'll be able to spend more time with your family, and that you'll be taking a week earned holiday!",
            "Thanks for sharing about your relationship and how you managed to resolve things with your wife. It's encouraging, and your struggle really hits home for me. ",
            "It's about time I read a story in this sub that makes me smile for the OP. Congratulations, friend.  ",
            "I'm happy that you are able to talk this out and move forward. And good for getting help. That can be key to real change. Just a note about your annoyance with your wife's understanding. That wasn't s kind remark. And to be honest was she really that communicative before you married her? Your spouse doesn't have to be your everything. Have intellectual or business conversations with someone else and find the things you bonded over again or something new you both share interests in. \n\nLastly, you should try to make sure you both have outlets for recreation and friendship and hobbies. Personally  I think maybe she should learn a skill or get an Associate's so that she can provide for herself in case something should happen to you. My friend is struggling with two kids and no degree agree her husband was hit by a drunk driver and hurt badly. He's looking at years of therapy and months in the hospital and she is desperate for work. ",
            "Awwww good for you! Hope it works out. :)",
            "<3",
            "Good luck!",
            "You have good friends.",
            "I'm so happy you are working things out!",
            "Congrats on the success! The phrase \"build a common hobby\" is so apt and I thank you for that and for sharing your story.",
            "When asked about regrets, old folks and people on their deathbed in general, nearly invariably, will say they wish they had worked less and played more.",
            "This is awesome, good for you!",
            "I'm going to have to be that guy and say it... Don't become dependent on letting the alcohol do the talking. Let your feelings be known without having to be under the influence. I myself am going through this struggle and I have over a year sober! \n\nBut it sounds like you are doing a good job at being upfront and open, so I don't think you have anything to worry about. \n\nCheers",
            "This is the best possible update, I'm really happy for you!",
            "Yay communication!",
            "I'm very happy for you and your family. It sounds like this worked out for the best and I wish you all well.",
            "Hey OP! I've been perusing the top posts, and I don't know if someone already suggested this, but make sure you are absolutely cool with your marriage counselor and personal therapist. If anything at all seems off or you don't even really like them, find someone else you like at first session. It will be a lot more helpful",
            "Obviously, it sounds like you know this but your wife sounds like a keeper with how understanding she was. \n\nGood on you for taking time to honestly evaluate your emotions, receive outside feedback, and act. \n\nHappy roads ahead. ",
            ">to be with a woman who is super-model attractive\n\nAm I the only one who is curious about what she looks like?\n\nNo but really great for you OP, wish you the best!",
            "By drinking and opening up to your wife like that you commited a big mistake, maybe this comment will get lost or deleted, but if you read this you will remember it at some point in your relationship when she will start exploiting your sincerity. What seems like happy time to you know will backfire. Just be ready for it.",
            "Just wondering how a stay at home mom can be considered driven..."
        ]
    },
    {
        "post_id": "ghnm3z",
        "author": "coworkerspythrowaway",
        "title": "UPDATE: Coworker (M) is almost certainly recording myself (M28) and other Coworkers in the men's restroom. Not sure what to do.",
        "url": "https://www.reddit.com/r/relationships/comments/ghnm3z/update_coworker_m_is_almost_certainly_recording/",
        "score": 4221,
        "num_comments": 91,
        "created_utc": 1589204019.0,
        "selftext": "Link to the original post:\n\n [https://www.reddit.com/r/relationships/comments/d6zfns/coworker\\_m\\_is\\_almost\\_certainly\\_recording\\_myself/](https://www.reddit.com/r/relationships/comments/d6zfns/coworker_m_is_almost_certainly_recording_myself/) \n\n \n\nSo it's been awhile since my original post so I figured I'd give a quick update. I took some advice I received on this post and decided we needed to take action. I couldn't stand having this guy be around anymore, receiving praise from his coworkers while none of them know what was truly happening. I talked with a few of my coworkers about it and we started looking into our options. Our company offers a hotline to report incidents just like this, completely anonymously. Finally, after a little bit of debate, one of us called the hotline and reported the incidents. We waited to see what would happen. Eventually the security team reached back out to him and asked him for more information. They said they are building a case and they need as much information as possible. After hearing this, the rest of the us decided to report our cases to further aid in the building of the case. I remember the security officer telling me that things are going to \"move quickly.\"\n\nWell I guess in a big company they don't fuck around with this. Less than a month after the initial report was filed the creepy asshole was fired. The entire department was told to meet in a meeting room real quick for some news and management laid it on us that he was gone. He was a highly respected coworker who was really good at his job. The news was met with shock, especially since some layoffs had occurred recently. I remember my heart absolutely racing when the news was being given. I couldn't believe that it was happening. I really didn't think some anonymous reports would lead to action so quickly. The creepy guy was friends with some of the women in our department, and he was texting them constantly saying that he was innocent. He quit pretty quickly once they weren't having any of what he was saying. The rumors of why he was fired spread really quickly around the office, but fizzled out faster than I was expecting. I really thought this would be going around the office for months, but after two weeks or so people stopped talking about it and things returned to normal.\n\nI really appreciate the advice on here. It was extremely helpful in my decision, and it worked out for the best.\n\nTLDR: If you want to take pictures of your coworkers in the bathroom and you like your job, then maybe reconsider. Coworker fired for this very thing after being reported.",
        "permalink": "/r/relationships/comments/ghnm3z/update_coworker_m_is_almost_certainly_recording/",
        "comments": [
            "Good call, I cringed when I read the other comments saying to try to find a way to check his phone. Going to management was the right move.",
            "> The rumors of why he was fired spread really quickly around the office, but fizzled out faster than I was expecting. I really thought this would be going around the office for months, but after two weeks or so people stopped talking about it and things returned to normal.\n\nI see this reaction is some people who get upset over some such reason and their response is... \"Well, I'll quit, and then what will they (upper management) do?\"  I always tell the person, \"Here's what will happen.. You'll quit and two months later we won't even remember your name.\"",
            "I’ve been waiting for this update for like 7 months",
            "[deleted]",
            "Shouldn't this also be followed up with the police? Like great, he's out of your workplace, but he could still have footage of you and just repeat the offense elsewhere.",
            "Did they find recordings?",
            "Did they find evidence of what he was doing and why he was recording??",
            "> My first month into my job i went into the big stall to use the bathroom. While I was in there a person entered the small stall next to me. Once they sat down i glanced over and noticed their phone was in their pocket, positioned in a way where, if it was recording, it would have a full view of me in the stall.\n\nI'm confused by this description though, are there no walls between the stalls?",
            "Holy shit this was therapeutic to read. Results like this are so goddamn rare. Thank you for organizing your colleagues and reporting him.",
            "Im glad it worked out, its nice to see sexual harassment being taken seriously by the workplace.",
            "I remember reading this post and being disturbed. Good on you and your coworkers for taking action and getting this creep fired, OP.",
            "Good job OP. It’s always the kiss asses and highly respected ones that are douchebags. Glad he got his. Score one for the real good guys!",
            "Great to hear that your company took this seriously and took action right away.",
            "I'm glad things worked out for you.",
            "Q- How did security know who to get back in touch with if the initial report was anonymous?",
            "so was he fired or did he quit??? it cant be both.",
            "Reading this gave me such a justice boner!! Yay!!!",
            "[removed]",
            "That is so fucking weird, did you ever find out the motive? I’m glad you and your coworkers were able to get out of the situation",
            "Why are American bathrooms so shitty?",
            "Call the cops too, that’s illegal",
            "Go beat the shit out of him",
            "Privacy and dignity if fundamental. It doesn't go by gender. Take a stand. Call him out.",
            "Dude needs a “meeting” in the parking lot",
            "Wow it has been that long? Remember reading this and wondering what I would do. Looks like it worked out ok with management reporting.",
            "Oh for fucking sure they take action immediately! That's a huge liability for sexual harassment lawsuit.\n\nNevertheless, it is always surprising how quickly it gets handled. I've reported sexual harassment before and generally still assume nothing may come of it, but it always does, and it's always quick.",
            "I’m really glad you’re all safe from.. that",
            "The bigger the corporation, the faster things tend to move. After several of you stepped forward with the same complaint, they had no choice. If they had done nothing, you would have had a perfect hostile work environment lawsuit.",
            "Only fired? This is a criminal offence that's punishable by law!",
            "Nice. I honestly would have snatched it from his pocket to check. If not, I would have said I thought my phone fell. That way he can actually be arrested.",
            "The fact that he’s not under a criminal investigation is a huge failure on your and your company’s part.\n\nHe’ll just get another job if he’s so highly respected and continue being a pervert there. If there was enough evidence to fire this guy why aren’t the police involved?",
            "I'm so confused how this would actually work. When you're sitting on the can isn't the stall closed off on all sides?",
            "I personally would consider that a form of sexual harassment and if I were in that position I would report them to HR.",
            "[removed]"
        ]
    },
    {
        "post_id": "3ltbv6",
        "author": "akalaka",
        "title": "My [19 M] girlfriend [19 F] of one year ranted to our best friend about how small my dick is. Now everyone's making small dick jokes about it to me and I'm angry at her.",
        "url": "https://www.reddit.com/r/relationships/comments/3ltbv6/my_19_m_girlfriend_19_f_of_one_year_ranted_to_our/",
        "score": 4224,
        "num_comments": 465,
        "created_utc": 1442848951.0,
        "selftext": "I'm 3.5 inches long and my girlfriend doesn't like it. We have the same best friend, let's call him Mike. Now Mike and my girlfriend were talking and she started telling him how small my dick was and how I wasn't satisfying her.\n\nMike isn't a very mature person, and he proceeded to tell everyone we knew. Now everyone's making fun of me for it. They keep making small penis jokes and it hurts. \n\nI'm really sensitive about it. I didn't have sex with my girlfriend until 10 months into the relationship because I was scared of what she would say, of what she might say to others.\n\nI'm really pissed off at her because I told her I was sensitive about it, and then she goes and basically tells everyone about it. Sorry if this sounds dramatic, but it feels like a betrayal of my trust. I don't have much confidence and this just makes me not want to leave my room ever again.\n\nAm I overreacting or am I in the right for being angry at her?\n\n\n\n\n   \n**tl;dr**: Girlfriend told everyone I have a small dick. Now everyone's making fun of me for it and I'm really pissed off at her.\n\nedit: I think I'm going to break up with her. This was a severe betrayal of my trust and after read all of your comments, I think it's best if I break up with her.",
        "permalink": "/r/relationships/comments/3ltbv6/my_19_m_girlfriend_19_f_of_one_year_ranted_to_our/",
        "comments": [
            "Take out the trash.  Both bags.",
            "She betrayed your confidence, when she knew how much of a sensitive issue that is for you. \n\nTo me, that's an absolute deal breaker, and I'd end the relationship immediately. ",
            "Dude, **all of these people are assholes**, you need **them all** out of your life. Starting with your GF and your friend.\n\nYour GF's betrayal is horrendous, she has no respect for you or your relationship. You now won't be able to trust her **with anything**. Trust is the cornerstone of a relationship. ",
            "[deleted]",
            "Who the fuck takes advantage of a lover/friend's insecurities like that? Assholes. Assholes do, OP.\n\nYou need these people out of your life. This is so unacceptable on so many levels for everyone involved. I mean seriously? How much more disrespectful can you fucking get of someone who is supposed to trust you?",
            "She's not a keeper.  And you should realize that there are plenty of actual, mature women out there who will love you and not betray you.  This girl is way too immature to be in a serious relationship.",
            "Break up with her and lose your best friend. Dont let your dick size define you.",
            "If she loved and respected you she wouldn't have been ranting about it at all, never mind to someone who is gossipy and immature. My breasts are an A cup, if my husband ever ranted to any of my friends about how they are too small to satisfy him they would just think he was bizzare and wouldn't view him too kindly, and neither would I. It is a physical feature one can't easily change, and maybe don't even want to.",
            "Not overreacting, underreacting.\n\nThis was insanely insensitive of her, and a dealbreaker for many. Also, Mike isn't a good friend if he not only accepts this info but then spreads it and taunts you over it.\n\nI'd let them both know how hurt you are and shut down every mention of this \"joke\" straight away. Involve another friend to support you if you can.",
            "Wow. I'm female, and talking to someone about the dick size of someone we both know is just such a huge taboo. I may vent/brag on some anonymous internet forum, but about my SO to his friend? This is just so incredibly rude, callous, and insensitive. Just think about it the other way round: Would you talk about your GF's vagina to her friends??? \n\nAdded the fact she lets you feel you're not good enough: This is not a healthy relationship and bound to make you very unhappy.",
            "Drop her and your friend like a couple bags of steaming hot cat shit. \n\nI'm sorry they did that to you, it's very cruel, and really unacceptable.",
            "You're right to be mad, she made fun of you to other people. That's fucked up.",
            "Your girlfriend and your \"best friend\" suck ",
            "In addition to dumping the girlfriend, now is a good time to reevaluate your friendships with these people that are insulting you. ",
            "You are absolutely justified in being angry and feeling betrayed. At your age, don't get into the habit of tolerating that sort of behavior, because it may establish an ongoing pattern of self-disrespecting behavior.\n\nBut I want to address the other issue here: don't ever let anyone tell you that a smaller penis makes you a lesser lover. I'm in that same club, my friend — we can't help what we were (or weren't) naturally endowed with. But we can certainly make up for it in other ways: by learning to use all your body parts in pleasurable ways for you partner, by reading your partner's reactions and adjusting for optimal stimulation, and yes, even by introducing and becoming proficient with toys in the bedroom (trust me: using a toy with your partner and using it well will far out-pleasure your partner than your partner using it solo).\n\nSo, lose the self-consciousness about something over which you have no control, and embrace the idea of your entire body as a love-making pleasure machine. In due time, you'll look back on this as her loss, and your new lover's gain.\n\n...and yeah, like most people have said...ditch this betrayer of trust and the whole lot of insensitive jerks and find happiness in the company of those more worthy of your time and friendship.",
            "Yes you definitely have a right to be angry at her. However, to be fair, she told one person and Mike told \"everyone.\" So you should also be angry at Mike. Sounds like neither your gf or mike are good for you. ",
            "[deleted]",
            "Dump your girl and dump your friend. Girlfriends and best friends come and go. I don't even remember some of the people I was friends with when I was 19. You'll be alright. Start surrounding yourself with better people. ",
            " I don't even know you and I wouldn't make fun of you for this. What does that say about these people?",
            "Dump her ass. Your 19, you don't have to deal with that shit. ",
            "Drop em all like bags of sand. Go cold. No contact. They will most definitely come and say \"I'm sorry plz come back.\" Because they need someone to pick on so no one picks on them. Don't budge an inch. Don't even acknowledge them when they speak to you. ",
            "It's not exactly constructive, but Sam Kinnision is in my head, screaming: \"yea, babe, it's tiny. that's why it'll feel really god in your ass!\"",
            "Kind of sounds like she wants to jump into bed with Mike.  Or she is intentionally sabotaging the relationship by airing out the dirty laundry publicly, so there will be too much shame and embarrassment in continuing.  Neither person sounds like they care for, or respect you.\n\nEventually you just kind of have to own it.  A lot of people can look beyond another persons flaws...  but it's damn near impossible if that person is obsessively insecure about whatever they feel is 'wrong' with them.  It's exhausting for everybody involved, and becomes a self fulfilling prophecy.\n\nI'd still ditch the gf and friend.  ",
            "Why are you still calling her your girlfriend?  Gather just a shred of self-respect and drop her.",
            "Just be prepared if you dump her, she will hop right on Mikes D the day you do it.  Prepare yourself for that.",
            "Jesus Christ, that is some grade A nightmare fuel. You can get past this particular event in your life, but she doesnt sound like she cares very much about your feelings, and that is not something you cant ignore...",
            "You probly won't see this, but as a heads-up: if you dump her for this, you might want to steel yourself ahead of time for some nasty comments. \n\nShe's shown she doesn't mind joking about this, and if you bruise her ego, I imagine she might let-fly with some really hurtful insults. Just might want to be mentally ready. Good luck.",
            "They don't have the right to be a part of your life. Both your GF and friend have acted like first class losers. Grab any items you may have at the GFs place and ignor both starting now. ",
            "Fuck. That. \n\nGet outta there, find a new circle, and if she tries to spread shit your way, just shrug and say, \"that hate us cause they anus.\" Block that chick outta your life, it will only get worse. \n\nAlso- Fuck. That. She's got some dark shit going on if she's trying to shame you like that. I'm sure you and your cock will move on to better things. It's not like you have a micropenis. What you got will TOTALLY get it done, son. Oh, and you've spent time working on your foreplay? Congratulations, you've just outfucked most guys your age. You know how pussy works, you know what to do with it, and someone who isn't completely broken inside can definitely get off on your cock. Plus, you know how to prime here engine. So you're not shattering her cervix. Great, most women really don't dig that. You've more than the tool for the job to hit it right. Learn the angles, the positions, stay fit, and give it to the next gal how she likes it. And there will be a next gal. Many more, if you like. \n\n\nAlso if she's not already fucking Mike, it definitely sounds like it's on the table. Block that guy out too. You don't need people like that limiting your happiness. Again- if anyone asks why they talk so much shit... shrug... \"they hate us cause that anus.\" And continue on with your fucking life. If you refuse to continue the shit slinging, it only makes you look hotter. If these two don't self-destruct first, they'll quickly be seen as the kind of people they are. Don't be insecure about your cock, no sense in it. You're doing just fine down there. And if anyone asks to see it, tell them they can taste it, but that you're not whipping your cock out so that someone can get a free look at your junk or indulge in some homoerotic fantasy of being publicly presented with a cock. The same thing anyone should say. Tell the ladies they'll have to buy you dinner before seeing what all the fuss is about. \n\nHave fun out there, use that fucking cock, and don't forget the rubbers!",
            "[removed]",
            "She was trying to get the D from Mike ",
            "Not only do you need to cut your girlfriend out of your life, but also the friends making the jokes at your expense. This is a massive betrayal of your trust and totally beyond repair, I'm afraid. ",
            "> Sorry if this sounds dramatic, but it feels like a betrayal of my trust. \n\nBecause IT IS. Drop her and that \"best friend\". Why would you want to be with someone who's that disrespectful. And an idiot friend like that. ",
            "I'm not normally one to tell people to break up over reddit, but with the information you gave us, both your gf and your friend sound like assholes. Ditch this woman right away if you can. She knows that you're sensitive about it, so there's no reason for her to even bring it up. If sex between you two bothers her that much, she should talk it out with you. If she feels the need to tell your best friend, she probably shouldn't be in a relationship.\n\nAs for your friend, ditch him as well. A good friend would never reveal information you don't want him to. Regardless of how immature he is, sounds like he took pleasure in making your situation into a joke. ",
            "Dump her. Also, break Mike's nose.",
            "I'm sorry she was such bitch about this.  You don't deserve to have someone that disrespectful in your life. \nDon't worry though, there are a lot of women out there that love penises your size. \n",
            "Mike is giddy about this, knowing he's gonna bang her now that she's confiding in HIM about her lack of satisfaction with you.  If they aren't screwing already they will soon.  It makes me fume thinking about this asshat being so excited about your problem to blab it to everyone, because in his mind he knows she's unhappy and he can swoop right in.  I'd give her more leniency, but if she's telling him, and she knows he wants to bang her (and let's face it, he does) then she's just working him up.  I Iike I said man, if they aren't screwing now they will soon.  Sorry.",
            "\n\nLook man you may feel inadequate because of this. It may be hard in our hyper sexualized society to feel attractive or confident when there's this hurdle in front of you but you can't let it define your self worth. \n\nWhat is there to fix in this equation? You may love her but there is a point where it becomes something you can't fix. She betrayed the trust you placed in telling her. She's unsatisfied and she let you know it in more ways than one. \n\nThat's when you take a step back and you realize that YOU ARE BETTER than this insecurity. You know those rare days that everything seems right? That no matter what happens it just seems like the planets are aligned for you? Those are the confident moments you strive for. \n\nLook in the mirror and think of those days. Remind yourself that you are gonna give it your best and that you aren't defined by any one part of your anatomy or anyone's judgement of it. \n\nI'm not one to tell you that love is easy and effortless but I will tell you, you deserve more. You deserve more from those that care about you and from yourself. \n\nDon't let it define you. Own it. Embrace what you have and move forward knowing that you are meant for more. \n\nLove. ",
            "My boyfriend has told me things he asked me not to tell anyone else and I never have, and vice versa.  There are people out there you can trust.  Your girlfriend and Mike aren't them.  You're still young.  Find the trustworthy people.  ",
            "You mean ex girlfriend...",
            "Yup, and she's talking to another dude about it?  Please.  Calling it right now, they're fucking.",
            "How would she respond if you criticized her vagina or breasts and all of her friends made fun of her for it? What she did is no better. Please don't let this girl treat you like dirt. And ditch Mike. He obviously doesn't care about you as a person.",
            "When a girl tells another guy that the current guy she is seeing has a 'small dick', it almost always means she is trying to score from the side.",
            "\"I thought my small dick would go well with your tiny tits\"\n\nSorry, sorry got carried away there.  Dump that asshole.",
            "There is no need for me to read your post.\n\nYour girlfriend is talking shit to your mutual friends about you, and is allowing them to talk shit about you to.\n\nShe is not a good person, your friends are not good people...and you need to dump all of them",
            "Via Sam Kinison:  \"Surprise her by shoving it in her ass and then ask her how small it still feels.\"\n\nGone.  Lose her and Mike and move on with your life.  Also... stay away from those blinking flashing penis enlargement ads you see all over the internet.  They don't work!",
            "If shes telling other men about your small one, she is looking for a bigger one. ",
            "This is completely inappropriate. I am more angry with Mike, than with your girlfriend, because I'm assuming she told that to him in confidence. But at the same time, I would encourage you to get rid of both of them while mentally preparing yourself for the possibility of them getting together.\n\nI feel like Mike, at the very least, would like to. Otherwise, I'm not sure why he would publically try and humiliate you in a 100% guaranteed relationship-ruining way. Even if it's just him, and she thought that information was privately shared, I'm not sure a relationship could recover from this. Unless you think she told him in a calculated manner, I would try and exit this relationship with her as politely and maturely as possible. If you do explain fully why and try and keep on good terms with her. Mike can be told to fuck right off.",
            "Dump friends dump girlfriend",
            "Ditch the girlfriend **and** Mike. They're both assholes who can't keep a confidence.",
            "Glad you're deciding to break up with her. What she did was fucked up.",
            "these people are shitty people",
            "Holy shit run away. Ditch all of these people and find new friends.\n\nThis is just awful.",
            "You specifically voiced your concern to her, and she clearly breached your trust. This is your opportunity to show what big balls you have and end it with her.",
            "Get some respect for yourself and dump her ass ASAP",
            "Your girlfriend and mutual friend are now exes.",
            "Lol break the fuck up with her dude, why are you even asking?",
            "Looks like you need a new girlfriend a new friend.",
            "Along with the advice of leaving these people out of your life, do no retaliate with any insults of your own. Let everyone else see how negative and gossip inducing these fools are. ",
            "Damn bro.  Just break up with her.  That's incredibly messed up.",
            "Your best friend is a dick, no real best friend would actually do that. yeah sure, he might mess with you and joke around with you, but not tell everyone. Cut them all out",
            "No. No, no, no.  Why is she still your girlfriend?  You deserve better in a relationship, and in friends.  The level of disrespect your girlfriend has for you is appalling.\n\nEdit: I just saw you're going to break up with her. Stay strong, my friend.",
            "Own your small dick and your pride and leave this group. ",
            "Your girlfriend definitely betrayed your trust as many have said. You don't need to be embarrassed or ashamed of your penis but I think you do need to learn how to satisfy a woman. I've heard stories from female friends who have dated men with small penises. While some of them really were unsatisfying, others just worked harder with their tongues and fingers to satisfy the woman. Be confident, work on your finger and tongue skills and women will be flocking to you.",
            "DTMFA\n\nAnd I do mean the 'GF' and the 'bestfriend'",
            "Ok. You're going to get really good at oral. Like, mind blowing.  And then, you're going to dump her. ",
            "If you complained that her vagina was like have sex with a trash bag she would be pretty upset eh? What she did was incredible insensitive and mean.",
            "She's still a kid, dump her and move on.  \n\nThere's a bestof post from a while back where some girl talks about how a smaller penis is something some girls actually look for in a guy.  That sex is painful for them with guys who are larger.  That soem girls prefer to go with butt sex and a larger penis makes this impossible.\n\nDon't be defined by something you can't change about yourself.  Be confident in what you have and what you can do.  \n\nanyways, good luck and don't get hung up on something that may well be exactly what the next girl is looking for.  ",
            "Your girlfriend is a real piece of shit. I wonder if Mike wants to know about her saggy boobs or back hair.",
            "Hi, \n\n It is not only a breach of trust it is also anti-social. And I'm sure that she does not love  you. That hurts now, but go through the pain ... everything else it will only draw in the length. Stay strong, you can nothing for how big your penis is. Maybe you have bigger feet than others nature is a whore !! \n\nThis lovepain shit and accept that some people are assholes. It's fucking important .. that a big lesson 4 u.   LEARN\n\n\nBelieve me to get a girl is easy.. \n",
            "I once dated a guy with a very small penis. Only slightly bigger than yours. I would have never made fun of him for that and actually worked on his confidence with him. This is shitty and you really should move on. ",
            "Break up with her now! She told people something that personal??? What happens when you tell her about any insecurities and then you find out she told people saying \"oh my god he's so weak, so pathetic, I don't know why I'm with him\". I wouldn't be able to tell her anything. Except to get the fuck out.",
            "These people are complete prigs and don't deserve your compassion or respect. ",
            "Not to exaggerate, but your gf and friend are humongous asshole who don't deserve you as a friend.\n\nCould you imagine _yourself_ doing that to a FRIEND of yours?",
            "Good on you for dropping her. It sounds like she doesnt really want to be with you anyways, shes just too cowardly to make a move.",
            "I usually try to take a conciliatory tone and see if there are underlying issues that could be fixed. \n\nFor me though, this situation would be such a betrayal on numerous levels that I would nuke it to the fucking ground and cut those cancerous relationships out of my life. They betrayed your trust and your friendship in a deeply personal and hurtful way. \n\nI have stuff that was told to me in confidence. Things I told them I would never tell another soul. Even though sometimes it would have benefited me if it had gotten out. A confidence is a confidence. *YOU DO NOT BREAK THAT*. Would you ever trust her again with any deep personal secret? \n\nAnd the \"friend\"? What kind of asshole exploits a relationship issue between a friend and their significant other for some cheap laughs? \n\nYou're better off without them OP, trust me on this. And don't worry about the dick size thing, you're young, and I'm sure there's some hotel out there with  an overly small vagina that finds sex with a \"normal\" size penis painful. If you obsess about it as a flaw, it'll become worse in your mind than it is in reality. Own it. ",
            "Wow, to hell with all of them. \n\nDump her and dump your friends. \n\nBlock them all on social media and stop answering their phone calls. Cold turkey. This is inexcusable behavior on all of their parts. \n\nThe only thing wrong with you is lousy taste in friends and girlfriends. Eventually, you'll have good taste in fiends and these people will still be assholes. \n\nI'm a huge proponent of forgiveness and my advice is to cut these people out of your life *immediately* and don't event give them the courtesy of an explanation. \n\nNot even the girlfriend. ",
            "If she doesn't like it don't give it to her.",
            "She sounds like a BIG Dick!",
            "Dump her and find new friends.",
            "I hate to bring up Kid Rock as a source of knowledge, but he had this song back before he was super famous and it was called balls in your mouth.\n\nIn the song, there is a girl that is yelling at him in front of his friends, and she says he has a little dick.  He replies back by saying, that ain't what you said when you had my balls in your mouth.  \n\nI think that is a pretty good comeback to that assertation.  I think you might have missed your window to use that retort, but it may help others.",
            "What kind of people make fun of their lovers/friends? Ditch all of these people. \n\nPS I've had way below average, way  above average -  it does NOT matter because when the sex is good it's good. Do not let this bitch knock your confidence any more than it is.",
            "This happened to a friend of mine and I was the one she ranted to. It was super awkward cus he was there and even though she was joking at the time it she had said that she doesn't feel satisfied. \n\ntl;dr We kind of shunned her without having to really discuss at all. ",
            "I'd never trust her after that, I'd ditch both the guy and her. ",
            "\"Mike isn't a very mature person...\"\n\nNeither is your (ex-) girlfriend.",
            "Fuck her, fuck Mike.  Make new friends and get another girlfriend.",
            "It's not dramatic. You told her something and showed her something that is more than personal that you wanted to be kept secret. Just because you're small doesn't mean that you can't please her in any fashion. For her to go out and not only divulge the information, but to also make fun of you and rant about the lack of pleasure is outright wrong and despicable. \n\n\nYour \"friend\" Mike also sounds like a dick. Such people don't grow out of such a personality - at least not for awhile if they haven't already. You're best bet is to just drop him until he wises up... if he ever does.\n\n\nAs for other potential lovers, improve upon your other skills. Make up for your \"short comings.\" I seem to give girls as just as good organs with my mouth and fingers than sexual intercourse. Look into skills and techniques there. And if anyone teases you about it (which means they're an asshole anyway), flex your confidence in another aspect (Example: Oral skills).\n\n\nPlus, some females don't like it too big. Some prefer smaller guys. I've had girls that didn't want the whole thing from me (it \"hurt\"), and I'm not even massively huge or anything. I'm just a bit above average. So keep your head(s) up - and find new \"friends\"! Those people are toxic and will do nothing but drag you down emotionally.",
            "you should punch mike and tell your girlfriend to fuck off. Also you need to learn to live with the fact that you have a tiny dick. You have a small dick, and you have to own it. Become a master at every other form of sex and girls will love having sex with you despite your small size. ",
            "Your girlfriend is immature. Your best friend is immature. Why are you with these people?",
            "That's pretty fucked up for her to do. If she had enough respect for you, she would've talked to you about it instead of going off and telling it to someone else resulting in everyone making fun of you. Did she even apologize for doing it? She betrayed you and I don't think you'd be making a mistake if you broke it off with her. ",
            "Fuck her, She's immature as shit too just like he is. Good riddance dude, she isn't worth it and you have every right to be pissed. In the mean time, go on tinder and learn how to eat box",
            "I am sorry you are still with this woman? Why? She completely disrespected you, she is a very shitty person.",
            "[removed]",
            "This will sound horrible to you, however when you break up with her the jokes will most likely get a lot worse. Just imagine \"OP dumped his girlfriend because she told everyone he has a small dick!\" As terrible as that is for people to say it will happen either to your face or when you aren't around. Now you need to consider if you want to cut off all of these people, or ride it out and try to play it off. Remember that you are the most important though so if it's having an effect on your health to be around these people, then do what needs to be done.",
            "Hey sweetie it isnt about the size but what you do with it. \n\nGet rid of these immature assholes from your life and move on.",
            "if she isn't fucking mike already, she will be soon enough.\n\n3.5 is plenty for many. ditch her, have a talk with your \"friends\" and if they continue bringing it up, get new ones.",
            "Your mutual friend is going go try and sleep with her. She's going to go along with it. Get out before she does real damage. \n\nShe's a pretty awful person (might just be an age thing), but as a human being you deserve better. ",
            "Maybe the problem doesn't lie with the small penis, but with the big vagina.🙌 ",
            "[removed]",
            "Mikes probably gonna fuck your ex when you break up with her. You should probably debt him too just for good measure",
            "DTMF",
            "Respect is number one in relationships. Dump her",
            "Drop them both!  Your girlfriend betrayed your confidence and your friend can't keep secrets and is an asshole.  You're better off without them.",
            "You guys are young and this is the time where people make mistakes, but I'm not saying you should forgive her, I'm saying she will probably try to use that excuse for her (and his actions) Do not be convinced. End the relationship, she has so little respect for you. Please do no update this thread in a week saying that you guys are working it out",
            "My girl enjoys being fingered almost as much as straight fucking. You can hit different spots with your hand. Throw in a vibrator and you're golden. A smaller than average penis doesn't mean you're small, first of all, and it doesn't mean you're useless in bed. Fuck your girlfriend and fuck your friend. Find new people to fill both positions. ",
            "Tell every one it wouldn't be a problem if she didn't have such a cavernous kooter. Or just dump her.",
            "When (if) you break up with her, you're just going to have to explain to your next gf your troubles...tough situation.",
            "Ditch all those people: GF, Mike, all the people making fun of you... You don't need that kind of people in your life.",
            "She's a petty bitch.  Dump her ass and be thankful you've dodged a bullet.   Don't let dick size get you down.   I've known women who have worked with less.   ",
            "That's fucked up and really bitchy. Your sex life (including penis size!) Is no ones business outside of your relationship! Her telling someone (especially a male who is known to be immature) that you're not satisfying her is extremely inappropriate. No you're not being dramatic, you have every right to be hurt and angry. I would not want to stay with someone like that. ",
            "My best friend is a guy, and mutual friend of myself and my boyfriend. I do not, ever, under any circumstances, bitch to said friend about my boyfriend, because it's bad firm to bitch about your dude to a dude, ESPECIALLY a dude your dude is friends with. ",
            "I have an easy answer. \n\nDitch this \"Mike\" and your gf, soon to be ex-gf. \n\nYour life will improve without these \"Friends\". ",
            "Watch Unhung Hero, and ditch assholes like that.\n\nTo most people that sort of thing doesn't matter, but bothersome \"flaws\" that friends have are off limits for teasing; either they never knew it hurt you, and they're idiots, or they don't care enough about you to keep private matters private, and are assholes.",
            "Get rid of all these shitty people in your life dude.",
            "bunch of cunts",
            "Huge betrayal by so many people warrants cutting them out of your life. A mature and good friend would have told her how inappropriate that was and would have shut that down fast. \"Mike\" is a toxic friend and your girlfriend is just as bad of not worse. \n\nYou need to cut them out fast. A good partner would find ways around the size. I had a boyfriend with a smaller than average size penis and we used other methods and tried different positions that made sex fun. I never criticized him for it, especially since it wasn't his fault and that's just a horrible thing to do to someone. Everyone has insecurities and people should *never* put them out there to people like this. \n\nI'm sorry OP, but it's time to drop them and find good people to surround yourself with. I wish you the best. ",
            "Wow, how totally shitty of her. \nGoing to your mutual best friend and making jokes about your penis? That's just not right. She should have respect for you enough to not taunt and pick on you about it. \n\nI would probably take her going to your friend, and expressing herself as an attempt to get with him. I see little reason to complain to him other than this.\nShe went to a MALE friend who maybe she thinks can \"Satisfy her\". Complete betrayal of trust. You have A LOT of reasons to be angry with her.\n\nFor me this would be a 100% breakup situation.\n\nA lot of girls do not care about penis size. You are who you are and you should be proud of it. ",
            "[deleted]",
            "It aint the size of the gun that matters, it's the gunman's technique.  besides, a 747 looks small next to the Grand Canyon.",
            "Sorry to hear that bro.  That really sucks.  Ditch them both, they are going to be excessive drag moving forward.\n\nAnd ... work on being really funny?",
            "U don't have a small dick , dude. She has a big mouth.",
            "If you break up with her you know that she s gonna end up fucking your best friend Mike right? Because that s what is going to happen. And also you LL feel hurt and get angry and break up with Mike too, and all of a sudden he and your ex will start making jokes on about much Mike is able to satisfy her and enlarge her pussy with his penis, right? You know that right?",
            "Tell everyone you dumped her because her vagina was just way too big.\n",
            "[deleted]"
        ]
    },
    {
        "post_id": "b5qsvw",
        "author": "Throwingawayup1346",
        "title": "My [26F] sister in law [31F] always goes into my bedroom for no reason. How can I get her to stop?",
        "url": "https://www.reddit.com/r/relationships/comments/b5qsvw/my_26f_sister_in_law_31f_always_goes_into_my/",
        "score": 4213,
        "num_comments": 524,
        "created_utc": 1553612755.0,
        "selftext": "Before anyone says anything, I know how stupid this sounds. But hear me out. \n\nI have my own home with her brother, and all three of our bedrooms and our only bathroom is upstairs. The only reason anyone has to be upstairs is to go to the toilet, or possibly to my daughter's room if their kid is playing there too. \n\nI've noticed whenever my SIL comes over, she just walks on through to our room, which I kinda feel like is an invasion of privacy. All the clean laundry comes to our room, and if we have visitors we tuck away a few things in our room so it's invariably the messiest room in the house and the one we least want people in. But no matter what she's always in there, and seemingly for no reason at all. It's usually to 'see my paint colour' (it hasn't been painted in over a year) or 'see the cat' or 'look out the front window'.\n\nThe worst was today - I came home from work early as I'm feeling ill. I knew she was coming over with her kids and my partner kindly said I could stay in bed and not worry about coming down to be sociable etc, especially with the kids over it's a lot when you have a headache. He said he just wasn't gonna mention I was home at all because the kids would come try and chat and play if they knew I was here.\n\nSo I'm listening to them play in the next room and SIL comes up to check on them and sees they are all fine. THEN SHE OPENS MY BEDROOM DOOR. I've stuck my head under the covers and she hovers then closes it again. Wtf?? Why is she always opening my bedroom door like what is she expecting to see? \n\nI just feel like because we're all adults it's an unspoken boundary, you don't just hit up someone's bedroom without having an invite to come see or a legit reason. \n\nAm I weird for thinking this is irritating and not being able to make any sense out of it? Also I know that everyone is going to suggest I just talk to her about it but how awkward is that? 'Yo I know you're in you're 30s now but please stay out of my room?'. I have tried in the past to hint that I hate having folk in there because that's where all my laundry goes for ironing and all the spare toys get stored to create extra play room. She don't give a shit. \n\n**TL;DR: SIL always enters my bedroom unasked and this is where I hide all my messy shit when people are over. How can I ask her without sounding weird and accusatory?**",
        "permalink": "/r/relationships/comments/b5qsvw/my_26f_sister_in_law_31f_always_goes_into_my/",
        "comments": [
            "My sister was like this. She has a habit of wandering about, aimlessly looking through things. I just told her bluntly, \"Hey, could you stop looking through my stuff like that? I'm an adult now, I need some privacy.\" She was actually very apologetic. She didn't realize what she was doing and has since stopped completely. There's something to be said for direct communication.",
            "She’s nosy, bottom line. Just clearly tell her no. “Please don’t go on our bedroom.” You don’t have to give her any more than that. \n\nETA and her brother should be the one to say it, not you. ",
            "It's incredibly inappropriate. Get a lock for that door.",
            "She's proven that she's impervious to hints, it's time to be direct. \n\nActually, the incident today would have been an ideal time to bring it up.  When she poked her nose in your room you should have sat up and told her that the door was closed because its your private space and you would appreciate it if she would stop encroaching --whether or not you are home.\n\nYou could also tell your brother that you are fed up with her nosiness and that the next time you catch her at it, you will not be polite about telling her off.  If he doesn't step up and tell her to stop, you will have to do it yourself.\n\n\n",
            "paint color? what the fuck? if it were a lack of boundaries or lack of social graces that's one thing, but the fact that she's giving such asinine excuses makes it sound way sketchier - and her going in there when it was implied you weren't home is totally inappropriate. Next time it happens just confront her directly and ask her to stop, or, if you're in the bedroom, ask her pointedly what she needs - hopefully embarrassing her will discourage her sufficiently. ",
            "> Also I know that everyone is going to suggest I just talk to her about it but how awkward is that?\n\nSo,.... you already know what you need to do.\n\nGuess what, it is time to adult. Adulting means ignore the awkwardness and having those conversations anyway. Why? because reasonable boundaries are necessary.\n\n\"Yo, SIL, I need you to respect my privacy. Stop going into my bedroom. Nope. No excuses, there is literally no reason for you to enter without asking my permission first.\"",
            "One of those swinging axe on a rope traps will get the hint across.",
            "Change out the doorknob to one that locks.  Then, lock the bedroom door whenever she visits.",
            "Hopefully this is not the case, but when my aunt kept snooping in upstairs rooms it was because she was an addict and was looking for cash and pills. We noticed painkillers missing (prescribed for me after a surgery that I did not take) and dollars would vanish. Is it possible she is doing something similar?\n\nEither way, tell her to stop and get a lock.",
            "I would get your husband to ask her to stop going into your bedroom. Yes it's nosy and inappropriate. I would start keeping the door locked when she is coming over as well.",
            "Being an adult means you have to have difficult awkward conversations. Although, in this instance, it should be her brother, not you, who is maintaining the boundaries and telling his sister to keep her nose out of your business (aka your bedroom).",
            "Is she ever in there unsupervised?  This could be a stretch, but a friend of mine had a huge opiate addiction and NONE OF US KNEW.  She told me part of how she got so many pills was gaining access to her friend's bedrooms and bathrooms and looking through their cabinets/drawers.  She said the hardest part was coming up with an excuse to gain unsupervised access to those areas, but she could always think of something.  ",
            "[deleted]",
            "Any chance she has a pill addiction?",
            "She's being rude, and you should tell her. \n\n&#x200B;\n\n*\"Hey, I thought I would mention, but our room is off limits to guests. We'd appreciate it if you would stay out of there.\"* \n\n&#x200B;\n\nIt's not accusatory, but it's firm and concise. If it doesn't stop her, look into having a lock placed on the door or don't invite her over if she's going to be nosy. ",
            "Yeah you really missed an opportunity to confront her when you hid your head underneath the covers.  A curt “Can I fucking help you?” May have driven it into her thick skull. ",
            "Do you keep medications in your room? Seems like she’s looking for something. ",
            "Have your husband tell her if you feel awkward about it.  His sister, his job to tell her to stay downstairs. ",
            "Jesus! Just speak the fuck up. Don’t be scared ",
            "You say you’re all adults but then you say you haven’t even directly told her you don’t want her in your room you only hinted at it? Just tell her straight up please don’t go in my room anymore I don’t feel comfortable",
            "Why aren't you calling her out on it? \"STOP GOING INTO MY BEDROOM. RIGHT NOW. DO NOT EVER GO INTO MY BEDROOM AGAIN.\"",
            "My boss's sister-in-law does this too, except she's in her 60s! And I don't mean just go into their room, but open drawers and poke around the closet. She'll also open their kitchen cupboards and rifle through them and say things like \"Oh, you don't have any chips\" and cue the sad face. My eight year-old nephew has better manners and sense of boundaries. \n\nOP needs to be direct. I'd be like \"It's really weird to go into another adult's bedroom. What's wrong with you? Don't do that.\"",
            "I have an aunt like this. We just lock the door. Tried the talking, tried the being rude. Solution: locking the door. ",
            "When my cousin was five she got caught shaving her legs in the bathroom by her mom. My cousins reaction? “Get our and close the door!”\n\nI’d channel your inner five year old because your SIL is rude as f.",
            "Well, it clearly isn't an unspoken boundary, because you haven't spoken it and she isn't abiding by it. You're going to have to be direct and tell her to stay out of your bedroom. When you see her going for it, tell her not to go into the bedroom. If you're in the bedroom and she comes in, tell her to leave. It really is as simple as that. No hinting, no dancing around it. Just tell her what you expect. \n\nIf you, a grown woman with a child, can't stomach the thought of having an \"awkward\" conversation, this is never going to change. You're going to have a lot of \"awkward\" conversations as your kid gets older, so you're going to have to get used to this. ",
            "My new roommate is the same. He comes up with a fake excuse to walk in my room. He’ll knock, ask for me, I won’t answer, open the door, ask for me, no answer, then he’ll walk in and act surprised when I’m sitting there. He always picks up random nick nacks, and will say like, “oh what’s this? Where’d you get it?” As a way to derail my impending, “what do you want.” \n\nHere’s the thing, if they are doing this when you’re there, they’re also doing fuck knows what in there when you’re not. \n\nGet a lock. Fixes everything. I still hear him click the door handle from time to time. And now I don’t have to worry when I leave. You don’t have to justify why you got the lock. If they ask, simply respond, “lack of trust.” They’ll get it. ",
            "My mother did this to me since I was a teenager and continues to \"check up\" on me while I stay at their place for the holidays. It got to the point where she would literally open the door at the dead of night, turn the goddamn light on to \"just check and see if I was there/ok\" and promptly shut it off and leave as soon as she sees signs of me waking up. Like wtf?! \n\n&#x200B;\n\nThis past xmas, I was napping and she came in screaming at me for not coming to lunch as she made me my plate 2 hours ago. I packed in the middle of the night and booked a 1-way ticket home the next morning and uber'ed the airport at 6am. Haven't talked to them since.\n\n&#x200B;\n\nTell your SIL to go fuck her herself. For me. ",
            "The ole bucket of marbles over the door trick might be in order",
            "If you don't want to talk to her, I'd install a lock. They aren't that expensive and it should be worth it for your piece of mind. \n\nFor extra passive aggressiveness, when/if she asks \"hey, when'd you get a lock on your door?\" Play dumb and say it's always been there. If she then asks \"why is it locked\" tell her she shouldn't be going into the bedroom.\n\nI don't think this is the best thing though. Your husband should talk to her and tell it's inappropriate and that a closed door in someone else's home is a clear boundary. Also that crossing that boundary makes both of you uncomfortable.\n\nBest course of action is to talk AND add a lock ",
            "Should get a lock if you won't talk to her about it.",
            "\"sorry, we don't allow peoeple in our bedroom\". If she goes in anyway, talk to her and tell her that's an invasion of your privacy. Get a lock on your door, too. ",
            "This is so wrong for so many reasons. She is a guest in your home. Guests don't go wandering around houses they are invited to even if its relatives' homes. When I visit family or friends, I only go into their bedrooms if there is something specific that they ask me to do, retrieve, see or if they have a bathroom available in their rooms. It is so disrespectful to just walk into someone's room!  You just don't do that. Your room is your private sanctuary, its not a public space. She is clearly snooping around to see what you own or compare things. Lock your door. Its passive aggressive AF but she'll get the message.",
            "She clearly has no respect for boundaries.  I don't think having your husband speak with her is a good idea.  You have to say to her, \"Please stay out of my bedroom.  I don't like that you go in there and I do not want you to do that anymore.\"  If she asks why just reply that it is a boundary issue for you, it has nothing to do with her, and you don't need to discuss it.  She has no reason to be angry about this, she can only comply.  End of story. ",
            "Tell her not to. If she still does, put a lock on your door and hope it embarasses her.",
            "I'm assuming this is your husband's sister - what does he have to say about this? He is the one who should be talking to her about it. It doesn't have to be a huge conversation, just a simple \"we don't want people going into our bedroom, we really appreciate you respecting that.\" Don't ASK anything. This is your house. ",
            "Do you keep any money, prescription pills, valuables etc in your bedroom? The only time I've ever caught someone doing this in my home, they were looking for something-like, to raid my medicine cabinet. Granted, I used to have horrible \"friends\". Could she be looking for something? Or something she feels is hers, like clothing? ",
            "What does your husband think about this? It's his sister, so it would be way less awkward if he told her to back off",
            "The obvious solution is to make it a spoken boundary instead of an unspoken one. Her brother should tell her that it’s rude and she needs to stop.",
            "Grow up and either stand up for yourself or get a lock. Its not rocket science ",
            "\"Hey sis, noticed you've gone in my room a few times.  If you need something, let me know. I like to keep that door shut since it is our private space.  Thanks!\"",
            "I like to start awkward conversations with the word \"Dude\". I feel like it sets a conversational tone instead of an aggressive one, with just a hint of a \"what the fuck\" vibe to it. \"Dude, you gotta stop going in my room,\" in this case should work.",
            "Here's a thought...do you take any kind of doctor prescribed narcotic medication? There's a small possibility that she could be going into your room to have access to it if you do. Hopefully this isn't the case, but it seems suspicious. She may even be helping herself to another item. See if u can hide a camera of some sort in your room the next time you know she's coming over.",
            "Lock the door.\n\nI don't trust that the kind of person to be snooping around in your bedroom in the first place, is going to actually stop just because you ask them to. She's already making excuses for why she goes in there. She'll just be more careful not to get caught, and have another excuse ready for if she does.\n\nIt's also entirely possible that this isn't just innocent curiosity - many people who snoop are hiding an addiction, looking for pills, or looking for stray cash they can use to fuel an addiction without their spouse noticing. Not sure why no one seems to find this behavior suspicious. ",
            "Sounds like my mom, it's extreme nosiness. She's not allowed in my house unattended because she'll go through my things. When I used to live with roommates, I'd catch her going through THEIR things. At one point I caught her in my landlord's portion of our duplex. \"I'm just looking!\"  \n\n\nTell her to stay out. If she doesn't, either don't allow her into your house, or simply buy a lock for the door and lock in when she's around. ",
            "I know you may think it awkward, but I think the best solution would be to just tell her, \"Hey, when you visit I would appreciate it if you don't go into my room. It's usually messy, and a private space. Please don't go in there.\" You'd be surprised how powerful basic communication is.\n\n&#x200B;\n\nWhen I was younger, and friends would come visit my house for a sleepover - I used to just go through their bags. I would do this openly. Nobody told me it was bad, and I genuinely didn't see a problem with it, because in my mind \"I wouldn't have a problem with it if someone went through MY bag\". It wasn't until I was in my late teens and my friend bluntly told me off for it, and how it was an extreme violation of her privacy. When I saw how upset she was, I was completely remorseful and embarrassed for what I did and NEVER did it again. Sometimes you just need to hit someone with a bit of truth for them to get it.",
            "\"Hey, I'd prefer it if you didn't go into my room next time you come over thanks\".\n\nThen\n\n\"Excuse me, I specifically asked you to not go in my room when you come over, yet here you are. There's no reason you need to be in here. STOP DOING THAT PLEASE.\"\n\nAnd keep escalating it until she gets the damn hint!",
            "Nanny cam that bedroom.  Might just be a weird curiosity, or might be something really creepy and inappropriate.",
            "What did you hide?! This was your great opportunity to put her in her place, yet you cowered like a chicken, in your own bedroom!! Most people would have lost their shit. You need to unpack why you have such an aversion to confrontation.",
            "Leave the most aggressive sex toys you can find as well as lingerie and lube all over the room. That will keep her out.  Or a door jam works as a really simple lock if you're in the room and dont want her in there. I farted and locked my husband in our room that way as a joke thinking it wouldnt really work well but the more he pushed the tighter the jam was under the door. We were both shocked by its effectiveness. (I havent done anything like that since and would never leave the home with him locked in like that in case of a fire or something ) ",
            "1) she’s probably looking for something- drugs, money, jewelry, etc. No adult consistently snoops for no reason. I’m suspicious of her intentions. \n\n2) setting boundaries is awkward but what’s more awkward is her walking in on you when her brothers balls deep inside you. Talk to her. Doesn’t work? Get a lock. ",
            "If I were you, I would have fun with it. (FYI: I definitely think she's out of line, but clueless people are clueless). I would go to an adult toy store, buy the biggest dildo you can find/afford, and just put it right in the middle of your bed. (This only works if your kids also know to never open your door).\n\nThen just wait for her to be nosy again. Then put something else in your bed. See if she says anything.",
            "Also not to mention if your in the bedroom and your changing would she just come into the bedroom I think you need to tell her that before going in your room she needs to knock and that if you want to speak to her you'll open the door other wise if no one answers the door or says come in she needs to assume it's not okay how would she feel if you went into her privacy it's common sense to show some respect when at someone else's place and she needs to be told it's not okay if she does it again then your husband needs to talk with his sister ",
            "Shen sounds judgmental. If she isnt snooping, she's poking her head in because she's curious/nosey and judgmental.",
            "This is very clearly a padlock-on-the-door situation, *if* you talking to her explicitly doesn’t work first. Also, be prepared after talking to her for her to be super clandestine and sneaky — so maybe set up a nanny cam in your bedroom for when you’re not home. ",
            "So put a keypad lock on your door.  Done.",
            "plain and simple tell her to stop going into your bedroom. You dont have to argue with her or explain yourself. I would also suggest getting a lock. ",
            "When I was a kid, my paternal grandmother (terrible and unliked and only visited us once or twice) was found by my mom sitting on my parents' bed, going through the dresser drawers. We didn't find out what she was doing until YEARS later when we had to change our phone number for unrelated reasons. My dad decided not to give his mother our new number (again, TERRIBLE and unliked), but one day she calls. We can't figure out how she got the new, unlisted number, until my maternal grandmother (wonderful and loved) confessed that she had given the number out.\n\n&#x200B;\n\nPaternal grandmother had gone through my mom's address book and copied all my mom's family contacts down. \n\n&#x200B;\n\nMy point is, I hope she wasn't going through your things for REASONS.",
            "Get a lock for your bedroom door. She has no right to go through your things or go in your bedrooms. Your SO needs to put his foot down and tell her that if she doesn't respect your boundaries, she won't be invited back.",
            "I would put a lock on the door and hide valuables. As others have mentioned, she’s a drug addict or looking for something to steal. ",
            "Urgh my MIL does this, we live in a small apartment at the moment so she just will just wonder around after she's used the bathroom and then make comments about what's in our room! I find it weird as I was raised to never do this as it's an invasion of privacy. ",
            "Hell no, you're not weird. As a child, I was raised to never enter the bedrooms of a house when visiting, unless given permission. Always stay in common rooms, and always ask for directions instead of searching for the bathroom yourself. As /u/Mabelisms said, she's just nosy as hell, and you have every right to feel that your privacy is being invaded. Let your partner know how you feel and see if he can get the message through to her. If that still doesn't work, buy a huge butt plug and double ended dildo and leave that shit out on the bed whenever you're expecting her over. I bet she'll stop barging in ya'll room then. Smh. ",
            ">'Yo I know you're in you're 30s now but please stay out of my room?'.\n\nSo this has nothing to do with her being in her 30's, and that doesn't need to be in the conversation. You just need to tell her in advance of your next visit or when she shows up at your door: \"Hey, I would prefer you stay out of our bedroom, it's our private space. If you need something from it, please let me know.\" This is a way to communicate your expectations to her clearly without being accusatory or judgmental. \n\nI think your awkwardness possibly comes from that female thing where we are trained to be appeasers, rather than assertive. Many of us learn that from such a young age, and then get no practice at being assertive by the time we're adults. I see some people suggesting your husband handle this since it's his family. But I want you to encourage you to learn how to do this, precisely because you sound like you don't know how to approach it (you've been hinting rather than being direct) and you mention you have a daughter. It's a skill you need to work at and develop so you can pass it on to her. Don't do it for yourself, do it to be a role model for that young woman you're raising. \n",
            "Lock the door when she's expected. You don't have to explain, no confrontation, and it's a clear message.\n\nEdit to add: Have been through theft twice with drug addicted family/friend. You would never have thought either was an addict. It was only when my husband (who knows down to the dollar how much money is in his wallet) missed money, and my wedding ring disappeared, that we knew something was up. ",
            "I'm sure other people have already said this, but put a lock on the door if you don't want to confront her or don't think it'd work/or come across right.\n\nOr if you do have locks on the handles that you can pop by sticking that little door unlock needle tool in the handle, start locking them when shes over and put the tool on top of the door frame so you can get it.\n\nBecause then if she snoops, she really has to try and there will be no question that there's an invasion of privacy if you have to confront her.",
            "Not weird.  Our bedroom is nobody else’s business and if anyone other my SO or my children go in there I get super annoyed.  I see it as a total violation.",
            "Why has no one suggested a lock. Simple. If she mentions it just say you are sick of your 'kids' going into your room without permission. Problem solved.",
            "The easiest way to keep someone who doesn't give a shit about your privacy out of rooms you don't want then in is to get a locking doorknob.\n\nYou can get a key lock or a code lock and just lock it before she comes over.  Then she can't go in and if she gets upset about it you can ask her why she feels the need to be in the room that you share with her brother.",
            "Put a lock on the door.",
            "It seems to me like she is hoping to find something. Is there a family heirloom you might have that she would want?",
            "Just because I'm kind of petty and not really super shy, I'd rig up the room with the most inappropriate and scary looking sex toys. Giant dildos on the floor, bed, stuck to the wall? Yep. Stripper pole and sex swing set up? Yep. Whips, cuffs, blindfolds/ball gags? Yep all over the floor/bed. Heck throw in a fleshlight or two, some lingerie, maybe even some old school porn magazines scattered about. Put a little lube on the floor for her to step in so she wonders wtf is on her foot. \n\nThen rig up a camera to catch her reaction. If she's shy, she'll never bring it up and hopefully she will stay the eff out of your room! If she does bring it up, ask what business she had in there considering how many times you have asked her to stay the heck out!\n\nBut that's just me maybe....",
            "I'd change my door knob so that she doesn't a key to get in",
            "She probably does that as she is used to just entering her brother's room.  Which your room is technically her brother's room.  Talk to your husband about it.  There is no need for you to bring this up to her as your husband should be able to handle it.",
            "I know its obnoxious but you have to lock your door. She will hopefully get the picture. You partner also needs to talk with her",
            "Get a lock.\n\nWatch her face.\n\nGood times.\n\n:) ",
            "Make a door booby trap. Make it slimy.",
            "There are two options here: talk to her about it, or don't and get a lock for the door. It's nosy and weird and a 31 year-old *should* know better, but at the end of the day it is what it is. Weirdos gonna weird.",
            "Just put a lock on the door and an alarm (as a back up in case you forget to lock the door and she's over) embarrass her and let her feel ashamed. Once she feels ashamed for her actions they will not be repeated. TREAT HER LIKE A TODDLER!!! Seriously treat her like she's a kid who just turned one and is exploring things. Make the house nosey proof for those fools who wanna snoop. It'll stop very quickly. :D also if not then just confront her outright IN FRONT OF your husband so he can back you up as well. It needs to be done ASAP!",
            "Get a lock on your room, don’t use it unless you know she will be over. Let her get insulted about it being locked and if she asks you why you added a lock ask her why she can’t respect your private space. At that point any hurt feelings she has is her own doing because you’re an adult who is allowed to put a lock in your own home. She’s really weird for that",
            "Could you possibly lock the door when she’s over?",
            "She may want a piece of the old ham ",
            "You can buy a knob and lock on amazon for like $20 and replace the handle.\n\nI recommend the kwikset ones you can re-key yourself. Installation is one screwdriver.",
            "No I definitely feel like my bedroom is my private space and people shouldn’t just be walking in there. When I first went back to work after my maternity leave my MIL was watching my baby and I came home one time and she had cleaned up our room and I’m pretty sure she went thru my night stand. It bugged me sooo much. I don’t care if she cleaned up I would rather she didn’t! So I told my SO to talk with her. I would maybe just tell your SIL hey, this is a space we consider private so I would appreciate it if you didn’t go in our room unless it’s necessary. And then throw in something like, it’s always so messy anyways to make it seem like you don’t want her to see your mess or something like that ",
            "Honestly if you've told her to stop before and she hasn't listened, my advice at this point is to install a lock and keep a key on you or in your house somewhere at all times. That's what me and my husband had to do\n",
            "I do not understand people like this at all. My boyfriend's family's house is set up to where the entire upper level is his parents' room. There's one bathroom downstairs and one up. One time his brother was in the shower downstairs and I REALLY had to pee. My boyfriend told me to use his parents' bathroom, but it felt so weird to go upstairs without their ok that I waited it out. It's a social instinct to not overstep bounds, so I don't understand people that invade basic privacy without a care in the world. I'd shrivel up and die before I overstepped a boundary.",
            "It would be best to deal with this up front. Maybe have the husband there when you do it, but in all honesty, if it bothers you, confront it. Tell her you dont like it. Otherwise, it will  just continue. ",
            "This is so weird and creepy. Zero reason for this behavior. She sounds nosey and invasive and you have every right to respectfully but very firmly insist that you feel uncomfortable w her entering your bedroom without invitation and that you need her to respect this boundary if she is to come to your house. ",
            "“Yo SIL, when visiting please refrain from entering our bedroom. It’s inappropriate and you are not invited to”. That’s it, don’t engage. Say this with your partner in the same room. If he doesn’t back you up then that’s an issue. Bottom line is you manage your people. He manages his. ",
            "Omg this would drive me crazy. You need to just tell her straight up that she does not have access to your bedroom and if she does it again, she won’t be allowed over.",
            "get a lock, yo.\n\nher behaviour isn't cool but you can just hold your boundaries silently with a little doorknob lock.",
            "Put a lock on your door. Honestly, I would avoid any confrontation on the subject.  I don't see much good coming from it.  Put a lock on your door and if she asks you about it, blame it on the kids snooping through your things.",
            "Start locking your door?",
            "Have you brought this up to her brother? Let him deal with it. Personally, my siblings can wander all about my place but if I had a live in SO, I would respect their privacy and address it on my own. \n\nIt's weird that she can't take a hint and sound more like creeping about rather than restless wandering. \n\nIf it doesn't stop after some kind of direct communication from either you or your SO, put a sign that your room is off limits to guests. Clearly this person isn't a mind reader. ",
            "No you’re not being weird or overly sensitive she’s being nosey or just plain disrespectful in my opinion and I was always raised not to just go through someone’s house especially not into their private bedroom that is very rude, does your husband know you feel this way? If not maybe he needs to know how much it bothers you and he can ask her to stay out of there? Might be less awkward coming from him. ",
            "T E L L. H E R. N O T. TO. \nBOUNDARIES ",
            "Tell her that it makes you uncomfortable. If you’re really worried about confrontation, allow that you realize that it might not make sense to her, but that if she’d abide by your request, it would make you feel much better.\n\n“It’s always so messy in here! It’s where we fold clothes, and I try to focus more on the parts of the house I expect people to see, anyway.” If she says “oh, that’s okay! I don’t mind/care!”, let her know that it’s not so much about her, as your embarrassment.",
            "I really think your husband having a direct conversation with her would be the most appropriate route. However if you aren't wanting direct confrontation from either of you two, you could just stick a sign on your door when you know she is coming over. \n\n\"Off limits to guests.\"\n\nIf you still catch her in there, then confrontation is a must. ",
            "Easy fix, ask her to knock, or have your husband ask.",
            "You have 3 choices. \n1.\tConfront her.\n2.\tInstall a door knob that locks.\n3.\tDon’t say anything and continue to feel uncomfortable in your own home.",
            "WEIRD. RUDE. STRANGE. GROSS. \n\nWhy is she sneaking around? Is she obsessed with you? ",
            "This is your husband's job. His first loyalty must be to you and your comfort in the home you share. He needs to have a chat with his sister.",
            "Buy a door knob that requires a key to open, close the door and lock it when you don't need to enter that room. I do this for every bedroom I have ever had, simply put, it is my room and nobody has any business in it when I am not home.",
            "Put a damn lock on the door, jeez! You don't have to discuss it with her whatsoever.",
            "Put a lock on your door with an actual key. Lock it whenever she's over. it's a total invasion of privacy. ",
            "Get a Do Not Disturb sign, hang it on the door, and the next time she does it ask if she can read.",
            "Next time you know she's coming over tape a sign to your door that says \"Linda, please do not enter.\" She will see it and feel called out. Also, put a lock on the door.",
            "She have an addiction?  \n\nMy SIL behaves similarly, like when she’s in the bathroom we can hear her open up the cabinet an go through our pill bottles.  Not that we were listening, she was just that friggin obvious, pills make a distinctive noise plus the cabinet opening and closing  I always assumed she was shopping for drugs. Unfortunately for her none of our prescriptions are fun. And you can’t get high from Advil. \n\nAlways funny how if we were all outside she’d be creeping around the house.  Annoyed the hell out of us too.  Thank god we pissed her off and sh3 stopped coming over. \n\nMy mom was the nosy type. So maybe SIL is just nosy?\n\nIf I was bold or didn’t give a shit id just get a huge black dildo with a suction base and stick it to your mirror for the next time she come over.  Or something equally shocking that won’t traumatize the kids if the stumble upon it ",
            "How awkward is  to tell your sil to get the f#ck out of your room, unless she is invited?? It should only be awkward for her! either you tell her to get some boundaries or you shut up and put up with it...  which one's better for you??",
            "You could rig up something so there's a loud sound when the door is opened. Either one of the magnetic child safety alarms, or a big pile of boxes/ books/ something that will make a loud noise when it falls over, and then rush upstairs to \"see if she's ok\" the  ask is there something she was looking for? Why was she in your bedroom? ",
            "So why are you so hesitant to tell her to stop? ",
            "No, that's pretty weird and would make me wicked uncomfortable. See if maybe your partner  would be willing to say something. Since they're siblings, they might be more comfortable being more direct and firm with her. I like the lock idea but that doesn't work if you aren't home, unless you want to start locking your bedroom door everytime you leave the house as well which sounds annoying too. Unfortunately you will probably have to talk to her about it at some point. I am not the biggest fan of confrontation, so if you catch her in the act it might fuel the 'what are you doing, that's not ok' energy to broach the subject.",
            "My fSIL (19) did this. I would say “ oh that’s in our room I’ll get it” and she jumps up and goes and grabs it. It really bothers me (23f). It has happened on more than one occasion. I explained that to him (24m) that I really don’t like that and it bothers me. He said he didn’t know why she was doing that but she probably didn’t realize she was doing something wrong. (I had hinted very strongly to her that I didn’t want her in there but oh well) He had to tell her that she doesn’t have that freedom to come and go into his room as pleases into our room. She was not happy but idc. It’s not her space. Period. Your SIL knows that she is wrong but until verbally addressed it will not stop. ",
            "What does your husband think of this behavior? Does his family have a ‘culture’ of wandering into others rooms for no reason? It could be a family culture thing. I think a simple comment to her, from your husband, will get the point across (rather than something abt the room being messy or what not): please don’t go into our bedroom. Simple. To the point. No need for explanation really. Your house. Your rule. ",
            "JUST LIKE THE SIMULATIONS",
            "It's not weird or a silly problem. One of you needs to tell her. And not let it happen anymore ",
            "I feel like there is a very clear and obvious solution here....tell her politely and plainly to stop? Establish boundaries? I understand wanting validation but seems straightforward to me  ",
            "Yell her,  \"stay the fuck out of my room\".",
            "My mother-in-law lives with us and we used to have a problem with her just walking in our bedroom to come tell us stuff. We established a \"knock first\" rule but then she would knock and then immediately open the door without waiting for an answer. Now it is a \"knock first, wait for answer\" rule. This doesn't really apply to this situation, but I remember someone telling me the way to stop someone from just barging in is to just let them catch you full frontal nude. Yes, you'll probably be embarrassed, but so will they and they won't just come barging in again (unless they're a little freaky-deaky). I always thought this was a funny answer to this problem.",
            "Make a password for your room. If she doesn't know the password, she can't get in.",
            "Yes, it is an unspoken rule that adults don't go into other adults bedrooms unless invited. Apparently you need to speak that unspoken rule in this case.",
            "Your husband needs to handle this.  His sister, his problem.\n\n&#x200B;\n\n\"Hey sis, i notice you're always going into the bedrooms.  Please stop.  it's an invasion of privacy. If you need to go or see in any of the bedrooms, ask first.\" \n\n&#x200B;\n\nAnd then put a lock on your bedroom door.  ",
            "I would suggest getting a poster of her brother and you in the formation of how John Lennon and Yoko were naked. have it in an area she will see only when she comes over. I will doubt very much she will go up again. I also highly doubt she'll ask \"Why are you and my brother naked on a poster?\" Since she literally has no business being up there. Once she leaves hide it or get rid of it. I know it's not the best answer to the problem but it sure as hell would be the funniest 😂.",
            "get a lock for the door",
            "I'm another one who agrees with a stern talking to and a lock on the door/blaring alarm. I'm borderline petty, but also don't think you should be nice anymore. I think you have been passive and nice for long enough. If you feel awkward to do this in person or your husband won't step up to the plate, a simple text that says \" I was in bed when you walked into my room today. Please stop going into our bedroom. It invades our privacy and we would not like to keep the doors locked in our own home.\" ",
            "You are adults, it is not ridiculous at all that adults if not happy about something, say something :D \n\n&#x200B;\n\nYou don't like it so ask her to stop doing it.  Being an adult means having flipping difficult conversations from time to time.  Better to handle it than fume about it.\n\n&#x200B;\n\nOr you could go Queen Passive Aggressive on her arse and fit a lock and keep the door locked when she is there. :D \n\n&#x200B;\n\nWhy is your bedroom door locked?\n\nOh, people keep going in there and I don't like it, it's a private space.\n\n&#x200B;\n\nThe thing to remember is everyone is different. What appears to you to be an unspoken rule and boundary that everyone knows - is not necessarily a universal truth.  If someone is doing something that is not ok with you - tell them.\n\n&#x200B;",
            "I know you don't want to offend her but guuuurrrl it's okay to say no. ",
            "Lock the door and put a sign warning: do no open the door lol She will totally know you know what shes doing. If you confront her you will get upset with your husband and she will throw a fit. So, passive aggressive would be best. She is still family and it is not like your husband will stop her from visiting. ",
            "Next time she comes over, hide in the closest and have your husband tell her you're out.\n\nWhen she comes in the door, burst out of the closet, scaring the crap out of her.\n\nThen seriously tell her not to come into your room without asking\n",
            "She opened your bedroom door? Man I would’ve lost it. I’m protective of my space. I’m afraid you just need to tell her outright. She may have hurt feelings as she obviously doesn’t share the same thoughts on boundaries. ",
            "I would make an announcement when she is over and say, by the way. I don't want anyone going into our bedroom anymore including the kids bc I never know what I leave in there and I'd really just rather not have any akward situations If you need something well get it for you. Thanks all!",
            "> we're all adults\n\n> I've stuck my head under the covers\n\nYou're not handling it in an adult way. There's no need to even post this on Reddit. You don't like her coming in your room? Just tell her. It's that simple.",
            "My dad's cousin and her husband always did that with my parents' room whenever we had family parties (they were in their 60s), and it was the strangest thing. One time, though, I decided to hang out in there to get away from everything, they waltzed right on in, I said \"hi\" awkwardly, and they acted like \"oh gosh darn it whoa I've been abducted by aliens how the heck did I get in here.\" People are nosy AF, and your bedroom (I mean, your home in general, but ya know) is your bedroom, where you and your spouse get it on. Is she that interested in where her brother gets it on with his wife? (And the next time you catch her trying to go in there, you could ask her that-- possibly in cruder terms, lol-- to make her feel *really* weird about it!)",
            "As a non-confrontational person, I understand where you’re coming from.\n\n1. Get your husband to do it. It’s his family.\n\n2. If that’s not an option and you really don’t feel comfortable with a flat-out confrontation, cushion it a bit by putting emphasis on the fact that you realllllly value your private. Make it more of a “this is a me thing” than a “you don’t understand normal boundaries” thing. You’ll be letting her off the hook, but if you don’t mind that, I find this works well for me. You could say something like, “Hey SIL. This is a bit weird, but I’ve noticed you go into my bedroom a few times, and I really have a thing with my bedroom where I hate when people see it. It stressed me out having to worry about whether it’s tidy.”\n\nSorry you have to deal with this - good luck!",
            "I am nosy like this. She means no harm, but your husband should tell her politely to stay out of your room and he doesn’t need to give a reason either. SIL should be respectful enough to take it seriously.  Your husband also should have quietly mentioned to her as soon as she came over that you weren’t feeling well upstairs and to leave you be. ",
            "Put a lock on your door",
            "It is super awkward to talk about stuff. Bit you can prepare.\n\nStart thinking of a short phrase the conveys the message without emotion and then wait until she does it again. It's less awkward than bringing it up randomly.\n\nPractice the phrase so you remember it and know exactly what it is each time with variation. Next time you see her in your room, you are well rehearsed to just blurt out the message you know so well.\n\nSomething like, \"I'd prefer if you didn't wander into our room\" or \"we keep the door shut to keep everyone out\" as you shoo her out and shut the door behind her.\n\nThere is no way she could interpret that as anything other than you not wanting her in there,  but you also don't need to have a sit down talk to explain it all to her",
            "I would just plainly state \"Stop going into my bedroom.\"  There is no need for further explanation.  If she does it after that, have her brother say something.  If she does it again, I wouldn't let her come over to the house anymore and tell her it's because she clearly doesn't respect you or your boundaries.  ",
            "Put a deadbolt on your bedroom door and lock it with a key next time she visits. That should get the point across.",
            "I would definitely ask her “ Did you go into my room when I was sick?” If she denies , then I would make a huge deal about how “someone” opened the bedroom door without knocking first” and find out who did that. Doing so would be an absolute act of invasion of privacy due to what state you would be in inside. \n\nIf she she admits to, then you get to piggy back the humiliation you would have suffered had you been naked or having just vomited, along with she has absolutely no business in there. Add to that you’ve already stated how embarrassing an unkempt room is. \n\nThen you get to lay down 2 rules. If the door is closed, she is not to enter. If she must enter, then she is to knock on the door before entering. Now you’ll be able to keep an ear out for her entry. \n\nYou could also set up something to make noise when the door is opened, when you know she will be visiting. \n\nShe has stepped up her inappropriateness, now it’s time to step up yours. \n\nAlternately, you have the option to bring this up to your husband, her brother to deal with. Lay down the law that you don’t want her snooping, When it comes to family issues, he should take the lead. If there were issues with your husband and your siblings, you should be the person to deal with them. ",
            "hey we're family and we all do weird shit..... so wtf you kep coming into my bedroom when its closed?",
            "She's just browsing around for your hidden sex toys to see if you and her brother are kinkier than she is. :)",
            "Put a lock on your door or be an adult and tell her that you don't like people going into your room, so please stay out. If you don't say anything directly, how TF is she supposed to know. She is technically family and you making passing comments about not wanting others in your bedroom are not Obviously getting through to her ",
            "My doors have a lock on the inside and don't have a key, but there's a little hole in the knob that you can use to unlock it by inserting this little rod thing into it. We keep the rod thing hidden nearby.  \nIf you have something like this, or if yours can be opened with a screwdriver, I'd just leave it locked.  \nThen if she asks to go in your room, you get to ask her why and tell her no.",
            "The conversation doesnt have to be awkward. Healthy boundaries like not entering someones bedroom without permission, or for that matter any other room with a closed door in someone elses house is pretty standard polite behavior.  Is she nosy? Convinced you are cheating on her brother? A pill head? A thief? Passive-aggresive, jealous? Irrelevant. \n\nTell your husband - sis does this and it makes me uncomfortable. You going to tell her or make me do it, and back me up? Then to sis: hey I was laying down the other day and you came in my room without knocking. If I was in there naked or having sex with your brother that would have been awkward. When I was growing up a closed door in somone's house meant the room was meant to be private. Can we agree that if I close a door to my bedroom that means I am looking for privacy? Haha no one needs an eyeful of this without warning haha. Then she has been put on notice nicely.\n\nComedian Sebatian Manuscalo does a bit that is on point about this, about how some of his wifes friends are too comfortable and how he would never just walk into someones master bedroom. (scurries over & makes like he is testing the mattress)' So this where you guys f***? ' Google it, you are normal for feeling like she isnt respecting boundaries.",
            "Just be honest and say your bedroom is off limits unless she ask and has a pacific reason.  Honesty is the best!!",
            "Your husband needs to say, “Please stop entering our bedroom. We are adults who deserve some privacy. We do not want you in there, uninvited. The only place you should be upstairs is the restroom if you need to use it .”",
            "Yo y’all are harsh. She probably doesn’t mean anything by it. Just be straight up and let her know that you don’t want her doing that. It’s not that deep.",
            "My cousin is like this. We got a lock for the bedroom door. No more issues.",
            "Have a conversation with her kids in front of her about why adults need their privacy to be respected.\n\nThis way, if her kids understand, she can't say that she didn't later on and it also reduces their uninvited banging on your door for attention.",
            "Lol you don’t need to go to reddit for this. Tell her buzz off",
            "Why say anything at all, when you can just lock the door? Then she will make a fool of herself trying to get in and you don't have to confront her at all.",
            "You could always be sneaky and draw a sign saying \"If you can see this, you're in the wrong place. Please go back downstairs\" and put it on your bedroom floor.\n\nIf she gets annoyed about it, it just proves she was in there",
            "She is your husband’s sister. Make HIM tell her to stop invading your privacy. Your house, your rules!",
            "Get one of those door alarms that looks kind of like a door stop and put inside the room behind the door just far enough away so you can get out, but if she swings the door open a loud, piercing alarm will sound.  Hopefully that will give her the reminder she needs to keep out!",
            "A lock on your door would be an easy solution and would require zero confrontation ",
            "It’s definitely a sibling thing. She probably sees it as her brother’s room, not yours. Or she maybe feels close enough to you that she’s not cautious of those boundaries. My siblings and I are all very close with each other and our in-laws, so it’s really a matter of “speak up if you have an issue”. \n\nShe probably doesn’t mean any harm. You guys are family. Just tell her if you’re feeling uncomfortable. ",
            "Are you sure she's not taking anything from your room? Those seem like pretty obvious lies to me. Paint color? Come on.",
            "I would raise it directly as she doesn't have a leg to stand on with this one. I do think there is a chance it might be something innocent though, like liking the view.",
            "Swap the knob for one with a lock and call it a day. If a locked door doesnt send the message, stop inviting her round. \n\nYour bedroom is private space unless stated otherwise. ",
            "That is is bizarre. I'd ask to her to stop.",
            "My sister had an older stepchild that was malicious. She feared the kid would let her cats out while she was at work. I advised my sister to get a deadbolt lock for one of her spare rooms and lock the cats up when she left the house. Sure enough, when she returned home from work, the kid asked why the room was locked. ",
            "If you know she is coming over put a lock on your door and lock it.  If she questions it say you don’t feel comfortable with having people go in your bedroom.\n\nYou could start this with “at the risk of sounding like a jerk please don’t go in our bedroom anymore.  It makes me uncomfortable as that is a private room”.  If she persists, lock, and tell her it’s because she doesn’t respect your boundaries.\n\nEditing to add that if she persists after being told to stop, or raises a stink at the lock, than you have bigger problems here. ",
            "I’ve never even seen or been in the bedrooms of my closest friends and family, ever.  This is weird.\n\nAlso this is a stretch, but does she have any drug issues?  My cousin would sneak into my grandmas bedroom when she wasn’t looking to steal her pain meds several years ago.",
            "Leave huge dildos out everywhere. The bigger, the better! \n\nKinda kidding. Follow her next time, and literally just ask her to stop, because your bedroom is private. If she keeps it up, you have a bigger problem on your hands, but I bet once you clearly state that she isn't allowed in, she will stop.",
            "I know exactly how you feel. I had this problem with my ex-sister-in-law. To her, boundaries were nonexistent. She was forever in our room for no reason. I was tired of her leaving her stuff in there when she would come over to. It's like this is not your house, not your room. I don't care if it is your brother's room, you are overstepping your boundaries and you don't need to be leaving your shit in our room. End of story.",
            "Fuck that that's so annoying. See if it was me I'd just be a lil weirdo about it and put a lock on my door and lock it when I'm in there, even ignore it if someone knocks or calls your name. Eventually the message that you don't go in their will be received. She may think you're a bit weird/rude or whatever but it might be worth it for the peace , ha",
            "First off. You're not accusing her, you're being a bit too nice. I know how you feel because she's doing shit that a nosey mother does. You KNOW she's doing it and she knows she's doing it. Accusing is calling someone out on something you THINK they did. You KNOW she's doing it. Just tell her you noticed her going in your room (regardless of the reason) and you don't like it. Tell her unless she asks BEFORE she goes in and tells you the exact reason she wants to go in there, you don't want to allow her access to your room. If she continues to do it then get a lock on your door that you can keep locked with a key so you can lock it from the inside and on the outside when you're not home. If you think 'oh I can't do that because other people's things are in there or you use it for a laundry disposite.' then thats a simple fix of just better organization. You deserve to have a room of your own that's not full of junk and privacy invaders. You're already half way there. Just like you said, you're all adults, she shouldn't been doing what she's doing and it's ok that you're upset about it. ",
            "Deadbolt. How do you not already have a lock on your door?\n\nThose kids could walk in on you having sex.\n\nBe responsible for your own privacy.  Be an adult about it.\n\n",
            "Get a lock for your door. X",
            "This is like an episode of a really stupid tv show where the characters get in all sorts of wacky problems because they won't COMMUNICATE LIKE NORMAL HUMANS.",
            "If you don't want to communicate directly with her and ask her to stop then you might want to consider installing a lock.",
            "My sister in law does this.  Same excuses too.  We haven’t addressed it but will likely have to take some advice in this thread.  Reading it my first thought was lock it up.  But yeah, probably needs to just say “please don’t go in our bedroom”",
            "If you feel too embarrassed to talk to her about it, put a lock on your door. It can be a keypad one, or I know someone who has one that’s a fingerprint. If you want to keep her out for good cause some people don’t listen just make it impossible to get in",
            "If you don’t wanna talk get a lock.\n\nIf you do then tell your brother to sort this out.\n“Hey bro, tell your wife to stop entering my room.” And make sure he understands it and not hahaha lol bro.",
            "You could get a lock if you really don’t want to talk about it.",
            "Can your husband, her brother say something to her? Does it bother him too? Since it’s his sibling, I would have him talk to her.",
            "Does SO know she's doing it? He needs to outright just tell her to stop. If you both really hate confrontation that much then replace the door handle with a lockable one and lock it when she's over.",
            "I read the title and was like “Well folks, I think that’s what a lock is supposed to do.” Unless she is a professional lockpicker or have an axe, this will 100% totally for sure make her stop. ",
            "Set up some chains and whips over the bed. Scare tactics for sure 🤣",
            "Is she on the spectrum? ",
            "A lock would send the message but I'd install one of those little stick on alarms that squeals when you open the door. Loud and everyone would know she had opened a door she had no business opening.",
            "Some people have no notion of boundaries or even worse think everything is theirs. Fuck those people, and please tell her to stay the fuck out of your room. (Actually don't allow her in the house at all.)",
            "I could have written something like this. My FSIL keeps walking into our bedroom (with the door closed) to use our bathroom. We have a guest bathroom that’s easier to access and bigger. \n\nI told my MIL it annoyed me and i think she said something because last time she was here she used the guest bathroom. It was either that or the large box i placed in front of the door. \n\nJust say (or have your husband say) “hey, can you stop going into my bedroom?” That’s my plan for if she does it again. Or depending on my mood, “what are you doing?”",
            "You should tell your husband. It'll be easier for him to tell her than you. You're probably feeling awkward about it and you're afraid as coming across as rude. I bet your brother won't have that same reservation. Make your husband do it.",
            "No. You're legitimately correct,  she should not. This is your home and she should respect that. I would put a lock on it and if she asks just say well people kept coming in and it is mine and my partners private space.",
            "My brother used to do this but with my office because that's where I kept my weed and I think he was always hoping something was laying out either to initiate smoking or else he was stealing it? Anyway I quit smoking and he doesn't do it anymore, funnily enough. I don't think this is your problem, though...but maybe she wants to steal yo shit?",
            "Have you actually said anything to her about it?   Being oblivious to an obvious boundary is one level of not okay, but it's worse if you've asked her not to and she continues.\n\nI have family for Thanksgiving every year.  I have two bathrooms besides the master bath in my bedroom.  I say to everyone (20pp or so) where they are and I say \"please stay out of my bedroom\".  Invariably I find that someone has used the master bath.   Annoying.\n\nThis year I think I'll arm the bedroom motion sensor for the alarm.",
            "You should just tell her straight up that you like to keep that space private, restate that you like having her around but your room is a “me zone” or however you want to phrase it lol. This story also sounds like one of Jerry Seinfeld’s rants ",
            "If you leave your light on all the time, she might just be going in to turn it off. That’s what I do when I go into my BIL room. He always forgets and it’s a pet peeve of mine to have lights on when nobody is in the room. ",
            "I have nephews and nieces who are admittedly a little young (3, 4, 6, 8 yo) but incredibly bratty and they have not been taught respect for others' privacy. When I was over with my young babies and trying to get them to sleep in a dark spare room, they would throw open the door (causing it to slam against the wall) and proceed to come in to play (screaming or in general just noisy). I was really annoyed but resorted to locking the door (with full permission of the owner of course). Seeing as this is your house, and if you are as non confrontational as I am, I would suggest locking your door, and delight as you hear them on the other side trying fruitlessly to open it.",
            "Imo, bedrooms are off limits unless you're invited in by the bedroom owner... And I would have to say that there is no such thing as a forever-invite, either. The invitation would expire as soon as the visit is over. ",
            "Put a lock on the door and make sure it’s locked whenever she’s there. If she’s dumb enough to bring it up, let her know boundaries are important. ",
            "What's the deal with going in my room ?\nOk well it's not something I'm happy with can we just agree that if there's something you want to see just ask be prepared sometimes I may decline for whatever reason .",
            "Just tell her to please stop going into your room. No other way to put it. It's your home and if she gets offended because you told her to stop going into your private rooms, then she's way out of line and has little respect for you, and that's not on you. \n\n&#x200B;\n\nIf telling her to stop going in your room doesn't work, tell her she cannot come into your home until she stops doing it.",
            "Do you have an old camcorder or smartphone laying around?  I would rig up a hidden camera just to see wtf shes up to.",
            "Leave sex toys out for her to see! If she is like my sister, she will never go upstairs again.",
            "Buy a lock for your door and use it.  Either get one with a real key in the knob (an “entry door knob”) or one that uses an electronic code so you don’t need a key. \n\nIf you don’t want to do that then put a motion detector in the room that sounds a loud alarm if the door is opened and the alarm isn’t promptly turned off.  \n\nOr put a sign on the door that says   “[Karen], please do not enter and leave door closed”",
            "Lock the door. And depending on how petty you are put a sign on the door when people come that says no guests",
            "Oh my god, I have a friend who does stuff like this and I think it's a compulsion almost. She asked me one day what the air freshener was in mine and my fiancés bedroom and I was like 'What?' She'd been at ours a few days before and went to the toilet which is next to the bedroom a few times, and the bedroom door is always closed. It was only after that I started to notice that when she goes to people's houses she takes off and wonders around opening doors, looking in rooms and opening cupboards and stuff. I think it is a bad habit that has been formed by nosiness - maybe even when she was a child, but I don't think she's always completely aware that it's inappropriate or that she's even doing it completely conciously. She has a touch of anxiety too and I sometimes wonder if she's maybe doing it so she knows where everyone is and what they're doing, but I don't think she'd open drawers and the fridge and cupboards if that was the case.\n\nI think this is just one of those awful habits some people have that no one has ever felt comfortable calling them out on because they're adults and we expect them to know how to behave, so the thought of bringing it up is embarrassing. ",
            "Please don't go in there anymore, it makes me feel weird and uncomfortable\n\nDone",
            "Huh, it's interesting. I have a sister, I'm 28, she's 27, and I can't imagine saying she can't come in my bedroom or whatever - though we are both girls. I feel like since it's her brother you have in common, it's a little easier to say t stay away. ",
            "If you don't want to bother with bringing it up -- I'd suggest just installing a lock and locking the door.",
            "It’s called a lock.  I suggest you put one on your bedroom door.  ",
            "I'm a big fan of open communication, but sometimes you just need to lock the door. \n\n\n\n\nIf you have kids then you should have a lock on your bedroom door so that kids don't interrupt sexy fun times. It's also good for when you have parties and don't want randos all up in your stuff. Or in your case, a weird SIL who has no sense of propriety. ",
            "If your floors are made of hardwood, spray the fuck out of them with pledge or Pam. My brother did this to me. I totally biffed it. ",
            "how about hanging a sign to the doorknob saying \"Do Not Disturb\"?",
            "Wire your door handle to zap anyone who tries to open your door without wearing rubber gloves.  Oh, and maybe buy rubber gloves.",
            "Hi, tell her you would like her to stop coming into your room.\n\n&#x200B;\n\nThat's all you ever needed to do. edit or even tell your husband ",
            "You say, \"hey why are you coming into our bedroom all the time, we are adults and it's weird.\" Just like that your problem will be solved.",
            "Just talk to her nicely, it goes a long way to solve the problem even though it's really scary to do. I remember my cousin was staying at my grandma's for a while and he would play battlefront 2 on the TV and all of the explosion s and things dieing would freak her out, but she never told him so she just freaks out when he tries to visit her and he had no idea why until another family member talked to him. The lack of communication caused this whole other issue.",
            "I would suggest a lock for your bedroom door and when she's over keep your bedroom locked. Not while the cat is in there of course. Seems to be the only way to stop her from entering your room if verbally telling her hasn't worked.",
            "Buy a door lock with a key and use it",
            "Spouses need to be the one to deal with their own family members' issues. Your husband needs to tell his sister to stop entering your bedroom. No \"please.\" It's not a request and it's not optional.\n\n\"Hey sis, stop entering our bedroom. It's rude and a violation of our privacy.\"",
            "She sounds like she's a nosy busy body, you need to bring it up and explain you deserve and need your privacy \n\nThis isn't fair at all and I would be equally as angry if I was you. ",
            "She is doing it BECAUSE it is a boundary",
            "How strange. Maybe just casually mentioning it would embarrass her and she would stop. Some people are just so nosey! ",
            "Why is family so fucking weird sometimes?? I couldn’t help but laugh at the strangeness of this. ",
            "Is there any chance there is something, like a piece of family jewelry, that she may kind of covet and wants to see to remind herself that it should be hers?  Or does she seem the type that would get a sense of satisfaction and superiority from seeing that your room is messier than hers? ",
            "My mother in law does this too.  I don’t have a solution.  I hate it as well and want to commiserate.  ",
            "Punch her in the vagina ",
            "Some people are just nosy. Tell her your bedroom is off-limits.",
            "I think a home alone prank should be set up for her. Next time she is over a bunch of flour gets dumped on her head (or something else easy to vacuum, no need to totally torture yourself too).  Put a big old sign saying “it is rude to snoop”. \nThis is about the level of maturity I think she will understand. ",
            "You hit her in the nose. Hard. ",
            "That’s not dumb at all. She’s violating your boundaries and privacy.\n",
            "Thumbtacks all over the floor. Razorblades taped to the door handle. Switch her milk out for heavy cream.",
            "Oh man I do this to my parents :(",
            "I moved in with my boyfriend and my mom still goes through my fridge every time she comes over. She does that to make sure I haven't lied to her when I tell her I have enough food to eat, and also so she could pick on me whenever I don't clean the fridge. 😁 I don't mind, actually I find it funny. But if I didn't like what she did, I would just tell her to stop. ",
            "I misread this as 'always goes into my bathroom for no reason' and i got excited and read the whole entire post and was confused by the lack of bathroom until i reread it. Honestly at the start I thought it was like she was some sort of toilet/bathroom addict and just came to your house randomly throughout the day to get her bathroom fix.",
            "First, get a scary poster that reads \"get out\" In kinder words.  Second, make a trap esp for her, so when she enters the room, there's proof and she has got explaining to do to the rest of the family. \nThird, be subtly rude to her. Fourth, wait for a few months, if she doesn't improve.. Talk to your partner to talk to her.",
            "Waiting for an update. ",
            "Can't you just mention it to her? This should be the first thing you do.",
            "Just be direct with her.  Maybe when she grew up, it's normal for her to walk in on other people's bedrooms. ",
            "I am doing the same with my brothers room, if that helps. Kinda feels like my room too... although I know it is his room.",
            "Im finding it hard to see this as a real world problem, so im just gonna say, put a lock on it. ",
            "Stage a murder scene and drop hints the next time she's there that she should avoid that room, that it's really not a good day to see it. ",
            "Sounds like she looking for loose cash to grab.",
            "I hate conversations like this with adults, I'd put a lock on the door and lock it when she comes over. \n\nLike others have said, and I realize it may not be the case, but often people who do this are looking for pills/drugs or cash.",
            "Put a sign on the door at eye level saying \"authorized personnel only.\" It might be weird for a bedroom, but it's a common enough sign it should make her think twice before opening the door.\n\nAnd you really do need to speak to her directly and clearly tell her your boundary. She clearly doesn't understand that it is a boundary for you, or else doesn't care, because people have different boundaries. It doesn't have to be weird or confrontational, but it should be clear.\n\n\"Our bedroom is our private space and we like to keep it just for the two of us. Please let me know if there's something you think might be in there that you'd like me to get.\"\n\nIf she doesn't respect that, absolutely put a lock on your door to enforce your boundary when you're not looking. Remember, _she's_ the one out of line here for snooping, looking for stuff to take, or whatever she's doing in there. You are _not_ out of line for stating and enforcing your boundary.",
            "Super weird. Also super weird that you tolerate it. Your husband needs to set **boundaries** with his family. ",
            "I think this is the perfect utilization of a text. Just do the quick \"Hey, would you mind not going into our bedroom in the future, I want to keep it as a private space.\"\n\n&#x200B;\n\nWtf is she going to say to that?",
            "In some families, it isn’t weird to wander into other bedrooms. My family was definitely like this, and I went into my parents’ room whenever I wanted. They did the same with mine. I did this once at my husband’s parents’ house (to get their cat who was cuddled on the bed), and I instantly realized it was a weird thing for them. Learned my lesson super quick and never did it again. Also noted to myself that the lack of privacy rights my parents promoted in my childhood was possibly not normal. It might just take a heart-to-heart conversation with her to explain it’s a private space.",
            "Tell her that you find it uncomfortable that she goes in your bedroom but if you don't want the awkwardness then Put a lock on the door.\n\nOnly lock it when she's there; She will get the message.",
            "Get a bedroom door lock with a key.",
            "Put a lock on your door"
        ]
    }
]