[
    {
        "post_id": "4lko2j",
        "author": "Shercsa",
        "title": "(Update) Both our parents [50s] have abandoned my [21M] sister [11F]. How do I give her peace of mind that I won't abandon her?",
        "url": "https://www.reddit.com/r/relationships/comments/4lko2j/update_both_our_parents_50s_have_abandoned_my_21m/",
        "score": 4214,
        "num_comments": 247,
        "created_utc": 1464533154.0,
        "selftext": "Thank you all. My OP from two weeks ago: https://www.reddit.com/r/relationships/comments/4j12or/both_our_parents_50s_have_abandoned_my_21m_sister/\n\nSo besides reassuring her verbally continuously, making sure we do a lot of things together and being a good brother, I needed to get her into therapy and I found the right therapist for her. She's a psychologist who specializes in children's issues after divorce.\n\nThe only problem was money. I called both my parents and told them that I need to talk to them (separately) and told them that we need more money as she needs to get therapy and I want to do nice things for her and that's the least they owe us after everything. They were hesitant but eventually agreed. I'm now getting $500 more each month from my mother and $750 more from father and that is a real help. When we have extra money from what my parents give us I put it in a college fund for her and this extra money means that not only she can see a great therapist but now I can save more for her.\n\nI also talked to a lawyer as a lot of you suggested to make sure we're getting the right amount of money and it seems that we do. Of course we could go on and get them to court and make everything happen through the legal system but that has the risk of them choosing to end my guardianship and get my sister back which is not the right thing for her. She's much safer and better off here than in their hands. Obviously the option is on the table if they decide to stop paying or reduce the amount.\n\nAnd a couple of you suggested we do something symbolic which I liked a lot. So I bought two matching necklaces and had them engrave our names on them and told my sister that we're doing to wear these to remind ourselves that each of us will always be there for the other and we can count on each other.\n\nWe've already been to two sessions of therapy and I think things are good. The necklace has worked and she doesn't even want to take it off when she takes a shower.\n   \n**tl;dr**: I got her into therapy and got parents to pay for it. We're doing fun things together more often and we bought matching necklace with our names engraved to remind ourselves that we'll always be there for each other.",
        "permalink": "/r/relationships/comments/4lko2j/update_both_our_parents_50s_have_abandoned_my_21m/",
        "comments": [
            "I missed your original post, but man, I have to say: your parents are the worst. The absolute, motherfucking worst.\n\nYou, however, are a sterling human being, and don't let anyone ever tell you otherwise.",
            "As a former ward: make future plans with her. Like community events, concerts, trips, zoo, etc. The college fund is indicative of a stable future for her and that must mean a lot to her. But some short term things are cool too. Like tickets to see a movie or etc, or discuss when a new one is coming out and how it'd be cool to go see it together. Or, video games and release dates for DVDs. \nGet a big calendar and write your plans on it. \nThis kind of stuff is small but powerful. Doesn't mean just that you won't bail on her but also that you're sticking around because you *want* to and that you do like hanging with her, (not just taking her in out of a sense of obligation.)\nKids always know more of what's going on than adults give them credit for. Be straight with her, always. \nBest of luck to you guys!🙂",
            "you are a great brother/parent <3",
            "You know I can understand if you just flat out can't be a parent and just need to disengage. I don't like it, but I get it. But when you just ditch your family so you can start a new family? Trade in your old kids for new ones? I treated my Mass Effect save file with more respect than that! Your parents need to be marched naked through the town, carry large signs saying what they've done while being whipped.\n\nYou're a great guy, keep looking out for you sister. It's better than to have one person who cares for you than a huge bio-clan who are neglectful and abusive.\n\n>but that has the risk of them choosing to end my guardianship and get my sister back which is not the right thing for her\n\nNot a lawyer but when she is older but a) her testimony saying she wishes to stay with you and b) Their total abandonment for years should protect you from that.\n\nStill, family courts in the USA are a total shit-show. I've seen cases where they leave the kids with abusers or take them away from the caring parents to go live with the abusers. CPS minimum standards for care would be too low for prison. Better to be avoided.",
            "Op, you're a much better parent to her than they ever were. \n\n\nYou're an incredibly mature, sensible, intelligent man, and at such a young age! When your sister is older, she'll realize the true extent of how much you love her. Maybe look into some therapy for yourself too?\n\nKeep on being you. Never change. ",
            "OP, I want you to know how much your post touched me. I am in tears-and I rarely cry.\n\nYou are not only a great sibling and guardian to your sister, you are a wonderful human being. Our world is better because you are in it.\n\nThank you for being a person that does the right thing. Thank you for advocating for your sister. Your love and care for each other is how you will both heal.\n\nPlease remember to take care of your needs, too. You are young with a great deal of responsibility and also coping with shitty parents. You deserve to heal, too.",
            "Brother or not, you are her parent at this point. She only a child and she needs you. I'm glad you've got her in therapy. Just keep doing what you're doing and keep her away from her biologicals. They are complete shitheads.",
            "You're doing good!\n\nAnd the necklace thing is also so cute :). It reminds me when I got a necklace for a little family friend of mine for similar reasons, these things make my heart melt.\n",
            "Do you have a female (not necessarily romantic) in your life your sister might be able to talk to for female issues? I would suggest that.\n\nThe other thing is I would suggest you always be reliable for her. If you say you are going to do something you always do it. Consistency is what will help deal.",
            ">And a couple of you suggested we do something symbolic which I liked a lot. So I bought two matching necklaces and had them engrave our names on them and told my sister that we're doing to wear these to remind ourselves that each of us will always be there for the other and we can count on each other.\n\nAnd now I'm crying at work. You're an amazing brother, OP.\n",
            "God I wish there were more people in the world like you. You are a stellar human being for stepping up like this. Despite everything she's been through, your sister is a lucky girl. I would love it if you could update us every once in awhile to let us know how you're doing. ",
            "Consistency. Be on time. Have an explanation when not. Be honest; don't sugar coat but don't complain. \n\nAlso, for you, make sure you have your own self esteem. Know your worth. You are worth what you do. Every day be an average good quality human bean.",
            "OP I remember your original post and I am so happy to see this update. You truly are an amazing individual and a compassionate human being. Your parents are clearly not the best people - but you have been doing everything right for your sister so far. Please focus on yourself too, try to have as much fun as you can while you are young. You already have so many more responsibilities then other people of your age. Try to live your life as much as you can - even if it's just getting a sitter for your sister twice a month so you can  go out with friends. You are a fantastic brother and I'm really proud of you for being this strong and capable. Hugs from an Internet friend.",
            "Hey, man. I'm 28 and have a younger sister. She's 22.\n\nWhile we are lucky to have good parents, I still wanna say that you are a great brother and a parent to your sister. \n\nI don't know if you'll have kids, but if you do, they're lucky as hell. \n\nPlease don't take this the wrong way, but I am envious of your relationship with your sister. \n\nI have a good relationship with mine. I still drive her around and she's 22 (to work and stuff). She doesn't take advantage of me, but I feel she takes me for granted. I wish she would hang out with me more. Not every weekend, but certain events like birthdays and stuff. ",
            "You are an amazing brother dude. Respect to you for handling everything amazingly. Don't worry man, your sis will be fine, your positive efforts outshine your parents negative actions any day.",
            "This made me tear up. You are an amazing brother, and she is so lucky to have you. I'm so sorry about your parents - I know that it must not only hurt your sister, but you as well. You both deserve so much more. Continue being a wonderful example of a human being - wishing you all the best. <3",
            "Thanks, OP, for being an amazing person.",
            "You good sir, are the first person on reddit to make me cry. You are absolutely amazing!",
            "Your original post was so sad, but I'm glad you were able to work things out to get your sister the help she needs. You're a terrific brother and human being. I wish you both all the best.",
            "Did you go to college?  What's your income situation?  You are a single parent, does the $ you get from both parents support you both?",
            "You are awesome. The best kind of person. You've done a lot more good in your 21 years than I've ever done with my 36 years on this planet. I wish you both all the best! ",
            "I said this on your first post and I'll say it again, you're a true champion sir. Wish I was 10% of the man you are and you're 5 years younger than me. You're saving this girls life man. Giving her something (more like everything) your deadbeat parents can't give. Keep being a boss for your sister. ",
            "Shit, you're 21? Your responsibility and attitude makes you really attractive ;) Go OP!\n\nThank you for taking care of your little one. It will mean so much to her how much you did for her when she grows up.",
            "Mind you op - they WILL want to get her back one day. And if you allow for this to happen, they very well may abandon her again, which will crush her. Do not let that happen. I am not sure how to avoid this legally or any other way around this, but don't let that happen. \n\nAlso, you're great. I'm your fan. ",
            "You are a wonderful person.",
            "So happy to read this update. You are so inspiring!",
            "Just saw this and missed your first post... Dude, Your Parents SUCK... I mean, what kind of person just abandons their daughter like that... all so they can have a new family??",
            "Holy shit dude, your parents are seriously terrible, But seriously we need more people like YOU in this world. So many could dump their sister into the foster system and live their lives. Especially after coming out of a situation like yours. Seriously kudos for being the bigger human being in your situation and I hope the best for you and your sister.",
            "I read the original post, but I'm still lost as to how this situation even came in to being.  In what world does a parent pawn off their youngest kid to their oldest kid?  Where were they living before he turned 18?  How did they even transfer custody?  What family judge saw that situation and didn't go WTF?",
            "You are doing everything right. You and your sister deserve all the happiness in the world.    \nAlso many people are mentioning that she could use a female figure to help her through some things. My suggestion is talking to a woman guidance counselor or maybe find a Big Sister program.  ",
            "OP, you're literally the best.\n\nYour sister is lucky she has you.\n\nGood job, bro.",
            "So glad to hear you and she are doing better. You're seriously an amazing brother. She's lucky to have you.",
            "You are an awesome dude and get massive respect from me for stepping up and doing the right thing. ",
            "I can't even comprehend what has been done to you and your sister. I would leave a limb behind before one of my kids. You are doing such a great job and doing all the right things. I'm so proud of you. ",
            "Mann, even your sister has the worst shitheads parents, she's still the most luckiest girl when she can have the most wonderful brother like you. Keep doing your best to make you and your sister happy. ",
            "It warms my heart to see that you and your sister care so deeply for one another. Thank you for the update OP. I'm gonna hug my little sister as soon as I get home today.",
            "You're a great dad/brother, OP. Knowing people like you exist in this world gives me hope. Thanks for sharing your story, even if it was to just ask advice, it means so much more than that to hear about different styles of family and parenting. You're a good guy and we need more folks like you in this world. ",
            "You are an amazing brother and I really admire the care you are providing your sister. Please disregard this if it's out of line (or someone else suggested it), but I was wondering if you could set up your \"parent's\" payments for your sister's care on a direct deposit  or bank transfer or something. That way you don't have to waste time or energy seeing them.",
            "I hope you are getting some therapy too.  At some point you will likely feel the mental strain being a single parent.  Especially as she moves into her teen years. Make sure to take care of you too, its part of taking care of her.",
            "Wow. You are an amazing brother. Tell your sister she is an amazing kid for me. This is the most heart breaking thing I have ever read. It's one thing for one parent to kinda just do that, but both? And so severely too! How do you just forget about your own flesh and blood like that. \n\nWhere they like this with you as well growing up? I just can't even begin to guess what is wrong with your parents to be like this. Are they otherwise normal people?\n\nJust keep being awesome and make that college fund grow. With therapy and time things will get better. But i think it's important to just cut off contact with your parents and sister permanently. therapy would be good for both of you together as well. Especially as she gets older. As a brother stepping in and being a brother/now parent it's a difficult transition even just emotionally. And when she hits puberty that could open a whole new can of worms if she's not well adjusted by then. Therapy all the way. \n\nAt least your getting decent monetary support to give her the best life you can. \nUgh.\n*hugs*",
            "You are so amazing. You are such a caring and loving brother, and I applaud you that you're there for your sister. Great job :)",
            "I wish I was as kind and caring of a human being as you are",
            "I am so so sorry for what your sisters gone through. I can't imagine what kind of parents could treat anyone the way yours have treated her. She deserves better than that.\n\nOn that note, you are a stellar human being. Go you for being supportive, caring and for taking up a cause you didn't have to at such a young age. Your sister is lucky to have you.",
            "This update had me in tears! My cousin (16) came from a broken home and I recently have taken him in as well (I'm 25). You have done such an amazing thing for your sister, it warms my heart to see there are people like you out there. Even handling a 16 year old has been tough on me, but atleast we are able to talk in a way that I can assure him that he's not a bad kid and I won't ever get rid of him. I know 11 can't be easy since she just doesn't understand why your parents are being such fucking dicks. You are an awesome person man, don't ever let anyone tell you otherwise. ",
            "Aaaaw, the onions!!! :3",
            "Your parents can go kick rocks, shatter their bones and then get their feet amputated. What a bunch of assholes. \n\nSecondly, OP you are a phenomenal person. Being a parent for your own kids at 18 is incredibly difficult. Having to take up that mantle now, especially during that period where you are in the process of becoming an adult is a downright heroic thing to do.\n\nBut that's where I worry. OP, what are you doing for yourself? Are you able to pursue an education? Do you have a social life? Doing everything you do for your sister is amazing, and you deserve the highest of high fives at all time for that. But you have to do things for yourself too. Your sister will grow up with guilt over that if you don't. And that's not anyone's fault but your parents' to be fair.\n\nI think you can both have a life and be there for your sister. I think it just requires some planning. Also, you may need therapy yourself after this, and I don't think anyone would blame you.",
            "What an awesome update. You're an awesome human being. Keep up the good work!",
            "You're an amazing person. Your sister is lucky to have you.",
            "You are an angel and I can only hope that my children care for one another the way you two care for each other.\nSomething I didn't really see in your previous post though and I'm just wondering if I missed it:\nWhat about you?  Are you going to college? Do you work? Do you have needs, wants and wishes for your life that are being met too?  Do you have any emotional support yourself? \n\n",
            " You are an admirable person and I wish you and your sister the best!  I believe she has the best care she could ever get in getting to live with a brother as wonderful as you!  Good job and good luck!\n\nSinceriously a mother of 2 boys who hopes they grow up to be like you.",
            "The *only good thing* your parents ever did is bringing **you** to this world. You are a truly wonderful person and must be very proud of yourself. We are proud of you! ",
            "You're a good person. ",
            "You are such a great person for stepping up and taking care of your sister, I'm glad you set up some therapy and arranged better financial help from your parents. Smart of you to separate them when asking to, I know you probably don't need it but thank you for helping raise her into a healthy and contributing member of society.",
            "It makes me happy to know that there are people like you in the world.",
            "Since she is only 11 I would say get her started in something school related that she can get a scholarship for. \n\nMaybe tennis or soccer? She could make friends, get a scholarship (push her towards STEM if she has interest) and you could bond by playing on the weekends.\n\nScholarship money will also help keep her out of debt in the future. She is young enough that this plan will work.",
            "I read your original post when it first came out. I also had suggested child support payments, more money of course, and that they should pay for therapy.\n\nI'm glad it worked out. I agree that if you can get what you need without court, that's fine. It still should be considered, though....sometimes with divorces, parents may be obligated to cover college costs. Just something to think about. But besides that,  glad it worked out for you. ",
            "Holy shit. Can you be my brother? I'm crying.",
            "God, you're a fucking amazing human being. It can't be easy to raise a little girl at 21. Good luck to both of you. I seriously wish you both happiness and success.",
            "I read your first post and cried because of how much your parents lack as parents but reading this post put tears of joy in my eyes. Good Luck, OP. She is so lucky to have you in her life <3 and hers in yours :)",
            "You are a very good person man. That is just so noble of you and shame on your parents but man you are a great guy.",
            "People like you remind me that even though I have zero faith in humanity, not everyone's a piece of shit. Keep on being awesome.",
            "Wishing you both the best <3",
            "Yes my friend. Just yes!!! I wish you two the very best, you are an amazing human being. ",
            "Just catching up on your story and want to say how great you are.  I have a genuine question about your parents because as a parent, I'm having such a hard time imagining this.  The way your parents have acted seems unthinkable. \n\nWhy have they abandoned her (and you, it seems)?  What kind of people are they?  How have they justified what they do?  What have they said?  I mean, I just can't imagine it and would like to learn from it.  ",
            "Gosh OP, you're incredible. I have so much respect for how mature and loving you are. You have an authentic and golden heart. ",
            "Your parents are scum man, sorry it had to be this way. You seem like a great guy and I hope you and your sister have a great future. I don't mean this is gonna happen to everyone but my uncle was abandoned by his parents when he was around 16 and through the rage and everything he's found so much success and has self made several companies and makes alot of money and is happily married. You still got everything ahead of you and I can tell it's nothing but greatness down the road. Best of luck OP",
            "Despite having a terrible upbringing, you turned out great, OP. I hope you and your sister have long happy lives.",
            "OP, this makes me so happy. Amazing work :)",
            "This story is so heartbreaking. These non parents should be in jail.",
            "You're amazing. Keep it up! :)",
            "Fucking hell. What awful parents.\n\nYou are an amazing human being. As a humanist, you reinforce my faith in humanity. Your sister is very lucky to have you.",
            "You are better than me. I would have put my parents on blast for abandoning a sibling like that. Glad things are working out for you two. I wish you both all the best.",
            "You're a good dude OP.",
            "OP, I just want to say thank you for being a good human. Your parents are terrible, but your sister is so lucky to have you. ",
            "I am glad you have in therapy now. Her teenage years will probably be very complicated. The best thing you can do is make certain she is not left at home alone while you work. Kids with an abusive past do not always fair too well when they have a lot of alone time on their hands. ",
            "You win the internet, OP! All the best to you and your sister. ",
            "I said it on your last post but fuck it, I'm saying it again! You are an awesome person. ",
            "Thank you for being a stand up brother.  I hope you both a beautiful future not burdened by your parents.  At least you know you don't need to take care of them when they get old, their new family can have that responsibility!",
            "I'm not sure if anyone has every told you, but we are all real proud of you. \n\nIt takes a lot to raise a kid on your own. I'm glad that you've stepped up, for both you and your sister. \n\nSo proud. ",
            "oh gawd reddit why must you make me cry ; ~ ; this is so sad but beautiful at the same time",
            "You're an...amazing brother. I want to hug you. My brother is near and dear to my heart. So, so happy for you.",
            "You are a beautiful person, and wish you and your sister all the best going forward. You guys are lucky to have one another, and being abandoned by your parents may have been the best thing for you both in the long term. Sending you happy thoughts!",
            "You are a amazing brother and human being. Unbelievably so.",
            "You're one of those people that restore my heart when I fear for humanity.  I'm so glad that you're making therapy for your sister a priority. I'd like to throw in that you should remember to take care of yourself too.  Every good parent figure strives to put their child (or sister) first... Just remember that to be your best for her, you need to be your best for you.  Find ways to take breaks, seek peer support, find a parenting group... And maybe (even if you don't feel an overwhelming need) consider therapy for yourself.  You deserve a strong foundation, just like you're providing for your sister.",
            "Dude you are a fucking all-star and your sister is truly lucky to have you. No real advice here just letting you know that you are killing it as a brother and to keep up the good work. This has been an inspirational story.",
            "You are an amazing sibling. ",
            "You should probably take your parents to court. This is psychological abuse.",
            "Wow.  Your parents are like the parents from Matilda.  Fucking despicable.  Good for you for stepping up and being an adult since they won't.  Your sister is lucky to have you.  I'm so glad this is working out for you both. ",
            "OP you are truly the most admirable of people. I'm really in awe of your benevolence. I think humanity can learn a lot from your example, including your parents (although it doesn't seem they ever will). Come back if you ever need more help, I think /r/relationships has a special place for you and your sister now.",
            "The best thing your parents ever did was give you guardianship of your sister. They are *horrible*, disgusting people who do not deserve to call someone so wonderful their son, and it seems like your sister is also a great kid in spite of what she's gone through.\n\nThose necklaces were a beautiful idea, a tangible symbol of your love and devotion to her. I cannot imagine the responsibility you've taken on at such a young age, and what's more, your main focus and concern is your sister. She is so freaking lucky to have you and I am so fucking happy to know that people like you exist. \n\nFrom the bottom of my heart, I hope you guys have all the luck and love in the world and that you are successful and happy for all the days to come. Good fucking job, man. I wish I could hug you!",
            "Lots of good feels in the replies to your post, OP.\n\nOne thing I haven't seen, though, is concern for how you are taking care of yourself in all of this.\n\nYou seem very rational and level-headed, but you've experienced the same abandonment your sister has.   Maybe you don't necessarily need a counselor (couldn't hurt to take a few sessions and see where it goes), but somewhere in there is a boy who has been dumped by his parents.   \n\nPerhaps there is some sort of support group out there for you...even a parenting group?  You're going to have to help your sister deal with the upcoming puberty and teen years, and your relationship is in between parent and sibling.  (I have a similar relationship with my siblings, but for totally different reasons.)\n\nYou need support too, and taking care of yourself will help you take care of your sister.\n\nBest of luck to both of you.",
            "Hey, this sounds great. I am so glad you are there for your sister. I was in a very similar situation and unfortunately, my older sister did not step up for me (even though she had been in the same situation herself at one time.) \n\nI do hope that you have an actual legal guardianship agreement, as in it is on paper somehow, at least notarized or agreed through a lawyer, that you are your sister's guardian and your parents are not. This is important. ",
            "People with abandonment issues don't respond well to verbal promises.   Tell her witb your behavior.  Good luck.",
            "As someone abandoned as a young person, you sound like exactly the type of person I'd have wanted to have at that time. Thank you for everything you do, you have no idea how much it means to your sister. ",
            "I hope you also consider therapy. Not because you're anything but mature and sensible, but because this shit is hard. Parenting is hard and it's really fucking hard when you're basically still growing up. I hope you consider some therapy with your sister or on your own at some point. God knows most people who have been through tough shit, especially regarding parents, (myself included) need it more than we reach out to get it. ",
            "I havent been able to go through all your replies, OP, but I wanted to make sure you heard this just in case it was missing: Make sure you take care of yourself too, man. You're going through something alot of people wouldn't be able to handle at even older ages than you are. You might also benefit from a therapist as well to deal with the shit theyve piled on you. Also, try making sure you get a night off to relax every two weeks or so. Every parent needs a break, and that's what you pretty much are at this point. Best of luck to you too. I have faith that you guys are going to be just fine. As for your parents, they are going to be much worse off in life. Even if it doesn't look like it right now, they are really going to get theirs. I'm not talking about spiritual karma or anything like that. I'm talking some obviously unresolved issues and mental health problems that they clearly have to abandon their own children. I'm not wishing this one them, it's just the plain facts.",
            "You are an incredible brother!  You have done so many things right.  My two suggestions are 1) create holiday traditions that you do every year, and 2) use something like Shutter fly to create a photo book of your good times together, and leave that book always out in the open (on a coffee table rather than in a bookcase).  It will help her later on when she is going through the emotional upheaval of puberty, as she'll have tangible proof of you two as a family. ",
            "From one older sibling to another, we're almost in the same boat and you're being magnificent. ",
            "This might attract more attention than you want, but us fellow redditors could totally reach out to Ellen DeGeneres to help get you more financial support...unless that would cause your parents to decrease the money they give you. I personally know people who have gotten on the show for hardship and received college funds from Ellen. ",
            "I want to dropkick your parents into a vat of acid.\n\nYou're cool though, keep up the good work.",
            "You OP are an awesome person! Your sister is gonna do well, and you deserve the utmost respect!",
            "She is very lucky to have you.",
            "Say, \"I won't.\" Back it up.",
            "You have no idea how much of a difference you're making man. Sure, anybody in your shoes might do the same thing, but there aren't many people in your shoes. Keep it up. You're a fantastic brother and you're handling this beautifully. ",
            "Make sure you have life insurance. You are a great human being, and nothing (I repeat: NOTHING) like your parents.  ",
            "You're a fantastic brother. Kudos.",
            "You are solid brother, take care of yourself too.",
            "You're amazing and I hope only terrible things happen to your shitty parents. I hope that isn't too harsh.",
            "Holy shit man... I've got a few things to say here:\n\nYou're fucking awesome.\n\nYour parents are the worst.\n\nMy heart is bleeding for you and your little sister, can I help in any way?\n\nHow do you manage? What do you do for a living?\n\nDo you have a social life at all?\n\nAre you taking care of yourself? That's a lot of responsibility to get loaded with.\n\n\nI guess I'm just naïve or ignorant or whatever, but I'm just floored by your story. You managed to both crush  remaining faith I had in humanity, and inspire hope as well.",
            "I just do not understand how your parents could do something so terrible. Just the thought of my daughter not feeling loved or wanted makes my heart break, my insides flip and my blood boil. Thank you for being you and for being there for your sister. You're a stellar human being.",
            "Wow, just wow. Words can't describe how much respect I have for you. You're an amazing person. ",
            "One suggestion would to have you there for every other therapy session.  Let her have some time with the therapist alone.  I said this in your previous post, but things are about to start changing for her so she might not want to being up women's issues in front of you - like periods and stuff.",
            ">And a couple of you suggested we do something symbolic which I liked a lot. So I bought two matching necklaces and had them engrave our names on them and told my sister that we're doing to wear these to remind ourselves that each of us will always be there for the other and we can count on each other.\n\nGod damn it, someone is slicing onions in here. ",
            "You're doing so great it breaks my heart man, and you weren't that much of an adult yourself when all this started - only in the legal sense. Be sure to take care of yourself as well. You were an abandoned child too, even if you are now a grown up. All the best for you both <3",
            "You are awesome really awesome. Good luck :)",
            "It amazes me that people like your parents can even find new families to assimilate into. Sociopaths, monsters -- no rage-influenced label really does them justice. I worked for several years with kids who often struggled to cope with ineffective parents, but through all those parents' faults, I could see that they generally loved their kids, and just couldn't handle the responsibilities of adulthood.  \n\nNot so long ago I would've suggested insidious ways for your parents' consolation families to stumble upon this thread, but I'm being honest in saying that it is probably best that they remain locked in their positions of inefficacy; their stepchildren will probably have difficulty attaching to them anyways if they are as cold as they sound, and they will continue to pay support for the children they never deserved until the day they die. They do not continue to send mixed messages, but a single simple one: you and your sister are far better people than they could ever wish to be, and there should be no room in your lives or time spent on such a miserable pair of souls.  \n\nI know you and your sister will continue to love and support each other; thank you for being a good brother. ",
            "You are an AWESOME brother and human being. Keep up the good work with her. :)",
            "Fuck your parents man, if I were you I would go fucking make sure every single person that they're associated with knows what they're doing. It's fucking bullshit",
            "I want to be you when I grow up.",
            "Awwwww dude. That's awesome.",
            "What a role model you're going to be for her. Be proud, stay humble OP.",
            "Thank God she has you in her life, and that you are an awesome person. I know you have needs also, and your own issues but it's amazing how you put her first. You made my day a lot easier knowing there is still humanity, we as a society can still believe there is a way to go through life. I know for a fact that life needs only one person to make a change! Today it's you! Remember that you don't only inspire your sister, you inspire a lot of strangers too!",
            "Op, you are awesome, and I hope your sister appreciates this. Not a lot of older siblings can and are willing to support their younger siblings like this. ",
            "Wait, so you aren't actually her legal guardian right now, you're just long-term-subsidized-babysitting? If so, you need to have another meeting with the lawyer. ",
            "You're a good person. ",
            "You are absolutely amazing. I wish you all the best in your life. You really are an incredible human being!!!",
            "I just want to congratulate you for the amazing human being you are. Best of luck for you two :) ",
            "Just joining in on the \"My God, what an incredible person you are,\" and \"My God, what the fuck is wrong with your parents?\" trains. Best of luck to you and your sister. She's in good hands.",
            "I applaud you for noticing something had to be done and not just saying, \"eh, kids are resilient, she'll be fine.\" You're a good person.",
            "I know this is late and everything but I'm going to assume the situation hasnt changed much.\n\nThis is a super generalised suggestion but when she's getting these thoughts that you might abandon her like your parents, try to frame things so that you aren't acting as her parent but her brother that was abandoned just like her. Just small things like 'we won't leave each other' rather than 'I won't leave you', talking about being partners helping each other. It's a weird position to be in because you obviously have to act very 'parenty' sometimes but just when she's having a harder time, partner in crime is probably better than parent when the two people that personify the idea of parents left her.",
            "Okay seriously, after I got to the necklaces I couldn't read through my crocodile tears. ",
            "Stupid question: Is the necklace made of waterproof material?\n\n\n\nI kinda did the same thing with a necklace when i was younger. It broke.",
            "You are an amazing young man. My heart hurts for you both, but sometimes we just end up w shitty  parental units. Thank you for the update, I'm so glad your birth humans, stepped up at least monetarily. I'm thankful that we don't know how to track them down, I'm not a violent person, but your birth humans would not be safe within proximity to me. ",
            "You sir are an amazing individual.  You have taken on more responsibility than men twice your age.\n\nI hope you think of yourself as a man, cuz if nobody has ever told you you are, then let me say you are.\n\n*tips hat*  Good job sir.",
            "I bet the people your parents married are real pieces of shit too.  I could never marry someone who just abandoned kids from a previous marriage like that.  They all sound like real pieces of work. ",
            "My brother (27) just passed last week. And I came to this subreddit to help me cope. Its hard because we were 18months a part, as he was my best friend.\nAs I continue thinking of things to say at his service Friday. Common thoughts are he was selfless, protective and my role model, as I looked up to him always.\n I cannot believe your parents put you in that situation. \nWhen your sister grows up and realizes the things you sacrificed for her. It will be something she will think about always and forever. You truly set the bar for siblings everywhere. \nKeep your head up and continue to love your sister. The bond you two will have later in life will be spectacular!\n\nYou're a great sister and you need to remember that.",
            "You are an inspiration for me.",
            "The fact that your sister doesn't want to take the necklace off even in the shower should be a glowing testament to how immensely powerful that gesture was. Sounds like it will have to rust off her neck before she lets it go. Slam freakin' DUNK, op.\n\nAlso, I'm not crying, you're crying.",
            "Please allow me to be yet another person who tells you that you're a true hero. I cannot imagine how hard this has been, but your sister is beyond lucky to have you. Keep up the good work, and if you ever need support we-the-internet have your back. In a world so full of ugly what you've done is a beautifully-inspirational thing. If this world is just you'll trip over a garbage bag full of hundred dollar bills one day. Best of luck.",
            "This is an older post, and even though others have shared the same sentiment, I still feel compelled to remind you that you are an amazing person. \n\nIt doesn't seem life's been fair for you and your sister, but the way you've responded is nothing short of breathtaking. \n\nI only know you through this Reddit post that I just read 5 minutes ago, but I'm glad to know there are people like you out there. Best of luck to both of you. You and your little sis will have amazing lives, despite the hand you've been dealt.\n\nIn the end, good things happen to good people, and you sound like you're one of the better ones out there in the world.\n\nAnd now that's off my chest, and I can stop kissing your ass now, haha.",
            "I would do my best to get back at the parents....like cold hard serious painful revenge."
        ]
    },
    {
        "post_id": "q9zzbs",
        "author": "Overall-Lack-2179",
        "title": "Update: should I move out?",
        "url": "https://www.reddit.com/r/relationships/comments/q9zzbs/update_should_i_move_out/",
        "score": 4205,
        "num_comments": 187,
        "created_utc": 1634481541.0,
        "selftext": "It’s been about a week since I talked to my dad and I’ve had a couple people message about an update, so I figured I’d give one.\n\nFor those who didn’t see my original post, I (16M) had to move in with my dad (47M) and his family after my mom died and things have been extremely strained—the worst incidences being my half-brother ripping pics of my mom up and my dad’s wife leaving me locked out of the house—so I was given the offer to move out by my dad’s friend and his husband (Both 30’s M).\n\nI followed a couple peoples’ suggestion and texted my dad’s friend that I wanted to leave and they ended up suggesting we all go out to lunch. I think they could both tell how nervous I was around my dad and my dad’s friend J ended up being the one to bring up the idea of me moving out. My dad seemed completely blindsided by it and asked why I wanted to move out. J and his husband B reminded him about everything that’s been going on at home and I just kind of sat there.\n\nMy dad seemed really upset and it made me feel terrible because I already felt guilty about leaving, but then he just asked if I really wanted to go. I said yes and he just immediately agreed.\n\nIt kind of hit me that I wanted him to try and fight for me, to say sorry for everything that he’s been letting happen, and for my dad to try and keep me at home but he just let me go like it was nothing. It’s been hard after my mom died and my dad’s the only family I’ve got left, so it really didn’t make me feel any better about leaving, even though I don’t have to deal with my dad’s family anymore.\n\nB took me back to their apartment while J went with my dad to get my stuff from the house, and they had set up their extra room for me already. He apologized that they hadn’t been able to do this sooner and that they hoped I would like living with them. J came back with all of my things and they kind of gave me time to decompress. I ended up sleeping for almost sixteen hours because I was so exhausted.\n\nOver the last week, they’ve been really nice about making me feel at home and have talked to me about getting me into therapy to deal with losing my mom and everything that happened at my dad’s house. They’re also trying to figure out how to move me into a different school so I don’t have to deal with my half-sister and everyone that knew my half-brother. It’s the first time in months that I feel like I can actually breathe and I don’t feel like I’m constantly on guard. My dad hasn’t texted me much or reached out in the last week so I don’t know what’s going to happen with him but, for now, I’m safe I guess.\n\nSo that’s what’s happened so far. Thanks for everyone that gave me advice and wished me well. It’s been really hard lately and it made me feel less alone.\n\nTL;DR: I managed to get out of my toxic living situation, moved in with my dad’s best friend and his husband, and things are going okay, even if I’m still having a hard time\n\nLink to my original post: https://www.reddit.com/r/relationships/comments/q3xzf2/should_i_move_out_how_do_i_even_ask/\n\nEdit: Umm wow this unexpectedly blew up and I’m kind of stunned. My other posts never gained much traction so I never expected this update to get so much attention.\n\nA quick update over the last 24 hours or so. B’s sister somehow saw this and send it to him, so he and J came in and asked. They never heard about the picture incident and apologized that they hadn’t asked to get me out sooner. They had no idea how bad it was and said I can stay as long as I want or need to. I realized then that I hadn’t really said thanks to them because it’s been so crazy so I told them how much I appreciated having the place to stay. It was a really emotional moment honestly and I’m glad it happened.\n\nThey did think it was funny that they’ve been called everything from my “roommates” to my “new landlords”, so that’s helped soften the mood a little.\n\nSorry I haven’t been able to respond to many comments, this feels really overwhelming but I just wanted everyone to know that the support means a lot. Thanks.",
        "permalink": "/r/relationships/comments/q9zzbs/update_should_i_move_out/",
        "comments": [
            "I'm glad you're taking care of yourself. You deserve a fresh start",
            "They sound like excellent people.",
            "I'm so happy that you're happy, OP.\n\nBut I think you have a mistake in your post.\n\nYou wrote:  \n>It’s been hard after my mom died and my dad’s the only family I’ve got left\n\nSome random people just gave you a home. Someone who basically didn't really know you before offered a spare room to you and that they'll take care for you. They're organising school stuff, they're there for you, they're dealing with your problems. They know when they should speak for you and give you the time you need.\n\nYou have at least two more family members, OP. You just got adopted. Maybe not legally, but people just adopted you in their lifes.\n\nYou're not alone.",
            "Wow man... Before reading this update, I went back and read the other posts and all I can say is I'm *really* glad your dad's friends offered you a place to stay. \n\nWhile I understand that your father's wife was blindsided by the son of her husband and his affair partner (your mom, obviously) suddenly living with her, there's absolutely no excuse for her and her kids treating you like shit.\n\nGood luck getting school stuff figured out!",
            "It sounds like you are in a good situation after being in a very bad one. It was good you moved out as your dad was not likely to change his wife and children.\n\nDefinitely go to therapy. You went through a lot and it sounds like J and B are good people. Maybe they have a little experience with tough family situations and can be there to help you. You can definitely now rest and then be able to get back up in a situation that allows you to focus on your best future.\n\nI'm sorry your dad didn't work out, but after some time you will be 1000X better off than if you had stayed. His family was abusive to you when you aren't the problem, just a consequence of your dad's actions. However, you are your own whole human being and deserve happiness. His wife should know that. His wife shouldn't have been a bad person and treated you poorly and thereby teaching her children to treat you badly because of her own unhappiness with your father.\n\nYour dad likely let you go because he knew he can't keep you safe from his chosen family and past choices. He should know that you don't deserve to live in that environment because of him. Hopefully, he will send you money even if he can't face you out of shame he has against himself.\n\nYou are just a person. Rest up, Heal, and go on doing person things.\n\nInternet hugs and head pats <3",
            "I sincerely wish you well going forward. Hopefully, the men caring for you now will show you the support you need and deserve. They're already demonstrating more character and presence than your father did. His failures are his to own and don't reflect on you.\n\nAs for your half siblings and your father's wife, their abhorrent behavior is another example of your father's failures. Rather stepping up to stop their mistreatment and be an adult he chose to hide like a coward. He's a poor example of a parent, and in the future, you'll likely look back at this moment as a blessing because it got you away from him.",
            "OP,  your bio dad has failed as a father and let you down when you needed him the most. He doesn't deserve a son as awesome and strong as you!\n\nI'm glad that you're out of that situation and found 2 loving role models. You can choose your family and these guys chose you ❤️\n\nSending you big virtual hugs",
            "If you've not managed already, there's a bunch of Photoshop subreddits that would help you repair the photos of you mom for free. There's some really talented and kind people out there that could restore a digital copy for you.",
            "Good luck. You deserve a break.",
            "Hey, I'm so slad you are finally safe.  Your posts are being posted in all kinds of subs. \nSearch for them if you want to read the comments.  Your story has people crying and trying to reach out to help you and the awesome friends that took you in.  This post only has 35 comments; but there are hundreds out in the subs for you.  I'm new to commenting ( long time lurker ) so I don't know how to link you to all of  them; and I'm sure they'll be more before long anyway.  Search your titles as most people are just plucking your stuff to the other subs.\n\nGood luck Original OP.   Please get some counseling in some way if you can. As you've been through trauma and that shit sucks.",
            ">My dad seemed really upset and it made me feel terrible because I already felt guilty about leaving, but then he just asked if I really wanted to go. I said yes and he just immediately agreed.\n\n>It kind of hit me that I wanted him to try and fight for me, to say sorry for everything that he’s been letting happen, and for my dad to try and keep me at home but he just let me go like it was nothing. It’s been hard after my mom died and my dad’s the only family I’ve got left, so it really didn’t make me feel any better about leaving, even though I don’t have to deal with my dad’s family anymore.\n\nHi! \n\nFirst, I'm so sorry you lost your mom. Not just your mom, but your family, is how it reads to me. That sounds incredibly traumatic. Can I recommend that when they help you find a therapist, that you find one trained in either CBT (cognitive behavioral therapy) or ACT (action commitment therapy), or someone who specifically works with PTSD/trauma.\n\nThat being said, please make sure to bring up these feelings of guilt. The therapist will help you with through these. What I see right now \"my dad seemed upset and it made me feel terrible/guilty\"; I see you trying to manage and own his emotions. This is something that's incredibly hard to detect in yourself, and it's even harder to learn to let go of that.\n\nTruly, he is the one failing you, not the other way around. His \"upset\" feelings are for him to deal with - not yours to try to make better.\n\nAdditionally, my heart hurt for you reading the second paragraph I quoted. I am so so sorry that happened to you. Unfortunately, people tend to grieve in wildly different ways, and they will get stuck on one of the stages. I suspect that, especially considering he was blindsided, he had no idea what to say. Of course I don't know him. I'm basing this on observations of other people and situations- even my own. Not to say that it was okay for him to basically abandon you emotionally and let your brother do what he did. You are absolutely normal and correct to feel upset and incredibly hurt. I encourage you to feel your emotions. It is normal to feel confused too - you are hurt, but you love your dad. Your dad failed and neglected you emotionally, but he is also grieving. It's confusing. I'm not sure if you're hyper-empathetic - just know that there's boundaries between understanding why someone hurts you and allowing them to hurt you.\n\nI hope therapy helps you find peace. I started going this year and it is just not what I had thought it would be, and I regret not starting sooner. I hope eventually your dad apologizes. I hope you learn that you're not required to forgive him, nor that you're required to feel guilty of that upsets him.",
            "Sometimes our parents don’t end up being the care givers in our lives. And that sucks - because we all have expectations of our parents, but in the end they are still people with their own trauma and problems and faults too. Which is something you will grieve - having a distant Dad is hard, and you’ll be sad about the relationship you didn’t get, but these new people sound awesome and I’m so glad they thought to take you in and give you the care you need. Take care of yourself and be proud that you’re taking charge of your mental health. I’m sorry you’ve had a hard time; hopefully better times lay ahead.",
            "I am so very glad you got out.  Please file for emancipation.  This will be important OR ask J to help you find out what you need to do to get them to have legal custody of you.\n\nYou father should not have authority to make decisions for you any longer.  Additionally, J and his husband sound like much better humans.  Please make sure your bank account doesn't have your father on it.  Make sure your important paper work is in your household - not your father's.",
            "For what it's worth...\n\n>It kind of hit me that I wanted him to try and fight for me, to say sorry for everything that he’s been letting happen, and for my dad to try and keep me at home but he just let me go like it was nothing.\n\nI know that your Dad's immediate agreement was painful to you, but in the moment like that, he may have been thinking more about how he's obviously let you down, especially if he didn't grasp how toxic that home environment had been for you. And he may have just wanted to be supportive of you and a decision you'd clearly made already. \n\nThis may also be the case if he was concerned about his ability to make his home more welcoming to you. If his wife and your half-brother aren't likely to listen to him or completely change their awful behavior quickly, then he may not have wanted to subject you to what would probably be a period of conflict and argument. \n\nHe may have rationalized that this is the emotionally and physically safer option. \n\nBut, you should make it clear that you do want a relationship with him, because he may be thinking that you're done with him too. And from what you've written, I think you'd regret not finding out if your Dad was willing to do the work to be a part of your life or if you just need a clean break and time to heal.",
            "Family is more than blood. I’m glad you’re moving out of your dad’s.",
            "Thank you for sharing!! Wish you the best!",
            "OP, I hope you can get into some therapy because while you handled this situation with far more grace than could be expected from a 16 year old, it doesn’t mean that there won’t be lasting issues from the event. That isn’t your fault (nothing in this entire situation is), but it’s better to get ahead of all the trauma build up now. I hope things go well for you from now on",
            "Wow, I am so sorry about how your dad treated you, but here's to new starts. J sounds like an amazing person, OP. Best of luck. P.S. Remember 20 years from now, remember how this felt when you dad reaches out for a kidney donation.",
            "I'm so so so glad to read your update. I'm glad the couple you live with seem like decent people, and I hope your life will feel much better now. I'm so sorry for your loss, I hope some therapy can be helpful. Sending hugs.",
            "You sound as though you are now with good people, so good luck and best wishes for the future.",
            "I’m so glad you have at least two decent people in your life. It really sucks that the other two adults who are supposed to love (at least your dad) and take care of you (both him and S) are complete wastes of space as humans. And I’m so so so sorry for all the grief and trauma you’ve gone through. \n\nIf you can get B and J to sign you up for therapy, I highly recommend it. And I hope one day you realize that the world is not as shitty a place as your dad has made it for you. Sending hugs!",
            "From now up until between two to six years, make sure you make J and B's life as easy as possible. That means helping with chores, doing your school work, working, staying out of their face, not getting into trouble, not getting with the wrong crowd, etc. Start thinking about school, work, money, career, moving out, relationships down the road. That stuff doesn't happen in a day but over time. \n\nMy friend took in a fifteen year old girl because her family was toxic; mom did drugs, more crazy stuff in the household. My friend gave the girl a place to stay, had her hang out with her daughters, took her to games, and events, you know how the fifteen year old girl repaid her? Crashed her car, got kicked out of school, did drugs, got pregnant. Don't be that fifteen year old girl. My friend kicked her out and she's back with her toxic family. She had it good, didn't know it, and was bored. Some people attract drama in their life, need drama, or cause drama, that was the fifteen year old.\n\nAnyway, you got it good. Otherwise, you could've been with that horrible old family. You're two years away from eighteen. Maybe you can go to college, live in a dorm and move out. Depending what career avenue you want to take. You want to start thinking about this now. You got this.",
            "When you're ready. Tell your dad that you wanted him to fight for you, to apologize to you, and ask why he let it happen, and why he let you go. I recently lost my father and there are many questions I wish I had asked and wished I had answers to. This is one of thoes times when you could just be misunderstanding each other or it could truly be heartbreaking to hear the truth. Brace yourself. But I tell you the doubt and the unknown will eat at you later in life. You don't have to right away, but consider it in time. Don't feel guilty for doing what you need to do to stay safe and healthy.",
            "Your stepfamily is incredibly cruel and heartless, also, how cliché and dumb is it to blame the baby of the affair!?\n\nI‘m glad you’re out of there, hope these 2 amazing friends become your new dads and everything will be fine ♥️\n\n(…In fact, I also hope you become super rich and successful, they stay the losers they are and a few years down the road they come begging to be a part of “your life” and you can tell them to go fuck themselves. Oh geez, just thinking about this cliche scenario gives me a juicy justice boner, but I am petty like that \\^\\^)",
            "You deserve a happy, safe, and supportive home, and it sounds like you're on your way to building one. Best of luck *hugs*",
            "This might have been engineered by your dad to get you to a safer place. He might like you but can't risk losing his family over you. Which might explain why the room was already set up, and why he agreed immediately. You've got a long life ahead of you, kid. You'll never know what will come out into the open.",
            "J & B sound like great guys.\n\nI hope, in time, you and your dad can forge a decent relationship, without the interference of his wife and other kids.",
            "Sorry your dad is a coward, the older you grow the less validation you'll ever want to feel from a person with such low character. I hope your living situation just gets more and more stable with time and you'll get some space to think about your needs.",
            "I'm so sorry that your dad is so useless. I'm so relieved that there are at least two adults in your life that are decent people.",
            "Not everyone should have kids and not every parent is fit to parent. I’m so very glad you found a soft place to land. 💕",
            "I'm sorry you didn't get the response you wanted from your dad but I can promise that it will hit him eventually and he'll realise how badly he fucked up. It sounds like you've got to great men in your life who are happy to be father figures to you. Embrace that as best as you can and then focus on grieving for your mom like you should have had the space and time to do before. I'm not religious but I like to believe that the people who loved us are always with us in some way and watching over us. Live your life the way you want and only let in people who are good to you and for you and make her proud.",
            "OP, I really recommend you talk to B&J or your school's counselor about getting a therapist and possibly a social worker (tho, I am not sure what country you are in, but since you mentioned French, I'm guessing Canada.) \n\nYou have been through an awful lot. You likely need help getting through this (because this is a lot even for an adult and you're only 16.) Please go and talk to someone professionally about getting some help getting through this. I recommend a grief counselor and likely a family therapist too. And a social worker to help you and B&J with whatever benefits you need/can get from the government. \n\nBig internet hugs. I am so glad you found someone who will help you.",
            "Your dad was not surprised you were moving out, even though you say he seemed completely blind sighted. He may have been trying to gaslight you, making you believe that he was, which is a form of manipulation\n\nAs all I can tell, the two step-siblings dont have the best relationship with their parents, at least one and the fact they have gotten away with treating you poorly speaks volumes. And the step siblings are incapable of empathy about your situation which speaks volumes. It could be that there is really really poor communication at the household and things are not great there\n\nBut thats not your problem or responsibility\n\n⬆️read that again repeatedly until you agree and understand why\n\nThe manner in which you communicate, you narrate highly emotional events of the last week with clarity and logic is noted and speaks to your maturity. \n\nPersonally, Im glad your dad didnt pull some ego boost and require you to stay. I am sorry he did not defend you or come to your aid when you move there and all these new things hit the fan so to speak. Reading about all that happened, and Im sure it was not all of it, was horrible. I can’t imagine what it must have been like, and *be like to be going through it. \n\nProtect your time and space right now from anyone who might challenge your sense of safety and self esteem (like your siblings). Like if your dad invites you at some later date to do something, it OK to say that you would like to meet him alone and anywhere but home. m not saying to look forward to this or even initiate it. Im just saying that if he asks and you want to go, it is OK and suggested you implement boundaries\n\nOn to better days. J and B sound like stand up guys. Really. They even collected your things without you having to. Really stand up guys. In every way. It’s like they’re a blessing. Im glad you slept in and feel safe. Im happy they are looking to find another school. This is true empathy—trying to imagine what your situation is like and helping you every way possible. Take advantage of getting good therapy. \n\nThis is just a guess but I bet your mom wants the best for you and would want you to be the best person possible. You will get through this and you will be a better person for it. Who knows, you might some day be able to provide guidance for someone going through this\n\nYou got this",
            "I hate to say it like this but you need to hear it.. Your sorry ass dad really doesn't care that you've gone with his friends he's just happy you're out of his happy little world that he has with his new wife and children.. \n\nDon't expect to hear much from him as time progressed and to be honest if I was you I would actually cut complete contact with him because it was too easy for him to just allow you to go to stay with the family friends..",
            "I'm proud of you for having the courage to have these conversations, you deserve better, and I am so happy you're in a safe space now. Things are going to be out of whack for a while but you're going to be okay in the long run. Take advantage of the therapy, it will help you.  \n\nOne thing though, ask your dad's friends for help in filing for your mom's social security benefits to help you save up for college or to get a place of your own when you graduate.   You are eligible to receive them.",
            "Those two are a godsend. I’m so happy you’re out of that situation. I know first hand how it feels to live somewhere where you feel like you can’t move and it being your only choice. You should be really proud of yourself for sticking to your guns and telling your dad that you do want to leave and move in with them. They sound like amazing, caring people. I’m sorry you were hit with your dad not fighting and trying to keep you at the house. But I would like to think it’s best at the end of the day that you don’t have to deal with your half brother and always having to look over your shoulder. Hope everything gets a lot smoother after all this. Keeping you in my thoughts OP",
            "Your dads friend and his husband are absolutely amazing men! I hope you’re very happy in your new home with your new adoptive family <3",
            "I’m so sorry that you’ve lost your mom.  I was the child of an affair between a married man and a single woman.  I have siblings who I don’t know, and will never know.  My dad was an awesome guy, but I’m thankful I was never in a position where he had to make daily space in his life for me to live — he wouldn’t have known what to do, or how to make it work, and there would have been a ton of resistance from his wife and my siblings.  He’s passed away now, and his other family neglected to tell me or include any mention of me in his obituary, and it hurts, but I’m ok.  I’m an adult who has made and chosen a family, and while I think it would have been lovely if my bio-relatives could have seen me as a person, and not a hurtful byproduct, they couldn’t get there.  Again, it hurts, but I’m also content knowing that I am able to love deeply and fully and be loved in return.  It took me a while to figure that out, but it’s been true for my whole life.  \n\nI’m sure your mom loved you with her whole self; and your dad probably loves you more than he can express to anyone (but hopefully he’ll get some therapy one day and figure out how to do it); and now you have two adults in your life who love you enough to open their home, and care for you, and make a new kind of family.  You have so much love in your life — I know it hurts right now, but it won’t always feel this way.  Just let the love, and your ability to love yourself, light the way forward.",
            "You will absolutely need to confront your father over this as well abandoning you, none of what happened in their home should have ever transpired and his lack of being the man, your father protected is obviously why they all thought they could and did get away with it.  Dad should have never allowed himself to be walked over by his terrible newer wife. And Hs own children. Confront him, you need to say it to him, to his freaking face. Allowing his daughter to be exiled to near strangers because he has no backbone.  Tell him.\n\nNo one can make anyone do anything at all, ever.  Everything we do, we decide to do, regardless of pressures, dare I even say torture.  We decide to do what we do.  He cannot make them do anything, but by his staying and doing nothing he is tacitly telling them what they did is okay with him.  He cannot make them do anything, but he as well can choose to not participate in their terribly bad behavior.  If they want their husband and father around they would need to change to satisfy that want and need for him in their lives.  And the need to change their horrible mindsets.  They all are not good people. That is the bottom line in all this. \n\nI hope it all works out for you, and do therapy as offered.",
            "Reading your first post, I feel sorry for your circumstances. Your context of birth is understandable why your father's family hates you. You're innocent of all this. You don't deserve all the hate. The hate should only be directed at your father for being a cheater.\n\nFor your father to let you go so easy means he never loved you. Your father is a deadbeat. Your father has shown complete apathy towards you. Not even caring about you nor your health. Only tolerating you. Seeing you as nothing but trash that should be thrown out.\n\nFor now, you made the best choice of staying with your father's friend. Get yourself emancipated or ask your father to terminate his parental rights. Don't contact your father nor your siblings unless you want to. Your father doesn't deserve you. Your siblings don't deserve you. Move on for now. Be happy that you're safe.",
            "I am so happy for you! And the couple sounds super nice and loving! Lots of love and hugs to you!",
            "You lost a shit dad and gained two dad's who seem pretty decent. It's tough now, but I think it's a definite upgrade for you on the Dad front.",
            "Hi, I'm a mum and all I want to say is that you are good, loved and wanted. And if you want to take it, I also send you a biiig hug.\n\nI wish you a really good life. You've earned it already ❤\n\nPlease tell your new \"landlords\" they are amazing people and give them a hug from me as well.",
            "OP, I hope everything comes together for you! \n\nMum hugs from me ❤️\n\nAlso if you ever need mum love - r/momforaminute is there for you",
            "Very happy you're out of that toxic living situation. Are you getting bereavement counselling because of the death of your mom, and because of what you've had to go through? I hope you can get that, through school, insurance, or some other way! It should help you a lot to be able to talk about it. (also friends?)",
            "Congratulations on getting out of a shitty situation.   Definitely get into a different school to make a clean break.  Please do get the counseling and listen to them.",
            "I had read your original post and I am so glad to see this update.  It's hard now but you'll adjust and be in a much better place soon.  It sounds like they really want you there and will do what it takes to help you.",
            "Wow, bless their souls. B and J sound like wonderful people, I'm glad you have friends in them. Just take one day at a time,  now you have the space and peace you need to process these tragic events.",
            "Wow. I didn’t catch your first post and read that first. A little teary-eyed that B and J were so kind to offer you somewhere safe to stay. Good people. So glad to read you’re able to rest a little more comfortably now. \n\nBest of luck with the school change and everything going forward. You deserve happy times, a good education, and people who care for you.",
            "I am glad you are in a safer space. Take a minute and breathe, this must have been a whirlwind of bad experiences since losing your mom.  Sounds like your new roommates are good people that want to help, I’m glad you have them. Are you going to love it every day?  Maybe, maybe not, there will be days that it’s hard. Overall, though, I think it will be a great solution for you until you can be on your own. Good luck and I wish you all the best.",
            "God your family sicks. I would talk to the couple you are with about them getting custody of you and cut your \"father\" and his shitty family out of your life.",
            "I’m so sorry to hear about how horrible you were treated. you have just lost someone monumental in your life and you’re not getting the support you need or deserve. i truly hope your dads friends take good care of you from now on. they sound like amazing people. please keep us updated on how you’re doing.",
            "I know this whole situation is fucked, and you feel like you don't have any family right now, but take a good hard look at what those two men are doing for you. They're taking you in with zero responsibility towards you and doing what they can to help you and make you feel comfortable in a positive living situation. THAT'S your family right fucking there. You may not share DNA, but that matters for fuck-all anyways.\n\n&#x200B;\n\nI wish you the best going forward in life. Don't let what your previous family did to you tear you down or feel lesser of yourself, some people in this world honestly just suck and don't deserve good people in their life, but you do. Good luck. <3",
            "Oh hun- my momma heart hurts for you. So bad.\n\nI am the child of an affair as well. I’ve been the “dirty little secret.” \n\nPlease reach out if you’d ever like to talk. I am a good listener. I’m a mom of 4 boys and my heart truthfully is hurting for you.",
            "Honey, I'm so sorry you're had to go through this and I'm sorry you lost your mom. I'm pissed off you are thought about as an \"affair baby\". You're mom probably never thought that, you were her whole world. You didn't have a choice in anything going on now. But I am so happy you have people who don't judge you. I hope you're going to be okay. I pray for your future. Bless you honey.",
            "That's fantastic, I'm so glad you have great supportive adults in your life x",
            "i wish you all the best & hope you father loses his family over this. \nHe deserves neither you, not the other kids (+ wive).\nHe completely crapped on all (!) of your lives because is a cowardly shithead.",
            "[removed]",
            "Remember: family doesn't have to be blood. You said your dad was the only family you had left, but J and B sound incredible!!! Family is who you choose.",
            "Aww baby I have got no advice to give but I am sending you a  great big hugs things will get better in the end just keep going and here is another hug just because",
            "OP, I’ve read your whole story and I just want to send you love.  You’ve handled an incredibly awful, unfair, and painful situation with poise and thoughtfulness that would do credit to someone twice your age.  \n\nI’m so glad your dad’s friends have given you a new home.  I’ll keep you in my thoughts/prayers, whatever framing you prefer.\n\nWith your smarts and big heart, I’m sure you have a good future ahead of you.",
            "All the best to you mate. \nYou dad is a scumbag amd his family worse. Yes. It's very sad he didn't put in more effort to keep you and fight for you....but he's a gutless tosser. You truly are better without him directly in your life.\nIt's a tough thing to accept. But it is sadly.\n\nSounds like the men who've taken you in ate really decent people. Be thankful they are such decent men. Get your life back on track. Change schools and start over.\n\nSo sad about your mum. She would be pleased you've found a better home to live in.\n\nAll the best to you. Head down. Work hard. Enjoy your life from today onwards.\nSometimes life throws us curveballs...use yours wisely.",
            "I'm so glad that someone saw you needed help and got you out of that toxic living situation.",
            "Wow, your dad sucks. I know how it feels to have a parent choose others over you. OP, please get therapy and realize your dad being this way is in no way your fault.",
            "I'm so sorry about your mom BUT am thrilled that you have a safe place to stay at.  That was really nice of them to offer!!!   I hope you decide to go to therapy.  This is a good thing to do. Best wishes to you!",
            "I'm so glad you moved out. That was a brave step and J and B are awesome for taking you in.\n\nI'm also sure your mom would be happy to see you sleeping and breathing easy. She would only ever want to see you safe and happy and at your full potential. You did the right thing. And remember: family is what you make it. Blood is just coincidence, but you can pick your true family and it sounds like you're on your way.",
            "Oh, boo… I am so sorry for your loss. As a mom old enough to be your mama, I’m sending you big squishy mama hugs, wherever you are. \n\nAnd I am so proud of you! You have endured so much more than a person your age should. And you have come out still standing. Be proud of your resilience. Be proud that you did what you had to do to survive your sperm donor’s house. Be proud that you are a man in which your father’s friends saw potential. And you were strong enough to know that you were worth it. \n\nI hope you find space to grieve. And I hope you don’t think another moment about that broken family. They weren’t angry with you. They’re angry with your dad. But it’s way easier to take it out on you. Fuck them. Leave them behind to choke on your dust. \n\nI’m so proud of you, baby.",
            "Speaking as a mother, I would be eternally grateful to know my son is being looked after by people who truly care for his wellbeing. \n\nI hope your father eventually realizes his mistakes before it's too late but even if he never does I'm so happy you've got amazing dads in your corner who will obviously love you as unconditionally as your mom did.",
            "So glad to hear that you've moved out and how welcoming your dad's friends are being! \n\nYou've been through so much and you totally deserve a stable home environment and have 2 adults fully looking out for you. I love that they are supportive of you going to therapy to help you with the loss of your mom and the experience of living with your dad.\n\nI think it's totally understandable that you're angry with your dad and you wanted him to fight for you. I think this is another topic that would be really great to discuss in therapy.\n\nI dont relate fully to the dynamic you've described with your dad, but I can say I relate to having a strained relationship with my dad and never really feeling seen or cared about by him. I (30F) just started addressing this a year ago and am finally starting to heal from those experiences. I think you're really brave and self aware to realize and vocalize that you're hurt by your dad and I hope you know that his actions have nothing to do with you - they're his shortcomings, not yours.\n\nHe may not be the person you can lean on right now even though you may want him to be, but it sounds like you have two wonderful people in your life who are committed to being there for you. \n\nThis all may be redundant info, but just wanted to remind you you're not alone even when there is a lot of pain right now! 💕",
            "I'm so glad things are looking a bit better for you, OP!  \n\nI just wanted to add that what you've been through sounds majorly traumatic, and I hope you will consider reaching out to a therapist or similar health professional when you get the chance.  You've endured so much these past few months, and I hope you know that you should be proud of how you've dealt with things (***even*** *if you punched 'M', which I suspect is what he was aiming for- goading you into doing something so that you would be kicked out of the house*).  \n\nAnyway, you have nothing to be ashamed of- but your 'father' and his 'family\\*'  should be ashamed of *their* actions- abusing a child is **disgusting** and pretty much one of the few crimes that even hardened PRISON INMATES will look down on.   (And yes, ignoring, harassing, destroying personal property, AND denying basic needs like shelter from the dang rain are ALL abusive actions). ^((\\*'A' kinda gets here, imo, but only because she's so young and probably was heavily influenced by said adults).)\n\nI hope your life keeps getting better, and remember- a real family isn't made up of a bunch of shared genetics, but by the people you really love and choose to be around.  And now you have a lifetime ahead of you in which to find those friends and partners with whom you'll make memories and share in whatever makes you happy- because THOSE are the people who will make up your true family.  <3\n\n**Also, on a side note- if you're able to get to a local library in your area, they may have a digital scanner in which you can put the pieces of your mother's photographs and get a digital version of each one- there's tons of folks very skilled in Photoshop and similar programs who I'm sure would be thrilled to donate their time fixing the images so you can print out 'new' versions that look like the originals!**",
            "I’m so happy for you OP!",
            "As most people have said you definitely gained two beautiful family members today. However, I can tell you're hurting from your dad's lack of reaching out and his \"rejection\" as well. I think the feelings for you may be complicated for a very long time, and you probably will miss him. Try and remember that he does care for you, that he is only human and sometimes humans don't make the best choices - even if you know you wouldn't make these choices yourself.\n\nNow you have another two dads who I'm sure you will feel the love from. Make sure you let them in to your heart. They've already showed you an abundance of love. Treasure it :)",
            "True family is the people that choose to have you in their life. I hope that you do get into the therapy because abandonment issues will likely surface. But always remember these wonderful people have chosen you. Grieve what you lost but be thankful for your new life.",
            "Really glad you're safe & secure, good luck - hopefully your future is bright.",
            "I just wanted to say that it sounds like you're very self-aware and introspective. I think you will do great in life and it sounds like your new home is a great launching pad for the wonderful future ahead of you.",
            "I am soooo glad you have landed somewhere safe. Take the therapy.  I can’t believe how well you are doing. Life goes on awhile. I don’t know if you will ever have a relationship with your father and his other family, but try not to worry about it too much right now. Get the best education you can and I wish you great success and happiness in life.",
            "What shitty half-siblings. U almost wish they'd drown.",
            "I'm sorry for the loss of your mom but very glad for you that you have found a new home with these two people. They sound amazing. And you sound like a smart, strong young person who is finally out of a very damaging environment and can begin to heal. Wishing you the best of luck!",
            "I hope one day your dad realizes his mistakes.  My own experience would tell me that he already does, he's just not brave enough to do anything about it.\n\nYou should be proud of yourself for being more brave than him.  I can't even imagine how painful losing your mom was, and I am so sorry for your loss.  I'd love to hear an update further on down the line.  I feel like there are a lot of good things ahead for you.  \n\nBe well and stay safe. <3",
            "My husband’s uncle is someone who was brought into their family from an unfortunate situation. He’s absolutely considered my father in law’s brother, no ifs ands or buts. Now his uncle has two daughters and recently they brought in one of their daughter’s friends from an unfortunate situation to live with them as part of their family too.\nI share this to show you’re definitely not alone in your situation, it sounds like you’ve found your family now, and to always remember kindness breeds kindness. ❤️",
            "I doubt you’ll see this message, but do you still have the picture pieces of your mom? I don’t know about your country, but in the US there are companies that can repair shredded and damaged photos, so maybe not all is lost. Either way, I hope you find peace.",
            "Oh my goodness, I am so sorry to hear about the loss of your mom and all the messed up stuff that has happened with your bio dad's family.  I'm glad you are in a safe place to stay with caring adoptive dads now.  Kudos to them - they sound like amazing people.  You are so blessed to have them!\n\nIt is valid and natural to have some feelings of resentment and anger toward your bio dad and his family for the way you were treated.  You deserved way better than that.  I understand the resentment of your stepmother and half-siblings over the circumstances of your birth and the disruption to their lives that the present situation has caused, but that was no fault of yours.  They had no right to destroy your treasured possessions nor lock you out of the house in the rain.  That is straight up abusive behavior.  They should direct their anger and resentment at your bio dad for handling this situation extremely poorly, starting from the day you were born.  How sad for them - they are quite likely missing out on the opportunity to get to know someone wonderful, and they can't even get past their own resentment to see that.\n\nOne thing I must stress is finding healthy ways to cope and deal with your feelings.  You have been through some major traumas in your young life, and you need to process them and figure out how to deal with your feelings about them constructively.  A good therapist will help you out a lot here.  While it might be tempting sometimes, try to stay away from drugs and alcohol to medicate your pain.  Their effects might make you feel better in the short term, but they can lead you down a path of self-destructive behavior if you get addicted.  Work with your therapist and your adoptive dads to find some healthy outlets for your emotions - whether it's working out or maybe just taking a walk, music, or indulging a particular hobby that you enjoy.\n\nLiving well is the best revenge, so do what you can now to set yourself up to take care of yourself in the future.  Concentrate on your schoolwork, and try to help your adoptive dads out around the house from time to time.  As crazy as it sounds, something as simple as pitching in with the dishes or sweeping the floor will give you a sense of belonging, and show your adoptive dads your gratitude for giving you a new start.  It would be a good idea to start thinking now about what you want to do after you graduate from high school in a few years - be it college/university, trade school, military, or career.  Whatever it is, give it your all and set yourself up for a good life.  You deserve it!\n\nHang in there - we are all pulling for you, kiddo.",
            "This makes me happy! To know that there are still genuinely nice folks out there!\n\nThings are hard.. They might be hard for a while.. However, slowly, but surely, they will get better. This too shall pass. Best of luck! :).\n\nThis is something that I've always thought..especially after watching movie scenes.. as you go through life ahead.. there might be some hard situations you find yourself in.. In moments like that, I'd like you to please not say something along the lines of - \"You're not my parents! You don't get to tell me <anything here!>\" That shit hurts! :/ Family is made! Also, understanding and patience has to come from all parties involved!\n\nI'm really sorry about your mom.. and not finding a family in your step-family. Here's to everything being better ahead! :)",
            "We are all gathered here to celebrate this W for the Op. A the best!",
            "Seeing all the overwhelming support for you in these replies really warms my heart. I hope it’s a reminder to you that there are so many people who care for you. J & B are just two examples of that. \n\nI’m so sorry to hear about the loss of your mom and having to deal with your newfound family in such a difficult way. You deserve so much more, and I hope that you know that. I’m glad that you’re in a safe space where you can finally process all of your emotions. Please take J & B up on their offer of therapy because it will be so beneficial. \n\nAnd I’m so happy you finally are in an environment where you can talk about your mom. It’s gonna hurt, but it’s better than forgetting. Although she’s gone, you can still keep the memory of her alive. Let people who weren’t lucky enough to meet her fall in love with her through the stories you tell. \n\nI know I’m just some stranger on the internet, but I’n wishing you all of the good and beautiful things life has to offer.",
            "Hey man that isn't ideal but it is an unavoidable lesson. The people you share genes with are almost always not the people you'll share values or level of courage with.\nThis is how it is for at least half of us.\n\nIt is also important to realise that your family's flaws and 'frailties' and how that leads them to act poorly with you, isn't personal. It is their issues and problems.\nThis goes the same for other people. See how these guys are treating you. They don't owe you anything - but they seem to be operating from a higher level of consciousness than your next of kin.\n\nIn life you rarely get the family you deserve. But you get the family you need. I know people with accomodating families who grew up soft and entitled.\n\nIt will hurt, but focus on learning to be this way, and working everything in your life through this Universal process \nBe\nAware\nAccept\nLet go (forgive)\nBe Grateful\nBe Courageously Humble (can't think of a better word for this)\n\nThis leads to Inner Peace & Joy\n\nWatch out for being reactive, which will drop you into these states,\n\nSelf-Pity\nResistance\nResentment\nArrogance/Cynicism\nPride\n\nThis pulls you down to Hate and Bitterness\n\nWhenever you feel a counterpath emotion try and find a Path emotion that gives you an equivalent result.\n\nFor example people will tell you to be proud of yourself. While they mean well and what they're really advocating is to have more self-esteem, Pride is the dirty fast-food version of Gratitude in that case.\nInstead be grateful for your abilities and your initiative or imagination.\nWhat you are truly grateful for you will increase the likelihood of experiencing again. What you are proud of becomes more scarce.\n\nAll the best finding your best self. Life is meant to be good, not shitty.",
            "Sometimes I see posts from young people here and I wonder where their social workers are. They should have followed up to ensure you were integrating well with your father. Reach out to them and let them know what is happening.",
            "This is an impressive demonstration of you understanding just how important it is to value you yourself and when to put your hand up and say something when you really are feeling like you cannot deal with a situation anymore.\n\nI’m terribly sad that you have had to endure so much personal trauma in the last year - and that has forced you to see things that you weren’t ready for, and you shouldn’t have to be at the age of sixteen. \n\nYou’ve done an incredibly brave thing, and now you’re surrounded by people who just want to see you get well and they want great things for you. \n\nIt sounds like your new living environment is going to allow you to develop some incredible communication skills that will absolutely set you up for life so go with this - if you’re ever feeling lonely, or a confused as to why your dad hasn’t been in contact then say exactly that. Say what is in your heart and mind to these people you live with and talk through those thoughts and feelings with them.\n\nYou’re safe, you’re healthy and you are loved. Not just by the people who you are living with right now, but every single one of us too.\n\nTake care, be well and find the things that make you love your life - they’re out there, I promise.",
            "I'm glad you are feeling safe. If you want a relationship with your father, you may have to take the lead. \n\nIt sounds like he may not have understood what was happening in his home with you and your half siblings, etc. If I had seen your original post, I may have suggested talking to your dad, and telling him what was happening, and asking if he could fix it. \n\nWhat is done is done. How old do young men live with there parents in the culture where you live? 16? 24? or ?\n\nIt sounds as though your half siblings were having a hard time adjusting to you being there. That doesn't justify their behaviour.\n\nRather than trying to avoid everyone, would there be value in trying to develop a relationship with them, with the goal of you moving in with them again? It probably wouldn't be easy, but if everyone makes an effort it would be better than being without family. Some families last a life time. All my family live within a 7 min drive of me and are half siblings. We see each other all the time, and have Christmas, birthdays, etc with each other.\n\nIt sounds like your dad's bf and partner are great, but it doesn't replace family.\n\nTalk to your dad. It might be hard, as you are young, and might not know what to say, and it might feel scary. Tell him you love him and want to be apart of his life and apart of his family. You didn't leave because of him, but because your siblings were giving you a hard time and you didn't know how to handle it. Ask him if he can take the lead in trying to work this all out.  \n\nJust because he didn't 'fight' for you doesn't mean he doesn't love you. He might have been trying to respect you, and maybe he felt rejected. \n\nI wouldn't change schools. If you see your siblings, smile and say hi.\n\nAll the best.",
            "Great update. I am glad you got the support you needed.",
            "I am glad things did work out for you and you are not in a home that’s appropriate for your own mental health. \n\nHopeful you will grow up to make healthy choices, especially with relationships.",
            "If you still have the torn photos, maybe the wizards over at r/photoshopbattles could stitch them back together?  Also, best of luck!",
            "I feel like your dad not trying to stop you is probably his way of not trying to hold you down? I mean, I don't know the guy but from what you're saying I think that he doesn't want to keep you in a situation that you felt uncomfortable or unsafe in just because of his own emotions and he wants to respect your choice. But like I said, this is just a guess. Anyway, it's nice that you are finally in a healthier environment",
            "Wishing you the best dude!!! Hope things end well for you",
            "OP,\n\nI saw your original post on an instagram account that reposts Reddit posts, and I had to find the original post here to comment. I'm so incredibly sorry that any of this happened to you. You did nothing to deserve that. When I read the update I was so happy that your father's friend stepped in to take you out of there. \n\n>It’s been hard after my mom died and my dad’s the only family I’ve got left, so it really didn’t make me feel any better about leaving, even though I don’t have to deal with my dad’s family anymore.\n\nAlso please don't think your father's family is the only family you have, OP. Your dad's friend and his wife came in, and they're treating you well. They're going to become your real family. Even though they say blood is thicker than water, sometimes found family is better than blood.",
            "A minor thought popped up in my head that might be helpful.\n\nI remember it from a movie before actually. Highschool yearbooks. If you know where she went you may be able to find a copy of a picture in one of her years in them, usually the library i think. Just an idea anyways. \n\n I am very happy that you are away from the abuse, they were bestowing on you. <3",
            "I just wanted to reach out and say so so happy to hear you're safe and in a better place. You should start a GoFundMe.. I'd love to be able to support and help you start saving for college or whatever other dreams you have.",
            "So OP do you still have any picture of your mom left or is Everything completely gone? and is there anyway you can get it fixed?",
            "Op, \n\nPlease thank Jand B from all the Internet strangers for giving you a home.\n\nHopefully they will be there to support you through the next few years.\n\nBlessings to you and J&B\n\nVirtual hugs from an Internet mom",
            "Dude, I'm glad you found people who actually care about your safety (unlike your father who let your half sibs/stepmom mistreat you, I hope you don't take this the wrong way but your sperm donor is a piece of crap for many reasons listed in the comments of your posts) and what's more these gentlemen did this despite being strangers when they found out you were being mistreated. Blood and DNA doesn't make family, a willingness to invest others at your own expense despite the circumstances is what makes family.",
            "Your new Dads sound like truly awesome people! I hope things continue to improve for you. As far as the DNA donator, don't even stress. He doesn't deserve you. Your Mom would be pleased to know you are with good people now. Focus on getting better and let your new Dads take care of the adult stuff. Lot of Mom Hugs!!!!",
            "I just cried when I read your story. I have a son your age and this post tore me up. I wish you the best and honestly, I am perfectly willing to take you in myself. I can afford it. You are going to college soon and hopefully your life will improve. Please keep us updated.",
            "I'm just overwhelmed with emotion after reading your struggles and how you've been mistreated.     God bless the person who took you in to get you away from that toxic environment.     Hugs to you!!!!",
            "I would say this, now that you are out of that toxic situation, I’m not saying don’t keep your guard up but be on the lookout in case those idiots siblings of yours decide to cause trouble just for the sake of pettiness. I only say this because now that you got out of that toxic situation and in case the step mother and siblings are very petty people and want you to be miserable because you were discovered, I would say be careful that they don’t try to go out of their way to be mean to you or try to get you in trouble but if they aren’t the type I just say flip them off if you see them next time",
            "Therapy sounds like a great idea.\n\nI'm so sorry you're goingthrough this. Your dad's behaviour is not your fault. He failed you. You are loveable. His behaviour has nothing to do with you.",
            "I’m so happy that you got out and are with other adults. I’m so sorry you lost your mom but it seems like these people really want to give you a safe place to exist and not be scared and sad all the time. I’m sending you love  and good vibes.",
            "OP, so glad to hear you're doing well.  Your father is a failure who let you down, and you need to go NC with him FOREVER!  Don't reward him by letting him back in, (like I did with my mine after he abandoned me) - he's a piece of garbage who doesn't deserve you.",
            "I'm so glad you're at a safer place and with people who actually care about you now. B and J seem like absolutely amazing people and I'm so happy for you to have found a safe haven. This is a prime example of found family in my eyes. These two stepped in and up for a complete stranger.\n\nAlso, take them up on their advise to go to therapy. It can definitely help you deal with your trauma and emotions. Give it a try and find a therapist that is right for you. I go to therapy and while it's not always... \"comfortable\", in the end I emotionally feel better after these sessions.\n\nEdit: I'd like to point out that none of this is your fault. Don't you dare let anyone make you feel this way. Your stepsiblings and especially your ADULT stepmother should know as much. Them taking their hurt feelings and anger out on you is absolutely despicable! And your father is enabling them by allowing this to happen. He should have a clear stance on this and protect you. Tell them, they should get their act together and act like decent human beings. It is HIS fault. HE was the one who cheated. It's HIS responsibility to deal with the backlash, not YOU! GOSH! This makes me so angry!",
            "Honestly your step mom and brother should be in jail for the way they treated you. They're both adults it counts as child abuse.",
            "I'm so happy for you. I'm really glad you've finally gotten the time and space to breathe and process everything that's happened. Take time to grieve if you need to, im sure being in that hostile environment didn't let you rest as you needed to. I would like to say that if your step siblings keep tormenting you for something your father did please stand your ground. I'm sure you won't see them often if switching schools works out but a quick \"Hey look, I'm sure you're going thru some things emotionally due to dad cheating and me moving in and stuff but I have nothing to do with it. I had no where to go and I didn't appreciate your hostility. Dad was the one who fucked up. Alienating and bullying someone who just lost their mom is inexcusable considering your age and I no longer consider you guys family\" might let you feel like everything's been wrapped up. I'm really sorry you had to go thru that. An 18 and 14 yr old acting that childishly against someone innocent is horrible. Your dad is not taking responsibility for his actions or his children at all. I hope you find some happiness and peace in your new living situation :) (again, just a suggestion for if you'd like to properly put a close on the situation regarding your step siblings!)",
            "I hope that the only thing that happens to you after being able to leave are great things. Maybe your dad will eventually see that he was simply not trying hard enough for his son. Because he wasn’t. I hope you get the closure you deserve and that the memories of your mom forever live untainted. Maybe living somewhere you can call home is the best thing that could have happened for you at this time. You deserve to feel safe, heard, loved and supported through this hard time. I hope this is something that you will now feel and experience with this new home you are being welcomed into.",
            "I'll be honest OP I feel like B. & J should just adopt you. They sound like they would be amazing parents",
            "I'm happy you got through this, I don't even know you and I'm SO pissed at your dad. Hope he rots in hell",
            "OP sending you so many virtual hugs. This post had all of us in tears. The mistreatment and mental abuse you suffered under these people who should be your support system is nothing short of horrendous, nightmarish, unforgivable... There are not enough words. I hope your Dad one day realizes the gravity of the damage he has done to your relationship, but I completely agree with these other replies - family is what you make of it, and it sounds like you have two awesome Dad's who love you very much and will support you.\n\nAlso, as someone who has also lost their Mom at a young age, know that no matter how many people fail to recognize your grief (or actively ignore it in your case), no one can ever take away the memories you have of her. Knowing that your absolute shit-hole half brother ripped those photos up, I'd encourage you to write down as many of the memories as you can and revisit them with friends who you feel safe enough to share with. I'm sure your Mom is so proud of you for how strong you've been through this ungodly situation.",
            "I’m so sorry this has all happened to you, I was almost in tears reading this. I couldn’t imagine losing my mom and then losing my only pictures of her. I know you aren’t in touch with your maternal grandparents, but would they be able to mail you some pictures? Or maybe do you know any of your mom’s friends? Millions of well wishes for you.",
            "The picture of your Mom is there anyway that it could be fixed? Pieced together and digitally fixed? That could be something to look at. Maybe try asking for graphic artists here on reddit they might be able to help you.\n\nAnd you can make changes to it based on what you remember. Since it all happened fairly recently I'm confident you can remember details of what she looked like.\n\nYou weren't given a place to grieve easily but you are now in a safe place to breathe, rest and sleep, the proposition of going to school that won't hinder your education, and therapy for your mental health. Pick up the pieces and build yourself up. I hope everything goes well for you!",
            "OP, I don't know if you are into it, but one advice that can get you financially ahead and maybe very well on your feet. Learn some programming, it's the biggest market nowadays and knowing english naturally is already good to enable you to work in the best places. It's a nice way to put yourself into the market place and to get you some money to investments and even allow you to maybe contribute with bills and pay back these amazing guys that have taken you into their own home.",
            "I hope your step mom and siblings one day realize they are assholes and hat themselves for it. I also hope one day your dad can own up to his mistakes and apologize for everything he let you go through. I hope your life is all uphill from here, you deserve it.",
            "Your dads friends sound like angels. I hope they take good care of you.\nYour other “family”on the other hand, I would cut them off completely. Fallen on hard times? Eff off. Need a kidney and no one else is a match? Eff off. I hope as you grow, you continue to have loving and caring people around you. May your mom Rest In Peace.",
            "...wow, their dad is just as bad as his half siblings. I hope they realise how fucking awful they are.",
            "sounds to me like you got blessed w two people who truly care about you. \n it hurts when the ones were engineered to love & love us— fail us. \n but you’ll learn like i have — it’s best to find happiness in your alone time & content w your own company. FIRST. \n then- get good at being so turned off by anyone that gives you anxiety or upsets you, that you cultivate your life to have only genuine good hearted people around you. \n sending love 💕 things will look up",
            "You deserve to be safe and loved. Please never forget that. \n\nI'm so sorry for what you've been through and wish you nothing but good things to come ❤",
            "I'm so so happy that you are okay and safe. I read a post elsewhere that had the whole story and all the updates, and your post broke my heart. I'm *so* happy you got out of there and are with two kind humans who care about you. Sending you a huge warm mom hug.",
            "First off I’d like to say I’m so sorry for the loss of your mom and second it’s a good thing that your father’s friends seem to want to love and care for you rather than your family. If you don’t mind me asking there’s some questions I wanted to ask if you don’t mind me asking because when you did post some thing kind of made me wonder. First if you did get out of the school do you feel that after you do that your siblings will try and retaliate against you again if say you flipped them off or told them drop dead just so they can get satisfaction out of getting you in trouble or are they at that I don’t care what you do just get the hell away from me type of attitude? My other question is now that you know that your grandparents refuse to even acknowledge you have you made sure that if and when you decide to strike out on your own to make sure you don’t have them try to find you so they demand you help them even though that they won’t help you? I have the feeling that they are probably going to pull the we disowned you and your mother but we command you to help us in our old age type of routine and I have the feeling that’s what that stepmother yours might try as well. Also one other question is that if you did try to contact them and you’re about to leave do you feel that if you said something horrible to your family do you feel that they’ll try to get back at you were at they at this point just wanting you to just disappear and pretend that you didn’t exist? I’m sorry to ask this but something says to me that your father probably might want you to be there a couple of times in your life just so he can pretend to be the loving father but I would say be careful that you’re half Siblings and step monster don’t try to sabotage anything for you in the future just so they can get their kicks out of humiliating you. Anyway good luck to you and I hope that you at least find happiness again and know that people in Reddit will support you because seriously nobody should go through what you’re going through",
            "I wish the best foot forward. You are a stronger person today then yesterday and tomorrow is a new adventure. \n\nStupid phrases but ones that can help. My life was shit growing up and I’ve made mistakes as an adult. I can say both as a parent and teen that there is no manual. No easy way or right way. Lean in those who show you their heart but stand on your own feet. You can be the best you. Cause you are you.",
            "J and his husband sound more like family than your halfsiblings, dad and step mom have ever been towards you\n\nProof thst family isn't always blood relations, well done for getting out of thst toxic crapfeast, the best kind of revenge now is to be successful, get yourself a beautiful girlfriend, get into uni, in time you will have an amazing job, be successful and they will squirm with resentment knowing they played no part and have no access to your hard earned money yet they will have to see it when you buy your own house",
            "Thanks for the update. Does your mom have any family that might could give you some pictures? Sometimes you can google and find old pics that way. I found some teen pics 9f my brother someone had posted. So glad your going to be OK now. Therapy is a great idea.",
            "im so proud of you, your dads friend and his husband seem wonderful and you deserve to be happy.",
            "Sooo glad things have gotten better. i lost my dad when i was 12, i’m now almost 20, and it was very vary hard. i will say that things get better over time but it will never completely go away. but where you said that you didn’t have any family, is simply not true. your new “roommates” or “landlords” are now your family. if your dad doesn’t reach out, then he doesn’t reach out. J and B are your new parents and they seem more accepting and loving anyway. if you even need to talk to someone you can always reach out to me ❤️",
            "I’d love another update op how have you been?",
            "Hey OP, how are you doing now? I was just wondering what life has been like for you and if you're doing a little bit better now that you're not at your dad's. Hope everything is okay. Your story touched a lot of people, myself included.",
            "Hey! I found this on Two Hot Takes on YouTube and I wanted to ask if you still have the pieces of the pictures I could try to restore them digitally if you send me the scanned pictures. I'd love to help any way I can.",
            "I hope that your dad's wife and kids will get their karma for mistreating you like that. Live better lives then those fucks. I wish you the best, OP.",
            "Now that I’ve stopped bawling my eyes out… ahem. Sounds like you now have 2 great surrogate dads, instead of 1 poor excuse of a man. He & his family should all be ashamed of themselves. Their behavior is disgusting. You are an innocent child in all of this. You did nothing wrong. I have no doubt they’ll get their due.",
            "Also, would love to see an update on how you’re doing now!"
        ]
    },
    {
        "post_id": "pbmywo",
        "author": "Exis007",
        "title": "We call upon Reddit to take action against the rampant Coronavirus misinformation on their website.",
        "url": "https://www.reddit.com/r/vaxxhappened/comments/pbe8nj/we_call_upon_reddit_to_take_action_against_the/",
        "score": 4206,
        "num_comments": 0,
        "created_utc": 1629933365.0,
        "selftext": "",
        "permalink": "/r/relationships/comments/pbmywo/we_call_upon_reddit_to_take_action_against_the/",
        "comments": []
    },
    {
        "post_id": "445fph",
        "author": "wifewithgayhusband",
        "title": "After 12 years of marriage and two kids, my (37f) husband (37m) came out as gay and we are divorcing. I am sick to death of people telling me how \"courageous\" he is and me being expected to go along with it. Is it wrong for me to want to tell them the truth?",
        "url": "https://www.reddit.com/r/relationships/comments/445fph/after_12_years_of_marriage_and_two_kids_my_37f/",
        "score": 4192,
        "num_comments": 317,
        "created_utc": 1454595670.0,
        "selftext": "And edit 3 (I forgot to type this as I was just going to bed): The whole reason I came here was to know how to respond to our acquaintances when they approach me about it being so great Mark came out. This is basically going to be my go to response: \"I'm happy that Mark finally had the courage to live true to himself, but divorces are always sad and unfortunately ours is no different.\" \n\nEdit 2: just realized I could edit after the lock. This is my first gold...thank you so much...this has been amazing at the all the support I've gotten. I don't even know how many private messages I've gotten since the lock and how many people have gone through this or had relatives to through this.\n\n\nThings will be static for a while but when there is news I will post an update. Right now I'm going to go hug my kids because even with all the crap, I never would have had them without Mark in my life and they are my two favorite people in the world.\n\nThank you again.\n\n\nI hope this doesn't get too long, I'm sorry in advance, there are lots of emotions here. \n\nMark and I met in college and had a really great relationship. We dated until both of us finished law school after which he proposed and I gladly said yes. At the time he was much more religious than I was and he insisted we have kids right away and that I stay at home with them to raise them while he worked. I had really wanted to start my practice as well but I could see it was really important to him so I relented and we had two amazing kids and his law career really took off. I was able to work from home and hire help three times a week (with me still in the house) to do insurance and real estate paperwork reviews--it was something but I had really wanted to be a litigator. I was even ok with this and my resentment didn't ever really show unless Mark would remind me that stay at home moms should be stay at home moms and not work at all. \n\nMarriage turned really bad after our second child was born 8 years ago.  We basically became like unfriendly roommates. I pleaded with Mark to go to counseling with me and he would and things would get better for a few months then it would go to crap, I would insist on divorce but then he would remind me that our (his actually) religion does not allow divorce so I would insist on counseling--and the cycle repeated itself more times than I can count. \n\nThen about a year ago Mark hit me with the bombshell revelation that he has been gay since he was a teenager. I was honestly relieved for him because it seemed to explain so much of why he acted the way he did, why he was distant and over compensating with so much. I was actually very relieved that our divorce would finally come and he could live true to himself. \n\nHe moved out, but it turns out he had been having an affair with his much younger partner for about 5 years (the dates on this are VERY sketchy btw because it's very possible this \"man\" was underage when he and Mark started the affair--he certainly was when he and Mark met). I grew very resentful that I was busy working my fingers to the bone to save the marriage to appease Mark's religious sentiment while he was off having sex, technically cheating on me and violating the principles of the religion only he really cared about.  Our kids are also of the age that I could have easily gone back to work but again I stayed at home to appease his desire to appear as the perfect Christian couple--all the while he is carrying on with a younger lover. \n\nMark has also fought me at every turn over the divorce. He doesn't want to pay any alimony even though it would take me years to get my career to where I could support even half the lifestyle the kids and I lead now. He wants to pay bare bones child support and wants the image that we split custody but in reality he makes the effort to see the kids once every couple of months and ignores their calls. He's a great lawyer so even he has to know all he is doing is delaying the inevitable to make things hard on me. In all this time, he's taking sabbaticals from his firm and taking long vacations to places like Tavarua with his boyfriend delaying our divorce even further. \n\nIt happens almost daily, and certainly weekly where family and friends will see me at dinners, the grocery store or restaurants (we live in old farm community that has essentially been turned into a commuter town for the city near by but it retains a very small town feel) and tell me how amazing they thing Mark is for \"living true to himself\" and being so courageous to finally come out. I've gone along with this because I don't want to embarrass either of us. But yesterday I was approached by an older woman from our (old now-thank god) Church who almost \"shamed\" me for keeping Mark in a relationship that he didn't want to be in.  I didn't snap but its as close as I've come. The only people that really know how I feel are my best friend, my Mom and my counselor. \n\nIs it time that I just start telling the truth when I have one of these awkward interactions? I feel that if Mark had left me for a younger woman he'd been seeing for 5 years, everyone WOULD be expecting me to spill the beans on what a jerk he was. \n\n\n   \n**tl;dr**: my husband came out as gay. He'd been having an affair for 5 years while we struggled to keep marriage together. He's now being awful in the divorce but our \"community\" wants me to play along and be supportive of his decision. \n\nEdit: this totally blew up as I was taking kids to school! Wow thank you everyone. Lots of people asking the same questions which I should have clarified in the beginning...sorry about that!\n\n1. I have a really great lawyer as of January and he's working on it. Mark did every shitty divorce trick in the book to frustrate me into settling. It took that long for me to be able to even hire a lawyer in our area. I'm lucky in that I could represent myself in preliminary hearings which in turn allowed a judge nullify quite a bit of the crappy stuff Mark has done legally. Now that I'm going through it first hand, I am absolutely going to go into divorce when I do finally work. I've always heard, but I'm appalled at how the dirty tricks can affect people's lives. \n\n2. I'm not out to ruin him...which is thus far why I haven't spread the talk of his affair. I don't think most people know that he cheated on me...and even if they do...they seem to be more impressed with his coming out. I rationalize that ruining him is not in my kids or my best interest. \n\n3. Lots of great tips and I really appreciate every comment...this was way bigger than I thought and I'm reading all of them. Thank you. ",
        "permalink": "/r/relationships/comments/445fph/after_12_years_of_marriage_and_two_kids_my_37f/",
        "comments": [
            "I'm a gay man myself and that's great for him that he came out BUT...\n\nHe ruined a large portion of your life. He took up your time, your career, your emotional investments. He did all that for what? Because he was too scared to face the truth. YOU ARE JUSTIFIED IN BEING FURIOUS. If my partner came out and told me he was actually straight after building his career while I stayed at home and put my career on hold to help raise our family...The amount of walls and punching bags I would want to go through. Then to turn it around in court and not make right in how he wronged you. I honestly don't know how you haven't told people just what exactly he took from you. If he isn't there for the kids, the kids will figure it out regardless of the custody battle. Coming out doesn't make you a good parent. You were there for them and still are. \n\nYou owe it to yourself to fight hard in the custody battle. You owe it to yourself to move on. You owe it to yourself to set the record straight when people praise him for being happy while you are left in the dust. All those years he knew he was lying and he has no respect for you. Pisses me off just reading about your situation. He's an ungrateful fuck. Someone call Karma and tell her she's hit the jackpot. ",
            "I'm a gay man whose own father came out as an adult, for what it's worth.\n\nI would say that coming out at 16 in Alabama so that you can live your drag princess fantasies at high school prom is brave. Trapping an innocent woman in a marriage (while you cheat on her) because of your own religious self-hate is deeply cowardly. I have a great relationship with my father now that he's out but we had some rocky years around how he treated my mom.\n\nBut your husband is far worse: you owe him nothing and should speak your mind.",
            "You should not feel bad about telling him the truth. Just because he is gay doesn't mean he isn't guilty of cheating and ruining your marriage. There is nothing wrong with being gay....at all, but using it as a cop-out to not face the consequences of cheating IS wrong and he should feel ashamed. He isn't courageous for cheating, he's a scumbag just like every other cheater. ",
            "Check out Frankie and Grace on netflix, about two women whose husbands leave them for each other. There's a great scene where one of the kids yells something like \"I have to pretend to be okay with this because you're gay but what you did to mom was not okay.\" ",
            "Honey,  you have been trying to do the right thing your whole life.  What has it gotten you (not including your kids).  Snapping at people is wrong.  You live in a smaller town so this is how you get the real story out.  You wait until the biggest gossip is around and you break down.  Be pathetic, cry, allow the devastation to come out.  Tell them about the YEARS of cheating, of how he knew he was gay but married you anyway.  That man cheated you out of years of your life while cheating.  Let some of the stories about not seeing his kids but having sex vacations out.  This way you only have to tell one person and the whole community will know.\n\nP.S.  Also, get some damn support.  What you are going through is horrible and you are a victim.  Look, even gay rights advocates like Dan Savage call that crap out.  Get your kids some therapy and start taking charge of your life instead of being the good girl.\n\n",
            "The go-to response should be to give these people a horrified look until they shut up.  If they don't, \"my divorce is a private matter. I don't discuss it with strangers.\" But if you absolutely must respond:\n\n\n\"You are mistaken. It's wonderful that Mark has finally come out of the closet but he wasn't courageous when he pretended to love me, or continued to lie to me about his sexuality. He wasn't brave when he cheated on me the last 5 years of our marriage. I understand why you would praise someone for being true to himself, but he was never true to me in the decade we were married.  Had his lover been a young girl from his office instead of a guy, you wouldn't expect me to praise his courage while having to rebuild my life as a single mother from a marriage broken by lies and infidelity. And if your spouse came out of the closet and walked out of your life, I doubt you'd be as happy about it as you're expecting me to be.\"",
            "You don't owe him anything and can tell people whatever you want. If you have any evidence of the affair you might be able to use that in the divorce for leverage. ",
            "Stop being the perfect wife. Start fighting for your kids and to get out of this marriage. Fight *hard.*  Don't be all smiles in the grocery store. Mark wasn't \"courageous.\" He was all fear at every turn. Couldn't stay faithful to his wife, couldn't divorce her because that would ruin his \"perfect Christian couple\" image, couldn't be a good father to his kids. Cheating on your long-suffering partner is not \"courage.\" Marrying a woman when you know you are gay is not \"courage.\" Nothing he has done has been courageous so far.\n\nThe train for courage left a LONG time ago. And he's still not doing the right thing! God I am just incensed on your behalf. Get a good lawyer and take half. This has gone on for too long.",
            "I'm not sure what advice to give you, but I suspect you came here to vent and for validation anyway. So here it is:\n\nYour ex manipulated you into waylaying your career and having children sooner than you really wanted them. He used you as a beard and cheated on you [with a *child*], while you took care of your family and tried to do the right things.\n\nYour ex is an asshole. More than an asshole. \n\nIf anyone starts in on how awesome he is, I don't think think you need to go into detail, but don't agree either. Maybe just act incredulous and say \"Do you really expect me to be happy that my husband has abandoned me and his children?\" \n\nSeriously, people just don't think. It's the politically correct thing to be happy that gay people are free to come out as gay. And that *is* a great thing in general. But it's so stupid to expect that the mother of his children is actually cool about the impending divorce. ",
            "Anytime people come and talk to you about how courageous he is and how terrible you are, just tell them you wish he would have told you all this before you married,  had kids, and gave up your career. Ask them if they would please drop the conversation,  because finding out he was cheating on you the entire marriage was still hurtful, even after he came out as gay.  \n\nSeriously, fuck that selfish asshole, and if anyone says anything positive about him, make sure they know the entire story.  ",
            ">  I didn't snap but its as close as I've come.\n\nSo snap already.\n\nHe's been living a lie for years at your expense and now he's trying to jerk you around on the divorce terms. Plus:\n\n> an older woman from our (old now-thank god) Church who almost \"shamed\" me for keeping Mark in a relationship that he didn't want to be in.\n\nThis did not come out of nowhere: she's talking like this because HE'S BADMOUTHING YOU ALL OVER TOWN.\n\nUnder the circumstances, telling it like it is almost becomes a form of self-defense.\n\nSo dish - but just remember that you need to avoid seeming vengeful.",
            "Tell the truth. \"I think it's so wonderful that Mark is out and living the life he truly wants.\" \n\n\"I'm happy for him, too. I just wish he hadn't had an affair with another man during our marriage.\" \n\nLike, the closet sucks, but being in the closet doesn't give him cart blanche for his shitty, shitty behavior.",
            "Tell the truth without malice or bitterness.\n\nMost importantly, fight for yourself in the divorce. Don't let him dictate terms.",
            "Say nothing to anyone until you have a settlement. Spend a lot on a lawyer. Reply to gossips with \"I prefer not to discuss it\". Your truth WILL emerge. \n\n(Also, closeted gay is not an excuse for infidelity)",
            "Good lord, I'd just want to clock those people.... Not that you should... But that is so rage inducing.\n\nI would not hold back one iota if someone says shit like that to you . \"Oh yes, he's incredibly brave for lying to me, convincing me to stifle my career to facilitate his facade and raise his kids while screwing around on me. Oh, and he's especially brave for ignoring his children and wanting to give us as little financial support as possible, after everything I've given to him.\"\n\nAnyone who tells a divorced/ing woman how brave her husband is for leaving her (especially since he was unfaithful and its not like you were abusive or something) deserves to be verbally eviscerated. Whatever you say to them, they totally have it coming.\n\nEdit:\n\nUuugh. After reading the other comments.... They are probably right. You should wait until after the divorce is final, so he can't hold it against you. After that, screw em. Until then, if anyone says anything, I would straight up walk outbor hang up before they even finish their sentence.",
            "If your husband's love affair was another woman, he'd be the scum of the earth. Coming out as gay doesn't absolve him from being a dick to you. \n\nThere's a difference between you being upset over homophobic bullshit (which I am not getting from this post) and being angry over how he's treated you like shit for the last ..what, decade? You do what you need to do, and if anyone says shit about you needing to support his decision, well. Tell them the sex of his partner doesn't absolve him of everything else he's done. ",
            "There's a lot of good advice here, so I won't dwell on that. Your husband is a selfish, cowardly, prick, and you are not in the wrong here. Tell the truth. Fight for the alimony and child support.\n\nAlso, he wasn't \"technically\" cheating on you. He was cheating on you. Make sure you get yourself tested.",
            "I don't see why you can't or shouldn't speak *your* truth. ",
            "Not only did he take advantage of you for his outdated religious fantasy but he is a sexist scumbag. You gave up your career which you spent years in school for to be a good mom so heck yeah you are entitled to alimony (and I am very reluctant towards people receiving it). You gave up 8 years of your life where you could have been with someone who actually loved you. It is brave for someone to come out but it is not brave for them to take advantage of someone and cheat on them. ",
            ">Mark has also fought me at every turn over the divorce. He doesn't want to pay any alimony even though it would take me years to get my career to where I could support even half the lifestyle the kids and I lead now. He wants to pay bare bones child support and wants the image that we split custody but in reality he makes the effort to see the kids once every couple of months and ignores their calls. He's a great lawyer so even he has to know all he is doing is delaying the inevitable to make things hard on me. In all this time, he's taking sabbaticals from his firm and taking long vacations to places like Tavarua with his boyfriend delaying our divorce even further.\n\nWhat is your attorney doing??  This kind of nonsense is inexcusable!  If your attorney isn't going to go to the mat for you, find one that isn't afraid to fight this jerk tooth and nail for you.  A long-time family friend went through a similar situation with her ex who as an attorney.  He actively hid assets from her so he wouldn't have to pay more child support.  She has finally gotten an attorney who will actually fight for her.  \n\n**You need the same!  Don't let this 'gay rights' stuff cloud the issue.  Your children deserve the full amount of support due them!**",
            "You can say what you want to people. You were a victim in all of this. Its sad when people cant accept who they are, but its worse when they drag other people into their lies for the sake of keeping face.\n\nMy ex was married to me for 7 years, we have 3 kids together, he wanted a 4th, all for the sake of keeping his \"straight\" persona up for others. It was misery for me, and I ended up in therapy over it.\n\nI recommend therapy for you as well. This is a massive betrayal and upheaval of your life, you have been living a lie just as much as him, even though you didnt know it. It takes a toll. Dont be ashamed of being mad or upset or anything else, but do get help for yourself.\n\nI wish you much luck with the future. This isnt the end, you will find happiness. internet hugs to you.",
            "You appear to be surrounded by assholes. Seriously, what sort of person approaches the spouse of a recently out husband and talks about how great it is? \n\nAre they assuming you've been a willing beard all these years? Even then, it's ridiculous for people you aren't close with to bring it up casually. \n\nI don't think you owe anyone anything and I bet if you told one of these people what you just wrote here it would get around to everyone and you wouldn't have to deal with it anymore... But...\n\nWould rumors that you're gossiping about this sort of thing potentially damage your case in your divorce proceedings? As a lawyer you're far better able to answer that than I.",
            "Mark's a selfish asshole. He's also gay. These things aren't mutually exclusive. He can be brave to come out and be truthful with himself and the world, and he can also be a philandering, self important sack of shit as well. People are complicated like that. \n\nBasically, Mark's got some fucked up stuff in his head from religion and being closeted, but he went out and fucked up your life to keep his own lie going, and he's been absolutely selfish and cruel to you in this. Fuck him, fuck his boy toy, go to the mattresses and crush him. Line up everything you can on the boyfriend and their long term affair, go for full custody, rake him over the coals. He hurt you, he lied to you, he's been dragging it out. Tell everyone the truth. Show them your family is collateral damage in Mark's self indulgent closeting and coming out, and none of that DOESN'T make him an asshole.",
            ">He doesn't want to pay any alimony\n\nWell then it's a good thing that decision isn't his to make.",
            "Courageous would have been accepting his sexuality from the beginning *instead of* getting married to try to deny it.",
            "He knew he was gay before he met you. Despite that he made a conscious decision to marry you. He misled you, forced you to give up your career and cheated on you. You owe him nothing in my opinion.",
            "It wouldn't benefit you at all to respond in a rude manner.  Although it might be personally satisfying, it just ends up making you look bad.\n\nThat said, you need to stop being the obedient wife who is going to let her husband dictate the terms of the divorce.  You need to get the best divorce attorney you can.  And you need to insist on getting the divorce settlement to which you are entitled.",
            "Fuck him. He lied to you for 12 years. Go to a therapist. This shit is fucked up.  Maybe *one day* you'll be able to be okay with this, but FUCK! TWELVE YEARS!?\n\nI understand that you probably shouldn't throw your glass of wine in the face of anyone who calls your lying cheating husband brave... But you should allow yourself the space to feel how you need to feel... Maybe dump those friends, find a therapist and take up kickboxing or something.",
            "Mark wants...\nMark wants...\nMark wants...\n\nAlimony and child support are often calculated by formula (varies by state).  If you live in an at-fault state, his infidelity might increase the amount (BTW, it's not technically cheating, it's actual cheating).  Take every penny the law allows -- nothing more, nothing less.\n\nTell everyone the truth.  This man deceived you in so many ways.  He does not deserve to have his reputation spared.  His crime isn't being gay.  It's being a cheating asshole that is trying to manipulate and take advantage of his soon to be ex-wife who dutifully stayed home at his request all of these years.",
            "You don't need to save face for him. As a queer guy myself I'd say what he did wasn't right. If he found out he was guy after you two were married and he approached the subject quickly and maturely fine stuff like that happens. But he shouldn't have married you let alone cheated on you. You have a right to be a little bitter and not have to lie to cover his ass. It can take a lot to be yourself but he should have known he was pulling you into his mess years ago before you got married and respectfully bailed. Better to be single than drag someone else down with you. ",
            ">Is it time that I just start telling the truth when I have one of these awkward interactions? I feel that if Mark had left me for a younger woman he'd been seeing for 5 years, everyone WOULD be expecting me to spill the beans on what a jerk he was. \n\nGo ahead and be honest.  He cheated on you and left you for the affair partner.  That is horrible and wrong no matter what age/gender person he was cheating on you with.\n\n(((hugs)))\n\nYou don't have to ruin him - he did that to himself.  Have some sort of stock answer prepared to counter the \"he's so brave\" crap like \"Although I wish him well, when he cheated on me and left me it made life very difficult for me and our children.\"\n\n\n",
            "He sabotaged your life. You gave up spearheading your career and gave him children on his terms so he could hide his sexuality while he cheated on you and pursued his true interests. He shamelessly used your time on this earth for selfish intentions. Fuck him and fuck them. I hope you're able to recoup the financial and personal losses from making those sacrifices for him. I'm amazed at how level headed and kind you've been about this. ",
            "Yeah, go ahead and tell the truth. I would start with \"You know what? Mark *is* being true to himself now. Unfortunately his true self is not a very good person. Not only did he cheat on me for over five years with an underage person, but he's also proven that he has little regard for our children. He sees them once every month or two and otherwise ignores their phone calls. He's dragging out the divorce and is only willing to pay a tiny fraction of what he should in child support. He's taking extravagant vacations with his lover while I am left here caring for our children alone and trying to get the career he refused to allow me to have on track. If people think he's the brave one of the two of us, it's because they don't know the truth. The truth is for the past eight years our relationship has been terrible and I was the only one who tried to get it back on track with counseling. When that didn't work I offered him the out of divorce, but he refused time and again and instead kept me trapped in a loveless and lonely marriage while he got his emotional and sexual needs fulfilled elsewhere. That isn't brave, it's selfish.\"",
            "Courageous?\n\nNo. He's a fucking coward. Not once in his entire fucking life did he admit to himself that he was different. He's a coward and a liar. \n\nFor nearly two decades he has lied to you. He has lied to you and himself because he was afraid of what he was.\n\nHe isn't to be respected. He's to be pitied.\n\nThe courageous ones are the ones that come out when they know the reaction will be negative because they're telling the truth about themselves, not when they've lied to everyone they know.\n\nWhat a peice of shit.\n\nI don't know how far along the divorce is but you take back every second of your life you spent on him while you still can.",
            "I wouldn't say anything to these folks defending him.  \n\n\"I can't comment as the issue is a matter of ongoing litigation.  My highest priority is making sure my children are taken care of.\"",
            "Er... Also get a lawyer. Don't let him screw you over with the alimony just so he can *still* look good. Dude seems awfully hung up on appearances and cares very little for your needs. You do you. Let him do him. But get a lawyer.",
            "You do not have to cover for him or his image. If someone asks, just tell them the truth. Personally I am gay and even I condemn what he's done; he KNEW he was gay when he married you and cheated you out of years of your life. I'm so sorry, and I hope he pays the price for what he's done. ",
            "Courageous would be 'coming out' over twelve years ago.\n\nA distant second would be admitting he has been cheating for probably over half the time you were together.\n\nThe way I see it, you suffered through his actions and continue to do so. You shouldn't have to suffer from others' also. Correct them and disagree with them, what have you to lose?",
            "Your soon-to-be ex is a selfish asshole. I'm a gay man, and despite the incredible pressure (hard core Mormon) to get married and have a family I could never fathom putting a woman through what you have been through. He may have reasoned himself into this, and made the mistake of getting married to a woman, and I think you could forgive him for that part. But his actions now are so completely self-centered that I have absolutely no respect for him. We are not all like this!\n\nGive it time. People will easily catch on to the truth.",
            "this is like the show on Netflix grace and frankie",
            "You sound like a kind woman, so you'd be fine by simply responding to people: \"There's nothing courageous about cheating on his wife and lying to his family\" that should do, and that's not even an attempt to \"destroy\" him, it's just the truth. Stay strong. \n\nAnd btw, something I'd do (not being as kind as you seem to be) is telling those people to go fuck themselves. How fucking shitty of them to tell YOU, who just lost a lot of time on that lying asshole, that he's being courageous? You don't need these people in your life. \n\nEdit: I'm so mad that grammar",
            "He is not courageous. He's a fucking coward. He knew from well before you started dating he was gay, but STILL married you, STILL forced you to have kids, STILL forced you to have no career... and hid behind your back fucking some dude because he was too scared to just tell people he was gay. That's shitty.\n\nI think you are absolutely allowed to tell ANY and EVERYONE the truth. If he's going to taint your image then you can taint his. Next time someone \"shames\" you just say \"Well had I known he was gay and with another man for 5 years of our relationship I would have let him go sooner\".. or next time someone calls him courageous just say \"Well, it would have been more courageous for him to tell me he knew he was gay since he was a teen before he started a relationship with me\". ",
            "You can call someone out for being an asshole if they are being an asshole, regardless of their sexual orientation. He's behaving like an asshole towards you and you can respond appropriately.\n\nHis orientation isn't a factor in his behavior during the divorce, but if 'living as his true self' is more important than seeing and providing for his kids, you can tell people about that. He's not a saint here and doesn't deserve anyones praise or admiration and you have every right to make that known.",
            "Coming out as gay =/= good person. Tell people the truth. He's being an asshole.",
            "What? You're not spilling the beans because he's gay? Huh? He's a jerkbag, tell whoever you want.",
            "\"I suppose coming out was brave. Too bad it was preceded by over a decade of cowardice and lying.\"",
            "You look at the stars",
            "\"I'm really happy that Mark had the courage to come out and that he can live openly as a gay man. I do wish he hadn't spent 12 years lying to me, starting a family with me, cheating on me, repressing my career and now trying to get out of this marriage without supporting myself and our children like he should after all the hurt and lies he put us through.\"\n\nJust say it sadly. Let a few tears fall. These people need to know there's another side to this story and that you're genuinely hurt and angry. It may seem like over sharing but hey, if they think they know it all anyway and you're not getting into specifics.",
            "I'm going to paint a different narrative. One of a young woman who gave up the idea of a career and dreams of entrepreneurship to be a stay at home mom to the ma. Of her dreams. Allowed only the time and luxury to practice her craft on a very limited part time basis, she worked for years more to be a devoted wife and mother while being active in their church community. \n\nUnfulfilled, she spent years trying to uphold the image of a perfect family but underneath was a pool of loneliness caused by a husband who, unbeknownst to her, was leading a separate life including sexual encounters with other men. Still, she fought and attended multiple therapy sessions trying to fix problems with no idea of the real issues: the man she gave everything up for, whom she was continually trying to make happy, was not in love with her at all and cheating on her. \n\nAnd now, eight years after her last child, he's decided he wants to make his absentee father status official, as he attempts to live his authentic life as a selfish, inconsiderate, manipulative person. He's trying to ignore your needs, all you gave up, and responsibility over his children. But yay for authenticity? \n\nPrint that shit out. Wear it on a tshirt. You spent years trying to keep up appearances, living a lie. If he gets to live his authentic experience, you do too. And that doesn't include indulging the fantasies of Mayberry. ",
            "In my personal opinion, it does not matter what kind of background you have. It's always wrong to cheat and even more so while being a hypocrite. He's not courageous, he's an a-hole. You on the other hand is nothing but incredible. You keep up a good facade for the sake of others and deal with your emotions in a very mature way. I respect you for that.",
            "You're the courageous one taking the high road and loving your kids.  Power to you.  Fuck what those other people have to say.",
            "First of all, I am so sorry that you're going through this. What a heartbreak and pain in the ass. I found this part of your post perhaps the most interesting to ponder:\n\n > \"...if Mark had left me for a younger woman he'd been seeing for 5 years, everyone WOULD be expecting me to spill the beans on what a jerk he was.\"\n\nThis is so very true. If he'd have left you for a woman, you'd have people intimating that you perhaps didn't know how to keep your man satisfied, or that he got bored, or that he has a wandering eye. But I suspect no one has said any of that to you about this situation. We are still on the new side of being PC and accepting of gay as mainstream and as such, few are afraid to separate infidelity from who they cheated with. Instead of people treating you like you \"failed as a wife\", they're treating him like a cultural hero (maybe in a way, that is a good thing).\n\nThat must add so deeply to the embarrassment, sadness, and frustration that even a basic breakup brings. I hope that your counselor is great and s/he makes you know that this has nothing to do with you, and no amount of quality relationship would matter. Even if he left you for a woman, your relationship was not meant to succeed. There is, oddly, comfort in that if you can find it. I'm sure that seems oversimplified and I don't mean that at all, in my personal experiences, dusting off and knowing you tried your best is sometimes all that can get you some peace in the dark spots.\n\nCan you claim fraud? I don't know anything about law, but he convinced you that he was one person when in reality, he was someone else and not just in his head and heart either, but in a bed with another person. ",
            "He burned you in life and tried to put extra in on the divorce so I would burn him for everything he has.",
            "Fuck that...he lied and deceived you. At that point the reasons why don't matter.",
            "Gay people can be shitty just like anyone else, he doesn't get a pass.",
            "I wouldn't run around town telling strangers the sordid details, but I'd absolutely speak up when someone says something. You're not being vindictive, you're setting the record straight. Your husband cheated and lied to you for years and now, after you gave him two children, he's trying to destroy you in court. He's abusive.\n\nBe careful not to get into it with your kids though.",
            "His cheating was horrible.  It was him being dishonest about who and what he was.  Stop playing the nice guy.  Tell people what he really did and if they say he was courageous, counter them and say that cheating is NEVER courageous!  Go for the alimony and the max child support allowed.  Get the state to collect the child support directly from his salary.  Don't play his game anymore, make him play yours.",
            "You don't have to let people get away with presuming his innocence and perfection. There are phrases you can use that imply much while saying little: \"there was a lot more going on than you know about\". But myself, I'd be inclined to sarcasm: \"oh yeah, 5+ years of cheating on your spouse is soooooo noble and brave\"\n\nAs a lesbian, I really hope you nail his ass thoroughly. We don't like his kind. Good luck.",
            "Maybe write to Dear Prudence or someone similar including the details here. Then mention to a group of friends you've written in and they can read everything themselves and the written version won't disappear or be as easily twisted.",
            "I wish you could sue him for fraud, but there's already enough bitterness to be had in this situation, and I know you don't want to put your kids through that.",
            "Oh man. Your first step should be documenting every single bit of this and retaining a good attorney. He does owe you alimony, and any respectable judge will order him to pay it.\n\nFeel free to tell people how you really feel, but do so in a respectable manner. Chances are people actually already know, they are just unsure how to talk to you about it. ",
            "You have every right to be upset and tell the truth to people about his betrayal. And if he really isn't keeping up his end of the bargain in terms of seeing the children, you should revisit your agreements in terms of custody and support. If he's paying the bare min., while the judge thinks that he's supposed to have them half the time, you're being taken advantage of, full stop. \n\nYou should NOT let some stranger shame you for his misdeeds. I don't know how you could handle a convo with that old lady without speaking your truth. ",
            "Tell it like it is. He's not courageous, he's a coward who lied to you strung you along for more than 12 years. He cheated on you and does not deserve any respect.",
            "Did people really come out to support him in front of you? Cheating is cheating. It seems very odd. Tell them you have no problem of him being gay but cheating and sleeping with a minor is never okay.",
            "God would want you to tell the truth. ;)",
            "Is this ground for disbarment?",
            "\"It's good he stopped living a lie, but at the same time, it is very hurtful for the children and me.\"",
            "> I've gone along with this because I don't want to embarrass either of us.\n\ninstead, say: \"Actually, he cheated on me for five years with his gay lover.\"\n\nWhat's done is done. Now make sure that he reaps what he sows. I imagine the cheating has to help you with alimony, right? It blows my mind that he would even be able not to pay you any money given the situation you've described.",
            "I think it's incredibly selfish of him to marry you, create kids, and then leave. It sounds like he's known that he's gay since he was a teenager. He really shouldn't have wasted so much of your time. ",
            "This post made me so angry. You're a freaking saint.",
            "He isn't courageous.  Courage would have been standing up to his parents and his peers when he first realized he was gay and telling the truth then, not using his wife and family as a shield to protect him against societal judgement.  He cheated on you, period end of story.  It doesn't matter that he is gay.    \n\nEvery time someone mentioned how courageous he was, I'd ask which part they thought took courage, the cheating, or the lying about his sexual preference?  ",
            "This has nothing to do with him being gay and more to do with him being a crappy person. I would definitely tell the truth and start living your life in honesty not covering up how crap he is. Fight the battle, he should pay alimony and you should get full custody. No more lies, tell everyone exactly what happened and cut the people who shame you, you don't need them in your life.",
            "You're not obligated to keep his secrets. He's treating you like shit and doesn't deserve the amount of kindness you've been giving him by keeping quiet on what kind of person he really is. ",
            "He didn't *technically* cheat on you. He cheated on you. Bottom line.",
            "He's controlling the message, portraying himself as both victim and hero.\n\nHonestly I'd tell it like it is when people ask or you hear about his bs.\n\nIn the mean time if he's going to be a colossal asshole, let him, make sure you get a reasonable custody arrangement and get the alimony and child support necessary to move forward.",
            "fuck Mark, hope that helps. Sorry you married a doucher.",
            "Oh, WOW, I'd be PISSED! what a fraud. He lied to you when he married you. He expected you to comply with his values/religion and then he pulls this on you? He's lucky to have you, I'd have skinned him alive",
            "I feel for you.  I know some people similar events have happened to--including someone who faked amnesia and disappeared for 16 years, leaving wife, daughter, and parents thinking he was dead.  I think the people who are making comments to you about how courageous he is just aren't thinking about what you went through, and are being thoughtless.  \n\nHe will probably be just as selfish with his new boyfriend in the long run as he was with you.\n\nI don't know what I'd say in your shoes to the uninformed people who make comments implying that you kept him in the marriage against his will...ugh that would be the worst...but I agree with the poster who said your children will figure out who loves them and who's selfish by their actions in the long run.  \n\nI am sure the next chapter of your life will include the love and opportunities life owes you.  And I hope that in time, the people failing to consider how you must feel come to their senses and get an empathy transplant.  ",
            "Please forgive me for my ignorance, but, how is a person able to lie about their sexuality for so long? I find it mind boggling that one can put so much mental and emotional effort into living a lie, and taking a toll on his or her loved ones. OP, did you ever have any inkling that he might have been gay in the early years? I'm so sorry this is happening to you... :(",
            "That is a very rough place to be in. I'm sorry you and your kids are dealing with this bullshit.\n\n\nWhile his behavior IS deplorable and what he has done and is doing is wrong... be careful here. Watch what you say and how you act... for a few reasons:\n\n1. If you tell the truth, most people probably won't believe you, anyway. People see what they want to see, and these people want to see him as a courageous man, finally able to show his true self... They do NOT want to see him as a cheating sleazebag who had an affair with a younger man, threw religion in your face, and is trying to shirk his responsibilities. EVEN THOUGH IT IS THE TRUTH, if you try telling that to anyone, you'll come of as bitchy, bitter, and angry and they will only think him an even better person for staying with you.\n\n\n2. He's a lawyer. If you say anything \"unpleasant\" about him and word gets back to him about it, he can use that against you. He can claim slander or defamation of character. Don't give him that weapon.\n\n\n3. That kind of thing will eventually also get back to your kids... That's not good. Let them form their own opinions of 'daddy' without your input. ",
            "engage a fucking bulldog.  Hire a PI to comb through phone records and anything else.  \n\nHe's going to pay through the fucking nose. ",
            ">technically cheating on me  \n  \nHold the phone right there. Were you married at the time? Yes.  \n  \nDid he engage in an illicit/sexual relationship *outside* of your marriage? Yes.  \n  \nHe's cheating. Call it what it is. It doesn't matter if it was with another woman, man, or transgender. Engaging in ANY sort of romantic/sexual relationship IS cheating.   \n  \nOkay, he came out that he was homosexual. But aside from that, he screwed you over. Literally and figuratively. What he's engaged in isn't just morally wrong in the Biblical sense, but seriously has to be breaking the rules/law surrounding a marriage (both in the homosexual/heterosexual sense).  \n  \nHoney, you need to take him to the cleaners. Fuck that guy. Any Judge with ANY sense of the rule of law should see this in your favor.   \n  \nAnd don't sugar coat this. You need to report the facts to whomever talks to you. Period end of story. You're not gossiping, you're stating a fact. He engaged in a sexual relationship OUTSIDE of his existing marriage with YOU. THAT IS NOT OKAY.",
            "Which branch of Christianity prohibits divorce but also celebrates homosexuality?\n\n>It happens almost daily, and certainly weekly where family and friends will see me at dinners, the grocery store or restaurants (we live in old farm community that has essentially been turned into a commuter town for the city near by but it retains a very small town feel) and tell me how amazing they thing Mark is for \"living true to himself\" and being so courageous to finally come out. \n\n\nI'm honestly shocked at how dense and insensitive people are being to you. Seriously, what the fuck. Regardless of how they feel about Mark's \"courage\" to come out, they have to know that even under the best of circumstances finding out that your husband is gay is a pretty melancholy event. \n\nI would just be honest with them. You don't need to \"ruin\" him but you certainly shouldn't be protecting him either. ",
            "It's your truth too. You have as much right to it as he does. Tell whoever you want, whatever you want.",
            "You appeased him for 12 years. Fuck what the community wants, you need to take care of yourself and your kids. All that time is dead.\n\nYou tried counseling, and meeting him halfway and he rolled over you.",
            "You need to get your side of the story out there or he will tell the only story people hear.  Don't let this man dictate your life any further. ",
            "He made the choice to cheat on you instead of divorcing you first. If I were you I would hire the best lawyer you can find, a real shark, and take this guy for every penny you can. \n\nYou've spent far too long takin care of his needs. Now it's time to take care of YOU. ",
            "He's been using you to prop up his image to your detriment, your entire marriage. Nothing about that is changing. Now he's telling everyone that you trapped him in this life, made him have kids, made him support you as a stay at home mom, etc. He's doing that because he doesn't want to pay alimony so he wants people's sympathy, so that they will support him in screwing you. I know you're keeping quiet because everyone will write you off as crazy if you badmouth him. But you're not winning by just getting him get away with this either.",
            "Just wanted to give you an internet hug *hug hug hug hug* \n\nI have no advice, but that is totally shitty of him. You sound like a very strong person. I have no doubt that you will come up on top when most of this is over.",
            "Just a side note... there is a show called Grace and Frankie with a very similar storyline... may help to watch and see how the women deal with it.",
            "I do not find it courageous that he hid behind religion and punished you for his \"in the closet\" frustration by pushing his guilt onto you (making you a stay at home mom).  Lying to someone for 12 years, having children with them and deciding to come out and do what he did is NOT OK.  This is coming from someone in the LGBTQ community.  It is not ok he lied to everyone and it is not courageous that he came out now that he has a younger thing to have sex with.  This is no different from a man sleeping with a younger woman.\n\nIf I was confronted by anyone about him coming out I would be soooo passive aggressive honestly.  I would tell them about the affair, you do not need to say his age or even that it was with a youger guy.\n\n>But yesterday I was approached by an older woman from our (old now-thank god) Church who almost \"shamed\" me for keeping Mark in a relationship that he didn't want to be in.\n\n\"Mrs. Whateveryournameis, I did not shame him.  He just recently told me he is gay because he has been having an affair for five years.  Please, have a blassed day!\"",
            "You're very mature on how you're handling all of this. I dated a guy who was still figuring out what he was (gay, straight, bisexual) and I was pissed that hr would embarrass me by making out with guys behind my back. Lucky for me, people didn't talk to me about him like how your town is to you. Thank you for being and staying strong and being a smart person on handling everything! I applaud! :)",
            "You owe your kids to have a working relationship with their father. It doesn't mean you like him. It just means you never trash talk him to your children until they are adults and ask themselves. \n\nYou can hurt kids by dragging them into the emotional battles you have with parents. So as long as you can hold onto your tongue in front of the kids... then tell people what you want. \n\nYou might want to wait until you are fully divorced before you unleash your hurt upon the world. \n\nHowever, you don't need to lie about what happened. \"He cheated on me and that is why we are divorcing.\" That is the truth.",
            "I know this is r/relationships, so I should tell you, yes honey! Shame that bastard! Smear his name through the mud and vindicate yourself gurl! Do it!\n\nBut that would be terrible advice. The correct thing; the only thing; would be to do what's in _your kids' best interest_. And no, humiliating their father is not in their best interest. Whatever will least disrupt their lives is what you need to be doing. Show them with dignity how to take the high road, and how to handle devastating situations. Don't show them pettiness, eye for an eye, retaliation. ",
            "I'm sorry this happened to you! It's not your fault he is gay. You will get your divorce and get back on your feet the people that think he is courageous are ridiculous. He promised to love and protect you til death that means alimony and anything else you need at least till you are remarried. Stay strong.",
            "What he did was not courageous. It was cowardly and hypocritical and cruel. Fuck him. I'd tell everyone the truth. And I hope you take him to the cleaners with alimony and child support. Seriously. He owes you. ",
            "OP, I'm so sorry that happened to you. I had an ex-boyfriend who came out as gay last year, and it was really hurtful to me. I can't imagine what you're going through, my ex didn't cheat (to my knowledge) and we only dated for three years, your situation is so much worse. I agree with what other commenters have said - if you feel up to it, just tell the truth (in the calmest way you can) the next time someone makes a comment. \"He cheated on me, he made me give up my career, he wouldn't let me divorce him, etc\". I'm really sorry for what you're going through.",
            "Tell them the truth.  Doesn't matter if he cheated on you with a man or a woman, he cheated.",
            "Why protect him?  What he has done to deserve that level of compassion from you?  Tell the truth.  Vent.  People shame you, tell them what's up.\n\nAlso, get yourself a shark of a lawyer.  Don't let him cheat you out of anything or prolong this mess.",
            "Why the hell are you protecting him? He's not brave, he is fucking scum. Being gay doesn't change all the shit he put you through.",
            "Fight him for everything in court, next time someone talks crap just say yeah great for him, but not me he wasted a large portion of my life, career, and dreams with his denial, then just walk away.",
            "OP, you need to stop. \n\nStop making excuses for him. Stop making things easy on him. Stop capitulating to his religious beliefs. Stop being manipulated by his lies, half-truths, and deceits. HE IS TRYING TO FUCK YOU FOR THE FINAL TIME. \n\nYou need to hire the best divorce lawyer you can and only communicate rough the lawyer. Gather EVERY piece of evidence you have/can and make sure you have every piece of ammo you can find. Log ALL interactions and log EVERYTHING you know about his cheating and constant vacations/living it up. DO NOT capitulate to this asshole. Yes, he's an asshole. There's nothing wrong with being gay and yes sometimes societal pressure gets someone married to a gay guy, but to have ZERO remorse for you and your loss is awful. Don't just do this for you, do it for your kids' wellbeing too. Him wanting to not pay alimony is him wanting to fuck over your children for this new guy. \n\nAnd if you can nail down when he started dating this guy DO IT. Make it as clear as possible that he dated an underage guy. That goes to his lack of judgement and will be in your favor. \n\nYour marriage is over. It sucks. I'm sorry. But it's time to harden up and lock this shit down. Stop thinking about him and think about yourself and your kids. THIS IS A TIME SELFISHNESS IS WARRANTED. \n\nGood luck, OP. ",
            "Spill the fucking beans to everyone.  You have nothing to lose, I don't know why you feel the need to keep quiet.  Tell anyone who approaches you that's he been having an affair for the past 5 years with someone 15 years younger.",
            "\"Sorry,  I'm a bit confused.   Knowing I'm in in the middle of a divorce,  did you really just go out of your way to tell me how great my STBX husband is?\"",
            "What about that fact that you were married under false pretenses? He lied to you in order for you to marry him right? Isn't there a legal angle there?",
            "People are idiots. That woman who tried to shame you does NOT know you or the circumstances you're dealing with. Fix that.   But you can only control what you say, not how they react. Set people straight with your side of the story as clear as possible without breaking down under the emotional strain. ",
            "My response would be \"I've been trying to get him to divorce for ages!\" and see how she responds.",
            "Wow. Fuck this guy. ",
            "What a self-centered asshole. He did all of this to keep up appearances in the religion he belongs to, not so he could actually live a life the way he believed was moral. That's my rant to show how bad I feel for you, and what a scumbag your ex is. As for people approaching you with these comments: They are being really rude and insensitive. I would never make comments about a friend or loved one's divorce unless they asked for an opinion. At this point, I wouldn't blame you for gently correcting them. You can do it without elaborating too much if it's someone you don't know well. Something like, \"actually, there is a lot more to the story and I don't really wish to discuss this further, as it has not been a good experience for me.\" Then if anyone is tact less enough to press for further discussion, you end the conversation and walk away/hang up/ stop responding. If it's someone close to you, go ahead and tell them the whole story. There is no reason your own family and close friends shouldn't support you when youve been screwed over. Just leave your kids out of it. You dont need to badmouth their father. They are already seeing who he is when he ignores them for weeks at a time. Then invest in a shark of a divorce lawyer. It'll be worth it.",
            "You would be completely in your right to put anyone who presumes to discuss your marriage with you in their place. People should show some fucking respect and not bring up the subject of your painful divorce unless you indicate you want to talk about it. \nThey should especially not be praising your ex for leaving the marriage to your face. If they want to go on about how great he is, I don't think his recent ex-wife is the one to be blabbing it to. That's just basic tact and common sense. ",
            "Stop pampering him! Everyone around you is. How new agey and progresive of them. He ruined so many years of your life and now people come to you to say how glad they are he's happy? Hell no. The truth must out, you are the victim here.\n\nI would also advice you to use all that knowledge to blackmail him into providing your kids with the lifestyle they are used to. Yeah, that's just me being outraged, I'm more of an live and let live, glad it's over person and you seem that way too, but I really wish I could be vengeful sometimes. If you can find it in you, do it. ",
            "Depending on the state you live in he is completely responsible for that child support based on his wage. You are also entitled to it. I work in the courts and ha be remanded more dads than I could count for failure to pay. If you get in contact with the child support agency they can give you more info. You have to cooperate with them though. That's a major factor in determining that. Lawyer or not legal talk can only go so far. When the judge tells me to take them to jail, I take them to jail. I'm sure he knows this.\n\nAlso, if you two were having sex at all, please get yourself checked out for your own health. ",
            "I want you to know that you are not alone. My father committed suicide and we found out after that he was carrying on a relationship with another married man. My mom participates in a group called the straight wives club. Might wanna give that a Google. There is also a book called Gay Husbands, Straight Wives that you might be interested in. I don't personally agree with everything the author feels about the nature of homosexuality (she believes there is no such thing as being bisexual for instance) but there is some good information in there that may help you understand some more. My thoughts and prayers go out to you. Hang in there.\n\n\nEta: Don't keep his secrets for him anymore for the love of God. He doesn't deserve that courtesy. You did everything expected of you and got lies in return.",
            "So he's been gay since he was a teenager but still married you and strung you along for years? I'm probably going to get shot down for this but he is a DISGRACE. I'm not homophobic but this man has had you living a lie. Believe me there are good men out there but his deceiving ass isn't one of them. Lying and cheating..enough said. The fact that he came out is minor detail and it's scumbags like this that give all men including decent ones a bad name. There will be lots of nice people out there to support you and I feel for you in a difficult time of your life. Get over this lying, cheating excuse of a human being and then grab life by its horns and enjoy yourself. Peace x",
            "While you're battling through this divorce keep reminding yourself that he willfully used you for 12 plus years. I'd say he may have even been using the children as well... like props for the lifestyle he wanted to present. Anything coming to him is something he brought on himself, so you shouldn't hesitate to gut him in the divorce if it means taking care of your children.",
            "that's really not brave\nall it proves is he's a chronic liar",
            "He's a coward and what he did was despicable. ",
            "Be mad, you have every right to be upset that he screwed you professionally and then wants to be a dick about it. Fuck that shit, break stuff. Go get a bunch of cheap mirrors and a baseball bat. Fish tanks are also fun to vent anger on. And what fucking church do you go to where they take the gay guys side for breaking your heart? Thats the craziest thing to me in this.",
            "You have a weird-ass church. I don't have more advice. I certainly believe in attending churches where gays are affirmed, but I believe in attending *Christian churches* which see marriage as sacred union, not something done out of convenience to deceive an innocent and loyal partner. ",
            "Not that you ever needed to, but certainly now you don't need to do anything to appease him. Carrying around the stress he's continuing to put you through isnt doing you any favors. What he's doing doesn't make him courageous it makes him selfish. Everything he has done is self-serving. From marrying you, keeping you home & now this. Go ahead & snap & don't feel guilty for it either. Then go buy some bubble bath & a bottle of wine! You deserve some time to be concerned with your own feelings, take it.",
            "I JUST WROTE THIS ON ANOTHER POST NOT 6 HOURS AGO!\n\nKnew a chick, and she was marrying a gay guy, and everyone was like \"WTF? But he's gay, I don't get it.\" And that was the truth because no one did. Then she found out he was gay, because he was gay, and they got divorced, and then she was like \"why didn't anyone tell me?\" like it was all our fault. ",
            "What he did to you was horrible.   What IS awesome is that now you can stop living a life you don't want because of someone else.  Once you have the divorce proceedings behind you, I hope you figure out exactly how you want to be living your life and do that, and don't sacrifice huge things for someone else again.  Your next partner needs to be someone who wants you to do the things that are meaningful to you.  It'd also be a good idea to figure out how to work through the immense anger you must be feeling.  It'd be too bad if you lost years more of your life to Mark, but this time because you are too focused on the anger of what he did to you to move on.\n\nThe best revenge is living well.  Figure out how to be happy, move on and have the life you want.  Leave Mark behind. ",
            "That's fucked up for people to say that to you! I can't believe anyone would blame you for repressing him. Did it seriously not occur to anyone that you're shaken up over this?\n\nYour husband is a cheater and a liar, not a hero.",
            "Next time someone tells you he was courageous, tell them \"Oh yes! Very brave of him to risk our sexual health by sleeping with another man wile I had no idea. Really, I could have died of AIDS and had no clue! How brave!\" \n\nSeriously, he doesn't get brownie points here for his \"bravery\". He doesn't get to hide for years, to *cheat* on you, to waste *your* life making you be part of a religion you don't believe on, try to keep you from living your life.... and get called \"brave\". \n\nIf he had cheated on you with a younger woman, how would you feel? How would anyone feel? He doesn't get a fucking pass for being a massive smeghead just because he was in the closet. \n\nHe didn't choose to be gay. But he chose to fuck up *your* life. He chose to bring children into the world that he no longer wants to deal with. He **chose** to cheat on you. \n\nHe is a scumbag, and honestly, the whole world should know it. He's not brave, he's a fucking coward asshole. Being gay won't change *that*. ",
            "The asshole cheated on you (doesn't matter whether or not it is with a man) and is now trying to make life hard for you. Fight fire with fire. Fuck that guy. ",
            "I don't think it is advisable to \"snap\" if you can avoid it, but I also think the simple answer here is you should just tell people the truth. \n\nIf someone asks what happened between you two, or where he is, tell them the truth.  There is no reason to protect Mark from the consequences of the bad decisions he has made at your expense. ",
            "You're right to be mature about it, but he screwed you over and there's nothing wrong with telling the truth. You don't owe him shit.",
            "If you need others to know the truth in order to keep sane, tell them the truth. I do think it would make you feel better, but be selective about who you tell and be blunt. The others need to be given a look that says they should mind their own business.    \n\n\n\"I helped support our family while he spent the last five years of our marriage cheating on me. Now I'm still supporting our family without him. You can support him now.\" ",
            "I'm reminded of the Episcopalian priest who abandoned his family for another man and got nothing but support from the media for obvious political reasons. Good luck ",
            "I imagine a lot of people in your life don't know all the details. The 'juicy' detail that he is gay and the divorce is part of coming out is the one people are most likely to know about.\n\nIt's possible that people think that he was a good person throughout this ordeal. That he was struggling with his own identity, finally was able to be honest with himself and you, asked for a divorce, and he should be supported in his difficult time.\n\nThose people don't know that he was having an affair, and they don't know that he's being an asshole during the divorce. I don't think you have to play along. I think it's perfectly fine to say \"I'm glad that he can finally be true to himself, but his self is still an asshole that had a 5 year affair and is making this divorce a nightmare\"",
            "Fuck no your not wrong for being furious with him. 12 years of time money and commitment to this guy and now he's fucking off while being a total ass hat. Good for him for coming out. Fuck him for wasting 12 years lying and cheating and then doing w.e he can to make things worse during all this. you wouldn't be ruining him by telling people the truth. You'll be exposing him for the exact kind of person he is. A shitty one. You owe him nothing and your kids won't understand any of this until they are much older but at some point they will figure it out what he's done exactly and realize for themselves how crappy he can be.",
            "I don't have any advice for you; I just wanted to say that I am mad as hell about what he's doing/done to you. It's not fair! You've done right by him the *whole* way, and he treats you like this. What a asshole!",
            "So,  so much this.  I've been there,  three years later I am still angry.  I relocated and started over,  no one ever thinks about what the family has been put through.  How hard it is and how hard daily life is after something this catastrophic.  I hope you find peace, I hope you have continued support.  Youre not wrong in being angry. Do what makes you happy,  do what's best for your family.  ",
            "Anyone who is telling you he's so courageous is a real insensitive piece of work. I hope they witness the same levels of \"courage\" from their spouses.",
            "Gay has become such a hot button issue lately. Honestly, fuck your husband. I'd say the same if he was with a woman for 5 years. He cheated on you, and basically used you as a live in maid/nanny. You are a bigger person than I am, because I would be mad bashing all over the fucking town. For being a liar, a cheater, a user etc  I'd use every ugly adjective I knew. So major major props to you for being such a big person. You deserve to be happy. I'm sorry this happened. ",
            "You don't have to embarrass anyone when people bring up the topic. Obviously, this asshole is in the wrong here. It is not courageous to string along your wife and children in a 12 year lie. If people ask you or talk to you about it, maybe just make small remarks such as \"Oh yeah it was really courageous of him to lie to his family for 12 whole years. I don't know anyone who has the strength to do that\" and just leave it at that. Or something. It's honestly none of these people's business either so you don't own them an explanation. Your (ex) husband is a dirtbag. ",
            "[removed]",
            "it's not courageous to come out as gay lol",
            "He can pay the money he owes you.   This sounds just like a steaming pile of crap, the former Gov. Jim McGreevey of New Jersey.  He did the same thing to his wife.  Tell the people the truth.  ",
            "[removed]",
            "[deleted]",
            "[removed]"
        ]
    },
    {
        "post_id": "9vjxrb",
        "author": "WrongCompetition",
        "title": "How do I [23 F] back away from this guy [31 M] without losing my favorite coffee shop?",
        "url": "https://www.reddit.com/r/relationships/comments/9vjxrb/how_do_i_23_f_back_away_from_this_guy_31_m/",
        "score": 4186,
        "num_comments": 429,
        "created_utc": 1541765708.0,
        "selftext": "I live alone in a city and I've had some trouble making friends. I go to the same cafe every day and the owners have taken on almost a parental role since my family is so far away. I'm close with them and I trust them and they care about my wellbeing, so when one of the owners, Sara, gave me the number of another regular, Derek, I trusted her judgment.\n\nI know Derek a little bit from spending time in the cafe. It's a small place and we both sit at the counter so we can chat with the owners. Usually, we sit next to each other. We've chatted about movies, he once helped me with my language homework, and he's generally in the cafe hanging out most afternoons. Sometimes reading, sometimes working on his computer. He's also friends with the owners of the cafe and has always seemed like a nice person so I certainly wasn't against getting to know him better.\n\nWhen Sara gave me his number yesterday, she was selling him pretty hard. I asked her about the book she was reading and she said, \"Derek lent it to me!\" and when I asked about a card game she said, \"Derek taught it to me!\". So I said, \"okay, I get it. I'll text him.\"\n\nI texted Derek after I left the cafe and I thought it was maybe a bad idea because if things went south, it would be uncomfortable to see him in the cafe almost every day. But it seemed like Derek had already set things in motion by asking Sara to slip me his phone number in the first place.\n\nDerek told me that he could use more friends in the neighborhood and that he'd like to get to know me outside of the cafe, so we went out for a few beers. So, last night I learned that Derek is 31, unemployed, and he sees dead people. He's a full-on weirdo, which is fine. I still had fun hanging out with him and I didn't feel unsafe or threatened until I got home.\n\nIn the 10 minutes it took for me to get into my apartment and get ready for bed, Derek sent me about 20 messages about how he wanted to kiss me and asking if he could come upstairs. I told him \"no, thank you for a fun evening. good night.\" and went to bed. My phone died overnight and when I woke up and plugged it in, he had sent me more messages confronting me about blocking his number, which I didn't do. These messages were over the top and intense and honestly, they worry me a bit.\n\nIt's obvious to me that I need to back away from this person, but right now I have no idea how to do that gracefully. I wouldn't mind a friendship, but he's made it clear that he's interested in a romantic relationship. I just want to be able to get coffee and enjoy myself without any awkwardness.\n\nWhat can I do? What should I say to Derek? And should I tell Sara that this guy freaked me out?\n\nTL;DR: I went out with a regular at my local cafe and it didn't go well. He's maybe a little unhinged. I don't want to lose my favorite coffee shop. How do I handle this without any awkwardness?\n\nUpdate: Thank you for your advice! I just went to have some coffee and talk with Sara. I didn't tell her everything but I told her I found Derek a little strange and she asked me what happened and I told her what he said about seeing ghosts.\n\nI mentioned in one of my comments that Sara shares some of Derek's interests in spirituality and mindfulness. We talked a little more about this. she's a very open-minded person. Sara knows that Derek believes he sees and hears ghosts and said she wasn't sure if it was true but she didn't believe he was deranged. I probably misunderstood some of what he was telling me about seeing dead people because we weren't speaking English.\n\nShe asked me overall how I felt the date went and I told her that he was getting pretty intense, he's too old for me, and I'm feeling a little uncomfortable. She told me that she thinks Derek is a good boy but agreed that he can be a little over the top and told me to let her know if he did anything else that made me uncomfortable.",
        "permalink": "/r/relationships/comments/9vjxrb/how_do_i_23_f_back_away_from_this_guy_31_m/",
        "comments": [
            "Screenshot the texts, tell Sara about your date (and your reservations about his mental well-being), and show her the screenshots. She is the owner, she has the right to refuse service if she feels someone is a threat to other customers. You also say they have a \"parental\" role to you; someone in that role would likely want to protect you.\n\nDon't blame her for setting you up (it doesn't sound like you took much convincing, so his facade of normalcy must be pretty good), and don't demand she ban him from the store, but explain that you aren't comfortable around him and let her take the lead and see what she does.\n\nAs for Derek, block him. Don't try to be his friend after he has already harassed you.",
            "I'm just worried that he knows where you stay now.. does your building have security?",
            "[deleted]",
            "Show Sara \"the facts\" and withhold judgmental statements like \"he's nuttier than squirrel poo!\" and just say things like \"The intensity he came at me with is too much, I don't want a relationship like that\".\n\n\nYour situation is kindof the same philosophy as not dating someone from work.   If things go bad, you taint the place it started up at.\n\n\nGiving Sara details is going to help your case here and get her support.   Maybe tell Derek something mild like you don't want that large of an age difference in a romance.  If he suggests hanging out as friends again just decline and say you aren't interested in going out to whatever he invites you to.   That way if you guys happen to be in the coffee shop at the same time, you will be still mostly strangers. ",
            "Re: your update: she has now SPECIFICALLY asked you to tell her if he makes you uncomfortable. You need to show her the texts. She wants to know how bad it is and you downplayed his behavior to start with.",
            "COME ON!!!! You DIDNT TELL SARA THE MOST IMPORTANT PART!!!! You need to show her the creepy texts about wanting to kiss you and all the over the top texts! These people have known each other for a long time and he can lie about YOU. Who do you think Sara will believe more? A friend she’s known for years or You? She NEEDS TO KNOW how weird this guy is, WITH EVIDENCE.  Also homegirl, don’t even trip. Tell this weirdo that you would like to be friends and that is all. Go about your life as usual. ",
            "Block him, but take screenshots because you may need to go to the police if this escalates. He may be a stalker and you may need to get a restraining order from this guy if he’s already acting like this. You guys aren’t even dating, and he’s sending you that many messages and being this controlling? Please contact a friend and tell them about the situation to ensure your safety. Losing your favorite coffee shop is the least of your problems. ",
            "Seems like you could just approach the lady and tell her what happened. Show her the texts if you want. If she's a crazy person also and totally lacking empathy she will fail to see the problem and you'll probably have to just find somewhere else to go. If she's normal, she'll see the obvious problem and be on your side. If you're expecting them to, like, kick him out forever or something though I wouldn't hold your breath. He's a customer just like you and they're business owners in the end who might not want to lose a regular, so your \"family dynamic\" there just might not remain the same if they try to stay neutral. It's all up to them how it plays out, we can't predict it.\n\nThis is a great reason as to why you should personally vet people for extended lengths of time before giving out personal info or spending time with them socially though. Bummer this didn't work out.",
            "> and he sees dead people\n\nWhat an amateur! You don't reveal this until like the third date! ",
            "Show the texts to Sara and ask her advice.",
            "I have a very similar story about a seemingly nice guy that completely unhinged, texted me over again, used aliases to contact me and try to convince me to date him. Back then I was alway the nice girl and let people walk all over me. But being single and dating has taught me so much... I think your feeling guilty is the shock and it hasn’t worn off yet. The cafe is not worth it. Go find a new one. He wont take the rejection well and won’t go quietly. I was lucky that in my situation the guy never knew where I frequented lived etc. just find a new place to hang and don’t talk to him anymore. ",
            "Um, show Sara your phone. If she still is Team Derek, finding a new coffee shop seems like the least of your problems. If Derek keeps calling BLOCK him and find a new place to hang as I doubt this guy will give up easily.",
            "You sound like a nice girl and it is sweet you want to be friends with this nutjob. Do not do that. Do not be friends with this unstable man.  Please.\n\n&#x200B;\n\nPS: I'm sorry this happened to you. :Until his true colors came out it was a nice story that I hoped would have nice ending. ",
            "i hate to be the one to tell you this, but there is sometimes a vast and often indistinguishable difference between people who are very warm/kind and those who are *good people*. sara is one of the FORMER - she’s warm and kind, but she DOES NOT have your best interests/safety in mind. \nfirst of all, she pressured you into approaching [essentially] a total stranger one-on-one when you hadn’t independently expressed interest in doing so. \nthen, when you told her about your deeply uncomfortable (read: absolutely terrifying, for a young woman living alone in a new area, hello there 👋🏼 i understand *exactly* where you’re coming from!) experience with this creepy grown-ass man she pushed on you, she told you he was a “good boy”. *what???* \n\nat this point, it’s my opinion that sara is either:\n1) well-meaning & kind but *completely* socially clueless, enough so to actively put you in harm’s way and not bat an eye (!!!) - or -\n2) deceptively “nice” to all her patrons and really could not care less about anyone. \n\nBOTH OPTIONS ARE BAD. PLEASE, from one single woman also desperately relying on my beloved “regular” spots in a totally new area for some semblance of familiarity, please please please find a new coffee shop. stay safe. surround yourself with good, not just *nice*, people. \n\ngood luck! ",
            "Yeah, I think the stuff about seeing dead people was the *least* important stuff to tell Sara about. What she needs to know about is how pushy he was to come in to your apartment and how he flew off the handle cos you didn't respond to his messages while you were sleeping. :/",
            "You 100% can tell Sara what happened. She should have your back on this. If he doesn't leave you be, she should back you up and talk to him. ",
            "I’m betting this isn’t the last you’re going to hear from him. The best thing you can do is cut all contact from him (after taking screenshot evidence, as many people have suggested), and wait for him to find a new target. \n\nDon’t engage with him, don’t try to explain to him, don’t apologize. You can’t reason with crazy. It will only give him the attention he wants and encourage his behavior. \n\nYou may have to avoid your coffee shop for a while. I’m sorry about that. I’m sure he’ll be waiting for you there - best thing would be if he let his crazy show to the owners while he’s waiting / obsessing (and maybe they could ban him. But then he could still wait for you outside).\n\nRead “The Gift of Fear”. It’s an incredible book that sheds a lot of light on this sort of behavior and how it escalates. ",
            ">I wouldn't mind a friendship\n\nIf you look at the fucking red flag parade this guy is and see a potential friend, you need therapy for your own safety.",
            "You are super underreacting. Derek is bad news, like “will hurt you” bad news. Stay away from him and the coffee shop, you’ll find another one to go to, or maybe you can go back if he clears out. Lock your doors, watch your back. All signs point to stalker.",
            "Can you please be careful in the next coming weeks? Please try and make sure he's not following you home. I don't like this story at all, I'd also suggest some type of background check on him, something might pop up. Stay safe!",
            "> I wouldn't mind a friendship, but he's made it clear that he's interested in a romantic relationship.\n\nJust a heads up, you shouldn't try to be friends with this person anyway IMO. He sounds overbearing and aggressive if he's harassing you for not texting him back after one outing. ",
            "Why didn't you tell her about him messaging you millions of times about wanting to come upstairs? And accusing you of blocking him? That is disturbing behavior and she needs to know that (so she can stop helping him hook up with girls and so she can maybe tell him to back off from you).",
            "OP, regarding your edit, I'm afraid you've played down the problem and not let Sara know how concerning his texts are. I urge you to show her his texts. That way, it doesn't become a \"he says-she says\" kind of deal and she has concrete proof he's an issue. Even if, God forbid, she doesn't believe you or blows you off or tries to downplay his issues (\"He's just like that, he's not a bad guy, blah blah\") at least you have shown her. That will be important if this escalates. ",
            "You are way underestimating the seriousness if this situation.\n\nYou need to be clearer with Sara.\n\nShow her the texts.\n\nIf he continues even a little bit, you need to get a restraining order and change your routine-including switching coffee shops for a while.\n\nI mean to alarm you when I saw that these are the situations that get dangerous fast.  It is unfortunate that he knows where you live.  If he continues you may have to move. Resteaining orders don't actually protect you, they just give the police s head's up.",
            "I wish you had shown her the texts because she is not getting it and you’re not giving her a clear enough picture. You need to show her how ridiculous he got after a simple beer. ",
            "Please keep us updated OP",
            "You need to talk to the coffee shop owners about these interactions and how uncomfortable he made you. Screenshot the texts. It is in no way you or their fault he ended up being to scary, but they need to know.",
            "I get the impression you weren't quite clear on how intense his messaging was?\n\nI mean asking to come in, kiss, 20 messages, accusing you of blocking him? After just one sorta date? I mean, that's not chill behavior. You gotta be more clear so she understands the situation. Saying, \"He's intense,\" is terribly vague.",
            "Show Sara the texts, but make it clear that you aren't blaming her.",
            "This is exactly why you don’t let people who don’t really know you set you up. They’ll throw someone who just “single” at you with absolutely no consideration for you or your preferences. Also, the fact that he sees you every day and couldn’t approach himself is another sign of his lack of dating confidence. \n\nI’ve found the worst and weirdest setups were from women who didn’t know me well and didn’t have my best interest at heart. They’d send me someone they wouldn’t in a million years consider dating themself and it feels very disrespectful to do that. Like “how can you think so little of me to think this is why I deserve, or were you really out for his best interest and not mine.” It sucks.  ",
            "For the love of god, OP, show Sarah the texts. It sounds like you totally downplayed how obsessive Derek is being to her, making it sound like he's just a fun but somewhat strange guy you didn't feel a connection with.",
            "> I didn't tell her everything\n\nYou should though. She probably doesn't have a clue how he acts towards his romantic interests, and it would be good for her to know so she doesn't try to set him up with anyone else. And she should also know so she can look out for you.",
            "You really really need to show her the messages. \n\nThen, when she rightfully realizes that he's potentially dangerous, you really really need to not feel guilty about anything that happens between them because of it. ",
            "After reading the initial post, your edits, and some of your other comments, I think you should be very clear and up front with Sara, since you feel comfortable with her, that whether you misunderstood Derek or not, you have decided not to continue seeing Derek in a romantic way, and your decision is final. This will accomplish two things:\n\n1) It will give Sara something to say to Derek if he brings you up, and seems at all under the impression that he still has a chance, or thinks he should get another chance.\n\n2) It will discourage Sara from trying to convince you to give him another shot, since he may come into the shop moaning about how hurt he is and how he really wants another chance.\n\nYou may also want to shop around for a new place to get coffee, in case Sarah does end up taking his side and starts to treat you differently, or harasses you about giving him another chance, or if Derek himself starts to bother you. Surely there's another place you can get coffee.",
            "I would send Derek a text that says \"I'm not interested in a romantic relationship with you and after these aggressive and threatening texts, I'm not interested in a friendship either. Please leave me alone.\" Block him and tell Sara what happened. If you see him at the cafe, ignore him and don't sit by him. If he tries to speak to you, let the owners know and or call the cops. ",
            "\"I wouldn't mind a friendship\"  \n\n\nPlease girl. You need higher standards for your friends.   \n\n\n&#x200B;\n\n  \nAlso you need to make a police report before this guy starts stalking you for real. I think you can find a new coffee shop.",
            "[deleted]",
            "DO NOT BLOCK HIM. IF HE GETS MORE AGGRESSIVE YOU NEED TO BE ABLE TO PROVE IT. DO NOT BLOCK, JUST IGNORE. ",
            "If i were you, I’d start to pay attention to Sarah as well. She has known Derek way before you and you never really know what history they had with each other. Also, I don’t believe a decent person would go out of her way(obviously talking about Derek in a way that shows she really intents to get you interested) to set anyone up with someone. It shows that they had some deal about you and you mentioned that Sarah has been nice to you like a family. It’s really sad to say that sometimes people are nice(strangely nice) to you only because they have some intention. Maybe Derek has already targeted you since you first came to the coffee shop and made some plans with Sarah. But it is also possible that Sarah was being genuine just it never costs anything to be careful than to be sorry later. \n\nI really hope you will end up fine OP.    ",
            "Dude, if you’re going to be honest with someone, be 100% honest, not 70%. Those text messages are a huge red flag for some psychotic shit. Not to mention the seeing dead people stuff. If she still doesn’t get it and still tries to hook you up with this dude, she’s not really interested in your well-being. There are tons of ways you can make friends in a city. Don’t be scared of saying no to people. ",
            "If things for some reason will go south even more, don't be afraid to lose your favourite coffee shop. I understand that can be hard in the new place, but if guy will be creepy even a little, and the owners will not do anything about it (or their actions will be unsatisfactory) just find another place.\n\nIn many coffee places you can find friends when you'll be there a regular, just like in this particular coffee shop. As you experienced, it's natural - the more often you are in the place, the bigger chance that you will start to chit-chat with the owners or the other regulars.\n\nAnd guy, as you described him is a \"nice guy\" TM.\n\n\\>  Sara, gave me the number of another regular\n\n\\>  unemployed, and he sees dead people. He's a full-on weirdo, which is fine.\n\nIf you are serious - no it isn't fine. This guy has some issues, and in my opinion you should 100% avoid him. If there will be even one creepy behavior, don't try to convince yourself \"I love this place, what can he do anyway\". Well, bad info - creeps are capable of doing not nice things.\n\nJust change a coffee bar without any regrets. If owners are really cool, they will understand this, and you can always meet with them after work once a while.\n\nGood luck, be safe and update.\n\nEDIT: Also, if they're friends with coffee owner she can try to explain his behaviour \"it's not a big deal, he is a \"good guy\"\". That's what the friends sometimes do... Especially when they made bad call - many people can't admit to the mistake. Don't buy it, please. You can \"agree\" with her of course, but if she will be like that - change your coffee spot!",
            "Tell Sara that the chemistry is not there and if he becomes intrusive set boundaries immediately. It is your coffee shop too. You will have to be firm with Derek over time hopefully he will get the message and so will Sara\n",
            "If you think someone is blocking you why would you waste time messaging them to accuse them of it? ",
            "You need to show her the texts girl! She still doesn't understand how bad hes being. This isn't over the top this is stalker level crazy and he's also the real kind of mentally disturbed crazy with a seemingly untreated mental illness. Show her the texts. Definitely block him. And do not continue to talk to him at all. ",
            "Show Sara the texts. You owe her honesty. \n\nShe deserves to know what kind of person he is to women he is interested in. \n\nYou told her all the irrelevant things, AND SKIPPED THE MOST IMPORTANT! \n\nYou can't make him change or calm down. You can't make this go away and be the same. Things will have to change. Sorry, but that's what happens when someone aggressive gets fixated on you. \n\n\nNow please do the right thing. Show her. ",
            "Can I ask why you didn't show Sara the texts?",
            "I don’t really understand your update? This sounds like the sort of crappy behaviour from Sara that people do sometimes when they feel bad for someone but wouldn’t date them themselves. You know like in films when the “ugly guy” asks out the girl and she says no and everyone is mean to her.\n\nOr in real life when people are like “oh he’s not that bad” meanwhile he’s full on stalking you? Like... no? Let her know if he does more? Why give him the chance.\n\nYou don’t need to be rude if you don’t want to but he is being objectively inappropriate and way too much. So you say to Sara that unfortunately you’re not into him and to him you say that unfortunately it’s not going any further and you want him to stop pursuing anything romantic. I’d also tell him to lose my number but I understand you may be uncomfortable doing that (you shouldn’t! But I get it!)\n\nBut yeah, Sara isn’t really your friend if this is her crappy advice",
            "Your update indicates you told her you thought it was weird he was saying he sees ghosts.  \n\nThe real problem is that he wouldn't leave you alone and texted you incessantly, then got confrontational when you didn't respond immediately.  You need to let her know that he's obsessive.  Your interests don't coincide, but that's not a warning signal.  This obsessive texting is.",
            "Show all the messages to Sara. Tell her the situation. Go from there. ",
            "\\>  I wouldn't mind a friendship \n\n&#x200B;\n\nDo you have any self-preservation????",
            "Buy some mace/pepper spray for your key chain and gear up for a restraining order. Don't take this lightly, he definitely knows where you live and got angry when you didn't act how he wanted you to. These are all danger signs. STAY SAFE you might have to loose more than just a coffee shop. I had to move away from a guy that was obsessing over me. Start looking at what evidence is needed for a restraining order for your state. (I had to prove beyond a doubt I was in danger before anyone would listen to me so be prepared to not be believed the first time you go to the police)",
            "You probably should have told her, \"He sent me a million messages between now and morning and got confrontation when he assumed the reason I wasn't responding in the middle of the night was because I'd blocked his number.\" The \"seeing dead people\" isn't that big a thing in light of the messages. \n\nSend him a soft rejection that you're not interested in dating people so much older than you and that you hope he can find someone right for him. Then wait. If he tries to defend himself, \"I'm sorry, that's just how I feel and it's not going to change\" once. If he gets all r/niceguys on you, show Sara and tell her that you don't feel safe around him. If he takes it well, you shouldn't have to worry about confrontation at the coffee shop. ",
            "Damn it must suck being a women and having to deal with creeps. Always have to watch your back and be afraid to make some guy angry. Also knowing that at any time a man can overpower you. I seriously think women have more calls then any guy, if I was a chick you wouldn't see my ass past sundown ",
            "This is so scary and alarming. \n\nThere are a few things you need to do:\n\n1) turn off the feature on your phone that let's people know when you've read their text (literally everyone should disable this)\n\n2) tell your doorman the situation and show him photos of the man\n\n3) show Sara the texts \n\n4) be completely firm that he crossed a line and made you fear for your safety and feel extremely uncomfortable \n\n5) stop talking to Sara if she gives ANY reply trying to minimize the situation, make excuses for this guy, or make you feel guilty and like you owe him something \n\n6) find a new coffee shop\n\n7) super privatize all your social media. Make sure that your job, friends list, photos, etc are set to private friends only and that nothing besides your name basically is public",
            "Since I can't comment on your update: why aren't you mad at Sarah?  She set you up with a deranged man, knowing he was deranged because she was secretly dating him! That's nuts. Plus, it seems like she cheated on her partner of 10 years because she was \"old\".  Yikes. From an outside perspective, she seems mean and untrustworthy. Also, am I the only one who found the mini update above unsatisfactory? Now I know why. ",
            ">These messages were over the top and intense and honestly, they worry me a bit.\n\n> I wouldn't mind a friendship\n\nWhy are people out here being friends with aggressive weirdos? ",
            "I’m really concerned that Derek knows where you live. Please be extra careful the next few weeks and keep an eye out for him following you home or waiting for you at your building. I would give your building security person a heads up and provide a physical description. I would tell your neighbors about him as well. \n\nProbably don’t go to the cafe for the next 2 weeks. He’ll be waiting there for you. When you do finally go in, pick a weird time like early morning when you’re less likely to see him and then show Sara the text messages. She needs to know not to give this guy’s phone number to the next girl. Then based on her reaction, you can decide if you should find a new cafe or not.",
            "Definitely explain the date and show the texts to the owner. You deserve to have people watch over you. There's no doubt they would feel instrumental in this issue by slipping you his number. ",
            "I'd show the texts to Sara so she can have your back. I'm sure she'd be gutted to know that her simple match-making favor for Derek turned into *that.*\n\nMaybe ask Sara what she thinks you should do about it. (but do what *you* feel is right in your gut). Be prepared to report this to the police if you need to. ",
            "You should really show Sara these texts. Someone texting you that frequently/intensely without replies... That's really weird and obsessive. The texts are very telling and she should understand more where you're coming from",
            ">So, last night I learned that Derek is 31\n\nWell, that's a bit of a concern, something to think about it terms of life stages and long term compatibility. 23/31 isn't that bad, in that it's an immediate red flag, but sure, it's not ideal.\n\n>unemployed,\n\nThere are lots of acceptable reasons to be unemployed, but this is something to watch and learn more about at the very least. It doesn't look good, but it's not always a reason to write someone off, depending on why.\n\n>and he sees dead people\n\n\\*record screeches to a halt\\*\n\nWUT?\n\n>In the 10 minutes it took for me to get into my apartment and get ready for bed, Derek sent me about 20 messages about how he wanted to kiss me and asking if he could come upstairs. \n\nYikes!\n\n>My phone died overnight and when I woke up and plugged it in, he had sent me more messages confronting me about blocking his number, which I didn't do. These messages were over the top and intense and honestly, they worry me a bit. \n\nDouble yikes! I would put the police emergency and non-emergency numbers into your phone contacts.",
            "Don't downplay this to Sara--show her the mountain of creeper texts he sent you. Tell her this made you uncomfortable. ",
            "Tell him that you had fun but you're not interested in pursuing a relationship with him. Use the age thing as a reason if you don't feel comfortable addressing his behavior. \n\nIf it continues, tell him his texts are making you uncomfortable.\n\nIf it continues, tell him to please stop texting you.\n\nIf he doesn't, start documenting for police.\n\nBut the first step is telling him you're not interested, because so far it doesn't sound like you have.",
            "You definitely need to tell Sara about those texts and how uncomfortable he made you feel hun. Especially since you don't have any family or people you can really trust ( Other than the coffee shop owners) living in the same place as you. The fact that he got that crazy after one date screams something is not right with him. Any rational person would've just assumed you feel asleep our that you were just busy. With how quickly his agression escalated I honestly believe your safety could be at risk. Telling Sara the complete truth will be better for you, it will also send this guy a message saying what he did is something you will absolutely not tolerate and you have people that will have your back.\n",
            "So - I had a housemate who was a lot like this, especially when he had had a few drinks. Definitely talk to Sara - perhaps frame it as \"I just wanted to make you aware that I'm trying to distance myself, because this made me really uncomfortable\".\n\nIf he's like my old housemate, the drink probably exacerbated it (but that is a big assumption in my part). If you haven't heard anything since then I think it's one of those situations where it's best to just ghost. If he does persue you then just say bluntly that you're not looking for a relationship with anyone right now, and you're sorry if you have him the wrong impression. Not that you should have to apologize but it's sometimes wise in these situations! If he does continue making you uncomfortable, and especially if it stretches into in person/at the café then don't be afraid of saying clearly \"you are making me uncomfortable\". I sent my housemate a long message explaining how and why he made me uncomfortable, and it did help to an extent. \n\nHope that helps, and hope you get out of this situation soon!",
            "I feel like you really glossed over a major red flag, that he feels he sees dead people? That sounds like a fairly big deal",
            "Tell him thank you for taking you out, but you're not interested in dating. Keep it really neutral and give him a chance to be normal about it. This is the best shot you have at preserving your current situation at the coffee shop. If he doesn't take it well or continues to send you aggressive messages, you'll need to set very firm boundaries. Tell him outright to leave you alone, tell Sarah the situation, and probably find another place to spend some of your time.",
            "You went into it with an open mind and got burned. That can happen when you take a chance on something. I would share the texts you received with the owners of the cafe, just so somone else you know has an idea of what happened in case things escalate. I wouldn't worry about maintaining a friendship with Derek. He needs some help before he's ready for any normal relationships. Seeing dead people is not exactly minor mental illness.",
            "Ok the thinking he's seeing ghosts isn't necessarily what makes him weird, although that is pretty strange, the blowing up your phone is.  That's really what you should have spoken with Sarah about.  ",
            "You need to be more blunt about the things that crossed a line and be aware if your boss isn't willing to see things for what they are it doesn't have any affect on who Derek is or how much a threat he may pose to you. If it gets to that point and you haven't advocated for your needs you will lose the coffee shop and end up harassed with no one to believe you. Advocate for yourself please ",
            "Personally, I would just go to Sara and show her his texts. Explain the context that you were asleep or whatev and that's really all you need to do. The red flags she's not seeing right now are abundantly clear in those texts. If you want to keep the shop and the friendships that's what I'd do. If you're ready to be done with all of that, there are plenty of local cafes and coffee shops to try I'm sure. ",
            "After reading your update, I’m confused why Sarah have you Derek’s number in the first place if she was dating him?",
            "Give him clear statement that you're not interested in seeing him again. Don't worry about hurting his feelings. If anything, being a little harsh now will be gentler on him in the long run.\n\n\nYou don't have to be awkward. Just get it out there so he doesn't think you're playing hard to get or some crap like that.",
            "Sara's judgement was extremely bad.  I would find a new cafe seriously.  Cut bait.  ",
            "This sounds exactly like a Derek I know who frequents a coffee shop in a city near me. Is this CT youre talking about?",
            "You need to show the cafe owner his crazy side and hopefully they do the right thing and run him off. He is the one who should have to find a new cafe, acting like a crazy person.",
            "if the owner really cares..for your well being let them see the texts",
            "I would show the texts to the coffee shop owners. That way they know what's going on and he cant twist the truth. You also need to firmly tell the guy that you are not looking for a romantic relationship with him. He needs to treat you as a friend or back off. That puts the burden on him to change his tune, I'd he takes it poorly then just shut it down, tell him you cant be friends anymore and see how it plays out, even if its awkward I would keep going to the coffee shop. If he tries to bother you there the owners will stick up for you and kick him out. ",
            "You don't need to worry about grace here. You need to keep yourself safe. You can't really have a friendship with this guy because he's apparently unable to respect basic social boundaries.\n\nI echo others on screenshotting the texts, relaying your date (Sara presumably would be interested in hearing about it anyway), and informing the owners generally. You can just let the know that you don't want to lose this coffee shop and interacting with them, and you don't know how to navigate this guy freaking out like this.\n\nIf the owners have any sense, losing Derek's business (if need be) is much better than him scaring away multiple female customers over time, which he will do if he stays (or at least if the owners/Sara keep trying to set him up).\n\nThere will be awkwardness, but it's not your fault. You did nothing wrong here. Derek crossed the line.",
            "Hmm, your response is kind of like mine.  I wouldn't exactly run from someone who says they see ghosts but is otherwise sane.  But definitely, too many texts in a short amount of time and even accusing me of treating them a certain way when there was nothin proving it -- that is deal breaker!\n\n",
            "Be straight up. He still won’t get it. Then just treat him like you would any other person. ",
            "Aww man. You do have a problem because I guarantee anything short of \"come over and fuck me Derek I'm in love with you\" is going to make him blow his top. \n\nI don't have advice. I'm sorry :( I recently lost my favorite corner store for similar reasons.",
            "Jesus!  Try to be nice and you end up in Creep land!  Sorry this happened and feel for you in parental sort of way..  my wife and I have taken on the adopted role for a few co-workers in your age group who live in the area with no family close by.  As a father, I get very protective when it comes to nice guys turns creep.  At the least, explain your situation to the owners of the cafe you frequent when Dereck isn’t around.  If they don’t step in and straighten dude out than you need to take direct action to protect yourself.  Stop going to the cafe, change your routines and buy some portable mace to keep on you at all times..\nDO NOT take this kind of behavior lightly!  He knows where you live and that you’re alone.  I’m not trying to scare you but, the father in me tends react in a very strong manner when it comes to a young woman on her own and creepy assholes stalking them!  Do not coddle this jerk!  Block his number and make it very clear you are not interested..\nBe safe, be aware of your surroundings and don’t take chances.",
            "This guy doesn't know or respect boundaries. You can't just be friends with him if it started off as over the top as this. Next level would be frightening.",
            "The fact that he text bombed you after just hanging out for a bit is a huge, huge red flag. His comments are unnerving so since you see him at the shoppe, be a little cool towards him and occasionally diss him without smiles. Don't or rarely look him directly in the face and avoid smiling too much at him or anything he says. Stay kind but do not give him opportunities to get you alone. \n\nHe's lonely and desperate and so your attention has opened up hope for him so if you don't feel the same, then just keep him in the friendzone and avoid going out alone with him.\n\nSource: I was kinda like that guy at one time and though I was not quite as extreme (I don't think, lol) I do recognize his behavior.\n\nEdit: Don't block him in texts but do not reply with anything more than an occasional emojii. Do not get into lengthy, positive sounding replies in texts, it only encourages him. Say: \"no thanks, have a nice day!\" or things like that a lot.",
            "I would start going to a different coffee shop at this point. It's great Sara told you to let her know if he does anything else to make you uncomfortable but honestly what control does she have over that? And she is still selling the 'great guy's angle. It's creepy she tried to play match maker with her customers in the first place tbh. \n\nI'm sure there are lots of great coffee spots in town that would make you feel more safe and where the owners don't try to match you with someone inappropriately aged for you. Good luck OP.",
            "I had a friend I’d known since high school set me up with her boyfriends friend. He was nuts, decided we were going to be together forever after a few dates (despite my feelings on the subject), and basically was harassing me. He’d write all these lovely dovey puke inducing things to me on my fb wall after I’d asked him repeatedly to stop. \n\nHe wouldn’t stop calling and texting me and harassing me on fb, even after I told him to leave me alone. I asked for help from my friend and her husband. They thought I was making something out of nothing and was just being a brat until I showed them the texts. Me telling him I didn’t like it and to please stop and him doing it anyway. I blocked him on everything and they told him off for me. I went to my friends wedding and he stared at me the whole time, to the point that my friends sister asked who he was looking at. But he didn’t talk to me and he left me alone. Maybe your friend at the coffee shop can help you in that way too. ",
            "I saw your update, but I'm wondering if you showed her the messages? ",
            "If he's a good boy then she should date him. There are so many red flags going off that continuing to humor him will not go well.",
            "I sounds like he may be exhibiting symptoms of schizophrenia. I would probably take a break from the whole situation. As in find a new spot for a while and also tell Derrick that what he said made you a bit uncomfortable and that you arent interested in him in a romantic way. I only see this getting worse and these types of people dont take hints very well they need clear direction. Do not delete any text history and if it escalates, which I think it will, you need to report it to the authorities. ",
            "Yeah, 31 and at a coffee shop every day? That only works if he's self-employed. He's unemployed, which is bad enough, but his barrage of messages is really creepy. I wouldn't even be friends with him or even talk much to him from now on.",
            ">I probably misunderstood some of what he was telling me about seeing dead people because we weren't speaking English.\nShe asked me overall how I felt the date went and I told her that he was getting pretty intense, he's too old for me, and I'm feeling a little uncomfortable. She told me that she thinks Derek is a good boy but agreed that he can be a little over the top and told me to let her know if he did anything else that made me uncomfortable.\n\nI don’t think you misunderstood anything. \n\nSarah is downplaying his behavior. She does not have your safetybor your best interests in mind. ",
            "As for the seeing dead people thing, there are two possibilities.\n\n1.  He's actually mentally ill and hallucinates.\n2.  He's an edgelord and thinks this will make women find him interesting.\n\nI'm gonna just say statistically #2 is the most likely scenario.\n\nFuck, that's someone awkward shit to deal with since you're just trying to do your thing and make friends.",
            "There’s a lot of fucking weirdos hiding right in front of us. I don’t think I’ve ever double texted a girl. If she doesn’t respond I just delete her contact info and move on to the next. Haha\n\nDefinitely SS everything and don’t respond to anything. I’d tell “Sara” everything, if you see him in passing just keep things short and go about your business. Seems like the type of dude that falls in love when he gets a phone number. ",
            "Just show her his texts.. and he literally sounds like hes schizophrenic",
            "I would forward or show the entire conversation to Sara and tell her you don't appreciate being setup with an unbalanced person like this. This gives her boundaries for the future, and alerts Sara to his douchebaggery so she can protect herself. As far as the café, if he tries to say anything to you I would tell him he went way over the top and you are done. Then move to a different location in the shop. If he continues to approach, tell him you will call the police, and do so if he still doesn't back off. ",
            "First, block his number. I wouldn’t advise being friends with him...I’ve tried in these situations and it never works out, especially if they see it going somewhere you don’t. I think it’s fine to continue to go to the coffee shop at your own leisure. He shouldn’t be preventing you from enjoying yourself. If things get more intense I would just stop going, though. Good luck I hope he doesn’t pursue anything!",
            "Just tell Derek in a safe public place that a) that you’re not a match for him, b) that won’t change.\n\nIf pressed say, “I enjoyed the date, but there were some quirks that concerned me, and  the drama after confirmed my fears, it was way too intense. This is not up for revisiting or discussion.  I have no interest in seeing where it would lead. Happy to keep it cordial, but not friendly.”\n\nSummarize to Sara.\n\nGoing forward, if there are problems at Cafe, then escalate.\n\nI say that based on you saying “obvious I need to back away”, and “wouldn’t mind a friendship.” (Friendship is probably a bad idea.)\n\nPut another way, I trust your judgement. If you are wrong, ie he is hallucinating, is dangerous, “is freaking you out”, has delusions, then ignore above suggestion, and take more extreme action.",
            ">he's too old for me\n\nThank god. You handled this all really well, and I'm glad it worked out. But particularly glad that you saw the age gap as a red flag. Age is not just a number and I think that offends some people's pride. But treating it like it's insignificant can get you into hot water with some controlling and/or wildly immature older partners (as we can see here). Glad you peace'd out of this situation.",
            "If he approaches you for friendship (or more) tell him that you went for a few beers, but \\_\\_\\_\\_\\_. (Fill in the blank with a cutting off comment like \"We don't have the right chemistry for going out.\"  \"There's too big an age gap between us.\" \"We're just no suited for going out again.\" In a short time, you could lie and say you have a boy friend. I know he's weird, but ***for that reason*** I wouldn't make a big deal to him about how creepy and unhinged he is. Just be persistent in saying No. Maybe sit at a table for a while, but at least do not sit by him at the counter any more. \n\nI agree that you should show Sara the number and comment on your concern about the content of his messages, just so she knows what's up.",
            "I think a lot of people are taking this to the extreme with asking you if you’re buildings secure, “this is why i never have people pick me up from the first date” etc, especially when you both live by the cafe. Guy just seems really weird. I would tell the cafe owners about the date especially the women, it seems like you guys are friends so she’ll likely ask about it anyway. Just be honest tell her what happened, tell her about the messages and if she doesn’t believe it show them to her. But I wouldn’t go in guns blazing just be casual. I would even tell her you’re worried about it being awkward at the cafe and see what she says. If anything they’d do something about his presence and not yours if it even got to that. \n\nGood luck sista, we all roll the dice and get a weird one every once in a while.",
            "Being unemployed and seeing dead people, fine. Some people are more open-minded to the spiritual and supernatural than others, like Sarah. What is concerning, and what you should tell Sarah about, is his over the top texting reaction when your phone died. ",
            "Show her the text messages! Sarah is trying to be your girl, help you get laid out enjoy some Male attention from someone who is clearly smitten on you! already has a crush! is overly excited AND also a nice guy asshole. sometimes when I'm dating someone new, I'm always checking how they process negative information. I like to take things slow, boys get crushes and want to rush too fast for me, so I get a lot of potential dates or friends that turn out like this for me. \n\n\nHE IS CREEPY!! THAT IS NOT OK. for the safety of everyone, give me his number and I'll explain politely to him, how he f--d up, and now there are social consequences. Show Sarah the texts. ask her opinion. demand he not sit next to you. tell him he's inappropriately behaving and you're surprised because he's old enough to know better and to treat people with respect. \n\nlecture him. \n\ntell him to move over or leave. \n\nbe the boss. \n\nIf he gets more dangerous--call the cops, a friend, someone intimidating who's just good people, and tell him to get off your jock and grow up and be respectful!! ",
            "Honestly, don’t go back to that coffee shop just yet.  Don’t go running to Sarah showing her screenshots, there’s not really a good scenario that can come of that.  It’s possible he’s so embarrassed he won’t show his face there either.  This will likely only become a big deal if you make it a big deal.  Just take a week or 2 off and go to a different place.  Then when you do go back just sit down and wait for Sarah to talk to you about why you haven’t been around lately.  Tell her Derek gave you a bad feeling and you thought it would be best to not be seen by him for awhile.  If she continues to ask tell her about the texts.  She’ll probably feel horrible for what she put you through.  Tell her it’s fine but you’d just prefer not to run into him.  Get a feel for if he’s been around a lot since you’ve been absent.  Chances are you’ll eventually run into him there, just politely ignore him and cut conversations short.  Much better than getting him banned from his usual spot by running to the owner with creepy texts.   Good luck",
            "I’ve been demonstrably psychic since I was 13, I’m now 61, and there have been hundreds of incidents throughout my life that prove that I am. Many of those experiences are related to communicating with dead people.\n\nPersonally, I’d be more worried about the over the top texting and paranoia. ",
            "You mentioned you live just next door to the cafe. I really hope you don't need to move away as well for safety reasons. You're in such a troubling situation if I were you I'd probably just pull away and move somewhere else because of anxiety. I really don't know how you're handling it. Be strong and good luck!",
            "Sometimes blocking crazy people who have other ways to contact you only exacerbates their crazy contact.  It’s easier to ignore and diffuse a text than a letter on your door or something weird like that.",
            "If it goes any further tell him you will be filing a harassment report. A lot of times that will scare guys who truly don’t mean harm. If he has a bad reaction to that— File it!!! ",
            "You have already told him, politely,  that you're not interested.  Could you maybe go to the coffee shop owners and ask them if they could sit and have a talk with him? What about also throwing in a fake guy you just met , tell just the owners how good it's going and you really like this made up guy. Don't tell the weirdo,  the owners will tell him , trust me.\n\nHope these options work. For me I prefer being direct, but I get  that's not everyone's style. \n\nBest wishes!",
            "I would be careful with Sara. I think that you should , as gently as possible, enquirer if Derek is in any way related to her family before you tell her about the creep issues. ",
            "Ignore him (so you have an ongoing record of his attempts at interaction) and send screenshots to the owner. The owner may ask for him to take a break from the coffee shop for a while. If she doesn't, you always can choose to. \n\nJust be honest with the owner, \"I love your shop and I really value my relationship with you and OtherOwner. But Derek made the whole situation really uncomfortable. His intensity and lack of respect for my boundaries after one casual date was, for lack of a better term, a bit disturbing. Im just not comfortable around him anymore. So I think I may take a break from the shop for a litttle bit just to put some distance between me and him. Thank you so much for understanding.\" They will either volunteer to tell him to step away or they will accept your plan. But the situations end result will be clear- you and Derek are no longer social cause hes a boundary crossing weirdo. ",
            "Why doesnt sarah date him if she likes him so much?",
            "Unsure who the weird one is here.....",
            "You have every right to go where you want to go, and you have the right not to be harassed.  I second others who have said to just ignore him (unless he escalates or gets dangerous-- then tell the police), show the people who set you up the texts, and just continue doing what you want to do as far as hanging out at the shop.\n\nIt was one date.  You don't owe this guy anything, even politeness.  If he bugs you, just ignore or get the appropriate authorities involved if you feel he's going to do something.  Folliw your gut on that last part.\n\nIn the future, if a guy needs an intermediary to ask you out even though you see each other on a regular basis, it's a bit of a red flag.  Through years of experience, I can tell you: you don't want the ones who know you but are too scared to ask you out or give you their number in person.  Takes time to learn that.",
            "Just be frank with everyone. Your story and feelings are enough. Just say to both Derek and the owners that you had fun, that you liked to hang out, but then the messages were too much and not OK at all. \n\nSimple, true and really nothing wrong with saying it as it is. If Derek asks again just say it was fun last time, but then it was not OK, so let's go back to what was before. \n\nWhy would it be more complicated than this?",
            "This advice is based on another woman giving me the same advice 20 years ago:  Just openly tell him \"I don't like you.\"  Just that and no more.  Don't hedge, soften it, or try to explain.  ",
            "\"I go to the same cafe every day.\nThe owners have taken on a parental role since my family is so far away!\"\n\nThat rhymes and that's brilliant! ",
            "Don’t feel bad for having emotions or opinions. He freaked you out and you’re not interested in him, that’s that. It’ll probably be awkward but be clear and direct with him that you do not and will not see him romantically. I would keep a record or everything he’s texted to you as well, it is over the top. Be mindful of your surroundings, especially if he knows where you live.",
            "That's the problem with pooping where you exist. But WHERE else are people supposed to find people?",
            "I hope you are able to keep going to the coffee shop. I think Derek should know he came on to you way too fast & I wonder if this is why he is still single It is ok to let him know you only view him as a friend and not a romantic partner.....Does he know your address? ",
            "You take another guy there ",
            "Become a lesbian until he loses interest 🤷🏼‍♀️",
            "You should not say ANYTHING to him.   Go silent.  ",
            "Start impact or self defence training now. People like this rarely quit being a nuisance for you and sooner or later you're likely going to be in a vulnerable situation with him. Navigate to the martial arts reddit for advice. You're at more risk than an ordinary woman right now and ordinary women are at a lot of risk from predatory males. Simply asking my friends when the last time they felt unsafe was met with usually within the last few days. A shocking difference between male friends, who don't recall or at least several months to years.",
            "If it's not something you want...move on and take the high-road...always.  That and you won't lose your coffee shop...",
            "Personally, I hate blocking. I think it's immature, but I also am able to trust my instincts and tell people when they have gone too far. I would draw a line in the sand in plain language. \"Derek, I am not interested in a relationship, I don't want to be friends outside of the caffe, and I don't want you to text me any more. Texting me 20 times in X minutes is extremely inappropriate.\" Then I would tread carefully and see if you can to the cafe while he is there and if he will behave with polite distance. If he fails, I would tell him \"I told you, Derek, I do not want to be friends outside the cafe.\" But this might not be for everyone. I personally think it's an important skill to be able to tell someone uncomfortable things to their face.\n\nI would also tell the owner and see what she says, and then make my decision about whether I can go to the cafe any more based on those two variables (her reaction and if he realizes he fucked up and leaves you alone).",
            "I would recommend the following ( knowing its easier said and done) : you don't need to justify the fact that you don't want to be with this guy whatsoever. Just be like: Hey, I don't think this is going to work out. Period. You don't need screenshots of texts, or anyone else's approval as to why you feel this way. You don't need to spread the fact that the guy is \"weird\" either.  \nJust stand your ground: Tell him, hey, this is not gonna work out, sorry. Same goes for the people at the cafe. Tell them its not gonna work out between you and the guy and that#s it. \n\n&#x200B;\n\n&#x200B;\n\nThe point I am trying to make: You owe no one an apology, or even a reason as to why you feel the way you feel. Just be open and honest about it. People respect that a lot.   \n\n\n&#x200B;",
            "The cafe owner probably the main reason you're in this situation. She either knew about his mental health issues or she up sold a guy she doesn't know. She should have quashed this. \n\nAre you sure you want to continue being a patron?",
            "I am concerned about why she would try to set you up with a man who is over 30. (And she keeps calling him a \"boy\"...)",
            "Unfortunately he knows where you live!!! Ack. Sorry about this shitty situation",
            "What's funny is that my name is Derek and my sister is Sarah. That's the only reason I'm commenting. I promise we're not the same two though. She and I are estranged and I'm a married gay man who doesn't have imaginary friends.\n\nJust keep in mind that he's the one who fucked up. Not you. Continue your routine without any regard to his comfort. Be cordial but distant. Don't speak directly to him. If he tries to engage you simply tell him you don't feel comfortable speaking to him. \n\nUse common sense and situational awareness if there's any escalation in his behavior. Until then, hes probably harmless and frankly desperate. That is a risk you take when trying to be friends with someone who has no friends.\n\nAlso, sounds like he's got schizophrenia. It explains the dead people and his lack of real friends and his unemployment. That doesn't automatically mean he's dangerous. It does shift the odds in that direction though. Although, I think that as long as you avoid being alone with him you're relatively safe.\n\nPeople who have schizophrenia are generally prone to momentary, impulsive, violent outbursts. They aren't so much cunning or sophisticated or premeditated.",
            "I think you can go with the honest, but not too honest, \"I just didn't feel a spark\" line. You had fun, you want to be his friend, but you just don't have those kind of feelings for him. ",
            "whatever he did (texts) is documented\n\nif he wanted to do \"weird\" (whatever that means) stuff he would've used other means\n\n> My phone died overnight\n\n> confronting me about blocking his number\n\nmaybe because your phone was offline the messaging app showed \"undelivered\" and he concluded that you had blocked him\n\nnow building on that, it's OK that he over-reacted. he liked u. took u out. it seem to go OK. then u blocked him. hmm\n\nimo it (his 20 messages) is a natural reaction. and it's \"controlled\". he could've come to your house and demand to know why but he just messaged more.\n\n> feeling a little uncomfortable\n\nsquishy term that doesn't really mean anything objective \n\njust talk to him for fuck sake\n\n99% of humans can take a no imo\n\nwe're domesticated enough",
            "I see a lot of people telling you to block the dude, what about running into him? Just be honest about it all, although this guy seems unstable you won't be able to avoid him forever. \n\nHe probably has his own thing with the coffee owner, but the best case I see here is you all 3 sit down and talk about it. \n\nYou're not into him, he can't be into you after one date, he's probably just clinging. ",
            "Tell Sarah how wrong she did you, and how awkward things got with him. Send the messages to her, let her know that you trusted her judgment and it backfired. Hopefully as the owner of the coffee shop she won't want this creep circulating in there.\n\nOtherwise, get an order of protection/restraining order against him. He won't be plaguing your coffee shop anymore.",
            "Don’t bring the cafe owners into your drama first. If you do, they will feel they need to choose sides. It normally never serves the person bringing the drama  up first. I would message the guy back and tell him you’re interested in friends but not wanting to date right now. And when Sarah asks, you can say he was a fun “friend “hang with and joke about that he sees dead people and you don’t see a future with him. Make it lighthearted and when you’re in the café be cordial and friendly but keep your boundaries.",
            "Honestly, maybe she needs to talk to Derek, & be the middle person. She could straighten this out due to a misunderstanding.\n\nYou sounded like you were on the fence regarding a relationship to begin with. So, it didn’t seem like you were into a relationship to begin with. Were you put off due to race? Were you wary, about how his background was not similar to yours? Granted, I’ll agree that he should be employed or at least in pursuit of a job. Yet by you pointing that out, it seems you were not clear to Sara what you were looking for in a romantic relationship.\n\nI say, talk to Sara; let her talk to Derek, see if she can clear the air. It seemed like you only went on the date because Sara insisted. That was not fair to Derek. If he was not your type or you did not like 1 thing or another thing, you should have told Sara, so she would tell Derek. It’s obvious that Derek tried to play this delicately, though that does not seem to be the type you are attracted to. To simplify, talk to Sara, decide for yourself if you want to pursue a romantic relationship with Derek. If you do, be more open minded, while still getting advice from Sara. Derek himself will have to be more mindful with dating you if you both want to see where a relationship goes. If you decide to not go on a second date, both, tell Sara, & Derek. Sara in person with your honesty & how you feel about him, what type of person you want in a romantic relationship, & other details. Tell Derek, obviously in a text, from you, seems the best method. Be kind in what you write in the text. Maybe ask Sara for advice on what to say. Be honest with Derek & ask if you can still be friends. This part is the awkward part of being an adult; being okay with less than comfortable situations.\n\nIf you can continue after 1 date, as friends or in a relationship, then you will be better off for it.\n\nGood luck. I hope it works out for you.",
            "Just read top comments and I feel to say that GUYS, TRUTH IS NEVER BLACK OR WHITE. It's completely wrong that you felt kinda guilty for not having endorsed his behaviour that night. You shouldn't overchange the way you like men and what you may like of men. No one should. But let me be straight: if Derek did what he did, he's probably such miserable in dealing with possible romantic relationships that he doesn't know anymore how to do that in a \"normal\" way. He wasn't harassing C'MON. You people are tending more and more to monsterize those who use to have weirdnesses in relating. Darek's methods are sad, the attempts to draw him like an issue for society are far sadder..."
        ]
    }
]