[
    {
        "post_id": "4ou08h",
        "author": "Jayx8",
        "title": "I [22M] just learned that my sister [29F] had an abortion to be able to donate me part of her liver. It caused her divorce. I can't stop hating myself.",
        "url": "https://www.reddit.com/r/relationships/comments/4ou08h/i_22m_just_learned_that_my_sister_29f_had_an/",
        "score": 4108,
        "num_comments": 265,
        "created_utc": 1466354158.0,
        "selftext": "What really happened: I was very sick four years ago and was in need of a liver transplant. My situation was that it was very unlikely that I would get one in time. At that time my sister was pregnant. I didn't know as it was early (less than two months). My situation was getting worse and my sister decided to do an abortion and then two months later we did the transplant surgery.\n\nI never knew about the pregnancy. All I knew was that she gave me half of her liver. My sister and her husband divorced a year later. I didn't know the truth until yesterday when my mom slipped up about an abortion that my sister had. I asked her about it and she told me everything. She told me that my sister made her promise not to tell me and she failed that promise.\n\nMy sister was very happy. My brother in law was a very decent guy. I knew they were looking forward to having children. They were great together. She always told us about how lucky she is to have found him.\n\nApparently at the time of their decision, my sister and her husband had great disagreement. He didn't want her to have the abortion and risk the transplant surgery and was hopeful that my situation might sort itself out without my sister's help. The chance was very small but it was there. My sister didn't agree. They couldn't convince one another and my sister did things anyway without his blessing. They tried working things out after the surgery, they went to counseling, they even tried to have another baby but they couldn't get themselves to do it. He couldn't forgive my sister and she wasn't all that apologetic so they ended up separating and eventually divorcing.\n\nMy sister isn't happy now. Hasn't been since the surgery. She never told me the real reason for her divorce. She told me that they were after different things. I just learned things from my mom. I asked my mom if my sister still thinks that she did the right thing. She said \"she's not sure\".\n\nI can't stop feeling guilty. My sister saved my life but destroyed her own life doing it. She had to abort the baby she definitely loved and looked forward to and did that knowing that it will probably end her marriage as well. I was ready to go at that time. I had accepted my fate and I was at peace. She should have just let me. Shit. My brother in law should have told me so I would have talked her out of it. I'm surprised he didn't. I can't feel anything but to hate myself.\n\nI don't know what to do. Should I talk to my sister? What should I tell her? Should I keep my mouth shut and pretend that I don't know? I'm not sure if I'll even be able to look into her eyes and not show that I know. I just don't know what the fuck I should do.\n\nPlease please help me.\n\n**tl;dr**: My sister did an abortion be able to give me part of her liver and saved my life, but it costed her marriage. ",
        "permalink": "/r/relationships/comments/4ou08h/i_22m_just_learned_that_my_sister_29f_had_an/",
        "comments": [
            "In case you want counseling, you can contact the hospital that did the surgery and they'll be able to help. They have counsellors who are experienced with issues around transplants from living donors.\n\nBut regarding your sister, yes you should tell her. It's a burden on you and on her. Just go and talk to her. Tell her how you feel, she'll tell you how she feels, and it will bring you both closer together. It's a very difficult situation where nobody is at fault and it's very unfortunate that her marriage ended that way. But you both can heal together. ",
            "Your sister made an impossible choice. Either way, she was risking losing a family member. There is not outcome here that would have made everyone happy. And, despite the guilt you feel, you weren't in control of any of the decisions she made. Do you really believe you could have convinced your sister to let you die when she had the ability to save you? \n\nI know it's usually the go-to here, but therapy seems like it would be a good first step. You just received a lot of intense, emotional and heartbreaking information. You need time to process and figure out how you feel outside of your guilt. And if you try to address this situation on your own right now, you risk damaging your relationship with your sister long term because this needs to be handled very delicately. You may run the risk of saying the wrong thing unintentionally.  ",
            "Damn your sister is a legend man. That's all I can say.",
            "Don't hate yourself. I have two young sons who I love to the ends of the earth...but when I was less than two months pregnant I would have done the same thing to save my brother's life. I do think you should talk to her. Hug her. Tell her you're so sorry. DO NOT tell her that she shouldn't have done it. Or that you're blaming yourself. Then she'll wish your mom had kept her promise and it will make it even worse. Maybe you could ask her if she's considered counseling - I'm sure she desperately needs it if she hasn't had any. She still has the rest of her life ahead of her - and thanks to the decisions she made. So do you.\n\nEdited because that was the worst typo.",
            "I don't think you should consider it that your situation CAUSED them to divorce as if it was an inevitability.\n\nI think my marriage would have survived this situation. I think there are many here whose marriages would have. What your situation did was bring your sister ave her husband to a crossroads where they discovered some fundamental incompatibilities in their relationship. That may well have happened sooner or later anyway.",
            "Your sister did the right thing, and you should be proud of her, and feel so lucky to have a sister like her.\n\nPut yourself in her shoes. You have a sister who is *dying*, with very little chance of surviving if she doesn't get the liver she needs.\n\nYou just got pregnant - hooray! But you're the only person who can save your sister's life, and it will cost you the pregnancy. Damn.\n\nBut you can get pregnant again. 75% of pregnancies end in miscarriages, most of the time without the mother even knowing, and few of those women are rendered infertile by it.\n\nSo you know that, while it's sad, you can always try again for another baby - but if you let your sister die, you'll never have another sister again. Easy decision, right?\n\nExcept you've got a husband, and he's actually telling you that you should roll the dice, almost certainly watch your own sister die in a hospital, just because he wants *this* particular fetus, who is not a person, to take priority over your living, breathing sister - even though there's *nothing* preventing him from making another, even though losing a child in early pregnancy is common as it is.\n\nSo you've got this man, who is basically telling you to *kill* your own sister or he'll leave you.\n\nYou know what? *Fuck that guy*. In her shoes, would you ever pick a man like that over your own sister? If you had let your sister die when you could have saved her, would you ever be able to forgive yourself?\n\nShe did the right thing - for you, *and* for herself.\n\nIf it was me, I would tell her that I know - without throwing Mom under the bus too much - and I would thank her for giving me my *life*. She's been keeping this from you the whole time because she doesn't want you to feel guilty - and the consequence for her is that she hasn't been able to talk to you about any of it.\n\nThank her. Let her cry on your shoulder. Let her know that you truly owe her your life, and that you are the luckiest sister on the planet. Mourn the pregnancy, mourn the marriage, don't talk bad about the ex. But know in your heart of hearts that that man wasn't good for her, and that he could never have raised children who would be so closely bonded as you and your sister are.\n\nEdit for a couple clarifications:\n- I was way off on my claim about how many pregnancies fail to complete. Read the comment chain for a very good breakdown of *exactly* how wrong I am.\n- I was being a little flip when I implied that anything about terminating a pregnancy would be an easy decision, and I apologize for that.",
            "Hopefully you'll see this.\n\nHave you ever heard of the hindsight bias? We use it colloquially in media nowadays but it has real emotional and cognitive impacts on us in real life.\n\nEssentially what you're doing is, you're hating yourself for something you did not know and could not know 4 years ago. You are giving 4-year-ago-you the same knowledge/mindset of present-you. And present-you knows so much more than past-you. And that's not fair to hold past-you up to the same standards as present-you. Because that is impossible, that's not how time or life works. So stop beating yourself up over not being able to achieve the impossible. Because no one can achieve that. Instead, have some grace towards your past-self with the wisdom you have as your present-self.\n\nI know words are easy and actions are hard, but I just wanted to at least put that thought in your head.\n\nYou'll be ok, I promise. So will your sister. ",
            "Does anyone think it was pretty shitty of the mom to tell OP her sister doesn't know if she made the right choice? Who tells someone that?! ",
            "Look, I know you feel terrible, but your sister is an adult. The choice she made at the time was her own, and it was a very noble one. She chose to save you, her brother, whom she clearly loves very much. She knew what she was risking when she decided to donate her liver to you, accepted those consequences, and chose to do it anyway like the incredible sister she is. It's terrible that her marriage fell apart and that her husband chose to leave, but that's not on you. That's their relationship, so there's no need for you to feel guilty. Talk to your sister, be there for her like she was there for you, encourage her to go out and meet new people and find things that make her happy. She's clearly an amazing person who deserves another amazing person to share her life with, but for now just enjoy the time with her that she gifted you with her donation. ",
            "Oh honey.\n\nPlease know that divorce is complicated. It's never just one thing that leads to it. We tend to hyper focus on one thing while we're in the middle of it all, but it's never just one thing. If your sister and her ex husband weren't meant to be, that had a lot less to do with you than you're thinking.\n\nYour sister is an angel. Were it me and my sister, I would do the same thing, no question. It's a no brainer. I have a toddler and am currently pregnant, and if there was anything I could do to save my sister's life, including an abortion, I would do it. ",
            "Your sister made the choice to save your life, at whatever costs she was willing to make. She did it because she loves you and she knew there would be risks involved, especially with her marriage if they had talked about it. In saying that, this was her choice. You didn't ask her to get an abortion to donate half her liver to you. She chose to. And she did it because she loves you. You shouldn't feel guilty, her having an abortion and eventually divorcing, is in no way your fault. ",
            "I just want you to know that \"she's not sure\" is not the same as regretting her decision. You're safe. She's able to torture herself with hypotheticals because the reality is that you are safe and that isn't changed by any scenario her mind can run.\n\nSo talk to her, comfort her, grieve with her. Let her know she doesn't need to hide her pain from you. Not because you caused this or owe her, but because your sibling is hurting and you'd walk through fire for each other.",
            "She loves you, so you better go give her a big hug.",
            "Honestly, I feel that if you do talk to her do not express anything but gratitude because showing regret for her decision after she lost so much to make sure you lived will just be a slap in the face. \n\nIf someone sacrifices themselves for you, don't ever tell them you wish they hadn't, because to them it'll just seem like ingratitude.\n\nAbsolutely do not tell her you hate yourself. She gave up her potential child's life for you. So for her to hear that she gave that life up for yours and you're not even appreciating your own life..most likely she'll just be insulted by that.",
            "I would do the same thing for my little sister, in a heartbeat. She loves you, in a very powerful way. She likely couldn't imagine her life without you. Please just talk to her, get into therapy, so you can love yourself as much as she loves you. She did an amazing, selfless thing. Her husband could have stood by her but didn't. Divorce is complicated, as someone else mentioned. Don't blame yourself. ",
            "Your sister had a tough choice, but although she was pregnant she risked losing her little brother. We can see from her actions that she couldn't bare to lose you and wanted to help you. There's no reason to look at the risks of her surgery if nothing come of it. You're clearly very special to her and she loves you dearly. \n\n Ultimately she probably saw it as being as simple as being able to make another baby at a later date. She couldn't have known her marriage would break down but I do know that it's likely...although her actions concerning you were an issue in her marriage, it's likely there were other factors at play too - perhaps not as big as the abortion but if there was only one thing at play and they remained married for a year after, I'd imagine other smaller things may have contributed to the bigger picture. \n\n You have an amazing sister. She didn't tell you any of this because she knew you'd blame yourself or not want her to go through with it, initially for the abortion and now the marriage. The thing is you know now. If I were you I'd talk to her. \n\n I don't think there's any good to come from pretending you don't know. Don't be angry or upset but talk to her. If you need help comprehending the fallout from your chance at life, /u/LilaLaLina offers sound advice. Don't completely rule out counselling because it can help but I believe the first step towards lifting the weight from your shoulders *and* your sisters is talking to each other. \n\n **Nobody** is at fault here. I don't doubt you can get through this stronger together. As much as your sister is amazing for what she's done, you're equally amazing for caring so much about your sister and what's happened to her. You already have a strong family bond, this can only make you stronger because you clearly both care a lot about each other. ",
            "I'd have done the same thing as your sister. No way could I watch my brother dying if I could do something to save him. You can get pregnant again, and it was only 2 months along, who knows if it was viable. \n\nThere's always more to a divorce than what meets the eye. I couldn't stay with a guy that wanted to risk my brother's life like that, regardless. ",
            "She values your life, someone who was living, known, and already loved by many, more than the would-be life of her unborn child that nobody knew about. \n\nShe knew she'd have other chances to give birth and love a kid. But she'll never have another you... imagine the guilt she'd feel if she never took the risk of the surgery?\n\nYou can talk to her. Not sure what you should say, but try to console her and thank her. Telling her \"I was ready to go, you didn't have to do that\" wouldn't help her feel better would it? Wouldn't that just make her more confused and hurt MORE about her sacrifice?\n\nAnyway, be grateful for your life and don't waste it being sad. Try to help her out of her slump. Nobody knows the true depths of issues in her relationship outside of what they know about the disagreement about what to do about you, but you're her brother, not his, so he had no right to fight her or \"not forgive\" her. However, it was his right to leave her. It was also his potential child, and probably made him sad. Maybe he couldn't get past that when he looked at her, even after the counseling. But there also means their values are different and it's not your fault or even hers. They weren't meant to be together if he couldn't work past that, which is ok.\n\nHopefully she finds someone more compatible. But you gotta date to meet someone, so there's that!",
            "Mate, at the time her options were \"watch her brother most likely die and maybe have a healthy baby a few months later\" (these things aren't always certain), or \"terminate and give her brother a reasonable shot at life\".\n\nThere is nothing you can say or do to change how things panned out. For the love of all that is sacred don't mention this to your sister - she probably didn't want you to be burdened or have you looking at her with pity. She did the best she could with the information she had at the time.\n\nIf it does come out you know, say you're terribly sorry about the huge personal toll it took on her, but that you're grateful. And that you didn't want to mention it because she asked your mum not to say anything and wanted to respect that.\n\nPerhaps see it as a blessing in disguise: Your ex BIL sounds particularly heartless with his expectation your sister should have put his feelings and a small cluster of cells above her own brother *who was literally dying*. Seriously, your sister is a fucking hero. I'm sure some guy somewhere would be proud to date/marry a woman who put her life on the line for her brother.\n\nIdea of the day: if you marry and have your own kid, name him or her after your sister (obviously ask her / your spouse if they're on board with it). Your sister sounds like a champ. I'd say send her a bottle of wine but idk if you can drink after that sort of procedure.",
            "Speaking as a husband and father, the only person who failed here, it looks like to me anyways, is the ex-husband. Your sister had to make a terrible choice, and your ex brother in law should have supported her no matter what, because either way it was an unbearable thing for your sister to go through. He failed to really provide that support.\n\nHis failure here shows that when the rubber hit the road, he wasn't up to the job of 'husband'. This brought about a divorce which, given what we learned about the husband, may well have been coming anyway. \n\nSorry if I sound harsh, but if I am the husband here, I grieve, but I also make sure my wife is first and foremost supported.",
            "Look, you have life. Don't hate yourself because you're alive. If you hate yourself and throw it away then you piss away your sister's life and her sacrifice. What happened between her and her ex-husband are her actions and her marriage. That isn't on you. It isn't meant for you to bare. \n\nShe chose to give you a second chance at life. You know what you do with it? \n\nLIVE IT. ",
            "I'm sorry your sister was dealt those cards in life. There were two options\n\nAbort the baby and save your brother. Her husband resents her leading to divorce.\n\nLet you take your chances, most likely die. She resents her husband leading to divorce.\n\nThe husband wanted a miracle. You would live and the baby would live. That wasn't really in the cards. One of the above scenarios was. I'm sorry their marriage couldn't survive that. It's not your fault or her own. She may regret it because she may now believe you may have lived and the baby may have lived. That was a very slim chance. \n\nNot every couple is capable of surviving that type tragedy/loss.",
            "This sounds like it was just an overall shitty no win situation, so unless it was overwhelmingly in your control to not get sick in the first place, this is not your fault.",
            "There was no right or wrong choice. She chose the brother she already had and loved over the potential baby she didn't have yet. You should not burden yourself with a choice that she made, she is an adult. ",
            "At one point, my brother needed a liver transplant. He ended up needing a double heart and liver transplant from the same person, so I was made not an option v. quickly, but if I had been in your sister's situation I would not even have hesitated. I did end up losing my brother, and if I had felt ANYTHING prevented me from saving him, I would have resented them forever. \n\nYour sister knew what she was doing. Talk to her, respect her choice. She loves you.",
            "She can get a new husband. She can find happiness after a few years of depression. She can have another baby. But once your dead there's no fixing that",
            "OP, this is in no way your fault. Your BIL made a horrible decision. Your sister saved your life. And I guarantee you if I was in her place, I would have done the EXACT SAME THING to save the lives of any of my siblings. And I struggled to get pregnant. I would still have done it.\n\nThis is the damn definition of an extenuating circumstances. \n\nI definitely think you should speak to her. Tell her your mother spilled the beans. I'm sure she'll tell you she doesn't blame you, and you shouldn't blame yourself either. She saved your life, how could she be upset? \n\nPlease don't blame yourself. \n\nEdit: you know what. That man literally wanted her to let her baby brother die for a fetus. I wouldn't wanna be married to someone like that. ",
            "Your sister is a wonderful woman.  She not only saved your life, but she spared you the very painful details of how it happened.  She probably thought you would heal better without the guilt.\n\nI don't know what the right thing to do is, but if it were me, I'd go give my sister the longest, biggest hug ever.  Then I'd gently let her know that I know what she did, that I love her for it and that if and when she wants to talk about any of it, I will be there.  She might be relieved that she can finally share her pain with you.  Again, who knows what the right thing to say here is, but I wish you all well.  ",
            "Shit. I don't really have any advice for this really. I just wanted to give my condolences to a horrible situation. Absolutely nobody did anything wrong here. Not you. Not your sister. Not your mother. And not your ex brother-in-law. Just a group of victims faced with an impossible decision. I'm sorry, and I hope everything turns out okay.",
            "Your sister is incredible and deserves an incredible husband. I'm sorry, but her husband was not incredible. You should talk to her, but don't ask her to assuage any guilt you feel. Just tell her you understand the gravity of what she did for you and that you'll forever be grateful, and whenever she needs you, drop everything and be there for her.",
            "Your sister seems like a very mature, thoughtful person to have both done what she did and never tell you about it. She could have, after the divorce, told you out of sadness, anger, spite--but she didn't which says a lot about her. This gives good indication for how thoughtfully she would likely go about discussing the situation and your feelings with her. ",
            "Your sister saved your life. An existing person.\n\nHer husband wanted to risk your life for something that isnt a person that can always come about again.\n\nSorry, but sounds like the husband was a douche.\n\n",
            "First of all, her life is not \"destroyed.\" If her ex couldn't countenance her choice, he was not the right man for her! Plus, she will rebuild her life; it just won't look like the old one.\n\nSecond, opting an abortion plus a liver donation is a hellish choice. (As her husband, I too would have been very concerned.) However, it sounds like you have lost track of a key fact: it was HER choice, not YOURS. You are not responsible for her decision.\n\nWhich leads me to the last point: you dishonor her sacrifice if you do not embrace and make the most of your second chance at life. That includes being happy, dude. Yes, her life took an unfortunate turn of events, but I posit that your transplant was merely a catalyst and not a cause. I believe they would have eventually divorced; this life event merely hurried the process along.",
            "Whatever she did was her choice and it is in no way your fault. I can't imagine how hard it is on you at the moment. Get to therapy and work on this together as a family.",
            "If she hadn't done it shed be even more sad and it would be impacting an innocent child also. The stress of that probably would have lead to divorce made even worse because a child involved. \n\nGo talk to someone and suggest your sister do the same. ",
            "Your sister is a damn Hero.  She made a hard choice for what she believed was right.",
            "now that's pure love",
            "By grateful to your sister and don't squander the  second life she sacrificed so much to give you with self pity and hate. It's about you but it also not about you.  The marriage was doomed because your sister couldn't live with herself or her husband if she let you die. Go talk to your sister,  tell her you know,  tell her you are grateful,  tell her she's an amazing person and help her get back on her feet. ",
            "I just wanted to say. I have a sister I love to death. Between saving her life and keeping what is not even a child yet I'd pick my sister any time. See things are hard to explain and hard to understand. You two need consuling together and individually ",
            "If I was a match for my husband's brother, I would terminate our 2 month pregnancy to donate my liver to save his brother. It's an awful position for her to have been in, but really it was between her and her husband. They weren't compatible because they had different views and valued/prioritised different things. \n\nI know it was a tough spot for the husband to be in as well, but to have so little understanding and to offer so little support to his wife over something like this - I mean, the pregnancy was very early and could have miscarried anyway, they could make a new baby, and time was running out to save you, a person they could never replace. \n\nI expect your sister is feeling sad because she found out that her husband wasn't who she thought he was. And now that you're okay and things are back to normal it's probably difficult for her to remember exactly how it felt to be on the brink of losing you.\n\nI don't think you should tell her you feel bad, or that you wish she had let you die or anything, because what's done is done and that will only make her feel worse! Tell her you are so unbelievably grateful for this gift she gave you, that you are enjoying life and appreciating every day that you have to experience now, thanks to her and her sacrifice. Make her feel good about this, let her vent about what happened with her husband and help her to see that she made the right decision and should not have any regrets. She will find another man, she will go on to have a family of her own, and her kids will have an uncle! \n\nShe made there might choice, she couldn't have done anything else because that's clearly the kind of person she is. And if her husband couldn't see that and be proud of her and appreciate that about her then it's completely his loss.",
            "Your sister is an angel who loves you and honestly think about it if you loved someone as much would you have not done the same? No one decision can permanently ruin a person's life (except for suicide or obvious things like that). Your sister saved yours and you should definitely talk to her and provide as much support as possible. If her husband walked out knowing what she did for you and the amount of mental anguish and stress she must have been under in making that decision well then he's probably not the right person for her. At any rate, do not feel guilt, see this as an opportunity to enjoy life and connect with your sister on a deeper level and make her happy because she's genuinely a wonderful human being.",
            "I know I want kids and that my window of opportunity is getting smaller, but I would abort a million babies to save my brother.",
            "Your sister chose to make that sacrifice to save your life. I know it may be hard but I think it would make your sister very happy for you to be happy and successful and too use this second chance at life to the fullest. She made her decision and is living with it. Time will heal her wounds. Don't make her regret her choice by feeling guilty or anything negative. But definitely talk to her it may be the best thing you can do for each other. ",
            "Her ex didn't care as much about you as your sister does because he was only in love with his life. He wasn't thinking about the little sister she had known her whole life and what it would mean to lose her. At 2 months pregnant it is not as significant of a loss, sorry it's just not, but losing your little sister would be. The decision for her was clear, it's just too bad her ex couldn't see it that way. All I can say is that you just need to be a kickass sister to her for as long as you can. Maybe help her pick up the pieces, it's not like her ex was a selfless kind of guy anyway. Things will change.\n\nI mean no offense to anyone who has lost a baby at two months gestation but I think most would agree the loss of someone you have loved your whole life would be worse. ",
            "Your sister did a selfless and amazing thing and while you both shouldn't feel bad, I understand the feelings behind it. I agree with other comments about a counselor and telling your sister you know. ",
            "I wouldn't be apologetic either.  I completely understand your sister's position there and I would have made the same choice in a heartbeat to save one of my siblings.  I also would not want to stay with someone who blamed me for making that choice to save my sibling's life.\n\nYou and she have years of shared history... compared to a 2 month fetus?  I can understand feeling hurt and disappointed at losing that potential child but nothing, except his misplaced blame, was preventing them from conceiving again.\n\nTalk to your sister and let her know that you know.  Talk through these things together.",
            "If we were in a movie I would say, \"She saved your life, time for you to save hers.\" Then you would go turn her life around. Writing scripts is easier than writing real life though...",
            "She made her choice and it's not your fault. What happened between your sister and her ex is also not your fault as whatever happened their relationship in dealing with the dilemma was between them. \n\nTalk to your mom about it first, tell her how you feel and that you want to talk to your sister.  Then maybe your mom can talk to your sister about it and if she agrees you can all talk it out and maybe get some counseling.",
            "Don't feel guilty. What your sister did was for you. She saved your life - you shouldn't feel bad about that.\n\nEven if that meant that her husband didn't agree, or that she'd have to abort her baby, or that her marriage would break down. If you looked at it from her perspective, it was either losing you, or losing her marriage. Whether you should ask her about this is up to you, but maybe it's time for you to come clean for both of your sakes. This must be as much of a burden for her as it is for you. She loves you. Don't feel guilt over that.\n\n",
            "I would talk to your sister. Tell her how you are feeling and tell her you wish she hadn't of kept you in the dark. Express your feelings but make sure to let her express hers, especially if she is going through a hard time. I honestly think there had to of been more to their marriage issues then the abortion. Does your sister have fertility issues? They could always try and make another child, while your life wasn't guaranteed if she didn't do the transplant. Be thankful you have an amazing sister who did that for you and don't ever blame yourself for her divorce. There had to be underlying trust issues or something else you didn't know about. Talk to your sister. Stay strong and remember to be thankful for the life you have and don't ever blame yourself. She saved you for a reason. That was her choice. ",
            "It's not your fault. You sister was is a difficult spot. What she did for you was a great gift and I am happy for your sake that she did. As far as her marriage, what she did felt  unfair to her husband. To terminate a wanted pregnancy without his consent. \n\nI am trying to put myself in his and her shoes. People have very differing opinions of what \"life\" is and when it starts. For those who view it as a bundle of cells like she probably did, it's a no brainier, giving her brother a chance was the right decision. On the other hand if he already thought of it as \"his baby\", then it had to be very painful for him to see her terminate. I don't think BIL was a bad guy if you consider than in his eyes he was trying to protect his unborn child. I think either way the marriage was in trouble because one of them would have had resentment. \n\nThe important thing is that this is not your fault. You didn't ask to be sick or for anyone to make sacrifices. Talk to your sister be supportive and kind. Don't beat yourself over it.\n\nEdit: downvotes for trying to see both sides of the situation?\n",
            "From a moral standpoint she did the right thing. The \"baby\" was only an inch long. Before three months if the period of greatest danger for a miscarry, moreso with this stress level. It didn't have a brain or feelings. If they had wanted to try again it'd only be a matter of time. Sacrificing you for a tiny 10% of a baby is ridiculous.\n\nIf she was the one who was sick and it was \"Treatment or pregnancy\" her doctors would strongly encourage her to abort and seek treatment, even if it would also make her infertile (Which it doesn't sound like she is).\n\nIt's not your fault you were sick and it's not her fault she did the right thing. In her place I do it every day of the week and twice on Sundays.\n\nTalk to her and seek therapy together.\n\n>My brother in law was a very decent guy. \n\nHe put his dumb inch long fetus ahead of your life. A fetus is easily made. A new /u/Jayx8 much less so. He will willing to let you die and to reject his wife rather than try again.\n\nI think your BiL is an asshole.",
            "This brother in law sounds like a douche. You can make another baby. You can't make another brother.",
            "I hope you know your sister loves you very much and she's an amazing sister and you're lucky to have her. \n\nI think that if she didn't do the abortion to save your life and you would have died then she would have blamed herself for the rest of your life. \n\nMaybe she would have ended up divorcing her husband anyway, if she thought that if it wasn't for him you would still be alive. Her husband doesn't sound like such a great guy if he was happy to stand idly by while you were dying.\n\nYou got some very good advice from the other people here, which I hope you'll follow. Just do your best to be there for her and help her get through this rough patch in her life.",
            "Fun fact: It makes more sense biologically to save your adult sibling than your unborn offspring. You share the same amount of genes with both of them but the unborn child is gonna have a lot of opportunities to die before procreating and spreading your genes further. It's like a textbook example actually. I'm a biologist.\n\nanyway: super awful situation and I think their relationship was doomed the second he asked her to leave you to die.",
            "I would have done the same thing as your sister. I would have chosen the life of my immediate family members over the life of an unborn baby and over my marriage. I would hope that my husband would agree but if he did not, it would be a risk I would be willing to take.",
            "Something else would have caused the divorce then, and there would be a child involved at that point. Find a counselor through the hospital you got the transplant through. ",
            "guilt is only self pity in disguise - ditch it. choose to be thankful instead. talk to your sister.",
            "I am really surprised that your transplant team green lit your sisters decision to abort a child in order to give you part of her liver. Organ donors go through rigorous psychological tests and assessments to determine if they can handle the act of giving part of their body to another person, because it is a massive toll on the donor both physically and mentally. I'm just really, really surprised that this was allowed. Giving up an organ is taxing enough, never mind also giving up a child in order to do so.\n\nHaving said that, it appears that she was cleared by your transplant team which means they believed she could handle it both physically and mentally. This decision was not made lightly by any means. I would hope that the transplant team factored your sisters husband into this scenario and provided them with access or resources for counseling. Whether or not they sought counseling or he made up his mind to divorce her as soon as she decided to abort is unclear. \n\nYou should definitely seek counseling through your transplant team. In addition, consider broaching the subject with your sister. A discussion needs to happen to relieve the tension from this secret she's been keeping and the guilt that you are experiencing. She gave you a second chance at life and you need to live it to its fullest capacity, and that includes maximizing your relationship with her and your family. No more secrets. Love her endlessly for the time back that she gave you and the enormous sacrifice that she made. She loves you that much, as illustrated by her actions. Reciprocating it and being the best brother you can be is the least you can do, and you seem smart enough and kind enough to know how to do that for her.\n\nGood luck, OP.  ",
            "[deleted]",
            "Ugh. This is a really shitty situation and none of it is on you. In fact, it went shitty right about where her ex husband said they should just hope you magically got better. He did an evil and selfish thing there by putting your sister in a situation that was impossible to win. Either she did what she felt was right and lost him,  or she obeyed him and lost you.  As soon as he made that threat (and that's what it was) your sister was never going to go back to being happy.\n\nSure. Learning  that his wife wanted to abort a much anticipated  child in the early stages of pregnancy had to be rough... but she had a good reason. They could have tried again  once she recovered.\n ",
            "You have a wonderful sister who loves you greatly.  Just be grateful for this.",
            "I would 100% talk to her about it, I'm sure she needs a lot of support right now also. \n\nShe gave you a life you could have lost. If I was you id show her you're living it to its absolute greatest potential and hope that she sees theres more out there for her also by your example. ",
            "If my sister did for me what yours did for you, I would get on my knees, kiss her feet, and thank her every time I see her. I would live my life so she would know that her sacrifice was not in vain. \n\nAlso, she is an adult who made a very serious decision, she weighted her options, put a lot of though into it, and chosen the one which was right. There is a price to pay when making such decisions,  no matter the choice. If she had chosen differently and you passed away, her marriage would not have survived either,  since now just looking at husband would be a reminder of your passing. This is brutal. \n\nBe the best sibling there was for your sis, she will recover and make a good life for herself. ",
            "Don't hate yourself, ever. Love yourself. You owe it to your sister, because she loves you so much. If you feel compelled, thank her. If she wants to talk about it she will. Just make sure you show her, by living your life to the best of your abilities. If you ever fall into a slump (you're human, we all do) just remember that people love you. Sometimes it's hard to realize, but you have the proof. ",
            "OP, my suggestion is this: instead of \"hating yourself,\" LOVE YOUR SISTER and be there for her. That's really quite the sacrifice. All you can do is appreciate what she did for you. That's true love.",
            "First of all, do not blame or hate yourself. \n\nSecond of all: your BIL was not that great of a guy. Sometimes people seem really great, until you see them in a situation under pressure or dealing with adversity. \n\nYou have no idea what was really going on in their marriage. But marriages typically do not end over one single issue. \n\nIn this case, your BIL wanted to make a decision about your sister's body and possibly let you die. Your sister, rightfully, decided that she was in charge of her body and what she does with it. Your BIL held that against her and decided to end their marriage over it.\n\n\nNone of this is your fault. Neither you, nor your sister, did anything wrong here. ",
            "\" My brother in law was a very decent guy\"\n\nClearly the fuck not.He's selfish assholery not only could have killed you, but has caused all this pain for you and your sister.\nAnd yeah, you should tell her that you know, and talk with her.\nHer ex left y'all with some baggage\n\nIt's not your fault.\n\nIt was always his.\n",
            "She definitely loved you too. Enough to do what she did. Instead of bringing more bad energy to the situation, tell your sister how much you appreciate what she did for you. She decided to do t on her own. Also, your brother-in-law couldn't have been that great of a guy if he divorced her for saving her brothers life. He clearly had no care for you or the relationship you and your sister have. I mean it's her body and if he couldn't accept that then maybe he wasn't the right guy.",
            "None of this was your fault.  Don't believe for a second that the decision your sister made was an easy one.  Sacrifice her baby to save you, or watch her baby grow up and hating herself for having let you go.\n\nYour sister loves you beyond measure.  I hope you know that.  If you do choose to talk to her about it, make sure you tell her that there isn't a day that goes by where you aren't thankful for it and you're incredibly sorry for the sacrifice she made.",
            "[deleted]",
            "No she made the right decision. Your brother in law is selfish. they can make another baby. They cant make another you. She saved your life because im sure she realized she could make another baby. This is why i have no problem aborting a baby that has deformities that will not allow it to live the life ive been able to live.",
            "[deleted]",
            "This story made me cry a bit. This is a sad but very beautiful story of sacrificing herself and her baby to save you. Like many people have pointed out, you two should really talk and hopefully it will bring you two closer together. \n\nIt is unfortunately that your brother-in-law wasn't there to support your sister even after the abortion, but I think it is your turn to support her. Let her know that her sacrifice wasn't in vain. Enjoy life together and help each other. \n\nThis is a type of situation to never feel guilty about and to keep moving forward so you don't regret it. Don't let her sacrifice go to waste. No one should ever fault you or your sister for making an impossible decision. \n\nThere are also tons of resources out there to get help like counseling. Give it a go. ",
            "Just support her. Talk to her and work through this together. You both love each other,  remember that.\n\nI have a little brother too, and I would have made the same decision in a heartbeat.",
            "What a messed up situation. Look, OP, your sister did the same thing many of us would have done to save the life of a family member or close friend. Her husband was incredibly selfish about it. Yes, the pregnancy was wanted and the surgery was risky. But if my wife had to make that same choice I would absolutely back up that decision, as would she if I was in a similar situation. \n\nIf your sister made a mistake here, it was by not giving you full disclosure at the time, but that a tricky one, too. Knowing she would be terminating a wanted pregnancy which would most likely end her marriage, well, let's just say that many of us would have a hard time asking someone to make that sacrifice. She most likely knew you would refuse and that was unacceptable to her. This was her brother's life, and she could directly affect this outcome. \n\nI think you need to talk to her. There is no way for you to unknow this. Don't throw your mom under the bus.  She made a slip and you found out. Do not blame yourself; the choice in this matter was taken from you without your knowledge.  The best thing you can do is try to move forward with your sister and mother and see what can be done to make the best of a messed up situation.  The good news is that you are alive to help her through this.\n\n\n",
            "You cannot feel guilty for something you didn't cause on purpose or asked for. I'm really sorry but I can't help to feel that your brother in law is/was being extremely selfish how can a situation like that \"sort itself out?\" and then when she saved your life hold your sister accountable for it? Also that comment your mother made of your sister not being sure if it she made the right choice pissed me off a little bit, how can saving your life not be the right choice? I know that it cost her her marriage but her husband was being unreasonable, I know that she is in her rights to feel upset and depressed and everything but your mother didn't need to burden you with it. \nI wish you all the best, and please don't feel guilty for surviving, your sister wanted you to and made the decision by her self. ",
            "May I know how did you got sick in the first place?  \nedit: wording",
            "This needs to be discussed immediately. One of the biggest problems on her side may be that it hasn't been spoken about between y'all, that is a very big cloud hanging about your heads. Your sister gave up so much for you. Don't feel sad for her, it was her decision. But be there for her, tell her and show her how much you appreciate and love her. Your sister did some amazing things to let you have life still. She cared so much that she gave up her own life. That's some love right there. ",
            "Nobody will ever know what is right or what is wrong. Who are we to judge? \n\nThe only thing I tell you, coming from a familiy with many secrets: please, please tell your sister that you know. Please, please talk to your former brother-in-law. Go get counseling, talk to each other!",
            "[removed]",
            "If she really felt a connection to that kid, she wouldn't have aborted. I don't care how sick you were. all of this is *decisions SHE made*. YOU, stop feeling guilty.",
            "Talk to her ex husband if anything but your sister chose to give you someone who she helped raise and loves obviously more than herself she might always wonder.and she probably has post partum but she most likely doesn't regret it"
        ]
    },
    {
        "post_id": "n9c90l",
        "author": "oldestsiblingTA",
        "title": "UPDATE: I (17m) cannot get my parents (45m, 44f) to listen to me regarding my sister's (6f) educational needs",
        "url": "https://www.reddit.com/r/relationships/comments/n9c90l/update_i_17m_cannot_get_my_parents_45m_44f_to/",
        "score": 4093,
        "num_comments": 145,
        "created_utc": 1620671161.0,
        "selftext": "Original post here: [https://www.reddit.com/r/relationships/comments/n5hlsh/i\\_17m\\_cannot\\_get\\_my\\_parents\\_45m\\_44f\\_to\\_listen\\_to/](https://www.reddit.com/r/relationships/comments/n5hlsh/i_17m_cannot_get_my_parents_45m_44f_to_listen_to/)\n\nHi everyone! About 98% of you were super wonderful on my last post and seemed genuinely invested so I thought I'd give you all an update. \n\nIt's been just under a week now and after trying some of the different tactics and talking points you suggested, in addition to reaching out to the deaf/HOH community, my parents and I have come to a compromise, if only to shut me up. But I'm not the one that's important here, that would be Ana (6f).\n\nSo, come the new school year Ana will be going to the school my parents chose BUT we (including me!) will be keeping in close contact with her teachers, specialists, etc, her progress and talking to Ana herself about how she feels. If it seems like it isn't a great fit, we will be transferring her to the deaf school. It's a little out of the area, but I think we can make it work. \n\nI did open up to my parents a bit - as much as they could handle - and told them that I feel like I've been, not robbed but had a stunted childhood and that my academic abilities forced me to grow up quickly. That, coupled with their emotional distance and lack of physical presence with Ana, made me angry and frustrated that my opinions on her future weren't being taken into account.\n\nI wish I could say that was what did it, but honestly my points about the school not teaching Ana independence and other arguments brought up on the original post probably eased them over to my side a bit (I kept my temper even this time).\n\nI mentioned in my edit on the last post that I'd gotten in contact with a Deaf Advocacy group and they've provided some wonderful resources so hopefully sometime soon Ana will FINALLY be able to meet kids and adults like her! (She's SUPER excited by this. She's the least reserved and most outgoing sibling out of us three so I've no doubt she'll make friends quickly.)\n\nI've also made the decision to start seeing a therapist to maybe work on some of the issues that I've been reflecting on and to get some emotional support where my mom and dad drop the ball. I don't see them changing or even admitting they need to change anytime soon. But that doesn't mean I have to stay complacent. \n\nThat's...more or less the main chunk of what I wanted to say. I notice the rules say we aren't allowed to upload images so I'll just describe the drawing Ana just gave me to pin up on my office wall (she's a brilliant little artist, I'm not even biased).\n\n*An ocean surface. A large boat approaches from the left hand side, full of garbage. A great blue whale stands, mid-breech, opposing, brandishing a gun in one flipper. A speech bubble from the whale reads* ***'NO!'*** *while the ambiguously-gendered humans on the Garbage Boat scream in terror, presumably ready to flee.* \n\n(Her kindergarten assignment was to come up with a way we can protect our oceans from pollution and personally, I think she's hit the nail on the head.)\n\nThank you so much to everyone for your thoughts and feedback!\n\n**TL;DR: my parents and I came to a compromise on my deaf sister's elementary school, I am working through my issues, Ana is getting to know her community and she drew an awesome picture today.**",
        "permalink": "/r/relationships/comments/n9c90l/update_i_17m_cannot_get_my_parents_45m_44f_to/",
        "comments": [
            "You fought for her. That's amazing. I know we're strangers, but I was a 17 year old once, and I know how hard it can be to stand up to the adults in your life at that age, so I'm really proud of you. And I'm glad your sister has you in her life. You did a good thing. \n\nTell her that her drawing is awesome!",
            "You are an amazing brother and I commend you for standing up for your sisters education. \n\nI have a degree in American Sign Language and Deaf Culture and I know how isolating it can be for Deaf children who are forced to mainstream into programs that don't cater to their specific needs. I'm so glad that you had a Deaf and HOH advocacy group reach out so they can help your parents make informed decisions on what is best for your sister. \n\nGood job. :)",
            "I am severely hearing impaired, have been since childhood, along with my brother.   I was raised in the hearing world and have always had to accommodate the world, never had any idea the world should maybe try to understand me, and I want to applaud you for standing up for your sister!  If you aren't hearing impaired or deaf, it's very hard to understand how casually you are excluded from things, with impatience or thoughts that you aren't very bright.  Putting your sister with a group of people with the same impairment is going to grow her confidence by leaps and bounds!  Kudos to you for being a wonderful big brother!!",
            "Hi! I might give you some insight on the Special Education world. My training is in working with the blind and before that linguistics/language development (important in HOH education). I also worked at a school similar to what Ana is going to. \n\nAll children in the USA are physically and educationally protected by the ADA laws. Families are permitted to challenge their school districts for free and equatable education. ALSO... look up the Expanded Core Curriculum for her diagnosis. These are like the Bill of Rights for kids with disabilities. Even if you are not in the US, ever country has an equivalent via the WHO. \n1) parents need space to grieve not having a “typical” kid. Grief is displayed is many different ways. I’ve seen parents who are helicopter parents, denial (to the point of physical neglect, denial emotionally and then passing it off as “not treating disabled child differently”, depression, etc.\n2) the private school I worked at was for blind children but they were actually medically fragile with blindness. However, (good news) the more abled children still benefited from one-on-one care. One child I worked with was deaf-blind and had been bouncing around foster care. The teachers, staff and specialists all were in one building and could customize the education and learning for her. Like you’re sisters, she had “behavior” issues, but once she was given the support she needed that was relieved.\n\nI know that the private school staff will push to have her in a public school when Ana’s ready. It’s drill into our head to give all students “equal educational opportunities”. No special education teacher would ethically have Ana there if she would blossom elsewhere. \n\n3) private vs public special education does involve federal and state money. It is possible Ana’s school district is pushing for the more localized school. It’s probably cheaper (but doesn’t mean less than). The deaf school might be residential  or private bussing services might be an added expense. Right now your sister qualifies for an interpreter in class. However! Professional ASL interpretators aren’t grown on trees and there’s always a shortage. Depending on Ana’s school district, there may not be enough qualified staff to fulfill the school district’s needs. When that happens, districts will try to centralize the students in one place.\n\nSpecial education needs vs special education professionals are a huge jigsaw puzzle. \n\n4) if you are in the USA, ADA protects student needs.",
            "That's so bizarre that they're choosing to send her to a school for kids with mental impairment and mobility issues when there's literally a deaf school they could send her to. \n\nHonestly this doesn't sound like much of a compromise, they're still just sending her to the school they want for zero rational reason and trying to placate you by saying \"well maybe if it's not good we'll pull her out sometime in the future.\"",
            "Speaking as former student who has graduated from Oregon School for the Deaf, and have been attending mainstream from pre-school up to 9th grade (10th-12th grade was at the deaf school), I can personal say that my social experiences were much different. \n\nDo keep in mind that most oftentimes, deaf institute does not offer same level of education as mainstream may offer. This is often caused by HUGE variety of students' backgrounds, with some being growing up having absolutely no communication accessibility, to those that has been neglectful with their education. However, my BEST experience was to being able to communicate with everybody in my own language that i can understand the most.\n\nMy mainstream had Deaf/HoH program which advocate for our accessibility of education, such as making arrangements to have interpreter, 1 on 1 sessions and such. While that is amazing on its own, it could hinder the social development as it would requires less time of being around with peers. I was severely bullied and harassed throughout my time in mainstream up to where i personally decided to want to transfer to my deaf institution- for the sake of better social experience. \n\nIf anything, while your sister is not going to be attending to the deaf institute, I would ENCOURAGE you to maintain your contact in the deaf/hard of hearing community. Reach out to people, and try have your daughter being introduced to the culture and language itself. \n\nYou are amazing SODC (Siblings of Deaf Child/ren), and i applause you for taking steps in making sure that your sister would have the accessibility for her education. She will NEED you to help her through, so PLEASE stick with her when you can!\n\nPM me if you need any more info on deaf institute or ways to reach out to the community, i may have some ideas depending on where you live.\n\nPS: MOST of the time, your town should have a Facebook group delicates to deaf community, such as Deaf Night Out, Deaf Night Chat, etc. Do check around on Facebook, I'm sure you'll find some groups!!\n\n_\\m/",
            "This is so exciting! Thank you for advocating for your sister!",
            "Whale says, \"throw garbage off the dock and you're gonna get the glock\"",
            "This is awesome. You are taking good care of your sister and I'm sure a lot of people here feel proud of you. It's also very brave of you finally talking to someone (in this case a professional) about your feelings about your childhood. Keep taking care of yourself too :).",
            "Well done Ana is very lucky to have such a wonderful brother. \nAlso her drawing sounds amazing, she seems to have a lot of character and spunk! I love it\n\nEdit: sorry, was told OP her brother not sister",
            "You seem like an incredibly mature and thoughtful young man. Your sister is lucky to have someone in her life that is willing to advocate for her! Wishing y'all luck going forward.",
            "Arm the whales is the best answer ever - she sounds like an absolute gem. I'm so glad she has you in her corner. You are one heck of a good big brother.\nGood luck to both of you.",
            "I went to a regular public school but I had a speech impediment/accent so they put me in ESL (English as a second language). I found a lot of it a waste of time since I was a good reader/English was my main language, it was just pronunciation and talking too fast especially growing up in an immigrant household. Getting more personalized help later was what worked best for me. Obviously very different situation, but I agree with your idea that just because an educational environment is supposed to help students with special needs it’s not a catch all for all needs. Hearing and intellectual disabilities are very different, so while it’s good to be accommodating to everyone, those accommodations may not fit your sister the best. But it’s good to see how it goes since your parents aren’t budging.",
            "If the new school is good, albeit for children with intellectual disabilities, Anna will quickly stand out as being misplaced. The school will very likely suggest a different school more suitable to her needs. They won’t want to hold her back from her capabilities. Many deaf children were misplaced in institutions in the last century but special needs teacher will have covered this in their training and will be quick to spot the difference.\n\nYou’ve been a fabulous sister and advocate for Anna. She’s so lucky to have you on her side.",
            ">I don't see them changing or even admitting they need to change anytime soon. But that doesn't mean I have to stay complacent. \n\nThat is a powerful, eloquent statement.",
            "I would love an update on the update when the time comes. If that's allowed. \n\nIt made me so sad to read about how your parents were treating her as if she was naughty for not being excited to sit through concerts she couldn't even hear. \n\nThank you for giving Ana the attention you have. Good luck in therapy",
            "I'm really proud of you! I remember meeting my step siblings and then our parents marrying (quickly), being 19 and trying my hardest to advocate for my then 6/7 year old sister. She needed therapy... I knew it from the literal moment I met her. \n\n15 years later... She's finally in therapy and has been for a couple years. She has a diagnosis. But ... I tried for years at these parents and step parents and nobody wanted to hear it. It's hard. It's so hard sometimes to make parents listen. \n\nYou did the right thing OP.",
            "You are an amazing brother (and I hope you will use imgur to post Ana's drawing one day.\n\nYou obviously see that this is going to be a long slog with your parents, but I wanted to give a heads up with regards to this:\n\n>BUT we (including me!) will be keeping in close contact with her teachers, specialists, etc, her progress and talking to Ana herself about how she feels\n\nYou should find out from the school if there is any paperwork that needs to be filed if you want to talk teachers, therapists, or administrators about Ana. It may be that you'll need to draft a letter for your parents to sign.  Do if before she starts school if they allow; don't  wait until something of concern comes up.\n\nThat being said, it feels like you might have lost a bit of your own childhood with the upbringing you've had. Have some fun during your college years!",
            "I didn’t see your first post, but you are most likely very spot on regarding the school. I want to recommend that you get VERY clear on what it means for the school to be a bad fit. I’d create a clear list of observed behaviors or concerns. As a special education teacher and former director of curriculum for a special education school, these are things that I would include:\n\n1. Identify her reading level. I don’t work in Deaf education, so I can’t help you, but I imagine Deaf advocates could help identify assessments to get a clear baseline.\n\n2. Collect an informal writing sample that shows you letter formation, spelling, punctuation, grammar.\n\n3. See if the current teacher can give you a baseline for math (what she does and doesn’t know).\n\n4. Get an idea of her expressive language- this may be tricky, but someone in the Deaf community could probably help. How well does she communicate her thoughts? What vocabulary does she know/use?\n\n5. Get clear on what behaviors seem normal for her. What is her baseline emotional state? How does she respond to frustration or distress?\n\nThe school should provide an intake assessment, but if they don’t, see if the Deaf community can support.\nThen I would informally track these things weekly, especially her emotional world. She may enjoy the program because they don’t challenge her academically. They most likely don’t have high expectations and will tell you she’s doing great, because compared to her peers she is.\n\nIf she starts showing any changes in self-esteem or distress tolerance and emotional regulation, and the school has no clear plan for how to support improving these behaviors, pull her. If they seem too relaxed about it, or only rely on punishment/consequences, I’d pull her. For many kids, school can be traumatizing. It takes years to undo a year of shitty teaching/experiences in school.\n\nHaving worked at private special education schools most are absolutely not equipped to handle a high functioning, deaf child. Most likely, you are seeing deaf children with other disabilities that make being in a traditional school nearly impossible. What often happens in private special needs schools is that unless they are specifically for deaf students, they will lump her in with ALL deaf students, many of whom are severely impacted. This is often done because they don’t have enough kids to form an appropriate peer group. \n\nThis was an issue my last school struggled with when a child was more impacted in 1 way, but then additionally gifted. We had 5 children that were the same age and much more impacted physically than our other students. However, cognitively they were ALL over the place. Because we didn’t have the resources, we had to group them together to meet their physical needs and often ended up teaching them individually (which isn’t financially sustainable) so that they didn’t fall behind if they were cognitively gifted. I don’t know many schools that will do this.\n\nSo great step AND get clear on what signs mean pull her. I wouldn’t wait a semester to do it either as that’s too long at that age. Kids grow exponentially during that time so a few months is like a year for older kids.",
            "You’re a good bro, nice done",
            "You're a wonderful brother. As a teacher and parent the same age as your parents I was genuinely concerned by your first post. You identified your sister's needs so precisely and made it so clear that these needs would not be fully met with the original plan. Frankly your maturity and insight blew me away in that post, as did your courage and concern for your sister's needs in this. I don't mean in any way to be patronising, you should be so, so proud of yourself. You have wisdom and bravery beyond your years, and she is lucky to have you advocating for her.",
            "Are there other adults, grandparents, aunts, uncles you can enlist? I think there is a chance that a bigger fight may be coming your way.  Keep in touch with the Deaf community and put Ana in touch with it as soon as you can figure out the technology.  Also Ana's pediatrician.  Round them up, too.  Bless you.",
            "Damn you’re one amazing and mature 17 year old! Props to you.\n\nYou have self-awareness that many grown adults lack.",
            "It's good you and your parents are agreeing and going to be monitoring the situation. What confused me from your first post was how your parents got her into this school when she's got no diagnosed \"issues\", and other than being deaf, she's a normal 6 year old little girl? \nBUT this could work in your favour. The school will assess Ana, and may go to your parents themselves and tell them this school is unsuitable to Ana's needs. They might, or might not, recommend another more suitable school. So, with you, your parents and the school monitoring this ongoing situation, I think Ana will be OK. Its hard to admit when you're wrong. People called them \"ableist\", but I think it's probably more likely ignorance. Having had to \"normal healthy\" children,  Ana being deaf was probably 1 hell of a shock. Not saying that's right or wrong, just calling it as I see it. Your parents maybe be emotionally distant, but I'm sure they love you all, in their own way, and to the best of they capabilities. Sometimes, sadly, that isn't enough. So you being Ana's advocate is highly commendable. Because that's what you are. You may get outside help/advice, but you're the 1 pushing for what's best for her. An \"adult\" probably couldn't do any better than you have.\nI just want you to know that while doing all this for Ana is amazing, you still need to focus on you. You are still a teenager after all, regardless of your prodigious talents. Help, but help yourself too.\nAnd, I know it probably won't mean much coming from a stranger, I'm very proud of you and your love and care for another human being. Especially considering you're at an age when kids can have the occasional selfish tenancies. You're giving your sister the love she needs, that she isn't getting from other sources, and it's truly a beautiful thing. Thank you.",
            "So proud of you for seeking individual therapy and recognizing that there may be deficits in the emotional support you received from your parents. A lot of the dynamic you describe sounds familiar. Wishing you the best of luck in your journey. I found the book The Body Keeps the Score to be a really interesting and helpful read.",
            "Go you! It's always awesome to see siblings fighting for one another, I hope you realize how much more of a proper adult you were in comparison to your parents.:)",
            "I'm so glad you managed to get your parents to compromise, and that Ana will hopefully get the chance to socialise with other people who are deaf or HOH. It sounds like Ana's got a great person in her corner to help advocate for her needs. And please tell Ana that her picture is awesome, and I agree that arming marine life is probably the best way to go!",
            "I just read your original post and now your update and just wanted to say that Ana is very lucky to have a big brother like you on her side!",
            "I am touched and in awe of your love for your sister and how you fought for her.  I bow down.  Thanks for sharing your victory.  Please keep us up to date.",
            "HA! I can imagine that drawing. So happy for you and Ana.",
            "I commented on your original post. I'm so glad you're looking out for Ana and that you've opened up the lines of communication with your parents! I know there's probably a lot of feelings still there, but this is a really good step (as is speaking to a therapist). I hope it's the first step towards a more healthy and understanding family dynamic.",
            "She will THRIVE around other deaf children, given the opportunity.  My parents are deaf.  They both went to deaf schools, my father graduated from Galludet.  My dad worked as a computer engineer and retired at 54.  I am not a professional, but barring any other issues - any behavioral issues she may be having might be a result of just being deaf and not understanding her environment and not being able to communicate it well.  Being around other deaf children and getting to play and be social would be so good for her.  Also, being taught by teachers using ASL ... you can't put a price on that.  I hope your sister gets what she needs.",
            "How does that crown feel, King?",
            "I want to thank you so much for taking your time to be such an awesome advocate for her! \n\nMy brother is severely physically handicapped, and my sister and I have both consistently pushed for his personal and educational betterment; I know how hard it can be to stand up for someone's right's, especially when they cant do it themselves. You're a great sister, and you deserve a gold star!\n\n\n*Edited to add, If you wish to share her artwork with us,  I believe you can post links in the comments; Just upload it to Imgur :)",
            "Ah brilliant to see a positive outcome. I have been thinking about your situation since you first posted and I'm glad to see your parents are starting to come around. \n\nHave you ever thought about getting into advocacy as a career? I think you'd be great at it, or maybe a human rights lawyer or hostage negotiator! Something where you can use reason and empathy to help smooth out situations?\n\nThat picture sounds fantastic, by the way!",
            "You seem to be an extremely self-aware and reflexive dude. Your advocacy and respect for her needs/wellbeing is something else! Also that drawing is seriously creative and original. \n\nI hope the new school suits Ana and I wish you well in your studies and therapy process! :) well done man 👍",
            "Good job, I'm glad you kept your cool and got them to see your side even a little bit!\n\nAlso that picture sounds absolutely hilarious, great job Ana :D",
            "I wish I was this present and aware at 17. You're doing amazing.",
            "Oh man. You are an incredible older sibling. Your sister surely knows about your fierce love for her but maybe one day she will be old enough to hear this story and understand better. Way to go.",
            "Well done, you be surprised how far \"schools\" have become in dealing with students with disabilities. Your parents might be from an era where disabled children were put into a institution or think that way. Most schools will implement an Individual Educational Plan for your sister, probably provide her with an EA Interpreter. It would be great if the Teacher learns ASL and maybe even help your sister's classmates learn some simple sign language greetings. Good luck and I'm sure your sister will excel in her environment.",
            "I am so proud of you. You are a remarkable brother and a wonderful person. You and your sister are so lucky to have eachother. ❤️",
            "You are such a loving, caring and strong sister. I am praying my kids comrow up to be even  half as awesome as you one day 🙏",
            "Extremely proud of you!",
            "Thanks for the update! I am glad you at least aired out a few things and concerns. Sounds like you are such a great guy. I wish you only the best!",
            "You could've been my little brother. I'm so proud of you! Keep on rocking :).",
            "You are an amazing brother. Thank you for fighting for your sister. You shouldn’t have had to do so but I am also so glad you are getting therapy to help with some stuff. Reading this made my day and reminded me that there are good things and good folks in the world 💕",
            "You are an AMAZING big brother. Please continue looking out for Ana, she's so lucky to have you. You should be proud of what you've been able to do for her. I wish Ana the best of luck with her schooling and advocacy group.",
            "Good job big brother! I might have been some of the less encouraging ones last time because I know what it's like to have parents who treat you like an adult in some areas but not others. The most important thing is that you're there for your sister and taking care of your self, you're awesome and you got this.",
            "You're a kind-hearted person.",
            "You’re like the best person ever wtf",
            "BBBE! \n\nBest Big Brother Ever!",
            "You sound like a wonderful person. Like someone who deserves all the warmest hugs",
            "You know, it’s funny. I was somewhat of a prodigy, but due to instability in my home, I didn’t have the support that I should’ve had. That being said, I am rather successful in my field, and I’m rather proud of myself. I only mention this, because I remember what it was like at that age. It’s very isolating. Everyone talking around you, and you having no frame of reference for what they’re talking about, except in a purely intellectual form. It just makes you feel very apart and like you somehow missed a memo on what it means to be what she you are. I think you’re going to do well in college. For me, that was when I sort of, came out of my shell. I hope that happens with you, in the way that you need it, like I got it in the way I needed it. well you do have problems with parents, and who doesn’t? They really do seem, to at least, value your opinion, they listen to you, and more than that, they respect you. You’re very lucky. ❤️",
            "Dude what you did is amazing, and I say that as someone who possibly may have some form of mental disorder, my parents were in the picture but they were overworked. \n\nI've come to terms that they did what they did and hoped for the best. Things well... are another story. Everyone thinks I'm not normal, that's how it is.\n\nBut my lil bro, the dude no one expected, whom I held in my teen years and I vowed to never let him go through same. I don't believe in anything, I asked the person who raised me (wherever she is) to spare him, alas the boy still developed something. I sensed it.\n\nI fought, I cried, I downed books in autism, I did whatever I could even when the parents were being stubborn. I've gotten punished to hell and back, even whatever I had got worse. But it was so worth it when a teacher told them that they should listen to me and even better when a diagnosis came back. We knew, we could help my lil bro. That's what matters.\n\nThat's the best part, that we did something so they didn't have to be on their own.",
            "[deleted]",
            "Have you considered perhaps looking for as educational advocate to help you.\n\nKeep being a good man and take care of yourself.",
            ">An ocean surface. A large boat approaches from the left hand side, full of garbage. \n\nThe imagry of garbage is commonly used to indicate the waste, the filth, the baggage we wish to exercise from our lives. The movement from left to right, at least in western cultures, represents some from of positive progression. \n\n>A great blue whale stands, mid-breech, opposing,\n\nThis could be a symbol of freedom. A large, majestic, mammal escaping the confines of its environment in order to experience the sensation of another.\n\n>brandishing a gun in one flipper.\n\nWait... What? This sounds dope AF. Somebody call up Karl Smallwood and get him to put this on a shirt: The Killa Whale. \n\n>A speech bubble from the whale reads 'NO!' while the ambiguously-gendered humans on the Garbage Boat scream in terror, presumably ready to flee. \n\n>(Her kindergarten assignment was to come up with a way we can protect our oceans from pollution and personally, I think she's hit the nail on the head.)\n\nI wish I was capable of drawing anything half as speculator as this when I was her age. Though, I am a bit confused about one thing: who exposed your sister to the concept of using guns as a tool for defense and intimidation? Because, with the parents you've described, I have a hard time picturing them letting her view media that displays weapons.",
            "This is just more parentification aka abuse by your parents.\n\nDrop the rope. That 6yo isn't your responsibility and stop acting like an exasperated wife hoping her husband helps her out.\n\nDon't fucking do their job for them at all.",
            "That's great news but I am very curious--  how are your parents taking?  I have a feeling that they are not happy that you think they are bad parents or something?",
            "I love that you've stood up for your sister. \n\nIt would be lovely if you learned some sign language to communicate to her or to teach her.",
            "As someone who took 7 years of ASL, was in ASL Honor Society, had the same teacher for all 7 years who adored helping the deaf community, and working closely with them and deaf kids in my school, there are two schools of thought here. On the one hand you have the safe route of a deaf school. This would be the easiest fit for her. On the other is a public school with a deaf program. Deaf programs in schools can vary wildly, so make sure that you find a good fit. On the plus side this would acclimate her to interacting with non-deaf students/people at a much faster rate. Good luck!",
            "Wow, you’re really brave dude. I would have never been able to do that at 17 and understand the nuance you were able to understand. It’s rare where I see someone make such an impressive stand at such a young age. You’ve likely really changed your sisters life beyond words. I’m a cranky ass 40 year old man and I’m getting misty eyed.",
            "Hello, I'm popping in extremely late with anecdotes! But your situation really resonated with me personally.\n\nI have a deaf cousin who has been infantilized all her life for similar reasons as your sister. My cousin is (maybe?) a little slow. I don't know her IQ, but let's say it's 85 in a family full of 130's. She attended a school for the deaf, but it was one where deafness was basically equated with intellectual disability. When she became an adult, her parents wouldn't let her move out. When she fell pregnant, her parents wouldn't allow her to marry the father. Not because she would lose disability or insurance benefits (she would not have), but because they didn't think she had the capacity to live on her own. She was not allowed to have a job.\n\nThe reason I say that she's \"maybe\" a little slow is that, in my opinion, no one has any idea of her intellectual capacity because she was never challenged or expected to do much. My \"proof\" of this is that when she was in her 40s, after her kid grew up, she took control of her life. She got a retail job, and she moved in with her kid's dad. (He is also deaf and was an involved parent, despite not being able to marry her.) She learned how to cook (which she was not allowed to do because she burnt something when she was like 12), and how to generally take care of herself without having to be reminded of basic stuff. Her mom still does a lot for her, though, like taking care of all of her financials and driving her around (another thing she was not allowed to do).\n\nIn contrast, I went to school with a seriously intellectually challenged girl who is now a successful real estate agent. (Our families knew each other so I know for a fact she tested just above borderline in elementary school.) In my inexpert opinion, my cousin is much more capable than the girl I went to school with. The difference is, the parents of my schoolmate had realistically high expectations and they did a TON of work to help her become independent. She went from remedial 2nd grade to being mainstreamed by middle school. She was even in a gifted math class in 8th grade (She fell behind on the gifted track, but I think she got up to trig.) She graduated from college.\n\nAnyway, all that's to say, there's no reason your family should put an artificial cap on your sister's capacity. It's a huge disservice. It might take being *extremely* involved as a parent, and it might take her a little longer to learn things, but there's no reason she can't be given *a chance* to operate at her full capacity.",
            "I am hoping that the school will recognize your sister's needs and be more concerned that they are being met than with receiving any tuition your parents are paying. Hopefully, the school will inform your parents that your sister is not intellectually impaired just because she is deaf.",
            "Is there a best big brother award? I'll make you one if there isn't"
        ]
    },
    {
        "post_id": "4nulgv",
        "author": "newfeelingsthrow",
        "title": "I [26M] have from Aspergers and thought I was asexual, Ive met someone [23F] that makes me question everything. Band aid is off",
        "url": "https://www.reddit.com/r/relationships/comments/4nulgv/i_26m_have_from_aspergers_and_thought_i_was/",
        "score": 4078,
        "num_comments": 222,
        "created_utc": 1465803274.0,
        "selftext": "original : tl;dr:Im in love for the first time in my life with my friend, Im not sure what to do as I always thought I was asexual\n\nhttps://www.reddit.com/r/relationships/comments/4lumdd/i_26m_suffer_from_aspergers_and_thought_i_was/\n\n\n\nAfter a lot of thinking I decided I wanted to give it a shot. I was still scared I might lose her friendship but if she was with someone else because I never said anything I would probably regret not saying much more. \n\n\n\nWe were watching another episode of game of thrones which we do weekly. \n\nI was planning on just telling her I like her after you guys advised against the \"love you\" but it also made it hard for me to articulate my feelings\n\n\nInstead I listed all the things she does that I think makes her unique and awesome. At some point I mumbled that even though she was extremely messy and disorganized she was capable of anything and everything. She looked a little worried  \"if you were my doc Id think you were about to deliver my death sentence why are you being nice, you never compliment anyone, are you feeling okay, dont freak me out\" she started touching my forehead for my temperature and since I was nervous as fuck I was a tomato probably over heating. You could probably cook an egg on my face. \n\n\n\nI suck so I ended up blurting out \"I think Im in love with you\". yeah I realized I F up and said \"no I mean like, like you\" \n\n\nShe went from worried to confused to humored. She stared at me for a while and this just made it worse as I could tell she was smiling but I wasn't sure if she was laughing at my stupidity or what. She teased me for a bit as to \"which is it, like or love ?\". I said I didn't want to scare her so she can pick which ever she liked. Yeah .... \n\n\nSo I started back tracking and said she could ignore everything and started apologizing for making her feel uncomfortable. Thats when she told me to shut up. I dont remember what I was saying but she later told me that I was talking 100k/h and she couldn't make sense of. \n\n\nBut she she said she likes me too!!!. We didn't kiss even though I really really wanted to but I couldnt get myself to do it. We cuddled instead and talked. \n\n\nWe've been hanging out every day since then doing pretty silly things. Last night we decided to spend the entire day/night in the city rather than go home. We laid on the grass and just talked/cuddled. \n\n\nI told her I was going to kiss her when it was 5 am. don't ask. So we talked till 5 and she reminded me it was 5. So we started this really awkward thing where I kept telling her I'm going to kiss you really really soon but couldn't go for it and kept repeating myself. But then she moved closer and well I went for it. it was just a peck but it was still awesome. She started giggling and I kissed her again. She continued giggling and I told her unless she stopped giggling that I wasn't going to stop kissing her and she laughed harder so I went for more than a peck. It was/is one of the most amazing feelings Ive ever felt. We kissed the entire morning. She said she couldnt control the laughter because she was nervous too, she laughs when shes nervous. So she wasn't laughing at me. \n\n\n\n So yeah, I think its safe to say Im not asexual.  Part of me felt sad that this was what I was missing out on all these years as nothing compares to it but the other part of me is really happy that it happened with Zara, shes truly amazing.\n\n\n OW one last thing! she said she loves me too after the kiss, although she was worried about saying it too early. \n\n\n   \n**tl;dr**: I ended up blurting that I love her, she said she likes me back we kissed. ",
        "permalink": "/r/relationships/comments/4nulgv/i_26m_have_from_aspergers_and_thought_i_was/",
        "comments": [
            "[removed]",
            "This is so ADORABLE! I think I was just shot with a cute cannon.",
            "Well, this is officially the most adorable thing I've read all day.",
            "I married my Aspie man.  This made me smile because it reminded me of our early relationship.  I wish you guys lots of luck.  Make sure you both make an effort to prioritize communication.  I have to sometimes remind him that I need some attention, because he will lose himself in a creative project for days at a time.  I know that it doesn't mean he doesn't care about me, and once I tell him, he'll come back to earth and give me some love.   I have had to learn that I can't hint anything.  If I need something, I say it, or he'll never pick up on it, and he'll end up feeling guilty that he didn't understand me, then nobody\u007f is happy. All that said, I love my husband's quirks. He has the biggest heart  of anyone I've ever met, and a brilliant mind.  I wouldn't change anything about him. It's not always easy, but if you both make an effort to communicate in the other's special way, It will be the most rewarding, honest, loving relationship you could ever ask for.  ",
            "Damn this is the cutest thing. I went and read your original post and it was so cute, but from the allusion to ripping the bandaid off in the title of the update I was worried it'd be bad news. Good for you OP!! Enjoy yourself :) ",
            "With all the horrible crap that has come across my frontpage the last couple of days, this is a beautiful thing to read. Nice to cry tears of happiness. Good on you, sir.",
            "[removed]",
            "These stories make me happy, good for you ",
            "This is the cutest shit i've ever read. Live the dream man.",
            "Congratulations. This is a really happy ending, but it's not really an ending.  \nKeep moving forward, and remember to always enjoy the present, and being in the moment, not worried about the future, or \"what will happen\". Just enjoy \"now\".  \n  \nDon't worry about doing things for things you think will happen, or because you're \"supposed to\" do them, do things because you want to do them.  \nLike, don't hold her hand in public or open a door for her because \"you're supposed to, right?\" do it because you want to do it, because the thought came to you on your own. You'll understand soon. I made the mistake of being too \"by the rules\" on my first dates instead of going with the flow and doing things my non-nervous self would actually do. Girls detect this, and your nervous actions become uncomfortable for them. Just relax.",
            "Awwwww that's really nice. I'm glad she likes you back, and I'm glad you're having a great opportunity to discover more about yourself.",
            "This is quite possibly the best thing I could have ever read on a Monday morning. Thanks for all the good feels....sometimes waiting for \"Miss. Right\" is worth it. Wishing you all good things :)",
            "This really really hits home for me. I've experienced a hard climb up to the place I am now where I can interact with people and feel like I deserve the same kind of love that others have.  Reading this made me choke up.  You took a chance and now you have the chance to build something beautiful with a longtime friend.  I am so happy for you. Good luck to you both.",
            "Oh this is so sweet! I'm so happy that things have gone well for you two. Just take things slow, which it sounds like you are, and just enjoy being together and in love. ",
            "This is a situation where practicing living in the moment is key. Listen to the situation - and listen to her - and try being present instead of somewhere in your head.",
            "You don't have to label yourself, but if a label will help you answer questions about yourself, maybe look up the term *demisexual*? It's still part of the asexuality spectrum. We can't post external links here, so I'll just copy and paste the first search result (from the AVENwiki):\n\n> A demisexual is a person who does not experience sexual attraction unless they form a strong emotional connection with someone. It's more commonly seen in but by no means confined to romantic relationships. The term demisexual comes from the orientation being \"halfway between\" sexual and asexual. Nevertheless, this term does not mean that demisexuals have an incomplete or half-sexuality, nor does it mean that sexual attraction without emotional connection is required for a complete sexuality. In general, demisexuals are not sexually attracted to anyone of any gender; however, when a demisexual is emotionally connected to someone else (whether the feelings are romantic love or deep friendship), the demisexual experiences sexual attraction and desire, but only towards the specific partner or partners.\n\nMore importantly, CONGRATS! This is really awesome and I'm happy for you, dude. ",
            "My brotha, I too experienced this. I had mostly come out of my shell during high school, but my personal understanding of sexuality was lagging behind. I knew I liked women, but communicating with them anywhere beyond simple talk was a chore in itself. But I finally got my chance with someone who didn't care that I was odd. It didn't pan out in the end, but I got to experiences so damn much during our time together. Plus we are still good friends.",
            "GIVING ME SOMETHIN TO BELIEVE IN",
            "Yayyy so happy! Thanks for posting, I really wanted to find out if she liked you back :)",
            "Yay, I think I missed your original post, but this is lovely to read!",
            "Hollywood gets so much wrong about love and relationships but they do this one right: the magical feeling of finding that one special person who can open up your heart. Love is such an awesome gift I'm so glad you've found it!",
            "[deleted]",
            "Oh my goodness! No matter what else happens today, the world is a little better because of your story 😊 Enjoy it!",
            "This is such a sweet story! Good luck - but make sure you don't rush things. Take it slow and steady",
            "[deleted]",
            "Congrats! Just make sure you treat her and yourself right. It's not a happy ending. Relationships take A LOT of work, so make sure to work on yourself for you & her, communicate when you have issues, and try to be understanding and compassionate.",
            "the blurting is actually a symptom.",
            "/r/relationships says you should probably break up, just to be safe.\n\nI, however, congratulate you from a respectful distance and do not force you to shake my hand.",
            "[removed]",
            "Well that was freaking ADORABLE! So happy to hear it's working out for you. I hope you two are really happy together!",
            "Congrats on a new day.. a new chapter begins for you. Enjoy this feeling that is such a new experience for you. Make many good memories and just breathe and allow yourself happiness and try not to tire yourself thinking too deeply into it. You most likely deserve happiness and good times.",
            "Yay!!! So incredibly happy for you two!!\n",
            "Congrats dude! That's awesome ",
            "*queue* That's A more!",
            "That's awesome. Good for you!! You deserve the happiness man.",
            "I've got a romance boner bro, that means you've got it right. ",
            "this is the cutest thing ive ever read in my life\n\nenjoy the ride, and dont be afraid of getting hurt -- that usually causes more hurt than it saves",
            "so happy for you.\nnow dont fk it up :) always be mindful of her, and its a 100% about communication. you may have difficulty with this but try to always put yourself in her shoes and think before you act/talk. dont over stress. just always think if i say or do this, will she be upset or pleased? if she gets upset always talk to her and try to fix it, if she doesnt try again later. good luck!",
            "I am sitting here, smiling about this.  Good for both of you!  \n\n",
            "SO happy for you!!!!!!!! Congratulations, fellow Redditor 👏👏",
            "Holy crap, this is the most adorable thing I've ever seen in this sub. Trust me OP, there are people across the world that are going to be delighted about your update! Have fun!",
            "Stopping by to say this thread made me very happy :)  Congrats OP",
            "Well that's just adorable.",
            "> I told her I was going to kiss her when it was 5 am. don't ask.\n\nI'm stealing this. This is too fucking cute.",
            "Yay for internet stranger!",
            "This was amazing to read. Good job, it's always very nerve wracking, especially the first time telling a woman. I hope only the best for you two! :D",
            "what a great way to get this written.  I love this story so much. Good for you guys.\n",
            "This is adorable! I'm so happy for you!",
            "I have chills! Way to go!!",
            "Aw, I'm so happy for you man! Glad to see it worked out and hopefully this is the start of something great! ",
            "Grats bro I'm glad you took a risk and it worked out :)",
            "Wow this really warms my heart. Thanks for sharing!",
            "Woooooo! Good for you sir!",
            "Dammit was not ready for all the tears. Best of luck to y'all, so proud of you for telling her how you feel! ",
            "That's awesome, good for you!",
            "I'm so, _so_ happy for you dude!",
            "I was having a shitty day until I read this. This made me fricken heart melt so bad. I'm so happy for you bro, keep loving",
            "> Part of me felt sad that this was what I was missing out on all these years as nothing compares to it but the other part of me is really happy that it happened with Zara, shes truly amazing.\n\nTo be honest mate - intimacy is more than physical attraction. What you think you were missing out on may not be anywhere near as good as what you are now experiencing simply because of the connection you have with her. \n\nI am similar, you could give me supermodel big tit fit body ready to fuck next to your average girl who I have a great connection to, I'll pick the 'average' girl, cos to my brain she is so much more attractive. I can't bring myself to take easy hookups from the club but just last night I met a girl I've been talking to for a couple weeks, way outside of my normal physical attraction criteria but we had a great night because we felt comfortable with each other. (There was still first time nerves and awkwardness learning each other though hehe)\n\nGood luck with her mate.",
            ">I ended up blurting out \"I think Im in love with you\".\n\nClassic Schmosby. \n\nGood for you man!",
            "I'm a day late but this makes me feel everything. After all the tragedy and crap that has been cluttering my Facebook and reddit feeds, plus having a nephew that's autistic, this honestly fills my heart with joy and hope. I hope everything works out for you two but for now, enjoy it all day by day. Don't take it for granted!! ",
            "I've looked at a lot of pictures of puppies, funny gifs and even people doing wonderful things for each other this week hoping that they will make me feel better in some way. Some made me smile a little, but this is the first time in 4 days I've forgotten how sad I am for a minute or two and just felt genuine happiness. My eyes are actually watering right now because I'm so happy to just feel happy. Way to go on the girl, Buddy. And thanks for spreading some much needed sweet, innocent, joy down to someone in Orlando. I think I might always remember reading this. ",
            "This made me so emotional to read. I am so happy for you and Zara, I wish you all the absolute best :D ",
            "In a shitty day at work, this made me very happy. Congrats OP. Take it slow and steady and great things will come. \n\n\n\n",
            "I am so glad it worked out well :) That update really made my day, thanks for sharing it :) \nAn advise from my own experience ( bf with asperger): \nCommunication can make your lives a lot easier. If you are not sure whether she laughs about you or is simply nervous or sad or whatever it is- please ask her. \nIts the best way to prevent misunderstandings since Aspergers normaly have difficulties understanding body languages and facial expression. ",
            "Awwww a cute update on a Monday morning always makes things better.\n\nBest of luck OP!",
            "As a follow guy with Aspurgers, I can both relate to this and hope this happens to me too. Congrats man :]",
            "Congrats, man. I have some friends from college who are on the spectrum and two of them have been dating since like 08. Very cute updates on Facebook, extremely awkward but it works for both of them. Love works in mysterious ways and I'm glad you and Zara found each other. ",
            "Awwwww! I'm so happy for you. =)",
            "Awww this is really so sweet. I couldn't help but smile at your new found love. It's great isn't it? I wish you two the best!",
            "Congrats OP, this is a wonderful update!",
            "This put me in a good mood to read, man.  Have fun exploring this new side to yourself!\n\nRelationship advice is tough because people want different things and what works for one pair of people might not for another.  But just remember that there are two of you and try to remind yourself from time-to-time of what the other person wants.  \n\nThanks for sharing your story!  Good luck to you guys!",
            "Hey, that's awesome. Be happy.",
            "This is the sweetest thing I've heard in a long time! I wish you the best of luck!",
            "I love you good luck!!",
            "As a fellow aspie, I was cheering you on. You rock, man! I hope it all works out for you both! ",
            "You were honest and look what happened! That's the best thing you can be with someone you like - honest. \n\nNow that you know she likes you, you can focus on just being more and more confident and comfortable over time. The hardest part is over and you came out the other side with a great result. ",
            "omg I love your story! it's cute and great. also, just came here to say that you could possibly still be asexual; there are asexual people who still enjoy sexual things with their partners but only exclusively. I know that this is a time of lots of change for you, just letting you know that there are many sexual/other identities to explore. I wish you all the best! ",
            "This! We need more of this in the world! Congrats!",
            "That's really nice! I hope at this point you can stop worrying about whether your awkwardness is putting her off. Even if you stammer your lungs out onto the floor, it's clear that she, like many other people, finds it quite charming ;) ",
            "My boyfriend  was in a similar position to you op and in October we'll be celebrating 4 years. Good luck x",
            "Christ man, this is the cutest shit I've heard in a while",
            "*bro tap*\n*fist bump*\n*high five*\n*ass slap*\n*chest bump*\n\nSeriously, good shit man.",
            "Dude you're awesome. Massive congrats. Enjoy the love!!",
            "Well congrats! Sounds like you guys are giddy as all get out right now. Just remember to take things as slow as you both need to. If you rush too fast you'll burn up and crash. Good luck dude!",
            "After all the shitty things that have happened today - thanks for sharing this. It's great it worked out so well.",
            "This is the greatest thing I've seen on Reddit! Congratulations!!! ❤️❤️❤️",
            "I'm so thrilled to read your update. We don't know each other but your story warmed my heart. Don't be sad for what you've missed because anything before this would've been forced. Just enjoy what you have with Zara! Congrats and good luck!",
            "This is so cute!!! Congrats to you both :)",
            "its awesome she likes you back man! i wish i could buy you a beer! congrats",
            "This was such a wonderful update to read: congrats and good luck!!",
            "That's awesome. You just brightened my day a little.",
            "God, I needed this happy news. This is wonderful. So happy for you. ",
            "Congrats bud. It sounds like she is accepting/welcoming of all of you and that is important.",
            "This is awesome. This brought a huge smile to my face :)))",
            "I am so very happy for the both of you! Congrats, and I hope you 2 keep going strong for a long time. \n\nSeriously, happiest thing I've read on reddit for ages. ",
            "Non aspie, but high functioning here. You're inspirational😊 ",
            "Good luck and have fun mate!!!",
            "There is hope for us all!! Good luck, OP!! ♥",
            "STOP ITS TOO CUTE. CUTENESS OVERLOAD....",
            "Very similar story to my niece. Cheers mate! ",
            "Congrats, you both sound like champs!",
            "I smiled the whole time reading this. Thank you for being honest and sharing this. ",
            "Yay! This is lovely. What a beautiful thing. ",
            "im so happy for you! way to be brave! ",
            "AND WE HAVE A WINNER!!!!",
            "This is like a romcom script, but there is no twist or tragedy. Congratulations! ",
            "Fuck yeah. Way to go, NFT.",
            "This is one of the sweetest things I've read on this site.  Good for you, man, I'm really glad you gave it a shot.  It's great things worked out so perfectly, but even if they didn't, you were honest with yourself and honest with her and brave enough to go for what you wanted, and that's pretty amazing.  Good for you.",
            "WOOHOO!!! That was an awesome post my man. You had me on the edge of my seat reading this. Good for you. Good. For. You. He who dares my son he who dares. This made my day. Whew...well alright. I'll let you get back to it.",
            "Best thing I've read the past week. Congrats OP!",
            "Yasss! That is amazing dude! Congrats. Super happy for you. There is nothing like that first experice with someone you love. Enjoy it, the flood of endorphins you will be experiencing, now and the months to come are the best feeling in the world. It's such and incredible thing. So glad you went for it. This made my day. ",
            "I love this story so much. Good for you guys.",
            "I commented on your last post about taking things slowly and asking her out to coffee...\n\nI'm so glad things worked out for you!!!",
            "I'm so happy for you!!!  I was really hoping for a happy update.  That's awesome. :)",
            "Aw, thanks for sharing! I'm happy for you! ",
            "This was the cutest love story, I teared up. Congrats! :) ",
            "Man, I'm so happy for you!!! This is your first love and it sounds exactly like everyone hopes it would be. Enjoy it, and don't worry, nobody is cringing except in solidarity with how they were with their first love!!! :D:D:D",
            "Dawwwww! This is too cute! I am going to die of cuteness overload!",
            "This is the cutest thing ever.",
            "You two! Someone needs to make this into a cute little coffee table book! ",
            "Woo hooo! Good for you guys :)",
            "As a person with aspergers, I'm happy for you OP!\n",
            "You are awesome! Good on you!",
            "This is so adorable. My heart is melting. I wish you guys the best. ",
            "This is one of the sweetest things I ever read ! Goodluck ! ",
            "This is the perfect emboimemt of the awkward, unchartered, innocent first kiss. Congrats. ",
            "This gave me the butterflies <3 Grates dude! That's awesome!\n",
            "There's a spectrum to asexuality. You might be demisexual, meaning you only feel attraction to people if you have an emotional connection with them. If it bothers you to not have a label, look up the asexuality spectrum and see what makes sense to you. But you don't need a label if you don't want one",
            "Don't worry about feeling asexual before and \"missing out\". I have several friends that are just attracted to people on more of a mental level so they only felt sexually for those certain people and no one else. I oblivious can't speak for you but it sounds like from your last post and this post that you were first attracted to her for how she is and not how she looks, which might be why before meeting her you thought you were asexual since you had not found someone mentally attractive. ",
            "holy shit this awesome haha ",
            "God this post is adorable ",
            "| Part of me felt sad that this was what I was missing out on all these years as nothing compares to it but the other part of me is really happy that it happened with Zara, shes truly amazing.\n\nYou can shut up the part of you that's sad, because there is a reason why some of us wait for the right person, because we would suffer too much with the wrong one. Don't you think ?",
            "This gives me hope for my Aspie boy. Best wishes, OP!",
            "So somebody who thought they were asexual, suddenly wasn't asexual? Why am I not surprised. Glad you've found happiness though friend.",
            "no shit asexuality effects less than 1 percent of the population.",
            "fyi, you can still be asexual and have a sexual relationship with someone that you are enamored with. Sexuality is not black and white.",
            "Btw no you don't have as per gers that isn't a diagnosis anymore it's just autism spectrum disorder"
        ]
    },
    {
        "post_id": "9aojry",
        "author": "AbleAlgae",
        "title": "I [23 F] caught my boyfriend [26 M; 1 year] on tinder. He swears it's not true. I'm going to lose my mind.",
        "url": "https://www.reddit.com/r/relationships/comments/9aojry/i_23_f_caught_my_boyfriend_26_m_1_year_on_tinder/",
        "score": 4076,
        "num_comments": 570,
        "created_utc": 1535373278.0,
        "selftext": "My friend came to me yesterday at lunch with screenshots of my boyfriend's tinder profile. The pictures were all old photos so I confronted him immediately expecting to hear something like \"Yeah, haha I forgot to delete that.\" which is cool. He denied being on tinder at all and my friend suggested that she make an account, set it to his specifications, and see if he turns up. and there's his profile.\n\nSo, this means that my boyfriend has been active on tinder within the past two weeks. I confronted him with this and he changed his story. Now he's saying that his friend has been using his account. He shows me his phone and says, \"Look, I have nothing to hide.\" and of course the app is deleted.\n\nSo I take his phone, download tinder, log in with his facebook and see that he has been active, albeit infrequently. There was one girl that he tried to meet up with back in May when I was out of town. The girl gave him her phone number and even though he deleted whatever messages they exchanged, I still saw that he had her saved in his contacts.\n\nSo that's about everything that I know. He either cheated on me or planned on cheating on me while I went out of town, and I'm sure this isn't the only time it's happened. This relationship is pretty much over.\n\nHe is swearing up and down that it's not true. He doesn't use tinder and he doesn't know this girl. I'm going crazy with how much he's outright lying. He seems so sincere, but I KNOW what I saw. I can't listen to him deny this one more time.\n\nI know that this is the end, I guess I'm looking for advice on how to end it in a way that doesn't leave me second guessing myself. and moral support.\n\nTL;DR: Caught my boyfriend on tinder trying to meet up with girls while I was out of town. He's denying it so vehemently that I almost believe him. What do I do?\n\nEdit: This blew up while I was away!I'm sorry I won't be able to respond to every comment.\n\nSo I did some stuff that was kind of petty and stupid today: I made a fake tinder account, matched with my boyfriend, and he starts messaging me and immediately asks me to meet him for a drink. We agree to meet by a fountain in the center of my town and I pack up all of his stuff in a tote bag, put on a great outfit and went to the fountain.\n\nI stood kind of out of the way of the fountain in the shadows where I could watch the street that I knew he'd be arriving from. I was devastated, but I figured this way I could catch him without a doubt and end things quickly. All the time, he's messaging this girl on tinder.\n\nBut he didn't show up. Two of his roommates did. We didn't speak (I don't know them well), but they watched me for a while, figured out what was going on after a few more tinder messages, and left quickly.\n\nSo I wait a few minutes and I call my boyfriend and ask him where he's at. He says he's just gotten off of work and he's going to meet his roommate for a drink. I confront him with the fake tinder profile and he's dumbstruck and furious with his roommate, who he swears up and down is behind all of this.\n\nI'm at home now, just emotionally exhausted and confused. Whatever is going on with his roommates is super sketchy and creepy.\n\nadvice please?\n\nEdit part two:\n\nThank you all so much for your advice and support!\n\nA few things that I think are important\n\n* Up until this point my boyfriend and I had a great relationship. Really, no red flags anywhere. If I had already been suspicious that he was cheating this would be a much easier break for me\n* The most recent message on his tinder account when I checked it yesterday was sent to a girl he had matched with before we met. It said \"Would you want to meet up with my friend?\"\n* My boyfriend is the kind of person who's iphone passcode is 0000. I wouldn't be surprised if his roommates did know all of his passwords. \n\n&#x200B;\n\nSo, his tinder account is still matched with my fake profile. To me, that indicates that he probably isn't the person operating the tinder profile. If it were him, wouldn't he have blocked the fake profile immediately?\n\n&#x200B;\n\nA lot of people have said that he probably sent his roommates to check things out for him. I can't write that off entirely but my gut says that it isn't true. I just don't think it's very likely. \n\n&#x200B;\n\nWhen it comes to his roommates, I'm very concerned that they have been using his profile to trick women into meeting with them. The fact that his profile hasn't been deleted makes me worry that my boyfriend is in on this. So that's about where I'm at right now. I'm worried that all of them are working together to at best, scam women, at worst, assault them and my boyfriend is at least passively involved. Either way, I feel some responsibility to do a little more digging. ",
        "permalink": "/r/relationships/comments/9aojry/i_23_f_caught_my_boyfriend_26_m_1_year_on_tinder/",
        "comments": [
            "Don't let him make you question yourself. Thats gaslighting 101. Look at the facts and trust yourself, make a decison and stick to it.",
            "Gaslighting. That’s what this is. And this is exactly what my boyfriend did to me when I caught him cheating. I was literally logged into his POF account looking at the messages and he was trying to deny it, and trying to make me seem crazy for believing it. You are not crazy, he is a cheater. You are not crazy. One more time for good measure: YOU ARE NOT CRAZY no matter how he makes you feel about this. ",
            "[deleted]",
            "You want him to shut up and tell you the truth because you think you deserve it. He is never going to admit to it. Maybe when you dump him, he'll finally sack up and tell you but that's him being manipulative. Hes dug himself into a hole and he's gonna keep on digging. Leave now or you'll feel like an idiot for staying. Youre not going to get any closure from him. Take a deep breath and walk away. You're done with him. ",
            "[deleted]",
            "> I guess I'm looking for advice on how to end it in a way that doesn't leave me second guessing myself. \n\nSave this post. Something made you write this post and this post will remind you of it. It doesn't matter how you end up breaking up. You don't have to say more than \"I'm breaking up with you.\" You don't need to justify your action of breaking up. You don't need his approval or permission.\n\n&#x200B;\n\n> and moral support. \n\nThis sucks. There's nothing to be said that will make it suck less. It's not okay what he did, but it's okay however you feel about it. Feeling anger, denial, confusion, desperation, sadness, everything at once or even nothing is all okay. Even missing him or the good times sometimes is okay, because you got used to him and now you have to get used to not being with him. Not missing him or wanting to rip him apart is okay too. You feel whatever you feel. It may be unpleasant, but feelings aren't wrong. Certain actions can be wrong, though. (For example, as long as you're not planning on actually doing it, feeling like hurting him is okay.) \n\n&#x200B;\n\nTake good care of yourself. Eat, shower, get dressed, rest, and exercise. You need to process a break up and how things ended. That takes time and take that time. Limit or avoid contact with him for now as that will reopen wounds before you're properly healed.\n\n&#x200B;\n\nIt may not be much, but downloading the deleted app and logging with his FB account was pretty smart. You can take care of yourself. It won't make this suck any less, but you can take care of yourself.",
            "If you really need to know exactly what happened, message the girl. \n\nIf not, get tested and move on.\n\n2 things are undeniable though:\n- she’s in his phone\n- you were out of town\n\nThat’s a smoking gun. ",
            "sounds like his friends scoped it out for him and gave him a built in excuse.",
            "The two friends showing up should seal it. Your boyfriend thought it could have been a trap and he sent his friends to check it out while he sat in the car and waited for the all-clear. ",
            "Lol \"my friend was using it\".  He was/is trying to cheat on you, just hasn't been successful.  ",
            "I was with someone for a very long time who was like this, would lie about shit and continue to deny it even when there is direct proof otherwise. This kind of shit makes you crazy - i mean that in a serious, non-exaggerative way, it impacted my mental and emotional health in a way i wish i had not had to deal with. they hold on to their lies \\*because it makes you doubt yourself\\*, because how could they continue to lie when you have fucking proof, right? your post is why, because it makes you doubt yourself. please run far and fast in the other direction from this dude.",
            "One time I found messages on my ex's iPad from a girl about them talking about how they had been hooking up at a convention he had just gone to. When I confronted him, he tried to tell me his iPad had been stolen at the convention and he had gotten it back right before they went home (he was relying on me not knowing how syncing an iPhone and iPad works I guess). He stuck with that story even though I wasn't buying it until I scrolled through the conversation a bit and found him talking to her about me.\n\n\n\nLiars will lie even if they're not believed, until they can lie no more. Then once they can't lie, they'll make excuses. The point is, he's a liar and a cheater and you should move on.",
            "Break up with him. He's already cheated. ",
            "He’s lying, you know he’s lying. He was trying to hook up with someone 3 months ago. Why are you still questioning things?",
            "This guy is jumping through a lot of hoops that are more emotionally exhausting and annoying than if he were to just come out to you and tell you the truth. Jeez. ",
            "So, I'm getting this weird feeling about both of his roommates showing up. I may be totally off base, but the only reason I can think of for two dudes to show up to a tinder meetup is assault. I'd be kind of wary about all three of them if this is a shared account.",
            "[deleted]",
            "Haha his buddy uses his account... And:\n\n\"He is swearing up and down that it's not true. He doesn't use tinder and he doesn't know this girl.\"\n\nBut magically her number is in his phone contacts. Guess his buddy also uses his cell too right?\n\nHe is so bad at lying it would be hilarious if it weren't for him hurting and cheating on and gaslighting you.\n\nDTMF",
            "What you did wasn't \"stupid and petty\". Please don't think that way. It gives strength to the \"women are hysterical lol!!1!\" stereotype that's poisonous. Nancy Drew would be fucking proud of you, girl. You're just not adding up the clues:\n\n1. His personal Facebook linked with Tinder 2. Girl from Tinders number in his contacts 3. That incident happening when you were out of town 4. Not one, but two, of his friends show up to scope out the situation 5. His spoken denial without any attempt to rectify the situation ",
            "If he’s lying about tinder and how he doesn’t know this girl what other things has he lied about/ will lie about in future. Plus if he’s willing to cheat when your out of town that just pulls it all together for me. He’s clearly not able to be trusted! I’d just confront him and lay it out to him wanting the whole truth or your gone. ",
            "Once stumbled upon Craigslist personal ads on a bf’s laptop. Obviously went into detective mode and opened his email where there were a whooole bunch of messages being sent with his name, phone number, photos, clearly his terrible grammar, etc.\nKnow what he told me?\n“That wasn’t me!! I was hacked!!!” \n\n....wish someone would hack my computer to get me laid.",
            "What if he set everything up with his roommates thinking that you would make a fake account and try to match with him and then make them meet up with whoever they matched up with so he could throw you off and come off as innocent. I could be overthinking but that’s what first popped up into my head. Or he could be innocent and his roommates could be the ones at fault ",
            "Isnt this an old post? (it has a 1 week post update too).\n\n(very similar)\nhttps://www.reddit.com/r/relationships/comments/9a7ovz/update_coworker_found_my_boyfriend_27m_on_tinder/\n",
            "You already know he's lying. Just end it and find someone who isn't a sack of deceit. ",
            "Kinda sounds like he knew the jig was up and knew you would do what you did. He then had his buddies go in his stead. Tried to be slick. \n\nOr it really could be his buddy(ies).  Are they less attractive than he is?",
            "So why are you going crazy?  Why do you need him to admit his wrongdoings when you already have truth?\n\nJust to push things along...there is no such thing as closure.  It's a myth.  It's really just a nice way to end a movie but in real life, broken relationships don't have this nice, clear cut ending with a fade out showing the wronged with a triumphant sunset fade out.\n\nJust do what you know needs to be done and get on with it.  ",
            "Get out now. You're young. It's not your imagination, he is gaslighting you. Don't be like me & take 25+ years to get out because I tried to believe a lie.",
            "If his friend was actually the one who was using the profile, he wouldn't have had to lie altogether then change his story later when more proof came to the surface.\n\nHe's a liar who gaslights you and takes you for a fool. That's more than enough to call it quits.",
            "The most dangerous kind of person is one who you know is lying, but is so good at it that you’re never able to tell. I had a similar situation happen to me, someone revealed my boyfriend was cheating and when I confronted him, I would have sworn on my mother’s life he was telling the truth... alas, it all came out he did cheat. If you choose to stay, you will spend your life wondering when he is telling the truth or if your relationship has been built on an alter of lies. Just be prepared for the ramifications of that on your mental health.\n\n*edit: spelling",
            "So I have an insane story.\n\nI was dating a women who on the surface had it all, and down below had some real strange habits and an adderall addiction.\n\nSo, early on in dating her, I was falling asleep with my arms above my head.  All of a sudden what felt like tickling in my arm pit facing her shocked me awake.  Like, really disturbing \"wtf\" sensation that just threw me out of sleep.  I asked what the heck happened, she said she was just reaching over to touch me and accidentally got my arm pit.  I told okay, but that was really, really disturbing and to please try not to so accurately get my arm pit when reaching over.\n\nThat was the first time\n\nIt would continue to happen probably about every 6-8 weeks.  I would be falling asleep/just fallen asleep and her hand would hit my arm pit...and it would be SHOCKING.  Like I couldn't understand how i was either a) this sensitive to b) was she really just reaching over?\n\nMind you, too, I have shared a bed with several dozen other people and NEVER have any of those other ones ever mistaken my arm pit for where they were reaching for.\n\nBut every time it was the same excuse \"I was just reaching over because I wanted to cuddle/be with you/touch you\".\n\nAnd I was beginning to lose my patience for it too.  The first 3 or so times I put it on me.  The next 3 or so times I was more approaching the \"could you fucking not\" point.  The last 3 or so times (yes, it did go on that long) it was \"I can't believe you're still doing this!\".\n\n...and the other funny thing about this, too, was she would claim it was an accident, but she was never apologetic about it.  It was \"I was just trying to touch you...\" but any more discussion she would act like it was my fault for reacting the way I did and even talk down to me about it.  \n\nI know if i got someone in the armpit while they were trying to fall asleep I would feel shitty and think I was an idiot, and be absolutely apologetic (not to mention not do it again).  This was not her.\n\nThe last time it happened was the clincher.  I was exhausted, had just come back from a long trip that day only to hang out with her and her niece that evening and come to bed wiped.  I was at that weird tired point where the minute i lied down my body just sank into the bed without me, but my mind was still some what awake and running.  I must have looked and seemed completely asleep but I was still fully aware of my surroundings.  That's when I started to feel it:  Her hand was slowly creeping towards me on the bed.  I felt it gently, barely, touch my elbow once, then pull up right to my arm pit AND GO FULLY IN WITH TICKLE FINGERS.  Like fingers blazing right after lining her hand up and testing to see if I was reactive.  I was INSTANTLY shocked awake (like all the other times) but in this moment I was also waking up to the fact that she was, and had been doing this on purpose the entire time, for whatever reason.\n\nWhat happened next though relates to you.  \n\nI said \"What the hell was that?!\" she then said \"I just rolled over to touch you!  Why are you acting so mean?! (which was a complete lie)\"  I then told her that that seems like a complete lie and I was awake for this time and I felt it all...to which she replied to me how mean i was being and how she just wanted to touch me and can't believe how rude I would be to my girlfriend(her) and treat her like this and do something like this to someone they love and blah blah blah....Her response was easily twice the response I had and was nothing but shaming me without ever actually apologizing or siting what just happened....\n\n...pretty much trying to shame/lie me back into the narrative.  Back into their narrative.  Because reality doesn't matter if they can get you to fold.  I never called her a name, never brought up anything more than what I had just experienced and the entire time I was just hearing back how-could-I-be-doing-these-things to her (asserting reality).  You need to be in reality.  You need to trust reality.  You need to trust yourself even when it does all seem crazy because the crazy don't care.  Not about reality and not about you.",
            "Ghost his ass. You don’t need to explain nothing. ",
            "Rather than go down a rabbit hole of suspicion and detective work just dump him and move on with your life. You already know he's sketchy and you don't need more conclusive proof than that. Simply being unhappy in a relationship is a good enough reason to break up.",
            "Oh shit, I just re-read that the douchebag had her saved in his contacts! Ditch the wanker! Don't waste another minute on him.",
            "Dump him. No need to go FBI on him to seek answers. I think you got more than a lot of people get when their significant other is cheating. He's on tinder. Regardless of the old pics. ",
            "> So I take his phone, download tinder, log in with his facebook and see that he has been active, albeit infrequently. There was one girl that he tried to meet up with back in May when I was out of town. The girl gave him her phone number and even though he deleted whatever messages they exchanged, I still saw that he had her saved in his contacts.\n\nThis is more than enough to break things off.\n\n> He doesn't use tinder and he doesn't know this girl. I'm going crazy with how much he's outright lying.\n\nThat's the point. He hopes he can deny so hard that you will eventually just give in.\n\n> I know that this is the end, I guess I'm looking for advice on how to end it in a way that doesn't leave me second guessing myself. and moral support.\n\nIf you're not living together, this is fairly easy. Feel free to text,  call, or meet up with him in person at a public location (but not a restaurant, possible like a park) with witnesses (who aren't necessarily within ear shot though) during daylight. Tell him it's over, that you're not buying his bullshit, and that it's over. Then walk away. If he tries to text, call, or contact you again, block him. Don't respond.\n\nYou *might* consider telling him that \"this can't work\" if he won't be honest, leaning on that super hard to see if he will spill the beans. I imagine he will trickle-truth you. \"I was just flirting. I was never going to do anything with her.\" \"I just saved the phone number to text her when you are away and I'm feeling lonely.\" Etc.\n\n> What do I do?\n\nDump him.\n\nIf you live with him, then you need to find a way to get out safely. If your landlord can work with you to get you off the lease with minimal financial damage to yourself, try to arrange for that.",
            "2 roommates is a setup to cover his ass!! Please dump this lying ass.",
            "Dude. No. Get out of there before this gets worse. Dont bother with questions because you'll never get honest answers. Leave with dignity and move forward toward what you deserve, which is respect and honesty. ",
            "You have to end it. He’s just lying. If his friend made an account of him to use for themself (highly unlikely) why would he be okay with that and still be friends with someone blatantly stealing his identify and catfishing? It’s because it’s him. Especially when it’s connected to his Facebook? Are you really are going to believe he’s going to give his friend his Facebook password to catfish on tinder? He’s gaslighting you. He’s never going to tell you the truth and you don’t have to prove to him that he’s lying, so just end it. ",
            "Just get away from this entire mess. ",
            "Concerning the edit - still should dump him immediately. If his roommates are the ones using his Tinder, how can you explain why he had a girl's number from Tinder on his own phone? His roommates aren't secretly saving contact information and sending messages from his phone as well.\n\n&#x200B;\n\nWhat probably happened is BF matched with fake account, agreed to meet up, started having second thoughts if it was real or not and asked his roommates to scout it out for him.",
            "Girl you only got one life, use it on people thats worth it. Thats what got me moving on.. ",
            ">he girl gave him her phone number and even though he deleted whatever messages they exchanged, I still saw that he had her saved in his contacts.\n\nFucking liar. It's over.  ",
            "Whenever I read threads like this one and the cheating partner's explanations, I always think of John Belushi (RIP) at the end of The Blues Brothers, trying to reason with Carrie Fisher (RIP as well).\n\n\"No, I didn't. Honest... I ran out of gas. I... I had a flat tire. I didn't have enough money for cab fare. My tux didn't come back from the cleaners. An old friend came in from out of town. Someone stole my car. There was an earthquake. A terrible flood. Locusts! IT WASN'T MY FAULT, I SWEAR TO GOD!\"\n\nOP, he's cheating on you. I'm certainly not the first person to say it. But trust your gut here. ",
            "If his friends are the ones that created the faie account why would they use his fb to login. Why would it not be a password.",
            "Hmm... the update changes things but that still doesn’t answer the question as to how the girls number got into his phone..? ",
            "You should have sent a third party he didn't know to the fountain, he probably had his roommates watching to see if it was you catfishing him.\n\nAlso \"My friend is using my account\". Really? Why in the fuck would your friend use your account? You know exactly how easy it is to make an account. What exactly is wrong with his friend that he can't make his own account? Answer: Nothing. There is no friend with a mysterious inability to use Tindr on their own.",
            "This is ridiculous. My guess is he sent his friends to check to see if it was you. If it wasn’t I bet your boyfriend would have popped out of the shadows to meet his new hot Tinder date. \n\nIt makes zero sense otherwise. Why, honestly, would they be catfishing women with your boyfriend’s profile? Unless your boyfriend is a 9 and they’re solid 3s but honestly... that’s just fooling yourself here. \n\nÉdit: on wtf ok i missed the part where you said her number was in his phone. In what universe does that make sense, OP? If his friends were doing all the manipulating WHY IS HER NUMBER IN HIS PHONE? There’s no explanation for that OTHER than he’s cheating. ",
            "He lied his ass off.\n\nThat's all there is to it.\n\nThe question is..What are you going to do about it?",
            "Okay that edit makes this more confusing. Are you guys at the stage in your relationship where you can openly talk about stuff? I'm not sure he's pretending or he genuinely doesn't know his roommates are using his Tinder. Does he have a best friend you can trust? What if you ask that friend for some insight? Sorry ti hear you are dealing with this. ",
            "> I'm at home now, just emotionally exhausted and confused. Whatever is going on with his roommates is super sketchy and creepy.\n\n> advice please?\n\nEither your boyfriend's roommates are his partner in crime, or he is innocent and they have his facebook password. Get your boyfriend's phone and log into Tinder. Delete his profile. Then change his facebook password. That will bump his roommates out of his profile and prevent them from doing anymore hijinks.\n\nIf you don't tell him and leave him logged in, it will prevent him from doing anymore hijinks, too.\n\nPS,\n\nTake pictures of everything you found with your phone before you implement this.",
            "So?  Whatever he is saying is irrelevant.  His actions clearly show that he doesn't want to be exclusive with you.  If you want to be exclusive with him, you say that you're done and leave. ",
            "If he tried to meet up with someone and saved their contact it's not looking good ",
            "\"What do I do?\"\n\nI'm sorry that you're going through this nightmare. \n\nBased on the information provided, there are two choices: you can be with somebody unfaithful, or you can leave him.",
            "Be prepared to be gaslighted. I’ve been through this before (not through tinder but different stuff). Hold your ground, girl. ❤️",
            "Walk away honey. He’s continuously lying to cover his tracks. His behavior is inappropriate for someone who is in a committed relationship. \n\nI hate to say it, but you’ll likely never get a true reason out of him. He’ll always continue to deny it. you HAVE the proof! Simple as that. Cut your losses, and accept that you’ll never get an answer. Just know that you’re better than that and he doesn’t deserve a moment more of your time. \n\nI wouldn’t even give him a reason, just continue to say “you know exactly why” and ignore his attempts to contact you. ",
            "Not only has this guy proven he can't be trusted, he's trying to make you mistrust yourself, and that's a whole nother level of wrong. \n\nI'm sorry this happened, but you don't need him. Move on, and never be afraid to trust yourself. ",
            "Wow, he’s not even trying to come up with a believable lie. He’s just flat out gaslighting you. Dump him for sure, he doesn’t respect you and frankly, he must think you’re stupid.",
            "Uh, yes. He almost 100% definitely cheated on you. There’s no reasonable explanation for him having some rando girl from twitter as a contact on his phone. \n\nIf you really want him to own up before you end the relationship, you could sit down with him and try to get him to tell you the truth. I’d say something along the lines of “I’m giving you one last chance to be honest with me before I break up with you. If you can’t be honest with me, we’re never going to be able to make this relationship work. I just want to know the truth and maybe this is something we can work past.”\n\nMake him feel safe telling you the truth, then of course go ahead and break up with him anyway.\n\nGo have fun and be single for a while. I spent all of my 20s in relationships and I regret it. Make good friends and travel instead of wasting time on little boys.",
            "You don't need him to admit it.  Either decide you're going to take it and stay, or decide you're not and leave.",
            "Okay so the edit makes me think he wasn’t doing it, but the phone number saved in his phone from the girl when you were out of town is still red flag city. Ugh, I’m so sorry you’re going through this! ",
            "I'm a naive person, so *MAYBE* I would have bought it when his roommates showed up instead of him. But he had that girls number saved in his phone. Did his roommate just happen to save her number in your boyfriends phone too? He is a stupid lying jerk.",
            "All the social bits aside, you should be able to easily go into his phone settings and see which apps have been using battery percentage or data in the past few weeks. Pretty damning evidence if it's there.",
            "Wow, that is unbelievably creepy. I hate to say it but it sounds like his roommate is definitely using his account to do something sketchy. However, it doesn't sound like your boyfriend is innocent in all of this. Personally I feel like you should was your hands of it, and get out while you can.",
            "Holy. That edit. Repost that as a new post. That took a turn from a fairly typical case of 'he might be cheating' to M Night Shyamalan.",
            "He's lying to you. I had the same situation with my ex boyfriend who had grindr on his phone but insisted he was only using it to \"make friends\".get out now",
            "Gaslighting, it's a form of manipulation someone uses to convince you that things you've observed haven't really happened. Had an ex that tried to pull this shit, and I will say it's hard to see through it until you're free of them. They're essentially abusing/taking advantage of your trust.\n\nDump this ass. Good luck.",
            "You already know what to do. Break up with him and go no contact.",
            "I like how you summed it up in your tl;dr - “he did this thing and I don’t believe his story”.  You know what to do.  Be glad you don’t have a house and kids to deal with!",
            "His friend is using his Tinder account?  That makes zero sense.",
            "You have feelings for your boyfriend and you want to believe him. You're having a hard time with all the evidence against him. \n\n1) He lied about being on Tinder. \n\n2) He deleted the Tinder app from his phone then lied again.\n\n3) He attempted to cheat on you in May and saved the girl's info in his contacts. He lied AGAIN. \n\nWhat do you do? You end the relationship rather than waiting to feel good about this. Something like this would be sufficient: \"You tried to cheat on me and lied to me multiple times. Our relationship is over and I'm going to find someone who is worth my time.\"  ",
            "My dad swore up and down he was faithful to my mom. Turns out he had 10 affairs over 10 years. He’s gonna lie and lie and lie if given the opportunity. Don’t stay with him. My mom lost 24 years and I lost my dad due to my mom staying with a liar. ",
            "Trust is gone. Move on.",
            "Before this did you feel like your boyfriend was an honest person with good character? Or were there other, albeit \"milder,\" red flags that you ignored? Have you ever seen him lie to other people or take shortcuts? \\*Edit - adjustment.\n\nBasically, have you noticed other patterns of dishonesty in your boyfriend leading up to this huge betrayal?",
            ">He denied being on tinder at all\n>\n>So, this means that my boyfriend has been active on tinder within the past two weeks. I confronted him with this and he changed his story. Now he's saying that his friend has been using his account.\n>\n\n Sooo, to recap: He outright denies using Tinder initially. You show him proof, and he tweaks his story juuuust enough, that it is \"his friend\"... using your boyfriend's Tinder profile, on your boyfriend's phone. Because that makes total sense. If that WAS the very odd and strange truth of the situation, why did he not tell you when you first asked? Oooh, because he got caught red handed and is desperately trying to spin it.\n\n\n>So I take his phone, download tinder, log in with his facebook and see that he has been active, albeit infrequently. There was one girl that he tried to meet up with back in May when I was out of town. The girl gave him her phone number and even though he deleted whatever messages they exchanged, I still saw that he had her saved in his contacts.\n>\n\nGirl. No matter how sincere he is, no matter how vehnamently he is denying this... SOMEBODY put the phone number in his contacts from the Tinder messages, coincidently the same week you were away. He absolutely cheated on you, maybe more than once, and from his Tinder activity he is attempting to continue.\n\nI would go no contact and not let the sleezeball back into my life. Not worth it. Even if he didn't cheat, he is a liar. If for some reason you are insistent on hearing him out or believe any of his BS lies, let him show you his text records for that time you were away. Or any recent text records, actually. But I do not know how you could ever trust him after this.",
            "Is there actually a way to delete your tinder profile? Does it delete if you delete the app?",
            "Do you really want to have to worry about this on the chance that he is innocent? Also, even if he is innocent, he is choosing to be friends with some real creeps.",
            "Alright, look man.\n\nLet's just pretend all of this has no backstory. The short of it is that your trust has been compromised. Usually, a relationship can't exist meaningfully or happily without trust. To fix this, it takes both people working together to build trust. This is usually done through transparency.\n\nIf there isn't any transparency, and he won't work to rebuild your trust, do you think you will be able to trust him again? If not, do you think you should be in a relationship with someone you can't trust?\n\nI spent years with someone who I didn't trust. I never trusted her again after she had cheated. I was miserable and regret wasting her time and mine.",
            "We have the same story here every week. Funny how many people create or use tinder profiles of others. ",
            "I'm not sure whats going on here, I thought for sure your boyfriend was cheating but then I saw the last little bit about the roommates and that confused me a lot so now I'm not so sure.",
            "Ask for his phone again, get the girls phone number from before and contact her, then you can see who she was really talking to.",
            "Why would they use his profile? Thats fake as hell for them.",
            "After your edit, it is completely possible his roommates are at fault. The only part that makes me question that is his having the contact for that girl from when you were away. Can you get his cell phone logs? Should be in his bill. See if he texted her back in May. If he did, he's been lying to you. If not, he may be telling the truth.\n\nHe can delete the thread on his phone, but not the messages from his cell phone bill.\n\nEither way, he's got some explaining to do. Why would his roommates not just use their own account? They could be complete assholes, but then why would they actually show up? Is your (ex?) boyfriend a lot better looking than them? ",
            "The edit should be an updaaaaate",
            "He asked his roommate to cover for his cheating.  He's a cheater.  Dump him.",
            "Yeah he's fucking with your head. Showing even the slightest sign ob belief from your side will feed his behaviour and denial.  \n\nThe proof is shattering. The only thing that makes you question the fact is that you just don't want to face the truth. Very understandable, but it doesn't change it.  \n\nSorry my dear, you dated an asshole.",
            "He's TRYING to make you feel crazy. He's trying to make you not see the truth. You saw it. You know what he is capable of now. If you give in, he will do it again. ",
            "He is lying and you are not crazy. Trust your gut. I know it sucks to have some asshole blatantly deny what they did, but just accept that he will never admit to his actions. You deserve someone who you can trust and someone who can admit when they made a mistake.\n\nSide note: get STD tested like ASAP. I don’t trust this fucker to use protection if he cheated on you at any point ",
            "I usually think people here are really quick to say \"dealbreaker\" but I agree in this instance. Generally, the intent to do something is just as bad as actually going through with it",
            "He's gaslighting you",
            "Look at it this way.  You know what's true. Even if he convinces you it's not, you know. If you stay, you will begin to  wonder about every woman he talks to.  You will begin to worry about every time you are out of town without him. Every text will start raising alarms, and you will become possessive, jealous, even controlling.\n\nNo relationship is worth giving up that innocence.",
            "It’s beyond sad that he’s convincing you that something as clear as day isn’t what’s actually happening. Women post this exact same story all the time, and yes, their trash boyfriends are using tinder. If a guy wasn’t actually using it, he wouldn’t have a profile or even the app on his phone at all. It’s infuriating that he’s getting you to think anything otherwise. He’s also a terrible person for that, Jesus. Damn, at least fucking own up to it. \n\nYou know what to do. ",
            "He's gaslighting you when he's making you question yourself. You saw his profile, you saw that it was infrequently active, you saw his messages to this other girl back in May when you were away.\n\n&#x200B;\n\nEven if he didn't cheat, the fact that you couldn't even go away for a short period of time either on a trip or whatever, without him going on to try and find someone else is highly concerning.\n\n&#x200B;\n\nIt doesn't matter that he didn't have sex with anyone. It doesn't matter that he didn't meet up with anyone. The fact of the matter is that he is putting himself out there as if he is available. \n\n&#x200B;\n\nThis basic scenario is what happened to me. I had dated the guy for 2 years, only to find out he was active online. A friend of mine found him, messaged him and he agreed to meet the fake girl she had created! So I met up with him instead. And he STILL lied about it. \n\nIf he's unhappy in the relationship, it's simple, leave. If he wants to see what other options he has, then he can be single and do that. But he can't have BOTH!\n\nThis is the biggest issue I have found with modern dating. I know it's not just guys, I have heard of women doing this as well.\n\n&#x200B;\n\nIt just seems like people are never satisfied with what they have in front of them and are always prowling around for the next 'better' option.\n\nSeek out moral support from friends and family. Forget about this guy. He didn't care about your relationship as he was actively looking for other people while you were away. Plus he has lied to you.\n\n&#x200B;\n\nIf he wanted what was best for the relationship he would have been honest and talked to you if there were any issues.\n\n&#x200B;",
            "Moral support -- Reddit got your back on that one. You're absolutely right, you do what you need to do and what you deserve will come. Nothing to worry about.\n\n&#x200B;\n\nA way that doesn't leave you second guessing yourself -- There are only two players in the act of second guessing yourself: you and yourself. Pick your narrative and stick to it; don't let him change your mind. If it's easier for you, don't give him the *chance* to change your mind. Some would prefer to let him explain himself so that the garbage coming out of his mouth gives you extra reassurance about what a low-life he is. But whatever you do, remember YOUR truth and stick to it.",
            "If he can’t come clean and admit that he used poor judgement and try to repair his wrongdoings and instead is trying shaggy’s “say it wasn’t you” approach when everything is pointing to that it was, it’s time to cut ties and walk away. \n\nTell him “you have violated my trust to the point where it cannot be repaired and I would like for you to cease contacting me entirely” and block all outlets for him to engage with you.  \n\nThe fact that you can see that he talked to this girl on tinder and that her number is in his contacts is damage enough and he’s lying to you because he thinks he can get away with it. ",
            "I always told my kids don’t lie, but it they have to lie make sure they are smarter than the person they lie to.  Sounds like your BF wasn’t too smart in covering has tracks - good for you.  It wasn’t a white lie - he wanted to have sex with someone else. As for ending it, be calm and don’t give him the satisfaction of knowing your emotional turmoil.   And don’t afford him the opportunity to tell you more lies. ",
            "I’ve been there before; not specifically about Tinder but having my ex look me in my eyes and swear over and over that it wasn’t true. And every time I tried to give him the benefit of the doubt, and convince myself that it was me that was wrong even though I had clear evidence that my suspicions were true. \n\nDon’t go down this path, it seriously ruins your ability to trust anyone for a while. He did what he did, regardless of whether he cheated or not, he had the intentions and lied to your face about it multiple times. \n\nYou already said you’re leaving him so that’s great, but I wanted to give you some support. You will be so, so much happier and better off, I promise. It will only get better from here! ",
            "If he's lying and you can't trust him it's not worth all the angst of dealing with him in my opinion.  ",
            "He a lying asshole. Trust your instincts.  And this is coming from a guy.",
            "Why is every cheating scumbag on tinder thinks “somebody used my profile” excuse is believable?\n\nI am sorry. You are not that cute",
            "You should trust yourself more not less because of this. He lied straight into your face very convincingly and you still knew that he was full of s*** because of the evidence you found. Now as unfortunate as it is you have had an experience with seeing how it looks when a very good liar lies straight in your face. Unfortunately this should be useful to you later on in life because if you get in another situation where someone is lying to you, you will know that it doesn't matter at all how convincing they seem.",
            "I got cheated on and chose to believe the cheater instead of my own intuition. Never again. It’s bad now, but much more humiliating when you realize you got taken even worse. \n\nAlso - “Who you gonna believe?  Me or your own eyes?”  Believe your own eyes. What would you think if this was a sister or friends story. ",
            "Gaslighters seem to be excellent liars. Its time to develop a relationship with reality that is stronger than how you feel about things or how someone seems. ",
            "This dude is a sociopath. ",
            "Look girl, this same exact thing happened to me 3 years ago. When I found out my bf had a tinder, I confronted him and he swore he'd delete it and 'he didn't even know why he had it really.' I didnt want to end the relationship because his whole family loved me and I wanted to see the good in him. Literally the next day or maybe two days later I saw more tinder notifications on his phone and I found him with another girl at his house. My point is, don't wait until you actually see him with another girl. I thought it would make it easier on me to really know for sure that he was lying, but I ended up just wishing I trusted myself sooner and felt I like an idiot for waiting. Like the other comments said, he's just gaslighting you and you can do so much better. You deserve so much better than that. ",
            "All that I would need to know is 1. He chatted with a girl 2. He had the girls number in his phone. Any of the other craziness is unimportant. He obviously was up to something and either can’t own up to it or is lying to continue acting a certain way. Or at leas that’s what I think (from experience)",
            "It could've been just a chat, this is suspicious, but you cant deny the possibility. I think you could try asking that girl who gave him a number, if there was anything between them.",
            "Same thing happened to me twice. Two different guys, same ass whoopin'. Don't ever put up with that kind of shit. ",
            "So okay, I had a friend who’s bf basically did this same thing and my cousin and I catfished him and brought it to her as proof (turns out we were the second ones that had done this) and her bf had the excuse “I just have it to look for friends” even though the texts and snapchats he sent my cousin were definitely flirty and super inappropriate. ( he also used a pic of my and my bf’s dog to lure girls to his profile) The 2 times he did this, my now ex-friend fell for it and believed him and has cut off 5 of her best friends because of it. What I’m getting at is, he’s full of shit, manipulative, and trying to use you. Don’t be his pawn and get out of there ASAP because guys like that are fucking creeps and you deserve better. Best of luck hun. ",
            ">So I did some stuff that was kind of petty and stupid today: I made a fake tinder account, matched with my boyfriend, and he starts messaging me and immediately asks me to meet him for a drink. We agree to meet by a fountain in the center of my town and I pack up all of his stuff in a tote bag, put on a great outfit and went to the fountain.  \n>  \n>I stood kind of out of the way of the fountain in the shadows where I could watch the street that I knew he'd be arriving from. I was devastated, but I figured this way I could catch him without a doubt and end things quickly. All the time, he's messaging this girl on tinder.  \n>  \n>But he didn't show up. Two of his roommates did. We didn't speak (I don't know them well), but they watched me for a while, figured out what was going on after a few more tinder messages, and left quickly.\n\n&#x200B;\n\nthat would have been golden, but it also confused you, right? With the contact in his phone it's kinda obvious that it was him, but that he didn't show up at your fake-date... I think he just played you - while you tried to play him. It was probably too obvious.",
            "Reach out to the contact in his phone from May and see if your bf met up with her or the roommates",
            "lol, your bf had his two roommates show up to \"prove\" that it's not his account. What reason would they ever have for that and then showing up to meet a girl as two completely different guys? You are 300% being gaslighted.",
            "[removed]",
            "That's called 'gaslighting', what he's doing.",
            "Dump his lying ass he is obviously gasslighting you ",
            "Ok this relationship is over. Trust is totally gone regardless. At this point it’s a matter of closure. Did he lie or not? If he didn’t lie he won’t trust you again. So accept you’re doing this for yourself since you most likely were gas lighted and want vindication. \n\nOk we got that out of the way, now to vindicate you are not crazy:\nCall his bluff, tell him you’re going to call the girl and ask her if she ever met up with him and the nature of their talks. \n\nIf he balks then you have confirmed he’s full of it. If he agrees then bluff some more and say that if you suspect the girl of lying to cover up for him, you will mention to her she should get an STI/STD panel done for “her sake”.\n\nIf that girl did cheat with him, you can bet she’s going to freakout. At least, that’s what you want your ex to think. \n\nHe’ll either fess up because you’ve now checkmated him, or he’ll stick to his story. In which case he may not be lying since he has nothing to worry about. \n\n",
            "I don't understand why you are hesitating, well I do because he is lying so convincingly, but come on. At first I thought maybe in a 1 and 1 million chance this isn't his profile and someone was trying to sabotage your relationship. Then I read your post and it looks 100% concrete.\n\n​\n\n1. He has been active in the past 2 weeks and then he changed his story.\n2. Then you took his phone and logged in through his Facebook. You found he tried to hook up with a girl back in May while you we're out of town. Then he saved her in his contacts.\n\nSo someone needed to make a tinder account using his profile pictures, then log in with his Facebook (needed to know PW) or have access to his phone, and then take her info and create a phone contact....\n\nLike what possible explanation is there? That his information from Facebook was hacked and instead of doing anything worthwhile they made a tinder account and then somehow hacked his phone to make a contact? Is your BF enemies with Russia?\n\nFine lets say his Facebook PW was found out by someone he knew. That person then made a Tinder profile to sabotage your relationship....? How would that person then get access to his phone to make a contact? Did they hang with your BF until finally he left his phone unguarded? Then they were like \"Finally, the last step in the most ridiculous plot to get you guys to breakup! Quickly, make a contact in his phone before he is back!\"\n\nHe is cheating on you. There is no other possible explanation. No one relevant in your life has the resources to do something like this and those who do have absolutely nothing to gain from it. Like what he pissed off Putin after a game of Madden? So he directed his hackers to fuck up his relationship? What?\n\n​\n\n​\n\n​\n\n​",
            "Always trust your gut. ",
            "I’m so sorry that you had to and are still going through this. :/ I suspected my ex wife of cheating maybe 3 or 4 months before she confronted me and told me “get tested.” I saw her messaging this dude on snap and never keeping record of messages, sending her flirty emojis and shit and when I expressed my concern, she also gaslit me. \n\nTrust your gut. It’s better that you learned this now instead of with kids, assets, etc.  Once someone has shown you their true colors, **believe them.** it’ll be very hard to not believe what they’re saying but you gotta have faith in yourself. He doesn’t know her yet she’s in his contacts? Please. This man doesn’t respect you and is willing to hurt you and even put your physical health at risk by cheating on you. ",
            "There is no easy way to end relationships (if you are an empathic person). But, you have to end it. Don't spend tons of times talking, discussing, hashing this over with your boyfriend. Just end it. Block him on all social media platforms.\n\n&#x200B;\n\nGive yourself 2-3 weeks to feel all the feels. Be sad. Talk to your friends.\n\n&#x200B;\n\nAfter that, then get back into life, and move forward without him. ",
            "Here is what he is doing: Sticking by his lie. He hopes he can convince you he is innocent. His excuse is paper thin...there is no way his friend is using his account. Simply no way.\n\nUnfortunately, you may never know if he met with that woman or not.\n\nAssume that he was trying to meet up with her. Convince *yourself* you are worthy of someone honest.",
            "Life is too short to be going crazy over something like this. Him changing his story just shows that he knows he’s guilty of something. It’s not worth your time and sanity to beat yourself over this. If you let it slide and continue to be with him he’ll realize that he can get away with it and will continue to do it. I went through something similar with my ex. She kept on messaging/flirting with guys behind my back but I stayed with her because I had no respect for myself and was afraid of being alone. Don’t make the same mistake I did. There are plenty of people out there that will respect you and treat you better",
            "He doesn't even have the integrity to own up to the fact he got caught red handed. You are in for a very bad time if you go back to him. He's not only a cheater but a liar. No way can you trust him now. ",
            "You could drive yourself crazy trying to figure out what is true. But in reality, it doesn’t matter. You’ve realized that he’s a shady motherfucker and you deserve better. I’ve been cheated on and girl it’s devastating. But I can promise you, as someone who has dated a few fuckboys in my early 20s, don’t spend your time worrying about them. Dating gets so much better. Move on from him, work on making you happy and you will start attracting men who treat you like you deserve. Every second you spend thinking about him is a second you could be making memories with someone better. ",
            "My ex at one point installed apps to see if a coworker was gay. Did it without my knowledge and I was quite taken back. He didn’t think it was an issue. \n\nThen he proceeded to invite someone he met over a tinder (a friend, and they are friends to this day). They got drunk, and passed out on the same bed. Our relationship went downhill from there. \n\nIf you literally saw him on tinder, that’s really something to think about long term. Don’t downplay it. ",
            "Now is a time to celebrate.  You have been given a gift finding out about this.  The evidence is clear, whatever lies he may tell on top.  Leave now with your head held high showing him that you know you deserve better.\nHe most likely :\nWill say you are crazy or overreacting\nSay he didn’t do it\nSay he’s sorry and won’t do it ever ever again I love you pleassssse\n\nIGNORE!\n\nYou are worth more.",
            "he's lying, which makes it his fault this has to end ugly. good for you having self-respect. don't let him gaslight you into second-guessing your rational thinking. find a real man.",
            "He’s trying to lie his way out of it, don’t ignore all the proof just because he is gaslighting you. Leave him - it’s not worth being with someone who lies to you and tries to make you doubt the truth.",
            "From what you're saying, there's no doubt that he's lying/manipulating you to trust him but if you're still double guessing it why not just call the girl and have a honest convo with her?",
            "There is no such thing as closure with a cheater. What matters is he cheated/planned to cheat  and he can’t be trusted no matter how much you may not want it to be true.\n\nDon’t waste ANY more time on him. You are much too precious.\n",
            "There’s zero chance he’s telling the truth. Magically he just contacted a girl or his “friend” did coincidentally when you were out of town. \n\nOf course he’s lying and gaslighting but the truth is obvious. It would be great if he could give you honesty and relief knowing you’re making the right decision by that would involve him looking like the bad guy and he’s not willing to do that. \n\nYou know the truth here it’s just very hard when someone can so easily manipulate you into thinking there’s a chance you’re wrong. \n\nI’m sorry. Don’t waste any more time on this douchebag. You will never, ever be able to trust him again. ",
            "It's pretty conclusive. If his friend created a Tinder account for him, he WOULD NEVER be using your boyfriend's Facebook login.",
            "The question is, are you OK being in a relationship where your partner lies to you. Because he is. The only debate here is, now that he has definitely lied, is what to do about it. That's it. \n\n&#x200B;\n\nMaybe love isn't your goal, maybe you don't mind being lied to. I personally wouldn't choose those things, and I would caution against accepting those things, but you are your own person. Just know that this is the only math you need to work out. Because again, you know that he has lied. You know it. You know that he continues to lie. You know that, too. Don't question your judgement. It happened and its true and those are the facts. What you do from here is up to you. \n\n&#x200B;\n\nPersonally, I would strongly suggest leaving. Have the conversation with him, tell him you believe he is lying. Give him the chance to explain, but for me that explanation would not make me stay. I think you should leave no matter what. But, an explanation would be helpful for closure, and it would help you to not look back or think twice. My rules: Don't trust someone who lies to you, don't build a relationship with someone you can't trust.",
            "You could message her directly to get confirmation, I guess, but it’s pretty obvious. It’s most likely she has no idea you exist. He’ll definitely get mad, but who cares about his feelings when he didn’t care about yours?\n\nEnd it and go be happy you’ve left a cheater. Once a cheater, always a cheater. You don’t need a liar that’s mentally abusive.\n\nJust remember, “nobody fucks with me.” Keep that in your head always. That’s what I do in tough situations like this.\n\n",
            "My ex did this exact bullshit to me. Made me feel like I was the paranoid asshole of the relationship. We lived together, too!5 mentally abusive, alcoholic years of his bullshit. (I don’t drink or smoke).\n\nhe was extremely distant for quite some time, but I stopped counting. It wasn’t until our 5 year anniversary that he “forgot” (even though I had be actively trying to plan a short weekend trip to Chicago with him), that I realized he didn’t give a shit. \n\nWell, he left his phone at home when he went to work, and I sure as hell looked. He had dating apps galore signed though his alternative email that I had a slight idea about but thought was used for spam, and had numerous (15-20+) messages from other girls dating back to the last 2 years of our “relationship”. I’m more mad at myself because I was naive. I knew something was up, but I trusted him more than I should have. I wasn’t entirely shocked when I found this information out. \n\nI never told him about this, and he still doesn’t know that I know (I guess he doesn’t. idgaf, fuck him).\n\nAnyway, don’t go crazy. Your instincts are probably right. I hate to be another “leave the jerk!” But honestly, I just don’t have any tolerance for liars and cheats. It sounds fishy, so it most likely IS fishy. I’m sorry about your gaslighting, mental abusive relationship. Mind games aren’t fun, and you aren’t insane, girly.\n\nGood luck! ❤️\n",
            "ergh I went through this same shit. I ended up believing some bs about insecurity and just testing the waters. A year later ended badly. Wish I'd gotten the hint earlier. Good luck whatever you do",
            "You're right, you can't listen to a word that he says. You have the facts and saw everything yourself - that which he didn't delete already that is. He was very sincere - as he lied to your face,  so what else could he be lying about?\n\n At this point  you aren't even 100% sure that he hadn't already cheated and just never got caught. A guy like him will take advantage of your trust,  always, clearly he isn't staying out of love. \n\nStaying and forgiving will only enforce in him that you have no hard line, no boundary that he cannot cross, cause if sincere enough he can get you to take him back. \n\nYou deserve better. \nGood Luck!",
            "Why is his friend using his Tinder any better than him actually using it?\n\nThat's such a terrible excuse.\n\nHelping a buddy catfish an unsuspecting woman is just as bad to me as him trying to cheat directly\n\nThat being said...he's lying.\n\nIts absolutely not his buddy...its him.  The only time he was active was when you were out of town.  That's a purposeful attempt to cheat when he knew he could get away with it.\n\nAnd he's upset because he never deactivated the account, he just deleted the app.  And he got caught.  So now he is scrambling trying to come up with any excuse he can muster that pushes the blame away from him.  \n\nDump.  Immediately dump.\n\nBeing on tinder while in a monogamous relationship has been and should always be an immediate break up worthy offense.  And if by chance he was ok with his buddy using his profile to catfish other women...that's a break up worthy offense as well because A) its fucking shitty and B) he's allowing his image to be portrayed as single....meaning he is ok with other women thinking he's single, regardless of who is behind the phone.\n\nDump him. \n\nCheaters never change.  \n\n\nThat being said...just a bit of advice.  In your next relationship, don't bring any baggage from this asshat with you.  Its not fair to punish your next boyfriend for the transgressions of this guy.  \n\nBut be up front right from the beginning.  You are deactivating and deleting any and all dating apps and you expect him to do the same. And if you ever see or hear of him on dating apps, you'll dump him in a heart beat.\n\nThat way he knows right from the beginning that if you even catch a sniff of him being a scumbag, you'll bail.\n\n\n\n",
            "OP, if you don’t break up with him now, you’re teaching him it’s ok to lie and cheat on you and he will do it again. Leave this waste of skin ",
            "I used to work on a well-known relationship show, and dating apps/social media were the absolute #1 issue that came up time and time again. There is never, ever, ever a good excuse for a person to have a Tinder profile if they are not actively using it. Period. It's never that they made it for a friend. That is such grade-A b.s. and THEY ALL SAY IT. \n\nYou are 23. Your stock is UP. There is absolutely no reason to put up with even the shadow of a doubt about who you are dating, because seriously, you can go out right now and find someone better. Even if you don't want to date right away, you've got nothing holding you back from having a great f-ing life with none of this drama. DO NOT BELIEVE HIM. Dump, dump, dump.",
            "I was in a very similar situation and let my boyfriend talk his way out of it. I was naive, trusting, in love, and he seemed so genuine. It was all bullshit. He, like your BF, is a skilled liar. Breakup with him now. I would give anything to go back in time and end things there. Instead we got married and he cheated on me the whole time and had an Ashley Madison account. I found out when I caught him with the last one, though I think he wanted to get caught then. Wasted years of my life. Don’t do the same. No guy is worth it.",
            "You know he was on Tinder, got a girls number, saved it, etc. You KNOW all of this... Yet he has continued to lie to you...thats insane.  I don't understand why you're asking for advice instead of just breaking up with him.  ",
            "You found this girls contact number in his phone??? There is no denying that. He was the one talking with her. Just walk away. ",
            "People like this will lie and lie and lie no matter what. Even if he comes clean, he’ll still be lying about something. Even if the house is on fire right in front of them they will tell you it is not and that you are crazy and imagining things. You saw the phone number in his phone, you saw his tinder profile with recent activity, you know he’s lying to you. Run! Run far. I can guarantee it’ll get way worse than tinder girls and lies if you stay. ",
            "Why would you live like that? It’s your choice.\nMove on or stay with a jerk. Simple. Don’t make it more than it is. ",
            "You know that song \"It wasn't me\" by Shaggy? Pretty sure that should be your ex's ring tone for whenever he tries to call you. \n\nNo one is sometimes more sincere than the liar caught. Come on, people have caught their significant others in bed and still had the cheater tell them \"this isn't what it looks like.\" There's a reason that's a cliché. People understand that if they refuse to bend or break and act \"sincere\" it will make a normal person begin to doubt their perception aka \"Who you gonna believe? Me or your lying eyes!\" \n\nDon't take the guy back. His changing stories alone tell the entire story. Stop talking to him and block him. It's done. Also understand you may not want it to be true, but that doesn't make it not true. ",
            "My ex also did something similar, swore up and down that he was not cheating when I had so much evidence saying otherwise. I ended things with him, not just because of the cheating but because I hated feeling crazy for trying to prove that I was right when he would just deny it. I hated feeling like that, I hated being that kind of paranoid person. Any trust was gone and I knew I needed to be done with him for myself and my sanity. ",
            "Break up with him. Simple as that. Men who lie about things as simple as this will lie about anything. Found this out the hard way, recently. Now I’m single and happy. ",
            "He’s a cheater and it doesn’t sound like he has any intention of stopping, just stringing you along for convenience and lying to you all the while. I’ve definitely been here, I’m sorry you’re having to go through this. Feel free to PM me :) ",
            "I caught my ex all but red handed with my best friend and he denied it to the very end even when the 'friend' admitted to it.  Some people will lie even when they have been caught.  Don't trust him, trust yourself and your gut.",
            "You already said that the relationship is over. Cut your losses and move on. ",
            "Ugh, OP, I’m so sorry. I had a very similar experience with an ex-boyfriend. Swore up and down I was on the wrong even though I had all the evidence in front of him. I remember one ridiculous phrase: “Who are you going to believe? The browser history or me?” So, you know, it was all my fault for not adjusting reality to his lies.\n\n\nYou will not get a rational explanation. You will not get closure, and in the off-chance you do, it will not be enough. Because you did everything right and you still got a shit deal. Sometimes that happens and the good thing is - you still have yourself. And who does he have? Himself. In the long run, you’ll realize that you got the better end of the deal. \n\nAnd most importantly, you will love again, and you will be loved back. Humans are good at love. Sending you lots of hugs, OP. It goes without saying, but you deserve better. ",
            "Happened to me once, I believed him. Happened again, his shit was out. I fucking called his mom to come get his stuff because he wasn’t on my lease anyway. Never looked back.",
            "Fuck this guy. He’s lying to you. Leave his dumb ass",
            "I deleted tinder a while ago, will I still show up?",
            "Leave. it's only one year. you're still young dont get caught up with a loser. there is a ton of better people out there. hes not worth the trouble.",
            "One advice: FOLLOW YOUR GUT!!!!! ",
            "Don’t waste your time with someone trying to play you. He’s flirting with the idea of cheating if he hasn’t already. Move on. ",
            "Coming from someone going through the turmoil of a wife cheating on him and leaving him for that AP, be glad you found out before getting married. Eff him and move on, you'll find a good guy and be happier for it. You're young and will be happy without him. Best of luck. ",
            "I say dump him. That seems sketchy that his friends would do that to him/you. If they actually are, he should get rid of them. But my money is on him being full of shit. And if you dont dump him, it means you decide you trust him and let go of this. Can you? If not, there's your answer.",
            "Big time gaslighting. His friends are clearly in cahoots with him. None of the earlier comments about his friends using his account are true either. Run away Simba, run far far away.",
            "I caught my husband on Ashley Madison when we were still dating. 6 years later and he cheated on me with a 23 year old (he's 50) don't waste your time like I did. They don't change.",
            "Please leave him. That's some psycho shit he's doing. Are his roommates really so ugly that they can't use their own Tinder accounts or they're sabotaging their roommate? I don't believe it at all. Just leave asap. ",
            "Ugh. My boyfriend of 7 years just cheated on me with a co worker and also downloaded an app. Don’t be me. 1 year is a lot better than 7.",
            "[deleted]",
            "I honestly feel really bad for how much you want to believe this guy. \n\n>The most recent message on his tinder account when I checked it yesterday was sent to a girl he had matched with before we met. It said \"Would you want to meet up with my friend?\"\n\nHas it not occurred to you that he's actively trying to cover his tracks??? \n\nHe tried meeting a girl while you were out of town. \n\nThere is NO REASON for his friends to use his Tinder profile, or for him to find them girls to date. \n\nAt first I thought *they* were making you look like a fool.... now I think you just want to be duped. \n\n&#x200B;\n\n&#x200B;",
            "People might disagree but the best way of getting closure on it is to do something kinda sneaky again, find the girl Maya’s number and message her, explain the situation and send a picture of your boyfriend asking if she knows him.\n\nAfter that speak to your boyfriend, don’t mention having spoken to Maya but say it’s over unless he tells you the truth, when he says nothing happened confront him with the information from her (if she says she knows him.\n\nIt’s a horrible situation to be in, I wouldn’t cheat on my girlfriend and I don’t know why anyone would, hope you get through it alright and if you ever want to talk to anyone you can PM me or something :) everyone here will sympathise and want to help :)",
            "Just posting to tell you that trying to find out the \"truth\" will do nothing for you. Closure isn't a thing in relationships, especially when it comes to cheating. If they aren't telling you the truth now, what they say when you end it isn't necessarily going to be the truth, either. And, sometimes, more information just breeds more questions.\n\nYou've seen enough to know he's being dishonest and a philanderer. After the last conversation you had, you don't even owe him the time or energy to tell him you're breaking up. Tell him his stuff will be on the porch/outside your door/wherever, block him, and move on.\n\nYou're not crazy. He's just an asshole. ",
            "You could always call the girl",
            "The same thing happened to me at your age. I didn't dump him the first time, but I never trusted him again. And rightfully so as he cheated and lied a second time.",
            "What he says is true doesn't make it true. What you do is ask yourself \"AbleAlgae, is there anything possible that would make me ever trust this guy again short of the appearance of God in the Heavens  with a message of 'yeah, I used his phone, my bad!'?\" And if you don't see any shot of ever having faith in his veracity again, then you do nothing. You do not answer phone calls or the door. You don't reply to texts. You don't acknowledge him on social media. \n\nWhat you do is move on. There's no second guessing \"this guy doesn't make me feel completely loved and valued and gives me  self doubt.\" ",
            "I don’t think you can go back from this and trust him again when you feel like he is outright lying. The fact that he tried to meet up with skeins when you were out of town is too much of a  coincidence to me. ",
            "Too many red flags.  Chalk it up as a lesson learned and move on before you invest more.",
            "Don't you dare second guess yourself, he is a damn liar and apparently a good one. Who knows what else he has lied about. I've seen guys lie like that, sounding so sincere and truthful, but then I found out exactly how full of shit they were. You're better off without him, don't give him the benefit of the doubt, just ghost his ass. Drop his stuff off wherever and get your stuff back from him. Don't let his tears (real or fake) make you feel bad for one second. He dug his own grave.",
            "You're right, end it. Might be fun to ask for his cell phone account login so you can look at his text records and see what he makes up to explain that.",
            "Yup just as everyone said he’s a lying cheater and you should break up with him. How long had you been seeing each other?",
            "Gaaaaaaaslighting. Leave this douche nozzle! ",
            "He is a lying liar who lies. End it and stop contacting him.",
            "I'd...tell him I'd stay if he told me the truth. Get the truth. Fucking leave. \n\nHe's clearly hiding something, probably exactly what you think, and you deserve better than that. But no harm in playing him a little to get the answer if you think it'll help. \"Closure\" isn't always a real thing but for some people it helps. ",
            "TIL the term gaslighting",
            "Before you break up take all of your important papers and valuables and place them with a trusted friend or relative. Put his in a file and give it to him. Then give a date for him to move out or the date you will move out. Pathological liars can be very hard to break up with. They may take turns being irrational, violent, smear your reputation, uncommunicative, stubborn, in denial, weepy, steal pets - you name it. ",
            "You have no reason to second guess yourself. Your boyfriend is gaslighting you. You 100% know what you saw. Do not let him sew even a seed of doubt into your mind. If someone did something like this to me, I would text them, \"It's over.\" Then, I would block them. He will know why. There is nothing to discuss. If you make yourself open for discussion, he will continue gaslighting you as though you are an idiot. You know what you need to know. He knows you know. Just make it official with a text and delete him from your life.",
            "While quite probable, what makes you sure that this isn't the only time this has happened?",
            "It’s him. Is he famous enough for someone else to make a tinder profile out of him? Does he has any friends that would make a tinder profile out of him? If not, it’s him.",
            "Wasn't this posted before? I'm a little confused. ",
            "You have the facts, and he disrespected you. YES, definitely break up with him. Explain why you’re breaking up (lying even though there’s literal proof and you absolutely cannot trust him) and what you need (someone((or not someone at all)) who won’t wait for you to blink before they try to cheat) and stick to your guns. Be strong, you’ve got this. Also, I’m sorry :( what an asshole!\nAt least it was only a year...get out there and have fun! In 6 months you won’t even be thinking about this POS. ",
            "Aww pal. I don't want to be the bearer of bad news, but it sounds like he's at it. \nIt's so easy to compromise yourself and your standards at times like this to avoid the break up (whick I know obviously will be awful for you after you've put in a year of your time and emotional investment) \n\nBut the reality is being sad for a few weeks is well better than sticking around some bell end who sneaks about behind your back trying to get himself some action. You need to put yourself first in this situation even if it's harder in the short term. \n\nI think the fact that he's lying about it is the most pathetic thing about this. You've gave him the opportunity to be honestly and he's lied like a slimey wee toad. That's not someone worth your love and respect!\n\nI'd get him patched, get myself a shiny new tinder! \n \nPs, I'm 31 and I really wish I'd valued myself more in my 20's, my biggest regrets include the times I've let guys away with shit to save a relationship. \n\nI hope you're alright 😘\n\n",
            "He clearly either tried to cheat on you or actually did.  Time to bounce, darlin'.",
            "I'm so sorry girl, it sucks when you learn the person you love isn't who you think they are. It's devastating for a while but you will be so much better off in the long run!",
            "Anyone who doesn't feel sorry with being truthful isn't someone worth convincing yourself to forgive them. Even if he was not lying, he should be on his hands and knees begging for forgiveness for making you feel like he cheated.",
            "you're not crazy! this same situation happened to me, and it wasn't worth it after I knew what kind of person he truly was. I was lucky enough to only waste a few months of my life trying to forgive him, but those were still months that were prolonging the pain of finding out that he's a cheater and liar. you know who he is now, and it's time to leave, despite how hard I know it is. you can always PM me if necessary. so many people have been in your shoes and are here to validate your experiences.",
            "So not only did he cheat on you, he's now gaslighting. How condescending is it that he thought you'd believe his crappy excuse as well? You'll miss his at first but soon you'll be look back and be so relieved you ended it sooner rather than later. I had a similar and experience and when I look back now I actually laugh out loud at the fact that I even had to think about breaking up with him",
            "Like others said DO NOT LET HIM MAKE YOU QUESTION YOURSELF. I have been in the same situation, found my boyfriend on Tinder and he swore up and down that he’s friends were messing around on it. I know his friends and they know me so I thought that was odd but I accepted it. Then it happened again. We broke up. Then we started trying things out again and I snooped one night (not proud of it. I was drunk and paranoid but no excuse) and I had found that he was talking to a girl when we had gone to the city for the day. He continued to swear up and down that nothing was serious, blah blah blah. Don’t subject yourself to this. It sucks. ",
            "It’s not necessarily true that it was recently. One of my friends found my tinder profile like a month ago and I haven’t used it in years.",
            "Ugh. I had a ex so eerily similar... full of denial and transparent excuses that do nothing but  make you feel crazy, and for no reason. It sounds like you're able to see the truth through the gaslighting, his excuses are so ridiculous. You are absolutely doing the right thing by choosing to end the relationship. I would tell him that you can see through his lies, know what's going on, and that \"if he wants to pursue other options, now he can do so openly... because this option is now off the table for good.\" And then block him. No reason to put up with anything more from this guy! ",
            "You deserve better, it’s time to break up.",
            "I've dealt with a lot of gaslighting from boyfriends, so I definitely second guess myself when it comes to these decisions. What helps me is to get REALLY pissed off about it, then write down every awful thing they've done. I then save it to look back on when I need to remember why I made the choice. \"He cheated on me and never confessed. He lied about it to my face multiple times. Blatant lies. I had the proof in my hands.\" Etc etc",
            "Always trust our gut.  You also saw proof... so don't let him convince you otherwise.",
            "Dump his ass, case closed ",
            "Just.\n\nFucking.\n\nEnd it.",
            "Trust your gut and instincts! The facts are all laid out, kick him to the curb.",
            ">He seems so sincere\n\nYea I hate it when people do this. It's easier if they just confess when caught.\n\n\n\nHe seems sincere and they normally do, you only notice it when you have straight up 100% evidence like you do. \n\n\n\nHe's shooting for that 1% doubt and that doubt still exists I've felt it too! But then I realized I don't want to live on that 1%, so even if there was some remote tiny chance he was right I wasn't going to act on it because that ways lies insanity. ",
            "Don't let him gaslight you!! You KNOW what you found is true and he is LYING and you have PROOF.  Dump this loser",
            "What a lying piece of crap. Her number just randomly appeared in his contacts? Okay. 🙄",
            "Mate. You saw it. Leave him.",
            "Well he tried to cheat on you, so...",
            "When someone lies in the face of clear contradictory evidence, the conversation (and I might suggest the relationship) is over.",
            "Once you unmatch ppl on tinder the convo is done away with. So he may have only unmatched the recent.",
            "You know he’s lying. You know what to do. ",
            "Caught red handed. Drop this loser. Nobody deserves to be treated like that. ",
            "It's time to cut your losses. ",
            "Gaslighting will make you feel like you’re going nuts. Trust your gut, gtfo",
            "My ex did the exact same thing with Skout and Tinder. The proof is there... trust yourself and  know your worth. Break up with him.",
            "Here's the deal do you really want to have questions like this in your life with the most important relationship you should have? You so deserve better, OP. ",
            "Sorry, may I suggest an edit?\n\n“Caught my ex-boyfriend on tinder. He swears it’s not true. He must have lost his mind.”\n\nThere, that’s more like it. 😊",
            "Honey, get rid of him now. I had similar experiences with my narcissist ex and if you are lied to once, they will do it again.\n"
        ]
    },
    {
        "post_id": "amguq0",
        "author": "sozmateimlate",
        "title": "My girlfriend (F22) just got a pretty ugly tattoo and I (M22) don't know what to say",
        "url": "https://www.reddit.com/r/relationships/comments/amguq0/my_girlfriend_f22_just_got_a_pretty_ugly_tattoo/",
        "score": 4056,
        "num_comments": 378,
        "created_utc": 1549132332.0,
        "selftext": "We're together for almost a year and our relationship it's absolutely brilliant, I really like her but yesterday she and some friends went out and she got a tattoo on her rib, it's a rose so it's not trashy but the tattoo artist did a fairly poor job and the final result it's less than optimal (to say the very least) I can see she already doesn't love it and I don't know what to say. \nDo I tell the truth and say \"yeah it's rubbish\" (not with those words of course) or do I lie so she doesn't feel bad with something that will stay with her for the rest of her life?\n\ntl;dr: girlfriend got a shitty tattoo, idk what to say",
        "permalink": "/r/relationships/comments/amguq0/my_girlfriend_f22_just_got_a_pretty_ugly_tattoo/",
        "comments": [
            "One thing you could do is ask her how she feels about it, and validate her feelings, instead of waiting for her to pick up on / get tired of you not liking it, and asking about it. That latter thing tends to start off poorly because she’s feeling your disapproval and is going to be defensive. . ",
            "Dude be honest. She can get a kick ass peice to cover it from a really great artist. I have a lot of ink...so advice. You tell her that her idea was beautiful and wonderful and that she didn't get the peice that she deserves and thats not her fault. Then let her know that its completely fixable by a really good artist. Then research really good, well reviewed artist with a lot of experience covering tattoos and big portfolios,\n\nThen save up a GOOD chunk of money (if you're interested in getting the tattoo changed as well, you could consider going half in on it with her to get more money together in half the time) and get a new awesome tattoo to cover the old one",
            "Be honest, but more importantly be tactful.",
            "[deleted]",
            "I don't know much about tattoos, but is it possible it looks crappy now just because the skin is still healing? If so, tell her \"Maybe it will look better once it's healed.\" That will give her \"permission\" to admit she's not thrilled with it now, and if it doesn't get better-looking, she can proceed with a cover-up tat.",
            "You should be honest about it and focus on finding a solution together.",
            "I have two but none on my ribcage, and I'd probably be pretty devastated to go through that pain again because the first one is ugly (though necessary), so I wonder if she is feeling the same. I like everyone else's advice. Just bolster her spirits with love and support and excitement to improve it with an awesome new one. ",
            "A good artist may be able to fix it if she doesn't want a cover up! They could add to it or touch it up",
            "“What matters is how you feel about it babe. It seems like you’ve got some mixed feelings. Give it some time to heal and see if you’re happy with it in a month or so. If not, we can make plans to either get it touched up or covered up by another artist”\n\nIf she really pushes you for an opinion be honest, but restate that it’s her body and she has the only one that has to be happy with it. \n\nWhen I got my first tattoo, after years and years of wanting one and imagining it in my head, I came home and cried because it wasn’t exactly what I wanted and I thought I didn’t like it. After a few weeks I actually grew to really like it. \n\nMy second tattoo was done by an artist who had a 6 month waiting list and it was done to a really high quality, and I really liked it at first but over time I realized I’m not entirely happy with it, so a year or so later I had some additions done to it, and there’s one more thing I want to add to make it perfect :) \n\nI know people say tattoos are permanent/forever or whatever, but you can always fix it up. ",
            "It’s on her rib, not her face. She might come to the same conclusion and get it touched up sometime down the road. Don’t go out of your way to make her feel badly about it. ",
            "Relationships strive on honesty, so be honest, but do so in a very kind way",
            "I think you better post a pic",
            "I see lots about cover-ups but she could always get it lasered off if she doesn't want more tattooing.",
            "Find a better artist and pay to have it redone/covered up as a gift. It's amazing what a talented tattoo artist can do to remedy crappy work.",
            "Do what I did when my friends had legit the ugliest baby I’d ever seen.\n\n“Oh isn’t he handsome!”\n\n“Yep! He’s a baby alright...”\n\n\n\n",
            ">it's a rose\n\n>it's not trashy\n\nAre you *sure*?",
            "For heavens sake, don’t say it’s rubbish  or a botch job, even if its true-chances are that she’s already feeling pretty shitty about it and doesn’t need more reason to beat herself, up or get more selfconscious or down on herself about it.  No need to lie, but there is a happy place between radical honestly and diplomacy.  You could tell her that yes, the artist could have done a better job, and the colours are off or whatever, but stay away from perjorative terms.  Also she will appreciate knowing that she is beautiful to you  with or without a tattoo.   ",
            "Tattoo artist here - without a pic it’s hard to say if it’s bad enough to go to another artist to fix it or cover it. But considering how many bad tattoos I see every day I’m going to just assume for arguments sake that it’s a terrible tattoo. Here’s what you do, offer to get her another tattoo or act like you’re interested in getting tattooed yourself and go into a nice shop and speak with some artists there. While you are in the tattoo shop have her show the artists there her new tattoo. Don’t worry they will tell her everything that she needs to know about that tattoo and why it is so terrible. They will also be able to advise her at that point what her best options are. Do not tell her that her tattoo is trash your self. Let a professional do it",
            "I wouldn’t just outright say that. But if she were to ask you just mention how you think it could look a little better and offer to help find a place to touch it up. If she doesn’t say anything about it just try to let it go",
            "Well it's not like she adores it. Be diplomatic and explain to her that it's not really good and that she needs a cover up, but from real pro this time. ",
            "You gotta tell her the truth. If you lie now, you'll have to keep it up. It's not worth the effort. Plus it's better for her to hear the bad nees from you.",
            "There's a way you can spin this. Next time she asks what you think of it, try to turn it back on her. Say something like, \"babe, it seems like you're not really happy with it. Are you? You deserve to have a piece of art that is as beautiful as you are and if you aren't happy there's stuff we can do.\" DO NOT, UNDER ANY CIRCUMSTANCES, say it's ugly. Focus on her and how it makes her FEEL. Its entirely possible that she is happy with it and she's just picking up on your vibe. If she is, you gotta let it go and find the beauty in it.",
            "There’s a lot of really shitty tattoo artists, I shopped around and ended up traveling to a different city for mine. Nowadays a lot of tattoo artists have a large amount of their portfolio on instagram, that is a good place to look for her to find a tattoo artist who has a style she really likes. Some artists specify if they do coverups or not as well on their profile/website. \n\nI think you should do what other people said and say “I can tell you really don’t like it. I’m not going to like something that you hate”, and support her getting it covered up if that’s what she wants.",
            "> I can see she already doesn't love it\n\nTell the truth if she asks. Be a hero and offer to pay for a cover/touch up for her birthday, anniversary, Kwanzaa, whatever. Win/win for both of you.\n\nAlso consider accompanying her to talk to the artist and or/their manager about her dissatisfaction. I'd be very surprised if any reputable shop wanted unhappy customers showing around their crappy work. If your girlfriend shopped around for the lowest price I wouldn't expect too much help though.",
            "Well, my brother told me that part of my tattoo looked like Aunt Jemima. You know, the lady on the syrup bottle. And it definitely was not supposed to. So yes, don’t do what my brother did. Because it’s stuck in my mind forever. I already wasn’t happy with that part of the tattoo myself. ",
            "Everyone is going to tell her it looks great. And then they're going to wince the moment she turns her back. Don't be one of those people. Her boyfriend is the one person she should expect to be totally honest with her.",
            "I'm going to give you advice from the daughter of a tattoo artist. Tell her that you've noticed she doesn't seem to like it, and if she asks for your opinion tell her that while you think it's a lovely idea, the artist definitely didnt stick to her vision. You can look up other artists and ask to see a portfolio beforehand so you can see if their work is good. My dad had to do many coverups over the years, including one of mine when I was pushed into letting my older brother do my tattoo for me.. never again. Always ask for a portfolio, and as I've learned the hard way, don't back down if you're having 2nd thoughts.",
            "[removed]",
            "[removed]",
            "My husbands reaction was to go demand a refund and take me to get it fixed somewhere better , I would have known he was lying if he said anything other then it was a shitty tattoo. ",
            "Be honest, since this is on her forever. Look up some tattoo artists on Instagram that do top notch work, and get her a cover up session (or they could just fix the rose somehow) as a gift! ",
            "I got a terrible tattoo and my now husband agreed it was bad and got me a gift certificate for a shop to get started on a cover up. It was $$, but I would've been pissed if he would've tried and lied to placate me. But I also knew it was really bad...",
            "Ask her how she feels about the tattoo work, that way shes able to tell you how she feels and you can base your answer on that lol",
            "Acknowledge that she doesn’t seem to be a fan of it so that then you can agree with her without being mean and then bond over it via great sex. Then go with her to get it fixed. Problem solved. ",
            ">it's a rose so it's not trashy but the tattoo artist did a fairly poor job and the final result it's less than optimal\n\nPoorly done tattoo work is what makes them trashy. She's going to get it fixed within a handful of years after she gets tired of looking at it.\n\nIf she says she hates it, offer to be by her side while she finds an artist who does good corrections ",
            "Do not tell her you don't like it. It is on her forever now, there is no point in making her feel bad when there is nothing she can do at this point. \n\nAsk her if she likes it and if she says no suggested that she can always get it touched up by another artist to make it better. \n\nIf she says yes then she likes it and you should pretend you have no opinion on it.",
            "If I were heartbroken and regretful, and were beating myself up about I, I’d prefer my boyfriend lied to me. Tell me it’s not that bad, people won’t even notice, etc. ",
            "I can already tell this won't be a popular opinion but I think you should lie. Last month I got a real bad haircut, I knew it and my husband knew it. At first he lied and said he liked it and honestly it did make me feel so much better, when he eventually confesses he diddnt I was so embarrassed and went back to wearing hats. I was going to get rid of it anyway because of how I felt about it, I imagine your girlfriend will get this covered or soenthing regardless of what you say so why tell her what she likely already knows. ",
            "Just tell her the truth.\n\nAnd this is why I don't get tattoos",
            "\"at least it smells nice\"\n\n? ",
            "I know I’d want my boyfriend to be honest so I could literally have someone to cry to who won’t judge me for picking a bad artist. ",
            "[deleted]",
            "Just remember to do this in a non threatening environment like a room painted in soft colors preferably with a lot of stuffed animals. Probably best to put some smoothing music on in the background. Also be sure speak in a quiet voice when you break this terrible news.\n\n/s\n\nSo many replies assuming this chick has the mental fortitude of a small child. Just be upfront about it good God. ",
            "You can get it covered up pretty easily by another artist. Work from there. ",
            "1 Make an even worse tattoo\n2 Only take yours if your girlfriend takes hers",
            "Be honest. Chances are she knows it is bad and is far too embarrassed to say anything yet. Make the point that the tattoo artist wasn't good, they did wiggly lines or worked the skin too hard etc rather than blaming her personally. \n\nShe has time for this tattoo to heal, get a cover-up and that one heal before summer. Comfort her saying no one will see it but you two unless she wants them too, it was a well thought through place to get it etc. You can snuggle up with her and look at reputable, talented cover-up artists together. Say you will call up and get quotes or advice for her. Good work ain't cheap, cheap work ain't good. The longer you have to wait to see an artist the better they are. \n\nIt may have been a stupid thing to do but I'm sure she has learnt her lesson. Be honest. Help her get it fixed up. Give her a hug. ",
            "Take her somewhere where they can fix it a bit to make it look nicer or get a cover up or she can just get it laser removal ",
            "You either go back to the Artist with her and try to get the artist to give you a a refund. \n\nand/or you talk about it constructively with her and sit down calmly and tlak about it like adults. say you can help her pay for it maybe not now but later and go visit a reputable place. assure her that she's still the same beautiful girl. don't say the tattoo is ugly. say the artist did a poor job and that she deserves better",
            "As for advice, I would first try to find out how she really feels about it, and assuming she doesn't love it, I would start researching better artists who can make something good out of it. Maybe you can help her pay for it as a gift. \n\n&#x200B;\n\nAlso, I cannot be the only person reading this thread really hoping for a pic!",
            "The main concern HAS to be how your girlfriend feels about the piece. If you \"think\" she doesn't like it but aren't 100%, bet your life on it sure, then don't say anything. The concern I would have is that you telling her you don't like it before she herself admits that it's not what she wanted will make her opinion of the tattoo sour or worse, she will change it just to please you. You don't want her to associate the changing of this tattoo with YOUR opinion, only with hers.\n\n&#x200B;\n\nBut if SHE tells you that she wishes it was different, then empathize and say something like, \"I know this tattoo meant a lot to you and I'm sorry it didn't live up to expectations. Let's find an artist who specializes in coverup tattoos and has a style you really like, then you can save up to get it redone how you want it.\"",
            "I would ask her what she thinks of it, and then go from there.",
            "Sounds like the silver lining is she can go to a better tattoo artist when it’s healed and have it covered with something else. Or have it made better.",
            "Pay for a new one. From a better artist. Do not skimp. Do your research on locals.",
            "Honest and tactful is definitely the way to go. And it's easy enough to get it fixed. My artist right now is taking a couple laser sessions to blast a large piece off his arm before doing a full coverup, but you can do a cover-up even without that. His just has huge chunks of black ink",
            "Encourage her to get it covered up or otherwise altered by a better artist? That's what I would do.",
            "Tell her that cover ups exist for a reason and never go to the crappy artist again. ",
            "Be honest. My girlfriend says so and she can be mean. ",
            "I wouldn't tell her it's ugly because it implys she has bad taste instead i would say the tattoo artist didn't do a great job if I'm being honest ...\n\n",
            "I once asked a guy why he had a sea gull tattooed on his arm , he corrected me and said it was an eagle",
            "\"...there is room for improvement\"?",
            "Okay, i feel like some of these people saying you should tell her, dont have tattoos. It's permanent. The worst thing in the world, is someone telling you your tattoo is shit. Dont hurt her feelings, dont make her feel worse about it. Just support her and comfort her about it. ",
            "If she brings it up suggest she go see a reputable artist to have it touched up or corrected. I had a horrible one that I got covered up and you can't even tell the abomination was there in the first place.",
            "You could say something but then again maybe she has her reason why she likes it unless it's just some random tattoo maybe there's a legit meaning behind this tattoo I don't know but again you don't have to like but she does \n\nMaybe she could go down here else and get it fixed ",
            "Just whatever you do, don't go in on it to hard. Tattoos and the experiences around them are personal. Wait for her to say something and help her find a more reputable artist in the future. ",
            "Be honest, then she will be too (even to herself) and she can always get a cover up if that's what she wants :) not the end of the world",
            "Ugh, as a 22F who started seriously considering a first tattoo just very recently, this is super discouraging! I was all gung-ho about it but now I’m scared it’ll turn out badly 😶",
            "Just offer to find a good artist to help cover or touch it up. \n\nYou could say “hey I’m sensing that you’re not super happy with the job that artist did on your rose. How about I help find a good artist to touch it up? I can help you pay for it. I love you no matter what rose you have. “",
            "My wife has a tattoo that I drew. It ties in symbolic flowers, childhood symbols, and is more or less a tribute to her late mother. We worked hard to get a sketch that we liked and featured the important things, and the artist seemed confident in interpreting it.\n\nWhile the end result is very pretty and eye catching, there ended up being a disappointing lack of attention to detail or subtlety. She has a lot of ink and this one is the only one that I look without total admiration. She shares similar sentiments, and a retouch is on the list of things to do once money allows.\n\nI also have tattoos that my wife is unimpressed with, including one that is my own art/design, so I understand that when you get a tattoo it can be hurtful to get negative feedback. I also know though how much it sucks to pretend to love a tattoo that isn’t exactly what you hoped for.\n\nEven if a tattoo isn’t perfect, I think time dulls down the strongest feelings either way, and eventually what remains is the meaning of it and feelings you had when you were planning it.\n\nMy advice is to give your GF time. She might say now she loves it, even though it has flaws. In a few months when it’s just another part of her body, casually mention that you wish it had cleaner lines or more solid color, and see how she reacts. She might reveal that she agrees or has other ideas on how to fix it, or she might be surprised and disappointed - in which case you can reassure her that it is lovely as it is, and maybe your suggestion would be better for a different style of tattoo.",
            "Well you can give her a new one , like from a serious makeup artist, and i hope she learned her lesson on not having something permanent though on the spot, she could have gotten an infection or it could look even worse.",
            "I was with my ex for 9 months. I got a tattoo that I really love even if I know it's not the best one, for me it's perfect. Our was a long-distance relationship, so i sent the photo of it, I wanted to surprise him (even if it's not a love-tattoo) so he didn't know at all about it, he answered \"that's real shit\". I felt so bad. Imo you should say her that you don't love it, but with kind words and in a respectful way, if she likes it. It's a forever tho.",
            "Well another thing to consider is that if she's not happy with it, it can be fixed by the right tattooist. I def. wouldn't suggest saying \"yeah that's a shit tattoo\", ask her if she's happy with it and see what she says. If she's not, you can comfort her by that fact that it can be fixed or improved by another artist.\n\n&#x200B;",
            "I wouldn't make your opinion central, instead I'd ask her how she feels about it.\n\n\"Hey, I've noticed you don't seem totally happy with your tattoo, is it something you need to talk about?\"\n\nIf she's not happy with it then be supportive, remind her that cover-ups and touch-ups exist and she doesn't have to be unhappy with it forever, and assure her that you still find her attractive and think she's incredible in the meantime. ",
            "Tell her to save a good chunk of money and spend it on a cover up by a talent artist ",
            "I got a tattoo of a skull on my arm. When I showed my gf she said “it looks like it should be on a fat chicks tit”. I laughed and got it covered up w a badass tree",
            "You can go to a better tattoo artist and they can fix it in creative ways.  Saw some videos about fixing shitty tattoos it is amazing ",
            "When I was 19 I got a dumb cartoon cat on my ribs, sounds like in the same spot as your girlfriend. I kind of regretted it at the time but I'm 31 now and eh, it's not great but it's a part of me, I don't really notice it most of the time, and most people who have seen it think it's cute. \n\nShe's going to go through a lot of feelings about it - affection, annoyance, dislike, maybe even shame. There's nothing you can do about these feelings but listen to her if she wants to talk. As for what you should say to her, you're really going to have to feel her out. She might be relieved if you say \"yeah it's rubbish, but it's okay baby, you're beautiful and you;ll get used to it.\" Or she may want you to say \"no, it's totally fine!\" so she can live in denial for a while before she accepts it.\n\nBut the important thing is her feelings about it WILL change and eventually she'll find a way to live with it. And honestly tattoo removal technology has come a LONG way so that's an option down the line.",
            "Get it improved. Problem solved.",
            "My little brother got a tattoo that literally says “bacon” on his shoulder a few years back. It’s going to stick, but at least a rose is a lot better of a tattoo than he had! It could be worse!",
            "1) clearly need pic of bad tattoo to give advice.\n\n2) I have a pretty bad tattoo I got when I was 20 and I’m 31 now and it doesn’t really bother me at all. Its representative of a time and a friendship for me. If you can try to get her to look at it as a symbol rather than an art piece, it might help",
            "Tell her the truth because there’s tattoo removals now. ",
            "Also, next day after a tattoo isn't the best time to judge it depending on her skin... Many times they look like shit between redness, swelling, bleeding and generally angry skin. Not everyone, but mine look like holy hell right off the bat.",
            "Find an amazing artist on Instagram and have him fix it up for her after it’s all healed. ",
            "Tell her you're a little upset for her that the tattoo artist didn't do a better job. All that matters is that she likes it though. If she values your opinion so much that she's going to feel horrible when you tell her that you don't like it maybe just don't say anything at all. Your call. ",
            "You don’t have to tel her you don’t like it if she isn’t happy . Just say “ I want you to be happy wit the outcome. Let this heal up and we can work on saving to get you covered up with something you’ll love” \n\nShe doesn’t need to know if you like it or not if she already isn’t happy about it. \n\nSave up like 5-600 dollars and get her the tattoo she has been dreaming of ",
            "If you don't want to go back on what you've already said to her about it being good, you could always tell her it's not healing/healed well as it heals, and point out breaks in the linework/shading. Then suggest maybe getting it covered by something done better by a better artist when it's fully healed. \n\n That way it's not undermining her choice or the design, just the execution by the tattoo artist. ",
            "Did she ask for your opinion?  If yes, tell the truth. If you can see that she already doesn't love it, then she knows it's shit and your bringing it up will make her feel worse about it. Trust me, I have a shitty rib tat and would be upset if someone else told me it, because I try not to think about it.  If no one compliments your tat, you know it's not good.",
            "If she expresses regret or dislike of it then support her and help her come up with ideas to fix it and look on the bright side. I'm sure it can be fixed by another artist. Of course it'll have to heal first but it isnt the end of the world. And if she wants to keep it then support her there too. \n",
            "Never lie to your girlfriend. Be honest, but be sincere, which means of you absolutely despise it, tell her so. To me, it sounds like you're just as much worried that she doesn't like it than that you don't. I'd start off with that",
            "I have multiple ugly tattoos.  I got them when I was younger so maybe I'm not so sensitive about it.  My boyfriend once teased me about my ugly pin up girl tattoos on my legs and it still hurt.  But now I can laugh about them.  And i wouldn't have thought about getting them covered up unless someone said something to me.  And now im thinking about ideas for cover ups and God I have like alot of shit tattoos i thought were a good idea when i was 17. So i have alot of work to do.  But at least im bettering myself and how I look.  Bringing it up maybe not as rude as my boyfriend did would be a good idea.  It's not like she can do anything right away and it needs to heal.  ",
            "You'll both forget it exists after a couple months, then after that you'll laugh at it together. Don't stress about it.",
            "You should be honest and maybe go to a better artist to fix it up?",
            "Maybe don’t be brutally honest, but let her know that she can go to a better artist and get it touched up so it looks better!",
            "I am a girl with some shitty tattoos. Time will make this easier to talk about. Until that time has passed, I wouldn't bring it up. But I also wouldn't lie if she explicitly asks you.",
            "Let's see the tattoo, mate. ",
            "Encourage her to get more work done in the area and make it look beautiful!",
            "Be honest.Suggest how she can get it fixed but a different artist or totally covered up.",
            "Be honest so she can get it fixed by an actual artist. ",
            "\"That's a pretty ugly tattoo\" oughta do it.  \n\nIf u wanna get real blunt \"Have you lost your cot dam mind?  That ugly shit gon be on you the rest of your MF life!\"  \n\nHonesty always brotha.  ",
            "Don't be fake. Just be like \"hmmm yeah it's a bit off, but you can always tattoo over it\"",
            "Don't say anything without her prompting. If she asks for your opinion, that's one thing, but don't just bring it up on your own. Doing that may really upset her, and could come off as overly rude. If she does ask for your opinion, then be honest. Small tattoos aren't hard to remove, or get covered or touched up by a different artist.  \n\n\nI really like one of the top comments suggesting you ask her what she thinks. It sounds like a great way to address it if you really want to talk about it with her. ",
            "Just be truthful, even if it hurts a bit. Always better. ",
            "Say nothing unless she asks",
            "Empathize and sympathize. She already expressed she regrets it and doesn't really like it,  so validate her feelings by echoing them to her and get annoyed with the tatto artist on her behalf. Support her by assuring her you love her and think she is sexy and her body is still perfect in your eyes. A bad tatto sucks but it's not a big deal, lots of people (myself included) have a bad tatto that just is what it is. She can get a cover up or leave it as is and have it be a memory of a bad decision and a good time. \n\nMost importantly validate her feelings and her right to be upset about it and let her express herself.",
            "A long time ago I got a tattoo and ended up hating it. My boyfriend knew I didn’t like it so one night we were planning to go on a normal date for movies and dinner. Instead, he drives us to a tattoo shop and says he hates seeing me sad about my tattoo so he got it covered! It was the ABSOLUTE BEST date we’ve ever been on and the most thoughtful surprise!!! Maybe you could take her to get a cover up or get it fixed up and hold her hand while she’s getting inked. ❤️",
            "Why say anything?  You can deflect and be polite. I certainly wouldn't be the one to broach the subject. ",
            "A little off topic but I’m curious because I’ve never gotten a tattoo. What happens if the customer doesn’t like the final result? I mean, I know they still have to pay but is there something that can be done to fix it at that tattoo parlor without spending more money? Do tattoo artists/parlors do anything for disappointed/dissatisfied customers or are they just stuck with a tattoo they dislike until/if they get it fixed/covered?",
            "Yeah, just start with asking about her opinion  because it was her choice to get it, and it's on her body so only she can decide what to do with it. Don't let her validate her tattoo just because you say it looks okay if you can obviously see she isn't happy with it. And if she says she doesn't like it you can suggest options such as a redo or an edit of the tattoo so it becomes something different or at least looks better than the one she currently has. I've seen some tattoo artists do that.",
            "She can get a cover up or pay for it to be removed. Cover up is easier though. Help her research someone who specializes in cover ups and suggest she schedules a consult.",
            "Misdirection. If she gets an even bigger tattoo in her face, nobody will notice her ribs! I kid I kid. The good thing is tattoos can be fixed by a reputable artist. It might cost some more money, but it’s worth it. Trust me, I lost count of how many tattoos I had at one point.  ",
            "My wife got a tattoo on her ribs and she misspelled it. Luckily it’s in another language plus people don’t see her ribs except at the beach really so I’m the only one that knows. We have a good laugh about it from time to time",
            "She can always get it covered up by someone who is a better artist",
            "Tell she can get it fixed and to go somewhere else",
            "I definitely wouldn’t lie, that never ends well. I’d maybe just emphasize that you don’t think her tattoo is dope, but that you think *she* IS, and that though tattoos are forever, there are always other artists who can cover or fix bad ink! \n\n(Source: I have an AWFUL tattoo on my thigh that I’m really insecure about, and when my guy first saw it, he says, “Well... You’re right, it is a bit awful. If you really look at it, though, you can see how easily it could be fixed up! And you are beautiful, a subpar tattoo doesn’t change that one bit.” I’m paraphrasing a bit, but it totally melted away any insecurity I have about it, and I appreciated his honesty.) ",
            "I got a shitty tattoo of a tulip on my rib when I was 17 and it has not had any negative affect on me or my life whatsoever. ",
            "Hug her and tell her she’s beautiful no matter what",
            "Be honest. But I would not be so gentle. I've gotten a few tattoos myself but before I did it I went to a artist that I knew could produce quality pieces. This could be a life long decision and she went off half cocked. Im not saying put her down but expecially If you plan on staying with her a while she needs to be able to think life altering things through thoroughly enough. Finding a tattoo artist who can do a rose isn't hard you should really drive home that point. Obviously I know my idea is more harsh but I've had similar problems in the past with my gf and this approach really helped her think things out more\nHope for the best\n",
            "You go out of your way to find an amazing cover up artist who would blow the tattoo out of the water. Then you pay for it. You take her there as a surprise one \"date night\" and get it re worked with whatever she wants.\n\n\nThen you score mad brownie points and know that you just won a huge plus in her books.\n\n\nAlright. Skip too Bobby.",
            "Hey, doesn't matter how good to bad a tattoo looks, you'll both obsessively look at it for a few weeks, then you'll get used to it as if it's not even there. It's amazing how much we get used to things. Even a beautiful tattoo might look a bit out of place before you get used to it, and even a shitty tattoo might become endearing. So before it's healed enough to think about covering it up with a new tattoo, you can just ensure her that you'll get used to it like a new haircut. Ask her in a couple days or weeks \"how do you like your new tattoo now that it's no longer as new?\"",
            "She can get a good cover up. Have her look uo artists and make sure she looks at their previous work porfolio to see if she likes that persons work.",
            "Tell her its beautiful, and get that goose neck. ",
            "I don't understand why you'd have the need to tell her your negative thought regarding the tattoo. It sounds like she's slowly realising that it was not the brightest decision and regretting it. By adding your negative opinion, it would make her feel worse and that's unnecessary.\n\n Instead I suggest that you should be supportive and ask how she feels about it and move forward from there. If she says she likes it, just let her be. If she hates it, suggest a cover up or a lazer removal. ",
            "See what she says about it. If she doesn't like it she will end up saying it. \n",
            "People make this so complicated. If it’s bad just tell her. She can get a cover up",
            "Lie lie lie...it’s perm....not worth breaking her heat over now ",
            "Unless you have a way to fix it ASAP go with it. Because if she already knows it’s bad and she can’t do anything about it telling her how bad it is will only be hurtful to someone who already knows they have made a mistake.",
            "see if a better artist can go over it or touch it up to make it look better ",
            "Hey look on the bright side, at least she didn't go to the same tattoo artist for her brows...",
            "Bring it up, and get her to say her opinion on it, lightly agree with her. And suggest she should get it redone by a better artist when it heals or whatever. You don’t even have to agree with her though. ",
            "Be honest, say it looks like rubbish, take her to a GOOD artist and have something better done.. Like maybe have that old ugly rose looking into a mirror where there's a really nice new rose looking back. I dunno",
            "For a gift get her time with a different artist, and maybe they can fix it? ",
            "An ex got a 'tramp stamp' on her lower back with the back of her dad step father. Banging that from behind was just weird looking at his name... ",
            "Maybe instead of the loaded question \"are you happy with it\" give her an out in the likely event that she is not happy with it AND defensive. \n\nGo with \"On a scale of 1 to 11, HOW PSYCHED are you with your new ink, Babe?\" (Or whatever pet name you may call her.\n\nThat way, it doesn't automatically imply you hate it and lets HER be the one to broach the \"IT FUCKING SUCKS!\" territory while you get to stand there and be supportive with all your newfound advice.",
            "I believe laser tattoo removal is a thing. Not totally sure but I think there are limits on some colours",
            "How about treating your girlfriend to fixed the tattoo? or cover it up? ",
            "This is a nightmare for me. I hate tattoos. I don't care if people have them, but they're an instant turn off to me. Of course I wouldn't ever tell my partner they couldn't get one, but man... if they came home one night with one? I dunno. Especially if it was really bad or ugly... What a nightmare.",
            "My ex got a poorly drawn cat on his neck, I said I like the panthers color. He said it wasn't supposed to be a panther, it was supposed to be a tiger. I asked if he liked it, he said no. I replied me neither. Just be open with your partner, you don't HAVE to like it.",
            "Take her to a shop and add stuff? ",
            "Do not lie, be honest.",
            "I don’t think you should be so extreme with your opinion, you can say that he could do a better job, but if she she doesn’t like it, tell her she can always fix it going to someone who is better! Support her, make her feel better and try to help her to find a solution for it, she can remove it, cover it with a new one or fix it :-) ",
            "Start by asking if she likes it. If yes leave it at that. If not recommend going to other tattoo artist to redo it and make sure she sees the work of the tattooist before having one redone with him",
            "You don't really need to say anything unless she asks, if she does ask then just say the truth but you should also let her know that a tattoo is not really a big deal as everyone always say (kinda annoying), nowdays a tattoo especially on the ribs can't even be noticed so it's chill. If it was me i would just get a bad tattoo myself so we could be bad tattoos couple haha",
            "This happened to me.... I got the tattoo and it wasn’t exactly what I wanted, and I also regretted the placement and became somewhat depressed about it because I felt like I “ruined my body.”\n\nI also didn’t learn my lesson after 18-year-old me got a tattoo from the cheapest place she could find to defy her mother. The first tattoo also looks nothing like the picture and was so faded from the start because he did such a shitty job that I never deliberately showed it to anyone.\n\nThe bottom line is... the 18-year-old me tattoo tells a story about the little asshole I was as a teenager. It’s part of my life. A story. A memory. And while it’s still ugly as can be, and kind of funny actually. It’ll probably be a teaching moment i share with my kids someday. I actually like it now for those reasons.\n\nThe second one I just got, I know that I got for a reason and that reason will never change. It will be an image that defines this moment in my life and it’s not nearly as ugly as I thought in the initial regret phase. I actually like it now because of what it represents. It’s all about perspective.\n\nAs far as both tattoos go, they become part of your body and even if it’s wild in colors and huge, you won’t even notice it’s there after a while. When you look in the mirror, you won’t see it... it becomes wallpaper....literally part of you. ",
            "Just say it's \"cute\" if she asks. It's on her rib, it's really not a big deal. Life is short, it's just a tattoo in a hidden place. ",
            "What she said? Maybe she thought this tatto is very fantastic......",
            "If she feels it's bad herself, you stating it too contributes nothing. I don't think you have to say it's rubbish, but don't lie either. Find some middle ground if you need to say what you think.",
            "I assume you're close?\nSay 2 things. What the fuck is that? And then joke, well I'm glad they invented laser removal.",
            "Tell her the truth, nicely. Then do your research and take her to a cover up specialist and have it fixed. The sooner the better. ",
            "If you can see she doesn't it like it, tell her she can get it lasered or covered up and it's not the end of the world. Tell you you guys can research artists together ",
            "How is a rose not trashy?? Everyone who has a tattoo has one. Its embarrassingly cliche. ",
            "If she personally decides she’s not happy with it it might be a great opportunity to properly research some artists and get a tattoo coverup that she will really love, you guys could even look into it together. ",
            "You can always ask if she actually likes it and save some money to get it redone by a credible tattoo artist. If she already doesn't really like it it's only going to get worse.",
            "If she’s upset with it then be honest but don’t say it in a shifty way. I understand it feels sucky but my boyfriend has a number of trashy tattoos on him from his younger days and I don’t necessarily like them.. but they are a part of him so I love them ",
            "I’d say to keep your honest thoughts to yourself. Instead, ask her what she thinks about it. She will probably tell you the truth. Then maybe offer ways she could fix it (if there is a way). And then if she asks your opinion just tell her something like “it’s your body and your tattoo. Everyone else’s opinion shouldn’t matter”",
            "if she is regretting it, there are a few options...\n\nShe learns to love her shit tattoo. Our mistakes are as important and interesting as our accomplishments to some degree. I've kept a few shit tattoos, I've also had a few fixed, which brings me onto option 2...\n\nHelp her find a tattoo artist who is particularly good at cover ups/tattoo repairs;\n\nTattoo removal. Expensive, long, leaves a mark but it is an option.\n\nTry and reassure her that it's just a tattoo and there are options if she isn't happy.",
            "I'd offer to go with her to have a different tattoo artist either cover it up or touch it up so it is to her liking.  Make the effort to go with her. Maybe even get inked together. Be subtle, be kind.  It will work out in the end.",
            "Tell her what you think and say some thing like but because i love you we will find a good tattoo artist and get it fixed.",
            "You should get a shitty tattoo too. ",
            "It’s a rose so at least it is trashy.... lol",
            "> it's a rose so it's not trashy\n\nuhhhh lol",
            "Say nothing..it's not your body.",
            "Say you like it and forget about it. Who cares? Tattoos are subjective anyway and are like art in your wall. Give it a few weeks and you won’t even see it. ",
            "Just leave it. Who cares, its just a tattoo. If it's not affecting you relationship directly why would you make it a big deal? It's her body, let her decide if she likes it or not. If she was adult enough to get it done then I'm sure she's adult enough to get it fixed if she feels lien she needs to. By the sounds of it she didn't ask your opinion before getting it done and it certainly doesn't sound like shes asking for your opinion now. ",
            "This comment is not helpful in anyway but I just wanted to say this post wreaks of British. ",
            "Lie.\n\nYou can either be right, or happy. Pick one.\n\nShe already knows she has a crap tattoo. Don't make her feel bad. Lie and make her feel good. Happy, or right.",
            "Nothing,don't say anything,not worth it 😌for atlw\nEast awhile yet let ",
            "Old dude with lots of tats here:\n\nAre you serious? Shut your mouth and have some chill in your game. Enjoy her while you're young. She, like her tats, will be the first of many some good some bad. Life's short, get over it.",
            "Be honest, not cruel. Start by asking if that is what she actually wanted. Don't ruin a brilliant relationship by mocking a rib tattoo. Now, if it was always visible or on the face...",
            "Don’t say anything. That ish is permanent and so if she likes it just let her like it. No need to make her feel insecure about it.",
            "Be honest with her, maybe she can get a cover up, you two can get matching tattoos ",
            "Did you not want her to get a tattoo in the first place? If that's the case, her getting another tattoo to cover up the botched one will be even more noticeable and will probably bother you even more. If that happens, she'll be able to tell you hate it and it'll cause issues between you. Personally I'd be honest about how you feel but respect that it's her decision on how to handle it",
            "You don’t need to tell her, especially if she already doesn’t feel great about it. If she ASKS you, and seems to want your genuine opinion, feel free to tell her that you think the artist fell a bit short of carrying out her idea. But really, art is subjective, and if she likes it, what do you stand to gain from deriding this thing that she’ll have the rest of her life? If anything, she’ll be less likely to show that part of her body to you, knowing she’s being judged.",
            "Tell her the truth. Then consult with a reputable dermatologist about having it removed - and do not get any more tattoos. ",
            "be honest with her. also its her tattoo, so w/e. If i got a tattoo with shoddy workmanship, I'd like to know",
            "be honest, gentle, and loving. \"it's not a great tattoo, and I can tell you already know that. But I love you, anyway. You're still gorgeous and delicious, and not tattoo is ever going to change that.\"",
            "Go to a Plastic Surgeon and have it removed.  There you go.",
            "She’s stuck with it forever so just say it’s nice and move on! Saying it’s not great won’t do anything other than annoy her that she can’t change it. \n\nEdit: plus it’s a small bit of skin on a whole person, it’s not important. We’re not here for long, don’t worry about little things like this.",
            "Tell her this: \"hashtag, 'life decisions'.\" Then, kiss her on the  forehead and start up a movie for the two of you to focus your attention on for a couple of hours. And never talk about it again.",
            "Your girlfriend just went and got a tattoo without even mentioning it to you? Lol what ? That’s pretty inconsiderate. ",
            "Don't downvote me just because I will admit up front I am not a fan of tattoos, because they are permanent.  Are tattooists licensed in every state? Because blood  has to  be involved, so there is risk of HIV or other infections.  I'm sure many are scrupulously clean, but the majority?  I wonder.\n\nSo here's my question: What's wrong with getting a high quality temporary one?  Do those involve piercing the skin as well?\n\nEthical artists are not supposed to ink anyone who is drunk or underage, but if you're trying to pay your bills, it's a temptation.  \n\nAnd how safe are the inks?  I think they must have heavy metals, is that right?  Regardless, they are not safe for people with autoimmune diseases.  \n\nI've seen people with beautiful work, and I can understand the emotional aspects of memorial tats, but honestly think they are a bit narcissistic.  Why not donate the several hundred dollars to a good cause in your loved one's memory?  \n\nIt's just my opinion, and none of my business, but I'm curious.  I don't think it's a moral issue or anything.  \n\n\n\n",
            "I agree girls who have tattoo tend to be very trashy in general. Ever heard of a tramp stamp. ",
            "People are still getting tattoos? \n\nShe makes decisions like this, just imagine what her future HUGE mistakes entail",
            "Tactful approach is best. Couples therapy would be a great opportunity to bring up your concern. "
        ]
    }
]