[
    {
        "post_id": "b4tq6y",
        "author": "GeorgiaApple",
        "title": "UPDATE: My [27F] boyfriend's [27M] old crush returning after a few years away. I was worried he would leave me for her, sadly I was right.",
        "url": "https://www.reddit.com/r/relationships/comments/b4tq6y/update_my_27f_boyfriends_27m_old_crush_returning/",
        "score": 9161,
        "num_comments": 394,
        "created_utc": 1553412482.0,
        "selftext": "Old post - https://old.reddit.com/r/relationships/comments/4xgz9v/my_25f_boyfriend_25m_had_a_crush_on_a_girl_25f/\n\nHe ended up breaking up with me about a month after she came back and got back with her. It's been two years since this all happened and I heard through the grapevine they got engaged last weekend. I've moved on and it's alright, but my heart breaks when I think of how insecure and self-conscious I felt when all this went down. I know I'll eventually find a guy who I won't have any worries about, until then I'm chilling.\n\n**TL;DR: I was right to be worried.**",
        "permalink": "/r/relationships/comments/b4tq6y/update_my_27f_boyfriends_27m_old_crush_returning/",
        "comments": [
            "I get you. I was supposed to be getting engaged and married to a guy who I thought loved me. Come to find he was cheating on me. They have since gotten married and had a family.\n\nThe biggest thing that stung wasnt the fact that he cheated, but the thought that I wasn't good enough for him but she was. I had to realize that I was good enough for a good man.\n\nYou are good enough. You are worthy of love and affection. You are 100% worth it and there is someone out there who will see that. I promise you.",
            "I'm so glad my ex cheated on me with my roommate. They wound up married with a kid then divorcing 5 years later. I met my husband 6 months after they screwed me over and I've been married 21 years now. Don't settle. You're worth it!\n\nedit: fixed a word. ",
            "I think the worst part of being betrayed by your so is that you gave your trust to the wrong person. When that happens you start to doubt everything else you were once confident about. ",
            "I had something similar happen to me in college. I was dating a guy who’s long term gf moved away. She was gone for a good year, and when she returned, she contacted him. She knew we were dating but started calling him to fix little things in her house or fake medical emergencies. I was getting tired of it and told him so. He said he would put an end to it and I believed him. \nWe reached two years and he took me to these beautiful botanical gardens and we had the most amazing lunch. Get back to my house, ended up having sex. Once we were done, he got up and said he was going back to her. \nObviously I was shocked and angry. Told him off and threw him out.  \nThey got back together for a time period, then she left him for her best friend who was a woman. He tried to call me Again and I told him to get fucked. He ended up sleeping with a friend of mine out of spite. Such an ass. \n\nGlad you are doing well OP. His heart was just not in it, and that wasn’t fair to you. ",
            "Snap. My ex cheated on me, threatened to leave if I ever got pregnant, never pulled his weight etc. Within a year of me rumbling him and kicking him out, he was still with the other woman...and their baby. We had been together for 10 years. \nThe problem isn't you. It's them. And we should all just be glad in the end that someone had the guts to end something that wasn't working. Plenty of other people carry that shit on for years. You deserve better. You'll find better. Until then, enjoy yourself. ",
            "Hey OP! This sucks. I know what it feels like to be placeholder. Don’t worry. You’ll soon find someone who treats you well. ",
            "Damn this hit me hard. I know if my boyfriend’s ex ever moves to our area it’s 100% over for us, he’d leave me for her in a heartbeat. I know how shitty it feels to feel like the second choice, to feel like there’s always someone out there more “worth it” to him than you and that you’re just a placeholder. \n\nYour old post is kinda making me reconsider my relationship, ngl",
            "Similar thing happened to my sister. She went out with a guy who’d been engaged and was “over” his ex fiancée. She always felt in her gut he was still into her but he gaslighted the shit it of her all the time. Eventually she dumped him and he immediately befriended his fiancé again and eventually they got involved again (in front of my sister no less).\n\n\nAlways trust your gut ladies.",
            "I’m sorry you had to go through all of that, you must be very strong. The attitude you have right now regarding your future relationship is amazing! I’m chilling right now too and I wish you all the best!",
            "I'm sorry, OP. That was a tough situation and it sounds like you did the best that anyone could do. I understand where you're coming from when you say your heart breaks for yourself because of how insecure you felt. I have dated men like Harry and the story is the same. My friends have also dated Harrys, and one Harry was even in love with his best friend's fiance and was just waiting until she left him... Harrys are everywhere. But you know how to identify them now, and you know it is not in your best interest to date a man who is attached emotionally to someone else. You didn't know that information then, but you do now. And that information is gold.\n\n",
            "There'll be someone who adores you and who thinks you're the loveliest person on the planet. But your ex was not that person.\n\nI promise you'll look back on this in years to come and be glad you aren't with him anymore but I'm sure it's really painful now. Take care of yourself x",
            "Hey OP - thanks for the update!\nI know you probably already know this but you will find someone who wants to spend the rest of their life with you and who’s going to love you wholeheartedly and you deserve that. Every good person deserves to have someone like that.\n\nHim leaving you for someone else is going to be blessing when you meet the right person and realize life is life and sometimes things happen, you get hurt, but that only makes you more whole of a person - more capable of loving and being loved.\n\nStay strong! ",
            "You'll find your match OP! But until then keep finding other ways to make your life super fulfilling!! ",
            ">and she's prettier, smarter, more funny, more interesting, etc. than me.\n\nReading this in your old post broke my heart. Don't ever think down about yourself, you seem very sweet, very honest and like a real catch yourself. It's a shame you got caught up in this, but don't ever let it make you feel that *you* were the problem. Unfortunately you were blind sided by love and thought you secured something, but his heart was never there. Im sorry that you went through that, you **will** find somebody who will treat you right, and will be your everything. \n\n\nBut id like to imagine that this new you is 1000x stronger and not bothered, so keep it up, girl!",
            "Sorry this happened to you. Hopefully this door closing will open another perfect one just right for you. Goes to show that you should always go with your gut. It’s normally always right. ",
            "I wish people would erase all of this \"good enough\" language from their vocabulary when it comes to relationships. That's not how it works. They are about compatibility and what the specific person needs in a relationship. There isn't some objective scale and ranking of who would be a good girlfriend/wife/boyfriend/husband. We all want and value different things and it's up to us to try to find them in this life because it isn't guaranteed.",
            "Don't worry too much OP, life has better things in store for you. Take this as life experience. You'll soon find the perfect match and you'll be loved!",
            "Always think of the bright side. This could have also happened after 10 years of marriage and 2 kids, when you were in your 40s.",
            "I feel like a lot of people are always \"searching\" for this exciting fantasy of how a romantic relationship should be. But in reality the person who is going to treat you the best, give you the most freedom, and is stable financially and emotionally...that can look a little \"boring\" when in fact being with that person would've been the best decision of their life. \n\nDon't ever feel bad about the fact that you are a good stable person who didn't need saving. Over my years I have come to value that in a person above all else. He is a fool for not seeing your worth, so he doesn't deserve YOU. Yes I struggle with wondering why wasn't I good enough but I take peace in the fact that the other person is literally a terrible human being cultivating a real shitty life.",
            "When it's meant to be, it's the easiest relationship to be in.  Don't get discouraged, when you find yours, you'll be happy that this BS ended.  Your freedom now is worth soooooo much more than being with someone who's got a foot out the door.",
            "What kinda guy allows for someone to get attached for nothing srsly ",
            "Had a similar situation. My boyfriend at the time was absolutely wonderful and we had a great relationship. A year into it, I moved in. A few months later, this girl that was a friend of the family started coming by once a week for a game night. She flirted hard, and he didn’t set boundaries. We talked about it, he made excuses saying that’s just how she is. A week after our two year anniversary he broke up with me because I had told him I didnt feel comfortable with her in our home and that him not setting boundaries was making me incredibly self conscious and unwanted. Turns out, they’d been going behind my back so when I said I didn’t want her around, I got the boot instead. \n\nIt took me two years to get over him but I know now that we weren’t right for each other and someday I’ll find someone better for me ",
            "Dating these days is hard since everyone is always hung up on their ex. But hey, you hang in there. I hope that one day you will find someone who has actually completely moved on from their ex",
            "I'm really sorry this happened to you OP! \n\nMy ex bf told me he wanted to move in with me and think about marriage. However he was cheating on me the whole time. It was really hard to deal with that.\n\nHowever, from that and my previous relationship woes, have taught me that I needed someone who was a good fit for me. Not someone who would make me feel insecure and not good enough. You deserve someone who makes you feel like gold. Someone who doesn't make you feel insecure or question your worth.\n\nI hope you find that someone!",
            "This sucks OP but you deserve better and just because that time didn't work out doesn't mean it never will.\n\nTake care and try and have some fun in the meantime.",
            "Damn girl, I'm so sorry. I really feel for you. \n\nMy ex of 3 years left me for my college roommate. The process of finding out sent me spiraling. I reached the lowest point in my life and honestly it's been 4 years and I still haven't seriously dated anyone. There have been a few short romances since then but what he did scarred me. I'm incredibly neurotic when it comes to relationships now.\n\nHowever, in my experience I can agree that the right relationship will leave you feeling content, rather than the anxiety that you felt in that situation. I've since learned to trust my gut with those types of things. I'd rather wait a decade as a single woman than to be with a man where I felt that gut feeling for even a day.",
            "I was in a similar situation before. We didn’t go that far to call as boyfriend girlfriend, but for some reason it still hurts me even until now. We were just casual dating and we enjoyed the other’s company a lot, I could tell that. One day he just became a bit distracted but since we were both so busy so honestly I didn’t even notice. He then confessed that his ex (who he broke up like 6 months prior) contacted him and that had been driving him thinking. I just shrugged and said if he felt the need to clear things out with her then do it. He said he appreciated my support. Next day they met and he then texted me saying sorry but they decided to try again. We never met again. I don’t know why but I was really hurt back then, and even now thinking about it. ",
            "The right guy for you is waiting to find you OP! You' deserve better!",
            "Oh god, girl, I am so sorry. I’d be devastated but realize this is a lesson to love yourself. You’re amazing and someone just as amazing is seeking you too. Don’t make that situation mean anything for you. Vow to never settle for a partner that makes you feel like less then",
            "I feel you too, I was with this guy (my first relationship) for a year and a half... and we would stay at each other’s place (I was 17, about to turn 18).. and he was real charming.. and I had depression and sever anxiety, and he would always talk about his other gfs before me.. he was kind of obnoxious after a while, but I thought I loved him. When we broke up, it took a while for me to move on... When he broke up with me, he said “I love you, always will and always have, but I need to move on” At that time, I was like awww he still loves me, it kind of helped me with it. But now, looking back... that was stupid as fuck lol. But, even though it doesnt bother me now, but within 3 months of us breaking up, he was with this other girl who ended up getting pregnant, (idk if it’s his baby but if it is, then he cheated on me)... we did live a state away from each other... I mean I live in Mississippi and he lives in Alabama but we both live on the state line just hours away. (If that makes sense).. but when we were having troubles, I had this friend who I had met online before I got with him, but my friend was much older... at the time, I was 17 and he was 23. I fell hard for him, and continued to talk to him all the time. \n\nFast forward to college in 2015, I met my friend in person at college the first day, we hit it off... fell for each other... and now we have been dating for 3, almost 4 years; engaged for 2 almost 3 years. :D I could not be any happier! I am glad you made it out of that, moved on and are happy! \n\nAt some point we all need to be happy! ",
            "It's scary how I feel this to my core right now. Girl who I was dating broke up with me and immediately moved onto someone else, when i learned that (yesterday) it broke me. Like, was I really such a throwaway to you that you left me just to be with someone else? Getting over a serious relationship is doable but hard ",
            "I waited 2 years for this update, glad i kept hope id get it!",
            "That's a bummer. For what it's worth I know the feeling. There are good people out there who honor commitments and actually mean it when they say they love you and while I never seem to be able to find them, I'm definitely learning it's worth the wait.",
            "People are so predictable :(",
            "Not advice for OP but just want others who are single to read it.\n\nWhen a person says things like what he did \"I'm waiting for her/they are the one that got away.\" please take note.\n\nNo one deserves to be a seat warmer. ",
            "This really sucks for you, and I am so sorry you went through it. \n\nIn honesty, the sign posts were kind of there. He crushed on this girl hard, he constantly talked about her, he asked her out numerous times. And she basically kept him on the line, not reeling him in until she was ready. And he fell for it.\n\nAnyone else was always going to be second best. And this guy is a douche for going running when she called, and she is manipulative for doing this. But I also feel sorry for him, he is a sap in this story. She's clearly using him somewhat, she may want to settle down, but may change her mind again.\n\nAnd you, you're an innocent bystander, collateral damage who deserves much, much better than being someones placeholder/backup.",
            "FEMALE SIXTH SENSE IS REAL I’m so sorry this happened to you. \n\nSimilar thing happened to me where my ex-boyfriend of 3 and half years and I met in Uni and his classmate blatantly liked him (while she had a boyfriend back home), I obviously hated this girl (in general she sucked, his friends from his class weren’t even friends with her) ignored it, was a super cool girlfriend and he was very in love with me so I didn’t care. We broke up and 6 months later he started dating this girl. Sometimes you know but being right isn’t great either. \n\n",
            "[removed]",
            "Turns out not only is Harry not hot shit, be he is also a coward. At least he saved you a bunch of time by breaking up instead of dragging things on.",
            "This may be an unpopular take, but it’s the way I see it.\n\nPeople are responding to this like it’s a ‘cheating’ situation. I don’t think that’s quite right. He simply realized there was someone else he had stronger feelings for. So he did the right thing and broke off his relationship. Cheating would have been if he had continued to see the old crush on the side while he stayed with the new girlfriend.\n\nNo it doesn’t make the pain of the breakup any better. But he didn’t plan for things to go this way. Sometimes these things just happen in life.  You meet someone and suddenly your path seems clear. My mom was engaged to someone else when she met my dad in college. Rather than go behind the fiancés back, she broke it off. It’s a difficult ordeal for everyone, but it’s the right thing to do. She and my dad got married and had a long happy life together. And the other guy moved on too. \n\nYou just never know the twists and turns life will take.",
            "Just read the old story. When I read: '.. he's just waiting for her to say yes..'. its very clear and there is nothing you could have done about it.. \n\nI have a crush on a guy, even though I'm single, I KNOW I would do the same.. \n\nI'm not sure if it's fair he had a relationship with you.",
            "Did he cheat on you because all the comments seem to be situations of I was with my ex and he cheated? It sounded like the guy figured out he liked her and broke up rather than put you in that situation.",
            "The nerve of some pepole. ",
            "Damn, this is exactly why I don’t trust love & commitment no more",
            "Wow, I'm not sure about anyone else, but I'm genuinely disgusted with Harry. I'm sure he's a nice guy and all, but this really means he wasn't a good boyfriend to begin with.\nYou deserve someone who loves you and will pick you. You'll find it, I'm sure of it. Don't ever settle for anything less. ",
            "This sort of undying tenderness can make people do strange things. I was at the receiving end of this. My old crush hugged me after 2 years away, after our reunion with a big group of friends, while she still had a boyfriend. Confused and scared the shit out of me to be honest. I'm still confused emotionally but glad they are still together.",
            "Dang, that seriously sucks. I hope you're doing ok, though! If he was willing to leave for some girl who was always leading him on, that says a lot about his character. I know you described him as a \"catch,\" but those exterior things don't mean anything if he's that much of a coward on the inside. Sounds like you dodged a bullet, whether it feels that way or not",
            "This sucks and im sending positive vibrations your way. Many people wont like this but did you ever think that it was a good idea pursuing him in the first place knowing him and this girl were so linked together?",
            "Wishing you the best. Sometimes you have to learn from experience. The good thing is we can and do learn. I had to learn to focus on the guys who really liked me and who made me feel happy and safe. ",
            "Hey its alright, if its meant to be, its meant to be. You'll definitely find someone better :)",
            "My ex and I dated for two years and guess what, he got married TWO months after we broke up. It was crazy ",
            "You’re amazing and he missed out. His loss. ",
            "My ex was that monkey holding onto the branches of our relationship till he had a secure new branch.\nHe never married her either or settled down she knew she was meddling . So now she's gone off to travel the world and he's stuck behind because of a child he has. So my knowledge is confirmed that uses people till they realise why they are truely there\n\nI met someone who values me and makes me feel safe.\nSecure and now I just get to laugh it off .. because of all that heartache I really truely appreciate and treasure my husband he's the only one I felt truely committed to",
            "Wow. Intuition really is a strong ass sense!! I swear, every time I thought I was just being insecure, the situation was exactly what I feared it was! I found out my bf cheated on me a couple days ago, luckily we were only together for a short time. But I KNEW he was cheating on me! We gotta trust our guts ",
            "I’m glad that you’ve moved on and are okay. Something like this probably really kicks you right in the self esteem. \n\nI hope that HE has grown as a person and knows how wrong it was to treat you in such a way. \n\nYou caught a glimpse of what he is actually like, and frankly, what the other girl is really like as well. They don’t mind hurting people to get what they want, and that says a lot a out their moral characters. \n\nYou’re better off without someone who would treat you like that anyway. You dodged a major bullet and learned an important lesson about your own worth and not settling for someone who would treat you as less than.\n\n\n\n",
            "I am sorry you went through this, I know I'm posting this in hindsight, but your very first few paragraphs it was clear you were just a place holder. The way you even described their relationship prior to yours it seems clear as day, especially now.\n\n&#x200B;\n\nI find things like this help build a better you though, unless you get burned too much. I've also seen that, but keep your head up. Know there will be heartbreak and use this as a way to learn and reflect. I do think you could have done everything right in that relationship, his mind was made years ago. Wish them happiness and find your own.",
            "At the end of the day, you win because you \"lost\" someone who always seen you as second place. Wait for that person who sees you as the girl he wants over anyone else. ",
            "I'm sorry you had to go through this. Your intuition was right and I'm sure it still hurts when you think about it.\n\nThis is *not* a justification, just an explanation: It's always hard to completely forget someone with whom feelings are unresolved, left in limbo. He'd always have a soft spot for her, regardless of what would have happened, and that's not totally unusual. But (him) wondering if she was \"the one that got away\" will ultimately spell doom for any current relationship (the one with you).\n\nYou didn't do anything wrong. That was his choice. Unfortunately, the feelings were too overwhelming for him to deny. It doesn't make it easier to process and I'm sure there's plenty of emotional trauma in the wake of this. He was obviously still in love with her, but it was a dormant affection that he pushed aside and never resolved.\n\nI know this feeling, from his perspective, and it can consume you. I broke up with my, now ex, girlfriend back in September. It wasn't so that I could be with someone else, but my heart *was* stuck on another girl. It's a long story, but basically that connection to the other girl blew up in my face after a miscommunication and a dumb mistake. It wrecked me.\n\nUnrequited love is one of the worst feelings imaginable. Wondering \"what if\" and whether or not it should/could have been something great can eat you alive. It didn't happen and there's a reason: you are meant for something better.",
            "ALWAYS trust your gut. It never steers you wrong. \n\nI'm so sorry you had your heart broken. It's a learning experience. \n\nI know for the better part, you're doing fine. Just be glad you found out about it early on. \n\nNot much consolation, I know, but in these moments let your heart hurt. Get fucking mad, get pissed, get angry. \n\nThe biggest thing we can do for ourselves in healing is to feel. Fucking SUUUUUUUCKS. \n\nBut. You're getting stronger. Wiser. More intuitive. That voice that you suppressed is going to get stronger, and will protect you soon enough. Sending hugs. Xo",
            "life doesn't go the way we plan does it? hope you stay well. ",
            "In your original post, you mentioned that he was a great guy all around. However, I beg to differ. He seems really selfish to do that to you. I would hate myself if I ever did that to my girl. I think he was just using you to fill his needs, whatever his needs at the moment were.",
            "Amazing things can happen when you let enough time pass",
            "thanks for the update <3 you'll find someone out there dont worry c: \\*hugs\\*",
            "I was engaged to a woman who ended up leaving me for some guy she met while we were long distance.  However I had the \"satisfaction\" of her asking if we could get back together when she came back because she realized he wasn't a good person.  I never spoke to her again.  It hurts now, but it will feel good later.  Hang in there. ",
            "So sorry. Glad you are doing better. ",
            "If your gut is telling you something it’s usually right. I was right about the last person I was with and I should have listened to myself and walked away much earlier. ",
            "*sigh* why is this a thing? My fiance broke up with me during Thanksgiving a number of years ago now and I found out a year later that he was engaged again. They got married on my birthday, real charming right? Funny thing is that his mom still asks about me ALL the time, and said to my parents that sometimes you just have to sit back and let your kids make mistakes. Very big mistakes, haha. I feel a bit sorry for his wife tbh, that must be hard.",
            "You don’t need a TLDR for one paragraph.",
            "Maybe shitty, but you weren’t committed to marriage, which is the most important point.\n\nSometimes, someone’s just too important to pass up, and you you love him, you’ve just got to let him go.",
            "Hopefully she breaks up with his ass and hurts him the way he hurt you. A decent guy would avoid seeing a girl he has feelings for just for the sake of his relationship. But then again, people are selish and they would often hurt other to get the things they want.",
            "U win some and you lose some. Aslong as the outcome is income ",
            "That's a horrible thing to happen, sorry you had to experience this. But all things happen so we can learn from them. Do you think you saw any red flags before hand? The fact you were afraid it could happen I think shows you did see something off. ",
            "Sometimes being right is difficult",
            "Well hmm, I'd say look at it this way; it wouldn't have been good for you to have been stuck in a relationship that only goes one way, and you'd have always felt shite... It's better that you move on from him, and find someone new. Yes, you got fucked over, but in the long run, it's better I reckon. Just my two pence.",
            "I m going through same phase but my boyfriend is not leaving me rather than he wants to live with me but also don't wanna leave her ex",
            "You will find someone better. Fuck him, he’s a jerkoff ",
            "My ex of 8 years cheated on me after we moved to another state.  She lives with him now but has been telling me a lot she wants to get back together eventually.  \n\nI'm pretty sure I won't do it because she lied for 4 months and stuff.  I'd be letting if I didn't say im terrified this could happen to me. \n\nI'm sorry it happened to you.  Sometimes it takes a while to heal and we fail into old habits. ",
            "Girl forget bout your mans now. Go get what you deserve. If he doesn’t know how to treat you right find someone who will. This time. Don’t settle. \nTake care. ",
            "It sounds like there was no way you could've prevented this from happening. That's a sign is what they have is true love. Unfortunately , you got caught in the middle of it \n",
            "[deleted]",
            "No, she didn't say he did. I was just commenting on the insecurities part. ",
            "As i said before, this sub is females giving garbage advice about relationships. If you read the original topics,  you can see all the bullshit.",
            "Wow I hope that doesn't happen to me",
            "A lot of good advice in here already so I just want to give you virtual hugs. Remember that you deserve to be loved wholeheartedly OP. ",
            "Hi, guys I'm new to this. Can anyone explain to me what does [27F] and [27M] means? Thanks!",
            "Crush him! You're free, you'll be more than happy.",
            "[deleted]",
            "[deleted]",
            "This whole thing fucking sucks. The hurt is real and I’m sorry you’re going through it. \n\nI had a similar-ish experience, just on a shorter timeframe. Things were going great, but I just couldn’t shake the feeling that I was only the placeholder for the woman he *actually* wanted to be with, who had broken up with him a few months before we got together. I felt like a crazy person to be worried about it and tried to convince myself that he was with *me,* so obviously he was choosing *me,* right? When I finally confronted him about his commitment to me and he just kinda shrugged, I walked away. Four weeks later, he was back with his ex and they were engaged. They’re married now and have two beautiful kids together. \n\nThat pain of feeling like, “well shit, it just seemed like he wasn’t super into the idea of a more committed relationship. Turns out, he just didn’t want it with *me,*” was so, so hurtful. At least my anxiety about the whole situation was validated and I didn’t feel so crazy about worrying, but that didn’t really help me feel any less shitty. It sucks feeling like you weren’t good enough. \n\nThe good news is, that’s a lie. You are absolutely good enough and he was an asshole for getting in a relationship with you without being absolutely upfront about his feelings for someone else. It’s fine that not everybody is right for everyone else, but what’s not okay is when people lead others on or aren’t upfront so others can’t make decisions based on actual information. \n\nLove yourself and find someone who loves you more than anyone else. The pain will pass. I know that doesn’t really help right now, but it will get better eventually. ",
            "well 1st love is always something special :/",
            "You dated and had a good time. He dated and found someone perfect for him. You can't blame him, really. Relationships aren't investments. No trust was broken. This is just how things happen sometimes. ",
            "[deleted]",
            "Sorry to hear that OP, you're better off. So what happened?",
            "There's no true love in this world! Every person loves a materialistic thing more than their partner including you me and everyone else out here. But yes you can find someone that loves you but there's no true love. Remember that! "
        ]
    },
    {
        "post_id": "8vc871",
        "author": "whiskeyteafoxtrot",
        "title": "[UPDATE] Me [32/F] with my husband [39 M] 6-years, our sex life disappeared; he swears he's attracted to me and I'm not sure what to believe or do.",
        "url": "https://www.reddit.com/r/relationships/comments/8vc871/update_me_32f_with_my_husband_39_m_6years_our_sex/",
        "score": 8649,
        "num_comments": 325,
        "created_utc": 1530472095.0,
        "selftext": "[Here is the original post.  It is from over two years ago.](https://www.reddit.com/r/relationships/comments/40tuc7/me_32f_with_my_husband_39_m_6years_our_sex_life/)\n\nI know my original post is so old, but the biggest update only recently happened.  My therapist suggested I post about it here to help sort out how I feel right now and also as a warning to other people.  I feel like I have grown so much in the last few years and maybe I'm a bit less naive (or a bit more bitter... however you'd like to put it).\n\nThrough interacting with the comments, I came up with an ultimatum I would give my husband.  \n\n1.  He needed to get his medical stuff tested.\n\n2.  He see someone psychologically.\n\n3.  Couple's counseling.\n\nI decided ahead of time that he'd have to do the legwork for this already.  I had already done so much legwork for this relationship and I wanted to make sure I didn't hold his hand through this either.\n\nHe took it surprisingly well for what the conversation was.  There were tears on both sides but he agreed that yes, he would be willing to do these things for the sake of the relationship.  \n\nAnd then days passed.  And a week past.  I finally brought it up again and it caused a minor fight where he told me he needed to do this sort of stuff on his own time.\n\nA few more weeks past.  I realized that he did not care enough to do something about this.  It was a hard thing to realize, but it was clear as day.\n\nI headed over a friend's house to talk things out, clear my head, and come up with a plan for divorce.\n\nI drove home and a few minutes before I arrived, he got a phone call that his sister was in a coma and dying.  I booked him tickets to go see her.  She passed away a few hours after he saw her.  \n\nShe left behind two late-teenage girls.  Who we were now partially responsible for.\n\nSo I pushed my pain down and decided to be the best aunt I can to these two girls.  I also got myself a dog (best decision ever in this situation) to keep my own spirits up.\n\nI worked really hard at this and felt like my husband and I were getting closer in the process.\n\nMore recently, I started realizing that everything we were doing for the girls was initiated through me--not him.  So I started paying more attention.  He was getting annoyed at me making a big deal over surprise care packages their school suggested we send in and other things like that.  I was starting to resent that he wasn't caring for his nieces in the same way as I was.\n\nOn the youngest niece's graduation day, I asked him if he thought the other parents there would be getting flowers for the graduates and if that's something we should do.  This is when he totally lost it at me.  It was a string that started with him yelling about how I get too concerned about these sorts of things and ended with a rant about how I buy too many crackers when company comes over for dinner.  This started changing the lens I was looking at him through again.  Also, at this point, I felt like my nieces had launched into the world with lives of their own.\n\nI started re-seeing the eyerolls when I talked.  The cutting remarks about my intelligence.  Oh, and the utter lack of sex.\n\nSo I started talking to people.  I started seeing a therapist.  And together, we all came up with a plan to discuss everything with him--probably ending in divorce (though I never took that as a definite).\n\nI decided we had a different view of what a relationship and marriage should be.  My plan was to present that to him calmly and let him give his opinion of how he sees things.\n\nI had a work trip so I took the time to recoup.  I went on a long hike, and even though I'm not really religious, I prayed the whole damn time about this.\n\nSo when I got home, in the calmest and most even way I could, I explained the situation as I saw it and asked for his feedback.  My friends and I rehearsed what would happen if he cried and begged for a chance to change--or what to do (or rather, where to go) if he got really angry.\n\nBut nothing prepared me for his reaction.  He agreed with me.  He said that everything felt \"forced\" to him and that this wasn't a natural relationship.  That he married me because that was the path he was on, and since he wasn't planning on having kids, it's not like that mattered all that much.  In fact, he prefers being alone generally.\n\nHe then finished by asking if I thought we should get couple's counseling.  I calmly said that given what he just said, I didn't think that was an option.  He immediately started trying to talk next steps, who gets what, etc.  He brought up that he could probably technically fight for alimony but that he wouldn't.  And said he wouldn't fight for my dog if I don't fight to go after his seperate finances.  \n\nI think this was the most painful in the moment reaction I could have had from him.  I told him I would give him some space that night, so I drove to my friend's house and cried my eyes out.  Him not fighting it is ultimately better for the long run, but it's really hard to realize that your husband of 5 years (and partner for 8) never really loved or cared for you.  \n\nI should have listened to my gut all along.\n\nWe had that talk last night.  I'm currently sitting in a coffee shop, typing this all out.  I'm a relatively attractive person and I channeled my frustrations over the last few years into lifting and working out almost every day.  So I'm hopeful when it comes to love in the future.    \n\nI don't really know what my next step is.  I might drive to my brother's.  I might look for a storage facility.  It's a bit overwhelming to think about.\n\nOverall, I'm so grateful this is happening now and that I won't be looking back at my life when I'm 85 years old, disappointed that it never really started.  I have my life in front of me and it's a big scary place.  But after I finish crying my eyes out, it's one step in front of the other.\n\nAnd thank you everyone for all your help.\n\ntl/dr:  Put off divorce due to spouse's sister dying and despite everything we worked on together, found out he never really loved me.",
        "permalink": "/r/relationships/comments/8vc871/update_me_32f_with_my_husband_39_m_6years_our_sex/",
        "comments": [
            "I am so sorry.. \n\nI wanted to come here to say, specifically, thank you so much for being an amazing aunt to those girls. I lost my mom when I was 15 and my aunts were hands-down the biggest blessing during that time. I don’t know if I would have chosen to continue living if it hadn’t been for their support. So thank you for being so incredibly selfless and supportive for your nieces. ",
            "That is an amazing and powerful journey for you to have gone through. That was a roller coaster of emotion just reading.\n\nI haven't gone through your circumstances, but I've lived enough to know that life never comes at you from the angle you expect. It's some new crisis, either emotional or financial or physical. \n\nYou seem like you have a pretty damn good perspective on everything considering what you've gone through. I know it hasn't been easy but you don't seem to be wallowing in self-doubt and blame like many people naturally would. Have you talked to a therapist or anyone to help you along? Sometimes the full impact of what we've gone through in our lives doesn't hit fully for months or even years after, so be ready for a few more rounds in the ol' ring.\n\nAlso, you really deserve an emotionally rewarding relationship. Where you get loved, and hugged and snuggled every day by someone you trust who always has your back. These relationships are real and there are a lot of people who would probably love connecting with you. In fact I bet you're getting creepy PM's even right now!\n\nOtherwise, thanks for the sharing your story and reminding some of us that there are other people out there struggling, but surviving, and reflecting on all of it.",
            "Jesus, I'm so sorry. That is rough. \n\nYou have every right to be upset, but as you mentioned, his willingness should make the splitting process easier for you both. \n\nYou have so much left to love and give, and he seems stunted. He clearly has a lot of personal introspection that he needs to do before he can ever be in a proper relationship. \n\nGood luck to you, you seem strong and smart, you got this. ",
            "Don't assume his current compliance is a good sign for a smooth road ahead. People flip fast when reality sets in and this guy sounds like a cold fish. Calculating and manipulative.  Get a lawyer, protect yourself. ",
            "My heart breaks for you and probably the last thing you want to do is see a lawyer but you need to do this *immediately*.  You might also want to pay for an investigation into his finances.  It sounds to me like he's playing at being benevolent by 'allowing' you to have the dog without a fight, so you don't know what he's got squirreled away.  \n\nGiven the level the deception he's run on you, *trust nothing*.  Verify independently.\n\nI hate to say this but his realization he didn't really want the marriage and never really loved you isn't a recent realization.  This is a lie he's gone along with to have the wife slot filled for his professional and social benefit.  When dealing with this sort of person, you have to be very careful.\n\nGet the *full* picture before you make any big decisions.  Don't sign or agree to *anything* without a lawyer and an investigation of his assets.  Also don't move out of your home until your lawyer says.  Get any joint financials dealt with as per the lawyer's instructions ASAP.\n\nI realize it must be so painful and exhausting to contemplate these things.  Understand, though, that this is how and why so many women end up the worser after their divorce.  With the kind of man your husband seems to be?  It's even more dangerous.  Hand it all off to the lawyer and go low to no contact with your soon to be ex as soon as possible.",
            "Reading this made me cry. I just want to thank you, OP, this might've been very painful for you to write, but it really hit home for me. This is how the story ends when you stay with someone even though your gut just doesn't feel right about it. It makes me feel very grateful for the relationships I've ended with men I loved but who weren't right for me, even though it was very hard. I feel overwhelmed with gratitude not to be tied to those men. Not to be stuck in a house and a marriage with them. \n\nI hope you have a similar sense of happiness now, or soon, to accompany your newfound freedom.",
            "And now you can go forward with a clear vision of what you don't want.\n\n*All the while knowing you did the best for another woman's children.* \n\nA bit off topic but going forward knowing what you ***don't*** want reminded me of a time I met a potential new friend.\n\nI'd recently ended a toxic friendship with a person who ruled every aspect of our friendship. At first I put up with it but as time went on I realized her Queen like behaviour wasn't something I was willing to deal with.\n\nWhen chatting with this new person I noticed traits similar to the person who I no longer wanted in my life.\n\nI'm sure I saved myself a lot of grief due to recognizing what I wasn't willing to accept. \n\nThere's a big difference between baggage and experience. \n\nSounds like he's stuck in the Samsonite category and you are free.",
            "I read your original post. You did everything you could, and you deserve the chance to be truly happy. He is so emotionally lazy for staying on a path towards marriage when he wasn’t invested.  Who fucking does that! \n\nReal love is going to feel so good after this. It does exist. ",
            "I was in a similar situation. We also agreed we were in the wrong spot and I've never been happier.",
            "I'm proud of you, as strange as it might be for me to say this.\n\nMan, you went through so much. I'm just surprised to see how determined and understanding you were through all these things. It speaks much of your character as a person.\n\n I'm about the same age as you but single. I'm not really big on the idea of marriage but, reading this, I couldnt help but realise yet again how important it is to choose your spouse carefully.\n\nYou are still young and now much more mature and stronger. Probably much more so than I am.\n\nI am sure you will find someone who really loves and cares about you in the future and, more importantly, hope you have a wonderful happy life. ",
            "You are stronger than you know.  You will get through this.  I'm so sorry.",
            "Holy cow, I am so sorry you had to endure that.  You seem like a pretty level-headed person and I am confident you will find someone that works better for you.",
            "I went through this exact same situation after a 5 years relationship last year, except that we weren’t married and we were both 27. The conversation that lead to our break up was also crazily similar, with me initiating it with a possible ending in mind and him deceiving me with his lack of interest.\n\nI just want to say that the thing that really helped me heal was to realize that the pain I was feeling when it ended was pure ego. I was sad that he didn’t fight for me, I was sad that he didn’t seem to see me as worth an effort, I was sad that I had wasted my time with him and felt a bit stupid about it, and in a (terrible but true) way, I was sad that I ended up not being the one initiating the break up even though it was what I wanted. The pain was all linked to my ego, not to the actual break up.\n\nOnce I realized and accepted that, I had such a crazy sense of relief, and ended up not really missing him at all. The relationship was dead long before its ending, and as such, didn’t require a lot of mourning. I mainly needed to forgive myself for standing still for too long, and to heal my old good ego that took quite a hit.\n",
            "I too was in a similar situation, except I'm a man. Though we weren't married we bought a house together. One thing I regret the most is not seeking the help of a lawyer to discuss how to handle the situation. I'm a very forgiving person, which meant agreeing to what she wanted. She got my car and worst of all, my dog. I now live in the house and her name is still on the mortgage 3 years later because I can't afford to refinance. \n\nHer mother ended up hitting the dog with her car killing him at the age of 1.5. He was a beagle that I spent thousands on to get and to keep him healthy after he was sick for a time. \n\nIf I could do it over, I would get a lawyer to agree on the owner of the dog. After he died it was like losing my closest friend and I fell into a very deep depression.\n\nYour story shows you're an incredibly strong woman, and you have a lot ahead of you. I found that after going through something like this you have a more refined sense of love, and know when it's real. I wish you the best of luck, and I hope to hear from you again when you've found your way. ",
            "[removed]",
            "Oof. This was me five months ago (including length of relationship). I then discovered there was another woman. You are doing the right things by going to therapy and taking care of yourself. Keep it up! Don't compromise! Rely on your people, and don't forget that WE are also your people, OP",
            "The fact that he brings up the dog would motivate me to give the dog away to a VERY trusted friend, and get all vet records updated to reflect as much until after the divorce. What a horrible threat to make. Divorce doesn't have to be ugly, and that statement is a HUGE red flag.",
            "I’m surprised you’re not more angry to be honest. And I’m not sure I’m buying his smith and sweet behaviour now. Every time he’s promised counselling or improving and hasn’t come through, so I’d just be careful and make sure you get a lawyer to protect yourself. ",
            "Do not let him use your dog as hostage, what a shitty thing to bring up straight away. It sounds like he had always been planning or thinking about this since you guys first discussed it 2 years ago as he already had everything planned out. Lawyer up.",
            "You seem like a warm caring person who just ended up with a total jackass. I am sorry.  You have been through so much.  Here is to a bright future ahead 😂",
            "Just try to remember that this is a good thing, even though it hurts now. I'm a stranger on the internet, but I'm here for you if you need to talk. :( my husband and have kind of been going through this. You'll be okay, eventually.",
            "I feel like the way he approached the finances issue is concerning.  He doesn’t have a 50/50 attitude at all and considering his coldness I think you need to get a brutal lawyer and don’t let him trick you into a crappy settlement.\n\nIt feels like he was kind of trying to scare you by saying he could go for alimony or try to take your dog.  Those aren’t the words of a kind or reasonable man.\n\nI know it’s hard to imagine that you’d have to fight hard on this and sometimes it feels like it might not be worth it to put up a fight, but let the lawyer do the hard stuff for you and make sure this guy doesn’t stomp on your finances as well.",
            ">He brought up that he could probably technically fight for alimony but that he wouldn't. And said he wouldn't fight for my dog if I don't fight to go after his seperate finances.\n\nI'd be careful he doesn't start using the divorce to continue being cruel or one-up you.  Both those statements read as threats, \"don't touch my stuff or I'll stop being 'nice'\".  Maybe hit up /r/legaladvice,  Lundy Bancrofts' 'why does he do that' has stuff about divorces as well I think?  Pdf is online for free.  Cutting remarks about a spouse's intelligence aren't normal and there may have been emotional abuse going on.  Pretty sure there was given how exhausting that dude sounds but I dunno how you'd identify your situation personally.  I like the 'water torturer' excerpt from the Lundy Bancroft books for describing the subtle cruelty and putting it to words.",
            "LOL what alimony does an able bodied man think he's going to get? Go for 50% of everything. He used you to project an image as a married man and gave you only heart ache.",
            "This sucks. Sorry to see you go through that, but I'm glad that you're getting a new beginning. This guy was holding you back.",
            "I'm going through a similar situation with my last relationship, same issues of lack of sex, fights, all building up to that idea that he really didn't love me. Some days it's hard where I think about him and what I wanted us to be, wanting what we could have been if he just actually cared. But even though I want that fantasy dream world I know it will never be, at least not with him. And now that we are no longer together I have the opportunity to let go of those thoughts that I had for him and build myself a new, happier world view. It's a tough path, but I'm finding that it's worth it. These difficulties transform us into stronger people, it's how we grow; At least that's how I like to see it. I hope that everything works out for you. Good luck.",
            "I'm proud of how you cared for your nieces, and I hope you continue to have a good relationship with them. _\\*internet hug\\*_",
            "I'm sure you and your dog have a bright future ahead of you :) ",
            "The thing about the nieces was awesome - you are a really wonderful person.",
            "Get a lawyer for the divorce.  Trust me.\n\nOn the dog thing, animals are treated as property, so what would realistically happen is that you would pay him a couple hundred dollars, and keep the dog.\n\nThe general rule is \"don't take legal advice from the opposition.\"  Most divorce lawyers can do a free consultation.  If not, it's worth every damn penny.",
            "It seems fishy to me that he wanted to keep all the finances separate, and that his initial reaction was to basically threaten you over the dog if you come after \"his\" money. I feel like he is really hiding something. \n\nI would consult an attorney in general and specifically about the dog. If there is a friend who can watch the dog while you iron out the house details and/or find a new place to live, I think that would be wise for the dog's sake. He clearly has no emotional ties to it, and given his anger issues I wouldn't leave the dog alone with him for a second.\n\nI would also go after his money, whatever you're legally entitled to, simply as payment for the atrocious way you were treated during the marriage and the psychological trauma you endured. It's fine to not want to be married, there's no excuse for treating others like crap because of it. ",
            "> Overall, I'm so grateful this is happening now and that I won't be looking back at my life when I'm 85 years old, disappointed that it never really started. I have my life in front of me and it's a big scary place. But after I finish crying my eyes out, it's one step in front of the other.\n\nI’m so proud of you. Chin up, the world is your oyster. I’m sorry you had to go through that but I’m so glad you’re out.",
            "Get a lawyer.  This man has been manipulating you for years. Don't trust another word he says.",
            "It sounds like you were with someone that held little to zero personal responsibility.  I can empathize with someone who is struggling with or confused about their feelings in or outside of a relationship, but I can't understand someone who enters into something as serious as marriage without really being invested in it.\n\nThat's some serious denial or serious commitment to laziness to just go along with the flow that easily.  If he wasn't that invested into you or the marriage, he needed to step up, be honest with himself, his feelings, and you, and get out.  It sounds like this is someone that is emotionally immature.  It also sounds like you were fighting an unwinnable battle, OP.\n\nGood for you for recognizing that you did your part.  I'm sorry it didn't work out but I hope you can have a better future with someone else.",
            ">  He brought up that he could probably technically fight for alimony but  that he wouldn't.  And said he wouldn't fight for my dog if I don't  fight to go after his seperate finances. \n\nThat is super fishy.  It also doesn't really matter because he will have to present those finances to the court anyway.  I also very highly doubt he could get alimony, that is typically for those who have taken a hit to their earning potential for the sake of  their partner (i.e. a stay at home parent now has to struggle to get a job).\n\nI see you're talking to a lawyer soon but I just wanted to join the chorus that what he is saying is super fishy and you should listen to your legal advice instead of playing nice.  If you own a house together, especially!  You don't want to end up house poor or cheated out of your living situation.",
            "You're a young, atractive , mature woman. You gave everything , took responsebilties and made up your mind. I wish you the very best and im quite sure you will have a bright future comming up. \nDont give up , you'll get what you deserve and i know its something good!\nTake care xoxo",
            "You are incredible for taking care of your nieces through all of that. If they’re not thankful yet, someday they will be. ",
            "He's probably gonna do a 360 and beg for forgiveness very, very soon. Don't accept it, move on. Fly your wings and dream of new beginnings ",
            "I am a survivor of divorce from a marriage where I learned he never really loved me and married me \"because that's what people do\" / \"to keep me around\" / \"that's what he thought I wanted\" - all things I didn't know at the time and wished I had. I understand so well the pain you're in now. It really will lessen with time though it will probably take quite awhile. Also, it will probably affect your self-esteem and ability to trust the motives of others. I encourage you to continue counseling all through this process. That and connecting with friends, family, local supports will be critical for you - especially in the next year or two.  \n\n**NB: Get everything in writing regarding the dog. Animals are considered property, so you need legal recourse if he decides to keep / not let you see the dog (happened to me, broke my heart into pieces, and solidified my understanding of what a piece of shit he is).**",
            "Good for you. Seriously - good for you. You had the hard conversation. You faced his indifference. You're making plans. You're still breathing. Putting one foot in front of the other.\n\nI'm 49 and survived a divorce when I was in my early 30's - left with two young kids. There are a lot of folks (men and women) out there who have survived what you're going through - one way or another. It's brutal. Lost love. Plans dashed. Regrets. Fear. Shame even. But this is survivable, of course. Just terrible in the midst where you are now.\n\nHere's one tiny bit of advice I might offer. (in case you're interested!) I learned the hard way that I have a TYPE of man...and I made a few more mistakes in love before I figured this out. I like(d) unavailable men. The charismatic ones who are successful and have a lot going on. They want me, it seems, but they have a hard time making time for giving me the basic time/attention needed to maintain a relationship. I chased them - made it easy. Craved their attention and felt lucky to be the one these dazzlers had picked. In the end - it didn't work, of course. They too wanted someone they had to chase - and there I always was. The men I met who were DEVOTED and LOVELY and AVAILABLE to me? They bored me to tears. One guy sent me a text with a link to a song every morning - something to start my day. I was so uncomfortable. I preferred the guys who I had to chase and hope they'd text me back. Ugh!\n\nThe advice: be sure to try and learn from this experience/relationship. Yup - he was a jerk. But take some time to explore why this relationship (or lack of one) worked for you for so long. Or why you tolerated it. There are insights in there for you - and will make you more successful in future relationships if you can gain some glimpse of what went wrong on your end.\n\nThe good news: I'm 49 and in an AMAZING (5 year) relationship with a man who's older and counts himself lucky to be with me. He's got some of the other qualities I like (successful/driven/charismatic) but maybe because he's older and learned from his earlier relationships - he's very good at taking care of me in return. (and I let him!)\n\nGood luck, you got this!",
            "I would definitely ask for 50% of his finances. Especially since he seems to threaten to take your dog.\n\n\"And said he wouldn't fight for my dog if I don't fight to go after his seperate finances.\"\n",
            "Know that this is all for the best. You're an incredibly strong, caring person and I think it's clear to see that you have a great life ahead of you. Good luck.",
            "Gotta agree with the other commenters here. Get a fucking shark of a lawyer and fight him for all he is worth. Don't let him use the dog to screw you out of what is due to you. He probably doesn't even want the dog but saw it was an easy way to manipulate you. Divorce courts don't care about \"dog custody\" and since he's probably never taken the dog to a vet he'll have trouble arguing it was ever his.\n\nLawyer, lawyer, lawyer! I know you are very hurt and at a low moment for all he has put you through but you can't give up on fighting for what you deserve.\n\nI strongly believe he is currently scheming to screw you over. He is a very manipulative person who does not care about you at all. Treat him accordingly and protect yourself against it",
            "I’m so sorry for what you’re going through, but something tells me this is the start of something awesome, an amazing new chapter in your life. You’ve been through so much and have gained so much wisdom through this that I think it’s going to be really fun and empowering once you finish grieving/going through the tough parts of divorce. :) ",
            "Your life begins now and you are going to be fantastic. I wish you all the luck, love and happiness in the world. ",
            "I'm sorry that you had to go through all of this pain, but I am happy that you are leaving someone who is undeserving of you. Keep doing things for you, as you mentioned. Take care of yourself and continue treating yourself with love and care.",
            "It honestly kinda sounds like he might have aspergers. My ex acted in a similar way in terms of the strange emotional/sexual detachment. ",
            "My heart kind of hurt reading the part where his sister died and you choked down your pain to support the girls. I'm glad you're finally moving on, it's a sorry excuse for a partner when they jump straight to material objects and money but I don't think we can expect anything less from him. You're gonna go on to do wonderful things, whether you're growing as a me or a we I can tell you'll have a great life. ",
            "I appreciate the follow up, because I'm in a sexless relationship and it's so mind boggling trying to figure out why and how big of a problem it is. \n\nDo you look back now and see signs of this to come when you were dating and engaged? If not, maybe he felt really excited to be succeeding in these steps, but once he had what he had gone after, he lost interest.",
            "I am going through a similar situation, and wanted to offer my support. The fact that we know we need to do what is best for us is incredibly liberating. I’m not carrying any of his lies, nor am I taking responsibility for anything he’s done. I’m concerned with me.\n\nMy closest family and friends keep telling me that I am going to be fine. You are also going to be fine. You’ll come out the other side, rid of this weight. It hurts like hell, but, you’ll be okay at the end and in whatever else is to come!\n\nThinking of you, and sending positivity and strength.",
            "Fight for your portion of any finances you contributed to, and if he threatens you with the dog again get one of your friends to go Legally Blonde on his ass.\n\nI'm joking about the last part (...kind of).",
            "Don't you wonder where things go wrong? For some reason in every relationship I get into after a short while my libido just suddenly dies. I still deeply love the women, but I just can't have sex anymore. \n\n I've tried testosterone, had all of my medical tests done, and I'm very comfortable in my sexuality. I've also dated some of the most beautiful women you can imagine. One in particular was probably that one love that comes around once in a lifetime.  It's not fair to them what happens, and it's extremely unfortunate for me. \n\nI think some of us are just meant to be alone. I feel for the guy, and I feel sorry for you, OP. It's hell for you right now, but if he's anything like me there's only pain in his future one way or another. People like us don't get happiness.",
            "Like others I was in a similar relationship.  My ex thought I wasn't \"invested \" enough in the relationship and she was right but it was because everything was so tedious with her. Anyways we finally go to marriage counseling(she demanded that I take the initiative to set this up). The counselor was very neutral, helpful and our first session was great. So, we get into the car and she turns to me and says, \"I didn't realize I had so much to work on.\". \n\nThe next day she tells me she isn't going back to counseling which effectively ends the marriage. \n\nI definitely had my own issues and things to work on. I  always owned up to my faults and apologized and tried to better myself. I realized that my ex wanted to use the counseling to blame everything on me which is extremely immature.  In our relationship she never apologized for anything it was always \"I'm sorry you feel that way\" and I was always at fault for everything. \n\nAnyways, sometimes two people are not compatible even if nothing catastrophic happens in the relationship.   The earlier it ends assuming you aren't going to work on it the better. Count your blessings, learn the lessons about yourself that are important because whatever your ex did or didn't do won't matter in the future when they exit your life. ",
            "My boyfriend’s mother and stepfather are going through almost the exact same thing right now. It’s really rough. Some men just don’t want to own up to anything anymore and they hurt us so much more in the long run. I just pray it doesn’t happen to me as well. ",
            "Would love to hear his perspective. It’s hard reading these posts from one side. It’s interesting to me that you took zero responsibility for the relationship going poorly. I hope everything works out in the end. ",
            "I'm sorry that everything happened this way, but I'm also very hopeful for you. \n",
            "You are so strong. No matter what cutting things he's said about you, I'm floored by your ability to keep moving forward during such tough situations. You deserve so much better than what you've had. Best wishes to you and your nieces. ",
            "I mean the opposite of love isn't hate, it's indifference, and he seems pretty indifferent. This is very clearly the best choice in the long run, and even though it sucks now, it means both of you will be happier going forward. Best of luck to you.",
            "“The opposite of love is not hate, it's indifference...” Elie Wiesel ",
            "          “Him not fighting is ultimately better for the long run”\n\nI was exactly there at the end of a past relationship... I like how you said that. Everyone wants to be fought for and it really hurts when someone who you thought loves you, can so easily walk away. \n\nYou deserve to be loved!",
            "Girl you have the opportunity to have a whole other life!! This is such a blessing. It will be hard to sort out all the feelings but just push through it. You will be so happy you did. We only get one crack at life and it certainly doesn’t last long enough to stay with some jerk who won’t even sleep with you. Enjoy your second chance ♥️♥️",
            "You sound like an amazingly strong and caring person.  Good luck on your journey there’s someone deserving out there if that’s what you want",
            "Always listen to your gut. Sorry about all this o.p, but you'll be a stronger person when it's all over.",
            "I left my partner of 6 years when I was 30.  I was terrified about being single, living alone etc etc but it turned out to be the best time and a really great experience for me.  I met my (now) husband when I was 33 and we just got married.  The relationship is totally different to that with my ex and I am so much happier.\n\nYou have absolutely made the right decision, it is awful to feel alone and unloved in a relationship.",
            "You seem like an amazing and strong person, I wish you the best.",
            "I haven't seen it elsewhere so I'm gonna say it here OP: If you leave the house for a period of time it can be construed as abandoning it in the divorce! Consult a lawyer.",
            "I really feel for you. I was in a similar one-sided marriage, where it felt like all I did was try to figure out the things I could do to change the situation and make it work.  He was verbally and emotionally abusive, which was somehow even more painful in the face of what I felt were sometimes extreme personal sacrifices I was making. I felt like a puppet. I was also very hard on myself bc I told myself on many occasions—after making whatever random change he told me would make things better—that maybe I hadn’t heard him correctly? Maybe I hadn’t changed the right thing? Or done it fast enough, or well enough? Meanwhile, my life had no resemblance of the one I wanted. He was a constant gaslighter, too, who I think genuinely believed the lies he told himself and me. In the end, I left him too. Afterward, I took some time to reflect on why I made the choices I did, in that relationship and in life in general. \n\nI’m dating again now, I finally started the career I put on hold to take care of him (which he resented, ofc), and I’m raising our daughter who will be 4 this month on my own. My life is harder in some ways, but it’s also better because *it’s mine*. I’ll make whatever choices and mistakes I make because it’s what I want, not in order to try to steer the unpredictable chaos in a particular direction, or to please him, which was impossible. I’m also young enough that I feel I have a full life ahead of me, and I feel I’m wiser for what I’ve been through, so it’ll be a good one, filled with more healthy choices. \n\nGood luck to you, and congratulations! I know that may not seem like the appropriate word given how you’re feeling right now, but trust me, it is. You made the hard choice, but also the smart one. I’m sure it hurts, but the pain matters less as time goes on and life fills the distance.",
            "Seriously get the hell away from this soul sucking dude as soon as possible. He sounds insufferable. You're going to find someone who loves you and makes you feel safe. I believe people can find love at any age but seriously you're 32. You could meet someone in a year or two and still have a family if you chose to. It's really hard when you're in the thick of it when the dust settles you're going to feel so free and empowered.  ",
            "I really wish you all the best. You sound like a great person.",
            "The bright side, 32 is super young, you have no kids, you are primed for a fresh start! You seem to have everything together and sound like a catch... Be positive! You are in a great position!",
            "I'm really sorry to hear this. It's such a shame to hear about the lost energy and time you both have from trying to keep things going, both thinking they were doing it for the good of the other.\n\nYou have a level head, im sure things will work out",
            "Did you see any of this as a possibility before you got married?\n\nWere you engaged long? Did you do premarriage counseling? Was there any red flags?",
            "Your posts easily shows your emotional intelligence- I'm sorry your former husband squandered his time with you! Well written, too",
            "Sounds like he has an Avoidant attachment style. \n\nAttached by Amir Levine and Rachel S.F. Heller would be a good book for you to read. ",
            "This resonated very deeply with me. Though the circumstances and the details are different, I think the thing I recognized most was that feeling of despair. Three years ago, I was faced with the same blackhole of unknowing and feeling completely disoriented by life. I continue to struggle to redefine what path my life will take post-divorce but I just want to tell you that things get better. They may get worse first. I hit some really dark times at points. But I am much happier now that I am living a more authentic life. It’s not an easy life but at least it isn’t one where I am sleeping next to someone who hates me (or worse is indifferent) and where I hate and doubt myself. Hang in there. You are a strong person and you are one step closer to finding that person that loves you the way you deserve. ",
            "You will be okay. This is a good thing even though it  hurts now but your pain will lessen and your life will go on I promise. *hugs*",
            "I'm very sorry for what you've been through, but I can tell from reading your post what a strong person you are. Do things that will help heal you right now and make you happy, you absolutely deserve it. I hope one day soon you meet your special someone. Sending lots of hugs your way. ",
            "Ugh I’m so sorry! Major heartbreak! You sound very collected. You’ve thought it out, made plans, and now you’re on a new path. There is happiness out there and how exciting when this is in the past and you’re in knee deep in your new HAPPY life! Also, you sound like an AMAZING aunt. Good something were to happen to me and my kids were cared for by my sibling I HOPE they will be like you:)\nGood luck! ",
            "Thanks for sharing. That is such a shitty situation, but life’s a bit shitty sometimes and I think this is so much better than limping through years ahead. You sound awesome and you’re still young. This could be an amazing new start for you.",
            "I hope you will feel better soon! Keep working out and setting goals. You will do fine, and one day find love! ",
            "I went through this...lack of sex and affection.  It leaves you feeling ‘less than’, but I’m intelligent and make enough $$ and this was years ago, but when I look back I see that I was pretty and desirable.  Or at least I could have been to the right person.  When affection (or love) isn’t returned it leaves your self esteem shattered.  I hope that you don’t have to look back and see this. You sound smart and amazing in the way you dealt with this and I hope you can see how awesome you are right now.  ",
            "good for you, I gave faith you are on the right path. I don't pray ever too, but I found myself praying for you lol",
            "As hard as this is right now, it’s going to be amazing how much happier you are down the line. Everything happens for a reason and you’re going to find someone who is going to love you so much and appreciate you the way you deserve. Like you said, you have grown so much in the last few years so imagine a few years from now! The growth and strength you’ll have will be absolutely amazing. :) ",
            "First of all, hugs to you. Secondly, I want to thank you for sharing. I wasn't around to read your original post, but I'm where you were two years ago. The first part of this post was something I could have written and we are currently at the medical part - me pushing him to get it figured out. \n\nUltimately, I think my SO is like yours. He'd be happier alone. I've already started moving on, preparing for the worst. Your post has helped me even more. \n\nYou'll be okay. I know it's hard right now, but you'll be okay. You already know it's for the best. You deserve someone who loves you and wants to be with you, and you'll get that now. \n\nI'm always here to talk if you need it. I'm a woman in a similar situation, and I know that nothing destroys your soul worst than this sort of thing. ",
            "I'm so sorry about the incredibly painful situation but I wanted you to know that you are incredibly, incredibly beautiful, and brave, and inspiring. You are so strong; you will survive this, and your honesty and willingness to confront uncomfortable truths will mean that any relationships that come your way will be ones that are worthy of you. All my love. ",
            "I just want to spoon feed you brownie batter and sprinkles. This is so hard and so painful, but know that there is hope on the other side and that you have done and are doing the right thing to find your own lasting happiness. Sending love and prayers your way. ",
            "Wow, you’re strong as hell in the face of all that. Sitting here, existentially adrift and your story is absolutely inspiring.\n\nTotally agree - fuck it, you’re young, have a good heart and are attractive. Go find some guy that deserves you. ",
            "I'm so sorry to hear that.  That is terrible.  Something similar happened to me, and as strong as you are I know you will work through it and be better off on the other side.  Stay strong, chin up, and good luck out there.",
            "You've done everything except wait around indefinitely on \"maybe he will change\". Now you can leave with no regrets. That's what chews you up in the end, the regret that you didn't try hard enough. But you have put in the work and can walk away knowing you tried everything. Your mind can rest, time to heal your heart now. ",
            "You’re awesome and strong, keep your head up. A lot of people wouldn’t be able to bring themselves to do that. Keep up the positive attitude and best of luck! ",
            "Oh my god this was so heartbreaking to read. Everything you're feeling is valid, and I think everyone who reads this is right there with you. I hope you get to heal in the coming months, but to be honest reading this from your perspective makes me not worried about you. I think you've got what you need to make your best life out of this situation, and I think while this will never stop being painful, you're well equipped to come out the other side of this. Best of luck, OP.",
            "It sucks. The no fighting back is like the last insulting confirmation. I just went through a similar end, though not nearly as intense. It hurts and it's going to hurt but we deserve better. We deserve to be loved, without having to explain and ask for every little interaction or moment of caring. I'm sorry for your pain, but even when it's hard, and when it hurts, it is over. \n\nYou hurt because you cared. And that makes you a better person than he ever was. Your pain is a marker that you deserve better. I wish you the best.",
            "I’m in a similar state with my recent ex and I just wanted to thank you for writing this. What you wrote really resonated with me—in fact I feel like our exes are like the same person.  He too went off sex and insisted he loved me and was attracted to me etc. But thankfully it’s only been a year for me. \n\nYou have given me more hope for the future. \n\nI hope you find happiness one day because you seem like a goddamned wonderful person. ",
            "I can understand exactly how you feel. Though my relationship was only 2 years and thankfully we never married. But he acted pretty much like your ex. Like you, I had the gut feeling something wasnt right and struggled with it. He would much rather spend all day in bed playing video games and sleep than watch a movie with me or go out to a movie. Anything I was into, he had to pretend to be interested in. Go fig.\n\nThose feelings of losing your self worth is always hard in these kinds of situations, I think. Even harder when you're getting screamed at and called nasty things or being torn down for doing nothing wrong other than wanting to love someone honestly and openly. I had a hard time just dealing with it for mine, you're very strong for doing it as long as you did. Your inner strength is something to definitely commend.\n\nThe fact that you more than happily took care of your nieces shows the world what an amazing soul you are and shame on him for trying to disrespect that! Those girls needed to k ew they weren't alone and thankfully you were there to show them that they weren't. That it was still ok to move forward and learn to be happy. I think you're seriously amazing for that.\n\nSeriously, if he felt like he'd rather be alone, it's always best to just say so, even if it hurts. Lying to keep up a pretense will always be found out. And it makes the betrayal worse.\n\nEven though I'm way happier now, I cant help but to wonder why people do that.. just act like the shattering of another person's spirit is just a-ok. For me, its cuz my ex is a narc who tried to backpedal the second I agreed to ending the farce of a relationship. Why stay in a relationship where you are the only one trying? I think in a way, yours is similar? Maybe he wanted to keep the pretense that his life was peachy so he wouldn't have to be honest or open himself up to whatever his true inner demons are. But his a major twatwaffle for dragging you around this long.\n\nSorry if this is kinda rambly. I really meant to say that I think you're an amazing person and I know that it'll get better for you. You have a beautiful soul and there are people out there that'll see it and be guided to it. Keep your head up girl! You got this!",
            "You should be proud of how you have handled this entire situation for years. You are a strong woman and you have come out of this even stronger (emotionally + physically!) than ever. You have learned so many lessons about yourself and other people that will help you so much moving forward.\n\nYou haven't wasted a minute of your life. You have spent it growing. Please don't have regrets. Please be proud of you. I am so proud of you!",
            "How will you be with the nieces?  Since technically that's his family",
            "Thank you for sharing. You're so strong to care for those two girls. Also, your attitude toward this is so inspiring. Keep it up!",
            "Seriously, im very sorry for you, but it is like u said: better to have happend now than later right?!\n\nI wish u the best and be strong, cuz once he realizes what an amazing woman (from what it appears) he lost, he will come back to you and ask for a second chance.\n\nFind someone who values you and the things you do.",
            "Just wanted to reach out and give a virtual hug. I'm going through roughly the same situation. It gives me hope that you're so strong and optimistic about the furture. Right now I'm putting off making my ex boyfriend (he cheated on me 4 times and I hate him for it) move out, because I'm scared of being alone. You give me hope for myself. ",
            "Brava! Congrats on getting out of a loveless marriage. And when you’re ready, have a bunch of flings. Ride some rando dick and have fun, girl!",
            "Do you wish it had happened sooner? ",
            "A sad but ultimately positive update. I’ve tried to explain for years that dead bedrooms are most often not the “everything else is great” relationships people profess them to be. There’s almost always something lurking just below the surface. \n\nChin up! You got this. You’re still young. Life will soon be better. There is someone out there that will help you complete the life you want to live. Hang in there!\n\nI also want to add something else. My uncle’s first wife was pretty awesome. When they divorced she made it a priority to talk to me about it and remind me that she was always going to consider me family (as she should) and asked me to please visit, call, or anything else whenever I wanted. Her second husband has been just as welcoming to me and others from her first husband’s family. So please reach out to those kids and let them know you love them and want them to stay in touch and share their lives with you. I’m sure they’ll love hearing that. ",
            "Do you think he’ll ever realise ‘the error of his ways’ so to speak? Would he ever reflect on his behaviour and apologise at the very least?",
            "I hope you get well soon. Atleast there's nothing to look back for. And as said, life goes on. You'll find happiness. I pray. ",
            "I’m glad you’ll be able to focus on the love you deserve now. But I’m so sorry you had to go through all of this first. ",
            "I don’t know what to say. My heart goes out to you. You are such a strong, compassionate, brave and inspiring individual and he didn’t deserve you. I’m so sorry. \n\nKeep your friends close and your head up, allow yourself time to grieve and to be angry. Most importantly, be kind to yourself because you did nothing wrong. You are finally free from his negative hold, his belittling remarks and contemptuous behaviour towards you, and that is wonderful. ~~\nNow you can do whatever you want and (re)discover your passions. Life can change quickly if we allow it. \n\n*Don’t let him cause you to doubt yourself*- You sound like a real catch !\n\n\n<3",
            "I’m so sorry to hear you’ve been suffering in such a dysfunctional marriage I’m glad you got away before it got any worse just know this to shall pass and you will find someone who appreciates you and loves you very much.",
            "The world is yours now, take it.",
            "I just wanted to say that he can say now that he never felt X, Y, or Z, but if you felt like those feelings were coming from him at the time, that doesn't mean it was all a lie. He felt it enough to marry you. There was a spark or a new relationship glow, and maybe he put it out by \"forcing it\" too soon to the marriage path. \n\nThe good parts at the beginning were just as real as the shit parts at the end.",
            "For a moment I thought this was u/annoyedwifex posting.  \n  \nSorry about your marriage OP. And to u/annoyedwifex, please look out after yourself and make sure your marriage doesn't get to this stage.",
            "OMG.... you and I are living parallel lives. I am two months in from walking out on my husband and dead bedroom. It took TWO long years of fighting for his affection and attention, and an endless struggle of figuring out how to make him happy. So much stress and fighting, and effort, and trying to solve all the was wrong. And the realizing I was the only one putting any effort into any of it. \nI worked so hard, and worried, and cried, and prayed...and lost myself in the process. I slowly let everything I loved just melt away in order to keep the peace. I stopped seeing friends, I never had anyone over. For the last two years of our relationship, I walked on eggshells every single day trying to figure out what he needed and wanted. \n\n\nAnd then my Dad died. He was the primary caregiver for my Mom who has Alzheimer's. It was such a shock because as a family, my brother and aiayers were expecting my Moms illness to be the worst thing, and then we lost Dad. I'm still reeling from it. I came home from the hospital after seeing his body, and my husband asked if I thought he needed to take time off from work. He asked do I really need him at the wake and funeral....because it would be a day off with pay, and we need the money \". I was DUMBFOUNDED. \n\n\nAnd to make a long story short, yes he worked during the wake, and I was alone thru most of it and the funeral. And we never recovered. It was literally the last nail in the coffin. \n\nIt took a few months, and several brutal arguments, but eventually one day I just walked out.  I parked a bag and slept on my sisters couch for a month. I got a plan together and moved my things out and found a place. In the end, I had a few things, the clothes on my back, a new apartment and $14.00 left. Scary. But I  had to. I couldn't survive it another day.\n\nAnd I sit here now in my new apartment and I'm still shell-shocked. I feel utterly broken. I know I should be happy to be out-and I am, but I am fighting the aftermath. The silence in my house, the loneliness, depression, sadness, regret for even getting married, and fear of a future alone. I am tired, forty pounds overweight, and I feel rudderless. I have no fingernails left to bite. When I pass a mirror. ... I don't recognize myself at all. Not at all. I lost so fucking much to this bad relationship. \n\nBut I try to remind myself that I just reclaimed MY life, and I am just recharging. I am in a state of repair. It won't always be like this. I just need to put time in to heal. I know I should jump right in to fixing me, and not get lazy, and work to get the weight off ....but I feel so exhausted. \n\nAnyway, I just need to say thank you. Thanks for making me feel less alone in this. You will make it thru to the other side and put all of this behind you. ",
            "What’s happening with the nieces?",
            "Glad you are finally leaving--your soon-to-be-ex is a horrible person! It's kind of shocking how selfish and dishonest he has been this whole time. ",
            "Oh thank you for sharing this. Perhaps he did love you, or does, yet, as no real way to show you or he just plain doesn't. The most important part of this all is you. Be Love. You are love. \n\nTwo whole healthy people make one healthy team. Without you there's no team. Without him no partnership. Self care is so flipping important. \n\nI'll leave you with the best advice I've heard lately. Treat yourself the way you need to be treated. And *become* and just be the person *you need* in a partnership. Single or not in your future. Then you know you've done the best you possibly can in taking care of you. Am in the middle of the situation myself, and understand deeply.\n\nMay you be joy. May you be love. May you be peace. May you have compassion for others and completion in compassion for all, in the self compassion you have for you! Success and happiness, dear one! 💜",
            "Though my situation wasn’t exactly the same, I too was married for 8 years to a man that I realized never loved me. It was one of the most painful experiences I’ve had to go through. Like you I had given that relationship my all and he made it clear that nothing I did was ever good enough.  When the breakup happened he was downright giddy while he gathered his things. I felt humiliated that I thought he would have fought to keep us together.  That an impending breakup would trigger the changes he always promise but never made.  The reality was a new girlfriend for him and single motherhood for me. \n\nDivorce sucks but mine gave me an opportunity to create a new, more fulfilling life centered around my needs. I hope you do the same. You deserve someone who appreciates you and I wish you the best. ",
            "Your husband loved you during your marriage, whether it be consistently or at random moments, but he loved you. We have a way of changing our memories of a person based off of how we feel at the time (the mood could have been caused by another person or even some sort of internal happiness struggle). Him saying he married you simply because it was the right life path at the time sounds like a cop out. He is hurt, but has decided apathy, emotional numbness, and distance to be his best coping mechanisms at this time. Reflect on your marriage and I bet you can find times you two are happy. You were right for each other at the time, but you two simply grew in two separate directions. This is an opportunity to foster even more growth as an aunt which will give you more confidence to grow in other areas of your life. Many blessings to you!",
            "I’m way late to the post - but you got this. I’m also 32 and starting over from a relationship where once it was over, I realized her never really loved me either. It fucking sucks, but he didn’t fight it, and I’m glad he didn’t because I would have caved and gone back. \n\nYou’re going to find someone who loves you (and wants sex!) and it’s all going to work out. Keep on keepin’ on. ",
            "I am sending you so many hugs. All the hugs. I just want you to know that you are strong and capable and that you will get through this all. ",
            "He lied to you in the past months/years, doesn’t mean he lied to you ever since you met. He doesn’t love you now, doesn’t mean he never loved you. That’s the painful part about relationship. They change. They’re not always the same. The feelings just disappear after some time. You have a rough road ahead of you but you sound like a strong person. I wish you all the best.",
            "What a sad tale. I hope you and others learn not to waste your time in dysfunctional relatiinships from your story. Good luck for the future.",
            "Shit like this is why I'm not wasting my life away by getting married, screw that.",
            "[deleted]",
            "I wish you the best in the next chapter of your life :)",
            "This sounds like a sitcom. Two years of dead bedroom 😳",
            "This happened to me too. For the last (and only the second) year of our marriage, there was no sex. I killed my self jumping through hoops, trying everything I could think of to be attractive to him. None of it mattered because I found out after our divorce that he’d been having an affair with a coworker. Even when I was pregnant with our son. \n\nI would have stayed with him. Now I’m glad he left me for her. Even though it hurt like hell. It still does sometimes but it’s honestly manageable compared to the pain of being in that relationship and driving myself insane wondering why I wasn’t good enough. \n\nHim and the coworker got married and had a baby. They are still together and very happy. It’s much harder when children are involved because we have to coparent but I put on my big girl pants because my son comes first. ",
            "My heart breaks for you ... you need to sort things out with him ",
            "Does he have multiple personalities?",
            "Thank you so much for sharing your heartbreaking story. I'm confident you will come out of this a stronger person, because it sounds like you already are. \n\nMy own personal mantra that has served me well throughout my life is \"don't waste time on people who won't waste time on you.\" Time is the most valuable thing anyone has, and people will either try to steal it, waste it or hopefully add value to your time. I really truly realized this after I almost died a few years back.  \n\nThere will never be a \"good time\" to do anything in life, just when you decide to or not. May you find solace in your life moving forward. \n\n&#x200B;",
            "I honestly think for tales like this, is why marriage is just not right into todays society with greater freedoms. You're negative gut feeling and lack of sex, or general lack of you not getting what you want, should persuade you quicker to seek what you do want instead. Furthermore who will give you that, and it clearly wasn't this guy for a long time. However, marriage (and obviously his sisters passing) halted you doing that, but I feel you should have made the decision a lot earlier, but the notion of marriage makes people suffer unhappiness for longer. \n\nI think in longer term people should consistently evaluate is this working for each other? I am currently in an open relationship for a year or so after being together with my girlfriend for 7.5 years, and this is just one example that ensures you get what you want in life yet having your rock of each other in the relationship. Totally won't work for everyone, but just giving one example how your individuality in life never is superceded by a relationship or marriage in my opinion. Of course there will be attempts to compromise and there should be, but if you conclude you're missing something, just losing it is going to result in unhappiness long term and an unsuccessful relationship.\n\n&#x200B;\n\nYou come across as a tremendously caring person and thoughtful, and you've kept in shape as you say!! There will be a truck load of people wanting to share that with you, and you deserve to have that. I think you have highlighted an interesting broader issue however that marriage really feels outdated in today's society, and a more fluid dynamic really is the way forward. Seek happiness, don't overdo compromise in your own life, it will result in a negative lifestyle for both.\n\n&#x200B;\n\nGood luck in your future :)",
            "You are young and you will recover. Your story is traumatic, so stay in therapy for a while. Put a lot of thought into your fresh start, and although it doesn't feel like it now; this may be a blessing. As far as the financial stuff listen to your lawyer. When he said he could ask for alimony makes me  think he hiding something. Maybe a some distance from him after the divorce will lessen the grieving process. In future relationships talk; get to know thier hopes, dreams, and life stories. This is important; no commitments until you see how he interacts with his family; you can tell a lot by a mother son relationship. I wish you a Hallmark channel ending. ",
            "Such an inspiring story to get your life to where you want it to be :)... Highly recommend tinder 🔥",
            "Well, I applaud your thoroughness in your efforts to fix your marriage. Now you won't have to wonder if you did everything you could. Ultimately, one thing out of all that you said stands out to me, \"I should have listened to my gut all along.\" From your conversation, it's clear that you are very consious and emotionally aware, but you had hung a partition to block your sight when it came to your husband. I know how easy it is to do that since we make certain determinations about our other half and they become like the basic laws and foundation for how we see them and predict their reactions or responses. You revealed that when you said you saw him through a different lense also. I don't know what you look like, but if your post is any fair indication about your personality and traits, you certainly possess a great many of the most attractive, such as, loyalty, objectivity, careful consideration for others, compassion that exceeds your own need to receive, you like dogs+, you seem diplomatic in your approach to problem solving, but probably put yourself last too often for the sake of others. So basically, you sound like a Libra to me. Not because I am a Libra as much as I recognizdle the behaviors from personal experience being me. Soo, moving right along now, I think you have handled the situation well and step by step is how you proceed until you find you have been in full stride and everything\nelse is behind you on the path. The great news is that if you are only 32, then you are prime and have time to attract plenty of attention. I don't think you will have many issues with that so long as you make yourself seen and dont hide yourself away. ",
            "I am so sorry this all happened to you. You are so young and sound level-headed with a lot to give. I know you will find happiness one day.\n\nIf I may ask, what happened to your husband's nieces? How old are they? ",
            "You’re so strong for having made ot out on the other side. You gave your everything to a man who wasted it, please don’t feel scared to give your next partner as much love - just make sure your needs are met before you dive in. Do your best to see the eyerolls for what they are; don’t grant manipulation the benefit of the doubt. You’ll learn from this, and you’ll grow stronger for it. \n\nAlso. Your ex is HIGHLY manipulative. The comment about your dog was a thinly veiled threat. He’s trying to put the thought in your head that he COULD take your dog and that he COULD take your money - he’s warning you in order to make you agree with his demands. Get on that shit immediately. Consult a lawyer and never take your ex’s word for anything. \n\nBest of luck. You’ll do amazing without him. ",
            "I was in a 3 year relationship and I ended up still being attracted to her but I just didn't feel like it and thought I just had low sex-drive, but after the relationship ended, I found out I had really low testosterone. I had been angry, stressed, un-horny, unhappy, and most of all, very emotionally flat as a result. \n\nNow things with every girl I've dated since have been a lot more fuck-y.  Especially it he's taking any medications for a long time, just google meds he's taking to see if they could cause low-t.  When I got my low t fixed, I felt great, like myself again with a full personality, vs. being easily stressed, agitated, not into sex, and emotionally flat.  \n\nIf you don't want to be with him, obviously you should move on, but you might suggest to him to get tested from a health-perspective. ",
            "Damn, I mean there were times I stopped having sex with my ex s/o but I definitely knew I love her, I guess it's different at times ",
            "After reading your original post, I can see your husband didn’t really love you. He had as much affection for you as a set of golf clubs or a new dishwasher. No passion. No sex on your honeymoon? Not trying to please you? The list goes on...\n\nAny man that is in love will try. This guy was just checking a box on the to-do list. He lied about his feelings because he didn’t want to be alone, and now he doesn’t care one way or the other.\n\nI’m sorry for the OP. Thank God you didn’t have kids with him. You can move forward and find real love. As for alimony, if anybody deserves to pay the asshole tax, it’s him. ",
            "Is your husband an Aquarius ?",
            "This sounds a lot like what I'm going through right now. I'm holding on (trying to) until our baby is 18. He's almost 5. 😞 I admire your strength, through everything. Good luck to you. ",
            "The divorce will be good for both of you.  You both held each other back. ",
            "he sounds like a narcissist, look up NPD, educate yourself. It will help,",
            "My question is are you still hot? You would know best. Do you feel your attractive? "
        ]
    },
    {
        "post_id": "96zhur",
        "author": "None",
        "title": "UPDATE: recently found out that I (17M) got into my brother's (19M) former dream university which he did not get accepted to last year, feeling guilty about really wanting to go now",
        "url": "https://www.reddit.com/r/relationships/comments/96zhur/update_recently_found_out_that_i_17m_got_into_my/",
        "score": 8560,
        "num_comments": 148,
        "created_utc": 1534175901.0,
        "selftext": "Update to my [previous post](https://www.reddit.com/r/relationships/comments/95s4ri/recently_found_out_that_i_17m_got_into_my/)\n\nOn Saturday I was able to speak to my brother and tell him that I got into the university. He was really happy for me, like a lot of people said he would be. When I told him I got in he gave me a huge hug and was really excited. It was such a huge relief. \n\nHe asked me if it was my top choice, since he didn't know I had applied. I told him it was and he said that we have to celebrate then. He told me I didnt seem excited enough and I should be really proud of myself, and he asked if it was the shock of just finding out. \n\nWhen I told him I find out a few days ago and he was the only one that knew he asked me whats going on, because I wasnt reacting to the great news like it was great news. I admitted that I worried about telling him because I didnt want him to be mad. \n\nWe talked about it and he basically said what everyone in the comments said, that he's proud of me and happy for me. I mentioned that I got into a different program than his and my requirements were lower, and he told me to not downplay my success and to stop worrying about him being mad because he wasn't. He told me that when I told out parents he wanted me to be more confident and proud of myself, because I did something great. \n\n Yesterday while we were hanging out at his buddy's house he told me I should tell them the news, when I didnt want to because I hate talking about myself he asked if could tell them, which I told him was OK. they were all happy for me too. Honestly, he's reaction was better than I even hoped for, but looking back I should have expected it from him because that's always been the type of brother he is.\n\nTL;DR told my brother I got into the university and he incredibly supportive and happy for me. He told me not limit my success to make other people more comfortable, and that he was proud of me (which meant a lot to hear).",
        "permalink": "/r/relationships/comments/96zhur/update_recently_found_out_that_i_17m_got_into_my/",
        "comments": [
            "Your brother sounds amazing! Congrats on getting into your top choice!!",
            "You and your brother sound wonderful, I hope you can always rely on each other like this.\n\nCongratulations on getting into the university of your choice.  :)",
            "Your brother is awesome and so are you! Congratulations 😊",
            "You have an awesome brother. Kudos to him for being great about it and congratulations on getting into your first choice!!",
            "Your brother sounds so wonderful and supportive, it's so nice to see that you are both so concerned for each other.  As someone who ended up settling for a school other than my dream school, you definitely come to accept your choice and make the most of it.  And when the option of transferring came up later, I realized it wasn't worth the hassle when I had found a perfectly good, if not better program, and it sounds like your brother has similarly accepted his program.  \n\nBest of luck to the both of you, I hope your semesters go well!",
            "Your bro sounds like a real bro.\n\nr/brothersbeingbros",
            " You guys have a really healthy relationship. Congratulations.\n\nHe has a really healthy relationship with himself. He is able to celebrate other people's success; when others are successful, it doesn't effect his self-esteem, ego, self-worth, feeling of safety in the world, etc.\n\nYou deserve to love yourself a little better. If he HAD gotten mad, I hope you still would have gone to that college. Because you WILL come across people who don't like that you're more successful. And that will be an issue they have with themselves. The kind of person you're afraid your brother might have been? Hopefully that person will develop a better relationship with success. It's not a reason for you to live a lesser life.",
            "My older sister got accepted into a prestegious university far from home, but my parents would have none of it. When my turn came, she stopped at nothing to let them let me do the same, and off I went on a plane.\n\nSeveral years later now, my sister occasionally voices her bitterness and resentments. She only does this when she goes through a hard time herself though, so even though she makes me feel entitled and miserable in the moment, it tells me that her actions then were driven by immense love—if not for me, then at least for what she deeply believes is right.",
            "Glad it all worked out! ",
            "Congratulations!! You're brother is so sweet to be so supportive! Good luck with your schooling!!!",
            "This... great example of communication and a great family dynamic! You and your brother are one hell of a team!",
            "Just like a good sibling should react, you have a great brother there.  And you're just as great for having empathy for your brother.  Your parents raised you two right.",
            "CONGRATS!!!!\n\nLet your brother know that university and college aren't necessarily career makers or breakers. It's who you know in the field you want to work in that's likely most important for your future jobs.  I went to a community college and now I'm sitting next to NYU and Yale graduates at my work station. \nGood luck to the both of you. ",
            "OP, one of my younger sisters is going to be a doctor and is currently working for the government doing research on something really cool. I would have loved to do similar to what she’s doing, but she is smarter and more driven and this path is very much right for her. I would never feel upset towards her for her success- I am insanely proud of her and it makes me happy to see her kick ass. I can’t speak for all older siblings, but many of us just want to see our siblings succeed and be happy, even if they achieve things we can’t or won’t. Don’t worry so much- I think it was very sweet of you to consider your brother’s feelings, but if he loves you he won’t want you to give up your dreams to spare his feelings.",
            "He sounds like a great brother –– I'm glad you talked to him, and congrats on getting into your number one school! He's right, you should feel very proud :)",
            "I’m almost tearing up! You have a great brother and I’m sure he’s proud of you. Do great things!",
            "I'm literally tearing up. Congratulations! To both of you. ",
            "So happy for you!! I'm glad you talked to your brother and that he was supportive!! This post makes me feel proud of you for getting in the school too. Wishing you the best! 💛",
            "You have a great brother and you two clearly have a good relationship. Don't forget that! Glad it went well.",
            "Wasn't planning on crying all over my breakfast, but here we are. ",
            "This made me tear up. I’m glad how it all turned out for you! Congratulations!",
            "1) You should go to this uni.\n\n2) Good for your brother for doing the right thing here and being supportive.",
            "Congratulations on getting into your top university AND for having an amazing brother !",
            "You shouldn’t feel guilty about success unless you obtain it by harming others.  It’ll often be the case that someone before you failed at what you attempted.  This time you happened to know one of those people.  Nothing wrong with it, it just means he has a different story.\n\nI am glad this worked out for you.",
            "My brother did the same thing and, more than anything, I'm proud of him",
            "That’s awesome! Congrats!!",
            "He's a good brother and so are you. Congrats on getting into University! It sounds like your brother is one of, if not your best advocate, don't forget that! That type of relationship can be rare, especially with siblings. Don't ever let that go man, seriously.\n\nCheers bud",
            "Don't ever let guilt hold you back from success ",
            "He knows he ended up where he needed to be, and is happy you got to go to a school you were really excited about! No reason to worry about him, he’s not even thinking about where he applied to school last year, I bet. Enjoy this moment :)",
            "This is so lovely! Congratulations on getting into the university of your dreams & on having an awesome brother :) ",
            "I'm so choked up - this update was great! Your brother is the person who was with you from the beginning and will journey with you all your life. You've lucked into a terrific one. Love and appreciate him! Signed, a loving Sister.",
            "If he gets married, tell this story at his wedding.",
            "Your brother is great.\n\nI just wanted to share my story because it's similar. My sister is 7 years older than me and went to law school. I am currently in law school right now. When I was applying, I got into her dream school within a few days of submitting my app. The school gave me an almost full scholarship to go but it was honestly my safety school. I felt bad telling my sister because it was a school she had wanted to go to so badly. \n\nMy sister, like your brother, was so supportive of me. She never once questioned my decision and she was never jealous or upset. She only ever wanted the best for me and was probably happier than anyone else, including myself, when I transferred to a very high-ranking law school this past month. \n\nCongratulations on getting accepted at the school! And your brother is right. Don't downplay your success. Great things are coming. :)",
            "Stupid pregnancy hormones have me bawling like a baby right now. And I didn't even see the previous post about it. This is exactly what an older brother should be. ",
            "Cool. Plus what really matters is the college (degree program at the University) rather than the university itself. Congratulations and get started early, meet friends, volunteer time to worthy causes, study, and have fun. \n\nThese are your formative years in which you will probably never have such little responsibility again, take advantage of that. ",
            "Congrats! Good on your brother for being understanding. When I applied to grad school, a close friend, who is also a coworker, applied with me. One morning I received a text that my u oversight email account and Web ID was set ... which means I’m enrolled. My friend texted me shortly after and said she got a letter of denial from the university in the mail. She ask if I heard anything about my application. I wanted so bad to tell her not yet but it was inevitable that she would know eventually. So I told her and she said “you are in then. I’m happy for you.” It made me feel bad but it is what it is. She never made good grades or did well with research papers and those were two of the main criteria. She convinced herself it was something unrelated to academics so I just listened to her. She’s great at her job and a good person. \n\nThankfully, she did get into an online program elsewhere a couple years later. ",
            "Baby bro, wait until you all hit the job market. You find out in life that brothers can't be jealous about schools, careers, or relationships. Opportunities just kinda happen by chance; it's how well you use the chances you get.\n\nOh, but you do have to invite him over for a party weekend (if you both like to go). It's The Code.",
            "You're a good brother! Good luck at University!\n\nFun side story: since my brother and I are twins we decided not to apply to each other's top school choices",
            "Congratulations! I'm so glad that he's proud of you and I really truly believe that he is.\n\nI totally understand where you were coming from and your concerns were justified, so it's nice to see that other people can surprise you sometimes.\n\nI was in a similar situation when I found out I was pregnant. My best friend of almost 20 years has been trying for a REALLY long time and has never been successful and we got it on our first try. I was PETRIFIED to tell her, but she couldn't have been more pleased. She thanked me for my concern and felt bad that I was hesitant to tell her at all as she couldn't have been more happy for us.\n\nThe good ones will always be on your side. x",
            "GOD DAMMIT WHO’S CUTTING ONIONS.",
            "What an incredible older brother. I'm in awe! You're so fortunate and blessed to have him ",
            " Sounds like you have a great bro. Go on and make the most of the college, savour every last drop! I wish you and your family the best in life ",
            "3675 votes say you have an awesome brother!",
            "Your brother is awesome! ",
            "You may not see this, but I have a younger brother, 9 years younger, and he is my pride and joy. I haven’t been the best role model, or example because I fell into a dark web of lifestyle, but God knows I’m fucking proud of my brother for being responsible and caring. He is what I failed to do along the road, not saying I won’t get back to it, but he is the image of a person who I envisioned myself to be. I didn’t go to college, I went to a trade school because I wanted to be a blue collar worker, but that kid, that fucking kid makes me proud and happy when he succeeds, even if he succeeds where I have failed. Your brother loves you deeply dude, and I don’t think you understand how deep, you guys are young, but trust me, you really and genuinely make him happy when you succeed.",
            "Your brother is a good dude, OP",
            "No reason to feel guilty. You earned it. ",
            "Ahh, such a lovely update! Made me smile :) good luck at your university, and I hope you and your brother always maintain your awesome relationship",
            "Aw this is great, congratulations OP",
            "Your bro is a total bro.",
            "you got your own choice, your brother know that's all good for u. Congrat !",
            "you and your brother are awesome! good luck in the future, you'll kill it in college!",
            "Aww you're brother is a good lad. I'm happy for both of you.\n\nAnd have fun at uni, OP! Enjoy every second of it, even the bad times. It's all a learning experience!",
            "Hey it's great that you are achieving your dreams and that your brother is supportive, but he should know that he can apply as a transfer student (in most cases) and that it is substantially easier on average than applying as a high school senior. Food for thought. ",
            "Your brother sounds like a good guy!\n\n\n",
            "I love how the only issue he had with you getting into his dream school is why you didn’t seem to be happy about it, he sounds like a great brother, and so do you. I’m glad this worked out so well for you guys.",
            "This is such a sweet reaction! Your brother sounds like an awesome person! \n\nAnd congratulations to you!!! ",
            "You've got a good brother...and so does he. This was a nice story to read :)",
            "You're brother loves just and wants whatever is best for you. You're very lucky and so is he!",
            "Wow your brother sounds awesome. What a great relationship you guys have. It’s excellent to have a support network like that! ",
            "Sounds like you have an awesome brother and a great relationship with him :)",
            "This makes me miss my little brother so much :) Honestly OP, O'm the eldest of 3 kids and if one of them had gotten into my Uni of choice (even if I didn't), I would be over the moon-in-tears so happy for them. I'm sure that all he feels is pride for you. He sounds really amazing and you two seem to have a really great relationship. \n\nPS. Congrats on your top choice school! ",
            "Sounds like you have a great brother! Congratulations. You'll do great at university! ",
            "[deleted]",
            "[removed]",
            "I got over not getting into my top schools when I went to a good school anyways, made friends, fit in and had a lot of fun. I'm sure your brother is well over it. Just celebrate it. ",
            "Hell ya! Brothers are there for you - great job!!",
            "This makes me so incredibly happy! Now he can come party with you at the university 👍🏻",
            "Your brother sounds awesome. You sound awesome. You're lucky to have such a great relationship.",
            "You should go and make him proud become valedictorian and give a speech on his honor",
            "/r/happy may enjoy a cross post of this.  As it's a pretty happy thing.",
            "This update made me tear up! I'm so glad you have such a great, supportive brother. I didn't get to have a lot of the opportunities my little sister had but I encouraged her to pursue all of it. I always wanted to go to an out of town university and study abroad, and was so happy that she got to experience the things I never got to do. I'll never feel resentful or jealous because I love her and want her to have everything she wants. As for me, I'm happy with how my life turned out and worked hard to earn my own success. Sounds like your brother is too. :) Congrats and enjoy it!",
            "Your brother is a fucking champion. It definitely stings more than a little for him, but good on him for caring more about you than his own pride.\n\nAnd congrats on the acceptance, OP. Good luck to you.",
            "Awesome update! Congrats to you! :)",
            "Don't feel guilty. You earned it, played your cards right and everything lined up.\n\nYou shouldn't feel badly and he shouldn't be jealous (at least in a bad way).\n\nIt'll be all good, be excited, love it, enjoy it and share your success with friends and family alike. ",
            "I didn’t get a chance to read this originally and was prepared to tell you to pursue it if it’s where you want to go.. but after telling your brother.. listen.\n\nYou have an amazing sibling. It’s not as common as you might think. It makes my heart glow knowing he’s genuinely excited and proud of you, the way I am of my younger sister, who is currently pursuing her PhD in physics. Congratulations and best of luck to you!",
            "My little sister is 15 months younger than me and she definitely got the share of the brains in the family which I have never been jealous or annoyed about. There have been things I've wanted out of life that she has got and I'm nothing other than happy for her because all I want is for her to be happy and have a promising life. If she has that it's one less thing for me to worry about and I can get by knowing that she'll be all right. I am so incredibly proud of her. I love her so much and if she's happy it makes it easier for me to be happy. I'm sure your brother feels the same.",
            "One day I aspire to be able to have a relationship like your brother has with you with my own brother. We fight a lot. But our fights are usually physical and last around 2 minutes until we are cool again.",
            "You being successful takes nothing away from his own personal journey towards success. Your brother believes in abundance and you should too. There is room for success for everyone, just at different times and in different ways. Don't ever let yourself feel bad for something you worked hard for man! ",
            ">not to limit my success to make other people more comfortable\n\nThese are words to learn and live by! Remember this! He is right. Don't limit your success just to please other people!! (as long as you play fair and not hurt other people like breaking someone's knee to win an ice skating competition). I'm happy for you!! Go, you!",
            "I saved this post because it’s the wholesome feel-good vibes are bursting through and made me so happy. Thanks for the update!",
            "Sounds like a great bro! Really happy for you",
            "I teared up reading this. You two clearly look out for each other and that's so amazing.\n\nCongratulations!",
            "Your update made me cry a little. What’s wrong with me? Haha \n\nYour brother sounds amazing. I agree with him on not downplaying your success. You earned your place at that university. Clearly, you had teacher who saw your potential too. Be proud of what you’ve accomplished and best of luck in your studies!!!",
            "Just read your first post tonight and looked at your post history for this exact update... I'm so happy for you! And your brother is awesome! ",
            "Your brother sounds awesome. Congrats on getting into your dream university! What're you going to be studying?",
            "You have an awesome big brother. Your parents are blessed to have you both. ",
            "Your brother is a talented hypeman",
            "I love your brother. You hit the jackpot with him. Him with you. \nHe’s mature beyond his years & you’ll never have to question his love & support for you.\n\nCongrats!! Now feel the happiness!",
            "Congrats! This makes me so happy. From my own experience my little sister is my best friend, and it’s weird but her success makes me even happier than my own success! ",
            "Being a little brother means you get to do things your older brother didn’t. Part of it is how your parents prepare you differently and part of it is having an older role model. He helped you get there, so don’t throw away your chance!",
            "That's really cute that you were worried about how he would feel. He's your big brother, why wouldn't he be happy for you",
            "yesterday was my first day in college and i have mixed fellings about it i dont know anybody but everyone sees nice but i have fear that i dont get alone whit anyone....",
            "I was going to say, as an older brother, he should definitely be happy and proud of you! Something similar happened with my younger brother and I as well. Just think of it this way, 'at least one of us made it!'",
            "What university is this?",
            "What university is this?",
            "I know you’ve figured it out now but just to add one more thing, as long as your brother is happy with where he’s at it shouldn’t be an issue. I was rejected by my dream school but am very happy with the school I chose. I wouldn’t be jealous or anything if my brother went to my dream school.",
            "Is this what it’s like to have a supportive family? Just... wow. Talk about a bro. \n\nEnjoy your success and have an amazing experience at First Choice U!",
            "\"I mentioned that I got into a different program than his and my requirements were lower, and he told me to not downplay my success and to stop worrying about him being mad because he wasn't. He told me that when I told out parents he wanted me to be more confident and proud of myself, because I did something great\"\n\n\nBest. Brother. Ever",
            "well don't know what your relationship is with your brother,  but as the \noldest of 7, i can tell you that I'm extremely proud of my brother getting into a university i never could. ",
            "I was in the same boat, but my brother applied to transfer as well and didn’t get in for a second time. I felt awful for going, but he knows it was the right choice for me and I worked hard for it. But I’m still not sure he’ll forgive me, so I’m really glad your brother had such a positive reaction. ",
            "Don't feel bad, it's your opportunity to go. As you do fine with your grades and establish a network, it can also possibly give a nudge towards your brother's admittance to the college down the road if he decides to transfer. \n\nSounds like you both are already onto your way to a road of success and have a good sibling relationship. This is a good brother, and am glad he is supportive of his brother/sister. \n\n",
            "Yeah. You shouldn’t feel bad. Even if he wasn’t happy for you you shouldn’t feel bad. It’s the type of thing where any other reaction other than feeling happy for you and celebrating is probably the wrong reaction and selfish. If he was jealous of you getting in your reaction should be “I feel bad for you. You’re my brother you are supposed to be happy for me. It disappoints me that you are not.” But he is so no worries. "
        ]
    },
    {
        "post_id": "9mv737",
        "author": "bfsbestfriendex",
        "title": "Update: My [25f] boyfriend [26m] of 10 months is best friends with his ex [20s?f]. She refuses to meet me and it's getting weird",
        "url": "https://www.reddit.com/r/relationships/comments/9mv737/update_my_25f_boyfriend_26m_of_10_months_is_best/",
        "score": 8561,
        "num_comments": 210,
        "created_utc": 1539135492.0,
        "selftext": "Link to OP: https://www.reddit.com/r/relationships/comments/6mql7n/my_25f_boyfriend_26m_of_10_months_is_best_friends/\n\n\nI wrote my previous post over a year ago, and a lot has happened since then. I wanted to give everyone an update, since the advice on this sub was really helpful at the time.\n\n\n\nFor a few months after I wrote my OP, nothing much happened. Jeff and I continued dating, and he continued being friends/partners with Jenna. I never met her, but everything else in our relationship seemed to be going so well that I decided I'd try to deal with it.\n\n\n\nThings got really hard, however, when I had to take a work contract 12 hours away from home for three months. I hardly saw Jeff the whole time, and I looked at Jenna's instagram almost every day to see if she'd posted more photos of them together. More often than not, she had. Since I wasn't physically present, I felt like Jenna was his real girlfriend. I felt completely worthless and constantly stressed out, knowing my boyfriend was spending all his time with another woman who I already had suspicions about.\n\n\n\nWhile I was away for work, I decided to break up with Jeff. I broke up with as soon as I came back, and I made it very clear that his relationship with Jenna was intolerable for me. I told him he was going to have a hard time dating anyone who wasn't her as long as she was still in his life. He kept saying he didn't understand why it was such a problem. He told me he couldn't control her behaviour, but he promised me he hadn't cheated on me. I explained to him that by allowing their friendship to continue, he was condoning her behaviour. I told him I didn't really even care if he'd physically cheated or not, since he'd already shown disrespect for me and our relationship. \n\n\n\n\n\nI didn't speak to him for a few months and I went on with my life. I took another contract out of town and even considered moving permanently to another city. One night, though, Jeff called me and apologized. He said he had been thinking about our relationship a lot and realized he had been in the wrong. He said his relationship with Jenna was beginning to feel toxic to him, and he'd made arrangements to dissolve their business partnership. After that, I decided to meet up with him (not necessarily give him another chance) and discuss the situation further. When we met up, he promised to stop talking to Jenna and unfollowed her on all social media.\n\n\n\n\nAs of now, he has not spoken to her in six months, and we've gotten back together. We actually ran into her at a concert a few weeks ago, and they didn't even say hi to each other. I feel much more respected and confident in my relationship now.\n\n\n\n\n\n\n\n\n\nTLDR: I broke up with my boyfriend. He ended his friendship/partnership with his ex and we have gotten back together.",
        "permalink": "/r/relationships/comments/9mv737/update_my_25f_boyfriend_26m_of_10_months_is_best/",
        "comments": [
            "Hey OP, not to stir the pot, but it really sounds like your boyfriend was dating Jenna and they broke up. ",
            "Can't believe you never ended up meeting her! I'd be very curious to hear her side of things...",
            "Wow. Good for both of you that the communication ended up working and you're happy together now. Congrats and hope it works out.",
            "[deleted]",
            "I would have only dated your ex on the condition that you had a long talk with Jenna without Jeff knowing. This whole situation reeks of infidelity and I would be  more determined to find the truth than to just accept 2nd place after 1rst dropped out.",
            "Sounds like they broke up and he got back with you. I wouldn’t want her scraps. He didn’t even fight for you the first break up. ",
            "Good on you for standing up to your needs! \nSeems a bit odd to me that they went from being so close to being so cold with each other in such a short period of time but maybe he truly understood that he needed to cut her out of his life in order to have you. Wish you all the best :)",
            "So, he only ended their friendship because it was no longer working for him, not because he realized he was wrong, but because of her behavior towards him. Her behavior didn't matter, when it only affected you. ",
            "yeah they were definitely banging the whole time ",
            "Tread carefully. You're his #2 pick.",
            "Glad to hear there’s a happy ending. It definitely seemed like Jenna was trying to push you out of the picture, so I’m glad your bf came to his senses and she didn’t succeed long-term. ",
            "Eh... I’m glad you broke up with him. I’m puzzled that you got back together. That would be a no from me- too many unanswered questions, too much anxiety and insecurity, too much history of poor prioritization. He cut Jenna off but what if they start wanting to be friends again? What if he makes a new odd friendship? For your sake, I hope he really has changed, because Jenna was never the problem here- it was Jeff. Jeff and his poor boundaries. ",
            "It sounds like she broke up with him. ",
            "This happened to me before. I wish I had the strength to lay down the rules and walk away before getting hurt in the end ",
            "Yeah something happened there outside of his explanation of “I woke up and saw the light hallelujah!” Sounds like he used whatever happened to tear them apart as an excuse to get you to take him back. Likely  less to do with his adoration for you so much as his desire to not be alone.... likely. ",
            "It’d have been fine if he originally put your wants and needs above those of Jenna but it sounded like he was always catering to her. Glad that breaking up with him helped him see how toxic it all was and you’re doing well now. Honestly if she was afraid to even run into you she had feelings for him for sure. ",
            "[deleted]",
            "what happened on the camping trip? ",
            "I honestly thought Jenna was going to be a made-up person.",
            "Jenna definitely still has feelings",
            "Same thing happened to me a few years ago. When we first got together he had a bestfriend that was needy and jealous. She even sent me a few messages saying that even if I was his girlfriend I wasn't going to take him away from her, that he was her everything and that he is always going to put her first.. To be honest at first I didn't care that he had a female best friend that he spends time with but after getting those messages I told him to sort his priorities out and that I wasn't gonna deal with this childish behaviour. He cut all contact with her and haven't heard from her till 2 years ago when I saw her at a meeting at work. Turns out she got hired in the same company I work at and we even had to spend 3 months at the same location everyday. At first it was awkward but it got better. She is now married and I am engaged to the same person so that is far behind us. Good for you for standing for yourself.",
            "I really admire your maturity and self-care in this situation, and I'm glad he came around. \n\nIt's not easy standing your ground and letting go of a relationship with someone you care about. You didn't resort to ultimatums, you let him make his own decisions, and helped both of you along the way. Good for you!",
            "I'm actually really surprised to hear you got back together, but I guess the distance (and the fact you legitimately broke up with him, not just \"take a break\") gave him the space to grow up and take another look at his behaviour. Best wishes for you both!",
            "He fucked her during that break, causing the awkwardness between them",
            "Some people just learn the hard way, but at least he learned :) ",
            "I'm torn between watching \"Mrs. Doubtfire,\" and \"Fatal Attraction,\" after reading the OP and this update.",
            "He was cheating on you. He'll never admit it but he was. You took him back after he decided maybe you were better. I hope things go well for you but trust will always be an issue. Love is a beautiful thing. But I dont believe its something you have to work extremely hard for. It's not a coal mine you are digging. ",
            "He was refusing to see it from anyone else's perspective until you two stopped dating!",
            "> He told me he couldn't control her behaviour, \n\nBogus. He can control *his* behavior and break up with his work-wife. He can stop making you be the one to accommodate her. He can say, \"Jenna, I'm stopping by with OP to grab something,\" and then stop by instead of walking you around for half an hour. It's called setting boundaries. He didn't have to dissolve the business to do it, although the business might have dissolved as a result. It's all in the past now, but I don't think he really learned how to set boundaries, just how to avoid the necessity.",
            "It sounds like she broke up with him...it’d be hard for me not to confront her myself. Especially since you have her instagram. But hopefully your relationship continues to be strong. More power to you, I would’ve noped outta there as soon as I found out how close he was with a supposedly “ex girlfriend”",
            "Are you sure Jeff wasn’t in love with Jenna the whole time?",
            "I’d be very wary of your boyfriend. It sounds like he was fooling around behind your back. I would have just kept the relationship broken up.",
            "I remember the original post! Thanks for the update. I'm glad things worked out. ",
            "Wow. Girl I don’t even know you and I’m proud of you. You did the right thing, that took some backbone to stick with it too. I hope that it works out for the best. ",
            "[removed]",
            "Did she have Blink 182 lyrics tattooed on the left side of her chest and arm tattoos? Sounds like a Jenna I used to know that would cause this kind of problem for people. ",
            "I wouldn't want to be somebody's second choice.",
            "Man, this sounds eerily similar to what my husband and I went through when we first started dating. I'm glad it worked out better for you two than it did for my husband and I. I didn't break up with him, and the other woman when psycho on us both over her jealousy and \"ownership\" of my (then boyfriend) husband.",
            "I dont tell my girl who she cant hang out with, but exes? Nah bro. Not for me. Thats old business man. ",
            "Well that’s good I guess but, on the other hand, if they were just really good friends, you kind of destroyed their friendship....",
            "> I told him I didn't really even care if he'd physically cheated or not, since he'd already shown disrespect for me and our relationship. \n\nI am SO glad you said this to him. IT IS SO IMPORTANT.  Cheating is not the only things that ruins relationships. in fact, it’s really only symptomatic of an underlying disrespect. ",
            "Bc she doesn’t want to admit you are real. Or compare herself to you. It might be immature, but I totally get it. ",
            "I have two view points, one is I can see where your coming from, on the same note if he told you to stop talking to a guy pal of yours, that would be seen as controlling.",
            "Why I cut my ex out I don't want to be hanging around when their in a new relationship.",
            "That's good news. You were right to walk away from that relationship. I'm friends with a number of my exes, but I would never put an ex above my partner. And if my partner put another woman's needs ahead of mine, I'd have to walk. \n\nWhen you have healthy boundaries and healthy self-respect, you get treated better. Not because you're forcing people to do what you want, but because you're limiting their ability to hurt or mistreat you. I'm glad he saw his error and that things are going well between you. Congratulations!",
            "You are one strong human being! I commend you for putting yourself over your relationship when you knew what you deserved!",
            "I wish my BF was this mature about it, I went through the exact thing but had the not so nice outcome of cheating and stuff. Sucked balls. I'm in a better place now though :) Good for you! Wish you guys the best together.",
            "Great job!!! I’m struggling with this. My ex wants to be friends, but if his first date goes well tomorrow, I don’t want her to think I’m anything more than an acquaintance. My ex gets upset when I want to reduce our friendship. But I can’t stand for anyone to think I would do anything to harm another person. \n\n\nI’m happy to see that things worked out for you. And I’m happy to see he realized Jenna was toxic. Congratulations and may you always be happy! ",
            "Wow. You’re such a solid human being. MAJOR props!!",
            "I tried to work with an ex my boyfriend gave a hard NO. Which took me by surprise given the fact our relationship was open at the time, we trusted each other. I worked with plenty of guys before for long personal hours.\n\n",
            "I'm so glad it worked out! He sounds like a nice guy who was involved in a toxic friendship. Sometimes it seems like he was in the wrong (by condoning her behavior), but when you're friends with someone and working with them, it can be hard to not let the things they do slide. I think your break up and your comment on how he'll never be able to date anyone really opened his eyes and that's why he dropped the friendship and won you back. I hope your relationship is a great one!",
            "im so glad to hear everything went well. some people just need to face consequences to realise how hurt the other person is. i wish you to all the best.",
            "It’s weird that she didn’t want to meet you, but it also seems extreme to me that you would break up with him over it and it’s also weird that he would dump his so-called best friend so quickly. I would worry that if I asked my partner to stop seeing their best friend, that my partner would resent me for it in the long run.",
            "[removed]",
            "I’m so happy for this update! Your boyfriend sounds like a good dude and I’m glad you gave it some time before trying a relationship again ",
            "Way to go!! Jenna really seemed to have an odd relationship with him. ",
            "Am really happy to hear that things went the right way after you made your rock hard decision. ",
            "[removed]",
            "Congrats! \n\nI'm sorry but is you bf really named Jeff..?\n\nHis name is.. Jeff..? \n\n^^sorry..\n\nE: /s",
            "[removed]",
            "Glad to hear it worked out for you :) ",
            "I’m glad it worked out!",
            "Amazing. So happy for you both. ",
            "Great!! Hope both are in a good relationship right now. I'm confused with a guy in my office. He proposed and I said no. As I saw him only as a friend. Now its time for him to leave from my office. I'm a bit confused. Should I say yes or no?"
        ]
    },
    {
        "post_id": "a3zvze",
        "author": "oceanbrrreeze",
        "title": "UPDATE: My [24] boyfriend [25] of 3 and 1/2 years hasnt proposed and I'm starting to worry. I just want that promise.",
        "url": "https://www.reddit.com/r/relationships/comments/a3zvze/update_my_24_boyfriend_25_of_3_and_12_years_hasnt/",
        "score": 8127,
        "num_comments": 295,
        "created_utc": 1544189494.0,
        "selftext": "The original link is [here](https://www.reddit.com/r/relationships/comments/50ihkx/my_24_boyfriend_25_of_3_and_12_years_hasnt/?utm_source=reddit-android)\n\nI wanted to give an update on this post I wrote about 2 years ago. I got some great advice, I got a lot of tough love advice and some terrible advice. I know he was already committed by all of his actions and that I really needed to focus on college first before having to plan a wedding. \n\nWell, it turned out my boyfriend at the time had been planning on proposing to me for a long time. He wanted to wait until I graduated college. A little after I graduated college, he took me on a hike. I knew this was a special hike because it was the same place we went for one of our earlier dates. \n\nThe first time we went on that date was magical. I always teased him that he never kissed me on the date. There was this perfect moment he was holding me in front of a beautiful picturesque lake as we were just enjoying each other's company in an embrace. I thought he was going to kiss me but he didn't. \n\nI later kissed him first but always teased him that he didn't kiss me in that moment we had. He confessed he wasn't sure if I wanted to be kissed. He said he wanted to kiss me more than anything. \n\nWell he took me back on the hike 4 years later, and when we got to that lake, he told me this is when he knew he was first in love with me. Then he got on one knee and proposed to me. I just kissed him and even forgot to say yes! So he asked, \"Are you going to marry me or not?\" And I said of course. We got married about a year later and we just celebrated our one year anniversary in October. \n\nI've never been happier and I'm so excited to continue our life together! \n\nThank you for reading 😁\n\nEdit: Grammar on TL DR\n\nEdit: Wow! I did not expect this post to blow up like it did! Thank you all for the incredibly kind words. I'm sorry I can't respond to everyone but thank you. I'm glad I could brighten so many people's day! You all brightened mine :)\n\nTL;DR UPDATE: My [24] boyfriend [25] of 3 and 1/2 years hadn't proposed and I was starting to worry. This is a two year update that my boyfriend at the time was planning on proposing all along. We have now been married for one year. I am so happy everything worked out the way it did. ",
        "permalink": "/r/relationships/comments/a3zvze/update_my_24_boyfriend_25_of_3_and_12_years_hasnt/",
        "comments": [
            "Hey this is cool! A long term update. Congratulations, I hope yall have a long happy life together!",
            "When you said \"my boyfriend at the time\" my heart dropped. Great update and super glad you got it together and relaxed into your love and relationship!",
            "Congratulations! What a lovely proposal. ",
            "A positive \"it all worked out great\" update?!?!  We need more of this on this sub!   Take my upvote!\n\nAlso - remember this!   If something bothers you and you don't like what he is doing, don't assume he's working against you.  DO try to communicate your wants/needs to him.   Marriage isn't always the fairy tale people think it should be, it's work.  But it's one of the most rewarding jobs out there when you do it right!  Congrats!",
            "Congratulations! I’m in basically the same position you were in but I’ve been with my boyfriend for 7 years now! I think it’s all about not comparing yourself to anyone else’s timelines and doing what feels right for your relationship. I do understand where you were coming from before though! ",
            "See? He stuck to the original plan you both agreed on. Congrats!",
            "> He wasn’t sure if I wanted to be kissed\n\nThis is so wonderful. People respecting other people’s consent and boundaries makes me so happy. He’s definitely a keeper.\n\nCongratulations, I wish you a lifetime of happiness!",
            "[removed]",
            "\nCongrats to you, but I would also like to remind all the people out there waiting for their partner to propose, because they think it's now time that a proposal should come already in the relationship .... *YOU* can do the proposing.\n\n",
            "Congrats OP, I am so happy for you. I am in the position you were in now, and I am struggling hard. He hasn't given me a definite timeline. ",
            "[deleted]",
            "What in the actual fuck. Idk if it’s growing up in a city in New England or what but 3 1/2 years at 24 and wanting a ring like that. YIKES. ",
            "What a great update! Congratulations and thank you for sharing a heartwarming story.",
            "Nothing bad ever happens when people don't get married and just are together. It seems like an insecure move.",
            "I’m sure I’ll be downvoted for this but..Sorry, I’m just not understanding why you’re upset... you’re very young and you were just legal drinking age when you started dating him. 3 and .5 years also isn’t very long..I think you should consider why you “need the promise”. If you’re this concerned about a “seal” at this stage then it likely means you’re not ready. ",
            "\\> I just kissed him and even forgot to say yes! \n\nI forgot to say yes, too lol. I don't know if I ever saw your first post or not, but I was very similar - except I was 29 and my friends were starting to have babies, much less engaged or married... we had been together 5 years and we had talked about it a lot, but it was never the 'right time'!! Our anniversary is October too, just celebrated 3 years :-). My now-husband proposed at the top of my favorite lighthouse and I totally forgot to say yes, I just hugged him and cried and kissed him over and over. Patience and not comparing your life to anyone else's is key - you're on no one else's timetable but your own, it's not a race. You and I both had to learn that lesson, and we're better off for it. I wish you a strong and bright future together!",
            "[deleted]",
            "> and some terrible advice.\n\nFrom Reddit?!?!? I'm shocked. You must have read it wrong. :)",
            "Uh, I think it’s really strange you were promised a proposal at all. I think you guys were young and I agree with all the comments from the original post. \n\nSeems kind of manipulative to get all upset about not getting married like you’re trying really hard to trap him. \n\nI think if you’re so worried about marriage that you think your relationship won’t work without it you’re too immature to be in a relationship in the first place. And I don’t think the marriage will last.",
            "Great story! Congrats",
            "Nice to see a positive post on this thread.  Congrats to you two and your life together.  May there be many more hikes.",
            "My (now husband) waited almost five years to propose to me. He was doing prerequisites and then had three years of grad school.\n\nBut he had told me after a couple of years that he would propose after he graduated. And then he surprised me by proposing a few months before graduation.",
            "Been with my boyfriend gor 8 years and still hasn’t proposed but we are growing strong and everything is good :) don’t worry so much :)",
            "I'm very happy for you both of course, but by anyones standards expecting a marriage proposal in your early 20s after 3 years is quite a lot to ask.\n\nAgain, very happy for you, and i wish you both all the best for the future.",
            "Your original post made my eyes roll so hard and this update is even worse! ",
            "Honestly marriage doesn't always mean a promise. Look at all the failed marriages. Marriage is nothing but a trap. You can be deeply in love with one another and spend the rest of your life together without getting married.",
            "I'm saving this story 😂 it's posts like these that give r/relationships the little good side of life :) happy anniversary!",
            "It’s always so refreshing to hear these updates on this sub. Congrats! <333",
            "That's lovely. It's made me smile and I'm an old cynic. Congrats to you both and your husband sounds like a really lovely man. Lucky you.",
            "I love this update!! Made my day.",
            "Wonderful! Congratulations!",
            "This is so heartwarming, I love updates like these! Congrats OP!!!",
            "Oh my gosh, this is absolutely beautiful! You sound so in love and happy, and it sounds like your husband is a truly upstanding character. Congratulations to you both! And thanks for sharing your happiness, you've brightened my day!",
            "I’ve been together with my partner 9 years, we haven’t even considered marriage until we have lived together first ",
            "How heartwarming!! Glad you didn’t listen to the cynics years ago.",
            "A true, lasting relationship would AND should work without marriage.\n\nIf it takes a ring, a proposal, and legal papers to give you a sense of stability to your relationship; then maybe you are you in denial?",
            "Reddit is quick to jump on the break up boat. I asked reddit for advice because we were coming up on 10 years without a proposal (we started dating when I was 13) and they told me to drop my boyfriend like a hot potato. I even reassured that we have no issue and have stated over and over that we are life partners to each other. 9/10 comments told me to break up. I ended up approaching my partner and saying it was time. He didn't see how getting married changes anything for us and didn't want to plan/have a wedding. We ended up going on a 3 week elopement to Japan instead of having a wedding and got our papers signed during a small family celebration brunch on our 10 year dating anniversary. We even had a custom sapphire engagement ring made. It is amazing what you can afford to do if you don't have to budget for a big wedding.",
            "Congrats, but scary. 3 1/2 years isnt very long to make a decision that will affect the next 60+ years to come.\n\nWhy not just be content with what you got and not try to pressure anything?\n\nAnyways, im glad everything worked out for you so far, i just hope he didnt do anything out of pressure on your part. That would scare the hell out of me, hopefully it didnt for him.\n\nWish you both the best!",
            "10 years and strong with my gf, no proposal yet! No idea what's taking her so long :D. We both don't feel rushed at all to get married, it feels like an unnecessary expense and if we just alope both our families will be more pissed. Congrats to you guys though!",
            "I’m I tears.  Brought back memories of when my husband proposed.  It was the day after Valentine’s Day, my prof had assigned an exam, so I was studying my ass off on Valentine’s Day evening.  He was crestfallen his gift for me hadn’t shipped in time, so instead, took me on a hiking trail, also reminiscent of one of the first dates we’d been on.  Goodness that man can act.  We get to the top of the mountain trail, no one is there, and he gets on one knee.  \nWe’re 10 years strong right now.  I’m so flipping happy for you and yours!",
            "WOW this is awesome! Congratulations OP! All the best for your future! ",
            "Always nice to see a wholesome update!",
            "all tht worry for nothing, got a good guy there",
            "“I know he was committed by all of his actions...”\nCan you elaborate on this?",
            "Congratulations. May God bless you and your family with happiness and good fortune",
            "Beautiful! I had to read the old story first, then this. \n\nI’m so belatedly happy for you!\n\n",
            "oh my gosh, congrats to the two of y'all <3",
            "> boyfriend at the time\n\nI sighed and thought the post was going to end very differently. Great update, good for you guys!",
            "I love happy updates!!!! Congratulations!",
            "This is so wholesome.",
            "Had the same exact story, to the point that he didn’t kiss me on the first date. He messaged me that night and said he made two mistakes that night, he forgot his doggy bag and he didn’t kiss me when he had a chance. \nI was neurotic about being engaged, I knew it was coming but had no control when! He did completely surprise me when he did it before going to dinner with friends!\nWe’re getting married in 37 days. I’m so glad you found happiness and were patient waiting for your happily ever after. ",
            "Awwww this made me smile,  it’s nice to see positive shit on here from time to time  ☺️☺️ I’m happy things worked out for you! ",
            "Congratulations! Reading your story makes me feel for my girlfriend who I know has been waiting three years for me to propose even though we've talked about marriage and family and the longer it's gone, the more extravagant I feel like I need to make it. But your husband has made it clear it's about the feeling in the moment, not how complicated it has to be. Anyway, thanks for sharing and making me a little less stressed about it (while not losing that urgency for her sake)",
            "I am still waiting for a girl to come and propose to me. Nevertheless, it's not going to happen, haha. ",
            "My uncle has been with his girlfriend for 10 years are just having a baby and still not married.",
            "I took 6 years to propose to my girlfriend ",
            "i really really needed to see this. when i read the original post i had to do a double-take to make sure i didn’t write it in my sleep. i am in that EXACT boat and it was so relieving to read the update. it makes me a little more inclined to bite my tongue, stop panicking, and believe that he means what he says when he promises that the ring and the marriage are all going to happen. THANK YOU. ",
            "I didn't propose for 10 years lol",
            "Thanks for such a sweet update. /r/relationships needs this now more than ever in times of such events like a man's wife requesting he shit in her mouth.",
            "Why don't you ask him?",
            "Wait till he's at least 30 you impatient fool. Otherwise ..\n \"Happy future divorce\"",
            "Man, I've been with my SO for 7 years and he's not anywhere close to proposing lol ",
            "[removed]",
            "This is just about the most romantic thing I've ever heard. He sounds wonderful.  :)",
            "Aw thanks for the happy update, they seem so rare here.",
            "I’m so happy it worked out for you! That proposal sounds adorable!\n\nJust had a peek at your OG thread - I think people were a little harsh, tbh. There’s nothing wrong with having a desired timeline for engagement and marriage and communicating those desires to your partner in a respectful way, especially after you’ve been together more than 2 years and are cohabiting :) ",
            "Awe i love updates!!!!!! So happy for you!",
            "My wife and I were together for nearly 5 years before we were married lol",
            "As someone who’s been waiting for 6.5 years and is in their late 20’s now, I’m glad you didn’t end up in my situation.",
            "[deleted]",
            "And here I am... still waiting. Been 3 years hahah.",
            "Congrats!! I also forgot to say yes. I just kept nodding and he and his family were just waiting. ",
            "Congratulations!!!   \n\nI am so happy to read a good conclusion.  ",
            "Congrats! That's really sweet and romantic! ",
            "Yay! That's wonderful.",
            "Heres my better question. Did you dump your friends because damn girl.",
            "I have been dating my gf for 5 years. We have talked about marriage a lot. But I said we still have things to work in before we are married communication is a big one. And her anger management is another ",
            "Happy it all worked out! ",
            "I love happy updates like this! All the best to you and your husband. I hope you have many wonderful years together. ",
            "So sweet. Congratulations :)",
            "This makes my heart happy!",
            "Congratulations!!! So sweet ❤️ ",
            "Congrats to you both!! I hadn’t read your original post until just now, but even as I read it I was thinking “oh I know what this update is gunna say, this dude is obviously already planning a proposal on a later date and can’t come up with an excuse.”\nSo happy for you!",
            "This made me smile ear to ear!",
            "These are the updates we need. ",
            "I love happy endings, especially real life ones! And that is such an awesome way to propose, too. Congrats!",
            "Yay! I love it! Congratulations!!!",
            "Congratulations. Your story really brightened my day. I hope you have a very long and very happy life together.",
            "Read the post and could tell he was lowkey planning it. Boyfriend does the same thing, just with gifts.\n\nCongrats! I'm very happy for you two! 😊",
            "This is pretty adorable :) yay op!",
            "i’m fucking crying omg ",
            "Just want to say congratulations on the wedding.  Also, want to say to both of you, don't think that now you are married, that the work into the relationship is over.  Keep working at it, expect change to happen and be open to accepting it.  You both doing this, will really help keep things going strong between you, for a long time.",
            "Awww, I love a happy ending! Congratulations!",
            "So cuuuute! Congrats! ",
            "When’s the next episode? Another 2 years?",
            "This makes me so so so incredibly happy. This gives me so much hope. Our stories sound identical! Congratulations! ",
            "Congratulations! Your update made me a little teary. My best wishes to you two ❤️",
            "I was in a similar situation. My fiance didn't wanna propose until he could get us our own place.. we moved out and he proposed 3 months later. ",
            "Congrats!  There aren't enough happy endings in here sometimes and I'm just happy for you two ",
            "Thank you...there should be an update requirement. I have trauma with all the a unupdated stories here\n\nIm still sad about a guy in an insanely destructive relationship never answering anybody and deleting his post in the end.\nWas the \"not allowed to orgasm within sight of his gf\" guy\n\n",
            "Wow! This is so beautiful! ",
            "Super glad for you guys! I wish nothing but luck and happiness for your relationship :)\n\n",
            "Now I’m starting to think that I should worry! I’m almost 25, boyfriend is almost 29.. we have been living together for 3 1/2 years and have been together for 4 1/2.. should I be worried? He keeps saying he’s waiting until he gets his career going. :/",
            "I love it! When my husband proposed I forgot to say yes. I sort of nodded lol. Happy for you 🙂",
            "This is so sweet who’s cutting onions tho",
            "I’m glad everything worked out! Best of luck.",
            "We see alot of crappy stories on Reddit and even crappier replies. It's nice to see something heading down the right path. Congratulations! We hope you have a happy life. Don't stop doing what drew both of you together in the first place. This is coming from a happily married man of 25+ years. You can have as much happiness 25 years later as you do right now.",
            "[removed]",
            "[deleted]",
            "OK. I'm a dude and this just made me tear up a bit. Congratulations.",
            "Glad everything turned out well - I had to wait six years before my former fiancé proposed. Some people just need to do it on their own time, proposals can’t be rushed.",
            "Omg I feel for your 2 years ago self. It's not easy sometimes. I just celebrated 3 years with my BF and it's hard sometimes. I *want* that greater commitment. But we talk about marriage/wedding all the time and we make sure we know we're each other's family. And about six months ago he finally started saying \"our\" cat (I got her 3 months before he moved in). \n\nI'm so so glad it turned out well for you! What he did was absolutely adorable!",
            "In a world of Tinder and quick fixes, this is pretty heartwarming, OP.",
            "This is super encouraging because I’m in the exact same boat (3.5 years and everything!) and I’m hoping that he just has some greater plan in mind. ",
            "Wait but what was the advice?",
            "I didn’t really resonate with the urgency to want to be engaged in your early 20s until I read what you wrote about wanting your parents to be grandparents so badly. I feel that, mine are aging too and life is just so unpredictable. If you know then you know, if you don’t want to wait, then don’t wait. I hope you have the family you dream of and that your parents get to be grandparents! ",
            "You are graduating soon, time to get a job and pull your weight financially, after that he can see a better financial picture of your future together. Shower him with gifts and your time just like he does, be his equal ASAP. This should help quiet your insecurities for sometime.\n\nTalk to him about your fears about having kids, start family planning and wedding.\n\nRings are expensive and peer pressure is there for size and design, weddings are stupidly expensive and personally I think a waste. I pushed back my wedding date twice already.",
            "[removed]",
            "Awww that's sweet! Be happy you two ❤️❤️❤️"
        ]
    }
]