[
    {
        "post_id": "nmhloz",
        "author": "ObjectiveCourse388",
        "title": "UPDATE: I don’t know what to expect for my [23F] date with my best friend [23M] and I don’t feel ready for it",
        "url": "https://www.reddit.com/r/relationships/comments/nmhloz/update_i_dont_know_what_to_expect_for_my_23f_date/",
        "score": 4063,
        "num_comments": 140,
        "created_utc": 1622149474.0,
        "selftext": "[Link to original post:](https://old.reddit.com/r/relationships/comments/nk1p9w/i_dont_know_what_to_expect_for_my_23f_date_with/)\n\nMy head is still spinning from our date last night. I was so nervous that I felt sick and I literally almost canceled last minute, but I'm so happy that I went through with it! I told him beforehand that I had anxiety about not knowing where he was taking me and I didn't know what to wear. He still wouldn't give away the surprise but he did tell me to dress comfortably, so I just wore one of my nice casual dresses. He made us an outdoor drive-in movie theatre (don't ask me how he did it because I'm hopeless with technology) where we watched my favorite movie and he brought popcorn and my favorite chocolate! Afterwards he took me to this new bookstore cafe in our town which had just opened and I had been dying to go to. I was so happy when he finally kissed me even though I had been previously dreading that he would. We actually kissed quite a bit. I found that my heart was beating not from nerves this time, but from genuine excitement. Now I look forward to intimacy with him and I feel like it'll just make us even closer. It's still unbelievable to me that this is happening, but it doesn't scare me anymore.\n\nI never thought Connor would ever make me feel like this. In my head it just wasn't a possibility since we were such good friends. I couldn't be happier that I decided to give him a chance instead of just immediately shutting it down in fear of ruining the friendship. In reality, our friendship was never in any danger. Yes, there are real differences between dating and just being best friends but there are WAY more similarities than I was expecting. The conversation still flowed the same way it did when we were only friends and we still have plenty of fun and laughs. I'm overjoyed that our friendship dynamic hasn't changed because I was mainly worried that things would be awkward now and I wouldn't know how to behave around him. Now it feels like we're friends who just happen to be dating and IMO that's exactly how things should be. Seeing how happy he is just feels like the cherry on top.\n\nTL;DR: I was terrified to date my best friend. I ended up being pleasantly surprised and I had fun on the date. Thank you so much to everyone who calmed me down and told me to be honest with him about my anxiety beforehand because your advice really helped!",
        "permalink": "/r/relationships/comments/nmhloz/update_i_dont_know_what_to_expect_for_my_23f_date/",
        "comments": [
            "I am so so happy this worked out as well as it did and you got comfortable!!! I just married my childhood best friend of 24 years earlier this year and being married to my absolute best friend has been the most amazing experience ever",
            "I am pretty sure I just barfed sprinkles",
            "This makes us all happy",
            "A wise woman once told me “to make sure I marry my best friend.” That woman was my grandmother and she was married to my grandfather for 50 years. Although I am just now reading your story I am so glad you gave him a chance. He already knows everything about you so the hard part of deciding wether or not you will like each other is long gone in 7 years. A random guy you meet could not nail the first date the way he did because a random guy is not going to know your favorite movie or favorite candy. Definitely though make sure you put as much effort into dating him as you would any other guy. If you normally get dressed and dolled up for dates do the same for him. Just because you have hung out in PJs before doesn’t mean you should slack on dating attire. Congratulations OP I am glad you didn’t over think the situation to the point where it didn’t happen. Trust me he is just as nervous as you and thinking all the same things you are!",
            "I want to puke at how adorable this is. Congratulations OP!",
            "LOVE this! Started dating my best friend after 2 years of friendship, now been together for 7 with our first baby on the way 🥰. Dating your best friend is THE best.",
            "So happy for you! My partner started out as my best friend too; we’ve been together almost 4 years now and we’re planning our wedding! We have the same easy, fun relationship we’ve always had, just with added depth and the bonus that I get to kiss his handsome face any time I want. Some nights we still end up staying up too late giggling. Falling in love with your best friend is truly the best 💕",
            "Congrats on the great first date! You had me smiling all the way through - it sounds like it was a really fun time for both of you!",
            "Yay!!  I dated my best guy friend after 11 years of friendship (and after dating each other’s friends, LOL). We have been married 10 years now, and have a toddler; so glad we took the initial step. Excited to read about others like us 🙂",
            "You deserve this! I’m so happy for you!!!",
            "This is an amazing update and I am so happy for you. Many relationships thrive that have a foundation such as yours. Many also fail, and often times, it's because the pressure put on this relationship, due to what is at stake with your changing dynamic, sets up unrealistic expectations of nothing but pure happiness.\n\nI know I'm just some stranger on the internet, but I just want to say that there will be bumps, mishaps, and times when you're unsure if you made the right call to change your relationship into a romantic one. Only time can tell but it sounds like you're off to a great start. You're both ready, open to the idea, into each other and you have a friendship already.\n\nFinding someone who you genuinely connect with, can be friends with alongside the romantic, is a gift. Enjoy it. Treasure it. Be true to yourself and trust your gut, but be open to new perspectives as they come along together. Weather the ups and downs, uncertainty and doubt, with humor and kindness towards one another and you'll be happier than you ever thought possible. My wife is my best friend. I treasure our small, seemingly unimportant moments more than she can ever know. She's my smart, sexy wife, but the most important thing is that she is my best friend.",
            "Good on you for giving it a chance. 5 years ago I confessed feelings for my best friend, but the situation was different in a few respects. Ultimately we never took a shot at it. I chose to remain friends with her and things are more or less the same and as good as ever. But I’ll go to my grave contending we could have had something very special. Wishing you two the best.",
            "I married my best friend! Besties for 8 years, then dated and been married 16! Good guys do finish first! And I remember his words that hooked me! I’ll be the man that holds your hair when you throw up! So romantic! 🤣",
            "I just married one of my best friends from high school a year ago! Couldn’t be happier for you and Connor!",
            "This is lovely! I married my best friend of 6 years and it’s been wonderful. I honestly think that as we are such good friends we are more likely to work through issues than argue as we have that strong friendship there. There was no awkward talk about exes either as we both knew everything! Best of luck",
            "Sister, I am happy for you and the dude. That's all. Enjoy!",
            "I started dating my best friend about 12 years ago. Best decision I've ever made. Congratulations!",
            "Yay, another friendship story. I'm dating my best friend, it's the way.",
            "I accidentally started dating my best friend 4 years and 11 months ago and it was the best thing I've ever done. We're not engaged yet but we bought a ring and he's still my best friend. \n\nBest friends with benefits for life!!",
            "this just made my entire day! i’m so happy for you both 🥺",
            "This is so cute! Have fun!",
            "so happy for you two!",
            "Cute all the best enjoy 👍👍👍",
            "Congrats. I started dating my only real and best friend after 5 years of friendship. We've been together for 11 years ... wow can't believe it's been that long. Still feels like my friend..  just in a different way :-).",
            "Been with my best friend for 8 years and now we're married with a two year old. We started dating at 21 an I had the same nerves as you, and worries would we be compatible or just fuck everything up. Been a wonderful 8 years with plenty of ups and downs but never a day goes by that I regret saying yes to that first date. Wishing you so much success!!",
            "My mom started to date her bestfriend after 14 years together (they were both single obvs)!! Similar story to yours.. he finally convinced her to fall in love with him back! :)",
            "Congratulations! I wish you endless happy moments! Have a lovely day, happy stranger!",
            "Are you a writer by any chance? The way you write reads like a novella",
            "dude im really happy for you, and youre a really mature person by the way you can articulate your feelings from what ive read in the last post. i think thats an awesome talent not many people have and im happy just to read your update",
            "I am in a relationship with my bf and she is the love of my life. It takes work- trust me, but you will always want to be with one another and fight for one another. Cheers",
            "Omg your best friend's name is Connor? I also have a friend that I've known since we were toddlers whose name is Connor that I've liked every now and then but never brought it up because he just didn't  seem to care about my feelings at all. But hes changed a lot and become more compassionate since going to university. Anyway im so glad this is working out for you and that your best friend wants to make it work with you.",
            "CONGRATS OP! I’m happy you’re happy! Now can you keep updating us until he proposes? 😝",
            "I just got goosebumps! Congrats, this is a wonderful outcome! My first love was my best friend first and it was such a fun relationship. We were way to young for it to last but I will always remember it fondly. I’m a strong believer in the friendship part of the relationship being the most important",
            "I loved reading this!\n\nAlso, for others (hopefully OP won’t need this in the future,) once someone develops romantic interest, the friendship is pretty much over, anyway.",
            "I could relate this story to my life at least except I'm the male. So, basically I had my first ever crush on this girl when we were both 15 and two years later we started being a very close friend. I don't think I've ever met such a wholesome girl in my life and I made a firm decision to not ever confessing my love so that I wouldn't jeopardized our relationship. If there's one thing I would  hate the most is not that I'm not able to date this girl but rather to completely lose her as a good friend.\n\nNow I'm 24 and I'm in another country doing my Bachelor. Although we haven't contacted as much as we used to before I left the country, we still remain as a good friend and periodically texting asking about each other. I also knew she had her first boyfriend for two years during her college time and she had a breakup and was hurted by it a lot. I feel really bad her that I wish I could be by her side at that time consoling her but alas all I could do is just texting her.\n\nI was single the whole time and never been in a single relationship until now. Even though, I'm attracted to someone, there was not a single girl who is as interesting person as her. So, I ended up not dating anyone because I was comparing everyone to her lol. \n\nMaybe just maybe, if we ever meet each other again in the future perhaps 3 years later after I finished my Master, and we were both still single and she still remain attractive to me, I would consider confessing my love and ask if we could start dating. \n\nReading your story give me a lot of hope. \n\nPerhaps dating your best friend is the best after all since you understand each other like and hate a lot more than a normal relationship and you could enjoy a casual and easygoing life with each other because admit it, being romantic the whole time is tiring and I don't want to be in that kind of relationship personally. I want to be able to talk everything with my partner and not hiding it because I'm scared she would dislike me. Besides, being a best friend means your personality are compatible with each other and that's a key for a stable romantic relationship because you could discuss problem you guys had with a cool head.\n\nI'm not sure if this true but your male friend might start liking you earlier than you think but chose to do the same as me. One day, when you get closer maybe you could ask him if you're curious. To be honest, I'm jealous with you but I'm so happy seeing your relationship is working well. Good luck girl!",
            "So happy for you, congrats on taking the risk and getting out of your comfort zone. I'm glad it worked out :)",
            "so wholesome. keep us updated on how things go",
            "My lil heart is dancing with happiness for you both 🥰",
            "I’m glad this worked out and I’ll tell you why: all the right components were there PLUS chemistry. That’s the difference between doing this first date with a best friend who ends up feeling more like a brother (no chemistry) versus doing this first date with a best friend who ends up feeling like a boyfriend (chemistry!!)",
            "I'm so dang happy for you. The best relationship I've had is the one I'm in now. We both say and feel like you get to have and be around your best friend and feel comfortable all the time, but also get to kiss and love them, and it's the best.",
            "Congrats on going through with it. My girlfriend knew more about me than anyone but only knew me a month.  So love is crazy",
            "As another person who went from friends to dating to long term couple inject this directly into my veins. It's always a unique special joy when someone at the start of a relationship goes just utterly perfect and you are just so happy you feel like you are just floating and a light breeze could lift you off your feet. \n\nBut just a thing I would add is always make sure you keep your friendship intact where even if you reach a point where maybe you can't continue together romantically that you just transition back to friends. In the winding road of my relationship into marriage that's what kept us together and able come back to each other even when we thought that maybe we couldn't make it work as a couple.",
            "Thank you, your story just made my day. Sure reads alot like this is a keeper. Treat eachother right and things will be fine. 🙏🏼- OP!",
            "My partner and I became best friends after we started dating, and you're right there are SO many similarities",
            "This is so cute and so perfect. I'm so heartened to read it because it seems like I never get to read stories like this that are so...so much like real life fairytales.\n\nPlease remember that it will be hard to top that level of amazing perfection, and while you probably have quite a lot of amazing, loving, fulfilling experience ahead of you, you have to have realistic expectations! These are the relationships worth working the kinks out in and doing the hard work to make work. Congratulations.",
            "Tbh dating someone compatible is just dating your best friend anyways. It shouldn’t change much, especially going into it with the right mindset.",
            "You really have to be best friends with your life partner for the relationship to flourish. I did it the other way around: my lover became my best friend. Either way works.",
            "These are my favourite kinds of updates, mazel tov!",
            "I’m having a baby with my (originally) best friend of 5 years, boyfriend/partner of 3, don’t be surprised if there’s some trouble down the track- there’s always a learning curve at the end of the day! BUT that thing that made you guys friends (laughing together etc) is what’ll keep your romantic relationship so strong down the road. Ending up with a good/best friend is a genuinely magical experience, I’m so glad your date worked out well x",
            "My husband and I were roommates for 2.5 years in college. I lived with 4 guys Some of which I Bartended with bc I’m not a big fan of most chics. \n\nMy future husband was a random dude i didn’t even meet before I moved in. He was dating a girl already for the first 2 yrs we lived together. I never thought of him as anything more than a roommate and then friends eventually. \nAll roommates became very good friends. We partied, worked and lived together. My now husband and I became close friends and he honestly made me laugh the most, we pulled pranks on each other, etc. \n\nAbout 6 months after I moved out, we were all suppose to get together for a lunch reunion and none of the other roommates could make it but my future husband. We had a good lunch, but actually talked about his ex a bit. \nDecided to grab lunch again just the two of us about a month later. \nWe continued to be really good friends but then it just clicked and we were both actually scared to tell the other one we were liking them more than friends.\n\nThe rest is history, almost 17 years of it.  We still make each other laugh a lot",
            "Congratulations on such a great date! It sounds lovely!\n\nMy SO was a really good friend for years and we always found it incredibly easy to be around each other. Then one day we'd gone out to see a film together and for some reason we'd both dressed up more than usual. I turned to him and said \"Is this a date?\", he said \"it can be if you want it to be\" and that was it. Nine years later and he's still the only one for me.",
            "Dating your best friend is brilliant, trust me <3 \nCongrats",
            "[everyone liked that]\n\nvery happy for you",
            "My best friend of ten years kissed me one night and I was so scared that it would ruin our friendship. Twelve years later we are together and we have been through a lot. But having my best friend by my side has made all the difference. The foundation of respect and friendship has made all the difference.",
            "A great saying I learned of the other and now I will definitely live my life by:\n\n“Let everything happen to you.\nBeauty and terror.\nJust keep going.\nNo feeling is final.” \n- Rainer Maria Rilke\n\nMeaning there’s don’t be scared of feelings. If it works then it works. And if it doesn’t then that’s okay too. Enjoy it and I hope it lasts",
            "My first free silver award and I couldn’t resist giving it to this post. Congrats and happy that you had fun!!",
            "I started dating my best friend right around the same age - we were seniors in college. I was also nervous about it, especially because we were also roommates and there was clearly a potential for things to go sideways lol. Happy to report almost 11 years later that we have been happily married since 2014 :)",
            "I didn't know such guys existed. You lucky girl!",
            "This is just about the cutest thing I've ever read. Congratulations. :)",
            "So happy for you :) I started dating my best friend when I was 19. We've been going strong for over 15 years, he's my SO but still also my best friend, and it's the best kind of relationship.",
            "I started dating my best friend on eight years. We're a year in and I'm saving for an engagement ring. Happy for you!",
            "Awesome! I’m dating this boy that I’ve been dubbing for 6 years, it’s great :)",
            "Well this was the sweetest damn thing I read today. I'm happy it went well for you both!! It sounds like a really amazing date, and he sounds like a really great guy. I wish you both the best of luck moving forward!!!",
            "This is such a feel-good post! Thank you for sharing❤️",
            "My best friend asked me out 6 months ago and he did the same thing. Logiced me into it. Never been happier",
            "Friends first romance second is always the way to go.",
            "I've just read the previous post and thought you don't stay awake all night thinking about a date you don't want. It was very obvious op was into him. Those nerves were butterflies. So glad things are working out well, and long may it continue",
            "This is a great update.",
            "This just made me smile so hard",
            "This is adorable.\n\nOne time, I asked out a friend that I'd known for years. We were good friends, and she made some obvious hints that I agonised over for weeks (did she really mean it like that? etc) and I made it clear that her saying no would be ok, and if it didn't work out our friendship would remain, but that I'd had feelings for her for years, and if she was interested in giving it a try I'd like to.\n\nShe said yes.\n\nAnd we're getting married in 4 months!\n\nNot saying that'd the deal here, just that, for us, our friendship is a huge part of who we are together. She's my best friend, and I can't imagine my days without her next to me\n\nEnjoy what you two have, and remember to keep making an effort for him and ensuring he does for you, over and above what you do as friends\n\nI wish you both the best of everything!",
            "I’ve been married almost 30 years. I have found being good friends before romantic partners is a good idea. Especially if you marry. It helps during the less “ warmmy feeling” times in the relationship. It gives you something to fall back on while you work back to the Romance and love. My 90 yr old  grandmother told me this when I was 18 and I found it to be true.",
            "That's wonderful! \n\nMy husband was one of my good friends before we started dating. I think our relationship is so solid in large part because we were friends first.",
            "So he escaped the friendzone huh? That cheeky guy lol",
            "Married my best friend and it was the best decision of my entire life.",
            "I knew it would work out and I'm glad you gave him a chance!",
            "Unless if at some point it ends terribly and you lose a best friend and a bf",
            "Can I just emphasize that it's DATING people, its two people sitting down having a conversation. Lets not over dramatize what it is, stick with your plans, this is a perfect example.",
            "[deleted]"
        ]
    },
    {
        "post_id": "bvsdrb",
        "author": "Resentment_",
        "title": "How do I (33/f) stop resenting my husband (33/m)?",
        "url": "https://www.reddit.com/r/relationships/comments/bvsdrb/how_do_i_33f_stop_resenting_my_husband_33m/",
        "score": 4058,
        "num_comments": 669,
        "created_utc": 1559440220.0,
        "selftext": "My husband and I have been together  15 years and married for 11. He’s a physician in the US which, as most everyone knows, comes with a hefty price tag. We got married right out of undergrad and the summer before he started medical school. I had to change which masters program i was going to last minute but i was able to get in and get a job and was able to support the both of us with this job (that I loved) while he finished med school. When he graduated, he got a residency in another state (and barely even consulted me about it before he applied and interviewed and decided. I put it behind me and packed up and moved with him and was luckily able to find another job that was better salary wise but I hated and was able to fully support us both while he was able to put all of the money he made in residency towards his student loans. After he finished, I was able to get a different job thats better than I ever could’ve dreamed of and got a major promotion near the end of 2018.\n\nSince January 2019 my husband has been pushing for us to start trying for a baby. He also doesnt want strangers “raising” his children so he doesn’t want to put them in daycare or have a nanny when we have them. We also don’t have any family close by nor do we have any friends that would be able to take on that responsibility. He also doesn’t want to quit his job or go down to part time in his job to take care of said kids, but he expects me to be a stay at home mom. I’m not ready for a baby right now.  I’m not ready to sideline my career and leave my dream job that I have worked my ass off for.  I told him as much which resulted in a fight where he told me that I should leave my job because his is more important than mine since he “saves lives everyday” and I don’t and ultimately most people could do my job with a “little bit of common sense” whereas his is way more than just sitting at a desk all day (which I don’t even do). When the subject of kids came up years ago, he said no because he wasn’t ready and wanted to finish his education. Despite what I wanted, I accepted it and moved on because I understood where he was coming from and respected his feelings.  When I brought this up he said I was throwing it in his face and making him feel guilty for wanting to pursue his dreams. \n\nI had to walk away because I was so furious and hurt by what he said. And since that fight, I’ve been thinking about it over and over and have found  myself thinking things i probably shouldn’t and wanting to bring up how my unimportant career supported his ass while he accomplished his dreams but he didn’t complain about how unimportant it was then. I supported him mentally, emotionally, and physically too and if he was up at home studying I was up helping him study, I made sure his clothes were clean and that he ate and slept and was comfortable when he came home after he had a long day despite me also having a long day. I dealt with my father passing away on my own because he was unavailable due to his training. I gave up my dream program, my original dream job, the place I loved and wanted to live forever and my desire to have kids so that he could accomplish his goals. I was depressed and miserable for years at a job I didn’t like, in a city that I hated because it meant he was able get what he wanted in life. I know you’re not supposed to do things with the intention of being paid back or “keeping score” but I did all of those things because I love my husband and expected that, at the VERY LEAST, he would respect me and my career and be understanding and supportive of my wants and needs like I have been with him since the moment we got married. It just seems like I’m the only one sacrificing and being selfless in our marriage. And not only that but my job is important. I may not be an MD or “saving lives” in the moment but I am making a significant difference and change in the lives of my patients and helping improve their quality of life and leading them to be healthier overall and work alongside several physicians who have recognized the positive impact I’ve had on the lives of many people yet the one who matters most to me doesn’t recognize or believe this and it hurts like hell honestly.  I’m mad and hurt right now but I know that if the resentment fully sets in it’ll be the worst case scenario. How do I stop this from happening and how do I stop feeling this way towards my husband? \n\nTl;Dr: Husband is being a jerk about my career and I feel myself starting to resent him and don’t want these feelings to get any worse towards him. How can I stop having these thoughts about him and our marriage?",
        "permalink": "/r/relationships/comments/bvsdrb/how_do_i_33f_stop_resenting_my_husband_33m/",
        "comments": [
            "I would double up on birth control because you guys have way too many issues to sort out in therapy before you ever get pregnant. You can’t stop resenting him until he sees you as an equal partner and since he’s a super important Dr. that’s not going to happen easily apparently.",
            "This sounds almost exactly like a guy I grew up with, so I’m going to give you the advice I wish I could tell his wife: you also get a say in your life together, and a partner who honestly believes they are more valuable than their partner is not someone to spend your life with. I’m not saying you have to abandon ship now, but I am saying that now is absolutely the time to have a conversation about goals and your life together. You are not a terrible person for feeling that you shouldn’t have to set aside everything you want. I can tell you as someone who did discuss and then moved twice with a partner and did want to stay home while our child is little that it is still hard, even with a husband encouraging me to go back to work or do what will make me happy. Definitely hold off on kids until you’re both in agreement. Ask him to see your perspective. Your feelings are valid.",
            "I’m not sure that you *should* stop having these thoughts about him or your marriage, because you’re absolutely justified in feeling this way. He’s marginalized your career - the same career that was good enough to support him through med school - and expects you to give it up to raise your children... you know, the ones he’s too busy and important to raise himself. \n\nHave you considered marriage counseling? Does he know how you feel, and why you feel you’ve accommodated his dreams all this time only for yours to be brushed off like this? Does he understand that he’s basically saying that what he wants is more important than what you want is?",
            "Hi OP! Other commenters have touched on the worst of the situation here. I just want to make sure you know that everything you’re feeling is so, so, so valid. It really sounds like your husband will not compromise. Do *not* quit your career for him right now. Your husband has, so far, gotten everything to go his way because you’ve allowed it to. \n\nTell him everything you said here. How your “unimportant” career carried him through everything he ever wanted in his adult life, and that career wasn’t just a placeholder for you. You have made sacrifice after sacrifice and left everyone you care about behind, just for him. You emotionally, physically, and financially supported him because you love him. Tell him what you’re thinking - that marriage isn’t tit for tat, you didn’t make those sacrifices only to cash in on them later... but that you have compromised on every major thing you have wanted in this marriage, and goddamnit, he needs to be open to compromise, too. \n\nNow is your time to be selfish. You *get* to be selfish. Your life’s work is significant. If he wants a kid so badly right now, he can research some good childcare options, because that’s your line in the sand.\n\nDraw the line. Put yourself first. Because it sounds like you haven’t in a long time.\n\nIf he isn’t interested in compromise, then do think hard about what the future holds. Allow yourself the chance to feel your feelings. You only get one opportunity to live your life, don’t throw all your desires away on someone else’s behalf.",
            "He doesn’t see you as an equal partner. He sees you as an accessory to him, as a planet in the orbit of him which is there to bask in his glory. He does not support you emotionally, he does not see you as a fully accomplished human being. \n\nYou guys need counselling, and I don’t know if there is any hope even then.",
            "I’m the daughter (21F) of a physician, and my parents relationship sounds exactly like what you’re describing. Got married out of undergrad and mom worked at a bank until dad finished residency. She moved all over the country for him- away from her family where she wanted to be. They’re still married but haven’t been happy for extended lengths of time for as long as I can remember- they’ve started trying recently. It’s definitely the  “physician” mindset in my dad that makes him feel entitled and above the rest. It’s HARD to have a dad and husband like that.. very hard. Demeaning to my mom and incredibly hard on my siblings and I. I can’t put words in my moms mouth, but I can’t imagine she would go back and do it all over again. This may not relate to your situation at all and I’m not trying to make you think this is how things are going to end up but it just resonated with me as soon as I read it.. my parents..",
            "So he doesn't want to cut back on work... He doesn't want to help with child care... He doesn't want you to get help with your future kid..\n\nHe wants you to quit your job... He wants you to sacrifice your joy for him (again)... AND he demeans your contribution to your advancement as a family unit.\n\nBut he wants kids.\n\nWhy does he want them if he doesn't want to do anything to be actively part of their lives? Seems he isn't happy unless you are unhappy. This looks more like a way to lock you down so he can continue what he enjoys while sucking any independence from you.\n\nDon't try to block out your thoughts but think about them fully. Consider things in the long run. Insist kids are off the table unless he goes to counseling for his God complex and you both go for your relationship. Preferably one you researched and selected. Last thing you need is some Dr. Friend of his making you doubt yourself and manipulating you for your SO's benefit.",
            ">He also doesnt want strangers “raising” his children so he doesn’t want to put them in daycare or have a nanny when we have them...He also doesn’t want to quit his job or go down to part time in his job to take care of said kids, but he expects me to be a stay at home mom.\n\nHe doesn't want strangers raising his kids, but he doesn't want to raise his kids. Everything you need to know is right there.",
            "He has a selfish, sexist outlook. This would have been a good discussion to have before getting married, but hindsight is 20/20...\n\nThe whole \"strangers raising our kids\" response is close minded and old fashioned, in my opinion.\n\nIf you're not ready yet, then he has to wait. And he may need to accept that you won't give up your career.  If he cant handle that, then he may not be the best partner for you .",
            "[deleted]",
            "My goodness, your husband sounds like an entitled so and so.  Sorry if that’s too honest.\n\nDon’t have kids before you are ready!  But I want to address the “don’t want strangers raising my child.”  If you have a nanny, they are NOT a stranger and quickly become a beloved part of the family as they help you take care of your child.  I have a 3 year old and she had a nanny from 9 - 20 months.  The nanny was amazing and really felt like a part of the family, not a stranger at all.  At just shy of two, we realized that my daughter needed more mental stimulation than my husband (who was the stay at home parent) could give her and we enrolled her into a Montessori day care.  She is thriving!  She loves her school, learning, and seeing her friends and teachers.  She’s incredibly social and if we have a long stretch of days off, I can see where she gets antsy to go back to school (she’s 3 now).  I have friends with a kid who is less social and that kid also thrives in daycare despite not needing as much social stimulation as my daughter does.\n\nPoint is...”don’t want a stranger raising my child” is a shitty thing to say, especially when he’s not willing to give the time to be a part of raising the child. \n\nMaybe that’s a controversial thing to say, but frankly, if you can find a nice school, I think putting a kid in a daycare/school is good for their development...\n\nAgain, your husband sounds like a real piece of work...",
            "You're just a bit of decoration in the shrine he's constructing for himself. Cut your losses.",
            "Most people have already said the various things I'd say, but I want to make two points. \n\nOne - you say he was \"unavailable due to his training\" to help support you when your father passed. The death of a parent is a difficult and awful thing to go through,  especially since it seems likely you were still a young adult and should have been able to expect your father to be around a lot longer. I understand med training is very difficult,  but someone who couldn't make even a small effort to be there for you through something that difficult is not very likely to be there for you through other difficulties. And as many people have mentioned - raising kids is hard.\n\nTwo, I'm super suspicious of the timing. You mentioned getting a large promotion end of 2018 and then he starts pushing for kids and you to leave work only a few months later? That reads to me, with everything else you've said, of someone who enjoys the lime light and being the important one and the Big Job in the relationship. I wouldn't be surprised if it turns out he's jealous of your promotion and wants to clip your wings a bit because he's used to you being in his shadow and only supporting him. \n\nPlease, please do not bring children into this marriage without couples counseling, a pronounced change in his attitude, and you getting to choose whether you stay at work or not. And if you do wind up having kids and staying home? Make very sure you have a close eye on and joint control over finances and keep a decent chunk of your own money separate.",
            "He's the one who doesn't want to pursue the reasonable option and put the kids in daycare. He can figure out the logistics. You're not obligated to bend every which way for this man who seems to take you for granted.",
            "Good lord this is like reading a snippet out of the book about my mom and dad.\nMy mom was a teacher and my dad was a kidney transplant surgeon/urologist. \nMy dad expected my mom to quit her job when he was done with residency and have kids.\nShe already had two from a previous abusive marriage, but felt it would be selfish if she didn’t give him his own biological kids too. He wanted 3, she had two.\nThe world revolves around his career. My sister and I hardly ever saw dad. Mom did everything, maintained our huge mansion, every softball game, gymnastics meet, doctor’s appt, etc. She helped start his practice, maintained his books, did his taxes, etc.\nDad drank more and more every year. He had a quick temper that alcohol makes 10X worse.\nMom became disgusted and resentful. She became depressed.\nDad begins to obsess over a new hobby every 6 months, so whatever “off” time he did have was now sucked up with golf, painting, gardening, etc. \nTwenty years of marriage and she gives him the ultimatum: quit drinking or we are done.\nHe was out the door. Had a new girlfriend within a month and bought her a Porsche the next month. \nHe didn’t feel my mom deserved a dime of “his” money. He went to school for a decade and saved lives so why should she get anything? He didn’t pay her a cent of child support or alimony until the divorce was final. He kept appealing, stalling, delaying and filing motions in court. He had the deep pockets and said to my sister and I “I will keep taking her back to court, which forces her to pay her lawyer, until she is broke, homeless or dead.”\nAnd we knew he meant it.\nShe had three suicide attempts that year.\nSo my sister and I, along with our half brother and sister, decided to try and stop him.\nWe wrote a letter detailing how much my father drinks, how he is drunk every night, how we have witnessed him give orders to nurses over the phone while drunk and have seen him stumble out of the house drunk on the way to the hospital because a kidney retrieval has become available. \nWe sent it to his lawyer and said if he didn’t leave Mom alone, accept the final divorce decree and leave Mom alone, we would send the letter to the state medical licensing board.\nIt worked.\nHe finally left her alone, but didn’t speak to any of us “spoiled” kids for years.\nI feel really bad for you OP, and hope your husband is t as much of an egotistical, narcissistic person like my father is. I am glad to hear you know there is something wrong and I hope counseling will really help you both.\nIt takes two parents to raise good kids. My siblings have really suffered, one is in prison for 11 years, one has such bad mental health issues she can’t work and no one in our family speaks to her, my sister is bulimic and has only recently gotten a job at 38 and I married a guy just like my dad and divorced him when I finally realize it.\nStay strong and know your worth. It will only get worse after having kids with him.",
            "[deleted]",
            "[deleted]",
            "Doctors like this are shitty doctors. For starters.\n\n&#x200B;\n\nUncompromising physicians are terrible physicians, do you think he could admit to a patient he was wrong? Or test for something he kind of thought might not be the case but thought better safe than sorry? Do you think he listens and empathizes with people and is willing to hear *how they feel about their own body's medical concerns?*\n\nYour husband is uncompromising and if he treats his job anything like his marriage, he's a shitty doctor.\n\nIf you have kids with this man OP you will likely never have a life outside of motherhood, you will be out of the workforce for 18 years and returning could even be an impossible task, because who wants to hire someone who hasn't done their job in nearly two decades?\n\n&#x200B;\n\nAlso, there isn't even a logical reason behind wanting you to be a stay at home mom beyond **control**. 'I don't want a stranger raising my kids' is basically code for 'I do not want you to be able to enjoy your life as I see fit' because if he cared so much about the 'no strangers' part he would do it himself.\n\n&#x200B;\n\nHe's made it extremely clear that you are a stepping stone for his career and life - and besides, I can guarantee you any children you have with him won't be important to him either so much as another way to exert power over a human life - but this time one that does not have the ability to leave the situation.\n\n&#x200B;\n\nI want to say 'couples counselling' and be somewhat optimistic, but to be honest the fact that he's literally not willing to even spend time to think about any form of sacrifice whatsoever, even one as arbitrary as 'Kids being cared for by stranger during work hours', he's probably never going to 'see the light' but at best move the goalposts to get what he wants and then mid pregnancy drop a \"no daycares or nannies\" bomb when you have less opportunity to escape.",
            "As a physician myself, I’ll be very clear: any one of us who brags or uses in anyway the « we save liiiiives each day » schtik is an *asshole*. Dump his sorry ass. You did plenty for him, he did nothing for you, and he has the gall to ask you to quit your job. Get outta here asap.",
            ">It just seems like I’m the only one sacrificing and being selfless in our marriage.\n\nIt doesn't SEEM that way. It IS that way. You've sacrificed your career, your happiness, your health, and your dreams for your husband. You had to grieve for your father alone because your husband was unavailable. You're doing his chores for him because his free time is seen as more important than yours.\n\nHe doesn't want a wife. He wants a cheerleader and a maid. Your resentment is a NORMAL emotion to have in your situation. It's your mind's way of telling you that you are being treated unfairly and you're now aware of it. You need to sit him down and tell him that you've already sacrificed a lot for him, and now it's time for him to start supporting you. He needs to know that kids are off-the-table until you get your own life to where you want it to be. We only have one life - do you want to look back at the age of 70 and realize you haven't achieved a single goal for yourself because you spent most of your life placating your husband's dreams?\n\nAnd if he doesn't want \"strangers looking after the kids\", he can damn well look after them himself! Why is his career more important than yours? He can be a stay at home dad, then the kids will never have to be looked after by a stranger! (though for some reason I can't see that happening. Hmmm....wonder why).",
            "This guy wouldn't get anywhere near me with a stethoscope. His ego is going to cause him to make a huge mistake someday. \nAnd his not including you in any of the major decisions made is a major red flag, OP. Do NOT have kids with this guy. Relationships should not be this one-sided. I'm 57 years old, female, and have been through my fair share of exactly this kind of situation. \nI hate to say it, but id he doesn't agree to counseling, it may be time to consider an attorney.",
            "Why would you want to have kids with someone who doesn't see you as an equal partner and who will barely be there for the kids?",
            "Your relationship is predicated on, and has only existed under the condition of, your sublimation of your own desires to fulfill his. Now that you’re suddenly advocating for yourself, he’s offended by the mere suggestion of your agency and personhood; supporting characters don’t get the big plot developments, y’know? \n\nIt sucks to be a generous person then find out some people don’t view it as generosity, they view it as what they are *owed*. It doesn’t sound like your husband became inconsiderate overnight; he has always been this way, you were just able to paper over it with goodwill. \n\nIt’s not ‘keeping score’ to name your own desires and insist on equity in your relationship, but I’m not entirely sure your husband will be able to (or want to) remain under an equitable system.  At the very least get some therapy for yourself, and maybe start looking into some resources to make sure you’re in a good place should you two separate.",
            "The 1950s jerk store called and they’re running out of your husband.",
            "If you quit your job it'll be harder to leave him. He may not be consciously thinking that, but he sounds like a narc. \n\nYou thought you were doing what you needed to as a team, but you need to look up codependency.",
            "You’ve already given up a lot for him. Don’t let him bully you into giving up more! You deserve to be happy and fulfilled and to work at your dream job, even though he arrogantly thinks that your job isn’t important. \n\nThat’s really messed up and arrogant of him to say that his job is more important than yours. Like, I don’t know even know how I would respond to that if my partner said that to me.",
            "1. He is sexist.\n2. He is selfish.\n3. He doesn't respect you.\n4. He doesn't respect others.\n5. He takes you for granted.\n             I would've left him it I were you.\nIf he doesn't wanna solve these mentalities of him, then you should leave him and move on. \n            Don't be afraid to take the right decision.\nYou will be thankful for yourself later in life.",
            "The thing is, you shouldn't. He deserves all the resentment coming his way because he's being an unbelievably selfish and insensitive jackass. Could you show him this post or write a message/letter with the same content? If he after that still can't see the situation from your perspective, it speaks volumes about much bigger problems that should not be overlooked especially if you're planning to start a family together. Talk, get counseling, divorce if it comes to that - but solve this before the whole mess involves a child.",
            "I think it's very very nice of you to want to put this entire incident behind you and not have bad thoughts about him, but I don't think this will benefit you. Obviously it's not about keeping score, but if eventually the person turns out to be unworthy for everything you did, it'll trigger these thoughts and very rightfully so. Not to mention how disrespectful he is. I think at this point, really think about yourself and the rest of your life that you have ahead of you. Please don't end up sacrificing and living your life like this for another 11 years. Mind you, he might not care about any of the discussions you bring up and then suddenly care when you're about to leave. Just know what's genuine and what's not. Even if you do give him another chance, see how he behaves, respects and appreciates you afterwards. All the best. :)",
            "He sounds like a selfish person. You should probably bail before you get any older.",
            "You're his workhorse honey, bail.",
            "You could probably stop feeling those negative emotions if you divorced his ungrateful ass. I’d go with that.",
            "Get out now and don't let him get you pregnant. Follow your dreams and tell him to take a hike! He should not treat you like this.",
            "Why would you need to stop having those thoughts? They are important since he's just proven to you that he doesn't respect or appreciate you or your job and just want you for an incubator now that he doesn't need you for a bank. He is using you. You are a thing to him. If you weren't he might have taken your feelings into account instead of acting like a giant baby over not getting his own way.",
            "I am the physician in a similar relationship. (Together for +25, married for 17, dragged her to a random city for residency leaving behind the job she loved) While I didn’t ask my wife to give up her career when we had kids, I was happy when she decided to stay home. Fast forward 15 years, the kids are grown and she is full of regret and so am I. My two greatest regrets are not picking a residency near her job ( I could have) and not strongly encouraging her to keep her job. I hope you two get counseling to work through your issues. Your husband is too dismissive of your long term happiness. It should be addressed before you BOTH regret it.",
            "You need to tell him the things you have carefully not told him. \n\nMy husband and I have been together for about the same amount of time as you two. We have 3 kids and I homeschool them (I was the one who pushed for that, so our situation isn’t quite the same as yours, but I think this is relevant anyway) while he brings in the money working in tech. He had some similar ideas to your husband’s but I never held back. I have always been adamant that his paychecks are our money, me staying home allows him to have the life he has, I put in at least equal work in the relationship, making money is not half and he still has to do stuff around the house and with the kids, etc.\n\nMy husband saw that I was right with all of these things; he doesn’t just go along with it to keep me happy. He’s seen that even though I can’t do his job (I’m smart enough, but I can’t concentrate on code at all, and also I get sick of every job within about 6 months), neither can he do mine. \n\nWe are partners. Our skills are complementary in a ways that makes daily life with kids possible for us. And my insistence on that has helped to keep him humble even as he’s done better and better in his career.\n\nYour husband seems to have developed a bit of a swelled head and forgotten where he came from. Remind him.",
            "I would suggest to keep pursuing the \"I don't want other people raising my kids\" argument. \n\nMy wife said the exact same phrase before we had kids. We both worked and neither of us planned to stop, so her plan was we were going to move about 150 miles to be near her mother who would take care of the kids. This would involve us both having to find new jobs which we were both currently happy with already.\n\nOver time, she eventually got used to the idea of daycare after talking to some coworkers and asking where they sent their kids and how they liked it. Over 2 years in daycare later it's been great and they have made many friends and learned how to socialize that never would have happened if they were at her mother's house all day. And to top it all off, we never had to uproot ourselves or start over in our careers.",
            "I'm sorry to say it but you married a narcissist.  I'm also sorry to say his narcissistic roll is just starting. He will not lose steam. It only gets worse. \n\nI was in the same sort of situation for 16 years.  Just like your situation, some of the things my ex did and said were jaw dropping.  My ex started with his narcissistic behaviors, which escalated to verbal and emotional abuse and extreme manipulation.  It eventually became physical abuse,  but by then he'd done most of his dirty work on my psyche. I was already beat down. \n\nOf course no one can predict your husband will follow an abusive path but sounds like he's already using a lot of manipulation with you.\n\nKeep your head up, keep your wits about you, and don't lose yourself in all this.  I would also suggest you start preparing yourself for the worst. Do not assume if you split up that he will just willingly split your assets equally.  He has already begun setting you up to believe you deserve less in life.\n\nI'm sure this is all very hard to take right now. I wish you the very best in life. You deserve it. You are very intelligent, and it's easy to tell from your post that you are kind, loyal, and supportive.  Reach out to people often for support and encouragement.  One of their ploys can be to try and isolate you from people who can support you.  Even this community is here to support you.",
            "I know this isn't r/amitheasshole, but your husband sounds like an asshole. It just sounds like you're his accessory and like he doesn't have any regard for you, your feelings or your career. You're absolutely justified in how you feel.",
            "You have every right to feel resentful. He hasn't consulted with you or cared about your dreams/thoughts/opinions your entire marriage. I'm sorry if that's too blunt, I really feel for you.\n\nThere are plenty of awesome comments here already, but I wanted to add something else about having children, if you do want to have children at some point. Even if you are both on the same page about staying at home vs childcare or nanny, even if he was supportive, even if he was involved in their care, in taking care of household chores, thought load etc. Having kids is HARD. Rewarding but hard work. It might be hard to conceive them (it was for us); there's a possibility of morning sickness, pregnancy complications, birth complications, premature birth, etc. So many things that have a non-negligible possibility of occurring, that you would need time off work, appointments, someone to take care of you or provide emotional support. Then the baby is here - the relentless nature of feeding, diaper changes, sleep deprivation, mountains of washing, sickness, tantrums etc. What if the child has additional needs? Then there's still the thought load and household chores of shopping, cooking, cleaning, medical appointments, daycare pickups (if this is possible), paying bills, etc.\n\nI am not pointing out any of this to put you off ever having children - but to ask if you would really consider ever having a child with this man who will leave everything I've listed up to you. It's harder if you have a partner who doesn't lift a finger and demeans you at every turn. I don't doubt he'd be the type to criticise your parenting or housekeeping while you're knee deep in dirty diapers and a crying baby.\n\nThere are so many wonderful things about having children - can you honestly see your husband taking his kids to the park, or giving them hugs when they're upset, or taking goofy selfies while they play dress up together, or teaching them how to ride a bike, or taking them on holidays? All the loving parent/child things - will he be there for those? I can promise you that will build resentment in you as much as him not being there in the trenches.\n\nYou have these feelings for a reason; consider counselling for yourself to explore these feelings, and remember that it is okay for you to expect your partner to respect you, respect your dreams, compromise and discuss, and put the welfare of his relationship and family ahead of his ego.",
            ">his is more important than mine since he “saves lives everyday” and I don’t\n\nMy jaw dropped at this. What a cruel and asshole-ish thing to say to someone who supported them financially for years.\n\n> It just seems like I’m the only one sacrificing and being selfless in our marriage.\n\nIt seems that way because it is that way. And I doubt that will change. I'm sorry - you seem like a great person. Your husband - not so much.",
            "Don't have kids with this asshole",
            "He's 33 you think he's going to change? You've sacrificed so much to make sure he got his way. I'd start looking into a divorce lawyer. I don't see this ending happy for you.",
            "Your feeling are in the right place. I dont see why should you change those. \nWhat needs changing is your partner attitude towards you. \nYou should stand your ground.",
            "I'm sure this will get buried, but you should leave and give yourself a chance at greatness. If that comes with finding a true partner down the line--awesome. \n\nMy husband and I have been together for over a decade now and we had so many conversations before legally committing to forever. About our careers and kids and a combination of the two. About politics and core values. Basically anything that could come up and cause strife. \n\nYour husband doesn't value you as a person. You're a supporting character to him. You deserve better than that, and honestly it sounds like your life is great if you just cut him out of the picture.",
            "He doesn’t sound like he respects you and your career at all. I’m not sure I could be in a relationship with a person who felt like that and I definitely would struggle to have children with that person. I’d suggest counselling and if that doesn’t change his attitude then I’d be wanting a divorce. I’m sorry you’re going through this, no one deserves to be treated like that.",
            "> I accepted it and moved on because I understood where he was coming from and respected his feelings.  \n\nThat's very nice of you.  You are a caring and considerate person.  \n\nCan you point out where he considered where *you* are coming from and respected *your* feelings?  I can't seem to find that part.  \n\nBy my read, it seems like you have busted your ass to make his dreams come true, but he has paid little or no attention to your dreams or what you want from life.  This is a perfect example- HE wants a baby, you are expected to drop your dream career and raise his kid because he wants you to.  There is (as far as I can tell) little or no consideration about what YOU want.  \n\nFurthermore, he sees your job as unimportant because you aren't saving lives.  That says a lot- it means the fact that your job makes you happy is not important to him.  Thus, you being happy is not important to him.  \n\nYour problem OP is not that you feel resentful.  Your problem is that you and your husband have an unequal relationship.  You give lots of support to him, and make his dreams come true, but he doesn't give that support to you or try to make your dreams come true.  He is so worried about his own dreams he does not even consider yours.  \n\nI would strongly suggest have a sit down conversation with him.  Pick a time when you are both not stressed.  Tell him, without yelling at all, that you love him and care for him and want him to be happy, but you feel like the things in life that make you happy are not a big consideration for him.  DON'T be accusing.  You want him to sympathize with you, and he won't do that if he's defensive.  Tell him about how you happily sacrificed your life and career and whatnot because it made him happy, and now he's got his dream career as a doctor and you are happy for him.  But you feel like he is not at all considering what will make you happy- he's only going for what makes him happy and you feel like you're just a support system for his happiness, you want to be his partner.  And that means that now that you both are established, you make decisions as a team, so you both are happy.  \n\nIf that doesn't work, you should get some counseling...",
            "First and foremost do not quit your job or compromise anything life changing for him right now! Trust me, I have seen this (I've grown up in settings where women quit their jobs to raise kids at home etc ..my mom inclusive..)and one thing my mom has told me this day forward is at least always put yourself first because that's what he is doing! (If not always have something where you have your own income, don't fully rely on him for money..you never know what the future holds..)..first he may get you to quit your job next he is allocating where to and not to spend the money(I am aware not all men are like that)..and this may compromise you..\nMotherhood is also difficult, even for women who want to be stay at home mothers. Insist on what you want, you can have kids and have people help take care of you them.. This is the 21st century.",
            "So yea this doesn't sound like an equal relationship, certainly not one that would be healthy for raising a child. Which is supposed to involve both parents.\n\nCounseling or bust. I wish you the best.",
            "Your husband is selfish, thinks that he and his wants, goals, job and contributions are more important than yours, and takes you for granted.  I think unless he wakes us and adjusts, you’re going to continue to resent him.  I think you also believe to some extent, as most women do, that it’s your role to “be supportive” in the form of self sacrifice that would never happen in the reverse and that you hesitate to bring up those sacrifices and contributions lest you hurt his ego - while he does not hesitate to attack yours.  There are two of you in the marriage.  You both have lives, goals and wants.  He’s acting like it’s his life and you’re just along for the ride.  \n\nTell him what you’ve said here and maybe get marriage counseling.  But stop putting yourself second.  Stop giving in.  It may mean the end of your marriage but you’ll still have you and you won’t be eaten up with resentment.",
            "> he told me that I should leave my job because his is more important than mine since he “saves lives everyday” and I don’t and ultimately most people could do my job with a “little bit of common sense” whereas his is way more than just sitting at a desk all day (which I don’t even do).  \n\nThat is a HORRIBLE thing to say and it suggests that he doesn't respect you at all. \n\n>  It just seems like I’m the only one sacrificing and being selfless in our marriage.  \n\nIt absolutely seems like you are. Not to be overly dramatic but I would really re-evaluate your relationship at this point. He seems to be very self-centered. \n\nIf you were to have a baby with him and become a SAHM, I am willing to bet my right foot that he'd barely interact with the baby, continue his life pretty much as it was before kids and complain to you that you're \"not fun\" anymore when you're tired/stressed/gain weight or whatever. DON'T DO IT. I mean you have already made that (wise) decision, I just want to emphasize how right I think you are.",
            "If your husband has so many expectations and demands about his children and future life, why didn't he uh, ask you this before you got married? It's a pretty big no brainer to be on the same page about having kids and whether you expect someone to quit their job indefinitely to raise them.",
            "Hi! medical student here and sister to two siblings that took the MD track with families.\n\n&#x200B;\n\nYou're justified in your resentment. Being a physician does not give him the authority to dictate your life or career.  YOU are important. YOUR dreams are important. YOUR job is important. He sounds like he has some narcissistic traits. One of the most healing things I ever did was leave my narcissistic ex. I am not saying you should, just giving my experience. \n\n&#x200B;\n\nHow I was able to determine divorce was my option was by trying therapy. I realized it was over when we were given an assignment to try the \"welcome home exercise\" which is where you hug each other when you come home. he wouldn't do it.\n\n&#x200B;\n\nhere is my suggestion: go to a couples therapist that specializes in Gottman method. if your husband will not go or does not fully devote himself to it, well, maybe you've got your answer?",
            "The only way you stop resentments are by sharing them. Tell him clearly everything you wrote here. EVERYTHING. That's the only way you'll be in peace.\nBeast of luck. And don't leave yourself in service of others even if they are your kids or spouse. You have 1 life. You deserve to fully live it.",
            "Sometimes your feelings are just good common sense.",
            "So, end goal: compromise on the daycare. \n\nBoth of your jobs are important. You didnt tell him to quit because it was a drain, he doesnt get to tell you to quit because your kids need to be raised by you. \n\nHe doesnt get to make you a home maker if you don't want to. \n\nHe doesnt have a 1950s wife, he has you, and you love your job and want to work there.  \n\nIf you're not ready to take 6 months to a year off, then he needs to wait for a kid until you're ready to be put through that. \n\nHes being extremely sexist and domineering and if he doesnt see that after this conversation, I'm not sure what you can do to make him. \n\nBe calm, civil, and state your intentions clearly. You're allowed to walk out of the room if he can't do that, since this is your life, too and you have a brain, and a damm good one at that.",
            "You're at a dealbreaker point.\n\nYou have what you have. He has what he wants. You keeping what you have denies him what he wants. Him getting what he wants ends what you have. There's nothing in this equation where you gain anything you want at this time at all. This is all negative for you. You don't want kids. You don't want to end your career. He wants you to produce children for him and end your participation in the workforce (and, coincidentally, end your independence) to raise them. You're saying, \"I love my work and don't want to give it up to have children and be a homemaker.\" He' saying, \"Your work is unimportant. Give it up. Have and raise my children for me.\"\n\nYour resentment is coming from being disrespected. You \\*should\\* be resentful. He's not treating you like a partner. He wants to treat you like a servant, like your own wants and desires just don't matter next to his. He's not offering compromise. He's not looking for solutions. He's browbeating you and trying to belittle you into believing everything you've worked for is worthless, that you should crunch it all up and toss it in the wastebasket...\n\n...Because he wants you to.\n\nYou want to stop feeling resentful? Okay, sure, here's how you do it.\n\nYou told him no. You stick to it. And you keep to it until his ignorant ass learns to see you as a person, as a partner, as someone worthy of his respect...not his involuntary baby-making machine.\n\nGood luck.",
            "I would recommend looking into a marriage counsellor that would help you out everything out in the open, who would help you talk and not fight about your feelings and in that environment decide whether changes can be made or it is time to throw in the towel and move on.\n\nYou have everything to need to live a good life. You would be more than okay without him from what you said. It just comes down to whether you are willing to start over or willing to give it another try as long as he is willing to change his attitude and truly understand what he did/said was wrong.",
            "  \n\nSo to recap:  \n \n\n\\* You supported him through med school and whatever he was making eventually, he put towards his student loans.  \n \\* You have changed your Master’s program for him.  \n \\* He got into a residency program without really discussing this with you and you moved again for him.  \n \\* Because of this moving, you ended up in a job you hated but with it you supported him with his education/training. Any money he made he put towards repaying his student loans.  \n \\* He is now finished with residency and you have a job that you love and you got a major promotion in it last year. (yeay for you!!!)\n\nHw seems to have a very different view on what the distribution of tasks/roles should be in your marriage/life together once there are kids:\n\n\\* He doesn’t want a nanny/daycare for your future children.  \n \\* You have no family to support you two because you moved away (for his career).  \n \\* He does not want to quit his job or cut his hours.  \n \\* He expects you to quit your job or cut your hours.\n\nHe does not respect your job role in any way because he compares it to his job which, in his eyes, is about saving lives, and he thinks most people could do your job just with common sense (eehh, I bet that’s why you have degrees, right, because you could get this job just with a high-school diploma only?). It sounds like the topic of kids came up in the past and he said no because of his education/career. I think that is fair, because kids cost a lot of money and ideally you would be fairly settled and not have to up and move, let alone more than once, when they are small. However, now that your career is going really well, he wants you two to start a family.\n\nConsidering you are both 33, it is fair to really start trying for a family now. You are young enough but waiting much longer to start would be really pushing it, since, on average, female fertility decreases as we get older and takes quite a bit of a nose dive from 35 on (again, these are averages, there are women who have no issue to conceive at 40, but there are also women at 35, or even younger, who do not manage to get pregnant).\n\nHowever, I can understand your resentment because when you were ready, he didn’t feel ready. Now that he is ready, he doesn’t accept that for you it is not the best time.\n\nI think that especially when both partners have a lot going on in their lives (career, volunteering, own business, travel) having kids is never a good time. Because it will mean giving up a lot. People who don’t have much going in their life won’t feel they are making as many sacrifices as very active people.\n\nIt sounds as if he’s not willing to give up his career, and he shouldn’t have to considering the tremendous effort, sacrifice, debt, hard work, etc that comes with pursuing a medical degree, residency, to become a consultant. In his eyes, your career is ‘worth less’ because it may only have taken an undergraduate or 4-year degree to get this job, not realizing all the things you’ve learned through your different jobs, that ended up in your current position and the promotion. I don’t know what your job is, but in some ways I can understand his reasoning. Consultants/specialists are very rare and take many many years and lots of money to become. I think there are few jobs that really compare on that level with regards to how rare it is, how much it costs both wrt tuition, time, effort, commitment, and sacrifices. However, he doesn’t get to decide for you that your job is insignificant enough to give up for kids. That is something that you should want yourself and it’s clear you don’t want to at the moment.\n\nHave you two never talked about what the expected roles would be for when you would have kids? Maybe he assumed you’d end up quitting your job because you are the woman and he’s the one with a medical career. Maybe you assumed you’d both cut hours and share the responsibility for care. Did you not explicitly talk about this, and when to start a family? If you wanted children years ago and he wasn’t ready, what did you expect would come from postponing it? You are 33 now, you can not keep postponing pregnancy. Do you want children enough that you are willing to take a few years out of your job now to have children with this man? If you are unwilling to do this with him, but you do for sure want children, what are the alternatives? Divorce, and then be a 33-34 year old single woman looking for a man to basically start having a family with NOW? That means you may not find someone that is as ‘good’ as your current partner (in whatever aspect that matters to you for a committed relationship) meaning you may end up settling or childless (because you may not conceive a few years from now).\n\nYou can’t change anything that happened in the past. I suspect you two have never explicitly talked about a time line for children and who would do what, and you are now in this terrible situation. You have indeed sacrificed a lot for him and his career and he now expects you to sacrifice even more.\n\nMaybe you can send him a letter in which you explain all the major ways you’ve made sacrifices over the years. That they were sometimes very hard, but you did this because you love him and wanted to support his education and career. That you were miserable in jobs but kept them because you were the only breadwinner (even if he was making money, if all that went to repay loans, he wasn’t contributing). And now that you have found something you are good at and love doing, he expects you to sacrifice all that again to care for his children. That you wonder whether he understands all the sacrifices you made, or just thinks nothing of it. \n\nHe honestly sounds incredibly selfish, and you sound selfless. I think you need to decide if you really want to have children. If you aren’t super set on ever having them, maybe reconsider this whole relationship. Him expecting you to bend in whatever way is best for HIS career is not a good basis for a relationship. It would have been fine if from early on, you would have said you wanted nothing more than a family and would be flexible wrt his education/career. There are women who are happy in this role. It doesn’t sound like you are, but that he expects you to be this type of person.\n\nSorry L.",
            "Your husband was an adult through all those things you did right? The cleaning and making sure he had clean clothes and whatever else? People really need to stop sacrificing themselves/letting their partners act like helpless children because they have a busy/difficult career/study programme.\n\nI say this to say, you are t wrong to have these thoughts, it just feels like they came too late. Your husband showed you that he was really only concerned with his own happiness and goals every step of the way, you saw it as working towards common goals.\n\nThis behaviour right now is exactly the same behaviour he’s always demonstrated. It’s time for a come to Jesus, but because this is how he’s been all this time, you’re unlikely to get a good reaction unless he actually wants to change. But you need to talk, you need to figure out what you want, and whether or not being with him is worth continuing to sacrifice and compromises every time without getting the same thing back from him",
            "This is a major issue that was caused by a lack of planning on both of yours. He wants his career to be the focus on the relationship and family, you want to pursue your career. \n\nHe has very clearly over the years just did what was best for his career and put yours second.\n\nHe is probably confused as to why now you want to change that arrangement.\n\nHe saw all your sacrifices as part of the plan and you saw them as sacrifices that needed to be balanced out later on. \n\nI really do wish people would just simply sit down with their spouse before they are married to map out their lives together. \n\nOP's situation is what happens when that doesn't happen. Eventually, you reach an impasse when the two people reach a point where they want different things and can't compromise. \n\nIt sounds harsh to OP, but this is what his plan has been all along and you just didn't know it or weren't listening. \n\nI guess I would recommend OP sit down and map out the rest of their lives: kids, careers, retirement, ect... \n\nIt should have been done a decade ago, but here she is.",
            "I don’t think you should stop having these thoughts: they are valid. There is a monumental discrepancy between the amount that you have each sacrificed for this relationship, if he has sacrificed anything at all. And now he wants you to give up all that you’ve worked towards, a career that you have forged despite the setbacks *his* career demands caused, while he continues unabated. \n\nThe resentment you might feel now will only increase if you give into his incredibly unfair demands. You need to seek a counsellor and give your feelings plenty of consideration.",
            "What he wants sounds a lot like what my parents had and that did not end well.\n\nMy dad never seemed to understand that what my mom wanted or needed was just as important as his wants and needs. She was eventually convinced it was better for her to put her education and work on hold for a while and became a stay at home mom under the condition that they both had the same say on how the finances was handled. Which dad agreed on. Until it came down to what he wanted vs. what she needed and then it was suddenly his money that he had the right to spend as he wanted.\n\nEven though she tried to discuss the situation with him many, many times he still didn't see the divorce coming because it was more important for him to be right than it was to admit he had been selfish. She wrote him a letter about it on the request of his divorce therapist because he couldn't understand what went wrong but I honestly don't think he fully grasped it even after that.\n\nMy mom finished her studies but she never had the time to get her career fully back on track because of illness and now she's struggling financially with a low pension.\n\n&#x200B;\n\nWhat I'm trying to warn about here is: if he doesn't understand that you **both** need to compromise your wants and need now it won't magically happen later when you're trapped in a situation that can have negative consequences for the rest of your life.\n\nSort this out now with expert help or writing or whatever it takes because he will not see your sacrifices as such, he sees them as the way things should be because that what he wants. He doesn't understand and he will not on his own and you only live once.",
            "i don’t think you will get through to him, he’s way to self absorbed.   Which means he’s not going to change.   If you stay with him you’ll need to a accept him **exactly** as he is today, knowing that his behavior will only get worse.     \n\nYou’ll need to accept that you’ll be driving around in a Lexus SUV, and raising the children alone.   He’ll be working, playing golf/tennis with no time for the family, he needs to relax, you know, because saving lives.   Hopefully he doesn’t cheat, stress relief from saving lives.  \n\nIs this the life you want, the marriage you want, the role you want, then stay, otherwise ........",
            "Throw away the whole husband and go live the life you deserve",
            "The second paragraph here gives a really good description of how he's cornered you with his own preferences. If he gets everything he wants there's only one option left for you - stay home and raise children.  \n\nBy being unwilling to compromise he's making the decision for you, giving you the guise of choice which is infuriating. The resentment is understandable.  \n\nCounseling sounds warranted because this is such a big topic and you may need an objective party to help get those points across to your husband.  \n\nWishing you the best!",
            "Your marriage has never worked and isn’t working now. He has no idea how to be a teammate. You don’t have to stay married to him and you certainly don’t have to have a child with him.",
            "Not going to lie, I'm probably biased here because I'm pissy on your account. How DARE he show so little respect. Honestly, I would be pissed and would probably at least insist on couples therapy but I don't think I could get over it unless he takes a serious turn around and respects you and your job. Much less just expecting you to bend to exactly what you want.",
            "I'm currently in medical school, living with my boyfriend of 5 years. I can say I would NEVER expect him to support me financially or do my laundry all the time. I also only applied to schools in cities that had a good market for his degree, and intend to do the same for residency (and I feel guilty that he's had to move for me at all, really). Medical school and being a doctor is not an excuse to be selfish and not take the other person's wants and desires into account. Also, being a doctor doesn't make you some kind of saint with the most important job. That is RIDICULOUS that he outright has said his job is more important than yours. I can't even imagine saying that to someone, let alone when that job was used to support me for years.",
            "As I read this, I felt anger boiling up inside me. From what you've said, he is controlling everything and you're just going along for the ride. What about YOUR life? YOUR wants, needs, goals? And on top of all that you financially supported him for so long? I would be embarrassed if I was him. You SHOULD resent him.",
            "God, I would divorce, honestly. Your husband I'd contemptuous. That's a relationship killer, and your post shows exactly why. There is like, zero thought about you and appreciation of you.",
            "Don't stop resenting him.\n\nHe's being condescending, selfish, and misogynistic. You SHOULD resent that.\n\n\"It's been all about you for fifteen years so now it's my turn\" is an EXTREMELY reasonable line to take. See also, \"You're telling me that I have to sacrifice everything and you have to sacrifice nothing for something you want and I don't, and that's not okay.\"\n\nIf he wants kids, he can damn well contribute to making kids a feasible addition to your life. He doesn't get to turn to you and say \"I want kids\" and expect you to sacrifice your body, your career, your time, and your well-being while he puts nothing on the line just so he can occasionally do the fun parts and proclaim to his colleagues that he has successfully reproduced. That's not parenting. Somebody who wants kids but doesn't want to parent is just collecting trophies and you don't have to accommodate that.",
            "It's heartbreaking when you realize the person you would do anything for won't do the same for you. I've been there. I'm loyal and kindhearted to a fault. I will sacrifice myself to give happiness to others. At some point you have to stop and realize that if you don't take care of yourself, no one else will. \n\nThe only way your feelings of resentment won't get any worse is if he's able to understand where you're coming from and take your feelings into consideration. You've spent 15 years of your life giving this man everything that he's needed to get where he's at in life but he can't even show you some respect or give the same to you. I think I would end the marriage and consider myself lucky that I didn't waste any more of my time on such a selfish manipulative person.",
            "You married a selfish asshole.  I would be outraged.  Assuming everything you wrote is fair and accurate then I'm so sorry for what you've been through.  I have no idea what your future will look like but from this moment on put yourself *first.*  The past is the past and can't be changed, and I don't know if the marriage is salvageable.",
            "Any person in the medical field who describes their job as “saving lives all day” is probably a very arrogant person. There are plenty of people who could do his job as well. It sounds like you’ve been willing to change many things in your life for him at this point so he can do what he wants and it also seems like he doesn’t really care. Maybe take a step back and really think about whether you want kids with this man.",
            "Don't ruin the rest of your life for an entitled egotist who has admitted himself that he sees you as beneath him, and who is happy to make all the important decisions regardless of how they affect you, without consulting you, and without care for your life path, thoughts and opinions.\n\nHe's using you, has used you, and wants to continue doing so. Without any appreciation or gratitude.\n\nYou deserve better.",
            "Wow. The first time you say no it's like you never said yes. I agree with the others. Seek counseling OP.",
            "This is why I always advise my friends to never give anything up for or support their men. I know it's selfish but I've seen too many situations where she has been taken advantage of.\n\nYou wont stop having these thoughts. \n\nYou need to do what is right for you even at the cost of him. It's your time to be selfish now.",
            "If he doesn't want someone else raising his kids then tell him to stay home with them. This is classic doctor behavior... They think they're so important that everyone else should revolve around them.",
            "I'm a physician too and your husband it's a jerk! But like all the other physisians had commented, if you want to help your marriage, and if your husband wants to have a family, both of you need professional help. And if you tell him and he gets angry, he is crazy then. So, if he doesn't want to go, you should go, because it's causing you to feel down and changes begin with oneself. I'm not saying that you are wrong, I'm saying that with a little help you can approach this moments with the support of a specialized person in that matter. Without all the heavy charge in your back. Maybe with that help, you can convince your husband to go together at a professional. And he knows it! It's just his ego is beyond his head now, he needs to calm down. Every job is important and we people with a little sense of common know that. \nHope everything goes ok.\n\nPD: Plase don't have children with a person like that. Good parents are happy parents with a healthy relationship.",
            "You have set hours (I assume) if he wants a kid the research shows after 3 a good preschool better than a SAHM and before 3 as long as the child only has up to 30 hours a week of outside care from a quality nanny who actually cares there is no difference in outcomes than if it has a SAHM so average commutes being 30 minutes puts your husband at 14 hours a week while you do your job he’d need to cover for the nanny. If he isn’t interested in that sounds like he wants only the fun parts of progeny without the work and nobody has time for that sexist 50s bs. \n\nCompromise is important but you’ve got to learn to say no or ah hell no because he’s been going jump and you’ve been asking how high and now you have a spoiled brat on your hands",
            "I don't think he sounds very nice. Perhaps some joint therapy to chat about it all might be sensible. And hit the pause button on babies for now: lots to discuss I feel.",
            "Someone once shared a meme with me that said, \"If you don't build your dreams, someone will hire you to build theirs.\" \n\nDon't give up your job or dreams for him. You get a say in this life that is yours. Don't let him demean or look down on your career just because you aren't at the forefront of saving lives. If everyone was a clinician, then who's going to teach, to make sure the medical supplies are stocked, machines are functioning, staff are paid, patient's are reminded of their appointment, payments are processed, etc etc. All of these \"unimportant\" jobs are every bit as important. \n\nYour feelings are valid, and being in a relationship is all about compromise and sacrifices, but it's not one where one party only gives, the other just takes. You need to push back on this and consider counselling. Talk to him. Tell him everything you wrote here and make a list of your points. As it stands, it doesn't seems like he sees you as an equal partner, but someone who provides the things he needs.",
            "I think there's a difference between \"keeping score\" and expecting your partner to treat you with the same love, respect and support you treat them with.\n\nMy advice is to take a step back and calm down so that you can explain how you feel to him rationally. You're right, you shouldn't let the resentment sink in. Before that happens, you need to make sure that you clearly tell your husband how his actions have made you feel. Theres a chance that some of your emotions or expectations haven't been communicated to him cleary, but if thats the case then if you lay them all out you can both start working towards a solution to the issue.\n\nIf you've made everthing clear and he still responds negatively, you might need a more drastic solution that involves major compromises if you want to stay together.",
            "When would you like to have children and how would you like them to be raised?",
            "He sounds very unappreciative and selfish.   And im a male.",
            "Ouch. It’s painful for me to read this. I know exactly what you are both struggling with.\n\nI’m over a year separated from my STBXW, and what I will say now, is that I know I don’t need to fight over, or defend, my personal boundaries. I forgot that somewhere during my marriage. I can state what I want, and what I need, and that’s enough. I don’t need to *convince* my partner that my feelings are valid, and I certainly don’t need to tolerate invalidation.\n\nFWIW, my STBXW and I still share a full time nanny for our two daughters and it’s awesome! A Nanny couldn’t possibly replace actual parents. In fact, in my opinion, it enhances parenthood so much more. If you love your career, and he does too, it’s time for him to let go of some old ideas...again, just my opinion.\n\nI hope you two can work it out.",
            "> He also doesnt want strangers “raising” his children so he doesn’t want to put them in daycare or have a nanny when we have them.\n\nOh that's great, so he'll stay home to take care of them then?\n\n>He also doesn’t want to quit his job or go down to part time in his job to take care of said kids, but he expects me to be a stay at home mom.\n\nlol, nope.\n\nI wonder if you have had a misunderstanding in this relationship - you saw yourselves as being mutually supportive equal partners, and when you made sacrifices for his career it was in this mutual context where the understanding was that he'd do the same if the situation were reversed, whereas he saw yourselves in a hero-sidekick relationship where you acted as support for his goals because he was more important, with the understanding that he always would be more important and thus you would always be in a supporting role to his goals.\n\nTell him that stay-at-home dads are heroes too and that being a parent is the most important job he'll ever have in his life!\n\n>How do I stop this from happening and how do I stop feeling this way towards my husband?\n\nIt seems to me your feelings are reasonable responses to a situation that justifies them. You stop feeling this way by not being in that situation anymore. Put your foot down on the children thing first, because you don't want to have any before this is resolved. Then figure out what's up with your husband - is he reflexively working from cultural scripts without having deeply thought about them and their implications or realized that they are unacceptable to you, such that he can be made to come around, realize how disrespectful he is of your life choices and be better? Or does he actually not respect you? In the former case you can fix things, the latter not so much.",
            "You are completely justified in resenting him. He needs to stop being a selfish asshole. Marriage is a partnership. Sometimes you have to sacrifice for your partner but that is a two way street. You cant be the one always sacrificing your wants and needs for his. You have done so much for him and yet he wants more and he doesn't take your wants or needs into account. You need to stand up for yourself and have a conversation with him and how you feel. YOU HAVE THE RIGHT TO BE HAPPY AND GET WHAT YOU WANT OUT OF LIFE ALSO! If he doesn't understand where you are coming from and doesn't make an effort to change his selfish behavior then he never will. People can only do and give so much without receiving anything in return.",
            "I think you guys should do marriage counseling, and it sounds like he's never been appreciative of everything you've done. He sounds very selfish to me, but you're the one that lives with him and knows him. Be honest and continue having tough talks and work through the issues if you can.",
            "it sounds like he's been able to be completely selfish through med school and residency because he really didn't have to worry about anyone but himself. he had you do do everything for him (pay his bills cook his meals wash his clothes emotionally/mentally support him) and never gave anything back to you (not even when you lost a loved one). He's learned to be selfish in the relationship because that's the only expectation that has ever been set. It would be really hard to change that now, especially since he sounds like he's also turned into an incredibly condescending, arrogant asshole. If you did decide to have kids with him, does he really even sound like he would make a good father or a supportive partner? He basically expects you to quit your job and raise the kid by yourself while he continues to focus on himself by dedicating all his energy to his job. This really doesn't sound like a give and take relationship. It sounds like he only wants to take and that's incredibly unhealthy. You are completely right to be having the thoughts you are having and you've handled all of this way better than most people would which clearly shows you love the guy but it doesn't sound like he's willing to be an equal partner to you and if that doesn't change the relationship will never get better, it will get worse, and these feelings will never go away, they will get worse too. He needs a reality check and some couples counseling before I'd even consider staying in a relationship with him, never mind bringing kids into it.",
            "How do you stop resenting your husband? By standing up for yourself and insisting on an equal say on matters in the marriage. Make it clear that the deference he receives at work, the responsibility he is given over people's lives ends when he comes home. It doesn't make him an authority and decision maker of all things. Demand he show you the same respect he expects from you.\n\nIf he can't handle your assertiveness, it might end -- but if you don't assert yourself and you let that resentment grow, it will end eventually anyway.",
            "Thank god you have a career! Don't do anything to give it up. You're gonna need it.",
            "Hey just as a kid who grew up with nannies, then nurseries and then after school care when I moved up to school age so both my parents could work- turned out completely fine and was never bothered by it. It was just my normal, and my parents made sure to put aside time when they had it (evenings, bed time stories, weekend activities, holidays, etc) to spend with me. So if you do go the childcare route you'll be fine! And I've always admired my mum for being so hardworking and intelligent (now my dad works part time and my mum is more 'the breadwinner')\n\nBut as everyone else is saying, seriously consider if you want to bring kids into a situation where you don't seem to be seen and respected as an equal partner- kids are a huge responsibility and it would make everything so much harder and more complicated. Make sure you're happy and be as selfish as you need",
            "Thats tough and he sounds snobbish about being a doc which is a stereotype of them unfortunately. You mention your age, 33, so you may be at the end of a chapter of your life whether you like it or not. It boils down to income and lifestyle...and the big one, you can bare a child, he cannot.  Seek some counseling and make sure he understands he shouldn't be a bulldozer if he wants to be a father...becoming a mother will change your motivations and goals. It is truly a wonderful experience and a better more fulfilling one than a career. You can pick up your career afterwards, it is good that you have established one now so you have something when the kids grow up.  Look on the bright side of life, you have many blessings that the majority of people on this earth do not and will never have...",
            "As a medical student debating leaving the field, it’s people like OPs husband that pollute the classroom. Stuck up, narcissistic, think they are better than others. I vowed to myself I’d never marry a doctor after being in med school. The culture reeks of narcissism and dominance. \nTo OP, idk if you’ll read this because there are so many comments here. But, you are WORTH it. There are people in the world who think everything revolves around them. And your husband needs some sort of reality check. If he’s unwilling to compromise you know best in terms of how to move forward. \nAnd don’t docs have high divorce rates? Probably because med school attracts a certain “thou is holy” type and churns them till they have to believe they’re some holy shit because they’ve endured all this hazing/ abuse from other attendants/residents. Good luck! I wish you peace.",
            "Sounds like you did a terrible job selecting your mate. Leave him",
            "Your anger is genuine and a sign that your wants/needs are not being met.",
            "\\> When I brought this up he said I was throwing it in his face and making him feel guilty for wanting to pursue his dreams.\n\n&#x200B;\n\nLMAO???!?!!?\n\n&#x200B;\n\nbut in all seriousness, trying to suppress your resentment will only make everything worse. you need to say everything you have to say to him and talk it out \\*if\\* you want to save this relationship... if you dont say it he will never know and your resentment will only grow bigger every day. honestly though, i would recommend taking a break from each other at the very least. some distance can be very healing in those moments and it might show you if you even want to be in this relationship anymore. also, be prepared for him to hold on to his (unreasonable!!) opinion, then break up and as soon as he has a new girlfriend he will treat her with the respect you wanted him to treat you with. ive seen it lots of times and ive experienced it myself and it suuuuuuuuucks but boy am i glad i didnt waste any more time with that guy who could only be arsed to listen to me after i left and give everything i ever asked for to another person cause he wouldnt have learned the lesson if id stayed with him. it honestly happens more often than you think",
            "You *should* resent him. \n\nI’d be mad as hell too. It wouldn’t hurt to consider kicking his narcissistic ass to the curb. \n\nCounseling is a good idea in theory, but if he thinks psychiatrists aren’t real doctors, you’re never going to get him to an appointment. If, by some miracle, you did, it wouldn’t do any good. \n\nI was once married to someone with the same shitty attitude as your husband. I was there to make him look good. And I was good at it. But it’s not fulfilling or sustainable. Adding children to the equation makes things a million times worse. Coupled with the fact that he’s a MD. You have the patience of a saint.\n\nBottom line? If you ever want to be happy for real, it isn’t with this guy.",
            "Girl, come join us at r/medspouse or r/partnersinmedicine\n\nI’m also somewhat resentful being married to a physician. You really do end up sacrificing everything for their career. It’s why we have our own support subreddits :)",
            "Holy crap. This sounds like me from an alternate universe. \n\nLet me tell you, if you let resentment go on for too long it's really hard to come back from that. Once I really realized that my sacrifices were in vain I hit a breaking point and just gave up. I no longer sacrifice anything I want for my husband and I'm a hell of a lot happier. I had the conversation with my husband and told him how I've given up and that we can continue to live our lives but I'll no longer put the effort I once did with a man who wants me to build my life around him instead of building a life together. It took a few months to get that across to him. Many fights and many discussions but things have gotten better. We just do our own thing the majority of the time.",
            "I'm sorry OP.\n\nYour title is \"How do I stop resenting my husband?\" but, surely, you must realize: the problem isn't you, it's him. Anyone who is not a complete doormat would resent someone who so completely dismissed what they value, who didn't care at all for what they want.\n\nAt the very least, you should demand counselling; but from your comments it seems that there might be nothing to do other than divorce.\n\nI wish you the best.",
            "This is exactly why I do not like doctors I've had many of them and most of them are like your husband. I couldn't imagine being married to one I am sorry for you. In fact before I had health issues I dated a few doctors and thank God they didn't turn into long term relationships. \n\nUnless he sorts his attitude out i can see this ending in divorce unless you relent and become dead inside or resentment will eat you alive otherwise.\n\nHe is the one who needs to change. Not you he now needs to accept that you will still have your career if you have children or he goes part time because you won't be giving up yours if he won't accept any of this then this is what divorce is for.\n\nI feel angry for you just reading this. I really hope it works out for you don't give up your career it'll ruin your life.",
            "the story you told demonstrates that your husband has a complete lack of respect for you, either amnesia or gobsmacking entitlement about the support you've given him, and quite frankly, abusive tendencies, given the way he deployed manipulative, denigrating and disrespectful tactics to try to get you to do what he wanted. These are very serious red flags. Its easy for an stranger on the internet to say so, but this is bad news. my number one piece of advice right now would simply be DO NOT GET PREGNANT WITH THIS PERSON and put a moratorium on any sex that isn't protected X2 at least until you figure out how to proceed with his issues of disrespect, entitlement, and manipulation.",
            "So it sounds like for the duration of your marriage, he has been the one dictating the terms unilaterally. And now he expects things to continue being this way (naturally).\n\nThe only thing that's changed here is that now you've found something important that's worth it to you to fight for. \n\nI don't know what to tell you, OP; it's clear it's not your fault that your husband is such a narcisissitic asshole. But what's clear is that he isn't really doing anything out of the ordinary, and at any rate this \"fight\" and these thoughts you're having are overdue by a few years. \n\nForget the \"score\". It sucks that it happened the way it did, but that's life. \n\nWhat you need to consider now is what exactly it is that you want out of your life or your marriage. It seems you're not willing to sacrifice your career one more time just so that \"things\" (meaning the rearing of your children) are done in the way your husband wants them to be. That's absolutely, completely fair and normal of you to want to.\n\nWhat I don't think you realise is that you hold all the cards here. He can't have a baby without you, and you have all the power to prevent a baby from being had. I'm willing to bet he would be tremendously unhappy if his \"family\" suddenly fell apart. I don't know about you; I suppose you're not ready to divorce over this, but honestly, I'm not seeing exactly what you're getting out of this relationship with such a controlling husband, who doesn't see you as an equal partner, doesn't respect you, and doesn't care for your happiness.\n\nMaybe that's just me. \n\nYou have some though choices to make, because I have a feeling this is not an issue your husband is willing to budge on. You made sure for the last few years that he learned to expect to always get his way, even if it came at the cost of your own happiness.",
            "He sounds like a total narcissist who wants kids for all the wrong reasons. I would never inflict such a selfish person on children, he's entirely self-involved, he belittles you and takes advantage of your love and kindness, who would drag children (who can't consent or choose) into that situation if they had any ethical compass? Where is your say in their care and education? Where is their choice considered?\n\nYour career was good enough for him when it paid his bills and gave him the opportunities he has today, but *now* it's worthless?! This goes beyond typical \"marital issues\", he is belittling your education, experience and capacity as a productive member of society. The same productive person that gave him the ability to get that fancy degree in the first place.\n\nDon't stay with this person, he doesn't value or respect you or your future children. Make sure your birth control can't be impacted by his medical knowledge or access and stay childfree until you find someone who would make a suitable parent. \n\nCheck out r/RaisedByNarcissists because that is the future your children face with this man as their father. He's entirely self-important and has no concept of the best interests of the child or empathy for you. He's trying to make unilateral decisions based on some imaginary concept of what having a child looks like, it is totally unrealistic and fails to take into account the child's individual wants and needs, nor the necessity for education and support to come from outside the home (especially if they'd be trapped with *that* kind of father).",
            "My husband is a giant egotistical asshole, how do I stop feeling negative about this",
            "Seek a good devorce attorney. He used you to get what he wanted and now on his high horse looks down on you. If you have to move on do it now, before kids come.",
            "My dad has a PhD and my mom didn't even finish college.  She always stayed home with we four kids, ran the home, and even home schooled us.  She never really had career aspirations but did work for my dad's company off and on when the kids were older.\n\nMy dad NEVER steamrolled her in decisions, expected her to always compromise/sacrifice, or disrespected her.   Respect for mom was paramount in our house and my dad led by example.  There was never talk about dad's \"great career\" vs mom just staying home.  He praised her, supported her, encouraged her, made sure she had time for herself and her interests, and told us that she held our home and life together and was the hardest worker among us.  He credited HER with his achievements and always acknowledged how he couldn't have done it without her, while simultaneously bragging about all her own achievements.\n\nYour husband is a selfish, ungrateful ass who doesn't see you as an equal, let alone a person to brag about.  \n\nI hope you realize that you are worth more than him...more than being a supporting actor whose name isn't even listed in the credits of his life.  He has failed you and you deserve so much more.",
            "Sometimes alimony as a concept rubs me the wrong way, but this is one of those situations where it's completely warranted. You supported him for years, if he decides you're just a nanny now and you leave as a result, then you should be entitled to the big doctor salary you helped create.",
            ">  I dealt with my father passing away on my own because he was unavailable due to his training.\n\nThis is so fucked up and glaring. You have always been there for him, he's never been there for you and doesn't think he has to be.",
            "he wouldn’t be “saving lives” (🙄) in the first place without the DECADE of financial and emotional support you provided him hand over foot. jesus christ. his audacity to happily live off your salary throughout the duration of med school, and then demand you stop working to care for your theoretical future children at his pleasure? nah. nope. he needs to either be willing to provide childcare himself (interesting how a medical degree doesn’t vanish if a doctor takes a couple years off!) or get over his illegitimate fear of hiring highly qualified caretakers for any future children. let me say this again: your husband DOES NOT have the right to dictate the trajectory of your career just because he wants to reproduce. there are many ways he can compromise but he is refusing to budge on any of them, and that’s ridiculous. frankly, what you’ve described speaks to his capacity for empathy as a partner and, terrifyingly, as a physician. i am so sorry you’re going through this OP, but please stick to your guns. you’re in the right here.",
            "It sounds like he is hopelessly, despairingly, intensely selfish. Get into therapy and tell him everything you put in this post. See if he can pull his head out of his ass. Because right now it sounds like you were created to meet his every need in life without second thought and he's shocked that you are finally pushing back. Like, are you even a person/life partner for him? Or his help meet and now baby factory?",
            "Two questions: 1) Was there ever common ground or a discussion on who raises the children when that time comes? 2) Does he know how much you value your career? The situation of one person quitting their job to raise kids is not a new one. It sounds like he does not truly recognize the weight of your sacrifices on your guys’ current standing. It also sounds like he does not know how much you truly value your career. Emotional validation seems lacking and too a source of significant friction. Have any affectionate “thank yous” and other similar supportive and validating statements ever been conveyed by him to you throughout this journey?\n\nWith all that in mind, I have to say that there seems to be a lack of communication on two critical things: First the degree to which you value your job and how important it is to your sense of fulfillment, and second the entire dynamic of having kids. Either these conversations were already had and your views were clearly articulated, or he doesn’t care, or they were held (or at least tacitly understood) but both of your value systems have since shifted course to a pretty significant degree and are very different from how they were during the time when he was in residency. The friction may be arising out of an inherent realization by you and him that your respective visions together may have diverged, and stems also from a lack of emotional validation by him to you.\n\nWere you willing to quit before but have now advanced far enough in your expertise/position/capabilities to where your career is more important to you than a few years ago? If that’s the case, then your guys’ values have definitely changed. When you wanted kids back then, was there ever a discussion on who will raise the kids once that time comes? Has your career always been this categorical to your life goals and fulfillment? The relationship has a “cross that bridge when we get there” feel over very major things (kids and careers). \n\nNow, if the salary difference is like 300+, it’s not beyond comprehension to propose what he has asked for but the problem here is that he can’t just suddenly walk up and be like “ok go-time quit ur job for kids, les do this” if he has no idea what your career vision is and/or has not at the very least been truly emotionally supportive of you (hence resentment). He didn’t mind the stability you provided throughout his training, and now that he’s done, he has this lucid vision for how the future will play out. These things need to be 100% crystal clear from the beginning of a marriage and any shifts in course are only going to be as seamless as the extent to which you guys are emotionally supporting one another and functioning as a true team.\n\nWhat needs to happen: He needs to realize how important your contributions have been for you to get to this point together. There needs to be an assessment of who raises the kids. He needs to know 100% where you stand on your career 30 years from now. He needs to be emotionally available and validate you in every sense and vice versa. Do not live another 30 years together with the approach that got you two to this point.",
            "Your thoughts are provoked by action or lack of action in this case. Where you were flexible and understanding, the other party(husband) is not budging from his stance. This is a deeper issue than career choice and opportunity. He may feel threatened by your economic growth and independence and maybe too stubborn to articulate it so he makes up excuses like hes saving the planet. Its a basic double standard. Its very unfair and everyone should know that he is in the wrong.",
            "The top comments are good.  I just want to add that probably the expectation is from him to do very little child rearing.  This would be extremely hard on you.  I have two young kids and every day is an exhausting struggle.  They are up for 14-16 continuous hours every day and you get very little adult time.  If you have no support network, and you have no real husband, then its going to be very hard.  Take a look at /r/parenting to see all of those horror stories.",
            "You shouldn’t stop having these thoughts. You should honor your self by addressing the  frustrations and emotions, not suppressing them. You’re entirely justified to feel the way you do. While you supported him unconditionally, he didn’t do the same for you for years. You’ve gone above and beyond to take care of him, he hasn’t done the same for you. You’ve been his cleaning lady, caretaker, maid, therapist, etc. Has he done the same for you? Would he? \n\n\nYeah getting an MD is hard work, but that doesn’t invalidate the hard work you’ve put into your own career. Your careers are just different and that’s it. Your job is important to *you*. *Your life is just as valuable as his*.\n\n\nHe’s using his MD as an excuse to demean you and ignore your needs—he’s been doing that for a very long time. It seems you’ve reached your limit. You have the choice to go to counseling with him (if he says no then that tells you he doesn’t value you), or simply leave him. You deserve to be with someone who will cherish you as much as you cherish them.",
            "I feel strongly that couple's counseling would be helpful.",
            "Marriage counseling bc he seems extremely selfish. He is not being a loving and respecting partner too you and you don't deserve it at all. You probably need to go to counseling if you want to save the marriage bc he can't expect you to give up what you want or your dreams bc he wants things a certain way all the time. He is going to have to realize that you want to keep working and that the kid is going to be taken care of by \"strangers\". He can't get everything his way all the time and he needs to realize and respect that you have dreams and wants too.  Stand your ground on this one, don't let him run you over.",
            "You shouldn't work through resentment that is based on him disrespecting you in such a fundamental way. \n\nI have to ask though: Did you know of his conservative ideas of women as house wives, or did this just come as a surprise now? \n\nWill you be able to live with someone who is indifferent to your needs and dreams?",
            "You should resent him cuz he deserves it. You, like a lot of women, sacrificed your life for someone else and he takes you for granted. Hes a jackass plain and simple.",
            "He's being controlling. He's disrespectful of your career and dreams and of *you*. He doesn't view you as being a partner in this relationship just someone who is less than him. Who gives a fuck if he's a Dr? I'm a nurse and earn more than my husband, does that mean that his dreams and sense of worth is less than mine? No! He sounds like an asshole and most of the people who work with him probably resent him.  \nAsk yourself this. If your bestest friend was going through this what would you advise them to do? Without you he wouldn't be where he is today, YOU did that, YOU were the breadwinner and now he wants you to become a Stepford wife? This isn't 1919 where a wife has to stay at home and care for baby while her clever husband is out saving the world.  \nGet some counselling for yourself, if he don't change then you need to decide if you can be in a marriage where you don't matter to your partner.",
            "I’m not saying you should leave him. \n\nBut if it comes down to it, don’t let the sunk cost fallacy keep you around. \n\nIt seems like he treats you like something he just deserves to have without doing anything to make himself deserving. \n\nFrom this perspective it sounds like you’re an achievement that he’s unlocked, and now he gets to continue his journey as he sees fit. \n\nNotice that I said something, and not someone. \n\nIn his mind, he settled down with you before he was “successful” and you should be grateful to be there in the first place. \n\nYou absolutely need to correct this mindset if you want to have a happy relationship. \n\nGood luck.",
            "I agree with a lot of comments. He really seems to hold himself highly. Which to me is such a turn off. Especially since you supported him for so long regardless of what you wanted. In a lot of relationships there's a giver and a taker. It's definitely NOT healthy but ends up happening a lot. And you are obviously the giver and the one who sacrifices what you want/need for your partner. And he's the taker where he lets you sacrifice while he gains. This dynamic is NOT good. Combined with his self righteousness...not good. I would suggest marriage counseling. But you are 100% valid in your feelings. Relationships should be 50/50 effort. He's not putting in the effort and so you feel resentment towards him. Either you guys go to counseling and he sees where his flaws lay and tries to change, you decide to just deal with it and stay in an unhappy situation, or you divorce.",
            "I do not think you should stop resenting this. IMO, he is in the wrong here and being completely inconsiderate of you, your feelings, your dreams, etc.  You shouldn’t have to give up everything to make him happy. That’s not how healthy relationships work.",
            "He wouldn’t have his lovely important job if you didn’t find his sorry ass while he was studying for it. Your husband sounds horrifically selfish. He’s always going to be the main character, while you get to pay for his expenses and start popping out kids as soon as he demands it.\n\nCounselling at minimum but he doesn’t sound like a great partner at all. Does he have any plans to pay back all the money you’ve invested in him? Or is his idea of that making you quit your job and start breeding, & looking after his spawn full time? Cause you are gonna get exactly zero help. And since homeboy has never supported himself in his adult life, what happens if he gets stingy as soon as he controls the money?",
            "He sounds so narcissistic talking about how important he is and comparing it to your career. It sounds like he's only been working toward what he wants and not what you both want for your lives together or your family.",
            "Reading your story made me sad because of just how unappreciated you are by your husband. If anyone should be changing how they feel it’s your husband. You have gone above and beyond for your relationship and your job is not less important than his for a) you care about it and b) it’s the only reason he has his. Having kids is something both of you should be ready and willing to make sacrifices for. I know if you bring it up again it will lead to a fight again but I see your point of view and he should too. \n\nSo in conclusion the only advice I can give you is to talk out your feelings with your husband perhaps in therapy so that there’s someone else and it doesn’t lead to anger and having those feelings be unheard.",
            "If he wants a baby and doesn't want it \"raised by strangers\", he can stay home and raise it. His career will still be there after, right? If he's asking you to make a sacrifice that he wouldn't, you don't really have a partnership, you have a parasite.",
            "Being a stay at home mom is really lonely and stressful and not something you should do if you don't want to.  You will be miserable.",
            "33M, physician here.  I am still single (in a relationship...just not married yet).  I have never had to personally experience this, but being the non married guy through college/med school/residency/early career I have witnessed a variety of different dynamics when it comes to physician's relationships.  \n\nThe ones who are in long term relationships during training.  The non physician supports the person through training and when the physician finishes, that person either stops working or works much less.  Most of the time, this has been agreed on for years and there are no fights.  Also FYI, I know at least as many couples who's husband was the one who quit their career so I don't think this is necessarily a \"sexist\" thing.  \n\nAnother group are the couples who both have \"important\" careers.   This is a lot of time 2 physicians, but could be anything.  (I am using the word important in the sense of \"important to them.  I am not trying to get into the pissing contest of who has the more important job).   Sometimes this works great with each making their own sacrifices, but at the end of the day each respecting what the other does.  \n\nSometimes this does not work out so well.  They are not willing to sacrifice for each other and their respective careers end up being more important than the relationship.  This never ends up working out in the long term in my opinion.\n\nI get it that so far you have been the one to sacrifice and certainly it sounds as though it is his turn, but I would think of it in simpler terms.  Both of you have careers that you find important, but at this point neither of you are willing to sacrifice what it takes for the relationship (at least in the eyes of the other person).   I would try to keep the discussion focused on this.  Pulling out some sort of list of things you have done for him up to this point is only going to start more arguments.  Just tell him your career is important to you.  You want a family, but are only willing to do so if you can continue your career.  If he is not willing to discuss a way forward with those terms, then I don't think you guys have anything left to talk about.  You are 33 with a good career and no kids, there are other fish in the pond who are more than happy that you work.  He's 33 with a good career and he can certainly find plenty of women who will stay home and raise kids.   I have several friends who have split up over this or are still together resenting each other when it is clear they would better apart.",
            "Run. Run screaming. Once babies are in the picture, women married to *well-meaning, equality-minded, feminist* dudes so often discover a huge disparity in caregiving work that our collective rage has been the subject of at least three books this year (All The Rage, Rage Becomes Her, Fed Up). A man like this? He will do zero. Zero. And you will be so lonely and angry, OP, I think it might feel like a permanent emotional beaching.",
            "I'm coming in late, and this probably won't be seen, but you need to end this marriage. Quick. You can try therapy, but I doubt he'll go.\n\nHe's used you to further his career.  He unilaterally decided to make you change your career path, then moved you to a place you hate and made you leave your dream job. \n\nYou supported both of you, at a job you hated, while all his money went to pay back HIS loans. Now that he's working, and you have a job you like again, he wants you under his control once more.  He's decided the way to do that is to make you have kids, so you stay home and lose that job.\n\nGet yourself doubled up on birth control, and maybe even an IUD - because I can guarantee you he'll sabotage any condoms and pills to try and get you under his thumb again.\n\nRun, don't walk - and listen to your inner voice that's telling you what you need to know!",
            "The only way you'll stop resenting your husband is if he steps up and recognizes you as an equal and a partner in this relationship. Your language about stepping up and not keeping score sounds so much like me with my ex. The truth is honey you don't need to keep score but sometimes you do need to take stock. You may be afraid of the answer but I'd ask your husband does he think because his career is supposedly \"more important\" then that means he is too? Is he giving you the life and the partnership he promised in his vows? All I know is you sound like an incredibly hardworking, patient, and capable woman who why good man would be over the moon to have. You should be proud of what you've been able to accomplish while also bolstering another demanding career and moving.",
            "At 33, you should both have thought about having kids like yesterday. Birth defects and all that.. anyways, I think kids and money are two things people should agree about before they get married, but whats done is done. Maybe you guys don’t belong together after all.",
            "You have invested your time, health and money into him and this relationship. You have every right for him to acknowledge and honor this.\n\nIf I were in your position I would sit him down and have a frank talk about this and your feelings towards him. \n\nThis is the only way to potential salvage your relationship with him",
            "Obviously in the pursuit in his career he has been quite selfish. In his other actions over the past 15 years has he been selfless and giving? Does he go out his way to know what makes you happy, and then choose to act in a way to make you happy? Is he eager to compromise?\n\nIn addition do his actions suggest that he respects you? Do they suggest that he views you as an equal? And please rely on his actions and not his words when thinking about this. \n\nMake it a great day.",
            "Op should tell her husband that she saves his ass and which in turn she saves all his parents.",
            "It sounds like you guys neglected a large number of serious conversations that should have been had before you ever got married - I'm guessing because you were so young. \n\nUnfortunately, what you guys want doesn't line up and honestly you should have left a long time ago based on all the sacrifices you talked about. The kind of disrespect you describe - him saying that he's more important than you and his work is more important than yours - I don't see how that can get better, even with counseling. Counseling only works if the people being counseled want to change. It sounds like your husband is pretty damn proud of the person he is currently, given his hero bullshit about \"saving lives every day.\"",
            "Let him read this post and all the answers. You are fully entitled to your opinion which I support.",
            "[deleted]",
            "You worked HARD to get where you are. You supported HIS dreams and even made sacrifices for Him. I mean if this man doesn't realize what a gem you are!",
            "He sounds like a selfish, narcissistic asshole. And you are completely understandable for having these feelings. Stand your ground and make him give you your 50% of the relationship back. Resenting him? Maybe get therapy—either alone or together? And have a serious conversation about if you two are on the same page for your future. Right now it really doesn’t seem like you are. Get that career you want, lady. Stop letting him push you around.",
            "You know, people often times does not really grasp how much someone has done for them. Then he comes around and belittles what you do, telling you to put your lifeplans on halt again. My sister dated a doctor and he didn't reallt care about what she wanted. It was all him and he didn't take her into consuderstion much with mamy decisions he took. He always came first and this whole thing about him \"saving actual lives\" is just him blowing hmself up like a pufferfish. Yeah, kudos to you that you managed to make this happen, BUT YOU OP basically was the foundation for his success. And he does NOT see that. Then is demanding you to out your life on halt",
            "If you're not ready to have a baby than you're not ready.  \nDon't let him bully you into getting pregnant. \n\nAnd I dont agree with daycare BUT I feel that he should split the child care with you because as much as he says that \"saving lives is more important\" there is no life more important than his child and if he's so concerned with the caretaking of it, he should deal with it when your time is up.\n\nYou tell him it takes two BABY and you still have to carry the darling and (hopefully) natural child birth.",
            "[deleted]",
            "I think you could benefit from talking to someone.  You are valuable and your thoughts and desires are valuable and a therapist can give you tactics for managing this very complicated and stressful situation.",
            "You've really tried your best if he can't respect your decisions then it's best you leave him & RUN!!! RUN!!! RUN!!!",
            "You’ve been in a one sided relationship the entire time. Why are you so surprised you are in one now?",
            "You should have said all those things. You can also say them in a marriage counseling session if you prefer. But for both your sakes and your marriage they need to be said",
            "Even though hes saving lives he wouldn't be a disappoint with out your help, For him to think this way and talk to you this way  Is hurtful and now that he has the job of his dream he wants to abuse you don't take this post should from him a move on with your life",
            "The best relationships have a foundation of respect. If he doesn’t appreciate all you’ve done and respect all you’re capable of, then I’m not sure you’ll want to have kids with him if/when you are ready.\n\nWould you be less resentful if he respected your work? If he was appreciative and thankful and humbled by everything you’ve done to support him, I suspect you wouldn’t feel the same resentment even if you haven’t been able to pursue your goals in the same way he has.\n\nYou are not an accessory. You must always be the main event in your own life.\n\nBeing pregnant and having children will require a lot of sacrifice regardless of how dedicated you are to a career.  And that affects both partners.",
            "Definitely need counseling. You do not need to give up your career for kids. A nanny or daycare is quite good for kids, and your husband needs to realize you're not going to just be a sahm for him.  He sees your job at just a paycheck, that now you don't need, and has developed the attitude that only doctors have important jobs. You need to have conversations about what you want and need in life.",
            "I’ve dealt with the same issue in my marriage early on.\n\nThe key for me was leveling the playing field and humbling him. Everyone is smart and important. We have wants and needs specific to us, and in our relationships we deserve to have them fulfilled as equals. Sometimes that means compromise, but never willful neglect.\nWhen you marry someone, you are both agreeing to take care of one another. That “care” is usually something we make up in our mind based on our perception of the world. And, many times it’s not suitable for another person. That means we have to be open and talk about our wants and needs, and also listen wholeheartedly. In a relationship, you should want to see your partner happy, successful and thriving. So, if they communicate what they want, you should be amenable. \nBut, not everyone is so flexible, and I’ll get to that below. \n\nFirst, you should tell your husband the things you’ve been thinking. You worked very hard while he was working very hard. You spent hours of your time struggling to make money, study, and deal with what came in life so he could focus on med school. Neither of those things would be possible without you both. If you wanted to be together and he wanted med school that had to happen. He should see you as an equal in that struggle. You need to tell him, and also make note that he should never belittle you or your efforts again. You are his partner, not a dependent.\n\nJust because you aren’t a doctor doesn’t mean your job isn’t important. Whether you sell hot dogs out of a van or are a nuclear physicist, if your job makes you feel successful and fulfilled it is important because YOU are important. Your happiness is key here. All of the time you spend are hours that matter. Chances are too, that you are the lead in this relationship. You likely clean or cook, and make decisions about where to be when. You may also be the emotional raft in the relationship, keeping up his needs for intimacy. He is seeing you as beneath him, yet you do as much. Your time and effort are equal to his. Things need to be leveled. \n\nBack to the flexibility. When I had this blow-out with my husband, he was amenable. He tends to tuck his ego away in arguments with me, because he sees me as an equal. We had to work on this though. When we started our relationship, I said I needed honesty and communication. If he couldn’t give me that I’d leave. It took a while for him to learn how to communicate, really. He had to be open and thoughtful in ways he’d never been. It mattered to him that I was happy, so he pushed. We had many fights, it was tough but we both wanted it to worked so we kept going.\n\nIt could be hard for you to level with him if you don’t have an open channel of communication. He may not want to go that far because he doesn’t perceive value in what’s not already in his head. He might try and brush it off. He might fight, say you are nagging, or say it’s not important. He may be very comfortable in the relationship now if he hasn’t had to compromise much.\n\nIf any of that is true, you need to push. You have to become an equal in his mind. You need to openly communicate how you feel and figure out what’s best for both of you. You both need to value each other’s needs/wants.\n\nSome questions to think about:\n\nHave you and your husband talked about your life plan? What you both see as important, and what the timeline is for it all in your head?\n\nHas your husband talked to you this way before? What have you done when he’s said or insinuated stuff like this?\n\nHave you made clear the importance your career holds for you? Amongst other needs/wants you have?\n\nDo you communicate well and often?",
            "Not healthy. You need a doctor... a real doctor! Not one that plays the looking down game. Huge marriage counseling time or this ship will sail to very murky waters. No way to have a child with another child!",
            "I was fuming throughout the whole post. Don't even consider sacrificing your career for him. Wtf you are a great spouse and you should grow a shiny spine and double down on your needs.",
            "If this dude is not able to help his wife he will not be save any lives he does not  Need counseling",
            "Your husband sounds like an entitled asshole. Sorry.",
            "Your husband sounds awful. Why have you stayed with him for so long?",
            "I am at a loss of words. You gave up everything to support him. Now he decides he wants a child and you should give up your career to be a stay home mum. I am afraid you have been sacrificing but he seems to think you were supposed to do it. Now asking for more is like a new normal. \n\nI would seriously reevaluate the relationship. Even after you have contributed its never too late to leave. I don't see why you need to put up with this.",
            "Sounds like this incident is the straw that broke the camel’s back. Right now you are resentful because you finally reflected on what you both have contributed and sacrificed in those relationship. \n\nSounds like you need to settle down with your emotions and have a talk with your husband. He has been spoiled by your sacrifices and if you both want to save this relationship, it’s time to lay out both your expectations and how to compromise.",
            "Sounds like you turned into his mom instead of his wife",
            "You have a husband, not a partner\n\n\nAfter all the things you did to support him, I got upset on your behalf when it came to January 2019. He can get over \"strangers\" (aka paid professionals) taking care of his kids, since it sounds like he's not going to do it. There were so many better and more empathetic ways to handle it but he just went straight selfish each time. \n\n+1 on counseling, because ultimately it *does* seem salvageable but it's going to require a lot of effort on his part",
            "It may be time to go separate ways. The desire for a child isn't going to go way and he'll end up resenting you for it. Im a stay at home mom and its so much work you have to give up a lot and you really have to want it. I think if you don't want it you'll end up vary unhappy. Also you said when you both worked you cooked and cleaned i would be afraid of this you could end up a domestic slave if you don't watch out.",
            "A relationship is supposedly to be made of compromises, not of sacrifices.\nIt sounds like you could have such a great carrier and life, and that you're wasting all that for someone ungrateful who does respect and value you. He's literally imposing you all your life choices, despises your work and demands that you become his little stay at home wife/slave.\nMaking the right choice for your happiness will never be selfish. I would be you I would run away.",
            "Just NO! Congrats on your accomplishments and everything you did for him that he isn't acknowledging. It's not ok of him to think he's 'high and mighty' cuz he saves lives, it's selfish. I see this going two ways:therapy (it might help) or packed bags and a big divorce announcement. Don't give in anymore.",
            "This doesn't change that he's being an ass but I want to correct one detail:\n\n>When he graduated, he got a residency in another state (and barely even consulted me about it before he applied and interviewed and decided.\n\nAbsolutely no one gets the luxury to just apply where they want. Residency is a different animal and you MUST apply everywhere so you don't short change yourself. An automated lottery system will match you to one place and one place only after all your interviews. Had your husband not applied broadly, it's very like he would have not been placed in a residency, then he would have been xxxxxx amount in debt AND with no residency, because each residency has a limited number of spots. \n\nAgain this doesn't excuse the fact that he is an ass. Spouses who put up with all the struggles to get their spouse all the through deserve all the respect. Put your foot down and demand the respect you deserve, you've earned it. If he is primary care, pediatrics, internal med/hospitalist, emergency medicine then part time is feasible.  Is he a surgeon? If so, part time probably isn't feasible, however if that's the case he needs to swallow it and allow this kid to be in daycare so you can live your life too. He gets to live his, why can't you. It's perfectly doable with kids but he needs to lighten up.\n\nYou've been married 11 years, so 4 years school and 7 years residency/fellowship? If that's the case, he's probably in a specialty that can't be part time. Again though people do it all the time and raise kids. Nothing is wrong with daycare",
            "Try your hardest to learn how to communicate better, it is the only way. He feels justified for what he does and you feel justified for how you feel. If you truly want to fix your marriage ( and so he does too) then you have to talk to eachother and that is the only way to fix your problem\nEdit: also forgot to say you jave to listen to \"learn to love again\" by p!mk",
            "Your thoughts and feelings are completely valid. He's being VERY unfair to you. What is he going to be like when there are kids and they need things that more than one parent needs to be present for? Or, Fates forbid, you get sick and can't care for them? He wants a fantasy and he wants it at no cost to you. He's being wildly unfair. Present these things to him as calmly and as rationally as you can. Suggest therapy for you both and def go on your own. And be ready to stand up for yourself and stand on your own because that's where this could very well end.",
            "Your husband is a narcissist at best or sociopath at worst.  I doubt he wants kids.  He just wants an upgrade. Suggest counseling. He'll refuse. Cash out.\n\nBest of luck to you.",
            "Am I the only one who feels that OP's husband is a narcissistic sociopath?",
            "I’m dating a physician and I’m a LICSW. We both help patients in different ways, but obviously he has much more education than I do and the clout that comes with being a MD is much higher. I’m “just a social worker” to many. We both work in a hospital system where he and his peers are treated with the utmost respect, which social workers are... not. I’m in a leadership role (I run a clinic) so I see how I’m treated vs. the SWs who are doing work on the floors. Most of the time people who don’t know me well within the system think I’m a psychologist and call me “doctor,” and I think that’s why there’s more value attached to my work vs that of my SW peers. It makes my skin crawl.\n\nMy point - I’m not “just a social worker” to my boyfriend. He has always supported my work and my profession. He has recognized its value and MY value. That’s how a partner should treat you. Do not settle for less.",
            "If he can't change his attitude you may have to start making plans for a new life without him.",
            "I think this can still be fixed with some marriage counseling. I’d bet he just needs to see how serious you are and for someone neutral to tell him he’s being an ass. It wouldn’t hurt if that someone had a doctoral degree too. \n\nThat being said, it’s too late in life for the two of you to be having this argument about having kids or not. It’s no longer about “not being ready”. You’re choosing if you EVER have kids at this age. If you’re a solid no, you need to break it off, and let him find someone who wants kids. No amount of “I supported you through college” is going to fix a fundamental disagreement on wanting kids or not.",
            "He is such a selfish jerk. He wouldn’t be saving any lives without you and the support you offered him through the years. He would be a piece of shit. Of wait, he is already acting like one. My advice: run for your life, focus on your career or whatever makes you happy and never let anyone stop you from following your dreams. The right man will come and support your passions as much as you support his. But this guy isn’t made for this",
            "Leave his ass. Sorry. Anybody who doesn't respect you is not worth having kids with. DO NOT have kids with him. You will discover he is a s\\*it parent. He may have great qualities that you fell in love with (perhaps he is hot, which he soon will not be), but all of what you described here are massive red flags. He is meant for a powerless submissive woman who likes being financially supported. Don't become that woman. Such women are tied to abusive husbands who know they can't leave them without a career or resume.\n\nHe's probably a bad doctor, power-tripping on his patients or something, too. A person who treats his wife poorly is typicallly treating everyone else like crap.",
            "No ones job is more important than the other. If he cant respect your wishes as well then he isnt worth your time. People grow and move on all the time, make a change and do what's best for you. If he cant see it just say bye bye. You guys are both important. I have 3 kids and everytime one was born I picked up a second job so the wife could stay home and as soon as she was better she got back to work.",
            "Romance is about mystery, and mystery is about ignorance. Love is taking ba dump with the bathroom door open, no mysteries there.\n\nYou have every reason to expect that if someone loves you, that they will act like they care about your feelings. But you cannot expect they will care about feelings you have not explained in a way they can understand. And if you love someone self-centered, you have to relate your feelings by explaining how the consequences of you continuing to feel the way that they are making you feel will impact them.\n\nThose are your boundaries, and boundaries have consequences. While they are not responsible for how you feel, if they do not make decisions when they are aware of the consequences of not prioritizing your feelings, then you have to decide what you are going to do about that. And you certainly must enforce those boundaries by following through with the promised consequences for crossing your boundaries.",
            "I think you are 100% right to feel this way. It seems like you have tried to be reasonable and self sacrificing at every step of the marriage and he is reluctant to even try to compromise now that you both have settled into careers. \n\nYou have goals and dreams that you want to pursue. It is your life too. How can he expect you to sacrifice it all because of some ideal situation he wants that he never mentioned to you at all during your relationship before?  You Being a stay at home mom would have been something he should have been open about a long time ago. \n\nYou have been extremely helpful in the pursuit of your husbands career and understand the value of him being a physician. But he is lording it over your head and making you feel powerless. \n\nI think you basically need to tell him what you have just written in the most civil way possible. That you made all the sacrifices you did and supported him because you loved him and wanted him to reach his goals. But now that you are settled and you are also finally happy in your career that you feel hurt that he is not even trying to compromise or do the same for you but instead has these unfair expectations. And insults the nature of your career because it’s not directly linked to someone’s life and death.",
            "You will be so unhappy if you have kids with this guy.  How dare he diminish all your support getting him up on his high horse!?  It’s going to lead to divorce if you are not on equal footing like where you started.",
            "You deserve your own happiness. Don’t get trapped in a life you are unhappy with because someone thinks you don’t deserve happiness too",
            "You basically stated everything wrong in this marriage and I really don't see a reason not to leave this guy.",
            "His dreams are not the only ones that are important. You should compromise, not sacrifice so that you both get what you want. I feel as if you just want to stop feeling angry, not that you want to solve the actual problem - feeling unappreciated after so much dedication. In the healthcare community doctors are treated like fucking kings, it seems like hes let that get to his head. I would suggest counseling and being firm. You deserve respect and your dreams, goals and ambitions matter. You do not exist on this earth to be this man's crutch. You should BOTH be fufilled and satisfied in life.",
            "Docs and their God complex",
            "Sadly you’re gonna resent him due to you always making his goal more important than yours/ granted you can’t keep score but if he’s not even willing to compromise on something that effects you both in major ways how long will this really last. When you shared what you honestly felt he insulted you and all the hard work you’ve put into making to that place in your job. If he can’t hear you out now adding children definitely won’t help.",
            "I'm two years older than you and single. The only reason I tell you is so you know you don't have to fear to be alone if you leave this selfish guy. You are not too old to find another partner. Trust and believe in yourself. You deserve better.",
            "Why are you stating with him? The guy doesnt give a shit about your opinion! From moving to another state without asking you to forcing you to be a mom and stay at home when he decides to.",
            "Ask him if your happiness matters to him. You will get greater clarity from the sincerity of his response.",
            "Oh god, so many red flags. Would only have sex with him with birth control I control.",
            "Here’s the deal: if he wants kids soon, they will be in daycare or have a nanny unless he decides to be a stay at home dad.\n\nThat is, of course, if you still want kids with someone who belittles the impact of the work you love and thinks your dreams and happiness are so much less important than his.",
            "Dude fuck having kids. Tell him you’d rather spend money on traveling and partying and not worrying about having a bunch of little shit stains running around ruining life for you.",
            "Wow... lots of comments already here. And almost every one of them, I agree with. He is selfish and arrogant. He does not value you, and I'm not even sure he sees you. It's sad that he cannot see past his fantasy world of how things will work out. I know a lot of people are saying to just get out... and I'm not sure that I wouldn't agree... but if you want this to work out, then here's what you need to do (and this is coming from a guy who used to be a selfish jerk with a perfect plan... that didn't work out): you need to sit him down, phones off, with eye contact, and \n\n1. Be 100% honest about how you feel he is treating you. Let him know that you feel used, neglected and marginalized.\n\n2. Discover why he does not value your input on his plans for your life together.\n\n3. Communicate how important your career is to you at the moment. That you're not ready to leave it. If you choose to bring up all you've done to help him get where he is, take note of two of the ways he might respond (I don't know his personality,  so these are guesses). If he truly doesn't know, then informing him can put him on the defensive, you'll have to pull him back to the middle to continue the discussion. If he does know, then he might just shut down because it will feel like you are keeping score (and his score is obviously based on his career and how many \"lives he's saved\", not your career or y'all's relationship). You can possibly open him up again with questions about what he thinks would have been better alternatives. Hopefully, he will be in a moment of clarity and see the difficulty of what he's asked you to do.\n\n4. Identify why its important to him that you are the one raising the kids? Did he have a prior bad experience maybe? If there's no logic behind his notion, then you bringing logic on your side will be more convincing.\n\n5. Work out a long term plan. How long do you want to stay in your current job? Is there any point you could see taking a break for 3-4 years? How long does he see staying on his job? Is there a point where he will want to move again? So on and so forth. He's not going to include you in his plans unless you make them together... so try to do just that. In fact, you can tell him that. It might stick with him just enough that he'll try to include you a bit more in the future.\n\nUnfortunately, none of this works if he's not in a clear, open mind. If he comes into this thinking that you're gunning for him, he's going to shut down before any discussion starts. If he comes into this worn out, he'll say anything and agree to anything to finish the discussion without intent to see it through. Based on how he responds to the first discussion point should tell you if you need to discuss the rest with a counselor present (very likely, imo).\n\nI will say, even if he changes the things you have mentioned, he is still an arrogant, selfish, egotistical person and I would carefully consider if you even want to have a family with him. 😥",
            "Even if your job had a net positive impact of 0 but it made you happy, it should be important to him because your happiness and personal self-fulfilment should matter to him.",
            "After reading your post and all the comments,and your responses if you stay with him your a fool.  Please don't post again if you stay with him that would just prove your stupidity.",
            "Show him your post and the responses. If he doesn't want a tank his marriage he's going to have to change.",
            "I've heard this story about 5 times. Woman works like a dog, sacrifices for her Dr. Husband all through med school and residency. Then he dumps her  because: 1-He has no time for her now that he’s a Doctor. 2- She too dumb/uneducated/not pretty enough to be a DOCTOR'S wife. 3-Her career is holding HIM back from HIS dream career.\n\nGo see a lawyer. Go see a councillor, alone because he won't think he's doing anything wrong. You have every reason to be resentful, and this is why Doctors get divorced so often.",
            "You are way too level-headed and hardworking to take this kind of bullshit. Stand your ground, even if it's away from his.",
            "Sounds like you aren't a team.",
            "A simple solution would be getting him to move back near your family , you’d have the resources to have help raising the baby , you would be able to continue your job and he’d get a child . This is what me and my wife call a win win . Tell him the only way we all get what we want is to move back",
            "This is not a man I’d have children with.  I think your resentment is telling you something important.",
            "Your husband sounds like an absolute A-hole. Your feelings are entirely justifed and he needs to recalibrate his outlook on life.",
            "I left my then-girlfriend of 4 years because she didn't like the fact that I went to college with a scholarship while she wasn't able to go to college. Always talking about how it was my fault she wasn't accepted into a college when all she did the 4 years of high school was slack off even when I tried to help her study. Ending the relationship solved all my problems.",
            "How do you stop resenting an entitled, selfish, ungrateful husband? You either pretend nothing is happening or acknowledge why is that you feel resentful. First of all: Besides all the sacrifices you have made for this man because obviously you love him and wanted the best for him and your marriage... What about you? He is now a doctor, in part thanks to your support (financial, logistical, emotional, etc.) and the way he is repaying you by his lack of respect towards you is something that is unacceptable. If you “forgive” his behavior,  the resentment will be shoved down your body because you aren’t listening to it. You might get sick, you might even get depressed, anxious, or start hating this man. \n\nListen to what your body and mind is telling you about your husband. You helped him grow but instead he wants to disregard your concerns and use you. Put a stop to it. Say NO. You have done more than enough for him and you need to think about yourself this time. What is he doing for you now? Humiliating you. You sound like a smart woman and staying with the horrible person he has morphed into now would mean pain for you. Consider all your options because deep down you know you don’t want to have kids with him.",
            "It doesn't sound like you need help not resenting your husband, it sounds like your husband's behavior and entitlements have given you perfectly legitimate reasons to resent him. There's no amount of self-work you'll be able to do to stop resenting him over this because the problem doesn't lie within you, it lies within him. \n\nAs much as you may want to be able to fix this all on your own, to some extent this is out of your control. Whether these feelings go away is dependent on your husband turning around and appreciating you and doing his fair share of housework and prioritizing potential childcare (and following through, I've heard a lot of horror stories of men who promised to 'help out' with their kids and then didn't). And to some extent it'll be dependent on him finding it within himself to value you on his own, because if you have to lead about or give him ultimatums to get his respect then that will be a valid point of resentment as well (you don't have to fight with a good spouse to get them to value what you do). \n\nTL;DR: When your husband devalues you until you resent him, that's a him problem, not a you problem.",
            "Your husband does want a nanny.  He wants you to be the anny.\n\nAlso, people in the childcare industry are often trained in how to educate children.  So take his comment and twist it like this:\n\nI don't want anyone else teaching my child quantum physics, so you, dear wife, who knows nothing g at all about quantum physics, should be the one to do it.\n\nDoes that make even the slightest amount of sense?  If he thinks it does, he's not ready to have children.",
            "\n\nI see one good solution for the both of you but it will be a compromise on both sides. You reserve the right to your body but as husband and wife I mean I’m sure you expected children at some point and if you both have stable jobs I don’t see why not. A baby doesn’t come in 1 day, it takes 9 months and that is plenty of time to get to know people and find someone trust worthy to help care for you child. Because to be honest this is the best solution for you two. You get to keep your career and he gets to have a child. Personally, I am like your husband in the fact that I really would hate my child to be cared for by someone else especially at a young age but this is the west and it happens all the time. Kids don’t have to hold you back, and you and your husband can also work out a schedule together for caring for your child. He needs to give up his traditional thinking because there is absolutely nothing traditional in our generation. Don’t resent each other ! those 15 years are not for nothing! You guys are just both mad and need time to cool. \nPersonally, I wish my husband was a dr so I could stay home take care of my child, cook, home decor and such but I understand how hard you’ve worked on your career and it’s so annoying to give it up. because then what was the point of it all? Idc what culture, race or religion. Women have it tough because we are the baby makers lol!",
            "This does seem like a conversation that should have been had before marriage. I don’t think this is going to work out long term in my opinion. Side note, daycare is very healthy for a child both academically and socially. Perhaps more research on the subject and tours of facilities will help him sway his opinion on “strangers” raising your children. School settings are a part of life for children, of all ages.",
            "Do you think that maybe you repressed a lot of feelings so that you could do everything you could for your husband? It doesn’t sound like the same has been done for you, in fact it sounds like it’s been pretty one sided. Normally I’d advertise not to keep score, but in a situation like this, it sounds like he’s just pursuing his own dreams, with little regard for you, and now expects you to do as he says. \n\nHonestly, I can’t blame him. You have a very spoiled husband that got everything he ever wanted from you. If he receives anything less than the same treatment, he will feel as if he is being cheated, the same way a spoiled child will expect to be coddled. I can, however, blame him for going along with this treatment without reciprocating. No one can maintain the level of one sided dedication you described for long and I’m baffled that you managed to do so for as long as you did. Don’t repress your feelings any longer. Don’t control how you are thinking. Take some time alone and collect what you’re thinking and feeling into something tangible so that you can tell your husband how you feel. Write it all down if you have to. If you’re scared  he won’t back down, that should give you all the reason you need to continue. People that refuse to legitimize a person’s feelings regarding a situation, and remain fixated on their own, are also the kinds of people that want others to break before them. Don’t back down until you are heard. You’ve been catering to his needs for far too long to deserve anything less.",
            "I agree that he shouldn't expect you to sideline your career. I suggest since he is a physician maybe switch his shift to work nights while you work days. I know many RN families that swear by this. It is a bit of a juggling act but it is workable. Ultimately he is throwing this MD entitlement in your face. Just because he became a MD doesnt mean he is better than you. Marriage is a partnership and should go both ways.",
            "Be careful with the way most of the redditors here are commenting on your story. What's going on here isn't neccesarily personally disrespectful, rather it's a social norm that is broadly disrespectful.",
            "The spouses of those in medicine who stick around are champs. Speaking as someone who is about to start residency, it can be so difficult at times because those going into medicine can be very unavailable emotionally at times. It is a very rigid process and for the most part, a single pathway that the spouses have to choose to get on board with. I am concerned about the lack of consultation with you on where to go for residency. The fact that he’s completely dismissing all that you’ve done for him and expects you to give up your dreams for having kids is not right. Your husband is seeming very inconsiderate of your needs and desires and it appears this has been going on for some time. Marriage counseling would be your best bet here.",
            "If he doesn't want strangers raising his kids, has he considered becoming a stay-at-home dad? This isn't something you demand of others.",
            "Everything that you said in the third paragraph is something he needs to hear. Seriously.",
            "Just talk it out tell him about all.the hard work you put into him and his career. Also you have other problems to deal with and many times people think a baby will solve every thing but it wont. Also stop letting him have his way with where you live.",
            "Honestly it sounds like you're totally right to feel like you do, and I think he's lucky that you aren't divorcing him. Your job sounds like it's really good for you, and the fact that he wants you to derail your life because he's decided he's ready for kids is ridiculous. Other people have said get counselling and that's a good idea, but at the end of the day it sounds like you've been more than forgiving of the nonsense he's pulling.",
            "I sincerely apoligize..\nI didnt mean it that way..I'm sure you can tell by my mis-spelled ,non punctuated run on an on sentence structure . I'm not an educated man ..didnt even make it threw ha at 40 years old I took a g.e.d. and now i earn a small fraction of what you big ballers earn .i know i should keep my mouth shut and listen more ..however i am a self taught expert in human behavior ..I've studied this and body language for 50 years..even the words we choose and order we use them tell as much about someone's frame of mind and the content of the writings tell about the actual situtation... be brutally honest here to an educated respected professional,,such as yourself ,, does what I'm saying make any sense .? I know the basis is true but is there a sience dedicated to this..?I would value your input as I'm simply ,curious again I'm terribly sorry to have stepped on your toes by demeaning your profession..but the starry eyed 19 year old nurse died exist just as sure as the dedicated professional is there seriously saving lives ..thanks for your time and to summarize \nPlease dont let my dumb non educated rambelings take one second of joy away from your day ..thanks and keep up the good work",
            "To answer your question, you need to find a way to forgive him. But he does sound like a jerk -- if he's not willing to move at all, you need counseling at the very least, or you need to somehow get across to him how important this is to you.\n\nReading your comment, I'm just as frustrated as you with him. But the way to get rid of resentment is to move to forgiveness. Just be smart about doing that -- if you can forgive with a whole, loving heart, great, but also don't be a doormat, or give someone forgiveness when they haven't shown any remorse or empathy.",
            "I don't know that you can or should stop having these thoughts. Your anger is completely justified. The only thing that may help prevent future resentment is communicating how hurt you are and why you are not going to give up your job for a child. Also... I'd say for you not to resent him, he'd have to agree that you aren't having a kid when you're not ready and you're not quitting your job to be a stay at home mom when and if you do have a kid. You could try writing down a list of your most important points so that you remember them all for the conversation, but wait until you're relatively calm and let him know you want to discuss things he said that were hurtful. If he starts fighting, end the conversation. The thing is, you have given him everything so that he can have his dream and he responds by actively trying to take your dream away and then belittling it. That's not something you just have to accept and get over. He disrespected the *years* of physical, mental and emotional work you did to get him where he is.",
            "I know people think that people throw this answer around too much on here, but...\n\n&#x200B;\n\n&#x200B;\n\ndivorce, divorce, divorce, divorce, divorce, divorce, divorce, divorce, divorce, divorce, divorce, divorce, divorce, divorce, divorce, divorce,divorce, divorce, divorce, divorce, divorce, divorce, divorce, divorce, divorce, divorce, divorce, divorce, divorce, divorce, divorce, divorce,divorce, divorce, divorce, divorce, divorce, divorce, divorce, divorce, divorce, divorce, divorce, divorce, divorce, divorce, divorce, divorce,divorce, divorce, divorce, divorce, divorce, divorce, divorce, divorce, divorce, divorce, divorce, divorce, divorce, divorce, divorce, divorce,divorce, divorce, divorce, divorce, divorce, divorce, divorce, divorce, divorce, divorce, divorce, divorce, divorce, divorce, divorce, divorce,divorce, divorce, divorce, divorce, divorce, divorce, divorce, divorce, divorce, divorce, divorce, divorce, divorce, divorce, divorce, divorce,divorce, divorce, divorce, divorce, divorce, divorce, divorce, divorce, divorce, divorce, divorce, divorce, divorce, divorce, divorce, divorce, divorce.",
            "Even if you got him to agree to daycare or a nanny, I'm betting all child rearing responsibilities will fall solely on you. How is your household responsibilities split now? About 20% him and 80% you?",
            "If you give in the resentment could pass to the children.",
            "From where you're coming from, it sounds like you've deposited a lot more into your relationship account whereas he has made more withdraws from said account. If you've both had multiple discussions and he still doesn't understand where you're coming from, counseling (what other Redditors recommended) will help.",
            "You have every right to feel this way but I would get him to agree that you won’t quit your job until your maternity leave is up. You won’t know how you feel until you have a baby. I’ve seen women who said they wanted to keep working (with husbands who really want them to also keep working) decide it wasn’t going to work after the baby came and they figured out a way to make it work. I’ve seen single moms who wish they had the option to stay at home. It doesn’t mean your feelings aren’t valid but I think you should leave as many options open. Maybe you find something that’s the best of both worlds where your consulting in your field but don’t have to stress about things like work travel and child care. \n\nAs far as being ready I understand, I’m 34 and I am also in a similar space on deciding about if we are ready and it’s just not an easy decision. Can you both agree to give it six months? Maybe plan a really fun vacation you can only enjoy without children. I think it’s possible once he stops pressuring you and you have a full year in your new job you may feel ready. \n\nAlso, I’d only agree to be a stay at home mom with this man if he agrees that you need to employ a part time sitter so that you can get chores done/get out of the house alone and do things that will make you happy and be the best mom/wife to him and your children. This will take the whole I don’t want someone else raising our children off the table. You will need help - especially if he has a demanding speciality. If he can’t agree to that then you may need to really reconsider your relationship because he’s just being controlling.",
            "Marriages are supposed to be equal. Both parties matter equally. It's ok for one of their careers to take priority, if both parties agree and are ok with it. It should never just be expected from either party. Both parties deserve equal consideration and neither has the right to demand things from the other. I would never demand my husband give up his career to raise our future children. I would never even pressure him to do that. We'd discuss, as a team, what would work for everyone, him, me, and the kids. Your husband just wants you to do what's best for him and what he thinks is best for your kids and doesn't seem to care about your happiness. And that's messed up. A partner shouldn't be someone you expect to sacrifice everything for you so you can be happy. I definitely think marriage counseling is called for, but he also needs his own personal treatment, because he seems very confused about how to treat people and what they owe him.",
            "OP, as a doctor married to a non-doctor, I can tell you that telling my husband that my job is \"more important\" than him because I \"save lives\" is a fast track to our marriage being doomed. He enjoys his career as much as I enjoy mine. He's sacrificed things to help support me through my medical training, which I greatly appreciate. We've also compromised on things I want because that's how a partnership works. I would never demand that he quit his job to take care of children. You both need counseling (if he's willing to go) or to find a partner that values you (and your job/career) equal to his own."
        ]
    },
    {
        "post_id": "2z99ea",
        "author": "angrywidow",
        "title": "[UPDATE] My [28F] husband [36M] passed away, and now his \"best friend\" [33F] is trying to control his services",
        "url": "https://www.reddit.com/r/relationships/comments/2z99ea/update_my_28f_husband_36m_passed_away_and_now_his/",
        "score": 4054,
        "num_comments": 225,
        "created_utc": 1426529568.0,
        "selftext": "Original post: http://www.reddit.com/r/relationships/comments/2yywvd/my_28f_husband_36m_passed_away_and_now_his_best/\n\nI apologize for not updating sooner, but a lot happened the last couple of days.  Thank you to everyone who offered help and advice.  For those that offered monetary assistance, Jonah and I were in a stable position financially -- I'm going to be comfortable until I decide to go back to work.  Your willingness to help was deeply appreciated, however, and I'm truly bowled over by your kindness.\n\nI took the advice of the majority of comments, and called the chapel where Marjorie was planning her service.  I spoke with the pastor, who immediately told me that he had been trying to get in touch with me regarding the service -- apparently both Jonah and Marjorie had grown up in that church (I am not religious, and neither was Jonah as an adult).  My voicemail has been flooded, so it's definitely plausible that I overlooked his call. \n\nHe immediately expressed how sorry he was to hear of Jonah's loss, and said he had received my contact info from Jonah's great-aunt who still attends there.  He said he was surprised when Marjorie asked to have a service for Jonah, but she had claimed that Jonah and I were separated and I didn't want to be involved.  He had been trying to follow up with me, but obviously that didn't happen.\n\nHe was very apologetic, and said that we could cancel the service, or move forward in any way that felt right to me.  He said that he knew the church members would appreciate the service, since many of them remembered Jonah as a boy, but obviously Marjorie would no longer have a role.  I agreed that the service could go forward.\n\nHe called to speak with Marjorie after our conversation, and informed her that she was no longer welcome to participate in the organization of the service after her behavior.  He wouldn't tell me all that she said, but says she was distraught, and he recommended some mental health/spiritual services to her that he hopes she accepts.  She apparently apologized for lying, and asked to speak with me -- but I declined.  I feel bad if she's truly contrite, but I just have too much on my plate right now.\n\nWe had two beautiful services for my husband -- first the one at his hometown church, and then the non-religious one that I planned.  Everyone that came wanted to honor Jonah, and that's all that really matters.  I was told a dozen stories about him that I'd never heard before, and I laughed so hard I cried, then cried some more.  My cousin was on the lookout for Marjorie, and I honestly didn't think about her the whole weekend.  She turned up for the first service, and the pastor ended up speaking with her (unbeknownst to me).  My cousin says he was sympathetic but firm, and told her that her presence there would be inappropriate.  Surprisingly, she left without fuss.\n\nI'm still not sure this situation is entirely resolved, but I got to lay my husband to rest in the way he deserved, and that's the most important thing to me right now.  \n\nThanks everyone for your support.\n\n\n**tl;dr**: Called the chapel, spoke with Marjorie, and had two wonderful services for my husband.\n\n[UPDATE 2]. I debated whether or not to even mention this, but this community has been so awesome I thought I might as well -- I realized this weekend that I'd missed my period, and I'm usually like clockwork.  It could just be stress, but I'm going to take a test later.  Can't decide if I'm incredibly hopeful or absolutely terrified.\n\n[UPDATE 3]. Not pregnant.  It was a long shot.  Thanks for your support.",
        "permalink": "/r/relationships/comments/2z99ea/update_my_28f_husband_36m_passed_away_and_now_his/",
        "comments": [
            "I'm glad the pastor is such an awesome, compassionate person and that you were able to memorialize your husband with people who cared about him.",
            "You handled this situation graciously. \n\nI hope she doesn't cause any further trouble, and leaves you to grieve in peace. \n\nMy thoughts are with you. ",
            "The pastor sounds amazing! I'm so glad you were able to say goodbye to Jonah without disruption, it's so important to be able to do that. Sending hugs to you xo",
            "Great to hear! Now comes the hard part. The calls will subside, the visits will thin out and you will be left to find some sort of normality. Embrace this calm after the Storm you have just survived. Look for peace. Look for the solid ground that has been missing these past few weeks and beware of those that really do not have your best interest at heart as you have already seen. Figure out your plan, take notes and I can not emphasize how important your to do list are. My heart goes out to you and know you will be fine but just a little beat up after your experience. Message me if you need any assistance in your journey. I can offer you only my experience but sometimes you just need advice from someone that has been there.",
            "Pastor McAwesome, Holy Slayer Of The Wicked",
            "I'm an atheist, but this is the kind of pastor I love to see! What a GGG pastor. Seems like he was on the ball from the get go and looked out for you when you let him know. I wish all pastors/priests were like that because that is one solid community leader.",
            "So sorry for your loss. Glad that everywhong worked out great.\n\nYour cousin was really awesome to watch out for you. That is one person to keep around.",
            "You're so socially graceful, I'm glad you're alright and she didn't ruin everything.",
            "Thank you for updating. I'm really pleased that you were able to celebrate his life without any negativity. I wish you the best!",
            "I am so glad you updated. You have been on my mind so much.\n\nThe pastor did a great thing, and I am so very glad you were able to have both memorials. \n\nI don't have the right words to express my sorrow. But please know that your story really affected me, and even as a stranger I felt so compelled to assist you any way. The offer will always stand. Be kind to yourself while grieving. You are so strong and full of grace. ",
            "I'm sad that any of this was necessary - both because your husband died, and because she was such an outrageous bitch about it.  I can't imagine how I would've responded, but I doubt it would've been even half as gracious.  I'm glad that you got to memorialize in a wonderful way.  Best wishes.",
            "Great outcome! Marjorie is a terrible, terrible human being. Holy crap. Who the hell lies to a pastor about a man and a wife separating for their own agenda?! Fuck, disgusting behaviour. \n\nGlad everything worked out for you!",
            "I'm glad you got to experience the weekend focused on your husband and not on her. I'm sending so many good thoughts your way. Please know that you are loved and supported. ",
            "[deleted]",
            "That pastor sounds absolutely lovely. I'm so glad this was resolved and you can grieve in the way that you need to, without this weirdo muscling in. Hopefully she will get the help she clearly needs and move on also.\n\nAgain, I'm so sorry for your loss. I hope things get better for you.",
            "Seriously impressed with the pastor's handling of the situation. ",
            "Fantastic news. I'm so sorry for your loss ",
            "I'm glad everything worked out. I've been thinking about you, hoping it would. ",
            "I'm glad to hear that the pastor was receptive, and that he helped deal with her on his own without adding to your burdens - he sounds very caring. I'm glad you were able to lay him to rest appropriately. \n\nI'm also sorry for your loss. I wish you the best going forward, OP.",
            "Glad to hear you were able to celebrate your husband's life without any pettiness.",
            "[removed]",
            "Wow, that second update.... My fingers are crossed for you, for whatever way you want it to go... My prayers and support go out to you! ",
            "So glad to hear this. I wish you well! And again, I'm so very sorry for your loss.",
            "You really handled the situation in a mature and correct way, which I find admirable in your situation. I'm wishing you the greatest of lucks, you still have so much sorrow and memories to go through, but one day you'll be even with them. \n\nVirtual hug for you, strong one.",
            "I'm just curious as to what role Jonah's parents/soblings played in this, did Marjorie try to appeal to them at all and were they supprtive of you, if you are  pregnant, do you expect they will be supportive going forward?  \n\n\n\nI'm glad everything worked out with minimal drama in the end and that the pastor was able to turn Marjorie away.",
            "Thank goodness you got the backup and support that you deserved and needed. I'm so sorry for your loss and wish you the very best.",
            "You should make a small donation or something to that pastors church as a thanks to him for handling this situation in the best possible way. That dude laid down the law to Marjorie. ",
            ">but she had claimed that Jonah and I were separated and I didn't want to be involved. \n\nI'm sorry for your loss, please be a little extra careful and aware of your surrounding ect in the next few weeks., just in case. Marjorie seems to have had your husband as her point of obsession for years and losing that may very well cause her already unstable mind to unravel. If she contacts you or tries to butt into your life further save all communication and consider a restraining order.",
            "I'm very sorry for your loss, but very happy for the way that this turned out. Just keep swimming!",
            "I'm so glad the services turned out. Big hugs to you and I'm so sorry for your loss.",
            "I'm so happy you feel your husband was honored and I really love your cousin for being bodyguard that day ;). I feel like your family, the pastor, and your cousin were great, and I hope you feel loved and protected. And PS--- she is still majorly bat shit insane for lying to a pastor and saying you were separated. LOL. I love that the pastor told her to get help. \"You're beyond prayer lady. You need a therapist.\"",
            "Perfect, that's almost exactly what we did for my Dad.",
            "So happy to hear it worked out for you, thanks for updating.",
            "Thank you for taking the time to update. This story definitely resonated with this community who were pulling for you and wanted nothing but a resolution to your troubles. I'm very glad to hear it turned out the way it did. Know there's a whole group of people who are here for you as you close a painful chapter of your life and work towards a brighter future. Peace and happiness to you and yours.",
            "Just adding my voice to the chorus. So glad everything worked out well. It's nice to see grace rewarded. You have handled this situation with dignity and I am glad you got to honor your husband and share memories with those that love him.  Thanks for taking the time to update us, been thinking about you and will continue to do so. I hope she leaves you in peace but it's nice to know you have a great support system in case anything else comes up. Best wishes.",
            "Wow, good example of a pastor being cool. Impressed!\nSorry for your loss, hope things pick up and move on.",
            "I'm so happy it worked out well in the end. When I read your original post I felt so bad for you, but I'm so pleased it worked out in the end. Hugs to you.",
            "I'm glad things worked out for you. I got really upset when I read your first post but looks like thanks to some great people things worked out in the best possible way.",
            "Good to hear about the services going well. All the best to you and sorry for your loss. May he rest in peace. ",
            "ಠ_ಠ\n\n>she had claimed that Jonah and I were separated and I didn't want to be involved.\n\n<:o\n\nWow, she really does need some help.",
            "My dad passed away when I was almost 3. He was 33. It was very hard on my mother at the time and every year, I can see it on her face when the day comes around. Even though it has been 18 years and she has since remarried, there is still a sting. \n\nThe point of this is to say that it never truly leaves, but it will get better and you will be able to remember your husband fondly and with love as time goes on. Surround yourself with family and friends. Allow them to help you and don't feel afraid to lean on others when you need it. I'm glad you were able to have a wonderful service for your husband. My heart is genuinely with you and I sincerely hope that you will have a good surprise for yourself after that test. My deepest condolences. ",
            "I am so sorry for your loss and glas that you were able to share those memories of your husband with the people that likely mattered most to him. ",
            "All I have to say is good luck to you and I'm so happy this was resolved in the best way possible. \n\nMy husband and I are exactly the ages of you and your husband. I couldn't imagine being in your position and handling everything that you've been dealt recently. You're incredibly strong and I'm sure that strength will serve you well for the rest of your days, which I hope are long and full of happiness. :)",
            "I picture the pastor as the one from Hot Fuzz.  Very kind and polite then calling Marjorie:  \n\n \"Oh, fuck off, Marj!\" *click*",
            "I am so glad that this worked out. Your original post made me so upset, and I feel so awful that you had to deal with this silliness at such a difficult time. My most sincere condolences for your loss. ",
            "What's best here is that no one had to deal with any of her drama. It seems like she may have come to her senses and realized what a complete and total ass she is. It's a shame that her antics caused her to miss out on her friend's memorials. \n",
            "Thank you for taking the time out of your incredibly difficult circumstances to update us. I'm so happy things went in your favor! And I'm so very sorry for the loss of Jonah, and wish you well in the upcoming time of recovery.",
            "Marjorie probably feels bad..... That she got caught. She is all kinds of messed up if she thinks lying to a church and its pastor is going to just go away and showing up to the service was a good idea",
            "Wow. Such a lot to happen in such a small amount of time, and it even turned out to be a happy ending, with the bonus of a reddit update amidst all the stress and priorities one typically thinks about in their hour of need.\n/r/tifu has got nothing on this sub.\nEdit: with bonus apology for not updating sooner! You know, because it has been a whole 48 hours.",
            "Yeah, that last update about the \"missed period\" really pushed this one into r/thathappened territory. Decent story though. \n\nSo many people just can't help adding in those little extra bits. ",
            "I'm glad it turned out for the best, keep us updated on the edit part though :)",
            "I'm glad she didn't ruin the service for you. It's hard enough saying goodbye to your husband, I went through it too. I'm so sorry for your loss. I can't imagine what you are feeling while you wait for your test.   You are in my thoughts and I hope you find peace, my dear. ",
            "I for one would love a second update on the missed period realization. This is the craziest story I've heard in a while and my curiosity is piqued, lol.",
            "So much love to you. You are the embodiment of dignity and grace. Thanks for the update, you're in my thoughts.",
            "You handled it like an absolute class act, good job. And thank goodness for a pastor who also saw fit to do the right thing. I hope Marjorie finds the mental and emotional help she needs to further prevent herself from epically trifling in matters where she has no right.",
            "The priest handled that situation very well. \n\nIn all honesty, I would have beaten that bitch to a bloody pulp. You're already going through the worst time of your life, how dare she cause you additional pain. She's smearing your husband's good name by telling everyone the lies about him planning to leave you. What she did with his Memorial service shows how disturbed she really is. \n\nAt the end of the day you win. I would remind her that your husband chose you, not her. He never wanted to be with her and he certainly did not love her. ",
            "I am so sorry for your loss. I cannot imagine how you must be feeling right now, and to be dealing with this madness at the same time. I hope this woman does decide to follow through on the mental health services suggested by the pastor. It sounds like she was very deluded about the nature of her relationship with your husband. ",
            "I'm glad the pastor was able to get through to Marjorie, and I'm sorry that you were dealing with that at such an terrible time for you. She sounds mentally unstable. Sending positive vibes/prayers/thoughts your way. ",
            "I was just a lurker on the first thread, but I want to say I was concerned for you. I am so relieved things turned out as well as they could!\n\n\nYou're a wonderfully strong person and you're doing right by your husband. Any person would be proud of such a great spouse as yourself. Stay strong.",
            "Marjorie was completely out of line from the very beginning (trying to push Jonah into a relationship he didn't want), and although I understand that people do strange things out of grief, there is no way all the lies and manipulation could be excused. I sincerely hope she gets the help she needs, and I hope you are able to find peace in this tragic time. ",
            "Thank goodness this worked out for you, your first post really upset me at how thoughtless and selfish this \"friend\" of his was being. I'm really glad that you were able to mourn your husband's death and celebrate his life in a way that did not end up involving this woman's antics. Good luck to you.",
            "I'm so happy that you were able to celebrate your husband's life without any drama. It sounds like you have a great support system in your life and I hope that you continue to lean on them moving forward in your healing. It sounds like all of the people who matter know that Marjorie is a liar, so even if she does try to start drama, just try to rise above and preserve the wonderful memories you have with your husband.",
            "I'm so glad that you and those who knew him were able to celebrate the life of your husband in peace. The pastor sounds like an experienced people-handler and it's great that he was able to smooth things over. You handled this messy situation with wonderful grace and poise and I'm so sorry for your loss.",
            "Sorry for your loss.\n\nI'm embarrassed for Marjorie.",
            "That's a terrible to have to deal with on top of everything else; it's a bit of relief that things worked out ok, but still....  \n\nAnd I agree with the pastor, she needs help. I'm certainly no psychologist, but reading through both your posts screams sociopath to me. ",
            "Bottom line, Marjorie doesn't need to be involved with you any more.  She can run around and say what she wants, but it sounds like just about everyone who knows either you or Jonah understands that Marjorie is a nutjob.\n\nBelieve me, similar situations happen regularly regarding the deceased, but the nutjobs are relatives, children, siblings, etc.  They wreak all kinds of havoc, and kind of have the standing to do so.  Ugh!",
            "I'm sorry for your loss. I would strongly recommend avoiding M, you are part of her crazy drama you aren't coming from a position where you can help her. Having grown up with manipulative dramatic personality types, you'll only get more heartache. Let her feel alone and she may get herself hope. ",
            "I'm sorry to say it, but don't get your hopes too high about the missed period. Stress, which you've had a lot of lately, can cause your period to come late. \n\n\n\n",
            "I am not at all religious, but damn I hope that pastor earned some brownie points with his god for how professional and compassionate he was in the situation. I can only imagine how much relief you felt after speaking with him and him handling Marjorie as he did.\n\nVery sorry for your loss, I am glad you had two lovely memorials for you and everyone.",
            "(((hugs)))\n\nI'm so sorry for your loss!  You handled this with dignity and grace.\n\nTake care of yourself! ",
            ">She turned up for the first service, and the pastor ended up speaking with her \n\nWow.  This girl STILL doesn't get it!  Crazy-pants!",
            "What a great outcome and lovely update.\n\nAssuming you want to be pregnant I have my fingers crossed for you. \n\n",
            "Thanks for the update OP! I know that this whole situation is just terrible, but the justice police are so satisfied that Marjorie got shut down. What a wretched, twisted individual. I hope she can come full circle one day and apologize to you with sincerity",
            "So glad this turned out as well as could be for you and am still so sorry for your loss. Sending you good wishes.",
            "I was hoping for an update cause this bitch Marjorie sounds cray. I'm happy to hear the pastor was understanding, and that you were able to enjoy your husband's services without too much extra stress. I cannot imagine losing a spouse, and especially having to deal with what you did in your time of mourning. ",
            "I didn't know what the heck to say after I read the first post, as words failed me in trying to articulate my... I guess 'revulsion' fits best... at Marjorie's actions. I can't imagine how hard it was fit you to call with her shenanigans in your time of grief. I admire your actions and reactions. I'm am so, so glad you were able to have your memorial services in peace, the way you wanted to. I hope Marjorie gets the help she really does need, and that the gravity of what she put you through hits home for her one day. My condolences on your loss.",
            "This is sofa king fake. Late period was too much. Fuck off. ",
            "*hug* I am so sorry for your loss. And I am glad you had an awesome amount of people who are supporting you and working with you during this time. ",
            "I'm so glad to hear things worked out--I had you in my thoughts this week. And as for your other update, fingers crossed!!! ",
            "Glad to see this update. I hope you give us an update about the test you're planning to take! ",
            "I'm glad that the pastor was able to get in touch with you, and that you were able to have two wonderful services for your husband.",
            "I've been hoping for an update, and I'm so glad it is such a \"good\" one... Well, not good, because this situation sucks, but good compared to the alternative.\n\nAlso, my heart leapt into my throat when I read your second update. I hope that you have peace with whatever answer you receive, and I'm sending lots of warm fuzzy vibes your way.",
            "you did good :D sending wooooo.",
            "You sound like you are surrounded by a lot of good people. I am glad you were able to properly celebrate your husbands life. It is amazing how needed that can be. \n\nBest of luck to you!",
            "My heart is with you.",
            "I'm so glad you were able to get this handled, and that you were able to say your goodbyes in peace.",
            "Big hugs. ",
            "That's absolutely wonderful. Thank you for the update! I wish you the best and I hope Marjorie does seek the help she needs. ",
            "Big props to the pastor.",
            "I'm glad everything worked out, and I hope Marjorie does get the help the pastor recommended. ",
            "I just wanted to tell you how sorry I am for your loss, I can't imagine what you're going through. To have this other person meddling, ugh, how awful, but I'm glad you were able to honor his life in your own way. I'm so very sorry you are having to go through this, your story really made me think about what's important, thank you for sharing it.",
            "Awesome Pastor!  Thanks so much for the update.  I'm so sorry you had to go through this! ",
            "I'm happy that the memorials worked out, but also so very sorry for your loss. I can't even imagine losing my husband, and how I would go on. Let yourself grieve, and seek as much support as you are comfortable with. Let time heal your wounds, but always remember how he loved you. Live how he would want you to live. ",
            "I'm so glad this turned out well. The whole situation and her behavior really irked me. I haven't dealt with the death of a loved one, let alone an SO, but I'm glad you got some sort of closure. ",
            "Best of luck. What a whirlwind, you need some peace and I hope the world gives you the chance to do this the way you want / need.",
            "Thank God the pastor believes you. She is delusional. Stay away from her. There is nothing to talk about with a delusional person.",
            "I cried. I'm so sorry for your loss. Thank you for the update. I'm glad the pastor was so alert. Marjorie is pathological. She needs serious help.",
            "That missed period! Talk about having the last word! Good luck either way!",
            "OHHH!!! If you have a kid this will be the greatest/happiest/saddest story of all time. I am glad you were able to have everything settled and was able to celebrate the finer days of your husband. \n\nI wish you the best of luck in the future and please, PLEASE update on either you are pregnant or not! The suspense is just killing me I NEED to know! :D",
            "[removed]",
            "I really hope your pregnant :) ",
            "I am so happy this situation was resolved in such a quick and civil way. You already had so much to deal with, the last thing you needed was Marjories middle school drama. I'm sorry for your loss but I'm glad you were able to lay your husband to rest in the respectful way you and he deserved. ",
            "I didn't get to leave a comment on your first post seeing as how everyone was saying similar things. That being said, I'm sorry for your loss but I'm glad that everything turned out alright and you were able to honor the memory of your husband the way you wanted. ",
            "I'm glad it was solved so cleanly without any drama. Good call on not speaking with her when she asked to, OP. Also glad that the pastor was so understanding.",
            "I just wanted to say I'm very sorry for your loss. I can't imagine the pain, especially having somebody like that woman deliberatly making it worse like that. I truely hope it is over and that she'll keep her trap shut and leave you be. Your husband deserves to be honored in a truthfully and fitting way as you did. Since  can't wish him well in his life with you, I wish him well where ever we may go after, and I wish you well.",
            "That Marjorie character is such a witch. Ugh. Glad to see everyone else supporting you though, and glad to hear that you guys were able to honor your late husband the right way.",
            "Wow, it's not often that a story in this sub leaves me feeling this happy. I'm so glad everything worked out and I wish you the best!",
            "I was so hoping to see this kind of update. When I read your original post I was at such a loss for words that I didn't even have an idea how to help. You handled that beautifully and that pastor really is incredible. I am so sorry for your loss and hope that things look up for you someday. You have a great support network, utilize it. Best wishes and Internet hugs  <3",
            "I'm so sorry for your loss and hope congrats are in order. \n\nMarjorie is a narcissist. Steer clear. \n\nI'm glad you were able to memorialize your husband. Way too young.",
            "I don't know whether to be excited for you (since you missed you period) since you still don't know yet, but if you are, congrats! If not, I'm sorry. It's a tough situation, but things will work out how they are supposed too (not that that's going to make you feel any better), keep us updated!",
            "If you are pregnant, then congratulations, but never let her near your kid. And you know with her obsession she might actually want something to do with your child. ",
            "Please keep us updated on the test! My husband and I ttc for almost 4 years. Good luck. ",
            "Remindme march 18th 2015",
            "update 2 - wow, that would be amazing and also terrifying news. wish you all the best. :)",
            "Thank you for the update! I'm glad it was a good weekend for you! I'm happy that everything went smoothly. Please keep us updated about everything. You have reddit support and your own community!",
            "Your story had me in tears, the ugliness with her, but the beauty with how it turned out. I hope you find solace soon and wish you the best moving forward. ",
            "OMG OMG that second update!!",
            "Giving you a hug about not being pregnant. I know how emotional it can be waiting for the results - and then a blow when you find out your not. No one can say something to take that disappointment away. Sorry for your loss (es). ",
            "Sudden, severe stress *can* induce secondary amenorrhea (unphysiologic absence of period) due to altered hormone levels... but it's *not* entirely common. Pregnancy is more likely...",
            "Is there any way, and would anyone be willing, to make those donations to the church?",
            "Just tell her to go away. ",
            "Damn some of you have no respect ",
            "I've never heard of anyone having a service a month+ later after someone died.  Usually its within a week.  \n\n",
            "I feel some sympathy towards Marjorie. She was a complete idiot/very selfish about what she did, and did some very messed up things--- something, \"religious\" people are supposed to learn not to do. It seems the teachings missed their mark, or perhaps they didn't prepare her for how tough life can be. Then again, there's a lot we have to learn through from experience that nobody can prepare us for.\n\nIt's obvious she loved your husband, and that she probably felt some form of negativity towards you because you \"stole\" him away. Once he died, it probably hit her even more because she was consumed with thoughts like, \"why couldn't it be me?\". I can't help but feel sympathy towards her, however, as I feel people should be forgiven in the long-run. I hope Marjorie can learn to get over her selfish feelings, and to learn to appreciate what was instead of what could have been.\n\nMaybe not now, but one day in the future you two can get together and cry over a very special person you both lost.",
            "Honestly, she was an important part of your husband's life for an extended period of time and, while I certainly think she went *waaaaay* off the deep end, I think you did both her and your husband a disservice by excluding her completely.  At the very least I think you should have spoken to her yourself.   \n\nGrief affects different people in different ways.  However sad and pathetic this may have rendered Marjorie, I think a more gracious approach would have been to offer her a chance to apologize, attend quietly, and grieve as well.",
            "Woah. That second update really put us on edge. Will you follow up with us on that?\nCan this be reddits baby?",
            "How the hell did you get such a relevant username?"
        ]
    },
    {
        "post_id": "br84x0",
        "author": "Notreallycheating5",
        "title": "UPDATE ‘My (28f) partner (28m) is convinced I am cheatinh",
        "url": "https://www.reddit.com/r/relationships/comments/br84x0/update_my_28f_partner_28m_is_convinced_i_am/",
        "score": 4048,
        "num_comments": 152,
        "created_utc": 1558430039.0,
        "selftext": "Original:\nhttps://www.reddit.com/r/relationships/comments/bh5tlh/my_28f_partner_28m_is_convinced_i_am_cheating/\n\nSo it got a bit of attention so I wanted to do an update. Plus shit hit the fan over the last few days, so buckle yourselves in.\n\nAfter we spoke about the original issue, things did get better. Then, little fragments of other controlling behaviour started to come out.\nI thought we could work through them.\n\nUntil when things came to a head. I found out he had, in fact, cheated on me.\nWhen I attempted to leave him over this, he became very, very abusive to the point where he was arrested. Three things, screamed, threatened me, trapped me in the house.\n\nI’m crushed, but relieved I found out now. Staying with friends currently. Trying to process.\n\nSo, I guess, if there’s a moral to the story - don’t ignore signs of abuse?\nBut, I can’t help the sense that the escalation came out of nowhere, and how - before - if you’d tried to tell me this would have happened I would have laughed in your face. I guess I don’t know what I could have done to prevent this. \nThe original issue seemed to be able to be worked through, but was masking... this.\n\nThank you to everyone who offered advice and support in my previous post.\nApart from that one guy who thought I’d had a Freudian slip in one of my comments and became convinced I had, actually, cheated on my partner. Like I was a Scooby Doo villain. In retrospect, you can go fuck yourself.\n\nTl;dr boyfriend thought I was cheating, he was cheating, became abusive, got arrested, I eacaped",
        "permalink": "/r/relationships/comments/br84x0/update_my_28f_partner_28m_is_convinced_i_am/",
        "comments": [
            "I'm so sorry that happened to you. Thank you for the update and reinforcing the idea that cheaters project their behavior onto innocent people",
            "Had a gf who was super jealous.\n\nI would have a 2 minute conversation with some girl and then she would say, \"why don't you just fuck her while you're at it?\"\n\nThings like that.\n\nTurns out she was projecting and it was her that was cheating the whole time.",
            "Whenever I hear or read someone say \"My partner has accused me of cheating out of nowhere\" the truth is almost always that the partner is in fact the one who is cheating. \n\nGlad you figured it out and are now free of the situation. Good luck!",
            "You couldn't have done anything to prevent it, I don't think. He got progressively worse, you got progressively concerned, you handled it like a rational person would. I would though, check in with a DV entity or a therapist who specializes in it, so that you can protect yourself from any further contact/abuse from this man. Please be safe, OP. Just because he got arrested, doesn't mean he realizes that he was wrong or that he knows you don't owe him anything and that he should leave you alone.",
            "> I guess I don't know what I could have done to prevent this\n\nNothing really. You sensed something was wrong with the accusations and asked for advice, and then when things went straight to 100 you got out. That's about all you can do. From your last post it sounded like insecurity, which can potentially be worked through, and by the time you realized it wasn't he'd already dialed the crazy level up to batshit. There doesn't always have to be a moral, sometimes people are simply insane and hide it well until they can't anymore. Please don't blame yourself for any of this.",
            "Please get yourself tested for STIs if you were having unprotected intercourse with him.",
            "The thing that highlighted what those early red flags were for me was group therapy with others who had been in abusive relationships. You start to notice a pattern. Little things here and there. With time and reflection you will begin to realise that a lot of things you may have originally scratched your head at or thought ‘he’s just having a bad day, everyone does’ were actually red flags all along. \n\nSomething to remember going forward also, is that it’s ok to be empathetic and understanding and trying to give the benefit of the doubt. But use your own reactions to things as a guide. For example, if you were having the worst day ever maybe you would be snippy and not very nice, but it’s also likely that if it went that far you would apologise immediately.",
            "The signs dont come out of nowhere, you just are too blind to see them. In my case I remember him getting upset over small things and one time early in our relationship he hit a wall with his hand for something not working the way he wanted and I thought \"thats odd\" but it was a major sign, and a bunch of other stuff that we brushed it off because why bother 🤷‍♀️. Its hard to think that way when u love someone.",
            "It really does sound simple, but honestly, when one person accuses you of cheating and you know there's no rhyme or reason for them to say that, it's 10/10 they are the cheaters. \n\nSo sorry OP. And it's called \"cycle of violence\" or \"cycle of abuse\". I'm so sorry you had to go through that. At least you have a strong friend network to rely on. If he's arrested, I assume an automatic restraining order is placed on him. Make sure he (and you by not contacting him) respect that.",
            "Had an ex who constantly accused me of cheating despite my undying loyalty. In retrospect, I sometimes wonder if she cheated and blamed me to feel better somehow. I never wonder on this for too long; it's no longer my problem, one way or the other. The cheater is the one with the problems. Period.",
            "My baby daddy was this guy! So damn jealous, clingy and always accusing me of shit. Turns out - he was cheating all along. Even had the balls to come back to me and try ask to start again even after impregnating the girl. I don't know how people can be so selfish. \n\nHope your situation gets better. Stay strong 💪",
            "I'm currently reading the book Why Does he do That. It's all about DV, the warning signs,  etc. Apparently it's really common for abusers to go crazy and amp up the abuse when THEY are caught cheating.  It all about control.  Your catching him puts his control over you in jeopardy,  so he  increases his abuse tactics to get you back under his thumb.  Glad you got out of this relationship before things got worse.  Take care of yourself and stay safe.",
            "Im sorry about that and nasty comments :(",
            "How dreadful. I’m so sorry OP. I’m glad you got out. And maybe a year of your life has been wasted but at least it wasn’t two, or five or ten! Big hugs. I hope you’re able to get out and rebuild yourself a healthy, happy life with the love and partner you deserve.",
            "Does the cheating, then gets angry and abusive over the fact that you are leaving.... makes total sense. *rolls eyes*",
            "I'm sorry you went through that, I'm still working on escaping. Good for you",
            "“I guess I don’t know what I could have done to prevent this.” \n\nNothing. You were in a relationship with someone who abused you. You did nothing wrong and his behaviour has nothing to do with you. Take care of yourself.",
            "Yeah my ex-fiancé used to joke that a coworker I had was into me.I did a lot of work with this coworker on this one project. We didn’t communicate outside of work, didn’t have each other’s numbers, and we didn’t even work in the same building. \n\nAt my Christmas party he ended up getting super drunk and calling out this coworker and myself for having a secret apartment where we would meet to smash. It made things extremely awkward because nothing was going on. We were just work friends and only because we had to work on a tough project together.\n\nI was always home, I never went out, huge homebody. So I’m not sure when I would be having so much illicit cheaty sex.\n\nFew months before we were supposed to get married he started getting all weird about me wanting to fuck other dudes, me cheating on him, etc. Got to be too much and he pushed me away with all the insecurities and depression. He suggested I have a “hall pass” one day, then the next day he accused me of manipulating him to offer me up a hall pass.\n\nLotsa red flags.",
            "I'm glad you're out, keep your chin up and best of luck healing.",
            "> I guess I don’t know what I could have done to prevent this. \n\n&#x200B;\n\nFYI, predators don't announce that they are predators.  They only reveal themselves when it's too late.",
            ">Apart from that one guy who thought I’d had a Freudian slip in one of my comments and became convinced I had, actually, cheated on my partner. Like I was a Scooby Doo villain. In retrospect, you can go fuck yourself. \n\n&#x200B;\n\nthis made my day. \n\n&#x200B;\n\nbut everything else, i am glad it came to light for you. some times we become oblivious to abusive behavior and ignore it thinking its fixable till one day it cant be fixed. hope it continues to work out and there is no contact with him.",
            "Good job getting out. \n\nPress charges to the full extent so the next time everyone knows.\n\nGlad you got out before he did real damage.",
            "I hate that I was right. Him acting possessive and controlling all while insisting you WILL cheat just points to a guilty cheater. I’m so sorry. I wish things turned out better but I’m glad you found out sooner rather than later.",
            "Projection speaks for itself. If someone freaks out at you with wild accusations, in 99% of the cases it will be that person actually doing all of the things you get accused of. \n\nProjections is the psychological equivalent of body language : it does not lie.",
            "I commented on the original and thought he was so bizarrely paranoid. I did not predict cheating (many others did) or future psycho. That is so scary. And you say you would NEVER have seen this coming, which is even scarier. \n\nI'm so glad you're safe. I'm glad you got/are getting your stuff. You could have done nothing to prevent his cheating. You know that. You sure as heck could have done nothing to prevent his abuse. In the future, you WILL see red flags quicker--BUT, again, this was not the man you knew for a year. You were really, earnestly trying to convince him you were loyal. \n\nIf this happens in the future (or to anyone else), IDK what you're supposed to do. Say, 'dude, I've told you 50x I'm not cheating, been totally transparent with you. You continue to persist. Are YOU the one cheating?'?? I mean, you *could* say that, but wouldn't the paranoid cheater just lie? \n\nWhat I *DO* know is that you need to stay safe. I'm glad you can avoid him, but stay vigilant. Pissed-off abusers who got dumped tend to become REALLY pissed off once they've been arrested/have a court case/record, etc. Hopefully, he'll take his community service or whatever and slink his cheating a@@ under the nearest rock. I know you're still reeling from all this, but false imprisonment is extremely serious. Be safe at all costs. \n\n(I went back and looked for the Scooby Doo villain guy, but it must have gotten deleted. That must have been one heck of a Freudian slip. But yeah, screw that guy. And sometimes having a jerky distraction isn't a bad thing when you're going through a crisis.)",
            "\n*>”...convinced I am cheatinh”*\n\nYou *do* have a suspicious keyboard spasm whenever you type “cheating”.\n\nSeriously though, good riddance to that jerk.",
            "I've learned that alot of cheaters will try to say the other person cheated. So they can hide under what they did. It happens quite a bit. I'm glad you got out and I hope you recover from this. If you need support, I've been there and dealt with an abusive ex. Talking helps. Hope things go up from here",
            "It took me ten years of abusive and otherwise shitty relationships to see (and then not ignore) red flags. Some things you have to experience to learn. In your next relationship, you’ll be better prepared.",
            "I'm so sorry. Being accused of cheating when you're not is a very strong sign that the accuser is cheating themselves. Been there, done that (as the accused). Wishing you healing and love in the future.",
            "I did not see your original post, but I should say that I had a partner just like this - he CONSTANTLY would accuse me of cheating, would take me to meet his friends and then accuse me of flirting with them, would accuse me of cheating on him with MY friends, etc. \n\nTurns out - yes, he was almost certainly cheating on me (I’m not 100% sure but I have pretty good reason to believe so). By that point, I didn’t even care - I was ready to break up with him anyways. He was so paranoid and it was driving me insane. People always project their worst qualities into others - cheaters think everyone else cheats, liars think everyone else lies, etc.\n\nI’m so sorry this happened to you - sometimes it really IS impossible to predict these things, especially when you’re in the thick of it. I’m glad you are OK and got out of that relationship - you sound like a kind person, and you deserve so much better.",
            "This *EXACT* series of events happened to me, only difference was: genders and the fact that, even though I'm the one who called the police after being physically attacked, I was the one who was kept in jail for 4 days, and she was released in an hour after booking. I guess she was just better at lying than I was at telling the truth. In a few instances, being a male is a death knell. This was one of them. I am SO GLAD you got away. I know this torment. Mine lasted years, because I let it. Proud of you for escaping.",
            ">  I was a Scooby Doo villain. In retrospect, you can go fuck yourself.\n\nYou are keeping a sense of humor about this, that is more a beacon for sanity than you can know.\n\nI was in a relationship that I thought was great.. blew up and ended in an assult/jail time for her.   It's surreal.  The best thing you have going is that he exposed a very nasty side of himself... which is your parting memory.  So lingering doubt like \"did I do the right thing here?\" isn't gonna nail ya (or likely won't).   As stupid as it sounds, I would recommend at least going through some exercises that people who deal with abuse go through.  For me, the cops urged I went to a shelter and speak to the counselor there.   Initially I felt very stupid and lame.  I mean I'm a guy, she weighs like 100lbs less than I do (wet) and I'm feeling like a total wimp... but then they start talking to me and pointing out patterns of abuse I never was seeing.   It unravelled a little more and then I really understood what I had (and didn't have).\n\n\nBest of luck to you!  My only other parting comment is that some people have insecurities that aren't from their own sin - so if you are with someone else and they start getting paranoid about you cheating... well don't take that as an obvious sign that they are like your ex, but try to use the same skills you cultivated this time around ;)",
            "I'm very happy you were able to get out. Keep yourself safe. <3",
            "Yeah. Being accused of cheating is a red flag that the accuser is actually cheating. No always, obviously...",
            "> But, I can’t help the sense that the escalation came out of nowhere\n\nIt didn’t. Leaving just let him show his true colors sooner than if you had stayed. And by then, you likely would have been so beaten down you wouldn’t even call the police. \n\n Sadly, abusers are good at playing nice at the start. There’s nothing you can do to stop an abuser from being abusive except leave.  And you succeeded! You are rock star!",
            "It's the sort of projection that is very common with assholes who need to feel like they didn't really do anything bad by cheating, they just assume everyone is as bad as them so that means they're not so bad, considering, so when they want to feel morally smug and superior, and you have the nerve to not be cheating when they kind of needed you to in order to feel bigger than you, it feels to them like you're putting them down and making them feel small. When really, it's all in their heads.",
            "\"I guess I don't know what I could have done to prevent this.\"\n\nBut fam, you did prevent this. You prevented something way worse from happening down the line.",
            "Oh yeah, the classic response of an emotionally abusive person. I had the same thing happen to me from an abusive ex.\n\n&#x200B;\n\nGREAT JOB ON GETTING OUT!!",
            "Haha I like the last comment. \n\nYup - when I read the title I said \"projection\" - he's cheating on you. It's amazing how toxic people are always oh so innocent and tossing all of their toxicity onto you. Glad you're out. NEVER go back. \n\nIt sucks because when they're good, they're really good (either that or we get so used to getting treated like shit it's a pleasant change when they fucking stop and act normal). So unhealthy though. Stuff like that can really mess with your head/life. \n\nAt least you know. Flags are red for a reason. And it sucks when you really do like the person but that person didn't fully exist: they're a false self constructed to hide the monsters they really are - and THEY KNOW THIS. They really do, regardless of what they say, lies they weave, or bullshit they drop on your dining room table. They have no respect for themselves or others: if they did they wouldn't behave like this.\n\nIt's sad but now you can find someone better. Sounds like you might be new to dating disordered people, so don't be surprised if you get sucked back in at some point in the future (likely by someone totally new but you see the same red flags). You might think it's trust issues, but trust your gut. They're issues because you've been F*CKED OVER before; they keep you safe. Trust. That. Gut!",
            "I didn't see your original post but from my personal experience, every time my ex  got weird and said I was cheating on him, it was him doing the cheating.   I am happy that you are out and away now.  Stay safe.",
            "Get your money and stuff out of the house and never look back. He sounds like a turd.\n\nA lawyer can help you if he won't let you get your stuff back.",
            "Yeah, the moment I read your other post I guessed that this guy was 1. massively insecure, and 2. projecting so much he could fill a fucking imax screen. I'm super glad you're out of there.",
            "Damn. Thanks for the update. I am glad you got out.\n\nI appreciate your story as a lesson to me but sorry you had to go through all that.\n\nBest wishes, internet sister.",
            "I was just going to say on your original post, I bet he was or is cheating on you. People accuse others of things they would do themselves. I'm so sorry this happened to you.",
            "It seems like a lot of times when someone is seeing something that isn't there it really is there just not where they're looking.",
            "I’m sorry to hear that, Op. He was definitely projecting his shitty behavior on to you. Good riddance",
            "You can't prevent someone else from being mentally unstable. a liar and and dangerous.    You did everything you could and you did it well.  We need to accept that some things are out of our control and not let those situations define our lives going forward.",
            "Good for you OP. No wonder he was so damn suspicious glad you got out!",
            "A VERY similar situation happened to me. I was away at college - my bf back at home. He tried to control what I did (hated that I went to parties, study abroad, etc.) and always was concerned I was cheating. Turns out, he was the one going to local college parties and cheating on me.  \n\nI broke up with him, he became super aggressive and threatened me in many ways. Police urged that I file a protection from abuse against him, so I did. He still tried to reach out to me over various forms of social media but I haven’t heard from him in a while now. (This happened 1.5 years ago) \n\nIt’s a scary situation where your world feels turned upside down. You’ll get through it!! It really is amazing incentive to make your life as amazing as possible despite all of this shit you’ve been put through.  If you ever need to talk, my DMs are open.",
            "Yeah I had an 8 year relationship with a guy who semi-frequently accused me of cheating or would wildly accuse guys I knew of trying to get with me (they definitely were not). At the end, he had an emotional affair with a co-worker. I think a lot of his accusations we're projecting. He wasn't actively cheating on me the whole time but he had the propensity or inclination to do dishonest things. \n\nI'm sorry you had to go through all of this, but glad that you've found the truth and see the relationship for what it was now. \n\nIt gets better from here, I promise!",
            "I was married 9 years, ignored progressively more controlling behavior, and when I found out he cheated and told him I wanted a divorce he beat me very badly.  Your statement that it felt like the escalation came out of nowhere really hit home- I wonder sometimes if I'd left him 2 years in the same thing would've happened, if it was just a switch waiting to be flipped.  I'm glad you got out of this early.  Good luck, and please don't underestimate the value of counseling and support.  You were abused.  That's tough to process.",
            "People who suspect that are either cheating, or are tempted to cheat.",
            "Wow. I never would have expected that reaction. I am so glad you got out. \n\nTo me, when people become obsessed with lying, cheating, or other hurtful behaviors from a partner, the person making the claims has either been hurt so much that it is difficult to have a close relationship with that person, or... they turn out to be liars and cheats themselves. Liars and cheats think everyone is a liar and a cheat. So, they act like everyone is about to screw them over. \n\nSadly, this guy turned out to be the latter type. And abusive, to boot. I hope you remain safe and far away from this man.",
            "How did you find out he was cheating?",
            "Props to you for speaking about it. I cant imagine how hard it is. Im glad you were able to get away with minor physical injuries.",
            "Very sorry you went through this. I agree with what others said and you too. \n\nPay attention to behavior and signs of abuse. \n\nAlso crazy that he cheated then projected it onto you. I know that's a pretty normal thing for cheaters to do. \n\nIt'll all work out for the better",
            "Oh my God... This escalated real quick! I'm glad you're safe! And I know that right now it feels like crap and that you wasted a year but now you'll be aware of those behavior... Sucks that you had to go through all that... Sending all the virtual hugs ❤️",
            "I (a man) am reading 'Why Does He Do That' by Lundy Bancroft, after it was recommended in a Reddit post some months ago. My partner is at the final stage of divorcing her controlling husband, who, in the scheme of things probably doesn't rank as all that bad on the spectrum of abusive men. Nevertheless, it's good to read Bancroft's explanations of how abusive men act and think post-breakup. I highly recommend you take a look so that you can have some guidance in navigating this next stage of your life.",
            "Ah man!! So sorry to hear. You’re free from him now thank god. He will miss you. To bad for him!",
            "You couldn't have done anything to prevent it. It's totally on him. He's a jackass. Just be glad you found out now and don't have to waste another day of your life being abused and manipulated.",
            "I hope to god that you don't have any kids.\n\nGood that you got out. It's bad enough for a single couple but it becomes another thing altogether when kids are in the equation. Situations like this have a major impact on their psychologies and behavior. It's a vicious cycle of the kids feeling 'wrong' or 'guilty' and society ganging up on them.",
            "I'm so sorry. It isn't really that uncommon though, to have a sudden escalation in abusive behavior. Cheaters always see their own actions in others, too. I spent three years in a relationship with someone who constantly gaslit me and accused me of cheating. Like, I was totally isolated from every other person besides him, and he still would tell me over and over again that I'd \"cheated on him and was in denial\" to the point where I genuinely thought I might be crazy. Meanwhile, he'd cheat in really obvious ways, that'd he'd gaslight me over afterwards so I felt even crazier. Despite this, he never laid a hand on me until the last few months. It can just... bubble over, you know? I'm so glad you got out and that you're safe. You're probably going to have like a LOT of people tell you how to feel, but just trust your own feelings and process it in your own way.",
            "Reality is often disappointing",
            "[removed]"
        ]
    },
    {
        "post_id": "er9lo4",
        "author": "hurtbuthopeful_12345",
        "title": "UPDATE: I caught my (24f) boyfriend (26m) talking to findoms again and I finally left. He never changed. He never wanted to.",
        "url": "https://www.reddit.com/r/relationships/comments/er9lo4/update_i_caught_my_24f_boyfriend_26m_talking_to/",
        "score": 4020,
        "num_comments": 198,
        "created_utc": 1579503160.0,
        "selftext": "link to the original post: [link](https://www.reddit.com/r/relationships/comments/9y9dvs/i_caught_my_24f_boyfriend_26m_talking_to/)\n\nI wasted another year of my life by trying to help a person that never helped themselves and I'm paying for it in every way imaginable. I introduced him to the r/stopfindom subreddit, we went to therapy three times (only initiated when I caught him), I tried avoiding it, I tried confronting him. Nothing worked because he never stopped\"the cycle.\"\n\nI was going to study abroad in Asia in December and I did not need this on my mind before I went. So very impromptu on Nov. 16, I decided I could not be with him anymore.  I was sick of feeling used and lied to about something that he didn't need to lie about. I didn't have solid proof. I just had it mentally because I felt he was hiding something from me. And he wasn't trying to fix our relationship at all, even though he swears up and down he did.\n\nInstead of handling it well, he shows me an engagement ring his mom gave to him as I was breaking up with him and begged me to stay again. We didn't speak at all while I was away and I wish it stayed that way. I came back early January and our lease isn't up until February so I decided we could live together until then. And it was great until Monday, or at least I thought so anyway. We were talking openly about our feelings and he kept apologizing for everything that went wrong.  He still wanted to be my friend. (Hard no.)\n\nIt wasn't until this last Monday, that he got a new phone and switched over his sim card to his new one. While he was at work his old phone kept going off so I looked at it. I fully acknowledge that since we aren't together I had no right to go through his phone but the shit I found makes me feel no guilt what so ever. If anything, I'm proud I can see him for who he actually is.\n\nI found out he went to see one of the doms he was cheating on me with in LA and never stopped talking to her, even before we broke up. And in $15K in debt from sending multiple doms money (SN: he always told me one of the traits he doesn't like about me is how badly I handle money. HAR HAR. Projecting much?)\n\nAfter I saw this I puked, packed a bag and left. I texted him that I am leaving and unless it was about the apartment, I never wanted to hear from him again.  We've been avoiding each other since. I've been slowly moving my things out and putting it in storage and I just feel emotionally defeated.\n\nI went through three months worth of messages and found a few interesting things other than the nudes, videos and pretty subpar sexting. He acknowledges that he lied and that he had an intimate connection with her. To which she replies, \" That's called deceit not cheating.\" He's glad that it was her. Glad that he can finally make someone happy. Glad he can please his goddess. Glad to be \"free\". Upset that I never understood him.\n\nwow. what a goof lol.\n\nHe is so disillusioned and addicted to this lifestyle that he genuinely believes she cares about him and that he's in the right. He thinks she's actually his friend, while she goes out to dinner with her boyfriend with his money and using him for emotional support (something he complained about to her about me. And how he loved emotionally fucking with me.)\n\nShe is being paid thousands of dollars to stroke their ego though, so I think I would understand that you have to keep the customer happy. She got $500 off of that LA visit which is pretty impressive if you ask me.\n\nI feel like I should say that I respect sex workers and everything they do A LOT. But this specific dom is manipulative and has no boundaries. She is a half baked amateur at best who really has no clue on how to even pretend to know what she's doing. She gives actual doms a bad name.\n\nAnyone who is a proper dom and actually cared about their subs well being would never do the shit that these two concocted. Like sending me a picture of her ass and saying she only did it because he asked her to. Asking him how he's going to spoil me today and him telling her that he's going to take me to get my nails done as a surprise. Him telling her how unappreciative I am of his gifts because they don't feel genuine (which they weren't lol.)\n\nI never consented to any of this and this shit has fucked me up for life. But get this, she's an advocate for mental wellness. What a joke.\n\nShe praised him for getting out of a toxic relationship and was glad he could be \"free\" from all of my nagging and that I wouldn't hold this over his head anymore. (again, either she's really good at customer satisfaction or a really shitty person. More than likely both.) But he never told her that I was the one who actually ended the relationship.\n\nBut yeah, he never changed. He talked a big game but is so deep into his addiction and himself that he's willing to risk everything for it.\n\nI should have listened to everyone's advice and left when I had the chance. I shouldn't have moved in with him. Instead, I was emotionally abused by a narcissist who felt that \"he did everything he could.\" A direct quote he said to the findom he never stopped talking to for the past six months.\n\nTo those that are questioning and still have hope for the hopeless, get out while you can. You can’t change anyone that does not want to change themselves. You can’t convince someone they’re in the wrong once they see that they’re in the right. You may think that other people may not know them as well as you do. It’s just something you tell yourself to avoid the actual truth that you’re sacrificing yourself for someone who won’t even do the same for you. Take care of yourself first because you’re only damaging yourself in the long run.\n\nSorry if this looks all over the place btw. As happy as I am that I made the decision to leave, I am super depressed and feel like I failed. I know this is all his fault, but I feel like I should have seen this coming. That besides this one thing, he was amazing. But it was a lie. Reddit really helped me the last time and that’s the only reason I’m posting here.  Because I haven’t slept in the past three days and could really use some support and will probably regret posting this later lol.\n\n&#x200B;\n\n&#x200B;\n\ntldr; I left my lying findom addicted ex and while I'm emotionally destroyed and angry, I'm glad I left. Send good vibes.\n\n&#x200B;\n\n**Update:** Holy Canoli! I went to sleep and came back to 1.0 k upvotes. Thank you for the Platinum and the Silver! I truly appreciate it. The comments are overwhelming and I'm trying to upvote them all but I am beyond grateful.\n\n&#x200B;\n\nA couple of notes:\n\n* For those that don't want to google, **findom is financial domination**. A more direct definition is ***financial domination*** *is also known as money slavery and is basically a fetish of people who want to be controlled by another person in exchange for money. They pay people for controlling them and the one in charge is known as a financial dominatrix. Usually, a male is the submissive who is referred to as a pay pig, a money slave, and even a human ATM because the findom can shell out as much money as they can from these subs.*\n* I don't have a problem with findom. We actually tried it together. I was uncomfortable with it mainly because I linked it with his cheating and lying. I expressed that I wanted to be monogamous and he stated that he wanted \"help\" and felt \"sick\" and wanted to change. I said that if this is what he wants to do that's fine, I'm fine with that but I don't want to be deceived and used. Just communicate with me. But as I found out from the messages, he loved emotionally manipulating me and loved to see me hurt. He got off on my pain, a direct quote. He got off on mentally abusing me, and that's not ok.\n* He also had a homewrecking fetish but I guess it loses the appeal if I consent to it I guess.\n* mini-rant: **DON'T DO THIS TO PARTNERS WHO HAVE NO INTEREST IN YOUR KINK OR YOU HAVE NOT HAD THAT CONVERSATION WITH THEM ON WHAT THEY ARE OK WITHIN THE RELATIONSHIP. COMMUNICATE! GIVE THEM THE OPTION TO DECIDE ON WHAT THEY ARE COMFORTABLE WITH, NOT WHAT YOU THINK THEY'RE OK WITH. DON'T HURT SOMEONE ELSE IF THEY EXPRESS DISINTEREST AND GIVE YOU AN OPEN OPPORTUNITY TO LEAVE, BUT YOU ARE SO SELFISH THAT YOU RATHER LIE TO THEM AND PUT ON A FACADE OF \"WANTING HELP\".**\n* you can probably find his post on r/stopfindom. I won't link it here but if you're curious it may be still there from like a year ago.",
        "permalink": "/r/relationships/comments/er9lo4/update_i_caught_my_24f_boyfriend_26m_talking_to/",
        "comments": [
            " At least you can be out of this with absolutely no doubts. You gave him every shot to change, he was never going to. \n\nBreak-ups are shit but I am glad you’re free and about to be in a much better place",
            "You did your best out of shit situation. Your ex has an addiction and addict can't get sober until they want to. Take care of yourself, sending good vibes and shit",
            "You got this. You gave your all to help out and yet, even though you now see it as obviously he was not changing, you stayed true to yourself and kept on what you believed and at the end that is some great awesome shit to do. Not everyone will be able to be helped, and you are right, no one who doesn't want to get better, will get better no matter the help, that's the shit with mental health, you either put your own thoughts to help or you're fucked. \n\n&#x200B;\n\nTake this as a lesson for what you don't want in a relationship, and to confirm what you do want in a relationship. You sound like a real good game so don't let yourself get too beaten down for this. \n\nRemember this one phrase that got me out of the gutter:\n\n\"You only need to be strong when you are standing on the ledge, any other time be free to break free.\"",
            "im so so proud of you. leaving people is hard, especially when they beg you to stay. i can tell you're a great person and you did your best to keep the relationship alive. you can't stop other people's actions even if you wanted to. im still learning that. if he wanted to put effort into stopping, he would. i know you'll be way better off without him even if it doesnt feel like it right now. and im sending good vibes your way and hoping the healing process doesnt take long.",
            "You likely won't see this, but you are not a failure. You did not fail. As I read your post from a year ago and your update, I couldn't feel like you were me (except the man I dated for 3 years was addicted to video games and cam girls). The progression of everything you wrote (I did the thing- I snooped; I shouldn't have, but I snooped again) was just ME and honestly, I hated being that person.  \n\nWhen we finally broke up, it was during a period of things being \"fine.\" No fighting, no signs of video games or cam girl expenditures. But his phone went off once in the middle of a netflix and chill night and I thought, \"Huh. I am never going to be able to hear things like that and not cringe or get a sinking feeling in my stomach.\" The sound of him receiving alerts on his phone was like a Pavlov's reaction for me to feel like shit. So I ended it.  \n\nI just want you to know that what happened to me didn't ruin me forever. I met my husband six months later (and we've been together almost six years).  \n\nThis is your learning experience. You will learn to love yourself first before you can love someone else. You have learned to NEVER be taken advantage of again. You have learned the signs to walk away early. You have learned not to ever waste a minute of your time on someone who makes you feel like crap.",
            "Wasted almost 4years with a person just like this.  He never stopped lying and cheating up to the very last time we met. \nGood on you for geting out.",
            " I can tell you beyond the shadow of a doubt that someday you will look back and you will be so proud of who you were and how you handled it. Know how I know? Because 35 years later I’m still embarrassed over some of the decisions I made at your age. Hopefully it won’t take 35 years for you to forgive yourself and understand that you did the best you could with what you had.",
            "I'm proud of you for being done with him. He sounds pathetic.",
            "I cant even imagine what it must have felt like reading those messages. I know it sickened you, but at least in a way they set you free because you know now he was always a liar and absolutely deluded and nothing you could have done would have changed that. Go on, live your life the way you want to and never look back. Dont even grace him with a thought. Feel no shame because why should you be ashamed in believing in into goodness of other people?",
            "Imagine being tied to that fucking shitbag for the rest of your life. What a literal anchor that would have been - you're a deadset legend for not falling for his shitty ring ploy. \n\nTake some time to look out for the only person whose mental wellbeing is worth looking out for - you - and once you're done with therapy, enjoy your financial solvency. You can do this.",
            "As a sex worker, $500 ONLY for a whole ass VISIT ? That’s extremely low from what I’ve seen. Just saying Lol.",
            "You're not defeated, you won you're life back. It's just going to take a little time to heal and roll with the breakup grieving process we all go through with a narcissist despite their royal shittyness.\n\nJust one thing, what's a Findom?\n\nPlease don't make me Google that, LOL.\n\nEDIT: Nvm I googled.",
            "Wow. That story was a train wreck from start to finish. I'm proud of you for studying abroad and coming back more sure of yourself and not putting up with his BS anymore",
            "\\>  sending me a picture of her ass and saying she only did it because he asked her to.  \n\nWTF? Block this person. Block him too obviously if you haven't already and tell them to not contact you again. You have 0 reason to be in touch with them at this point. You don't need to be in contact with him about the apartment--get your things out on your own and contact the landlord if you need to do anything with the lease. If your ex or his prostitute contact you again, especially sending you explicit material, take it to the police.",
            "Well done. You won't regret this.",
            "> You may think that other people may not know them as well as you do. It’s just something you tell yourself to avoid the actual truth of that you’re sacrificing yourself for someone who won’t even do the same for you. Take care of yourself first because you’re only damaging yourself in the long run.\n\nBeyond true, well put.\n\nIf someone isnt putting forth the effort to change because they want to be better, there is nothing to be done.\n\nYes, you can bend over backwards for someone, what if they won't for you?\n\nAre they worth it?\n\nCongrats to you for the courage it took to leave a man you loved. He didnt deserve you. Liars and manipulators use pretty words all the time to get what they want and avoid consequences. Their actions are what is telling. And his actions told you he didnt care.",
            "Wow he emotionally fucked with you and made you the butt of his whims with his paid dom. She is unprofessional as hell and what a moron he is, I'm so happy to hear you've got out",
            "Just wanted to tell you that I feel really sick and angry for you. This is so horrible. \n\nThe good news is you’re not the one addicted to sending strangers money. You get to move on from this and live a normal life; he doesn’t. \n\nI’m sometimes still angry with myself for how I allowed myself to be manipulated/abused in previous relationships, so I’ll give you the same advice that I give myself: forgive yourself for not knowing what you know now.",
            "[removed]",
            "You did good. Almost wasted 2 years of my life for someone who’s words meant nothing. Saying things over and over again about how he does his best and everything. But boys with an addiction never change. I’m still recovering from it and moving on is hard. But you’ll survive.",
            "Findom, I keep finding more and more twisted things that humans can do.",
            "I know it is so hard right now, but one day you will look back at this and laugh at how you thought he was the \"one.\"",
            "Wow OP I’m so sorry this happened to you! we had such similar stories that I thought I was reading my own. You’re not alone! I’m here for you, please reach out if you want to talk about it.",
            "Its done now. It hurts as its fresh, and it will hurt for a while, but it gets better, and when it does finally get better you will feel empowered to better yourself, you will feel like you shed an old skin, and will be full of new life, and the best part, you get to find some one else that is special to you and you get to be lost in them. You'll forget the shit that happened, (eventually). But, ensure you take away new lessons. Learn from this crap shoot of a relationship, better yourself, make yourself stronger, and give some one that deserves your love...… your love, just make sure they do the same to you :)\n\nGood luck, I\"m sorry you're going through this, you got people standing behind you (even if we are internet strangers)",
            "[removed]",
            "I’m sure other commenters have probably covered what I’m about to say, but here it goes anyway:\n\nI am proud you walked away. You know in your heart you did the right thing. You are probably going to feel like shit for a while. Like you weren’t good enough on your own for this man. Don’t think like that. Here’s why:\n\nHis fetish revolves around the fantasy of a woman he will never be able to attain, no matter how much money he throws at her and how much he metaphorically grovels at her feet. No woman he ever meets in real life will fulfill his desires because the “getting to know each other” process is inherently unsexy to him. \n\nIt doesn’t matter if his internet findomme is less beautiful or less interesting than you, because the simple fact that you love and care about him is a sexual turn-off for him. That is a fundamental part of his sexuality; that will never change. He likely loves you, your body, and your personality romantically, just not sexually (enough).\n\nHe will always need a fantasy “goddess” who only exists in his mind as a one-dimensional perfect being: she’s always dominant, she never expresses weaknesses or emotions, she always has her hair and makeup done, and she exists only to subjugate men. She never feels sadness, compassion, or love (unless it’s for another man who he fantasizes about cucking himself to). She has no interests, goals or aspirations outside of dominating men and spending their money. Her only goals are to buy shoes, makeup, clothes, and use his money to go on dates with other men. It is humiliating and therefore arousing for him to be financing her dates with men he sees as better and more “worthy” of her than him. Meanwhile, he thinks you should be grateful for his scraps, such as him offering to pay for your measly nail appointment while he pretends he’s broke and PayPals her hundreds of dollars. \n\nIn reality, she’s probably just using his money to pay her rent, bills, and debt, but that’s not a very exciting idea to a man who is into findom. In his mind, this goddess is a woman who is wealthy purely off of her subs’ money and live a luxurious lifestyle spending other people’s money on things she doesn’t need. He gets off on the fantasy of her wasting his money instead of spending it wisely (like a real responsible human girlfriend would, because a girlfriend actually cares about him). Her entire persona is to pretend she is someone who is better than everyone else and doesn’t care about his needs. \n\nOf course, none of the aforementioned traits embody how she actually feels or behaves in real life. She’s just a regular human being who happens to be good at sex work. I guarantee she has absolutely NO interest in either your life or your ex-boyfriend’s life. The photo of her ass she sent you was your ex-boyfriend’s idea. It probably comforts your ego to believe that it was her idea to text you and that she’s just an awful human being all on her own and she wanted to hurt you, but the truth is that he paid her to do that. To hurt you. So he could masturbate to your tears and heartbreak. Let that sink in. He pushed your boundaries more and more and became more and more obvious with his hurtful thrills because he got off to your distress and knew you would keep forgiving him. At the end of the day, the only thing that mattered was his orgasm, not you and certainly not his relationship. He was a monster to you because that aroused him and he didn’t care if he lost you. You were just a pawn in his findom fantasy. Once it gets to this point, it’s not just a sexual fetish. That is his personality. He is selfish to his core, has absolutely no self-control, and feels no remorse lying, cheating, and sneaking, regardless of the consequences. \n\nIf he got to know this woman outside of her sex work, he’d immediately lose interest. It’s the “real woman” factor that turns him off. He didn’t want you to be his findomme because you’re too real for him. You’re not dressed to the nines 24/7 and treating him like a piece of dirt stuck to your shoe. Even if you were a perfect findomme during sex, doing everything he likes, he’d never be able to get into it as much as his internet ladies because he knows you as a person who exists outside of his sexual fantasies. Don’t take that personally. \n\nNo single woman on this earth will EVER be able to fully satisfy him both romantically and sexually, because in his mind, the two are mutually exclusive. Excuse my armchair psychology, but he probably has a Madonna-whore complex. Even if he got with a Victoria’s Secret model, the second she expressed her love for him he’d be out chasing a woman who rejects and insults him. His self-esteem is so low that he believes he’s not worthy of love. In his mind, any woman who genuinely cares about him is defective, because he can’t find anything worth loving about himself. That’s why he doesn’t value you. These self-esteem issues probably manifested as a young teen and he may have had an early history of being rejected by girls in school. He probably jerked off as a teen to the popular girls at school that rejected him or didn’t notice his existence. Some people internalize stuff like that and let it shape their sexual development and fantasies until it later warps into something as extreme as findom (thanks to porn culture). He has to have a girlfriend to 1) play the part in his fantasy, and 2) provide emotional support and fulfill the need for companionship. One woman will never do it all for him. \n\nIt’s okay to be broken for a while. Just know that none of this is about you, and his behaviour has absolutely nothing to do with you as a person or anything you did or didn’t do well enough. He is going to continue doing this to future girlfriends. He’s never going to stop, he’s just going to become better at hiding it (if he wants to keep his next relationship). The one positive to take away from this experience is that you were fortunate enough to meet him early enough in his life where he wasn’t already an expert at keeping this a secret. His next girlfriend may not be so lucky. \n\nIn a few years you’re going to look back and laugh at this pathetic man who is still pissing all his money away on internet women. Who one day is 35, 40, 45 years old and still doesn’t have a house or a car or a retirement fund because he wasted his life and money on findommes. Who will never be in a happy relationship because he doesn’t have the ability to be satisfied by a real woman. You’re going to be so glad you got out when you did. You came out the winner. He’s broken and you can’t fix him. Who knows if therapy will, but I’m glad you realized that sticking around for years to see if it does isn’t worth the pain. Be strong and don’t give in to him when he inevitably tries to crawl back and beg for your forgiveness when he’s lonely.",
            "I hate him and his findom SO much. She does not even sound like an actual findom, just a sociopath who is extremely evil and awful, but I guess that's why they like each other so much they have SO much in common.",
            "Congratulations for making the decision and following through on leaving him.            \n\nSeriously, congratulations. Some people would have faulted at the ring but you didn’t! You left, which you should be very proud of and celebrate.         \n\nYou have been put through the absolute wringer with this encounter and I encourage you to seek therapy. You deserve the space and freedom an  impartial ear brings to the healing process.            \n\nYou have stayed strong and you have left. That takes enormous amounts of strength and energy. Be gentle with yourself and when you can (assuming you can) take a few days to just spoil yourself with whatever makes you happy.               \n\nApply the same care, concern, support and effort you put into getting him help to yourself.            \n\nYou got this OP!",
            "Here's his post:\n\nhttps://www.reddit.com/r/stopfindom/comments/9yosk5/stopping_the_cycle/?utm_medium=android_app&utm_source=share",
            "> this specific dom is manipulative and has no boundaries. \n\n> She praised him for getting out of a toxic relationship and was glad he could be \"free\" from all of my nagging and that I wouldn't hold this over his head anymore. \n\nYeah, I don't think any individual gets into the female side of findom to be an upstanding dom, the intention is to manipulate and get paid for a faux emotional connection with ridiculously insecure men. He'll be on the hook for quite a while with that second statement, believing he's doing the right thing, just needs to keep paying her of course. Glad you got out, very weird fetish with real life repercussions.\n\n> You can’t change anyone\n\nYou can only change yourself. That's the reality and it takes way too many personal experiences for many to realize that.",
            "Sometimes you really need to let a relationship completely die to be able to properly move on, let it end when there is NO doubt that it's a shitshow. So that you don't end up having nagging what ifs or feeling uncertain, and just to feel you have confidence in your decision and that you did the right thing and are looking out for yourself. So don't beat yourself up about not ending it sooner. You loved someone and you were trying to do your best for them and for yourself, and in the end that led to you knowing you did all you could, but that it was definitely time to go. \n\nMost people have been in relationships where they kind of knew it wasn't going well, they'd been cheated on, lied to or treated badly, or just weren't compatible anymore, but they let it drag on with the hope it would get better and just because they were attached and clinging on to memories of better days gone by. Honestly in those times, it's a good thing when the hope completely dies, because that frees you, and now you'll know better what you want from a relationship in the future and how to stand up for yourself and how to know it's time to go. So all in all you've had a really really tough time, but you'll be okay, you've done the right thing, you haven't really made a mistake staying with him longer because you were doing the best you could and you gave it a real chance and you've learned a lot. Don't let this awful person make you feel bad about yourself, it's quite clear that none of his behaviour had anything to do with you, he'd do the same to anyone else, including this woman he's been talking to.\n\nYou'll feel angry for a bit, and sad sometimes probably, but in no time you'll have moved on and filled your life with other people and other things, and you'll look back at this one day and laugh about how you dodged a bullet and it'll only make you appreciate your life more, realising you could've still been stuck with this guy for years. I've been there, and the fact I went through that actually makes me appreciate my life, as it is now, more, and makes me feel proud of myself that I made a good decision for myself. So I hope that's how this experience ends up for you too :-)",
            "Good you left him, he was toxic.\n\nBut also, you should see a therapist. You sound really broken and disturbed.",
            "[deleted]",
            "He'll never be able to FIRE with a spending habit like that!\n\nGood riddance.",
            "I'm glad you got out now. He hasn't hit rock bottom yet, but he's heading there full steam ahead. Good thing he doesn't get to drag you down there with him.",
            "If you feel like talking with someone about your breakup you should call the IRS to report her for suspected tax evasion. :/",
            "Now, time to heal.  \n\nThat dom was doing what it took to get paid.\n\nYour BF is in deep and this will be his downfall.",
            "I never heard of this terminology! This is what my first ex did on drugs. I started drinking a lot and threw a drunk fit one night, and told his dad what he did LOL. \n\nA couple of months later, I broke up with him. I was sick of his drug use lol, but the whole web cam cheating and physical abuse should have been my reasons first... I was 19 when I broke up with him. So I was young 🤷‍♀️",
            "Findim sounds like the stupidest thing ever...\n\nThis dude is an idiot",
            "Good for you! Find, in good time, someone who deserves you.",
            "You took the right call. I hope you feel better soon.\n\nI wish you the best OP!",
            "You're free.  Enjoy this.  Revel in it.  You never have to worry about this man and his lies again.",
            "\"when someone shows you who they are, believe them\"\n\n&#x200B;\n\nSo happy for you, OP. It takes real strength to leave a situation like this. You will be in a way better place soon, I promise",
            "As someone who booted an ex husband for something similar, I'm here to tell you it gets so much better once you get them and their toxicity out of your life.    And if anyone else is in this situation, you need to break your image of the person *you* think they are, and see that this is who they are.   It gets so much easier to go once that happens.",
            "I'm glad you left and will find a fresh start. \n\nThis kind of situation is exactly why I personally find a lack of dating history to be a red flag.",
            "Break ups are always terrible but I’m so proud of you getting out of that situation!",
            "Dude, this girl 100% has him around her finger. She realistically probably doesn't care about you or the relationship that you had with him, but I doubt she means any of the things she says to him. She's milling him for all he's worth and, because he is such a shitty person, I respect her for that. Keep away from your ex because he's going to be in a lot of debt for a long time, when he finds out she's just using him he'll probably get into drugs and heavy drinking realizing he lost you for that and you don't want to be dragged down by that either.",
            "You're doing the right thing. I'm sorry he treated you like garbage. As for his findom? She's trash, too. Block them both and move on with your life. They are not worthy of another iota of your time.",
            "Sounds like a good choice on your end! You are smart, mature and able to recognize evil in a man! I hope you can start over and heal on your own until you are ready for the right one to come to you.",
            "I guarantee in a few years time, you are going to look back on this whole ordeal and think \"thank fuck I got away from that complete moron\".\n\nLook after yourself x",
            "You're original post gives me a feeling of sadness in the pit of my stomach. It takes me back to a past experience with a partner many years ago who had a similar online fetish persona/lifestyle (not findom, but deceptive and addictive all the same). I am so sorry for what you are going through, but am proud of you for leaving him and moving on. Coming to the conclusion that you can't change someone is a hard lesson but very healthy. Congrats for this big step in the right direction. You will find someone who is trustworthy and deserving of your love and commitment. Wishing you the best in your healing process.",
            "Sounds like that relationship would bring nothing but broken promises and sorrows. Best wishes moving forward with a healthy and happy life.\n\n\\~Troy",
            "Wow this is crazy, I had never heard of a findom before although it doesn't exactly surprise me it exists, this is sad. Have you made sure that personal items you own haven't gone missing? if he was really addicted than its possible he may have stolen jewelry or other valuables to sell to feed it?",
            "So sorry you went through this but so proud of you for finally getting out of that toxic situation. Try not to beat yourself for not having had made different decisions; when you know better, you do better and now you know better. Clearly, you’re someone who loves deeply about those you care about, and that’s a good quality to have. Don’t beat yourself for being a good person who tries to see the best in others. That characteristic itself makes it all the more likely that you’ll find healthy love again.",
            "I’m glad you were able to walk away. Even if he stopped, the lack of trust would have caused many issues in the relationship. IMO, trust is something that can never be fully rebuilt.",
            "How can she be an amateur wen she's making thousands off ur foolish ex? Seems like she's playing the game well to me.",
            "Not the same, but my wife caught me using drugs 2 months ago behind her back. I had been using daily for about a year, and was a severe binge drinker in weekends. Also, started trying to order drugs online.\n\nAfter I got caught I got pissed and tried to make it look like she was overreacting. Our marriage was on thin ice. I was so pissed and felt so right I left for a few days to a hotel and turned off my phone. After getting back home we talked a bit. I went to my therapist and talked. I was finally able to realize how poorly I was treating myself and everyone around me.\n\nI've made massive changes. Quit everything, go to sobriety meetings daily, exercise daily, have a whole new group of sober friends, journal, read, draw, and I am extremely honest with myself and others. I am also trying to volunteer to help kids that come from troubled homes.\n\nPoint is, a person can absolutely get help and change, but its total committment and very obvious they have changed. I'm absolutely not the same person. Our life is way better now that I'm getting help and maintaining myself.  \n\nI'm sorry for your situation, but he is clearly not ready to fix himself.",
            "Kudos to you for getting out! My ex-wife was emotionally abusive and manipulative and while at the time it hurt like hell, eventually I was able to see the Forrest for the trees and realize what a terrible person she truly is. Things well get easier and after a while your heart will catch up with your head and you will really be able to accept and move on. Some of us think that because we try to be good people that we can help others. But some people don't want to be helped. That drive has to come from within and sometimes there's no action we could or could not have taken that would have affected the final outcome.",
            "Glad you’ve left this dude. What a disaster it would’ve been to marry him. \n\nAlso, preying on weird, lonely dudes and squeezing tens of thousands of dollars from them for nothing isn’t anything commendable. No need to “respect sex workers” who do this.",
            "this is the largest yikes of an ex I've seen in a while. think of it this way: you just lost more than 100 pounds.",
            "I was in your position a few years ago. I stayed too long. Leaving, while hard, was one of the best decisions I’ve made in my life. It’s hard losing a love, and a best friend, but you can’t force someone to change. Addiction is rough, I’m sorry you had to go through this but you seem to be ready for your next steps in life. Best of luck to you and your new adventures to come. You’re just beginning!",
            "I actually cannot believe you stayed with him after putting you through all that. Jesus christ. I'm glad you finally left but damn girl in future please love yourself more! Never put up with that crap even once.",
            "I don't understand findom, but I do understand not wanting to date someone who's into it. Good for you getting out OP",
            "Wow, I learnt what that fandom thing is, \nAs for the rest it’s a timeless story,\nYou need someone who can stand up for the both of you, \nNot a weak man.\nGood luck!",
            "The fact you think anyone gets into doing doms for any other reason that to make money, is the excuse some use. They all do it for the money if they didn't make good money doing it then they wouldn't do it.",
            "These fetishes are not normal-it speaks to a much bigger problem. You are free now to live your life. Live it fully. You did the right thing.",
            "How do I become a findom",
            "As you came to that conclusion yourself, I also think you should've left immediately the first time you caught him. All this dom, sub nonsense is truly just... nonsense. I cannot explain you how it doesn't make sense to me even more, because I live in Eastern Europe. You cannot easily find shit like this here. At least it is not that promoted and obvious.\n\nDo not beat yourself down, get yourself a normal boyfriend who will respect you and have sex only with you. There are so many decent guys out there who will make you much happier than you ever were. Good luck and update us if you find someone special!",
            "Go you! You made the right call for yourself, and you are going to be proud of yourself after the cobwebs clear and the emotional burden wears off. We can't always see clearly when we love someone, so don't beat yourself up for that. \n\nPlease try doing some breathing exercises, or make an appointment to see a therapist if you're able. I'm sorry you're having sleeping problems. Take yourself to a spa or do something relaxing. \n\nYou got this.",
            "te leo desde otro país realmente me alegra que la gente sea libre de relaciones así, me demuestra que todo el mundo esta jodido, pero personas tan jodidas como tu o como yo, tienen que ser autosuficientes para salir de eso. Buenas vibras y sigue adelante con tus sueños.\n\n&#x200B;\n\nPd: Me da pereza escribir en ingles. xD",
            "Just keep vibin OP you'll find someone that will love you more then an addiction",
            "From my reading of this all, you can and deserve so much better.",
            "I don't have any advice, not that you need it anymore because you've done the right thing, but I just wanted to say that I'm going through a pretty tame break up from a horribly nasty relationship, and I just can't imagine what *you* must be feeling, going through *this*. You are so, so strong for leaving. And you will find happiness again.",
            "I'm sorry you have to go through that. But I believe you are a strong person and can go through this break up too. There's always someone out there who's searching for a soul mate too, and the soul mate might be you.",
            "So sorry you went through this but so proud of you for finally getting out of that toxic situation. Try not to beat yourself for not having had made different decisions; when you know better, you do better and now you know better. Clearly, you’re someone who loves deeply about those you care about, and that’s a good quality to have. Don’t beat yourself for being a good person who tries to see the best in others. That characteristic itself makes it all the more likely that you’ll find healthy love again.",
            "It's really hard to get out of that kind of situation. The intermittent re-enforcement of sometimes it looking hopeful and them saying they want to work on it, but never really have action for the words. It's enough to keep you breadcrumbing along. It makes sense you feel a bit silly now, too, as it's so clear now. Forgive yourself for 'not seeing it earlier' and all that. Now you know what to look for and how to trust your gut more. \n\nI recently got out of a similar situation, where ultimately all the talking and begging for communication from him didn't work. Absolutely nothing worked during, and only after I said I can't be with him anymore did that spur any sort of real action..  but not really. I even tried to blame myself saying maybe I don't recognize the actions. I would ask what he was doing or what working on it meant to him. Didn't get much of an answer. Just not really interested in it. Constant emotional neglect and feeling like I was taking care of someone else for two years. I felt pretty stupid too, when I realized that nothing will change. The only change will be not being together. Now I'm totally empty inside because that took so much more out of me than I imagined. Forgiving myself for letting it go on so long is a process.",
            "My mother tells me every mistake is an opportunity to grow. Sometimes, it annoyed me how often she says it, but it truly is. Your mistakes are not something you should be sad about. They are lessons that you grew stronger from, and this is clear in how firm you were in breaking up with this loserl So good job, and keep on rocking!",
            "Congratulations on taking care of yourself by leaving a bad relationship. You are likely to feel guilty, and vulnerable and angry and sad for a while. Going overseas is a great way of getting space from him and starting to recover. As soon as you can get your stuff moved out the quicker that process can start. From my extensive break up experience Replaying all of the worst aspects about the relationship and all of the ex’s worst qualities in my head felt helpful when I felt guilty or wished things were different. A lot of us were raised to be accomodating and try and work on problems and to be selfless and a nice person, and that can keep us in relationships with lots of red flags and unhappiness for a long time. While being willing to work on problems is a good quality it needs to be balanced by a understanding of what we need in relationships - like honesty, communication and respect (all notably absent in this case as far as his behaviour). Relationships should not make you unhappy, distrustful or betrayed. It might feel helpful to use this experience to develop a strong idea of what you want in relationships in the future, and what are now clear indications that someone isn’t right for you. Good luck, I hope this next phase of your life is wonderful.",
            "Oh man. I feel soooo sorry that you had to endure this for so long. But I’m glad that you’re away from that toxic situation. This man cannot be helped and I can almost guarantee that he will never change. It’s also hilarious how he thinks these women really care about him. Can’t he see he’s just a financial transaction to them? It’s literally their job...\n\nI do know how you feel, even though your situation was much worse than mine. I also had an ex who was into similar things. Secretly going onto cam sites, talking to cam girls, being their “friend,” giving them all kinds of money, lying to me about stopping... asking for exclusive stuff. I told him I considered it cheating but he didn’t see it that way. Instead lied about stopping, but always got caught. \n\nI feel bad for the girl he’s with now. Poor thing is much younger than him, first relationship, she has no idea. :(",
            "You'll be better off. He'll be better off. This was a wise move, and yes, you never have to doubt that you tried everything under the sun. Walk away with your head held high and find that person that's deserving of your loyalty. Maybe this will be a wake-up call to him that he needs to straighten up or stay single. But don't waste your time worrying about that. You did your duty, you tried, and you survived. I hope the best for you and I hope your studying turns out well. That alone is an adventure worthy of being happy and unattached to things that only drag you to the bottom.   \n\n\nIt's not your place to mother him and ensure he's not giving some random woman money for some kind of kink. You're right, he needs to be honest, not just with who he's with, but himself too. If you ever feel like you have to hide stuff in a relationship then you shouldn't be in that relationship. It only devastates your partner because they're not being told the truth and being lied to. You didn't deserve that. A partnership is working together in everything, not hiding things and acting like a child as he did. And yes, it's childish to go around behind your partner's back being sneaky about anything. Hold your head high my dear, you are on to better things, places, and times.",
            "I don't know much abut relationships, but I know no one deserves what you went through.  \n\n\nKnow that I hope you heal soon. Sending good vibes... NOW!",
            "I used to be in a very similar situation in terms of the cheating and lying and gas lighting. The addiction to cheating behaviour, crying he wanted to change and was\"sick\", but actually getting off on my pain. That period of my life was rough as hell, and it fucked me up too. And this was all also when I was 24.\n\nBut now, as I'm about to turn 26, I've moved in with the sweetest, kindest man. There isn't a bone in his body that would ever think about lying to me and it's incredible. \n\nIt gets so much better. Thank God you're out of this to make room for something amazing that you deserve.",
            "This would go great in r/JustNoSO!!!",
            "I just found out my ldr gf was in a 24/7 slave relationship and consistently lied about it and denied everything so I completely understand. Sometimes you just have to walk away while you still can.",
            "I am a finDominatrix and I can tell you based on the clients I have had that men who are addicted to this fetish they are likely to never change. I had a client. I named him \"slug\". He would call me on skype as soon as he got home from work since his wife wouldn't be home yet. All the doors inside his house had been removed because she couldn't trust him.",
            "Question for OP: If you could go back would you avoid reading the text on his phone?\n\nIs knowing the details of the betrayal worth the pain?\n\nI ask because I recently was in a similar situation and regret knowing the details but I am wondering if that will change with time?\n\nP.S.\n# THANK YOU FOR YOUR POST",
            "Thank you, thank you, I am literally about to see my partner and everything you have said about the lack of communication is hitting so hard right now.",
            "I’ve learned from two years of findom that the homewrecking fetish is best kept to clips and MAYBE sessions. They’re just usually not doing things in a healthy way, and I’m sorry that that’s what happened here. Extremely hurtful way to do findom, especially to you. Best thing you can do now is rejoice that you had the good sense to get him out of your way.",
            "What a nightmare. I cannot fathom how someone could be into that. Like I don't like selfish ppl, but someone who has no self preservation instinct is just as crazy. if a girl wanted me to give her all my money for no reason, like... What? That's the allure? How hard you just got fucked over by this girl? I've never gotten the humiliation thing. idk how that could make a guy feel good on any level",
            "It's awful that you went through this. And you sound extremely cynical about it - understandably so! Thinking you were foolish to stay with him when people told you to leave, advising people in similar situations to leave instead of wasting their time on someone who doesn't deserve it.\n\nNow I'm in the \"it's totally fine that r/relationships tells people to leave very often\" camp, but I also think that the impulse to stay with someone because you love them is understandable, and not only understandable but good and admirable and part of the glue that makes humanity possible as a social species. It's the Prisoner's Dilemma issue: if people can cooperate they will do better than people who don't cooperate, but taking advantage of people who cooperate is better for the person taking advantage than cooperating would be. Social species work by using various techniques to get around this - such as developing signals and strategies to figure out other people's motives, developing innate tendencies towards altruism that make one trustworthy to others who wonder whether to cooperate, remembering which people have been trustworthy in the past and which have screwed others over and cooperate only with the former...\n\n&#x200B;\n\nWhat you've run into, is (what I believe to be) the comparatively uncommon case of a defector who successfully exploited your cooperative impulses. It is understandable, and probably even correct to be somewhat less trusting in the future, to try and identify retrospectively which signs would have allowed you to get out of this earlier. But I think you shouldn't completely renounce on your cooperative impulses to begin with, because they're what can make you successful if you run into cooperative people in the future. In other words, just because this guy never deserved it doesn't mean your impulse to love him and forgive him and help him was stupid or wrong. That same impulse could have led you to a very happy relationship with a different person; it's what can allow a relationship to survive and flourish between people who are different and conflictual but fundamentally well-meaning, and that can drive those people to become the best versions of themselves.\n\n&#x200B;\n\nI'm not saying this to put pressure on you to open yourself to others right now. This just happened, you will need time to heal and come to terms with what happened. I just hope that even as you draw lessons from what happened, you look with some compassion at past you and understand when she made the best decisions she could with the information she had at the time.",
            "Nicely done. Very nicely done.",
            "SO SO very glad you are out of that relationship! He is toxic to YOU , not the other way around . Unfortunately there are enough “ people” like this in the world they have written books . REALLY . you are not alone , you are safe AND  you have some very powerful life lessons . Don’t look back , you’re not going that way ! Good luck to you .",
            ">mini-rant: DON'T DO THIS TO PARTNERS WHO HAVE NO INTEREST IN YOUR KINK OR YOU HAVE NOT HAD THAT CONVERSATION WITH THEM ON WHAT THEY ARE OK WITHIN THE RELATIONSHIP. COMMUNICATE! GIVE THEM THE OPTION TO DECIDE ON WHAT THEY ARE COMFORTABLE WITH, NOT WHAT YOU THINK THEY'RE OK WITH. DON'T HURT SOMEONE ELSE IF THEY EXPRESS DISINTEREST AND GIVE YOU AN OPEN OPPORTUNITY TO LEAVE, BUT YOU ARE SO SELFISH THAT YOU RATHER LIE TO THEM AND PUT ON A FACADE OF \"WANTING HELP\".\n\nYou should have parted ways when you realized he had a link/sexual fantasy that wasn't compatible with your sexual desires and fantasies.",
            "WOW. I *always* believed that findom was just a scam women made up. I had no idea men actually fell into shit like that. What a joke. I'm happy you moved on. You deserve much much better.",
            "Another porn addicted loser and an empowered sex worker taking part in deceit for profit. I am sorry you had to suffer through this. Good luck.",
            "It's an addiction like anything else. Sometimes you just have to leave.",
            "Kinda afraid to ask but curiosity compels me... wtf is a findom?",
            "not my tempo. congrats on getting out\n\nI findom myself with an IRA",
            ">I feel like I should say that I respect sex workers and everything they do A LOT. But this specific dom is manipulative and has no boundaries. She is a half baked amateur at best who really has no clue on how to even pretend to know what she's doing. She gives actual doms a bad name.\n\nI would encourage you to rethink this part.\n\nYou can respect sex workers and advocate for their well being without respecting the actual work itself.  Your boyfriend and other men exploit women through porn and prostitution.  The way your boyfriend treated you throughout your relationship is appalling.  And it's even more disgusting that he seems to believe he can just \"buy\" women off the internet. All to fulfill some weird fetish.",
            "Besides the fact that one of the ingredients was dog crap, the sandwich was amazing!",
            "Pro tip: \n\nAll fetish stuff works like this. Most of it isn’t overtly, visibly as harmful as not having the money to pay your bills, but all of it is exploiting psychological damage.",
            "You made the right call in leave.\n\nI still feel bad for your ex. It sounds like he really is in need of help. I hope he finds it.",
            "TIL Findom... And I can literally see this happened between Masayoshi Son and Newman, \"me so crazy, give me money\" and Masayoshi \"yeah, baby here's a billion, no make it 5 billions\", \"yeah, Kombucha for everyone in the planet, so crazy\" ....",
            "I can understand you are venting, hurt, and feel betrayed; but solely putting the blame on him, is wrong and truly cheating yourself from growing and learning. You said it yourself, you shouldn't have moved in with him and you should have ended the relationship a long time ago, especially after everything that you saw and learned. \n\nYou have to take your part in this, learn, and make sure YOU don't allow this or anything similar to go on! \n\nHe lied to you more than once in the past, and betrayed your trust multiple times. You had ample time to leave, but you didn't.  Im not taking that asshole's side at all; but the anger you feel towards him and her, should be given to yourself as well. The only way you can grow from this is by seeing the situation objectively, don't play a victim, and move on.",
            "So sorry to hear about this.  What does bdsm stand for?",
            "I'm not saying it's cool he did this behind your back. It was not. No at all!! But you basically kink shamed him so badly he continued to feel the need to hide all of this from you. Did you ever try asking him about his obvious fetish to better understand why? Again, yes he betrayed you. But you also kinda betrayed him by shaming him so badly. The kink worlds is obviously not for everyone, but you dont have to shame him for it either.",
            "[removed]"
        ]
    }
]