[
    {
        "post_id": "docv8v",
        "author": "TAyepyepyep",
        "title": "My (36M) wife (34F) gave up a high paying, high stress job for a lower paying job that she enjoys. Now she feels like she doesn’t “contribute” enough in our relationship. How can I help her get past this?",
        "url": "https://www.reddit.com/r/relationships/comments/docv8v/my_36m_wife_34f_gave_up_a_high_paying_high_stress/",
        "score": 4021,
        "num_comments": 330,
        "created_utc": 1572287081.0,
        "selftext": "My wife (34F) and I (36M) have been together for 5 years, married for 3, and have no children.  For our first few years together, she was a full time attorney working 50-60 hours per week.  At that time, her income was approximately 40% higher than mine.  The income disparity did not bother me at all (I mean, who doesn’t like more money… hah!), but neither of us was happy about the amount of hours she had to spend at work.  When we met, she was already pretty burnt out and unhappy with the stressful job.  I tried my best to be supportive and encourage her to look for other jobs that would be less stressful.  She was open to it, but knew it would be a big pay cut.  She said she would rather stick it out for a while longer so we could pay off her student loans and save money for a new house.\n\nOnce the loans were gone and we had moved into our new home, she found a part-time (\\~15 hrs/wk) job working from home doing something more in line with her interests.  Her stress level went way down, and so did her income.  She still makes very good money, but her income is about a third of her previous job.  This is absolutely not a problem financially.  My income has steadily increased and she’s still bringing in plenty.  We are doing great and have no money problems.  I have no regrets about any of it.\n\nThe thing is, every once in a while, she’ll mention that she feels sad that she doesn’t “contribute” because her income is so much lower than mine.  I tell her this is absolutely not true.  Not only does she still have great income, but she contributes in so many other ways.  Since she has a very flexible work schedule, she is able to do most of the household chores, takes care of errands during the day, does a lot of the shopping, etc.  She basically keeps our household running.  But I think in her mind, the work she does for our household does not make up for the loss in income.\n\nShe recently found out we are eligible for health insurance through one of her attorney organization memberships.  She sent me the details, but it turned out that our current plan we have through my job is still a better deal.  I texted her and said I looked into it but we should stick with what we have.  When I got home from work, I could tell she was feeling down.  She told me she had gotten excited at the possibility that we could use something through her work and that she would be providing something major.  She was crushed when I told her we shouldn’t use it.  I felt terrible…\n\nI’m sure part of the problem is that when we met, she was independent and doing very well on her own.  I think she now feels like she has become dependent on my income, and that makes her feel bad.  Also, she went from working 60 hours/week to around 15.  So she has much more extra time to enjoy life, but I think she feels guilty about it.  I’ve told her many times that the money is not important to me, she contributes so much more than a paycheck, and I’m much happier now that we can spend more time together.  I think she understands that, but she is still hard on herself about it.  She’s not a money-grubbing person, but she has said she often thinks about all the money she has given up by quitting her high paying job and how much better off we would be financially if she stayed there.  But, luckily, she remembers how awful the work was and knows she does not want to go back to such a stressful job.\n\nI was wondering if anyone might have some advice on how I can make her feel better about her contributions to our relationship.  She knows that I’m so much happier with our current situation, but she still has issues with it internally.  I don’t know what else to do other than to keep telling her how much better things are now, even with less income.  If anyone has experienced this (on either side), I’d love to hear how you dealt with it.\n\nThank you!\n\nTLDR: My wife’s income decreased quite a bit.  While we are doing fine financially, she said she often feels sad that she doesn’t contribute as much anymore and feels that she has become dependent on me.  I’m looking for advice on how to convince her that she contributes more than her fair share.\n\n&#x200B;\n\nEdit: I wanted to say thank you so much for all of the replies! Also, there are a couple of questions I figured I’d try to explain here:\n\nWhy did she cut her hours down so drastically (60/wk to 15/wk)? \n\nWhile she was working at her old job, we decided we wanted to start a family. The ideal situation was for her to get a low-hour, flexible, work-from-home job so she could be a stay at home mom with a little bit of income on the side. This job popped up and it seemed almost perfect for us. Unfortunately, the baby has not come as quickly as we had hoped (which we knew was a possibility). So we are kind of in limbo where she doesn’t want to quit her current job or start a new full-time job because she could get pregnant at any time. \n\nCan she increase her hours from 15 to XX? \n\nWithout going into much detail, her job essentially gives her “tasks” each week. They vary in difficulty, but usually take her about 6-7 hours each. She normally gets two a week, but occasionally they have an extra for her. Unfortunately, her employer does not have enough tasks to steadily give her 3+ each week. So she’s kind of maxed out where she’s at. They are flexible in that she can request to only get one (or even zero for a short time) task a week.",
        "permalink": "/r/relationships/comments/docv8v/my_36m_wife_34f_gave_up_a_high_paying_high_stress/",
        "comments": [
            "I'd also remind her that there's more to \"contributing\" to the relationship than just money. I had a job some time back where I earned a great living, but the stress levels were so high that I literally had panic attacks some days! I eventually left that situation for my own sanity, and now I'm in a place where I earn less, but I'm so much happier. \n\nThe lower stress made it so I could be a better husband and father. That was (and is) worth so much more than money!\n\nHealth (and mental health) >>> money.",
            "Communication is key, so in your shoes, I’d try reminding her of the things you said here.\n\nThere are many more ways to contribute outside of financially and it sounds like she’s awesome at it.\n\nMy advice would be to make sure you’re verbally appreciative and hopefully this will help her feel better.",
            "Can she volunteer her legal skills to a charity and a cause that she cares about?\n\nIt might not bring in more income but it could provide her with a sense of fulfillment to get her through this career change.",
            "Perhaps she would benefit from seeing a therapist for a little while. Such a major change in income and working hours (especially if it was very important to her /felt like part of her identity) could feel a bit like a loss of self.",
            "[deleted]",
            "You say she keeps the household running by doing all the errands - how about increasing verbal affirmation of these things so she feels like she is contributing? Saying things like \"wow, did you clean? The house looks amazing\" or if she cooks \"wow this meal is great, I really love coming home to a hot meal\" might help her realize she is truly contributing. It isn't your fault at all that she feels this way, but maybe it could help if you went out of your way to help her realize that that is not true.\n\nI also read that you plan on having a child soon - she may feel differently once she is busy raising a baby. It sounds like you two really love each other and you sound like you care a lot about her happiness, which is very sweet! I hope in time your wife will realize that money is not the only contribution you can make to a household.",
            "Going from a 50-60 hour lawyer job to 15 hrs/week is a huge change in life style and also mental stimulation/challenge that housework can’t replace. This maybe unpopular opinion but your wife needs to find a job that challenges her more and leaves her feeling validated and honestly that keeps her more occupied. If her current job was truly keeping making her feel validated and like she has a purpose, she wouldn’t feel the way she does, regardless of the money. An idle mind finds a way to cut itself to shreds fixating on things. House hold chores cannot be purpose enough for people with active minds, especially with no kids. I’m not going to tell you to tell her to find a hobby because that’s super patronizing and a waste of potential. Tell her she needs to work more hours in this thing that she says she likes. Or else, search for a full time job that gives her balance and allows her to meet her professional /life goals. She obviously needed a break to recover from her demanding job, it’s now time to figure out the next step. Good luck.",
            "My husband gave up his soul-destroying but high-paid attorney job when I started making enough money to support us and after going solo for a while, is now a full time SAHD.  I can tell he has some of the same feelings even though I totally support him staying home.  \n\nI suspect there are a lot of things tied up in this beyond just wanting to feel \"productive\".  She's probably gotten a lot of validation along the way for being smart and hardworking and \"doing something\" challenging like law.  If you have a lot of your self-image tied up in your work, as a lot of people in prestigious careers do, it can be hard to lose that external validation, especially if she's got friends who are still in law or medicine or whatever.  \n\nSimilarly, giving up career/income is a high-risk choice for people, especially women.   It certainly can be the right choice, as it has been for us, and it sounds like you have a strong marriage, but every woman has heard stories about someone who was home with the kids for 20+ years and whose marriage broke down unexpectedly leaving her 15 years from retirement with no real prospects for making more than a bare-bones income.   She's still working, but would she be able to support herself and your kids if you died, or if you guys divorced?  It can be hard for people to articulate those thoughts to a spouse they love and are happy with. \n\n In any case, I think teasing out the real reasons may be helpful for her to strategize solutions.  Like, it won't help for her to keep a time sheet of how much time she spends on doing the dishes or taking the kids to activities if the underlying issue is \"I don't feel that I'm using my brain\" or \"I feel like my friends look down on me\" or \"I'm worried that I've fallen off a 'career' trajectory and can't get back on.\"",
            "Did she not like the job of being an attorney itself or the place/ type of law that she practiced? What I’m getting at is I think there are options where she could utilize her degrees while working less. Otherwise seeing a therapist may help",
            "If you have a job that makes you happy, remind her of that, like a lot.\n\nShe might feel bad about you working more hours, but if you're doing something you love, or fulfils you in other ways besides the paycheck, the balance might be really different for you.\n\nLike if you don't need an hour each day to decompress when you get home, or need to do a list of things to manage your stress, you have a lot more free time left that's actually free for you to enjoy. \n\nIf that doesn't work, you could always calculate how much outsourcing the chores she does would cost. If you add up cleaning services, private chef (if she cooks), getting your laundry done etc she might be saving the household a lot more then she thinks. If she objects and tells you 'but I'm home anyway', tell her you *would* need to outsource it if she was working 60 hours to maintain the same quality of life.",
            "Personally I would recommend that you consider getting a kitten or puppy if that’s something you guys are interested in, because it literally would not be possible if she wasn’t at home most of the time. Gives her a friend, a sense of purpose, a cure for the boredom, etc.",
            "This is just me shooting from the hip but I am an attorney and recent law school graduate and law school/ law practice kinda indoctrinates you into the idea that your worth comes from extrinsic factors that other people recognize as valuable e.g. grades/law review, salary, job at prestigious firm.  Before law school I could give a crap about what other people thought of me/ how I stacked up compared to them, but during and post law school I kind of struggle with whether I am up to snuff with my peers comparatively.  I'm not saying this is the case with your wife as I don't know her.  In my experience finance is a simple metric to compare yourself with other people and see how you are progressing in life.  I could argue that there are other things that are more informative than a person's income as a comparative factor; however, that assumes that value can only be realized from exceeding one's peers.  Life is finite, if earning the most amount of money possible allows you to get the most enjoyment out of life by all means pursue it (morally).  However, if there are benefits from not earning the most possible a person shouldn't view that as a personality failing but rather as a courageous act of choosing to spend finite time in the way that brings the most actual benefit.  If you sacrifice those benefits  for additional money to buy substitute pleasures ultimately you lose out on the ability to enjoy those benefits forever. (because you only live once).  This is not being selfish as working long hours in a job one doesn't like could pose a detriment to a person's health and relationships.  She is not depriving your family of additional money but rather insulating the family from spending, money, time, and emotional resources dealing with the physical and mental consequences of having a miserable family member.",
            "feeling guilty about productivity is a capitalist mindset that needs to be challenged every time it comes up. Individual therapy will help her separate her value as an employee and help her value herself as a human being without having to be a type a income provider.\n\nmy partner is disabled, chronically ill, cant find work and he definitely struggles with the productivity myth. I just remind him i value him as a person, as long as hes doing something hes ambitious about something, i dont care if it makes money. Some days are better than others, but i think if she goes to therapy and starts filling her free time with her interests, she'll feel less guilty :) maybe suggest volunteering?",
            "Is there anyway she could find a 40 hours/week job, rather than careening wildly from 60 hours down to 15? She might be happier if she worked a more \"normal\" amount of time. \n\nMy only other suggestion is therapy for her.",
            "I would definitely advise to work in her outlook before having a baby. It sounds like being a high earner was part of her identify - something she prided herself on. It’s also advice that’s often given to women - to ensure you’re self-sufficient financially & not dependent on a man, etc. (I’m not saying that’s right or the only way to arrange finances, just that it’s something that might’ve been drilled into her head.) So now, even though she logically understands that this dynamic is working for your family, she may be struggling with who she is now that she’s no longer the “high earner” & is only able to take this paycut / new job because you’re becoming the “high earner” & she can lean on you for that. So the reason I’m saying to take this very seriously before having a kid is because she’s going to move even further from “high earner” to “traditional female gender role,” which may really test her mentally if she’s not done processing this, even if she again logically understands that this is the best arrangement for your family.",
            "I think there is some sound advice here. But I just want to say that I think you sound like a really great partner. You pay attention, acknowledge and appreciate what she is doing and you want the best for her. Nice to see a good partnership on here.",
            "Has she read those articles about people's biggest regrets at the end of their life? Almost all of them say they wish they had worked less and spent more time with loved ones. It might give her a little perspective.\n\nOnce the baby comes she might even wish she has more free time, too!",
            "Are there no jobs that are between 15 and 60 hours a week? If she is a lawyer she could work at any lawfirm for 15 hrs a week. Offer them a bargin of a deal.",
            "Go 🏕 camping.. And then when both of you love it, tell that this is why you don't want her to go back grinding for money.\n\nGrind for happiness.",
            "As an attorney, I'm guessing she was billed by the hour, so she knows that time = money. Maybe try to let her know that to you - and that you're hoping eventually she'll feel the same way - the value of the time she is spending stressing less, doing work she actually enjoys, keeping your household up and running, and spending more time with on herself/with you is worth far more than any amount she was or could be paid as an attorney. Remind her that her time and her effort are worth more than just dollars and cents, but that in the grand scheme of things her life and your lives together have far more value even with the decreased household earnings if she feels more content with what she has gotten done at the end of the day, whether that be personally or professionally. I think even having being burnt out, it may take her a while to get out of the mindset of being ambitious just in terms of corporate/financial status. Maybe see if she would be interested in speaking to a counselor or therapist to get to the bottom of those feelings? \n\nWhatever the outcome, it sounds like she has a great and supportive partner by her side to get through this. Best of luck to both of you!",
            "There are a lot of good suggestions here, but maybe one thing you could look up that may make her feel better about her monetary contributions to the household would be how much her household tasks would cost if she wasn't doing it? One big one is childcare which can be very very expensive (you mentioned you are going to start a family soon) but also you could look at what it would cost if you hired someone to do laundry and cleaning, the cost of eating out vs her cooking, grocery delivery, etc.\n\nThis is kinda a small thing but maybe knowing she's doing work that is worth $XXX per month would make her feel better.",
            "It sounds like she's spent a long time treating money as a goal, so maybe a good way to get through to her is to get her to consider and set new goals and purposes. It's a good idea to do that as a couple and as individuals. The level 10 life framework is a great one to start with. This way when she starts thinking about \"I should\", you can point her back to her life goals, and she can decide what her priorities are.\n\nAlso, if she doesn't have ptsd from it as a lawyer, get her to start time tracking again. Chances are she'll realize her billable hours = current working hours + housework + errands.",
            "List to Boba Fett on this one: she's no good to you dead.\n\nSeriously, though. You're married. Legally as well as morally, you are both equal partners in the marriage. If she needs to take a pay cut to be in a job that isn't killing her with stress, then what does it really matter? Even if she stopped working altogether, if you're making ends meet and she's contributing at home, you're still in good shape. \n\n**It's not about the money, it's about the investment that each of you are making in the marriage.**",
            "Can she find a job with hours more in the middle? Like 30-40 hrs a week? 50-60 is a lot, and 15 is barely 2 days worth of full time work. Going from 50-60 to 15 is drastic and would be challenging for anyone to adjust to.",
            "I looked into everyone responses and they are GREAT! As they say she should look into volunteering to get her mind occupied, I think it is the best thing to do. On the other hand, they also gave you multiple choices in making her feel better: calculate how much money you would spend on hiring someone to clean, do the dishes, etc... and how much you would spend eating outside If she was not here, as well as increasing verbal affirmation towards the job she does in your house.\n\nPersonally, I would add one little thing more. Communication in times like this is the key, and I would advise you to change the way you approach the \"back home talk\". Usually people ask \"What did you do today?\" which in your case might make your wife feel as though she doesn't have as much to talk about as you. Try using one of those:\n\n\\- What made you happy today?  What was the best part of your day?\n\n\\- What challenge did you have that you overcame? what was a success you had today?\n\n\\- What made you angry today? Did you give anyone the side-eye today? Why?\n\n\\- Did you listen/watch/read anything interesting today?\n\n\\- What made you laugh today?\n\nI don't know if it will help, but maybe you should give it a shot! Good luck to both of you! :)",
            "Simply show her this post that you made on Reddit asking for advise.\n\nYour intentions and values are clear,  brother.",
            "I wonder if she's looking for some other raison de etre. Before the drive came from making money, etc. She may just need to know what her drive and passion is - and learn that it's okay that it comes from not making all the money.\n\nI get down on not making enough sometimes, and just having flex hours and being a pleasant person isn't my shining passion in life, though I like both of those things immensely and see that they are incredibly important to my family life. I need something that makes me... me, in addition to being available and unstressed. A fun, challenging hobby or activity that adds meaning and dimension to her life. Or a new angle on her social and volunteer life.",
            "My SO went through something similar and so did I. Career burnout is real. We both took turns being SATP for a bit too and we're both back to earning well again.\n\nThe fact is, a burnt out, stressed out SO is worse than a happy with with lower income. \n\nWe are more than just a paycheck to our SOs and that's something you need to remind her of the fact. \n\nThat her contributions now to your life don't have a price tag and contribute to the long term health and happiness of your family unit which seriously, money can't buy. \n\nBUT \n\nAs a career minded individual she can also be having personal hangups around not feeling as successful, being a \"quitter\" etc. She needs to unpick those things separately from her contributions to your domestic bliss.\n\nMy SO was the first one to get burn out and a huge part of getting them to slow down was getting over the idea that they were a quitter or that they were failing at life. Even the mental health break they took was racked with guilt around the same thing.\n\nLuckily when I took my career break I could reconfigure what I was feeling because I went through the same feelings of inadequacy despite spending all this time comforting my SO when they were going through that.\n\nWe live in such a society that puts equates financial contribution to worth. Now everybody should be pulling their weight but it doesn't have to be financial. \n\nIf you say she's running the household and taking that load off you, that's so invaluable to your mental health and quality of life that you wouldn't have if it wasn't for her. Might be worth reinforcing how much worse off you'd be without her there to take care of this stuff.",
            "On a practical level, how are you managing finances? Nothing says equal-contribution like pooling your money into a joint account and paying yourselves equally in terms of personal spending money. If you insist on paying for everything, you're actually reducing her autonomy and exerting a form of control. If you truly value her contributions equally to your own, then you'll be happy pooling your income.\n\nOn an emotional level, I sense a lot of caring, but not so much understanding in your post. I am reading between the lines here, but \"not contributing\" sounds like a probably a proxy for loss of status or fulfillment.\n\n>But I think in her mind, the work she does for our household does not make up for the loss in income.\n\nDude, that's not just in her mind. That's societal values.\n\nShe was the primary bread-winner, and now that she's earning a fraction of what she was, she feels as though she's pulling less weight. Furthermore, housework is a poor substitute for a high-flying career, and those contributions are far from equivalent when it comes to one's sense of self-worth.\n\nThe first thing to understand is that her feelings are completely reasonable, and to empathise with them. *Obviously* it's fine for you, you're now the primary breadwinner and have the status that comes with that. What's more, you've gained this status without having to work a job you hate. But for her, she will feel less in control than she was previously.\n\nIf she feels that she's not contributing, it could be because of how you're making her feel. By this I don't mean explicit things like \"I earn the money so I decide how to spend it\", I mean little things like telling her about your hard day at work, while she did her few hours and maybe swept the floor. Your reassurances here can actually make things worse, because their tone can tacitly acknowledge the disparity.\n\nYou have to accept though, that maybe there's nothing you could do to fix this but listen. The main probably is that her new role is not making her feel fulfilled, and you need to listen to this and help her figure out what to do, rather than offer suggestions that have crossed her mind already.\n\nBut sort the finances first.",
            "Sorry for the long comment, but I completely relate to this. I was an attorney at a couple fairly large firms for about a dozen years. Eventually my boss became insufferable as she gained more power within, her favorite associate was always trying to throw me under the bus, and I had three boys in four years (not necessarily recommended). I could barely work a full day what with the kids always needing something and daycare was $3300 a month anyway for all three, so I quit.\n\nAs soon as I quit, I felt like I wasn't contributing. I couldn't keep the house clean because the boys would immediately destroy everything. I felt I had to watch them 24 hours a day because I wasn't working a paying job. Someone was always up during the night. I became depressed. Started day drinking heavily. I felt like I had no structure anymore. I had always worked, always brought in nearly as much as my husband. Now I felt I had to ask him permission to buy things for myself. \n\nPoint being, even though our situations are a bit different, I totally  get understand her thought process. She may have to work it out for herself over time. Regardless of what my husband said, I still felt the way I felt. Like I said, I had always made my own money and was never dependent. It has taken me two years (and an alcohol detox, which felt particularly shameful) to see that my high stress job didn't determine my value. I guess what really changed things for me was when my husband got a remote job and we moved from California to Germany. He is home so much more - although working - and he really sees how much I run around all day. That gave me some gratification. I'm getting there. Your wife will too! And she is still working, even! \n\nTL;DR: I quit my job and felt useless even though I was taking care of three tiny boys. I think your wife's reaction is pretty normal, especially for someone who worked as an attorney at a firm for years. Law firm culture is a very particular thing. When you're used to billing every six minutes of your day, not having to do so anymore can actually make you feel adrift. (But we can still complain about putting in our time.)",
            "I'm also a 34 year old female attorney. I recently left my private practice and returned to government work. So believe me I can relate. Here is some perspective and if your wife wants to reach out to me directly I'm cool with that. \n\nThere is a mentality within our profession that if you aren't busting your ass 80 hours a week and earning 6 figures, you're a failure and a nobody. This is especially true for women as law is still a GOB profession and we are held to higher standards. Perception is everything in a career field that literally requires you to have a good reputation to be able to bring in clients and make money. This attitude can easily bleed over from career into home life.\n\nThis mentality is likely what is causing her to feel that her non-monetary contributions are not enough. I totally understand.\n\nShe might consider joining some groups or organizations that have nothing to do with law. Young professionals, sports club, brunch group, book club, etc. Perhaps seeing other people happy with lives and schedules similar to hers will encourage her to be more accepting of her own.\n\nI'm not sure if she was salaried or commission-based at her law firm. Commission based work is tough because its feast or famine. If this was the case for her, perhaps suggest to her that it is more valuable to have a STEADY  guaranteed income than a higher (or potentially higher) income.\n\nAlso remind her that she is saving the household money by taking care of chores and errands and such. If she wasn't able to do these things, you would have to pay for grocery delivery or pay for a maid and landscaper. Maybe even look into what these things cost in your area so you can show her how much money she is saving your household.\n\nI wish her all the best in her new career and adapting to life outside of the private practice grind!",
            "[deleted]",
            "So, if she's upset about the money loss, why doesn't she up her hours with her current job? Doubling her hours would bring in quite a bit more money it sounds like, but she's still be working half as much as she used to be.\n\nDoes she have goals for herself? Maybe she's still stuck in the mindset of her old goals that had her working as an attorney and she needs to define new goals for this new lifestyle she's chosen?",
            "In our house we said it’s a time contribution, not money. My wife and I have swapped who makes more several times, but we’ve always said if we are both working 40 hours we are equal, if one person is averaging 38, they have 2 hours to contribute",
            "Maybe she went from one extreme too much to the other extreme. It's okay for her to want to do some other productive things besides the household. Maybe she can work 30ish hours instead of 15? I mean, 15 is really little. I would also feel useless if I worked so little, are you sure you didn't talk her into this a bit too much?\n\nEdit: after reading your replies I want to ask you, are you not going to work less to take care of your baby together? That way the weight would be more evenly distributed",
            "If you guys like animals, maybe you guys should look into fostering animals, it will help her be busy and actually see her work progress and it would help the animals be in a loving environment.",
            "Push her to work more than 15 hours a week. Something she really enjoys doing. Fills the time!",
            "So, maybe its not just giving back to the household but utilizing her knowledge and stuff?  Depending on the type of law she practices, there are a lot of opportunities for helping underprivileged folks get expungements, help people and non-profits navigate detailed tax law, ect.  There is also an organization called 80,000 hours that has some good opportunities for people who are high knowledge but kinda burned out.",
            "I don't have any advice but just wanted to say it sounds like you guys have a great and loving relationship and care about each other very much!",
            "I would say volunteer work may really be helpful for her. \n\nI must say though your concern for her is so sweet!",
            "It sounds to me like your wife has a lot of time to get stuck in her mind. \n\nIt can create continuous loops and the mind has a great way of playing tricks if you don't actively use tools to stop it from doing so. Those thoughts aren't real, the feeling of not doing enough or earning enough isn't true and your wife's brain is inventing toxic thoughts because she has suddenly got a lot of time to think and not a lot to think about. \n\nShe might find that listening to audio books or podcasts through the day is useful.\n\nI changed my toxic thoughts patterns by doing this. Whenever I notice a thought about not being, doing, or earning 'enough', I visualise a stop sign in my head and turn on a book or podcast to focus my attention on. I can drift in and out of thinking about different things, but I no longer allow myself to dwell on pointless toxic thoughts.\n\nIt took me a bit of practise, but now it comes as second nature.",
            "It probably feels very vulnerable for her. She was used to providing and being independent and now in a way she’s become dependent. \n\nContinue to provide positive praise for the good things this new job brought: she is happier and has more quality time for the marriage, those are an invaluable contribution in themselves.",
            "I think boredom and lack of a challenge can be a big part of the issue here, especially if she used to get some of her identity and self-satisfaction from her career.\n\nI made a similar move myself last year. I made six figures and was responsible for about 65% of our household income. At the same time, I was running a non-profit, volunteering at our church and handling everything that involves life with four teenagers. I was totally burnt out.\n\nMy husband landed a fabulous new job with a huge pay raise and encouraged me to \"take a break.\" I scaled down my business to almost nothing... And my income dropped accordingly.\n\nFor a few months, I reveled in life as an at-home mom, and worked on scaling up my non-profit. But the reality is, even scaling up my non-profit only takes up so much time. We invest in rental properties, so I took over management and a lot of the renovation work on those. It's a fun challenge, and while it isn't direct income, per say, it provides the revenue that we reinvest into the next property.\n\nI'm currently in negotiations for a small retail property in which I'll also own a portion of the business that will move in. It wont be a full time job, but it's a challenge and will produce another long term revenue source.\n\nMy point is, while I was exhausted and burnt out from my job, I also wasnt fulfilled of \"happy\" in a world where I felt like my skills and experience weren't being utilized.\n\nWhether its a new hobby, getting involved in politics, pursuing non-profit work, launching a new business, or any number of other ideas... I know that some people are not happy unless they feel challenged.\n\nMaybe this is something your wife could explore?",
            "My wife exchanged a good paying job with a bad schelude jwith one that pays less but allows her to be at home at nigth and weekends.\n\nSure we get less money at end of the month but shes more happy and can spend more time with me and our son..\nTotally worth it.\n\nWho gets more money doesnt matter. Its team work.\n\nEdited: you gonna spend most of your life working. Do something that you enjoy and you will be much happier.",
            "Keep telling her, verbalize appreciation for things she does (laundry, cooking, managing finances).  A LOT!  If this doesn’t help, maybe a few sessions with a counselor to get her self esteem back on track.  She may still have the attorney mentality of “money makes the man.”",
            "hmm, i think she has to tell you what she feels can make up for the lack in monetary contribution to the household, because there's no way you're going to convince her if she keeps feeling this way. \n\nGiven the practicality of this situation, the only thing you can probably do is quantify her intangible contributions into monetary terms and see if she thinks that has value. But this does not solve the root of the issue - her perception that her choices had a 'negative' impact. Under this train of thought, something like volunteering also does not really solve the root issue because while it's a good use of her time, it's still not contributing to the household in a practical manner, so your communication with her has to really look at what she thinks is the best way to increase her contribution without going back to a high-pressure role.\n\nOn your end, are there any side projects for your home that you haven't gotten around to doing and can ask her to take full control of (e.g. redecorating, preparing for xmas, etc)? This is a good time to get creative as well.\n\nBest of luck to you OP!",
            "Sounds like you are bwing a great, supporting husband and i juat want to say for myself, this is an amazing topic to read myself because (though i dont bring in the same as my bf) im having a hard time leaving a job im unhappy at to go back to a job i love.\n\nHe is supportive and does so much for me and i appreciate it but i needed to see it from the other side.  Thank you.",
            "The only input I could offer is that every relationship has its dynamic flows.\nInitially she was contributing more to your life financially, and now she is contributing more in other ways. It most likely always won't be that way, things will eventually change and maybe she will start working as an attorney again and be bringing in more money.\nMaybe if you frame it like that she will feel a bit better about the situation?\n\nFrom her high previous income it seems like it was possible for you to buy your house and do others things. That was a huge contribution to your lives.\nPerhaps she needs something else in life to help her feel more fulfilled, maybe it's not just the money and household contribution that is making her feel like this. She has more extra time on her hands, maybe there's something she is passionate about that you can encourage her to persue? Volunteering for a non-profit, providing pro bono legal advice for a cause she is passionate about, beginning or fine tuning a hobby or interest, joining a local club?\n\nEither way, you sound like a great partner! Like seriously, she seems very lucky to have you.\nThis is a major issue with relationships and you do seem like you are on the right track.\n\nBest of luck!",
            "Surprisingly this sounds like me. However I do know my way around it. (When I say me, I mean I have a similar mentality to the wife, I am not the wife). \n\nI swear I constantly feel like I'm not doing enough. I feel like I'm \"behind\" professionally, academically, and in my personal life. Especially when my academic & personal life started to take over 80% of my life leaving my personal life with almost nothing, I really felt the change. \n\nIf your wife is anything like me, she isn't used to the change. She attaches her worth to the numbers on the check, not the actions she does around the house. \n\nAs menial as it is, I would make a T-chart. On each side is both of your contributions to the household. If you think it would help, for all the household chores (mowing the lawn, washing the dishes, etc.) Find out how much it would cost to pay someone else to do it. Its a visual representation of what her actions are worth. She may find out the cut in hours resulted in earning more money than before because she's doing things herself which is saving the both of you lots in the long run. \n\nI hope this helps!",
            "First off, you are a fantastic husband!! Kudos. Second off, to reiterate what others are saying, try your best to reassure her that what she brings in is enough. In fact, she was bringing in more than enough for so long which has helped get you guys to where you are financially. I would also try to reiterate that she is much happier, much more stress-free in this job, which should matter more than the income (not in every case, but I’d say in this case). Seeing her happy and home more instead of working crazy hours and stressed is contribution enough. It’s also probably better for the relationship. Plus, if she ever wants to venture out to the job she previously had, encourage that too. Good luck!",
            "This is such a hard situation. My husband makes twice as much as I do and I still worry about leaving a job I have absolutely detested for five years because I won’t be able to find anything that pays more. I’ve wanted to be financially independent my whole life, and can’t let myself lean on him even though I know he wouldn’t feel negatively about it. Feels like trading one mental burden for another.",
            "I just wanna say, after reading your story and many comments, that you sound like a genuine caring person and you appreciate her so much. The fact that you have actually listened to her feelings makes you a great person. She is very lucky and I'm sure you are too. You are looking for advice to make her happy and honestly it sounds like you guys have great basic relationship respect. That's hard to find and without even knowing you, I respect you just based on that information.  I wish you both luck in getting over this hurdle and just give her hug and tell her you love her. Stay positive:)",
            "Man, I feel like I'm headed for her path in a few years, as do most of my attorney friends. I suspect part of this is she feels a little bored. Most of us attorneys need high challenge--that's partly why we sought out this godforsaken career. I wonder if maybe expanding her 15 hours a week to more wouldn't make her happier and then she wouldn't fixate on contribution. \n\nOn another note, uh, really interested to hear how she made this career transition...",
            "I’d tally up the hours she’s spends on domestic labor (cleaning, cooking, keeping yalls social calendar, running household errands, etc) calculate how much you’d have to pay someone else to complete that work to the same standard, and then show her how much money she is saving y’all. \n\nI think it’s very common for people to assume that domestic labor has no monetary value, because usually it’s done for free, but that is NOT true.   \n\nI think continuously expressing your appreciation for the unpaid work she does will help, as will reminding her much much happier YOU are with this arrangement.\n\nI’m a recovering attorney too.  No amount of money is worth being miserable.  Bless you for enabling her to make this career change!",
            "I relate to your wife's feelings on this, so I'll write out my feelings from that side. \n\nI work part time and my spouse works full time. My hourly wage is also much lower because of our different fields. But I'm able to do important work at my job helping people, and I like my coworkers. My flexible schedule lets me take care of all of the groceries and other shopping, be around for deliveries, take the dog to vet appointments, etc. My spouse, like you, always reminds me that they fully support me doing this job (or whatever job I want), acknowledges my contribution to the household, stresses that financial contributions aren't the only important thing. That we're both keeping things running. I also have some chronic pain issues that can be rough on me, and they worry that would get worse if I worked full time (I used to work a schedule that was close to full time, and it was more difficult physically). \n\nDespite having all of this support, and despite knowing that I do a lot--and that my schedule also leaves me the time and energy to try to build an art career on the side--it feels bad that I don't bring in \"real\" money. I'm always thinking about how much more money we could have if I just did X or Y, or how much less I'm making. I think about how undervalued and underpaid my field is in general, and that also sucks. Part of it is the way our society links financial contributions to value as a person. Part of it is that I still have guilt at earning less, especially because we both grew up in financially unstable families and I want to have more savings to feel more secure. \n\nIt does help for my partner to reassure me, but I try not to put that responsibility on them every time. We do talk it out when I'm feeling crappy about things, and it does help when they remind me this is the plan we decided on together. (And I do the same for them when they talk about whether they should chase a much higher paycheck vs. the job they love, and I always tell them it's not worth it to give up the meaningful work. So we both have to talk each other down.)\n\nBeing at home too much is also hard, so I make an effort to go out regularly. Whether that's taking my laptop to a coffee shop to work on artsy stuff or going to the park, it does help. I do keep an eye on job listings in case I find something else that will work out better, but it sounds like your wife's current job is ideal for the upcoming plans to have a baby--so like others have said, maybe volunteering for a cause important to her could help her add some purpose to more of her hours. \n\nIt may just be that \"every once in awhile\" she's going to have those feelings, and have to deal with them. My sadness/stress about it comes in cycles, too. I'll be fine for a while, then for some reason I'll be sad about it or worried I'm not doing enough. Be there to listen, remind her you both decided this for a reason and you are 100% behind her, and since you said she already sees a therapist, encourage her to bring it up with her therapist. \n\nI've seen some suggestions to calculate the monetary value of things she does and how much it would cost to hire people to do that, and I'm sure that works for some people, but it wouldn't work for me--it feels too transactional. It does help to remember the amount of time I spend taking care of things like managing the finances or meal planning or taking the car to the shop or whatever. I can shop during the day when it's slow so neither of us has to go deal with Costco on a Saturday, for example.",
            "I don’t have any advice but thanks for being a loving husband who cares about her more than money. \n\nI have never made much but my husband technically makes enough so I COULD stay home if I wanted. I work and pay for smaller bills as well as all my own needs/wants and social outings and whatnot. So he is able to save a decent amount of money cuz he doesn’t have to pay for my personal stuff. \n\nI never hear the end of it. I don’t make as much as him. His savings is not mine, I am entitled to none of it. We separated and were going to divorce and he was adamant about not giving me anything I didn’t “earn” except for child support. He makes back handed comments about if I made more money I could make more decisions or get a new car (mine is old and getting to be almost more to repair then it’s worth) or maybe I should find a way to make more money so he could take time off and not work, etc. \n\nHe’s pretty caring in most other ways but the money and income difference is so hurtful and frustrating. You are a great husband for valuing her health and sanity and what she gives you more than the amount of money she brings in. \n\nMaybe show her this post. Let her see your true feelings written out.",
            "I just want to say you are a true gem as far as partners go! At first glance I was so worried that you’d be complaining about being the primary breadwinner. But to see you actually acknowledge that housework is work too? That’s so refreshing! \n\nI’d compliment her on the job she does around the house. Often. That’ll make her feel appreciated. Other than that I don’t have much advice, as this is an emotional hurdle she must get past, and only she has control over that unfortunately.",
            "I don't know if you'll see this, but show your wife my response if you do. Before I met my partner I was on my way to teaching Pilates in addition to my massage practice. I would probably be making $70k+ per year and working towards more plus social media and YouTube income. Instead I'm raising our daughter and working one hour per week. I clean our house, take care of the dog, do our shopping, and feel like I'm never doing enough. \n\nReading from men like you actually reminds me of how much my partner values my work. He tells me plenty of course, but sometimes I just don't feel like I'm good enough. I should be doing more! Then I read what other men write about their partners and it hits me, this is what my partner thinks! I realise I do so much, just in a different way than before, and I still contribute to our family. I hope your wife reads this and realises how awesome she is and how much she makes your life more beautiful! She makes your home lovely so the two of you can enjoy your time together and that is priceless, she isn't stressed out, so she's happy to see you and can feel free from work while with you. \n\nI think it goes both ways. If your job had been rubbish and you could have changed it to make your life better, you would have, right? She needs to know that. She had the chance to be amazing while not working herself to the bone and she took it, that's awesome and she should be proud. Show her this and let her know how amazing she is.",
            "My situation was different but similar  - I was in school then could only find part time work for a couple of years and felt awful about not contributing financially in my relationship with my well-paid partner - and it kind of wreaked havoc on my self-esteem. He never wavered in telling me how much he appreciated what I brought to the relationship in other ways and that he saw us as a team, and that included supporting each other financially, but I felt like I was letting us down and letting myself down because depending on a man financially was not where I imagined myself at that point in my career. I finally broke down when a therapist asked me what would happen if I went easier on myself and I realized the answer was that I would be a better partner.  I would be more fun to be around because I wouldn’t bring negativity and stress to the table. It might take a come-to-Jesus moment for her to realize it, but hopefully your unwavering support will continue to bolster her until she feels secure enough to believe it.",
            "I can relate to this. In the beginning my husband made almost double what I made, and I made decent money, he just made really good money. Fast-forward to 6 months into my pregnancy and he lost his job, and now I’m the main provider. He doesn’t care at all, calls me his Sugar Mama lol. I love it. She’ll learn to let go of her pride and be happy she has a husband who appreciates her no matter what!",
            "I went from working 50 hours a week to not working at all, then 5 months after becoming a housewife I became pregnant. I’m currently a SAHM. For reference, I’m the youngest of 4, but the recession hit right when I was 15. I’ve held at least two jobs for as long as I can remember, trying to ease the financial burden off my parents as much as possible. \n\nThe transition, for me, was horribly isolating. There’s really only so much day-to-day monotonous stuff you can get done without it feeling lonely. You’re left with just yourself and your thoughts. It gives you time to be introspective, but it also brings up your deepest fears and insecurities. It’s probably a weird place in life for her, working 15 hours a week, but does she have any friends that she can grab coffee with mid day? Most, if not all, of her friends probably have full time jobs. Therapy might help. Have you asked her what will help her feel fulfilled? Perhaps she can be a contractor, picking up an extra job here or there when she feels like it. I feel for you and your wife, it’s so hard. Your communication is great, you guys sound like great people! I saw you had mentioned she goes to therapy. Have you considered going with her? Sometimes the validation with a therapist can be super helpful. Good luck to you two!",
            "Sorry to pry, but my husband is in law school right now and we're both a little worried about how he'll be able to handle work/life balance when he graduates.  How did your wife find her current, lower stress job?",
            "Why did it have to go from 60 hours to 15 hours? There was no middle ground?",
            "Going from 60hrs to 15hrs, after being a student, and after years of independence sounds like a void/insecurty maybe? (Protecting) Your description of her screams success. I wonder if your wife is feeling the lack of activity or lack of independence or lack of personal money or something else as the cause of this contribution business. She sounds perfect for local nonprofit work. Could really make a difference for a cause, having independence in a dif social circle, doing something meaningful and yet zero income from it! I wouldn't push too much tho. If im projecting, id feel insecure if I wasnt feeling equal about the resources I offer in my relationship. Sounds like shes processing and trying to think of ways to continue bringing something to your family.",
            "I went through something kind of similar. I got pregnant with our son and a shitstorm him my well paying job to make a long story, I was voluntarily laid off.. which worked out perfectly because I told my husband if I got pregnant, I wouldnt want to work during the pregnancy and I wouldnt want to work after the baby was born. I figured I'd be a stay at home until he was 1. \n\nHe turned 1 and I still wasnt ready to go back to work but 50 percent of me was. I struggled for a long time with not being able to work. I've always strived to be independent and being a stay at home mom, asking my husband for money and him paying all of the Bill's was a foreign feeling and I did not enjoy it. That inner turmoil continued until my son turned 4. I got an offer to come back to my previous job and I even got a 6 dollar raise, JUST TO COME BACK. I gladly jumped on it and I'm going on year two with the company again. \n\nThe only advice I'd have to say is just pay attention to her. I sank into a really dark depression about a year after I left my work and I had a new baby. I wasnt taking care of myself and was just not happy with my life. Just keep tabs on her and check in with her often. Hopefully shell let you know if something is up. Unfortunately that itch for her will never go away. Itll always be in the back of her mind because that's just how she is hardwired. It's easy to look back and be like, wow... we could have X amount of dollars but its doesnt help anything. Maybe her saying those things to you is just a way for her to have you ease her mind verbally. Maybe tell her that money is never important and her mental health and happiness is more than enough. Ask her if theres anything you could do to help her get to that same mindset? Other than that, I dont have much advice. \n\n^^^sorry ^^^this ^^^turned ^^^into ^^^a ^^^novel",
            "Show her this!! You sound like a really thoughtful husband. I think her lack of stress is causing your marriage to be even happier and more blissful. That matters a lot! As they say, money doesn’t buy happiness, and you can’t buy me love",
            "I am basically your wife in terms of situation. I left the well paid stress job, took a happier lower hour lower pay job. I was also very independent and now know that I am financially dependent on having a partner.\n\nIt's hard, but just being there is the key. Just be there every day, same as always.  It'll take time, but she just needs time to process.\n\nThe key bits that get me down:\n\nLess disposable money for myself (not as a couple). You can't fix that, just let it be.\n\nHer guilt about how you feel. Just be low level reassuring. Don't go in the opposite direction with assuring her, just be cool with it, and she'll adjust.\n\nToo much free time to think. This is my killer, free time brings me down. Maybe buy her 10 guitar lessons, or pottery lessons, whatever you think she might like to try, and encourage her to find an additional hobby. Could help swallow some time, and find people to fill the colleague hole.\n\nYou seem like a good guy. It took me about a year to recalibrate, everyone is different, just be there and don't overthink it. Pretty normal reaction on her part. Good luck!",
            "I'm super late to the game, but I think it would be thoughtful to do things now that she has more free time.  You seem like a considerate husband. I imagine, there are fun events that she has missed    out on, because of her time consuming job. Memories are hard to establish if one party is absent. Do something fun. Go do things as a couple. Memories are important. Say/let her know that you value time together. She sounds like a quality individual. Hope everything works out.",
            "you are a lucky man, and your wife is a lucky woman",
            "I’m in a similar boat - I’m currently the attorney working 50-60 hours weeks, and I don’t think I’ll be able to sustain it for much longer (a couple more years).  The long hours and high stress definitely make me miserable. \n\nBut one of the reasons I’m in this job in the first place is because I’m someone who enjoys a challenge, likes to be mentally stimulated etc. When work has the odd quiet patch (hardly ever) or when I went on secondment to work in house at a bank, I was also unhappy because there wasn’t enough to do/not enough stimulation. \n\nI’ve realised what will be important to me going forward is finding a balance - less intense than my current job, but not by too much. For me, it wouldn’t so much be about the money - maybe she doesn’t quite have the balance right at 15 hours? From a brief skim of the comments it sounds like she is busy with other things, but it’s not quite the same!",
            "It seems to me that you are already doing a great job at telling her how much she contributes and how you appreciate it. I think she needs to come around and find her peace with it from within herself.\n\nI wonder if her problem might be partly routed in this culture of protestant work ethic which basically says you are only worthy if you work hard.\n\nApart from that, the aspect that resonated most with me is her issue with being dependent on you. I think in order to address this, I can think of different things:\n\n1. How hard would it be for her to get back into a job that makes her financially independent? I think it's always good to be prepared for bad times. If it would be hard what can she do now to increase the range of options she can have?\n\n2. Is your current lifestyle dependent on your current income levels and what are your options in case your income drops suddenly?\n\n3. Have you explored options where she could increase her work hours such that she feels more comfortable about her contribution?",
            "i don't really have an advice to be honest but let me tell you this : hang on to that women, she looks like a person who was raised really well and i wish you both all the best.",
            "Thank you so much for sharing this. Reading through your post makes me realize how despite the constant reassure and positive reinforcement from my husband that I'm doing great, I still often feel inadequate and pressure myself to make more, even though we don't need it financially. \n\nI also want to thank you for being so supportive and patient with your wife. Personally I also feel guilty about feeling guilty (haha so meta) despite my husband's constant reassurance and love. I'm worried he'll be tired of being supportive one day, so I wonder if your wife may feel like that too. Although I absolutely trust my husband, I sometimes wonder if I don't find his reassurance convincing because I know he loves me, so of course he'd say I'm great. Your wife may have similar thoughts, so I'm not sure if there's anything else that you can do personally. \n\nBut back to my first point, I actually found reading your post and the encouraging comments below helpful because hey, turns out someone else also has this problem, and alot of other people agree that she's great (and since I'm in a similar situation, that hopefully extends to me?). It's not that random strangers on the internet are more trustworthy, but the fact that they should be less biased to be encouraging but they still are, that it makes their words more credible. \n\nSo to your wife if she ever reads this: you are great! Maybe you've unconsciously equated stress with \"good work ethic\" or something like that and now feel guilty without it. That's not it! Life doesn't have to be stressful, and you can live a fulfilling life and contribute probably even more than before without feeling stressed.\n\n*tl;dr* show her this post and comments. Show her that strangers who have absolutely no incentive to please her agree she's great too!",
            "Please let her know that her happiness  contributes greatly to the household.",
            "She needs more work. She’s bored, she’s lonely and is looking for ways to be useful. If there aren’t kids in the near future, i say she looks for another part time job.",
            "Your wife is a smart lady, so do the numbers! \n\nHer job =  15 hrs/wk  = $XXk\n\nShopping = 3 hrs/wk = $X\n\nCooking = 10 hrs/wk  = $XX\n\nCleaning = 10 hrs/wk  = $XX\n\nErrands = 5 hrs/wk  = $XX\n\n\nThen if you really want to hammer it home do the statistics too,\n\nA typical worker doing 60 hrs/wk will burn out by age X, this will typically incur a medical cost of $XXk and potentially lead to never returning to work.\n\nThe benefit of not requiring a full time cleaner and errand-runner as well as the savings due to improved lifestyle, on top of the job that she already does... I'd say you need to step up a bit, your wife is making you look lazy ;)",
            "Have children, and there'll be more than enough stress that she'll never worry about that again.",
            "I don't have much to say because I can't put my thoughts together for the life of me, just wanted to say it's really sweet to see how much you care about your wife.",
            "I wish my wife would work less and enjoy life more.  Sounds like your wife needs a hobby or something to focus on with all of her newfound free time.",
            "My wife and I are in this situation. My wife decided to start an online business to occupy her time outside of her new low stress job and give her an opportunity to make more money as the business grows. We both know it may not be successful, but it gives her hope that one day she’ll be the one providing while I pursue my dreams. She still gets those guilty pangs, but they’ve been less and less since the business started taking a clearer shape and she gets more and more ideas for her product line and whatnot.",
            "Ask her if she'd be saying the same thing about your level of contribution when she had the higher paying job. Obviously not!\n\nThis is a case of *\"you're not being very kind to my friend [wife's name]\"*",
            "I'm in a pretty similar position, in which I recently left a job where I was miserable and anxious all the time. Finding a job has been harder than I thought it would be and sometimes I feel useless.\n\nMy boyfriend has a similar mindset as yours, that my mental health and happiness aren't worth sacrificing, but I still have low days. Just wanted to say it's really sweet of you to try and make her feel better about it. I hope she soon realizes the non-financial contributions she brings to the table!",
            "People who identify with their work a lot can forget about their other roles - a partner, a friend, a sibling, a member of the community, an animal lover etc. A person usually needs more than one thing to feel fulfilled. If she has lots of time on her hands she can nurture other roles, maybe you can get a dog and she can train it for competitions, maybe take up pottery and sell the works in fares. I felt lost too when I left a high-profile crazy stressful job, but starting to do lots of different things helped me learn that I'm more than the money I earn.",
            "My wife is a stay at home mom now, but for the first half of our marriage and until our 2nd kid was 6 months old, she worked. Even now, 7 years later, I have to remind her that what she contributes has financial value, emotional value, and is immeasurably important to our family. \n\nIt's okay. Just stay supportive and keep doing what you're doing. Sometimes, the only healing agent is time.",
            "Oh man, I feel for your wife. I’m currently a full-time college student at ~prestigious university~ and work three jobs, but just can’t keep up with tuition, groceries, or rent. My 22-year-old boyfriend, on the other hand, lives back at home twelve hours away, never went to college so has no debt, but is incredible at what he does and makes ~$80k a year. Additionally, I live in a ridiculously high cost-of-living city, and we are from very rural Iowa, so he has fewer expenses. For reference, I pay $350 a month to share a bedroom in a gross, old, uninsulated house here, and he pays $220 a month on a much nicer, cleaner, more modern one-bedroom at home. \n\nHe takes care of all the expenses (flights, food, outings, hotel so we don’t have to hang around my roommates) when he comes to visit. He sends me money for rent, groceries, and my calc tutor, and continually offers to pay part of my tuition. He pays our rent at home. He buys groceries at home. He fills up my car, changes my oil, and never lets me pay when we go out.\n\nThis sounds like a perfect situation for a lot of girls, but honestly it breaks my heart that I can’t contribute financially. He does a really good job of reminding me that I contribute in other ways, that I’m in school and it would be selfish of him not to share his income with me, and that someday this is all gonna balance out. So I guess that’s my advice for you, OP - just be supportive, listen to her when she’s upset, and never make her feel like a burden. She’ll come around.",
            "She wants to feel productive, not contributive.",
            "Let her know you appreciate what she does no matter what or how she bring money to the table .Its better then nothing at all .",
            "I am actually in the same boat as your wife. I gave up a job with a very wealthy venture capitalist firm, doing I.T. for really good money. The problem? I have years of experience in doing system and infrastructure implimentation. What they had me doing was setting up computers manually, and doing all the new employee on-boarding.\n \nIt sounds easy enough and a stupid simple way to collect six figures a year, but they needed me doing things that I'd already done for well-established organizations and they wouldn't let me do that. After 8 months of of fighting fires I left because the company was being investigate by a certain three letter organization. As a contractor, I wasn't about to have my name attached to any of that bad shit, especially with no control over it, and after 8 months of being completely underutilized and over-worked i quit. Not outright, mind you. I warned management that if they didn't get their shit together I was done and I was out.\n\nAll that was easy... My wife has been very supportive and understanding, but it's been tough for me. While my wife is always going to make significantly more than me, I was at least helping. Now I am doing odd jobs and filling in to make some extra cash. We aren't hurting for it, it's just more like me not feeling useful in the classic sense u always have been. Trying to redefine my value and worth that is not attached to a making what was frankly a stupid amount of money, has been the real trouble.\n\nAs long as you're supportive and you're not hurting financial, the transition will come in time for her. She needs to realize that you value her for far more than extra income. While you can tell her this, she really just needs to be comfortable in a different role and provide differently. This kind of problem is tough because it exists in her head, despite what you do or don't say. Just re-affirming the fact that you didn't marry her for income is helpful, but ultimately she has to be comfortable with this for herself. It takes a while. I'm still not there myself, but it's my hangup and my wife is very supportive, but it is a problem that we have to save for ourselves.",
            "Sounds something like impostor's syndrome. She is going through a major change. From the different working hours, to the tipes of activity. Also you mentioned that she already had something of a burn out in the past. This sounds deep.  Like what happened now was only a trigger. She needs to mend, vindicate, forgive and move on. It will take time. The road of charge has a lots of ups and downs.\nFor you, I think you need to see the full spectrum and keep a positive mind. You are her partner and you can guide her through this transition.\nJust some thoughts of mine, keep up the spirit!",
            "Sorry for formatting, on mobile.\n\nHad to do this for a SAHM friend whose the super analytical type and came from a high stress financial job.\n\nIf she is still focused on the dollars after another chat, here’s an idea:\n\nPut a value to her time and to the tasks.\n\nDo some research and find how much it would cost to have someone do the home-based tasks she does. Like having a grocery shopper is worth $__, and having a cleaning service is $__, laundromat/dry cleaning $__, etc.\n\nAnd by her doing these tasks she is saving you money and putting it back in your pocket with value.",
            "I would suggest she look into volunteer work. Contributing more to society as a whole will likely make her feel of greater value in general which should lift her spirits and fill some of her time. If she is more concerned about the money portion, she could look at ways to save the household money, maybe couponing or researching insurance policies and phone and internet carriers to ensure you’re getting the best deal.",
            "She could maybe benefit form some therapy. Also it does sound like she’s a lil bored. She could always pick up more hours doing something else or find a hobby or gym that she can put energy into. Seems like you’re doing a pretty decent job of reminding her that’s she’s been amazing and that for those 3+yrs she contributed a ton but maybe that’s not enough and not your job to always remind her of that. Always be thankful to her and praise her but sounds like it’s her internal dialogue or some more deeply rooted thing, maybe something form her past or parents growing up. I’m grasping at straws here but you two sounds like great people and supportive of each other so you have that going for you. Find some meaning in the everyday maybe even volunteer for a good cause. To your point money isn’t everything and sometimes filling up the soul with good does more than filling up the pocket$$. One love OP!",
            "I could be useful to look at everything together in aggregate, as in, as a couple, you are able to have the money you need and have free time and less stress the way things are now (as opposed to \"I\"m doing x and you're doing y\"), things around the house get done, errands are taken care of and all of that benefits you as a couple making your life nice. Plus these things ebb and flow. Ten years from now, things could be very different, and perhaps the lack of stress and time can lead to enjoyable, productive things for her in the future that can't even be imagined yet. With the extra time she might find something else she enjoys too. So many couples don't work together, but rather keep their individual hopes and dreams and ideas of self worth separate, rather than communicating and figuring out what they want together out of life - which can lead to a lot of frustration and sometimes resentment. But if you focus on that rather than the individual desires they can be reframed so it's positive rather than something she feels bad about? I don't know. I'm not trained in this, it's just my feeling and view from making past missteps. You sound like you communicate so you're well ahead of the average, I think.",
            "Sometimes the people who are motivated enough to get through law school, and work super stressful lawyer jobs for awhile, do it and are good at it because they believe on some level that financial success is important at all costs, and contributing financially is the only \"real\" way to contribute to society or their family/relationships. She may have been able to do what she did because on some level she was afraid of exactly the position she finds herself in now, and is having a hard time dealing with it. It could be that lowering her stress and having more time to enjoy her interests isn't enough for her to re-learn her value as a partner outside of her ability to make money. It sounds like you're doing a good job of supporting her and re-affirming your love for her and all that she brings to your marriage. Hopefully over time she'll see that and get over old hang ups. If not, she may try a counsellor who specializes in exiting high-stress fields, as that is a very particular situation to find oneself in.",
            "Pls be a pillar of support, she knows it's hard, don't push her. Just be there to listen and advice of needed.",
            "I would approach with something like, \"Hey, we don't keep score with money.  We keep score by being each other's biggest fans and making sure we are both living happy lives.  That is my scorecard, and my life with you is a wonderful win for me.\"",
            "Keep communicating and maybe suggest some self help books or some therapy.  I feel like this is the start of a possible mental health problem and she should learn to treat what she brings as the same as you.",
            "I mean if no one is suffering financially she needs to figure out why shes feeling insecure and if its because working 15 hours a week might be too little for her. People who are busy bees start to feel like blobs if the work isn't fulfilling enough. I think she needs to look into some self help books or maybe both of you should take up a new hobbies together to balance the new time she has. Maybe like a co-ed sport or cooking class or perhaps a book club or art classes?",
            "I wonder if she is bored. Suggest she volunteer- anything from using her degree or not; maybe something once a week or once a month. She is in the enviable position to better the community around her as well as being a more peaceful, happy, and healthy person. The guilt is unfounded, but understandable.",
            "\nShe came from a high stress school situation to a high stress job that required ALOT out of her.\n\nTo working 15hrs a week.\n\nThat’s a big jump.  Like when people retire they get depressed while they figure it out.\n\nCould she volunteer or do something pro bono?\n Obviously not to the extent she was working but an extra 10/15 hours a week should not kill your current schedule and should help her be engaged and still “step” down from the stress that she is used too",
            "Count up how many hours per week she spends on household activities, research the hourly rate for each if you had to hire someone, and total it up with her current salary. Now she has a new salary number that includes her unpaid work.",
            "She should look into volunteering. She sounds like she has a lot to offer. Also, freelance work. \n\nAlso, I've seen many articles about what a SAHM would make if they were receiving income. A wife doing the biggest load of the housework is equally valuable.",
            "You guys are in this together. It doesn’t really matter who is making what so long as you have what you need. Having someone home part of the time is a huge benefit in general bit if she feels like she can’t shake the feeling, there is always the chance to find something else in her field with more hours or she can fill her time with meaningful endeavors she cares about. That golden handcuff keeps a lot of people from leaving jobs they could survive without.",
            "I struggle in a similar way, I'm a stay at home dad with a mental illness that prevents me from working. The government gives me enough money to survive but I also struggle with not feeling like I contribute much, even though I take care of the house and handle all the childcare. \n\nI don't really have advice, because it's something still on going with me.\n\nMom says it helps a lot not having to worry about the day to day stuff and the house keeps running smoothly.",
            "Some pro bono projects might help her feel more fulfilled",
            "Can she pick up a temporary job in the mean time before the baby comes? I’m sure there are a lot of places looking for seasonal work during Christmas and such. If she doesn’t mind working ‘crappy jobs’ just to be busy. Or do some volunteering.",
            "I think a important thing to comment is that she contributed more earlier to put you in this position to work less and have it financially work. Having lots of money is great, but having a healthy balanced life is important too. Think of it has she invested more earlier doesnt make it any less valuable",
            "What if you made up a \"list\" of things that she does and put a monetary value on them... Ie you clean the house, this is how much we would pay a maid, you do my laundry while I'd have to spend x amount at the dry cleaners, etc etc. Show her how much money she's saving the both of you by doing all the stuff she couldn't do before.",
            "I would try to make a habit of thanking her and acknowledging her for the things she does while she is going through this transition. Going from 60 hours per week to 15 hours per week, does she ever seem like she feels bored or has too much time on her hands? I’m not judging her, just to clarify, I just understand that it’s a bit of a shock to your system going from so busy to not so busy in a short period of time. If so, maybe you could encourage her to find a hobby or learn a new skill that she’s always wanted to learn to occupy some of her time, or catch up with friends that she maybe hadn’t had a chance to see as often when she was working longer hours.",
            "Does your wife do any volunteering? As a lawyer, if she volunteered some legal advice 5 hours or so a week, she’d make such a huge difference to the lives of sooo many people, while still keeping a smaller, flexible workload!",
            "Take a day to do some cute cheap shit together.  cuddle in bed and do fuck-all all day and tell each other how much you appreciate one another.  Remind her that she is contributing her free time to this stress-free-day and she was never rich enough to do that when she had her more demanding job.\n\nHelp her see herself as valuable, and her time as valuable.",
            "What I would say is that she contributes more than enough in other ways. Imo as long as we're making enough money to support us I don't care if her job makes a little less. The love and care somebody can give to you is worth a lot more than money. That's just me though.",
            "Everyone is rightfully advising you to mention her contributions. Make sure you have a long conversation with her about it before you start uber-complimenting her for stuff she feels is not her giving it her all. \n\nShe may view your uber-complimenting as condescension because she feels lesser than you right now. So the goal here is to prove your sincerity. Showing her this thread might be helpful. Adding a temporary (or permanent) couples component to her counseling might be helpful.\n\nYou might even want to say, \"I don't really know how to prove my sincerity with what I'm about to say, but will you do me the favor of believing everything I am about to say to you... \\[this relationship rocks, you and I are equal members of this awesome team, we don't NEED more money, I will support you in whatever you do, what would make you happy (since I know being stressed out with more money was worse than our current situation by a lot)...\"\n\nProve your sincerity.",
            "Maybe she could find another financial/career goal she could work toward? I can kind of sympathize of fearing that you're not 'contributing' enough. The brain keeps going to worst case scenarios so you keep thinking you're not doing enough to prevent that. Other goals can include: working toward putting X amount in a savings account (shared or her own), hitting a certain goal within her current job, completing some renovation or other house project, etc.\n\nAnd as cliche as it is, it would probably help if she took up some other hobbies (gym, yoga, sport, instrument, etc) or other volunteer opportunities so she can feel more 'productive'. Next to that, I think you are doing all that you can encouragement-wise-- heck, wouldn't even hurt to show her this post.",
            "I wonder if it could be helpful for her to take on a few more hours of work, possibly somewhere she is around other people and using her considerable knowledge. There are not for profits that need board members and the like for people who have business, legal or accounting knowledge. I just wonder if being by herself means she has more time to ruminate on this stuff and dig herself a bit of a hole. I know I get down if I have too much space to ruminate on things and no matter how much you tell her how awesome she is she’ll get right back to ruminating. Not to get back up to her previous weekly hours but maybe somewhere a bit higher? Going from 60hrs in engaging legal work to 15hrs and housework is going to be a big jump and nothing like having work colleagues around you and a bit more purpose to keep the mind occupied. Just an idea.",
            "She sounds like a people pleaser. That’s a mindset that is hard to break. Therapy might be the answer, but there’s also plenty of good self help books that can assist her with this issue. There’s one hat I can’t recall the name of, but it’s all about not being a ‘nice girl’.",
            "There is a middle ground between part time and an exploitative 1.5x work.  She could find a job that is 40 hours per week.  If she has experience in a white collar field, then she could probably find one that's full time that's more like 35 hours each week.\n\nAlso, if she's not happy working too much, but then also not happy not working enough, maybe the real issue is with her ability to be happy.",
            "Jeezo pete, tell her to do a little pro bono work on the side snd give back to the world. Represent for your household. Betcha she’s getting restless and doesn’t know how to measure her own worth if not by  career and  money. How about giving back???",
            "Give it time.  It’s a natural feeling I’m sure but it’s also natural for feelings to return to baseline.   Emotions are physiological.  She’ll adjust to the change and get over it eventually.",
            "She's just feeling guilty because of how much good that money could have done your family. Money only counts for so much though.",
            "You didn't marry her income, you married *her* and now you have so much more of her time.  This isn't a bad thing.  It's a cause for celebration.  Tell her that a lot.",
            "Probably an “out there” thought, but her independence may have made her feel “useful” as well. What everyone is saying here is good including communication and words of encouragement, etc. But, maybe fill up her time with some stuff that you may want off your shoulders a bit. \n\nGoing from 60/week to 15/week is a huge shock, especially for independent people. You didn’t mention any hobbies she may have had, so it’s possible there isn’t something she’s striving for anymore. Instead of a constant climb to make things consistently better for your family, she feels like she’s plateau-ing which can make independent people feel useless. \n\nI’d say help her find something to challenge herself. Maybe she doesn’t just want to be happy, but she wants to win. You know her better than anyone else, but that’s how it sounds.",
            "If she has a lot of time, you might want to encourage her to take on a pro bono case for something she really believes in. It sounds like this is partly about your relationship, and partly about her not feeling like she's using her education and experience to her full potential. She might feel better if she can find passion projects to sink her teeth into when she's feeling down.",
            "Have a friend who was a lawyer while her husband is a ER nurse. She happily gave that up for a year to work on her art. She was happy and regardless of the paycut, there is just something that no amount of financial income can heal: and thats a good psyche with less stress.",
            "I think your last point about independence is on point. For me it's the same. I'm not in a situation where my partner makes enough to support both of us if I didn't work full-time, but even if he did, I wouldn't want to. I saw my mom become extremely co-dependent with my dad, to the point where she doesn't know how to budget or deal with finances on a basic level. That paired with other trust issues for me makes me always want to be independent. I think as others suggested, therapy and volunteering would be huge for her. Getting her outside of herself and to process any of the trust/codependent issues she has.",
            "This is pretty much 100% about how she’s feeling about herself, and she needs to find a way to feel okay about not having such a high income anymore. As much as you can keep telling her you don’t mind and trying to make her see what you see (her contributing in so many ways), she needs to feel it for herself or she won’t ‘buy it’. \nAside from asking her if she’d like to have a chat to a counsellor, I’m not sure what to suggest. It may be that she has some incredibly high expectations of herself that she feels she’s no longer meeting them, and that may be what drove her to go into that type of high achiever career in the first place. \n\nCan I just add though, it’s so nice to see you acknowledging all the unpaid work she does, both in your post and to her.\n\nEdit: just saw from another comment that she’s already seeing a therapist. Hopefully they can get to the bottom of why she feels she needs to provide more than what she is and that her current contribution isn’t enough. \nIt would also be good for her to talk with them about her expectations for/feelings about motherhood. It’s a life altering experience and the best thing I ever did for myself personally as a mother was let myself grieve the person I’d been/life I’d had, so I could embrace the new one, rather than clinging to what I’d ‘lost’. That might sound like a cliche but it helped me so much.",
            "I was going to say, in her shoes, I'd love to hear something along the lines \"your stress levels and general well being are far more important than the good paycheck\". \n\n\nHowever, reading the rest of your post, I'd rather suggest you said she now can take that extra time to do some things she didn't have the time to before.",
            "Bruh. I'm a stay at home husband with no kids. I cook clean and make sure my wife is stress free. She's a doctor.",
            "...give her more chores around the house. Win Win!",
            "Capitalism drives us all a little mad sometime",
            "I would make sure to always show your appreciation for what she does when she does. Don't bring it up in the context of her job change, just be positive about the things she is doing. Telling her she contributes puts the focus on her feeling she doesn't. Instead show her she is contributing by being appreciative in the moment without even mentioning the broader issue. That way she will realize for herself that this is way better for both of you.",
            "Maybe it would benefit her to work 25 hours a week, this way she feels like she’s contributing more yet, she doesn’t burn out",
            " maybe she could consider volunteering for a nonprofit organization if she has trouble with the huge amount of hours just dropped. It's understandable she might feel like she does very little anymore, and it might just be that she needs something contributive in her mind so she can actually enjoy herself. Even if you don't get paid, volunteering is a wonderful experience and it just makes you feel better knowing you're helping without the monetary gain aspect.",
            "Honestly one thing you should remind her is that eventually she can go back to a higher paying/more demanding job, there's nothing wrong with that. But for the time being she should just enjoy herself after all the hard work she's put in paying off loans/debt.   \n\n\nAt least right now she would be able to focus on taking her time job searching until she found something with a comfortable amount of hours/work. She can be picky because y'all aren't in a tight spot for money/bills/debts.",
            "She’s still working if she’s doing housework and chores. Tell her that it’s nice for you to be able to come home without having to worry about any of that.\n\nIf you guys are planning on having kids in the near future then this is ideal, since she can spend so much more time with them than most working moms, and you should really emphasize that to her if you guys do want kids\n\nEdit: Just saw your comment. There is no greater gift you can give to your child than time, that is to say, spending the time to raise him or her yourself. Your child’s upbringing is just as important as finances.",
            "She's having a hard time defining equal and success for herself in a relationship. \n\nThis is totally on her, so far you've done a great job with everything you've provided. I would continue to be supportive and tell her she is contributing her fair share. I might suggest a couples counseling or an individual therapist appointment for her. These are probably a bit more deep set and I don't think you alone could solve them.",
            "|I think in her mind, the work she does for our household does not make up for the loss in income.| \n\nMaybe find a way to convince her that adding her health and happiness tilts the scales quite a bit.",
            "Sometime people come on here saying their spouse doesn’t contribute enough to household chores and people tell them to write down all that they do and how much time or energy or planning it takes them to do it. When a dollar value or amount of time is put on those tasks, the “slacking” partner often realizes that they haven’t understood how much their “overworked” partner was actually doing. It’s easy to be blind to things that happen without you realizing. \n\nIt’s also easy to be blind to how much you actually do if you feel like it’s not enough. I think you should do this exercise backwards with your wife. Write out all you do and then ask her to do the same. Maybe getting all of those household/budget/planning/mental load tasks out on paper will reassure her that she is contributing more than enough. \n\nMy other thought is that it might just take time. She’s having a major identity shift and it’s difficult, no matter which direction your life is changing. Keep encouraging her, thanking her for the work she’s doing around your home and also telling her how happy you are to spend more time together. She’ll get there. :)",
            " tell her to talk to her therapist about it",
            "Successful A-type women who've been driven by a desire for perfection since childhood and achieve great career milestones often struggle when they reduce their work hours. Watch out for depression. Get her on some non-profit boards so she has something else to fill her time and also something else to talk about with friends and with you. This isn't about money, it's about her not living up to the standards she set for herself a long time ago to be a strong, self-sufficient and successful woman. She needs to reset her standards.",
            "I took a huge pay cut for a job that I am happy in and fits our family life better. When we were discussing it, I was concerned about bringing home less than before and my income not being similar to my husband’s. He told me that my happiness was worth more than any money, and that you can’t take money with you when you die. \n\nIt made me see that the ways I now contribute by being the one working close to our home and our kids school, keeping the household ship shape by working from home one day a week, and by having quality time together using my extra vacation and sick days.  I also contribute by keeping my stress levels manageable so I can support my husband in his stressful job. All worth way more than my old income. \n\nI would suggest taking an inventory of the non-monetary ways your wife can now contribute, now that she is out of her demanding job. Emphasise the value of these things to you to make her really feel good about the shift.",
            "Tell her how much you love her show her affection by bringing some flowers and doing diner date and all the romantic stuff you can think off and tell her you do too much and show like you depend on her make her feel incharge ask her for her guidance make her feel like great again and tell no amount of money can bring all this joy and happiness in your life :)\n\nYou can find 1000 reason to breakdown but 1 reason is enough to stay happy together and keep trying :)",
            "Looks like I'm late to the party.\n\nIt's really good that you care so much for her. While everyone has made great suggestions, here's a slightly different one:\n\nTake her out for a romantic dinner/vacation/holiday/something that she loves and make it all about her. Make sure she's really appreciated. Make it a weekend, maybe.\n\nIt may not solve the problem but it'll show that you care, you're listening and you appreciate her. Then with her in better spirits (hopefully) you can both find a way to fill that void.\n\nOr the vacation was so good that you don't need to anymore.\n\nGood luck!",
            "Jesus how does your guy last for hours? \n\nSome of us need tips on that please!",
            "If you haven’t already bring up the fact that what she’s able to do now without the high paying job directly affects what you’re able to accomplish at your job.  She runs the house as you’ve said so really hammer home how not having to stress over those things has helped you with completing your own work more effectively.  Bring up how seeing her more has improved your mood and overall life positively.  Try to tie what she does for you with what you earn yourself, and it’ll be much easier for her with both that and her part time job to see herself as a co equal part of your family, contributing just as much as you, as her actions help you with what you bring to the relationship",
            "Her \"contributions\" is the lack of stress she brings into the relationship.  That is priceless, literally.",
            "I would say to her having a well spouse is contributing,\nAs someone who had to give up work  (* low paying job)\nMy husband pays for most things child supports pays for getting my son to school medical clothing ect and a phone on the cheapest plan.\n\nI think she needs assuring she's using the resources she has effectively and you are happy with the balance.\nMaybe with holiday luxury stuff you could split down the middle something that's non essential and flexible.\n\nI think just recognising and verbally telling her you appreciate what she's doing already you like having her less stressed",
            "60 hours done to 15 hours is a huge cut. Could she do some more hours so her hours are say 30 hours a week.  She would feel more independent and still not be so stressed.",
            "I think you are doing a great job already! Just keep communicating with her about how she is feeling. \n\nSomething that could help too is if you ask her what she would like to do to feel like she can \"contribute\" more?",
            "If \"contributing more\" would provide her a source of happiness, maybe it should be fed.  \nDIY home improvements are great for such things. Tangible evidence/reward, and they can be worked upon at her own schedule.",
            "Running a lovely home for you both is a brilliant contribution and on top of that your wife is working.  Life is much better for both of you now and I expect your wife's stress levels have plummeted.  Life does not have to be about money.  I really think she did the right thing and her contribution is just fine.",
            "You know what's the best contribution to a relationship? A good healthy loving mental state! And the time to enjoy that mental state together.",
            "Her new job would seem to pay more per hour + work from home + flexible + is aligned with her interests. On all fronts a better job.\n\nIf the issue is purely about money then the question is if your joint long term financial goals are being met.\nCan you show her that they are?\nHer giving up what is otherwise a great job and life balance wouldn't make sense if your goals are being met.",
            "Workout how much money the jobs she does around the house would cost if you hired someone else to do them?\nAlso, time - took me a long while to realise that my relationship is worth more than my pride. Remind her that her working less means you get to see her more (and she's less stressed).",
            "Have her get a job that pays well and she enjoys",
            "Work out her time per hour (as if she was working her normal job) and tell her 'Your time is worth X amount per hour. Now you spend $300 on me a week (whatever that amount is) so that we can spend it together. That investment in our relationship is worth more than money.",
            "Have you thought about having children?",
            "What about... a baby 😂",
            "Is there a reason she can't work more than 15 hours/week? I would want to work more than that. But, maybe, the things she's interested in are just high stress? I don't know. I work 40-50 hours a week and do ALL indoor cleaning AND shopping. I sometimes cook (our kitchen sucks, so we eat out A LOT MORE THAN WE SHOULD). I groom our dog and go to his vet appointments by myself. I thrive under pressure. Roar! #girlpower",
            "Unfortunately, it may just come down to reminding her fairly consistently until the point is driven home. I can completely understand where she is coming from too. I actually lost my job of 9 years while I was out on maternity leave. We struggled quite a bit because I was the higher earner and suddenly we didn't have that money anymore. I felt like a total loser having to go and get unemployment welfare. I felt like a failure as a mother and a partner. I would express this to him and he would keep telling me not to worry, that I would find something better, that he didn't think I was a loser or a waste of space, that I was still contributing by doing the majority of the household stuff + caring for our baby. It was VERY hard to believe that and I kinda continued just feeling guilty and like I contributed nothing. I did find another job which was closer to home and pays more (so better) but it is pretty high stress and demanding too. You know what happened? Now I just feel guilty for NOT being home with my kid, for having to work weekends sometimes, for being tired/stressed a lot of the time. \n\nSo... she may believe you eventually. Or she may be like me and will always find a reason to kick herself for one thing or another.",
            "I don't think this is your problem to help. I get the sense that she's a highly motivated person who just got burned out.  I don't think it's about her contributing if you're not lacking, i think she just misses work.  I have no evidence to back this up except all the successful people in my circle are like that.",
            "I think she is feeling unfulfilled with her life about what she is doing (IE, not helping enough people, no purpose etc.) and she is talking about money because that's what she knows.",
            "It seems to me like maybe she should job hunt some more.  There's probably a middle ground where she'd feel more comfortable.  Like 30-40 hrs/week making roughly the same as you.  That depends of course on how much you two value her getting the running the house stuff done while you are at work, so you have your home time to enjoy together.\n\nAnother idea along those lines is to look into the costs to hire someone to do those things.  A maid, the cost of eating out/getting takeout every night.  That might help her see the value of that extra work.  Not everything has to be about money, but if she can't stop running the numbers in her head at least make sure she's running accurate ones.",
            "Since your wife seems very attached to her monetary value for the household, you could estimate how much it would cost if you hired someone for all the tasks she now does aside from work, that could make her realise she underestimates greatly her contribution.\n\nI prefer all the things you told us about her rather than attaching monetary value to everything though.",
            "Maybe she should split the baby and find a less stressful job that pays a little more. Speaking from personal experience, I was in a similar situation and there's nothing my SO could have said or done to make me feel better. I don't want to be taken care of financially. I wanted to contribute as a true financial partner. Some people don't mind it and even prefer it, but I think some people just weren't meant to be house spouses.",
            "Make a list of everything she does around the house and then get quotes from vendors. She'll see how much she contributes.",
            "You live in the USA? Cuz the medica problems a high stress job will give you later on as it slowly wears down your health will probably save you money in the long run.  USA healthcare will bankrupt you.\n\nThis may not help her feel better now, but honestly I dont think the high stress job for a bit more money is worth it, quality of life or money wise.",
            "Money saved on mental health and the physical ramifications from poor mental health= money earned\n\nLook up maid services, the cost of eating out/hiring a chef, cost of a personal shopper, personal assistant, anything you can think of that she does and add the cost of the work she does together and show it to her. (If you want to pad it a bit look at the higher end services for a couple of them and use those numbers) This is part of her income. \n\nSmaller tasks that acquire some income but take a little work might be helpful for her to feel like she’s doing more: mystery shopping, using the ibotta ap when grocery shopping, user testing for websites are all things that helped my mom when she was in a similar situation (and still helps). She also got really into a particular hobby which takes up about an hour each day and boosted her mood dramatically. Maybe try taking her on activity based dates until she finds something she really likes (painting, pottery, primitive wood working, acrylic pour, hiking, trail riding, anything!)\n\nTranscribing is a work from home job that takes a while to build but may be a good fit if she’s adequate at grammar and spelling. Look into legal transcription jobs she could apply for. It won’t be much work at first but it can build steadily and she may fee more fulfilled.\n\nSupplementing her activities seems like a great way to help her feel she is contributing more without adding pressure :)",
            "She could add gig jobs if she really wants to contribute more, or she could do some volunteer work for a charity you both believe in. She could also talk to a therapist, because if you keep telling her she is contributing more than salary and you are happy, there may be something underlying that she needs to address.",
            "Maybe you should put the emphasis on being a team. She is happier, you are happier, she has more time for both of you, you can plan for a kid; all this contributes more to your relationship than that extra money would. I think those feelings of hers are more of a side effect of waiting to get pregnant.",
            "You guys have kids? If not, Best time is to plan now since she has spare time..  \nHad similar issue with my wife.. she was stressed out and wanted to quit and I said sure.. 3 months she enjoyed it and then got depressed that she is at home while her friends all work.. so now she is back to working and initially happy and again wants to quit.. this time I persuaded her to take a less stressful job but not quit.. in your case I think she needs to find a job which does not exceed 40 hours a week\nIt’s worse if she starts feeling down .. good luck to you guys",
            "Income should come first before family. You can’t take care of your family on a low income so I understand how she feels.",
            "Get a dog (if it appeals to you).  She sounds like me, likes to feel needed. Dogs tick all those boxes for me, plus by the time baby comes around you’ll have had the dog for nearly a year, it’ll be all trained and inna routine, and when baby comes you can take adorable photos of them together.",
            "Is she an older sibling in her family? Did her family start out poor? Those could be factors in how she feels, too.",
            "I think the best way to communicate this to her is let her know Hey you brought home the big bucks for the first 5 years, now its my turn... when my turn is over we can revisit how your feeling. Hopefully something along those lines might work for you because my BF and I went through a different but similar situation when he lost his job and couldnt find a new one right away. He made a little more than double what I brought home at the time. I got a second job and took care of things so he could focus on finding not just a new job but the right one. It was hard for him and he was upset about it alot  but it was the right call because he loves where he works now and has been there a few years and feels secure again. I hope this helps! \nP.S. I think it's so great that your more focused on her happiness than a paycheck, not everyone is lucky enough to have a partner like you!",
            "Bills are important, but like you said y’all are doing fine. Being in a partnership where one person is living just to fulfill expectations is a recipe for unhappiness. When y’all are both fulfilled, the life you build together will always have positive potential. Also, she sounds like a pragmatic person, and I would word my response in pragmatic terms. Cheers to you both. You sound like a great guy, and she sounds like a wonderful woman.",
            "Just actively notice the things she does. Tell her how much you appreciate coming home to a clean house, how much easier it is for you to relax since she's already five the things that need done.  You can tell her as well that you appreciate that she stuck it to get rid of the major debt and that you hope she's enjoying the fruits of her hard work (having time to herself).\n\nShe'll get used to having more time. If she doesn't feel like she does enough she should find an interesting hobby or volunteer work. \n\nIt sounds like you guys are a great couple!",
            "Why isn't she working more than 15 hours. I really suggest that you don't let her rest on that, you'll probably wind up regretting it. Having no obligations is addictive for many.",
            "Can she not find a job with a few more hours? Something like 30 might give her more of a feeling of contributing to your relationship and to society.",
            "[deleted]",
            "I wish I have a husband like you. Hahaha. Husband who will provide for me and I don’t need to work at all~~ :)",
            "I know you can't say this to her, but she really needs to get over herself. This is such a first world problem. You don't need the money, and she is feeling guilty about having too much free time. 99% of people would gladly trade places with her.\n\nThat said, I do think she needs to think about her purpose in life. With that much free time and essentially living off of your income, I can see why she feels unimportant or guilty. Having a child will quickly change that, though. This is probably just a case of being patient.",
            "Give her an important “project” to be in charge of.   Could be a home renovation or vacation travel planning.  You could have worse problems.",
            "I wish I could sympathise. You say she’s making a fraction of her previous salary, and yet it’s still a very good income? Sheeeesh. If my income was cut to a third I would be homeless. Seriously. I recommend getting some perspective on this issue. You both sound very fortunate - be grateful for that.",
            "If you are not childfree, have a kid and she will no longer feel she isn't contributing.",
            "She can bear a child and take care of it. It would increase her contribution significantly.",
            "This is what society has done to women in the name of \"empowerment.\" Choosing careers over kids and when women do what they traditionally do they feel guilty about it when they shouldn't. Disgusting.",
            "Divorce her man you don’t need a woman who can sacrifice for your future success",
            "Working on the house. Raising a child -> becoming a family. Cooking more meals as a hobby. Becoming a house wife should give her more feeling of responsibility, at least at home, instead of working at the office.",
            "I suggest adding God into your actual conscious thinking... Ask yourself moreso throughout the day, Would God's character do this? Or tell her to get her old job back and when she stresses at her job have her consciously call out to God to help her and she won't be stressed! With God in mind you can only get better in life... Praying more helps too... GOD BLESS you and your family!!!"
        ]
    },
    {
        "post_id": "aaevo8",
        "author": "HugeLeopard",
        "title": "UPDATE: I [31F] wish my SO [34M] cared about life as much as he does about Pokemon Go.",
        "url": "https://www.reddit.com/r/relationships/comments/aaevo8/update_i_31f_wish_my_so_34m_cared_about_life_as/",
        "score": 4010,
        "num_comments": 132,
        "created_utc": 1546034630.0,
        "selftext": "Previous post here: [https://www.reddit.com/r/relationships/comments/a530uu/i\\_31f\\_wish\\_my\\_so\\_34m\\_cared\\_about\\_life\\_as\\_much\\_as/](https://www.reddit.com/r/relationships/comments/a530uu/i_31f_wish_my_so_34m_cared_about_life_as_much_as/) \n\nTLDR: Things are getting better, slowly but surely.  \n\n&#x200B;\n\nAfter posting here, I took some of the comments about depression and talked to my SO about how he feels and what I can do to be a better support system for him. He's still continuing therapy and his medication is slightly helping (although it'll take a few more weeks to really kick in) but he registered for his prereq classes without me saying anything or reminding him and he has been trying to help with cleaning when he can. So there has been some overall improvement.\n\nWe also talked about Pokemon Go, how he's using it as a coping mechanism and how that's okay (I cannot stress enough how I want him to still feel okay playing), but also how we can't just drop everything all the time for it. We just got back from a small holiday trip and the entire time, he kept the Pokemon Go under control and played when we wanted but not when we were doing dinner, taking parents places, and such. He showed a lot of restraint and a lot of respect for the stuff we talked about. \n\nI have also done a few raids with him and his people from discord, and I'm really glad he has this group of random Pokemon people that he knows by their Pokemon nicknames and stuff. It's actually very sweet, and not forced socialization or awkward adult-friend-making...they just go do raids, trade pokemon and know each other from these small moments. It's good for him, especially as his social circle has shrunk over the past few years. It's all so low key and low pressure that I really do think it's healthy for him to do these raids and talk to people about his hobby.\n\nI'm also trying to be receptive that his way of \"giving\" to me right now is by helping me with the game. He really likes to play PoGo with me and gets excited when I get a shiny or catch a legendary in a raid. I have to realize that while the depression stops him from acting like he cares about stuff like cleaning or eating, this is a small glimpse into what he can be like once he gets better again (and also, a glimpse of his old self). \n\nI wanted to thank everyone who shared their stories of depression and opened my eyes to the fact that there is so much more to being depressed than just being unmotivated/sad/empty. I had no idea that his motivation in the game was part of the depression and part of coping with life. Thanks for all the stories, seriously, they meant so much.",
        "permalink": "/r/relationships/comments/aaevo8/update_i_31f_wish_my_so_34m_cared_about_life_as/",
        "comments": [
            "Man, you sound really supportive and understanding. He's lucky to have you.",
            "Please make sure you're taking care of yourself and that your needs are being met. I've been in a relationship like this for 11 years and it hasn't gotten better. There have been glimmers of improvement, but ultimately he's \"alive\" but absolutely without life. He has no friends, no goals, no real interest in anything but games.\n\nI'm very sorry you're going through this. I have so so much empathy for you. Over the years I've grown resentful for all of the time I have lost. It would be nice to chat and share care techniques and communication tips.",
            "You’re a great girlfriend OP. He’s lucky to have you there for him. Just try to make sure you don’t put too much stress on yourself.",
            "I've lived similarly to the way you're describing your SO - I've struggled with depression my entire life, and have played games compulsively to avoid facing it, and to be honest when I'm using a game as distraction, I need to cut myself off entirely. I've learned that if I feel even the slightest twinge of an urge to avoid adult life, the only way I can pull myself out of it and be fully functional is to stop playing games for awhile. Your results may vary, everyone is different of course. But for me, gaming can become addictive easily, and I've had to learn to be okay with not gaming at all for awhile sometimes. I think your attitude is wonderfully kind and it's admirable that you're so respectful of his needs and desires and are trying to share them. But if he is anything like me, the slippery slope will always be there, and I'd be cautious about relapses into depression and avoidance. Video games are designed to be addictive, what you and he are facing together is very similar to an addiction, and sometimes you really need to treat it as such. Good luck OP!",
            "You sound super supportive and caring but I seriously hope you're taking care of yourself as well. Not playing Pokemon Go during dinner / family obligations is a super super low bar. Same with cleaning when he can. Same with his way of giving you is teaching you the game. I hope that youre just holding back info and there's more to this relationship. \n\nIm not judging him really, I deal with depression. I know it sucks. I honestly feel bad if I'm dating someone and hit one of these spells. But this update is really the tiniest of baby steps. I can't imagine how difficult this is for you. I do hope things get better but please remember that you're important too. ",
            "Reading this I cant help but thinking that Pokemon Go isnt being the best help for all of this.  It's a highly addictive game and putting all energy into 1 thing that is essentially un-completeable can also fuel depression in a different light. I love Pokemon go, but some of the people I meet with 3 phones and 30 of each legendary.. that's not healthy. It's nice he has a hobby but it should be a stepping stone to move onwards and upwards. Any single focus on 1 thing whether it's a job or a hobby can get too much. Once he's settled a bit I think OP should introduce her bf to a new hobby that is active, inexpensive and unbingeable. Jogging for example.\n\nI'm glad things are moving forward, and i only hope they get better",
            "If it makes you feel better about sticking with him.. I was dating a girl for about 4-5 years.  Great girl, but I was miserable with myself because I was stuck in a terrible dead end job and definitely not feeling like I was living up to my potential.  I went on a little depression binge playing an online game (original EverQuest) and pretty much abandoned my great relationship.  The game was my coping mechanism for my depression.  \n\nTwenty years later and I'm an extremely happy guy with a great career and two kids. I still feel terrible for how I treated my ex back in the day.  Probably my greatest life regret.  But it all worked out in the end. ",
            "As a PoGO player myself, and my girlfriend isn't much of a player, I'm making a more concentrated effort to keep things in perspective. Very thankful for my girlfriend's support and patience. I don't want to lose her or else I will feel like I chose a game over her or my life, which would a very bad endgame.\n\nHope he will get to a point where there's life beyond PoGO. Your support is always appreciated. ",
            "There is something missing that should be done.\nThere is no addressing why and how he got to where he is/was. He turned to this to help him escape reality and that's something that must be faced.\nHe,you and the 2 of you should do both private and couples therapy to help discover and remove or learn healthy ways to deal with his depression.\nDoing his game more than an hour or two a day is excessive.\nI hope he gets better, but being an enabler isn't getting him to where he should be. And yes he is doing better but there is still a long way to go.",
            "You sound like his (amazing) caretaker, not his girlfriend. Obviously, if you're a caring person and your partner is in need, you'll have to play that role sometimes, but imo it's not healthy for you (or the relationship) taking it to these extremes. \n\nI have chronical depression so I'm not unsympathetic to your partner, but I'm also sympathetic to you, and personally I wouldn't like to be in a *romantic* relationship that leans so heavily on the caretaking aspect above all else. \n\nI'd just advise you to not forget about yourself, and to be honest with yourself about your own needs; if one day you find you can't be the caretaker all the time, that's fine and super valid, and you can decide from there which steps you should take.\n\nGood luck and take care of yourself. ",
            "How on earth is him playing the game with you \"giving\" to you? Get a relationship where your partner actually makes you happy, not one where you have to set the bar the absolute lowest you can in order to see a tiny little bit of good from him. ",
            "This is awesome! So glad your relationship is so strong and you're so supportive!",
            "you sound like my gf. so supportive and understanding. hes a lucky one.",
            "This is so warming to see. It's nice to see it isn't a simple, 'just break up', thing. \n\nI hope you and your SO have a very happy and long future together. You both deserve it.",
            "Anyone would be lucky to have such a supportive partner as you, good for you OP. Wish you both the utmost happiness in the future.\n\nAlso, Pokemon is awesome and always will be.",
            "This is so beautiful, you are an amazing partner!  When I was at my lowest with depression my partner told me, \"Go see a Doctor and get on some pills because I can't deal with this.\"  It was a real turning point we never were able to return from.  Reading your story makes me want to cry, it's really, really, beautiful.  I hope everything gets better for your SO, and considering he has a strong support in you I have no doubt he will.",
            "this is such a nice update ",
            "You're amazing. I have delt with crippling depression and sometimes my husband was the only reason I wanted to get better. His unconditional support made an incredible difference. I became a shell of who I once was and to have my husband believe in me still kept me sane. It's really not easy sticking by someone as they go through this. You're doing an incredible thing.",
            "I would not be willing to deal with an adult who has Pokémon problems. I just would not. \n\n",
            "That's awesome! I remember your post, and I'm super glad that he's getting help, that he was receptive to what you had to say, and that you're both putting in the effort to work through this and move forward together! ",
            "[removed]",
            "You are a saint. My SO doesn't even like when I play videogames at night, when she is sleeping and I work graves...",
            "Damn, this guy struck gold to land you.",
            "Video games can be addictive. The thrill of a quick reward keeps the addict coming back for more. Treat it like it is, it's an addiction. ",
            "I read this and then your previous post, people covered it in the comments in huge detail so I can’t really say much others haven’t said but I’m autistic, I’ve not been diagnosed with any types of depression but there are times for me when I can’t bring myself to get up, I’ve got no motivation to do anything, even the things I want to do and it just like life is a struggle. \n\nMaybe it’s part of me being autistic and having an addictive personality but when I play a game my struggles and anxieties disappear, I’m not longer a 21 Year old student struggling socially and with uni, I don’t have a friend that ditched me a few weeks ago or grief to deal with. I go into a game and I’m a Pokémon trainer, or an Ace Attorney, or some guy in gta, or a pilot in Elite Dangerous. I can absorb myself into that world and everything else is gone. That’s likely what he was doing, he wasn’t good at life but he was good at the game. The escaping into a game doesn’t get rid of it, it doesn’t help it but for a short time it can personally make me feel better. I have people around me that help me deal with stuff that goes on, parents and friends etc but if your boyfriend was in that position where life was a chore and a struggle, where the only thing that was an escape was Pokémon Go I get why he’d focus on that, especially if you were away seeing as you were his usual crutch.",
            "I just wanted to thank you for posting this. Someone in the top comments of your previous post recommended HabitRPG and I downloaded it and it's been really helpful for me and my friends who've also gotten the game. \n\nThank you for updating. I hope you guys continue moving forward!",
            "This sounds like my parents",
            "Wow im blow away by how supportive and kind you are. Yah i definitly also use video games as a coaping mechanism for my depression. However, i also the the multiplayer thing and have a lot of online friends, some i knew from highschoool",
            "I just want to say you sound so very caring and dedicated.  Hes going to beat this depression/insecurity/anything else hes struggling with because he has someone like you. \n\nContinue to keep us updated!",
            "You sound like a really good girlfriend OP and I'm glad he is seeming to make improvements. I hope it keeps up for his and your sake :). It seems like he is doing so well due to you allowing him to make his own small strides and being empathic at same time. Just remember, his mental health isn't your responsibility also, so if it gets out of hand, you need to make sure you're not neglecting youre own well being either. As for the time being, it seems to be going well and if he keeps this momentum, I think he can do well. Also, it does take at least 1-2 months for psych meds to work. The biggest issue was always my clients feeling better from the meds and stopping them; its the most the cliche thing and I can't stand it, but it happens more often than you think.",
            "You're doing waaaay too much for this dude. You sound super unhappy and unfulfilled - any rational person would be. Why waste your life with a gaming loser like this man? Speaking from experience it is certainly possible to really, really enjoy Pokemon Go/games and NOT have it take over your whole life. Ugh.",
            "I think both of y'all are awesome. It sounds like you guys are trying monumentally hard and I'm pulling for you!! So I just want to highlight this from your earlier post:\n\n>Before we dated, I always thought he was a cool guy who was good at everything. And it's true, he IS handsome and has great style and he IS smart and good at many things. But the person we all thought he was is actually a front for an insecure, scared human being. He projects being \"good\" at things because he was raised that way—son of immigrant parents who are VERY hard on him personally and culturally—and he feels like he needs to be the best, all the time.  \n>  \n>I noticed early on that he gets overwhelmed easily. He pretends to know things then researches the crap out of them to get by doing whatever he's doing. He survives purely on intuition and fake confidence, but he crumbles in secret. He gets sick ALL the time from lack of sleep and stress.\n\n&#x200B;\n\nIt sounds like when you first started dating, you thought he would be more \"confident and capable.\" (I put that in quotes because I know you don't *really* feel that he is incapable.)\n\n&#x200B;\n\nHOWEVER, a couple things you said stood out to me:\n\n**That he is not the \"person we all thought he was.\"**\n\n**That he \"survives purely on intuition and fake confidence.\"**\n\nNot to be harsh on you, but these comments show a slightly low regard for him. (Which, I know he left a gang of dead mice in the kitchen and all, but you know what I mean)\n\nI get the feeling that he is aware of / has picked up on the fact that people feel he's not good enough. Or that his confidence is \"fake.\"\n\nIt's like, he already has impostor syndrome, which is hard enough.\n\nSo to have other people confirm those fears...whether by outright saying he's dumb, or implying it, or just a disapproving look that says it all...I've experienced that, and it's awful to have others reaffirming your impostor syndrome even if they don't mean to!!\n\nI wanted to offer that perspective, because a lot of comments are calling him out and that's fair too. **But I think he just is EXTREMELY insecure and has EXTREMELY low self-esteem...**\n\n**...And thoughts like, \"he's not the person we all thought he was\" and \"he pretends to know things,\" no doubt show themselves in some way...and make his insecurity worse.**\n\n&#x200B;\n\nSo basically, I think that if he has always felt like an impostor barely keeping it together...then it's important that if YOU ever have that perception, or there are times when you do...it doesn't creep into your conversations with him.\n\nAnd again, I say that not to put you at fault at all, but just because he's getting shit on enough and I want to offer a different perspective -- that his extreme insecurity and impostor syndrome has paralyzed him, so your job is to help him find other things he's good at and ways he can feel good about himself. Through tasks, through conversations, through new experiences together.\n\n**It's not your \"job\" to get rid of his impostor syndrome. BUT if that's at the core of his problems it's good for you to be aware of, so you (and a therapist as well) can help combat it.**",
            "Oh damn, I had no idea people still played pokemon go. Everyone around me played it for a bit then stopped.",
            "[removed]",
            "You sounds simply amazing, OP! This post was a heartwarming read. 2018 has been a fantastically shitty year for me after losing two loved ones, and PG as silly as it is has been my occasional escape from real life and it's stresses and sadness. I wish you both the very best of luck growing and learning together.",
            "Just want to commend you on being a dependable partner to him who is willing to stick it out and support him through this phase of his life. It’s a tough road for anyone to be on, regardless of what side you’re on, and there are many battles ahead to be won. Unfortunately this stuff can be lifelong. But if you have the endurance for it and you can remain by his side without losing yourself in the process, he won’t ever forget your patience and love and persistence. I hope he continues to make steady progress (there will be setbacks now and then) so that he may bloom and you two can live happily. I imagine he has a lifetime of shit to unlearn but he’s on the right track. That’s HUGE, and he has you to thank because you led him there. Even if your relationship doesn’t end up being forever, just know how much of an impact you have on the betterment of his life. He might not always say it but I’m willing to bet he would have no idea where he would be if you two had never met. \n\nSource: I never would have come to terms with my own depression and anxiety if I had not met my boyfriend. Didn’t even know how bad it truly was until shit really started to escalate. I lived my entire life feeling this way, constantly being told that I was fine and nothing was wrong with me. Panic attacks were me being “dramatic” and bouts of horrible sadness were all “in my head.” My bf was the only one to truly listen to me and he was the one who encouraged me to seek help, even though he knew nothing about mental/emotional disorders and had no experience with either. It’s been difficult at times for both of us, but he’s been my constant through it all. I don’t even want to know what my life would look like without him ever being a part of it. I feel so fucking grateful for him and his love for me—now I get to be his constant and his support system in return because I am healthy enough to be who I want to be. So thank you, OP. I hope you know how important you are and I hope your man reminds you often.",
            "Thank you for being so receptive and willing to listen. It's scary to share personal stories about depression, but it helps when people listen and understand.",
            "Thank you for sharing this and for being understanding/empathetic of his situation.\n\nI can kind of relate to your SO except I dont have someone in my life.  I do want to point out that you mentioning him being social due to Pokemon Go. I think the social aspect is one of the major reasons why I play that game. Otherwise, I'd have zero interaction with any other humans outside of work/school.",
            "Pokemon go is still a thing? ",
            "I am so unabashedly happy for you and him because I showed my wife the joys of PoGo as someone who grew up so heavily bullied, that it was Pokemon that kept me going.  \n\n\nThe sense of achievement that game gives you is what helps many people and people do not realize how cruel it is to pretend as though someone should just be \"strong enough\" when no one considers that you have to give people motivation to live a life they never asked for. ",
            "Damn reddit's hate boner for people with depression is astounding. Hope one day they feel what it's like to have a mental illness and learn a little empathy. \n\nOP you're a good person for trying to work on your relationship with someone who hasn't given up. ",
            "[removed]",
            "Amazing girlfriend, wow.\n\nIf you can hang in there, he'll get better. Speaking as someone who was addicted to video games for a similar reason.",
            "People over 12 still play that game?",
            "Pokemans (cool) > girls with cooties (ew)",
            "Has he reached level 40 ?",
            "Your boyfriend plays a child's game? Are you sure you're the female in this relationship? "
        ]
    },
    {
        "post_id": "ev6ls7",
        "author": "Throwawayaway1467",
        "title": "[UPDATE] My [32F] boyfriend [32M] doesn’t see my long commute as part of my contribution to chores and my patience is wearing thin",
        "url": "https://www.reddit.com/r/relationships/comments/ev6ls7/update_my_32f_boyfriend_32m_doesnt_see_my_long/",
        "score": 3988,
        "num_comments": 490,
        "created_utc": 1580223391.0,
        "selftext": "[Previous post](https://www.reddit.com/r/relationships/comments/eszfhr/my_32f_boyfriend_32m_doesnt_see_my_long_commute/)\n\nI took your advice and told him we needed to work this out now - no more kicking the can down the road with “I’ll think about it”s. I told him this on Friday and said to take the weekend and think things over and that we could talk about it when I got home - either together on Sunday (when I got back from visiting family) or in couples counseling on Monday. \n\nHe opted to talk about it on Monday in therapy and made it seem like everything was fine in the meantime and then in therapy dropped the bomb on me that he thinks we should live in separate apartments but not break up. \n\nSo essentially - I live close to my work and he lives close to his. Note that he doesn’t have a car and the closest train station is a 30-40 minute drive away from where I’d be. He doesn’t compromise in any way and I’m supposed to believe this isn’t a prelude to a breakup. \n\nI already feel like such a fool for having done this for almost 2 years because I thought we were building towards something together. \n\nThank you to everyone that commented on my previous post urging me to tackle this sooner rather than later. This monumentally sucks and I’ve been crying for hours (did I mention that my cat is going in for tests today to see if she has cancer? And this is the timing he chose to pull the rug out from under our relationship?) but at least now I know I guess. \n\nTLDR: I have a 2-3 hour daily commute which I’ve been doing for close to 2 years while boyfriend walks to work. Tensions have been rising due to distribution of chores and free time. I asked if we could move somewhere halfway between our respective workplaces when the lease is up in May and boyfriend opted instead to tell me to move out to my own apartment if I want to continue in this relationship.\n\nEDIT:\nThank you so much to everyone that has responded to this update post. My original post got a handful of comments and this update post blew up and I’ve been so touched by the kindness I’ve seen here. Even for those that said less than kind things - thank you too. I posted not for an echo chamber but to get all opinions and I appreciate the dissenting views as well. You have all given me a lot to think about and I’ll do my best to respond to everyone but please be patient with me as it may take me some time. \n\nAgain thank you :)",
        "permalink": "/r/relationships/comments/ev6ls7/update_my_32f_boyfriend_32m_doesnt_see_my_long/",
        "comments": [
            "\"We teach people how to treat us.\" - it's super corny but also very true.  \n\n\n This sounds like one of those relationships a person gets out of and is then able to meet someone with whom they are compatible and can be happy. You gotta start asking for more for yourself. From yourself and from your choices \\[in partners\\]. This guy has shown you what effort he's willing to put toward being your **partner** in this relationship. He's suggesting you move out. Move out. Break up. Make yourself your first priority and stay busy. You will meet someone else who is dying to make you happy and who appreciates all you do for them. This guy would rather ask you to move out than make adjustments to the relationship to help you be happy.   \n\n\nOh, and 100% take the cat with you. No discussion. It's your cat. You take care of it.",
            "I seriously doubt he wants to stay in a relationship with you. If he says he wants to live separately but not break up, he probably wants to wait until it's more convenient for him to end the relationship, or he is afraid and waiting for you to end it first. I speak from experience because I was once immature and selfish like your boyfriend.",
            "I remember your post. Still doesn't look like he will change. Especially at 32 and he wont compromise with you. It's not right. You really got to think if you want this to be another 2 years like this. If he isn't willing to change or help you out, then you have to cut it off. Leaving in separate apartments wont change nothing. He will keep his habits at his new place. But I think you should break it off. You are emotionally drain and just fed up. Don't live your life like this for another 2 years. I'm also sorry about your cat.",
            "You guys aren’t compatible and may be better off separating - but that doesn’t mean you wasted 2 years. You learned a lot in those two years about what you need and want out of a partner, and you’ll use that knowledge to find someone you’re more compatible with. \n\nYes, you love each other- but that is the baseline for being in a relationship. Love on its own doesn’t make a relationship good- for that you need trust, respect, care, help, etc. It doesn’t sound like you guys have that stuff - neither of you feel taken care of, neither of you trust that the other has your best interests at heart, etc. \n\nCut the cord and take care of yourself and your cat. You can do this, and you’ll be better off from handling these challenges as well. It will be hard, but you’ll be stronger and it will help you appreciate good times and good people that much more.",
            "What a selfish coward.",
            "Well, perhaps he doesn't see this as a prelude to a break up, but you certainly have a right to.  It's clear he doesn't value your relationship enough to compromise, and that's fine.  \n\nSince he's so kindly offered to take over the lease at no penalty, take him up on the offer and start looking for places now.  Be sure to let property management know, especially if your name is on the lease.  Once you get the paperwork settled and move, well, let the relationship end.",
            "I’m glad you are both trying to work things out in couples theraphy but it seems like the relationship isn’t working for you anymore. The language you used in your post loudly echoes throughout that you are tired and defeated. If you are done, and you need to end the relationship for the sake of your health, end it. \n\nWith the relationship over, you will have more time and energy to focus on yourself and your cat. Life is short.",
            "Sounds like you both would be better off out of this relationship. He’s got no regard for you because he likely doesn’t value you as much as he should. Time to move along.",
            "I was in this situation over a year ago. Taking on the mental load of the relationship, constantly cleaning up after the ex in a house that I paid for, taking care of 2 cats with cancer, training and cleaning up after his dog .... and he still had the audacity to tell me I’m not contributing enough to take care of the house.... because I didn’t clean up his kitchen mess. My ex used my sick cats as another reason to complain that I wasn’t contributing enough (meanwhile he never once cleaned the rugs or couch when his dog made a mess). After living together for 2 years I stopped doing anything and grey rocked him until he had a temper tantrum and moved in with his mommy. \n\nYou deserve to be loved,respected, and seen as a partner not a personal maid.  Dump him, move closer to work for your mental health and put all your love and energy into taking care of your kitty. When you are ready to get back out there don’t settle for anyone that will not make a good partner and make sure they will contribute as much to the relationship as you do.  I am much happier now and I’m with someone who has a “we’re a team” mentality when it comes to our relationship.",
            "What you’ve learned is that your relationship is one of convenience for your boyfriend: everything works fine as long as it works for him. Asking him to sacrifice his comfort or time to help reduce the burdens you were facing showed you his investment into your partnership: pretty much none. You want a partner who will share worlds with you, not allow you to exist in his. \n\nWhile two years isn’t an insignificant amount of time, it’s a fair amount of time to invest in a relationship to find out someone’s true nature and now you know it’s time to focus on yourself. Live where you want to live, reclaim three hours a day, spend time with your cats (and I hope things go well there) and move on. \n\nYou’re about to have an easy 15 hours a week open up in your life. It‘ll give you time to review and automate as much as possible (like subscriptions to cat food delivery, for example)  and reduce the wear and tear on your car and well as upkeep demands. Getting those systems in order will help your pursuit of additional education.",
            "Good for you! It took courage to tackle the problem head on and refuse to wait. A lot of us have wasted much more time than that in relationships that were headed nowhere.\n\nHope your kitty is OK and wishing you much better days ahead.",
            "I’m sorry about your cat - fingers crossed for a good outcome.\n\nDump this loser. He doesn’t have your back and you don’t need his selfishness complicating your life right now.",
            "It doesn't seem like you want the same things",
            "This guy isn't a life partner.  The only reason he isn't breaking up now is that he's confident that when he wants sex, you'll come to him.  When he finds someone more convenient to fill his needs, you'll be tossed aside.  Do what's right for *you*.  If he won't put you first then you need to.",
            "I think you should live separately AND break up. If you have any desire for maybe having children in the future, it's time to find another guy to do that with. This guy isn't going to be a good co-parent. He's not even a good room mate, at this point.",
            "This relationship is over, and it's up to you to pull the plug. He just old you he isn't even willing to be minorly inconvenienced to accommodate you or help you have a better quality of life. He's not a partner.",
            ">He doesn’t compromise in any way and I’m supposed to believe this isn’t a prelude to a breakup.\n\nI think you might be right and things are heading towards a breakup. In general, most relationships that take a step backwards (like moving back out after living together) don't last. \n\nBut honestly, reading your last post, it sounds like this guy is dead weight anyway. Breakups always suck, but ultimately you'll be better off without this stubborn, selfish ass dragging you down.",
            "Regarding the timing, while this isn't a particularly perfect time, just know that there's rarely ever a good time to do what he did. If you haven't already, I would start making arrangements to take his suggestion and move closer to work, but definitely not to continue a relationship with this asshole. Focus on yourself and your cat right now, I'm so sorry to hear things aren't going well with her, but at least less time with him will give you more time to bond with her, no matter the outcome :)",
            "> I asked if we could move somewhere halfway between our respective workplaces when the lease is up in May and boyfriend opted instead to tell me to move out to my own apartment if I want to continue in this relationship.\n\nI guess he forgot about Door #3, where you move out to your own apartment and choose *not* to continue in this one-sided relationship.\n\nHe's a jerk, better to find it out now than later.",
            "Either he’s delusional about what your relationship will be like when you’re living an hour apart and he has no transportation. Or he fully expects all the responsibility of keeping up the relationship to remain in your hands. Or he actively wants the relationship to deteriorate without actually doing anything about it so he doesn’t feel guilty. None of these are great indicators of a positive outlook for a relationship. But great outlook if you want to be single and move on with your life. Hopefully to someone who understands compromise and working on common goals as a team. Not to mention someone who will encourage and support your professional aspirations. I’m sorry you have to deal with this, and I’m sorry about your kitty.",
            "Sounds like your bf doesn't value you. \n\n\nIf he tells you that if you have a problem with the commute for you to get your own place. What he really is telling you is that he doesn't care if you live with him not and that he doesn't view you as someone important enough to distrupt his life. \n\n\nHe is saying he is happy with his life weither you are living with him or not.",
            "He showed you who he is. Believe him.",
            "It does seem like you're starting the breakup process.  So one thing to consider is where you'd live if the relationship is over.  If his new apartment suggestion happens to match up with what you would (or will) do without him, then one option is to go ahead and make that happen, and then leave the next step up to him - instead of continuing to cater to him.\n\nYou may need a clean break in order to really move on, but there are also advantages to taking a little time to find the right apartment, and to move with a little less urgency.  You can be honest about it being a step towards breaking up, but in the meantime maybe it will be possible to have some decent but [melanchol](https://duckduckgo.com/?q=melancholy&atb=v102-1)y time together.\n\nIf you do take your time, it's important not to compromise on where you move to in order to cater to your boyfriend.",
            "So selfish, you should definitely just move closer to your job and get on with your life. It will be better for you in the long run!",
            "My husband has a 5 minute commute, I have a 3-hour round trip commute. It SUCKS. But he contributes by cooking dinner every night, running errands and doing other things I can't because I'm commuting. So, this kind of thing can work...but only if you're both contributing to the relationship. Good for you for realizing you're worth more!",
            "\"Nah I'm good. You can keep doing all the work, I don't wanna\"\n\n~your lazy ass selfish boyfriend\n\nTake your cat and leave this turd.",
            "Doesn't matter if he doesn't want to break up I would have left him right then and there, I'm sorry you have to deal with this especially with chronic illness. When I read you drive 3 hours a day basically I wanted to cry, I have chronic illness and fatigue too. Do you have anywhere you can go immediately to initiate NC or do you have to live with him until you find a new, cute amazing apartment just for you?",
            "Your commute is not part of your \"chore contribution\".  I have a similar total daily commute and I've never even heard somebody  consider it as a chore done for their spouse.   That really has no bearing on what other things still need to be taken care of.  \n  \nThe issue is that your bf doesn't seem to be willing to compromise or help in ways you need it.  He's clearly telling you he's not concerned with working out issues as a team and views the two of you more as independent people living together.",
            "Focus on your cat. Drop the man child",
            "Sounds like you guys moved in together prematurely. If you \\*did\\* have separate places, you'd be able to get a place closer to your work and he wouldn't need to give up on his location. On the other hand, you wouldn't be finding out about his views on equity of chores until much later.\n\n&#x200B;\n\nI suppose we're all conditioned to believe relationships should only go in one direction. Otherwise, it fails. It's not necessarily true, though you can choose to believe what you want on that.",
            "Oh God girl you lasted 1.5 years with that commute!?!?!\n\nI was in the same literal situation as you with an ex and I lasted 6 months, before I broke up with him because he didn't want to move to an area with a 30min commute for him... thought it was too much. LOL.\n\nYou are amazing for holding for so long.\n\nThe only person who you have to find that will love you for all your struggle and strength is ... Yourself!! Give yourself a pat in the back for being so strong and resilient. :D",
            "I would break up with him, the writing is on the wall, make it a clean break and focus on yourself and your kitty. Hope all comes out well, sending a big hug or chocolate or whatever you like.",
            "Lol my ex suggested living separately after our first lease was up (after I had moved across the country for him and living together was not going great—whole other story ). We (obviously) broke up, but infinitely it was for the better because it forced me to realize what I will not live with (or without), and living with a guy made me much more selective about the people I dated  for serious relationships. \n\nYou learned a lot, now move on and apply that to find a true partner who will value you and your time as well. You deserve better than some selfish asshole who thinks you should be doing everything for the relationship.",
            "I also want to say that I hope your kitty is okay -- I know with everything else going on, this is also a huge stress.",
            "reminds me of a statement i read from a couples counselor (paraphrased)\n\n> most of the time my job is to move people into the breakup process",
            "With so much change in the wast society sees sex and dating and marriage..one of the draw back i see is people losing sign of the purpose of dating. For those of us that still have an end goal of marriage or a permanent long-term relationship, dating has to be used rigorously as a test drive/audition. And I don’t think somebody who is only at a place where they are willing to prioritize their self or their career is really ready for that audition.  \n\nTo be in a serious relationship is to carry the mindset that you are a team. Big decisions like moving or a job have to take i to account the impact on other people. For him to put his career first is fine, but in a relationship, the impact on the other person and your lives together has to be taken into account.",
            "[removed]",
            "Wanna chime in and say that I relate to this way too closely. My ex of 4 years broke up with me less than 1 week after my cat (who I loved sooooo much) passed away. 2016 was a very difficult year. But on the bright side, things do get better. I'm rooting for you.",
            "Yeah, so, here's the thing.\n\nMarriage 1 - husband was totally supportive of me going back to school until he realized I was gone 3 nights a week for class, had clinical shifts that were 12 hours, had to do a minimum 500 hour internship at 30 hours a week, AND I was still working. Guess who told me to drop out with 2 months left. Yeah. Because I wasn't coolong/cleaning/laundering/fucking on his desired schedule. Same thing when I started working and it was nights, weekends and holidays. He would deliberately leave messes for me to find first thing when I came off a 24 hour shift, and then be like \"you chose this profession, I don't care that you've been awake for close to 30 hours, fix me a sammich.\" \n\nMarriage 2 - husband went back to school full time, super intensive program. I picked up a ton of the slack, worked 80-100 hours a week, so he could focus on school and not stress about stupid shit like laundry. AND I WAS HAPPY TO DO SO, because this was an overall investment in our future. He just started a new job in his desired field, and was talking about working a second job to make some extra $, even though new job is almost a 15k raise. My response? No fucking way. You focus on your training, your mental health, and our marriage. I'll pick up the household slack, and we'll reevaluate in 6 months when your training is done if we need the extra money that bad. (spoiler: we won't)\n\nI've been thinking about going for a masters, he flat out told me under no circumstances would I be allowed to work overtime AND go to school, much less take care of chores. Our investments in our future are just that, and we have each other's backs no matter what. If I was commuting 3 hours a day? No question we would move. Our marriage is more important than keeping score, because a relationship isn't like 2 oxen in a yoke. It's almost never 50/50. Someone is almost always doing \"more\" for whatever reason. The thing is, that balance has to shift back and forth - the scale can't just be permanently tipped to one side.",
            "Hi OP, I sincerely wish you the best during this hard time. Just from reading your previous post to the update, it kind of feels like he is taking you for granted. This could be a good time to re-evaluate the relationship and honestly moving to your own apartment does sound like a good step, especially with how stressful everything’s been for you and how he hasn’t made it any easier.\n\nSo many couples break up after moving in together because they realize the incompatibility and it’s when you truly test the relationship. I know you have been building up the relationship for the last two years, but ask yourself.. if he isn’t willing to compromise or even sympathize before, what will ever change in the future? Remember, no one can change someone else and you can’t expect him to change for you. Knowing that, is this something you can deal with for the rest of your life? \n\nIf you know you can deal with it and accept it, I’d continue moving forward to it the relationship. But if not, it’s a real good time to take a step back. You are so young and have so much time in front of you, make sure you are getting what you need out of a relationship before it turns resentful or sour.",
            "Well you tried this relationship with him  and it doesn’t seem to be  working out. Time to move on. Hopefully you learned somethings and about what is important to you. He doesn’t want to make the compromise of moving half way, then he doesn’t have to. You both have reached a fork in the road and must choose which one to follow- only one road together or separate roads apart. That is life. You need to make the best choice for you, outside of this guy because he clearly made his- NOT a bad thing. The best part is you’re not married to him, there’s no children involved and that’s the beautiful thing about dating, living together first before making the ultimate commitment. You learn some shit about your SO once you live together, it’s all about whether you can handle those new discoveries and see them in rose colored glasses still, or not. This relationship seems to have run it’s course but what do we know? We’re just strangers online and life have a funny way of working things out. Ball seems to be in your court OP, good luck.",
            "Sorry but I don't get how hes unreasonable. A commute isnt a household chore and it's something you could change. You take care of all the car upkeep and some of the pet care but you need help with the \"mental load\" of remembering to order cat food and put gas in the car? You set a reminder in your phone to get an oil change. You have a reoccurring cat food order to chewy or amazon. Get gas when the light comes on? This is basic existence. It doesn't sound like you're doing any chores at all.",
            "Commuting time as contributing to chores is absolutely absurd lol.  It's not his fault you chose to pick a job so far away, and it's not his fault you are dead set on sticking it out there.  Shit still needs to get done around the house, period.  \n\nThat being said, it's a moot point now, because the live separately thing is a precursor to breaking up.",
            "This is meant to be constructive criticism, but he didn’t pick the timing. You did, by allowing a very important conversation to go unresolved for years. Not to make you feel worse, but just remember part of the situation was created by your allowing it to continue. You hit your breaking point at a shitty time, but if it were up to him he never would have told you",
            "Its pretty simple really. You're better off without him than with him. I doubt he can say the same.",
            "Why do you commute 2-3 hours?  Stop doing that!! (whether you keep the man or not)",
            "Honestly I’m going to play a little bit of devil’s advocate here. I think the commute is your problem. You decided to live 1.5 hrs away from where you work and it’s not fair for you to blame your fatigue on your boyfriend. If you don’t like the commute and your boyfriend does not want to move (which I don’t blame him) I think the good options for you are continue the commute without getting angry at him, get a new job closer to where you live, or as your boyfriend suggested live separately until your plans align. \n\nThe chores part is a whole separate issue. I’m thinking if you do continue to live together you can come up with a chore plan together of who does what and when so that you know what to expect when you come home. Also, just a thought, my boyfriend started cleaning the kitchen a lot more frequently when we put a small TV in there! Haha he just puts on a sports game while he’s cleaning. \n\nAlso, I’m sorry to hear about your cat. I hope he doesn’t have cancer! ❤️",
            "You need a new BF. This guy is selfish and apparently doesn’t get the concept of compromising. Better you find out now than later.",
            "I think the way to look at it is that you don't have to stretch yourself so thin for someone who is doing very little for you. I know it stinks now, but once you get those hours in the day back for yourself, you will hopefully start feeling better very soon.",
            "Even if he does wanna be in a relationship with you and this is temporary. YOU CAN DO BETTER",
            "Please move right next to your work!",
            "It does seem like you're starting the breakup process.  So one thing to consider is where you'd live if the relationship is over.  If his new apartment suggestion happens to match up with what you would (or will) do without him, then one option is to go ahead and make that happen, and then leave the next step up to him - instead of continuing to cater to him.\n\nYou may need a clean break in order to really move on, but there are also advantages to taking a little time to find the right apartment, and to move with a little less urgency.  You can be honest about it being a step towards breaking up, but in the meantime maybe it will be possible to have some decent but [melanchol](https://duckduckgo.com/?q=melancholy&atb=v102-1)y time together.\n\nIf you do take your time, it's important not to compromise on where you move to in order to cater to your boyfriend.",
            "It does seem like you're starting the breakup process.  So one thing to consider is where you'd live if the relationship is over.  If his new apartment suggestion happens to match up with what you would (or will) do without him, then one option is to go ahead and make that happen, and then leave the next step up to him - instead of continuing to cater to him.\n\nYou may need a clean break in order to really move on, but there are also advantages to taking a little time to find the right apartment, and to move with a little less urgency.  You can be honest about it being a step towards breaking up, but in the meantime maybe it will be possible to have some decent but melancholy time together.\n\nIf you do take your time, it's important not to compromise on where you move to in order to cater to your boyfriend.",
            "No advice, but I hope your cat is ok.",
            "I went back and read your other post. I don’t think you realize how much you’ve truly compromised to stay in this relationship.  It’s time to put you first.",
            "Honestly it sounded like he wanted a way out and found it. Move on OP.",
            "If for some reason you decide to stay together don't let him manipulate you into constantly driving to him and shit.",
            "Wait are you still with him?!\n\nHe told you to move out instead of trying to compromise, this is not someone I'd want to share a life with, he's selfish and will only make your life worse in the long run if you stay with him",
            "Good news is, not married, no kids, rental not owned property. It's a much cleaner break now than years down the road so it's good you confronted him about it finally rather than wasting another 2 years of your life.",
            "You did the right thing. You deserve someone to treat you with much more respect. \n\nMy husband has 3+ hours with of a harsh city commute each day, while I'm a 30 min. I take on the additional household chores (shopping, cooking, some cleaning, etc) because his job makes more money (and has more opportunities) and that commute counts as a sacrifice so we can do what we need to do in our life. I'm not going to expect him to be knocking out the grocery shopping at 8pm when he just got home when I got home a few hours earlier, that's simply not fair or respectful. \n\n(Also, see the 2 years with him as a learning curve not as a loss. You learned a valuable lesson and now you can go out and get you a good one ;) )",
            "If you're only 2 years in and already in couples counseling, that's a bad sign. You're going to be better off.",
            "50-50 is fair when all other things are equal. That's not the case here.\n\nIf one partner works more, or has other obligations that needs to be a factor. As an example, if one works 20 hours per week, and the other does 40- it isn't reasonable to expect them to do the exact same housework. \n\nRegardless, if one partner is unhappy and the other person wants to push it off until later, or complains about how it inconveniences them, they're a shitty partner. In a relationship, each should care about the other's happiness. If they don't, hard questions need to be asked.",
            "I'm sorry, but this shows how much he wants to be with you... i say, leave it. Your future is still long and beautiful.",
            "I would spend as much time as you possibly can studying for the GRE. it doesn't seem like this relationship has a future and it seems like you have a bright future in your studies. \n\nPS. I hope your cats tests come back negative.",
            "I'm sorry to hear this is how he responded- but even if he 100% doesn't want a breakup,  how can this head anywhere else? Relationships are supposed to PROGRESS, not go backwards. Yeah some people get stuck temporarily having to do long distance relationships, but this isnt that. This is a straight up inability to compromise when things to work out according to plan. This is apparently still being together, but not as much as before. He'll likely expect you to drive to see him as well, I assume? So you're not cutting back on your commute unless you significantly reduce the time you spend with him. Plus, how easy will that be when you have pets to care for? You cant just leave them home all work day and then leave to his place overnight- Theres no winning, really. I hope I'm wrong and he's just being oblivious... \n\nThis is also kindof a cop out solution to the chore issue. No shared space, no issue if his house is messy or cleaning up after each other. \n\nIf you're up to it, OP, I'm sure a lot of us would love to hear what his solution is and what the resolution is. There isnt anything I can see going forward (marriage? Kids? Moving back in together?) without at least a time limit on this setup.\n\nAlso, sorry about your chat- hope everything is ok!!",
            "Honestly it just sounds like you're incompatible from the off. If he needs to live in a city to be happy, and you're unable to either work in the city or continue with your massive commute, then that's probably that, and it's for the best. Does it suck that he's happier to live apart than split a commute? Yes. But compromise is figuring out a situation in which BOTH people are happy, and it seems like that's not going to happen. He's not willing to sacrifice his happiness, and that's his right, as it is yours. This frees you to find someone who's either willing to compromise more or who is already compatible with you.",
            "Sounds like this loser wants to break up with you but can't so it himself so he'd rather push you until you have to do it. Moving out of a shared apartment into separate ones which aren't very far from each other is the lead up to a break up.",
            "You’re already in couples counseling at two years in. Not worth continuing.",
            "I used to have a hellish commute (2 hrs one way), and my BF would help me out with my groceries, cleaning, dinner, etc at night. To be fair, I did the bulk of weekend housework, but that was my own choosing. He stepped up on weekdays which relieved so much stress for me even if it wasn't equal. You deserve to have someone who cares about you and your stress levels and helps shoulder the shared burden.\n\nI hope he realizes that you deserve some help, and that it would be better for the relationship in the end. Moving out may be the greatest thing, even though it colossally sucks now. Enjoy the alone time and the clean apt, and prayers for your cat <3",
            ">He doesn’t compromise in any way and I’m supposed to believe this isn’t a prelude to a breakup.\n\nTrust your instincts here.\n\nYou’re both 32. This isn’t moving the relationship forward toward marriage and building a life *together* if he wants you to live *separately*. It sounds like he’s checking out of the relationship.",
            "Sounds bad that you wasted 2 years on this man but better not waste more time. Sometimes you think you know someone until their interest gets in the way. This guy can't even compromise about how he gets to work other than walking to it.",
            "Well, at least now you know who you're dealing with.  Is this how you want conflict resolution to go for the rest of your life?   Wow.",
            "I see a LOT of women validating your feelings here, and he's doing some selfish shit, but you're also being unrealistic and no one wants to give you the hard truth: this is your fault too. \n\nYou guys had a plan, your end of the plan didn't work out, and now you want him to completely change his because of it. That's not fair. It's not fair to say to your job is for him and the betterment of the relationship. That's you justifying how you feel. \n\nI'd say it's just as reasonable for him to say you should find closer work as it's your right to say he should move and make his life much more difficult and expensive because your plans didn't work out. \n\nYou're both responsible here, and you need to own your side of this.",
            "I wouldn't just sit here listening to the echo chamber of people saying this guy is a loser or a child or selfish or whatever... It's really easy to read that and re-enforce your own beliefs and just call it a day. The reality is that these people are only spitting on him because you've painted him as the villain, and he isn't here to tell his side of the story... so going off that, of course people are going to side with you.\n\nI see it differently though... I just think you two are incompatible. I don't think it's his fault and I don't think it's fair to just blame him for not being a good enough partner. You are demanding things from him in order to get your way, which is selfish in it's own way. You're asking him to uproot and live halfway between both of your jobs... You said he doesn't have a car, so that's going to be a HUGE inconvenience for him.\n\nAll I'm saying is you chose your current situation. He doesn't want to choose to worsen his situation, and I don't blame him. The only person you should be blaming is yourself for taking a job requiring you to commute that far. This sounds like a YOU problem. You keep saying this job is for both of you but the reality is it's benefiting you the most to stay with the job. You wouldn't be making that sacrifice otherwise.\n\n&#x200B;\n\nI think it's best if you two split but I don't think it's a good idea to just shovel all the blame on to him and come out of this thinking you're now \"empowered\" or something. You need to learn from your mistakes (not in choosing him as a boyfriend, but in your life decisions in general) and you need to see things from his perspective as well. Maybe don't jump into living with someone when you don't have your own life figured out yet. Maybe give more thought to agreeing to a job that has you doing a 1.5-2 hour commute. Maybe in your next relationship be more up front and vocal about things that bother you so you don't grow resentment toward your partner.",
            "*Hugs* OP.",
            "He's uhh, just not that into you.",
            "Do you think when you move out he will make an effort to come see you? I doubt it. He will still expect you to come to him. He won't move for you he definitely won't come spend time with you.\n\nI dated this guy. We lived together and then he said his commute was getting to him so he wanted to get an apartment closer to work, but it wasn't really all that much closer. He just was planning his breakup. I can now understand why he didn't tell me before, but it still felt sneaky. \n\nAt least he told you now and not when it was time to renew your lease.",
            "\"I don't want to make any effort for the relationship. Besides, I kinda like the freedom of living alone. But I DO want to have the safety of a nice woman who knows me and who cares about me and I can always run to. Long story short, I want to have my cake and eat it too\". This is how - let's move to separate places but still be together - sounds like.",
            "He's breaking up with you but still wants the benefits (sex) basically",
            "It just shows you what a selfish and unaring AH he is. I have had cats survive cancer. I am sorry you are going through all this. Take care.",
            "Your BF and you agreed to this arraignment, he walks to work and you commute. Now you want to change to what was agreed upon!? Your BF has offered you an alternative by suggesting to find a job closer to where you guys live but you won't budge, and he won't budge because he walks to work.\n\nAnd remember that the reason you chose to commute was because of school that ultimately didn't work out for you so you, for whatever reason, found a job there and continued commuting.\n\nSo, grow up and own up to your part of the agreement because your BF is holding up to his end of the agreement.",
            "Your commute is not part of your \"chore contribution\".  I have a similar total daily commute and I've never even heard somebody  consider it as a chore done for their spouse.   That really has no bearing on what other things still need to be taken care of.  \n  \nThe issue is that your bf doesn't seem to be willing to compromise or help in ways you need it.  He's clearly telling you he's not concerned with working out issues as a team and views the two of you more as independent people living together.",
            "What type of work does he do?\n\nI think he's been quite unfair. You have compromised everything and him nothing at all.",
            "So selfish, you should definitely just move closer to your job and get on with your life. It will be better for you in the long run!",
            "Well, at least now you know who you're dealing with.  Is this how you want conflict resolution to go for the rest of your life?   Wow.",
            "So, that also means that you're the one who has to move, and he's completely comfortable with you two living 90 minutes apart (I'm basing that on your commute time).  I have a hard time seeing how him telling you to move 90 minutes away ISN'T a prelude to breaking up.",
            "Looks like it's time to move find your own apartment; not to continue the relationship, but to end it.",
            "Its pretty simple really. You're better off without him than with him. I doubt he can say the same.",
            "OP, when I brought up to my SO that we don’t share our solo parking spot fairly (so I have to park on the street all the time), he agreed to share it even though it was less convenient for him.\n\nThat is how partners act - yes, we had a fight about it and it wasn’t perfect but he agreed with me and has since always respected the schedule.\n\nIf your bf’s solution is for you to move out, well - leave the apartment, and leave him too.",
            "Not as bad with my commute but an hour each was for me... about  2 hours a day.  \n\n\nSometimes there is work commitments like board meetings that really drive my time at work through the roof.\n\n&#x200B;\n\nI walk in the door and my wife who stays at home is on her phone - face down in scrolling and nothing is done in and around the house. My two year old son still needs a bath and dinner and nothing is cooked.  \n\n\nAt first I thought I could live with it. But every day I'm more and more resentful. And I'm exhausted.  \n\n\nShe thinks my job is easy. I work in communications and public relations... very busy.  \n\n\nTook this job BTW after two decades in a similar job I went to school for and loved.  \nThis was more money... better hours for her.\n\n&#x200B;\n\nLesson I'm learning.... Do things for you. And only you.",
            "You deserve the following **bare minimums** from your partner in a relationship:\n\n* Mutual Love & Respect.\n* Someone who cares about your well being and the efforts and stresses you handle in your life as much as they do the ones in theirs.\n* A partner who IS your partner and if not pro-active, at least totally willing to work with you to ensure the life you share is in equitable balance - you may not be doing a 50/50 split in all things, but the efforts should balance out. One may do more in one area than another, but so is the other person.\n* Someone who's willing to make compromise.\n* Someone who's willing to make reasonable change to things they're doing to accommodate your needs.\n* Someone who's able to admit they're wrong and help you see where you are as well in a healthy productive manner.\n* Someone who isn't happy to sit back and watch you suffer for something totally preventable.\n* Someone who's flexible enough to adjust plans when things change so both your needs can be met.\n\nI don't see any of those minimum requirements from this guy. He may be funny and sweet and even kind ***(when he wants to be)*** and you may love him and he may even *say* he loves you... but actions speak louder than words. His actions speak to someone who's more fixed on domestic score-keeping and war-of-attrition than a healthy loving relationship that serves you both. He's more fixed on not doing more chores than he feels is \"just\" than in supporting your totally reasonable & time-lined work goals.\n\nThere is no way you two should be in therapy over these issues **this** early in your relationship. You first year or 2 is an audition to see whether or not the person you're with is worthy of investing long term life with. He's loudly and directly showing you exactly who he is, he's not even trying to sugar coat it.\n\n**You are way too young to be working yourself to exhaustion for a guy who doesn't care about your efforts, your career plans or your well-being. The only thing he wants from you is housework. That is the only value he sees in you.**\n\nGirl.\n\nIt is wild to me that you're so deeply fixed on \"saving\" this relationship that you're spending time, money & emotional/mental effort on therapy, not getting any results, and still are looking for ways to make him change. He isn't going to change, he doesn't have too. He just sticks to his guns and hopes eventually you'll give up and just do things his way.\n\n**GIRL**.\n\nThere's over 9 billion people in the world. our current partner is not your best, last great hope at love and a lifetime relationship, even in a 10 mile radius. Love is just not enough.",
            "Is there any reason you absolutely have to stay with someone who would pick such a powerful thing like your work commute (same hours myself) and use it to hurt you?\n\nMaybe you would have less stress if you...  cleaned house?  ya know what I mean?  *nudge nudge*\n\nThe most important thing is being able to look at yourself in the mirror.",
            "If he doesn't have a car how would he compromise? He needs to be within walking distance of his work.",
            "This dude doesn't seem like he likes you or respects you that much.\n\nIt also seems like this is an easy way to break it off without having the courage to do it. I personally, like being with people who like me back,.",
            "I have a 2.5-3 hour commute every day because my job is where the $ is and it's costs $$$$ to live close by.   GF works ~20 min away.   I never considered that should exempt me from doing my part around the house.",
            "This approach seems so backward and nitpicky. \"I drive more for my job so you should do more chores!\"? There must be deeper problems, because I can't imagine this being the core issue. It begs questions, like do you shift chore responsibility based on:  who earns more, who has a more lively social circle, who has more family obligations, who does more volunteer work? I don't see how you just tie chores to commute.\n\nThat said, your bf sounds like he has some real issues and loves you for what (he thinks) you can give him rather than how he can love and serve you. Therapist driven breakup is a great answer. Move OUT!",
            "I think the way to look at it is that you don't have to stretch yourself so thin for someone who is doing very little for you. I know it stinks now, but once you get those hours in the day back for yourself, you will hopefully start feeling better very soon.",
            "It would make absolutely zero sense for you both to start commuting everyday If you live in a nice town/area you like. It seems like your bf might have trouble talking to you so he brought up an issue with you in therapy. Why is this a bad place to bring it up?  I think the fact that your in therapy in a 2 year relationship might say something about the relationship but that’s for you decide.",
            "\"He doesn't see my daily commute as part of my household chores.\"\n\n\"He doesn't see my tennis lessons as part of my oral hygiene routine\"\n\nThat's because they are different things.",
            "What type of work does he do?\n\nI think he's been quite unfair. You have compromised everything and him nothing at all.",
            "This is emotional blackmail. If he doesn't get his way (you get a new job nearer to home and do more of the housework) then he will give you double the bills and half of the support. He's assuming that you'll cave and come home. You are assuming that he's casting you out. Where is the therapist in all this? The therapist is supposed to help you to talk and to compromise. You need this job for experience and for medical bills, correct? So what's he offering to make it worth giving those up? In a relationship there's give and take, so what's he giving?",
            "Sounds bad that you wasted 2 years on this man but better not waste more time. Sometimes you think you know someone until their interest gets in the way. This guy can't even compromise about how he gets to work other than walking to it.",
            "You are 32.  Leave the relationship. B you have so much of your life ahead of you.",
            "So sorry about this. I know you must be hurting and maybe telling you time heals many wounds wont make you feel better, but it does. It just didn't work out with him. You'll find someone better and you'll kick yourself for not dealing with all of this sooner. \n\nHope your cat is well.",
            "Looks like it's time to find your own apartment; not to continue the relationship, but to end it.",
            "It does seem like you're starting the breakup process.  So one thing to consider is where you'd live if the relationship is over.  If his new apartment suggestion happens to match up with what you would (or will) do without him, then one option is to go ahead and make that happen, and then leave the next step up to him - instead of continuing to cater to him.\n\nYou may need a clean break in order to really move on, but there are also advantages to taking a little time to find the right apartment, and to move with a little less urgency.  You can be honest about it being a step towards breaking up, but in the meantime maybe it will be possible to have some decent but melancholy time together.\n\nIf you do take your time, it's important not to compromise on where you move to in order to cater to your boyfriend.",
            "Its definitely not a easy process especially when you feel like you’ve given 100% into this relationship and gone beyond what you could do for this person, but think of this as the first huge step for you in your life. A healthy life. Which you need. Times like this you really need to put yourself first. If he’s not the right guy to appreciate the things you have done for him, then try to think of this as a positive thing and better now than later, when it could’ve been a lot worse. I’m glad you are in the mindset of moving on. It can only get better from here so keep your chin high!",
            "I was in a relationship where my partner suggested living separately (after living together for a year) and stay together.. And I tried it for a while.\n\nIt WAS a prelude to breaking up. It hurt a lot. Knowing my partner couldn't be straightforward and honest with me. Knowing they wanted things other than a future with me.\n\nBut the past is the past, and with hindsight being 20/20, I can say I dodged a bullet. My ex partner did me a favor. I see things about her that I did not see when I was with her. \n\nOP, tell your bf that if you move out, you're done. Don't let him convince you otherwise - move out, go no contact, distance yourself, get your priorities in focus, and work on finishing school and grabbing your great job. \n\nThe positive in every breakup is what you take away from it. In the future, you'll recognize unfair sharing of chores is a huge red flag, and that when you communicate an issue to your partner and they brush it off, something is wrong.\n\nI know it hurts right now, but it will be okay, and one day you'll look back on this and realize you are far better off. \n\nBest of luck to you, and I hope your kitty is doing well!",
            "I’m sorry that you are going thru this!! His demeanor will not change. Stand your ground now, rather than later. Do what is right for you!! If you buckle to what’s suits him, you are setting a precedent! There are a 1k things I can say about him, but you won’t agree yet!!! Hope you’ve considered you just might deserve more than what he has to offer you in this relationship. ❣️",
            "well I think a compromise is that you guys don't need to break up, but you just need to move out to a place closer to your job.\n\nYou can still stay together, you just can't live together.\n\nbut if you feel like that's the beginning of a breakup,  then I guess that is still on the table too\n\nGenerally , each partner should want to make things as easy as it could be for the other partner.  like you said if you have a long commute then he would probably do more of the chores.  but since he seems to be thinking about himself more often in this relationship then I think that's a very big answer for you also.",
            "[removed]",
            "Wow, I'm really sorry, what a tool. I would leave earlier if you can, don't waste anymore time on on this guy. If you can't compromise now on living arrangements how will you do so in the future?",
            "You sound like a reasonable person and him not so much. If he refuses to compromise then you have no future together.",
            "I sorry that you are here, it sucks what your boyfriend is doing.\n\nSounds like it is time to take care of yourself. Move close to your work and get the burden, of the commute, off yourself. \n\nYour boyfriend is not willing to meet you halfway, or do anything to help out. Time for you to move on alone.",
            "If you stay with him, this is what your life will be. Think about that. Do you want this is 5, 10 years from now? Imagine having kids with him.",
            "How are you? What ended up happening?",
            "Sorry but whoever commented on your previous post telling you to raise this as an issue is brainless. \nYou’ve been living in the same place for over 2 years yet you haven’t looked for another job closer by? You, yourself have chosen to commute for nearly 3 hours every workday for the past 2 years. That’s not his fault. \n\nAlso why would your choice of travelling for 3 hours a day be a contribution to your chores? While you are commuting,are you ironing clothes, making dinner, putting the washing into the machine, hoovering? Nope. So why would you think you should get away with doing the minimum around the house because you chose to work 3 hours away from what is essentially your home? \n\nOn another note, it seems you are making this all about yourself, and your cat that may have cancer. If I’m honest the fact that your pet may have cancer has absolutely no relevance to the situation. I’d advise you to leave this man, your wasting both your times and are clearly not compatible to live with each other.",
            "You’ve been living in the same place for over 2 years yet you haven’t looked for another job closer by? You, yourself have chosen to commute for nearly 3 hours every workday for the past 2 years. That’s not his fault. \n\nAlso why would your choice of travelling for 3 hours a day be a contribution to your chores? While you are commuting,are you ironing clothes, making dinner, putting the washing into the machine, hoovering? Nope. So why would you think you should get away with doing the minimum around the house because you chose to work 3 hours away from what is essentially your home?",
            "I'm sorry but I think you both are wrong.\n\nAbout you, having more commute time is not an excuse to contribute less in the chores. Also you made the point that he only has to walk to validate your statment.\n\nAbout him, not accepting your proposal to move halfway and suggesting you to move to your own aparment is wrong. It's like him showing no interest in you.\n\nBut, overwall, I think the main point here is that the commute time seems to be a problem you both have had for a while and now it has become a pride-problem. You both are pulling without thinking in the other one. The string will break, sooner or later, you should discuss all your options before that happens.\n\nAlso, having your own aparment doesn't mean it's a breakup while in the long run I see, not doing 50-50 in the chores, a major problem.",
            "Either he’s delusional about what your relationship will be like when you’re living an hour apart and he has no transportation. Or he fully expects all the responsibility of keeping up the relationship to remain in your hands. Or he actively wants the relationship to deteriorate without actually doing anything about it so he doesn’t feel guilty. None of these are great indicators of a positive outlook for a relationship. But great outlook if you want to be single and move on with your life. Hopefully to someone who understands compromise and working on common goals as a team. Not to mention someone who will encourage and support your professional aspirations. I’m sorry you have to deal with this, and I’m sorry about your kitty.",
            "😐😑😐😑😐\n\nYour (ex) boyfriend seems like trash. I'm sorry he didn't make himself better known in the last two years.",
            "Doesn't matter if he doesn't want to break up I would have left him right then and there, I'm sorry you have to deal with this especially with chronic illness. When I read you drive 3 hours a day basically I wanted to cry, I have chronic illness and fatigue too. Do you have anywhere you can go immediately to initiate NC or do you have to live with him until you find a new, cute amazing apartment just for you?",
            "Either he’s delusional about what your relationship will be like when you’re living an hour apart and he has no transportation. Or he fully expects all the responsibility of keeping up the relationship to remain in your hands. Or he actively wants the relationship to deteriorate without actually doing anything about it so he doesn’t feel guilty. None of these are great indicators of a positive outlook for a relationship. But great outlook if you want to be single and move on with your life. Hopefully to someone who understands compromise and working on common goals as a team. Not to mention someone who will encourage and support your professional aspirations. I’m sorry you have to deal with this, and I’m sorry about your kitty.",
            "Focus on your cat. Drop the man child",
            "Focus on your cat. Drop the man child",
            "So sorry about this. I know you must be hurting and maybe telling you time heals many wounds wont make you feel better, but it does. It just didn't work out with him. You'll find someone better and you'll kick yourself for not dealing with all of this sooner. \n\nHope your cat is well.",
            "Well, at least now you know who you're dealing with.  Is this how you want conflict resolution to go for the rest of your life?   Wow.",
            "Your job is going to be temporary till you re-apply for grad school, right? Having each of you live closer to where you work will ease your commute burden and will solve the housework issue immediately. If the rest of the relationship is healthy there is no reason why this should be a deal breaker and then once you are in grad school you can move back in together.",
            "This is emotional blackmail. If he doesn't get his way (you get a new job nearer to home and do more of the housework) then he will give you double the bills and half of the support. He's assuming that you'll cave and come home. You are assuming that he's casting you out. Where is the therapist in all this? The therapist is supposed to help you to talk and to compromise. You need this job for experience and for medical bills, correct? So what's he offering to make it worth giving those up? In a relationship there's give and take, so what's he giving?",
            "Its pretty simple really. You're better off without him than with him. I doubt he can say the same.",
            "Yeah it sucks but at least you are getting out now and not being dragged along anymore. I'd just try to find an apartment as soon as possible and just accept the relationship is over. Don't make a scene or a fuss but just quietly move out and move on with your life. I know it's hard and scary, but you deserve someone you will be happy with.",
            "Hey,\n\nI think you're doing amazing but you should put yourself and your cats first.\n\n100% go for that career prospect if you can afford living alone. Screw him.\n\nI also was diagnosed with chronic fatigue when I was 13 (I'm now 26), then Hypermobility when I was 17, and I have had an ass of an ex that didn't understand the sheer mental and physical problems you get with it.\n\nChin up Hun.",
            "I hope you move close to your current job or wherever you want to work and get yourself a good commute!",
            "yeaaaah he's avoiding breaking up with you, but its obvious that he has no intention of building a life with you. Per his behavior, you shouldn't want to build one with him either. \n\nI dated a guy like this. I moved for him because everything had to be convenient for him in our relationship. He ended up kicking me to the curb, and I was left realizing that I had put in ALL of the initiative and effort into our relationship in many ways. I planned dates, I moved, I cleaned, I grocery shopped... yadda yadda. He didn't want a partner, he wanted a girl around who he didn't have to try and do anything to keep. Sounds very similar to your guy to be honest.\n\nCut your losses and run.",
            "Your boyfriend is very selfish and quite lazy. Get your own place and drop him like a hot potato. You can find someone much more caring and considerate.  Sorry about your cat. I will say prayers it's not cancer. Also, cancer can be treated. Get a second opinion and see a vetinary oncologist. Good luck! Xoxo",
            "Take your cat too! I'm sorry he couldn't understand you and your situation. I hope you'll find somebody kind and loving and understanding! If you live in NC I know a great dude!",
            "I spend the same amount of time commuting and he has to realise how exhausting and disruptive this is. 3 hours a day! I am so jelous of the things my friends can do while I'm stuck in a bus for hours.\n\nImagine what you could do with this time: the dishes you could cook, the meet ups you could have with friends, the rest you could have. I'm furious on your behalf that this guy is unwilling to budge an inch for you, and the reason is he knows exactly what it does to you and is unwilling to experience even the half of it for your sake.\n\nHe's not worth the money you're spending on therapy.",
            "[deleted]",
            "Tbh your job sounds way better than this guy.",
            "You sound amazing and you deserve to be with someone who is willing to compromise for your relationship.",
            "He's being unreasonable and not prioritizing you or the relationship. Not good enough.",
            "I have chronic fatigue syndrome and holy shit I don't know how you do that commute. I once tried a 2-hour-round commute on a part-time job and it killed me! And I'm on the milder end of the CFS spectrum. You must really love him to put yourself through that, but he's not returning the favour (but you already know that). Either he doesn't feel as strongly as you do or he's really fucking selfish - is that someone you want to build a life with? You're clearly smart and kind. YOU CAN DO BETTER",
            "Not sure if it still matters but I feel the commute part if something of your own choice which is hindering you growing into this relationship as well. You are choosing to stay in a job, which requires this commute. It might be difficult to find another job but you can't put the blame on him entirely if you're not willing to change either.\nYou're struggling with a chronical illness and refuse to listen to your body for a good job, it's going to catch up sooner or later.\nI commute 1 hour/day to work, my girlfriend 20 minutes and we do the same amount of household tasks, I just mostly do my part in the week, she does on weekends. It works, but seeing you already are in couples therapy after I'm guessing that's not the only thing going wrong?\nBest of luck with everything.",
            "Your commute is your choice and shouldn't be counted towards chores. He should clean up after himself but you should help if you eat/drink whatever he makes. Moving away closer to work would work for you yes, but what about him? He doesn't have a car and has to walk to work, it would just be more walking.",
            "Either he’s delusional about what your relationship will be like when you’re living an hour apart and he has no transportation. Or he fully expects all the responsibility of keeping up the relationship to remain in your hands. Or he actively wants the relationship to deteriorate without actually doing anything about it so he doesn’t feel guilty. None of these are great indicators of a positive outlook for a relationship. But great outlook if you want to be single and move on with your life. Hopefully to someone who understands compromise and working on common goals as a team. Not to mention someone who will encourage and support your professional aspirations. I’m sorry you have to deal with this, and I’m sorry about your kitty.",
            "I also think there is another side to this. It would make absolutely zero sense for you both to start commuting everyday If you live in a nice town/area you like. It seems like your bf might have trouble talking to you so he brought up an issue with you in therapy. Why is this a bad place to bring it up?  I think the fact that your in therapy in a 2 year relationship might say something about the relationship but that’s for you decide.\n\nBy the way, how’s the sex?  Are you sexually comparable or this also an ongoing problem?",
            "\"Nah I'm good, you keep doing all the work so I don't have to\"\n\n~your lazy ass selfish boyfriend\n\nTake your cat and leave this turd.",
            "What type of work does he do?\n\nI think he's been quite unfair. You have compromised everything and him nothing at all.",
            "I'm confused by your post. The tl;dr makes it seem like a good compromise would be to move to a location more centrally located between your work places. But even if you did, you would still be responsible for car upkeep and some of the things that you mentioned bothering you in your initial post.\n\nSimply put: based on what you've written, I am not sure that moving to a centralized location solves the issues here. \n\nYour boyfriend suggesting you move to another apartment is a huge blow, and I'm sorry for that. I get frustrated that the default Reddit response of breaking up is happening, but it's expected. Based on what you've said in the two posts (I haven't read your comments since I don't normally dive into the comment sections of posts like this), I think it's possible for the two of you to work on finding a solution together.",
            "It would make absolutely zero sense for you both to start commuting everyday If you live in a nice town/area you like. It seems like your bf might have trouble talking to you so he brought up an issue with you in therapy. Why is this a bad place to bring it up?  I think the fact that your in therapy in a 2 year relationship might say something about the relationship but that’s for you decide.",
            "I'm so sorry, this sucks. BUT this sounds like a lucky escape. He shouldn't have \"let\" you do such a terrible commute in the first place . You have probably saved yourself grief down the road (like when he would let you do all the childcare if you were gonna have kids or would let you take care of yourself when your health suffered....)",
            "The fact that you’re receiving relationship therapy together after only 2 years of dating isn’t good. You don’t sound compatible.",
            "\\*hugs\\* Sorry you have to deal with such a selfish man and truly hope that your kitty is healthy and happy.",
            "This is emotional blackmail. If he doesn't get his way (you get a new job nearer to home and do more of the housework) then he will give you double the bills and half of the support. He's assuming that you'll cave and come home. You are assuming that he's casting you out. Where is the therapist in all this? The therapist is supposed to help you to talk and to compromise. You need this job for experience and for medical bills, correct? So what's he offering to make it worth giving those up? In a relationship there's give and take, so what's he giving?",
            "The ultimate conclusion to tackling problems is they force reality. Two years is a long time, but when things are pushed away and denied they remain, even for decades; then the two years doesn't seem so long. \n\nAll said and done, as relationships begin to falter and we feel the pangs of hurt, it doesn't matter; it sucks for everybody.\n\nHang in there, addressing the concern was courageous.\n\n\\~Troy (Flourishing Life Society)",
            "The ultimate conclusion to tackling problems is they force reality. Two years is a long time, but when things are pushed away and denied they remain, even for decades; then the two years doesn't seem so long. \n\nAll said and done, as relationships begin to falter and we feel the pangs of hurt, it doesn't matter; it sucks for everybody.\n\nHang in there, addressing the concern was courageous.\n\n\\~Troy (Flourishing Life Society)",
            "The ultimate conclusion to tackling problems is they force reality. Two years is a long time, but when things are pushed away and denied they remain, even for decades; then the two years doesn't seem so long. \n\nAll said and done, as relationships begin to falter and we feel the pangs of hurt, it doesn't matter; it sucks for everybody.\n\nHang in there, addressing the concern was courageous.\n\n\\~Troy (Flourishing Life Society)",
            "The ultimate conclusion to tackling problems is they force reality. Two years is a long time, but when things are pushed away and denied they remain, even for decades; then the two years doesn't seem so long. \n\nAll said and done, as relationships begin to falter and we feel the pangs of hurt, it doesn't matter; it sucks for everybody.\n\nHang in there, addressing the concern was courageous. \\~Troy (Flourishing Life Society)",
            "The ultimate conclusion to tackling problems is they force reality. Two years is a long time, but when things are pushed away and denied they remain, even for decades; then the two years doesn't seem so long. \n\nAll said and done, as relationships begin to falter and we feel the pangs of hurt, it doesn't matter; it stinks for everybody.\n\nHang in there, addressing the concern was courageous. \\~Troy (Flourishing Life Society)",
            "The ultimate conclusion to tackling problems is they force reality. Two years is a long time, but when things are pushed away and denied they remain, even for decades; then the two years doesn't seem so long. \n\nAll said and done, as relationships begin to falter and we feel the pangs of hurt, it doesn't matter; it stinks for everybody.\n\nHang in there, addressing the concern was courageous. \\~Troy",
            "The ultimate conclusion to tackling problems is they force reality. Two years is a long time, but when things are pushed away and denied they remain, even for decades; then the two years doesn't seem so long. \n\nAll said and done, as relationships begin to falter and we feel the pangs of hurt, it doesn't matter; it stinks for everybody.\n\nHang in there, addressing the concern was courageous. \\~Troy",
            "The ultimate conclusion to tackling problems is they force reality. Two years is a long time, but when things are pushed away and denied they remain, even for decades; then the two years doesn't seem so long. \n\nAll said and done, as relationships begin to falter and we feel the pangs of hurt, it doesn't matter; it stinks for everybody.\n\nHang in there, addressing the concern was courageous. \\~Troy",
            "Either he’s delusional about what your relationship will be like when you’re living an hour apart and he has no transportation. Or he fully expects all the responsibility of keeping up the relationship to remain in your hands. Or he actively wants the relationship to deteriorate without actually doing anything about it so he doesn’t feel guilty. None of these are great indicators of a positive outlook for a relationship. But great outlook if you want to be single and move on with your life. Hopefully to someone who understands compromise and working on common goals as a team. Not to mention someone who will encourage and support your professional aspirations. I’m sorry you have to deal with this, and I’m sorry about your kitty.",
            "Regarding the timing, while this isn't a particularly perfect time, just know that there's rarely ever a good time to do what he did. If you haven't already, I would start making arrangements to take his suggestion and move closer to work, but definitely not to continue a relationship with this asshole. Focus on yourself and your cat right now, I'm so sorry to hear things aren't going well with her, but at least less time with him will give you more time to bond with her, no matter the outcome :)",
            "I'm confused by your post. The tl;dr makes it seem like a good compromise would be to move to a location more centrally located between your work places. But even if you did, you would still be responsible for car upkeep and some of the things that you mentioned bothering you in your initial post.\n\nSimply put: based on what you've written, I am not sure that moving to a centralized location solves the issues here. \n\nYour boyfriend suggesting you move to another apartment is a huge blow, and I'm sorry for that. I get frustrated that the default Reddit response of breaking up is happening, but it's expected. Based on what you've said in the two posts (I haven't read your comments since I don't normally dive into the comment sections of posts like this), I think it's possible for the two of you to work on finding a solution together."
        ]
    },
    {
        "post_id": "x6wi82",
        "author": "RainbowFamily412",
        "title": "[UPDATE] How do I (17F) tell my mom (36F) that I know her 'best friend' (30s-40s?F) is her girlfriend?",
        "url": "https://www.reddit.com/r/relationships/comments/x6wi82/update_how_do_i_17f_tell_my_mom_36f_that_i_know/",
        "score": 3994,
        "num_comments": 158,
        "created_utc": 1662425560.0,
        "selftext": "Previous: https://old.reddit.com/r/relationships/comments/x51v9y/how_do_i_17f_tell_my_mom_36f_that_i_know_her_best/\n\nThere were way more replies than I could keep up with! For the day off today we decided to order dinner for takeout, and when my mom told me her order I asked her if I should put in an order for Kim as well. My mom asked why I thought Kim would be eating dinner with us, so I told her they hang out so much Kim is practically her girlfriend and I'm really happy for them both and they don't need to hide it from me.\n\nTurns out I was right about my mom dating a woman but wrong about it being Kim. About the same time she met Kim, she also met Jin at a professional conference of hers, and they've been dating for a few months now. My mom invited Jin over to dinner and it turns out they kept all their mushy stuff on my mom's smartphone, I knew they were friends but turns out half the time my mom's 'gone out to dinner with a friend' lately it's been Jin.\n\nMy mom hadn't told me for a few reasons. She grew up in a super conservative area and was kinda forced to marry my dad right after high school. She's not sure if she's bi or gay or has an exception or what, she's still working through a lot of stuff about how she feels and what she wants to call herself.\n\nShe also didn't want to tell me until I turned 18 because she's pretty sure my grandparents and aunts and uncles will disown her when she comes out, and make me choose. My mom wanted to wait until I was legally an adult and could make my own decisions about my relationships with my family. \n\nI hugged my mom and told her I don't give a shit what some hateful, miserable antediluvian cretins yammering from the primordial ooze say, she's my mom and she's awesome and I love her and Jin seems like a great woman. I told her that if the crabs in the bucket want to pull her back down, make crab cakes with rainbow sprinkles.\n\nJin laughed her head off but my mom asked me to please not say anything in public. She's working through personal shit and she'll come out in public when she's ready, so I promised I wouldn't say a word to anyone.\n\nExcept to you guys, there was so much awesome advice. Thank you, reddit!\n\nEDIT: To whom it concerns, 'Kim' and 'Jin' are of course not their real names, and I've fudged how long my mom's known these people for.\n\n---\n**tl;dr**: right about my mom dating a woman, wrong about which woman, mom's working through personal stuff before she comes out publicly but knows I love and support her",
        "permalink": "/r/relationships/comments/x6wi82/update_how_do_i_17f_tell_my_mom_36f_that_i_know/",
        "comments": [
            "I am too stupid to understand that 3rd to last paragraph at all but I’m very happy for all of you. Your mother is so lucky to have you!\n\nEta I really appreciate anyone explain that paragraph to me 😭💕",
            "PLOT TWIST! I love it! \n\nAnd now I’m craving crab cakes.  😈\n\nETA: also, as someone whose family tease her for using “$10 words”, I love “antediluvian cretins”. As the Reader’s Digest used to say (yeah, I’m old), it pays to increase your word power!",
            "Mom: Don’t say anything in public\n\nOP: Tells the entire internet",
            "I'm so happy for you and your mom that she finally felt comfortable enough to come out to you. You're a great daughter! Hopefully the two of you can find a way to no longer care what some bigoted low life relatives think of her. You did a good job here!",
            "> miserable antediluvian cretins yammering from the primordial ooze\n\nYou are awesome. Glad it turned out well for you!",
            "Wow surprise twist but I’m loving this update!",
            ">I hugged my mom and told her I don't give a shit what some hateful, miserable antediluvian cretins yammering from the primordial ooze say\n\nYou're a great writer! Keep it up",
            "Please don't ruin your crab cakes with sprinkles, lol! Seriously, good for you!!!",
            "OP: I highly recommend a coming out support group for your mom (when she is ready). They help people navigate the coming out process and may even have resources for you as an ally!",
            "I read your original post and I'm so happy to see this update! I remember when one of my best friends came out to me as bisexual. He was scared that he'd loose our friendship cause at the time I was pretty religious. I told him that he's still my friend and that I'm glad to have been a safe enough place for him to come out to me. He's going to be the best man at my wedding next year. Glad to see you be that safe space for your mom.",
            "That’s amazing. Glad it worked out and I hope your mom will give herself the grace and patience to work out herself.\n\nIt takes a lifetime to figure out who we are",
            ">if the crabs in the bucket want to pull her back down, make crab cakes with rainbow sprinkles.\n\nThis is the greatest thing I've heard in a long time!!\n\nGood for you and for your Mom, OP. You seem like a fantastic daughter, keep that attitude forever. :)",
            "> hateful, miserable antediluvian cretins yammering from the primordial ooze\n\nExcellent description.",
            "OP, I would HIGHLY  recommend the book “Untamed” by Glennon Doyle (and her podcast too) for your mom.",
            "Happy for you and your mom, but can I say that the crab cakes line was absolutely raw? Cause wow.",
            "This is so wholesome. \n\nProps to you for being so awesome, and props to your mom for raising you to be awesome.",
            "This makes me so happy. You and your mom are awesome. You both represent good communication and the perfect mother/daughter duo. Good luck with the extended family but I don’t think you will need it with two powerhouse women such as yourselves.",
            "You are a good person and you made my heart smile here. 💜",
            "You are a Fantastic young woman and daughter",
            ">I don't give a shit what some hateful, miserable antediluvian cretins   \nyammering from the primordial ooze say, she's my mom and she's awesome   \nand I love her and Jin seems like a great woman. I told her that if the   \ncrabs in the bucket want to pull her back down, make crab cakes with   \nrainbow sprinkles.\n\nThese are literally the best two sentences I've read on the internet in weeks.   \n\n\nWell done with everything.",
            "I just want to say that you are an absolute sweetheart. Your mom raised an incredible young woman and I'm so happy for you and your mom 💕",
            "Sounds like she raised a good kid!",
            ">hateful, miserable antediluvian cretins yammering from the primordial ooze\n\nYou may have a career in either writing, or professional criticism",
            "I love this post! It's nice to get some sweet wholesome stories",
            "Wonderfully handled! I’m sure you will always have an amazing bond and be there for each other even more!",
            "This is lovely and I'm tearing up. I hope when I have kids they turn out like you.",
            "1, this is excellent, glad your mom is happy! 2, \"antediluvian\" is my word of the day. 3, \"crab cakes with rainbow sprinkles\" might be the most disgusting thing I've ever imagined.",
            "20m here, I’m a guy who was in your exact position. My mom is gay also, however there wasn’t a real time that I “found out”. She never hid her girlfriend from me, it was just something I was too young to realize at the time but slowly just realized, oh, it’s who she is, and I went with it. My grandmother disowned her (she came around, another story for another day). But it’s nice to know I’m not really alone in being in this position, your moms story is almost an exact replica of what mine went through. You’ve got my support as well as both my mom’s.",
            "> hateful, miserable antediluvian cretins yammering from the primordial ooze\n\nI'm going to have to write that down.  Amazing.",
            "Good for you, kid. And go go go RainbowFamily412's mom! You're taking the next (albeit hard) step to your authentic self. Good on you, too. <3",
            "Yay! I love happy endings! \n\nThanks for the update.",
            "Aw this is such a great update. Well done you for being a great kid!",
            "I’m so happy for you guys!! I’m so glad she has someone in her corner that supports her for being herself <33 Im also happy for you cause you might get another female figure in your life!!",
            "i’m so happy for your mom! thanks for taking it so well op, as someone who wasn’t accepted by her family when she came out, it means more than you know <3",
            "I would like to subscribe to Crab facts!",
            "What a wonderful, wonderful daughter you are — your mom is lucky to have you — and vice versa. Best of luck to you & your mom (and whomever gets to be your bonus mom)!!",
            "Oh my goodness, I'm so very glad it all worked out happily! And thank you for being such a great kid!",
            "Your mom is really lucky to you.",
            "I'm so happy for you and your mom!!",
            "Glad this trun out ok. Good for you all.",
            "I’m proud of your mom.",
            "So why was the mom spending all her time with Kim?",
            "Such a great ending, OP! So happy it all worked out…😊\n\nAlso, \n\n> “I don't give a\nshit what some hateful, miserable antediluvian cretins yammering from the primordial ooze say…”\n\nTake my effin gold! 🏆",
            "Excellent word choice. 👏  I'm happy for you and your mom.",
            "Calling a lesbian or bi person a “carpet muncher” is about the most bigoted thing you can say. Please don’t do that. It’s pretty much the equivalent of calling a black pets on the N word.",
            "Extra rainbow sprinkles with double cherries on top!!!! Not everybody has to like her decisions; they’re not theirs, they’re hers ❤️",
            "Welcome to the family!!!!! You are one awesomesauce offspring. May you all know nothing but love, sunshine and of course, rainbows! And anyone that needs tries to come after her will have to go through us Mama Dragons. Proud of you and rooting for love.\n\nSigned,\nProud Mama Dragon",
            "So yeah you ignored my advice as a woman in pretty much your mum’s situation and age bracket to not forcibly out her and dismissed her incredibly valid fears about being out and the very real trauma many women of her generation experienced about their sexuality. Babe, in my Western country they could institutionalise you for life for this and that leaves wounds. Deep fucking wounds. And I can’t really mention the other sexual trauma around sub rules.\n\nYou are not supporting and being an ally if you dragged it out of your mum while she begged you not to out her further and made a big dramatic speech about how primordial the bigots are. Wait til you learn that’s your grandparents, her boss, your teachers, half her friends and you are going to be so torn that they are nice to you but made her feel closeted and scared for decades.\n\nYou are way out of your depth, you followed the advice of a bunch of cishet people who thought this was a Netflix special and you ignored every single cue that your mum really did not want to discuss this but you pushed her into inviting Jin since it’s been like three days since your post.\n\nIf your mom had done that her 17 year old working through their sexuality the ‘no contact’ flag would be flying. Allies are only allies if they listen to what the people they profess to support need instead of decide what is best for them.\n\nNone of the ‘rainbow sprinkle crab cake’ it’s all got better now people when I came out at 36F did shit when shit actually hit the fan. Turns out real life isn’t as Pride month cute as they thought and it gets boring when they ‘you go girl’ and I say stop because my estranged family are calling the cops on me for having a GF. In a different country.\n\nYou are 17 and you mean well but the road to hell is paved with good intentions and this rainbow sprinkle naivety is a toxic positivity that objectifies queerness and its history, future and present to a harmful degree. You need to stay in your lane and let your mom be herself. I bet you expect the same courtesy from her including not having to disclose your crushes, sex life and personal insecurities because she snooped your internet search history?\n\nLearn some boundaries. Your mom was so fearful of you snooping she has led a double life for months and yup, she was right you would make it a big deal thus putting massive pressure on her and the relationship with Jin. The adult here did read the room….",
            "[deleted]",
            "So it sounds like all's well that ends well. I'm glad you got resolution. And it sounds like your mom is in a good place.\n\nSide note: your mom knows whether she's bi or gay. If you're incapable of being sexually attracted to a gender, then you can't be bi. If you're literally capable of being sexually attracted to both, then you're bi. It's pretty simple, really. Whether someone will admit their true predilections is a different matter. But I assure you she knows.",
            "Just tell her. Stop making life a jrpg or sitcom. Just say \"hey mah, ya like girls and thats cool.\"",
            "I’m kinda bummed for Kim though.",
            ">I don't give a shit what some hateful, miserable antediluvian cretins yammering from the primordial ooze\n\nIf you really said that extemporaneously I would adopt you. \n\n>make crab cakes with rainbow sprinkles.\n\nOk, never mind.",
            "Come back when your mom, Jin, and Kim are in a love triangle lol.",
            "She Fkn gay. You can’t have intercourse  w the same sex and not be gay. Come back to earth",
            "You don’t. U wait for her to come out to you.",
            "You say mom I know you’re fucking your best friend"
        ]
    },
    {
        "post_id": "hodnvv",
        "author": "ThroawayDaron",
        "title": "[Update] I [20M] am destroying my life and i'm having a hard time changing my behavior",
        "url": "https://www.reddit.com/r/relationships/comments/hodnvv/update_i_20m_am_destroying_my_life_and_im_having/",
        "score": 3985,
        "num_comments": 129,
        "created_utc": 1594336506.0,
        "selftext": "Link to the previous post : https://www.reddit.com/r/relationships/comments/63pps4/i_20m_am_destroying_my_life_and_im_having_a_hard/\n\nHey,\n\nIt's been a while, and i know nobody remembers me but whatever. So i'm 23 yo now, and a lot has changed, after my last post, i spent the next 2 years doing nothing because i was broken.\n\nI went back to study something i loved this year and got my diploma (BTS in France if you care, it's not much but it's alright.), and i'm now gonna push for more since i loved this year very much.\n\nMy ex-girlfriend ended up dating someone else richer and more handsome than me, but whatever. We're still friends tho, being the only woman on earth who has ever made me laugh. I did not date anyone else since, most women i thought i had a good feeling with did not find me attractive so i didn't push.\n\nWell all in all, it's alright, i got my driver license too, your past comments ended up being useful for me in a way, even if i acted 2 years later.\n\nSorry for the typos i'm not fluent enough in english.\n\nTldr: I'm doing better career-wise.\n\nEdit : I'm reading all your messages you are all very kind, I chose to respond to your comments with my main account \"Limanys\" because I don't care if my friends see my posts now. Thank you all",
        "permalink": "/r/relationships/comments/hodnvv/update_i_20m_am_destroying_my_life_and_im_having/",
        "comments": [
            "I’m proud of you. You identified a problem and you made the change to better yourself, even if it took you a while to get going. You got this friend.",
            "Bruh, I *remember* your original post. \n\nI’m so, so proud of you. If you don’t hear it from anyone else, know that you’ve made someone on this big ole planet proud of you.",
            "Just remember, life is not a sprint, it’s a marathon. You need to go at your own pace. I speak from experience of making a shit ton of my own mistakes. I didn’t figure out what I wanted to do till I was 22 but graduated at 25 with a bunch of guys who were mostly around the same age and the same situation and we’ve been close for almost 12 years...I’d say focus on your mental and physical health. You are in the years of your life that can lay some serious foundation for the man you want to be. Nothing comes overnight but you are making steps in the right direction. Start making friends with people, even making small talk. That way you can build your confidence and become more social.",
            "I know attractiveness DOES matter, but I want to say that I date men of all levels of attractiveness, but I will not date someone who is unhappy or depressed and not getting treatment. I have had to work so, so hard to be okay, and find my own happiness, and pull myself out of my own depression, that I can feel someone else's pulling me back. \n\nSo your looks may have less to do with the women being uninterested than with your overall outlook on life and how you feel about who you are and what you can offer them. \n\nI know others have said it, but I think therapy could be something that helps you.\n\n(Also, 23 is so, so young. If, at 23, you have been able to find something to study that you love, and get a diploma, and have a good friend who cares about you, you're doing pretty well)",
            "Only one woman your entire life has made you laugh? That seems strange, but glad you’re doing well!",
            "Force à toi mec, c'est un peu bateau, mais t'es ta propre limite. Taff à fond mais oublie pas de te laisser le temps de profiter des trucs qui te bottent. Bon courage gros.",
            "Congrats for what you've already accomplished! You have so much more in front of you. And you have plenty of time to find a life partner..... I was 30 when I met my husband, and I was very single before then.",
            "Your English has improved a lot. Congratulations on moving on. Keep it up!",
            "It sounds like you've got this, even if you don't know it. Keep pushing to do what you love and be proud of how far you have come.",
            "Well Kudos to you! Keep pushing!",
            "any improvement is improvement :-) keep it up!",
            "Congratulations! Things take time. I got my license at 25. I haven't finished any formal qualifications. Everyone goes at their own pace. You're doing great :) \n\nThere are also minimal typos in your post so, well done for your English skills too!",
            "You're only 23 my man, you're very young still. Good job on what you've done so far!",
            "I'm sure you're much better looking than you perceive yourself to be.\n\nI hope this doesn't sound harsh, but when in romance, people pick up on that and sometimes it can turn out to seem unattractive. Self-confidence is key. You dont have to think you're handsome, the key point is not caring if you're handsome. \n\nYou seem very apathetic and I relate way too well to it... If you need someone to bounce some things off of I'm more than happy to talk about life things with you. Or just anything.\n\nHaving a friend is important.",
            "J'étais comme toi pendant bien plus longtemps que toi. Je m'en suis sorti en trouvant du travail miraculeusement à l'âge de 26 ans. A 28 ans j'ai repris mes études et là je viens de terminer ma licence et je vais entrer en master à 30 ans. \n\nDonc vraiment, continue à te concentrer sur ton bien-être et faire ce que tu aimes, t'es pas tout seul et surtout ne te compare pas aux autres. Seul le présent et le futur compte et c'est ce sur quoi il faut se concentrer. Fait la paix avec ton passé et regarde devant. \n\nForce et honneur frérot !",
            "Your English got better dude, just keep working on it and you’ll get better in no time.\n\nPlus sérieusement, je serai curieux de savoir comment tu te sentais exactement pour être “resté  figer” pendant deux ans? Aussi, si tu te sentais brisé, man faire de la thérapie pourrait probablement t’aider. \n\nMême de l’autre côté de l’océan, ça se voit que tu t’améliore. Keep it up dude!",
            "Tsé, le manque de motivation, l’impression de ne rien valoir, de n’être bon à rien, de s’inhiber (boire pour éviter les émotions), éviter de se confronter au fait que l’on doit changer (j’ai fais longtemps la même chose avec les jeux vidéos), man t’étais pas mal proche d’être en dépression (ou en épuisement). \n\nL’important c’est que tu t’en sois sorti! :) \n\nJe te souhaite sincèrement de ne jamais avoir revivre ce genre d’épisode. Et aussi de continuer à avancer!\n\nBonne chance man!",
            "My heart goes out to you because I’ve been through similar situations in my life and been close to others who did.  \n  \nUnfortunately, in my personal experience the French culture does not give much emotional support to people who are stuck or having a difficult time mentally. If this was a painful or lonely experience for you, i hope that you found peace here on the internet. You deserve to be treated with empathy and kindness, because it brings more healing and strength than mean words. \n  \nMy only advice is this: don’t think about these two years as wasted. You needed to experience that to be who you are today, and you are already a more self-aware adult. The French system puts so much pressure on students at this one life stage, as if everyone is the same. But you simply needed more time to figure things out, and that is completely okay. The more your life goes on, the less important this life stage is, so don’t let this story define you or to make it your main story. You have so much to look forward to. Good luck and check back in sometime!",
            "Its not that girls find you ugly, you just seem to be lacking confidence. Try working out regularly and improving your discipline, maybe take up jujitsu classes and meet some guys willing to help you work on improving yourself. This will be a huge confidence booster, and you wont come off to other women as insecure and they will be drawn to the sense of leadership you will give off.",
            "I'm almost 30 and haven't finished my degree yet- I fully plan on getting my PhD though and teaching marine biology at a university. Things take time (and they're taking me even more time haha) but that's ok, we're all living different lives and in different chapter of our own books. I'm proud of you; you've made a bunch of improvement and your efforts show. Your English has even improved since the last post :) keep focusing on you- at the end of all this, you'll be most happy with what you put the most effort into and accomplished. Sometimes the biggest accomplishments, over a high paying job and tons of friends and romance, is beating your own demons. I know that's one of the things I'm most proud of myself for, and I met and connected with my husband because I had worked through my issues, not in spite of them. Keep it up!",
            "You need to knock down every pedestal you've ever put a person on. Laugh. Dude, women can make you laugh. You need to back off the misogynistic creep possessive vibe, and just find someone who likes you for you.",
            "Your story is very inspiring and a great example of how a mindset adjustment can help change your life in a positive way. Thank you for sharing your update.",
            "You have your whole life ahead of you! :) Glad you picked up all the pieces, kept a friend, and have a plan. Congrats!",
            "Nice work man. Life can be a real pain in the ass. It can push you around and make you feel like you have no control. But you always have control of you. Thanks for the update.",
            "Salut ! Je n’ai vu pas ton premier message mais je suis très content pour toi. Je pense que tu est incroyable ! Tu parle l’anglais plus mieux que je parle français et c’est impressionnant. bonne chance pour le reste de ta vie. vous avez beaucoup de temps pour bien faire les choses.",
            "Aw man, you still sound so hard on yourself, but you should be really proud, it's hard as hell to climb out of that pit so who cares if it wasn't instant, you're doing it, you're putting in the work and seeing rewards. Great job. :)",
            "C’est comme ça, la vie, des petites étapes à la fois. Nous avons les mêmes ans, et je me sens de le même façon souvent, mais les choses sont plus brillant de temps en temps. Petites étapes. On marche, et bonne chance!\n\nEt désolé pour mon pauvre français, j’essaie l’apprendre.",
            "[deleted]",
            "Just remember, every day, you become a new person. Who do you want to be tomorrow? Congratulations on the growth and the degree!! This is only the beginning, there's so much more on the horizon for you!",
            "I was chatting with some people much younger than me (I'm 34 and they were mostly between 17-22). They were talking about how they felt like failures and like they hadn't accomplished anything with their life. I told them to not worry about living up to other's standards, just do your best and try to enjoy the perks that come with being that young. I told them I didn't really start getting my shit together until I was about 30 and I'm still learning. I told them to focus on taking care of their body and not going into debt.",
            "Salut mec, bon courage et tout mon soutien pour ton avenir :)",
            "Félicitations pour ton BTS! Même si tu penses que c’est rien, c’est énorme!",
            "You seem like a cool guy and I hope you continue to do well:)",
            "Hey OP \nC'est dur de remonter la pente mais tu vas y arriver ! Bravo pour ton BTS, y'a pas de sot diplôme",
            "Bien joué gros! Continue comme ça\n\nLes relations sont incertaines mais tes études te serviront toute ta vie.\n\nEt t'as un très bon niveau d'anglais",
            "You should be proud of yourself, you took the first step which is always the hardest. Now you can decide exactly what you want to do or try different things until you find what makes you happy. Congratulations on getting your license! Life is sometimes hard, but you just have to keep plugging on (I hope you understand what that means, I don't know how to explain in French). I wish you luck and happiness in wherever your life takes you.",
            "Dude you just still attached to that woman you have to let her go completely. It's not whatever cause you'll never find someone . you compare to much",
            "Good job man. I’m proud of you for being able to turn stuff around.",
            "So happy for you!  you made a lot of changes in a really small amount of time.  This will be understandably a hard thing to wrap your brain around!  Give yourself time to just be you!",
            "If you’ve got yourself on your own side then you’re set for good things. It seems that it didn’t take you very long to achieve this. I’m so happy for you.",
            "Proud of you bro ❤️.\nIts the small steps that climbs mountains.\nYou've set yourself in the right direction. Keep going and keep pushing, it will be worth it.",
            "Everyone does things at their own pace. I didnt get my DL until I was 21. Sounds like you're doing great, good job. 👍",
            "Good for you, and godspeed friend.\n\nPs, your english is a lot better than you’re giving yourself credit for.",
            "I am so glad that you found something you enjoy! Many people can feel aimless and dejected when they do not see a future and do not have the passion for what they are studying or working. \n\nThis is completely normal and you need time to discover what suits you and makes you excited to get up every morning. I had many friends who went to college only to hate their courses or loved their courses but hated the job. \n\nThe only way to find out is to try! Try the courses and try the job. You never know what it is like until u are immersed in it. Plus certificates always open doors, even in unrelated fields because it shows the employers that you were disciplined, dedicated and committed to something long term. Something which employers definitely look for.\n\nI wish you all the best!!! I am so proud of you for the courage to take the road less travelled and chase your dreams!",
            "I'm proud of you - it's so human to feel broken when your life is aimless. It's incredible that you're pushing through and finding a path that makes you happy.",
            "Awesome, we’re proud of you!",
            "Make one day at time, one task at a time... Make it good.\nCelebrate your successes. Be proud when you do something you\"re proud of. It's OK even if its a small thing to others. It's a success for you.... Like turning up for a driving lesson or getting a diploma. That is a big deal. \nDon't be so hard on yourself.\nConfidence will bring you your next love.\nGood luck.\nYou're still so young. Enjoy these years. Dress well and look after your body. One day you'll k back and say 'look how handsome I was when I was in my 20's'.\nGood luck to you. Well done",
            "There’s a poster in this thread that’s been downvoted because he’s being unnecessarily harsh on your ex. \n\nBut what I think he is trying to suggest is that you look at your CURRENT friendship with your ex girlfriend. Are you really only friends... or do you expect / wish that she will one day come back to you?\n\nI was concerned that you mentioned she’s the only one that could make you laugh etc... this would be ok I think if you HAD dated other people since then, but it makes me worry that you’re still in love with her! And this might be preventing you from really moving on and finding someone new.",
            "Wow now THIS is an update, I'm happy you're in a better place right now. Remember what drove you to act in the first place to continue in that spirit. \n\nIl faut persévérer mon ami, j'ai eu une expérience similaire et c'est difficile d'accepter que ton pire ennemie c'est toi-même, apprends à t'aimer et à t'améliorer. En ce qui concerne les relations amoureuses, t'es jeune et tu as la vie devant toi, avance à ton rythme.\n\n Bonne continuation et surtout bonne chance",
            "Great english, just one tip:\n\n>nobody remember\n\n`nobody` is singular, so it should be `nobody remembers`.\n\n>the only women\n\nYou're referring to one person (singular), so it should be `woman`",
            "I’m glad you’re doing better, sweetness!!! Keep at it! I’m glad you’re well. We love you.\n\nWhat’s another goal you want to do?",
            "I just want to encourage you (: keep making small steps forward and before you know it, you will have a journey to look back on. Keep focusing on discovering what you love, let the people come last, they’ll end up falling into place too. I hope to see an update in a couple of years (:",
            "Awesome dude.\nWe need more of this\n\nNow learn how to use make and maintain spreadsheets and become more goal oriented with your own magnifying glass",
            "Mec, bravo, c'est très bien que t'as te changè\n\nDesoleè, ma français n'est pas la meilleure\n\nAlors, on y va!",
            "It’s wonderful to see how much progress you’ve made! I know sometimes it might not seem like it, despite all the work I’ve done on myself I still feel like a failure sometimes. But you dit it! \nYou can be proud! I had a dark period when I broke up with my boyfriend (first love) although I’m better now, my love life is still unfulfilling (to say the least).\nI’m from France as well so if you ever need someone to talk to, hmu!",
            "Congrats. The greatest journeys all start with a single step. And now, it seems you are well on your way in yours. You have every right to be proud of what you've accomplished.",
            "I know you might not care about my post but handsomeness is not what all woman are looking for. I would 1000% date a guy who makes me laughs rather than a hot guy who’s boring. I once dated a guy whom I felt was out of my league and I got bored by his cuteness because his personality was just meh. I lost interest pretty quickly.",
            "You're doing so well. Congratulations on your degree and licence. Chase your dreams and goals <3",
            "I didn't stumble onto my current career (IT) until mid 30s.  I spend all the time before that pursuing academics.  3 college/graduate degrees. All in a field I don't use.  I would have rather figured stuff out at early/mid 20s than mid 30s, but there you go.",
            "Good job.  Keep going!   We create our own reality.  Make yours worthy of a story.",
            "Hey OP, you are in the right path to finding stability. You need to stop being so hard on yourself, though.\n\n>\t(BTS in France if you care, it’s not much but it’s alright.)\n\nThat tells us that you don’t really believe in yourself and you’re simply taking baby steps because you feel like you can’t do anything meaningful. Well, sometimes baby steps is the way to better yourself as a whole. For me, I do not make giant leaps. I like to acclimate myself into the things I first get into before I take the next step. \n\n>\tMy ex-girlfriend ended up dating someone else richer and more handsome than me, but whatever.\n\nYou 2 are still very young. You 2 were (and still are) in your early 20s. You date a bunch of different people so that you find out who is right for you. It’s like shopping for a car. You test drive a bunch of different cars before you decide on the one that you are comfortable with, like the look, like the feel of the drive, etc. You date many people to see whose personality fits in with yours. Don’t let her dating someone “richer and more handsome” than you be a negative. \n\nIt absolutely sounds like you are on the right path to finding out what will make you live a good life. Keep going. It can be slow, but you are literally building your path to that happy life.",
            "You actually made all the hard moves so far, which was realizing you had a problem and focusing on yourself.  You can't be in a good relationship if you aren't happy with yourself.  Good luck and I hope you keep making progress.  Being single and working on your goals is one of the biggest things I miss.  It's obviously still possible now but I have to always consider another person too",
            "Congrats on getting into school and getting your driver's license! TOO MANY people refuse to look their issues and just get angry. \nAngry at the person who broke up with them, angry at the employer who fired them,  angry with teacher that failed them or parent that kicked them out, etc.\nYOU looked at what you could do to change the trajectory of your life and took the steps to better yourself!\nBtw, school is NEVER a mistake! Even if you have no interest in getting a degree or don't know what you want to do, school will always,  always benefit you as a human being!",
            "i’m not happy your girlfriend left you, but i am happy you made so many improvements to your life all on your own accord. that’s a big deal.",
            " \n\nHI\n\nI read tarot cards for a living and pulled some cards for you, I hope you don't mind.\n\n1: 10 of cups\n\n2: 5 of pentacles\n\n3: The Devil\n\nSo these cards are saying that you are emotionally and spiritually content on the path that you are on. However, due to a fear of losing it all or being financially broke (5 of coins) you are continuing to allow this pattern of not achieving in this world to run your life AKA The Devil. He is the card that comes to play when you have trouble letting go of old patterns or are restricting yourself. I just want to say as someone who doesn't even know you that you deserve all that this life has to offer. Money is just an energy, Success in this world is just an energy. You can draw it in if you choose to. Or you can also choose to deny it. Pay attention to the way that you feel towards money and success. Are you denying or short changing yourself every chance that you get or are you saying yes to the blessings at every opportunity? And \"please give me more\"!\n\nXOXO\n\nJaylene\n\n&#x200B;\n\nYou can find me on Facebook or Instagram for continued insight.\n\n My name is mystic.modern",
            "Well done!!! Keep pushing and doing things you enjoy. You have plenty of time for mrs right to come into your life. \nYou will realise then it all happens for a reason and that’s exactly we’re your meant to be.  Be proud of yourself! Don’t be hard on yourself because your doing awesome.",
            "Good going man. I'm proud of you.",
            "Hey, your English has improved like, A LOT. Congratulations on that, and also on getting your life back on track!",
            "I hate to be the one to tell you the bad news but you're going to have to cut your ex out of your life eventually. \n\n1.) For your self esteem. You're never going to truly move on until you do. \n\n2.) Whenever you try to move on, your new significant other *will not be OK* with your friendship with her.",
            "I don't remember you. I'm still happy for you. <3 You'll find someone, but in the meantime work on loving yourself and making yourself proud. If you take care of yourself I promise people will come to you. \n\nPS: your English is way better than my French",
            "Your ex expected you to be rich at 20!? I mean that's very rare that most people would be rich at that age.... so I wouldn't worry. Unless they are born into wealth then that's pretty standard to not be doing much at 20",
            "Wishing you all the luck! Stick with it! You'll find love again. Keep up with your schooling if that's what you're passionate about. You got this!",
            "Proud of you bro. \n\nBrush up on some game.",
            "I read your last post...\nYou weren’t in the wrong you sounded depressed (a natural struggle) and also didn’t know what you wanted to do (also natural and completely normal, in fact tons of people never really know what they want to do for their whole lives..) \n\nYour girlfriend sounded like a bad match...she helped you a little bit then got impatient (a person worth your time will be there no matter how long things take) not to mention she’s dating a richer guy...that also makes her sound like a gold digger...she probably wanted that “successful in command” type which will probably come back to bite her because those types rarely make good partners... \n\n\nRegardless you need to cut her out of your life because\n\n1. You need to fully move on from the past \n\nAnd \n\n2. She’s not worth your time...I mean she stopped supporting you and being their for you...she gave you an ultimatum instead of being patient and focusing on your many positives not to mention she was a hypocrite because I’m extremely sure she had her flaws but she instead was getting on you for yours...she was selfish and gave up on you..doesn’t sound like a good person to have around and definitely not a good person to be friends with.\n\n\nAlso you are attractive enough to find someone else..I mean you found your ex right? Then you’ll find someone else just give it time.\n\nRight now you need to cut your ex out of your life and focus on getting treatment for you metal health and practicing self compassion and love then eventually get back out in the dating field to find a better girl than your ex (she’s out there waiting on you..you just gotta go get her) \n\n\nI’ll say this again you weren’t “broken” and needed to fix yourself thinking like that is an unhealthy way of viewing mental health issues..you’re just struggling and need some help that’s all..your just being human.\n\n\nBest of luck man. 👌"
        ]
    }
]