[
    {
        "post_id": "h8d3uh",
        "author": "familyhrowaway",
        "title": "My(24m) mother(56f) is really pushing me to have a friendship with her boyfriend(30 something m) . UPDATE",
        "url": "https://www.reddit.com/r/relationships/comments/h8d3uh/my24m_mother56f_is_really_pushing_me_to_have_a/",
        "score": 3935,
        "num_comments": 103,
        "created_utc": 1592073827.0,
        "selftext": "&#x200B;\n\n[previous post](https://www.reddit.com/r/relationships/comments/9h08zg/my24m_mother56f_is_really_pushing_me_to_have_a/)\n\n&#x200B;\n\nWell i don't think anyone cares about it but im a verry private person irl and i needed to get this out of my chest.\n\nI visited my parents five days ago sense the lockdown got louser and basically i just let it all out.\n\nI was afraid how my dad would take finding out my mother was cheating, but it actually was much better than i expected. he got really sad and angry at her but he didin't get angry at me, actually we had a really good talk about our family before i left. My mom was just as bad as i thought, she cried, she yelled, things even got physical. Long story sort i told her i hated her and she is dead to me then my dad send her to stay in our vacation house.\n\nAll these were 4 days ago. Im back to my apparment now. My dad isn't sure if he will stay with her or not, we have been talking every day cause i want him to feel supported. My mother has been calling and texting but im done with her hope she gets the message soon. Honestly these past few days i have been feeling great like im 50 kilos lighter.\n\n&#x200B;\n\ntl;dr I told my dad my mother wascheating on him and told her she is dead to me.\n\n&#x200B;\n\nEDIT: Dad decided to take her back, im still not on speaking terms with her.",
        "permalink": "/r/relationships/comments/h8d3uh/my24m_mother56f_is_really_pushing_me_to_have_a/",
        "comments": [
            "That must’ve been so hard to keep secret. Know that none of what follows is your fault. She made her own choices, and your dad will make his own choices. No matter what happens, you aren’t to blame.",
            "I would take some time off by myself to clear off my head. Sorry to read what happened, and I hope you feel better soon.",
            "Cutting horrible people out of your life sure feels good doesn't it? I hope you encourage your dad to do it too so the whole family can be free of her. Either way, keep supporting him and way to go.",
            "I’m really sorry that your mother put you in the middle here. A similar thing happened to me a few years ago and it took years for me to trust in and respect my mother again. I hope that you are doing okay and you don’t blame yourself at all, telling your dad was the best thing you could have done.",
            "I missed the original but appreciated the update as I read it in two parts, like an extended post. It's always nice to follow up since there's no way for anyone to ask how things went and you'd be amazed how many people care at least a little!",
            "24F here. My mother kind of did the same thing to me a few years ago. I was 17 at the time, and she came forward to me about her affair because her boyfriend's wife called my father and told him about everything. It was pretty crazy, both my parents got me and my sister too involved in the whole situation. I just know that at some point she wanted me to meet the guy, and I actually did go meet him. It was pretty fucked up. \nYears went by, and therapy helped me process a lot of what happened. One of the explanations for my mother's behavior was she was seeking validation.\nI just want to let you know it's okay to feel like you need to get that off your chest, and there's probably a whole lot more to come. Remember they're adults in their own relationship, and my advice would be stay out of it as much as you can. This doesn't mean you shouldn't support your father or anything. Just try not to get too involved in the fights and small situations that will arise from this almost every day, for your own good.\nAnd find a friend or someone you can talk to about what you're feeling and how you're doing.\nI wish you the best.",
            "Good for you! That’s just what I would have done",
            "Sorry for your situation OP. Keep supporting your dad and you’ll get through this together.",
            "How did you hold it for an year!??",
            "Good for you! I’m so glad you said something.\nThi would have been very hard to deal with. Support your dad as much as you can. It’s a very hard thing to go through. I’m glad you’ve cut her off, she has done a terrible thing.",
            "I'm sorry, OP. Your mother should have never involved you in this. It should never have been your burden to bear. Due to how cloak and dagger it all was, she was likely not firing on all cylinders, but that's hardly an excuse to drag you into it. Even given that benefit of the doubt, physical assault (against you?) is totally unacceptable under any circumstances, not to mention illegal.\n\nRemember, none of this is on you. You were put in an impossible situation against your will. Do not let *anybody* tell you otherwise.",
            "Damn kinda jealous that your dad handled it so well. When my mom was cheating on my dad, they decided to just get a divorce and my mom went insane, and my dad just got stressed and distant, and our family broke apart. My dad kept telling me I was supposed to have a relationship with her because \"she's my mom\" even though she was literally abusing us and being awful. Idk why some people stick their heads in the sand like that. I can't do it. But I'm glad it worked out alright for you.",
            "I had to go through a similar situation during highschool. I figured out my dad was cheating on my mother (married for 30 years) when he left his phone unlocked and I snooped bc of suspicions I had. I kept the secret for 8 months because I didn’t know what to do because my mother has no work history to leave him but when I told my brother, a few months later when the abuse (by my father) got really bad we confronted him. \nIt’s been 3 years since, and let me tell you something. I didn’t know that there were more times of cheating that my mother was *aware of.* A lot of times, it’s not the only one, and it’s really hard to trust the person ever again. From what I hear, it seems your mother hasn’t been the best to you guys in many ways, and things like that are very hard to change. Say you make up with her, she’s going to insist you have a relationship with this new man and you might never feel okay with it. Your father may end up staying with her, but she’s still with this person right? He’s not going to be able to trust, and that’s a whole lot worse than going different ways. \nBasically, she has been the source of your turmoil, and it’s very fair for you to part ways with her. Keep in mind that if he stays, you might be parting ways with him too. If he doesn’t, really be there to support him because the loneliness after the separation is what really makes it hard on your parent. \nSorry for the ramble, but I sincerely hope things turn out for the best. Love and support your father through this, and do encourage him against staying with her but respect his decision if he does. I hope you too find peace of mind, friend.",
            "Wow props to you to be able to keep it in for so long.",
            "Sounds like a heavy situation, but I'm glad its seemed to work out, both you and your dad deserve someone who actually knows the value of family and I'm glad your there supporting your father, I hope for the best for your father and keep being there for him!",
            "Good for you for telling your father. I’m so sorry you were put in that position though.",
            "Sorry for the betrayal, your mom betrayed son & dad.",
            "Stay strong brother, you did the right thing. I would have done exactly the same.",
            "My last convo with my dad was about like your convo. It sucked because he ended up dying. He stole from me, I was pretty livid. I don’t carry guilt as I know he knows I loved him and had every right to get mad, but it still sucks. Just things to consider going forward. I was 20.. it’ll have been 14 years this winter.",
            "You did a good thing. Knowing the truth is always better than not.",
            "I saw the responses to this same post on r/adultery (not sure why it was recommended, I don’t follow it) but you can’t expect liars and cheaters to be upset with your mom along with you. They’re always going to validate and defend their own “lifestyle” of ruining others’ lives.",
            "So sorry that you had to go through this. It honestly sounds crazy that your mum would do that to you.   \n\n\nSince she didn't know that you knew she was cheating, that could be a really risky for her to be found out, so maybe she wanted you to know somehow ? And was maybe hoping you would somehow get along with him and be okay with everything. If that's the case, she is extremely deluded.   \n\n\nAnyway great job supporting your dad, you will come out of this better.",
            "Wow! You are super brave and did a really good job, for what it’s worth I’m proud of you and think you’re great.",
            "Dang a whole year you had to keep that secret. None of this is your fault and your mom is a pos. Please keep being a support system to your dad. Thank you for telling him. Cheaters endanger their partners health bc you have no clue if they’re being safe. Thank you for telling your dad and helping him emotionally and physically",
            "It was selfish and wrong of yr mom to involve you and to make u an accomplice. So many boundaries crossed.",
            "You should support and encourage your dad to divorce her.   \n\nHe will never find happiness until she's gone.",
            "Your dad is great dude.\n\nKeep supporting him and cut your mother out compeletly,try not to get involved in your dad's decision to keep her or dump her.\n\nJust keep in mind that your dad is going through a very very rough time right now,your top priority is focusing on making your dad feel better.",
            "As someone who's been in a very similar position to you, good.\nCut the egg donor out of your life, you don't need to love someone who you know is trash inside regardless of their relationship to you.\nI'm still angry.\n\nI hope that you can recover better than I did.",
            "Good job! It must have taken a lot of courage but it was the right thing to do. I’m sure your dad is grateful, even if it hurts.",
            "For your mum to first make you keep that secret, then try make you have a relationship with him is such a low blow and so disrespectful to you and to your dad as a person. \nAs much as I usually feel people should stay out of others relationships it wasn’t fair to your dad that she was basically flaunting her affair in front of him by making it open like that and he deserves better. Plus she only has herself to blame, not you, and you’re allowed to hate her - you don’t get to pick family but you have your own feelings you must consider. \nIt’s up to your dad if he stays or leaves her but I’m glad he has your support, you seem like a wonderful child to him and he’s lucky to have you!",
            "Parents should never try to make ther children their ‘friend’, their therapists,... even worse if its about the relationship between the parents\n\nEvery parent knows that is damaging the child, no matter the age of the child. \n\nIts something else if one parent needs help to move. like flee an abuser (no matter if its the mother or the father, both genders can be abusers), but even then, help to pack and transport the things is not the same as being the ‘sounding board’ of the parent\n\nI’d look into getting some hours of therapy, for finding the best coping mechanisms, and also to train possible answers/reactions for the future, might be helpful in general after all that.",
            "I went through this with my parents too, it’s actually uncanny how similar your situation is to mine. Your mother was probably pushing for you to hang out with him to make her feel better and hoping you will justify what’s she’s done since he’s so great and hoping you see how in love they are or whatever. I can almost garuntee that her next move will be trying to convince you that her marriage was pure misery and that things have been bad for a long time or that your dad wasn’t good to her. Don’t fall for that shit, it’s total garbage. If she truly were miserable this whole time - then why didn’t she just get a divorce? Don’t let her reel you in with the victim shit. I think it’s reasonable not to talk to her, hopefully things will level out and you can maybe salvage this relationship but the ball is in her court. Remember that although you are an adult, you are still the child in this relationship. My mom eventually started acting like a teenager and would get upset if anyone said a word about how little time she was with her kids post separation and blamed it on me. I didn’t reach out, I didn’t do enough etc etc etc she is the parent, and she can either act like one or fuck off",
            "Id personaly advise Ur dad to leave her, first of all most cheaters dont change they fall back into their awfull past, second of all the way Ur mom reacted is a sign of how bad of a person she is and third of all, if he stayed yall can never be a normal family again, everything u would visit u would be hating Ur mom and rightfully so which couldd lead to fights within the family and to mabye even a bad relationship with your dad.",
            "You held onto this for other a year? Thats WILD",
            "OP, that sucks a lot and I’m so sorry you went through that. As someone who’s been through a similar situation with my mother (verbally abusing me, tearing t he family apart and blaming me, pushing me to have a relationship with the man she cheated with) a few years ago, my biggest advice to you is to not burn bridges with her. She’s your mom, and without her in your life it starts to feel empty and all-consuming. It would be helpful to future you to take a step back now and outline exactly why you’re upset with her, being specific as possible, then ask for some space until you’ve worked through your end a little (even if you never plan on talking to her again now). I developed some awful habits while coping with not talking to my mom and I don’t want the same for you. If you can communicate with her that you want a break now but will want to come back later, it helps act defensively against her saying you’re a petulant child (my mother still holds this against me, even when we’re on good terms). This is awful and you don’t deserve any of this and you did the right thing, but no matter how angry you are with your mom try not to end your relationship for good. You never know if you might want to go back. Sending good thoughts your way!",
            "I am glad you are there for your dad. Hope the both of you can support each other through this nightmare.",
            "I was in similar situation just with my dad and his girlfriend, I was 16, then my parents divorced when I was 19 and now at 26 I can see my mum finally living her full life again. Just chiming in to say that you’re not alone in this and people care, so many of us were where you’re now. Try to be nice to yourself now, you’re going through a hard time. And good job! I think you handled it really well my man",
            "Keeping that must've been so difficult for you and we'll done for getting it out there. I'm glad that your relationship with your dad is still strong and tbh good on you for not befriending your mother's boyfriend!",
            "Yeah, that's weird. Be cordial with him, but not friends.....",
            "Your dad deserves better! I know it’s hard but he can still meet someone else and be happy.\nWas their marriage ok before this? Was she a good parent and spouse before you found out?\nHer reaction to her doing something wrong makes me think she sucks!",
            "You have every right to be angry. If I had any advice, it would be that the only way you’ll ever find healing in this situation, will be to forgive her at some point in the future. On your time of course.",
            "You’re a good dude mate.  Good-looking our for your pops.  Your mom has a lot of repenting to do.  Screw her for doing this to you and your father.  If I were you I’d build up your dad’s confidence as much as possible.  He’ll need it should shit get nasty with mommy dearest or when he needs to find a new woman.  Also too, remember that if someone has cheated once, they are prone to do it again.  Your mom would likely be more crafty about it the second time.  If your dad can afford a vacation home, he’s probably decently well off, and your mom may be a gold-digging sleaze who’s merely using him for his assets while getting her poontang on the side.  At this point, assume the worst until proven otherwise.",
            "You are so brave!! Proud of you for doing what's right!",
            "It’s good you told him.   They were making a fool of him.",
            "I can’t believe your mum wanted you to be friends with someone she was cheating with. People are ... wow 🤯 I’m glad you’re feeling better and I hope you and your dad work through this . Good luck",
            "I remember reading your post. I’m glad things are sorting out as best they can in this situation and that you no longer need to shoulder the burden. \nYou should treat yourself to something special just for you.",
            "I don’t really believe that it’s a relief to have your mother be “dead to you.”\n\nIt’s your mother and it’s far more complicated than this.",
            "There may be other reasons to completely cut off your mom. Lots of people cheat and relationships end. Of course that doesn't make it ok, but it's an unfortunate reality. \n\nNow if you have other reasons to cut off your mother then please, by all means do so. What she did to you and your father was hideous. But I don't think that alone rises to the level of cutting her off. Just to be clear, I mean permanently cut her off, which is how I read your post. As in, when she dies and you might show up to the funeral, maybe.\n\nI don't think there's anything wrong wrong with temporarily cutting her off why your parents figure out their next steps. I mean, she tried to throw you in the middle of an affair and make you complicit. That's not acceptable. But once the divorce (or once your parents decide to work it out) is finalized, and your parents have established their new status quo and are starting to settle in, then I think that you should continue some level of contact with your mom. It doesn't need to be a lot necessarily, but completely cutting off a parent is a big step that's really only warranted in extreme situations. \n\nIf this is an extreme situation following a lifetime of abuse, then by all means do what you have to do."
        ]
    },
    {
        "post_id": "5gx506",
        "author": "throwaway78484947585",
        "title": "[Update] My brother [27m] does some really creepy stuff and I'm [21f] done with him.",
        "url": "https://www.reddit.com/r/relationships/comments/5gx506/update_my_brother_27m_does_some_really_creepy/",
        "score": 3935,
        "num_comments": 53,
        "created_utc": 1481075986.0,
        "selftext": "Original post: https://www.reddit.com/r/relationships/comments/5fz0bc/my_brother_27m_does_some_really_creepy_stuff_and/\n\nI talked to my parents and told them I was tired of my brother's behavior and that they should do something, otherwise I wouldn't be going home anymore. They said I was being too \"extreme\" and that he would stop eventually, but that shit has been going on since we were kids and I knew he wasn't going to stop, so I gave them an ultimatum. They would talk to my brother and my brother would stop or the 3 of them could have a nice life.\n\n\nMy parents talked to him, after all. My brother refused to get evaluated at first... he was really upset. He went over to my dorm and tried to choke me. He screamed at me, then he tried to choke me, then he realized what he was doing and started crying and apologizing. Someone called the cops because my brother tried to kill himself afterwards.\n\n\nAnyway, everything is ok now. I mean, not everything. He was diagnosed with schizophrenia. He didn't get a full-written report because it's been a week and it takes time, but that was the feedback and diagnosis. I'm going to be ok.\nI just wanna say thank you for the advice and stuff, you know. I appreciate it (a lot). <3\n\n\ntl;dr: my brother ended up getting arrested for trying to choke me then kill himself then he got evaluated and now he's going to be ok, hopefully.\n",
        "permalink": "/r/relationships/comments/5gx506/update_my_brother_27m_does_some_really_creepy/",
        "comments": [
            "Wow OP, you're a hero. You're the only one in your family strong enough to put your foot down about the reality of this situation and as a result your brother can now get the help he needs.\n\nWell done you :)",
            "OP, I hope your brother gets professional treatment. And I hope YOU get some support as well. Get support from your school- go to school counselor, security, women's center, anything. Make sure they are aware of the situation.  Even if your brother gets professional support, just remember you are not obligated to have him or your parents in your life. A diagnosis is only the first step. It doesn't mean that things will change unless your brother and your parents are willing to work very hard to change them. ",
            "What is wrong with your parents, how did it go past them 27 years...\n\n\nHope everything is fine now.",
            "Thanks for the update, but....\n\n*Please* continue to be very cautious. Just because he's been diagnosed doesn't mean he might not still be a threat to you. \n\nThis is true, even if you think he's being treated. How can you know, two Christmases from now, that he hasn't gone off his meds? \n\nI don't know that I'd ever feel safe enough to let my guard down around him. ",
            "What do your parents have to say about it now?",
            "He is fixated on you. You may not ever be safe around him, whether he gets treatment or not. \n\nThe only other person I knew with a brother like this had a restraining order against him in her 50's and very carefully guarded her personal information, making sure he could not find out where she lived or worked.\n\nBe safe.",
            "1. Holy shit that sounds scary, I'm glad you're okay. \n\n2. Well done. Seriously, well fucking done. I am from a head in the sand family myself, and I know it is no easy feat to stand up and make them take the actions that need to be taken. You handled this great. ",
            "Wow. Can't believe it took the damn daughter to put her foot down in order to get the guy some help and he turns out to have a serious medical condition. Your parents dropped the ball. ",
            "Dear god... please stay safe",
            "as someone whose client base consists of >90% schizophrenics, my sincerest thoughts go out to you. I hope you AND your brother can find peace!",
            "I hope your brother gets the help he needs. But remember, always put your health and safety first! ",
            "OP I'm so sorry for you. My brother was always a little off as a kid and was diagnosed with schizophrenia 4 years ago when he was 21. I don't know if your experience is the same at all, given that you may have always felt unnerved by him, but I know that facing that diagnosis can feel like the person you once knew has actually died. \n\nMy deepest sympathies and well wishes for your future.",
            "Did you serve your parents a helping of \"I-told-you-so\" 's?",
            "He tried to kill you. Choking is attempted murder. I'd get an order of protection from the police ",
            "I wish I had made a similar ultimatum to my parents regarding my brother. I didn't, and he never really got better.",
            "Thank you all for your lovely comments <3",
            "Thank goodness you're okay. I hope for the best for you and your brother too.",
            "I'm really sorry this happened to you. Just know that whatever is going on with your brother is not your fault and sometimes it's really hard for parents to recognize when something fucked up is happening with their kid. Denial is strong. I hope they will be supportive of you in the future. If not, man, you're in college? Utilize whatever resources there that you can. If there are counseling services, just go at least a few times and talk out whatever you want to, if you want to.",
            "I'm so sorry you're going through all of this, and especially so that something so frightening had to happen for this to be taken seriously.\n\nTake some time to read up about to positive and negative symptoms of schizophrenia.  His past behaviour won't seem as 'creepy' but obviously is still worrying.  Maybe have a discussion with your parents about how you're going to approach this as a family, and support him in his continued treatment (of course, you should feel free to opt out if you don't feel safe, but I feel like counselling with family will be helpful and make it clear to them how unsafe you were feeling, and how it is vitally important that they trust your judgement).\n\nStatistically, your brother is much more a danger to himself than to you.  The idea of a deranged schizophrenic killer is at odds with the reality--many people live with schizophrenia and, medicated, will not experience violent episodes.  However, because he may have had paranoid or persecuted thoughts around you in the past, you may wish to be extra careful and get a personal alarm, pepper spray, whatever.\n\nAgain, I'm so sorry.  It's very difficult for any family to go through.  I really hope you are able to access support for yourself, as well as your family doing so to support your brother (medication compliance cannot be stressed enough).",
            "Jeez.  Thank God he was diagnosed.  Hope he gets better,  schzio is no joke.  I feel like he's probably sincerely not a bad guy,  since he had a moment of clarity and realized his mistake.  Still be cautious around him.  Hopefully the meds will help.   ",
            "I know people are going to say this is ultimately good for you, but you know you lost your parents, right? They chose your brother, and your reward for standing up to the abuse you've suffered your whole life is your brother trying to kill you. \n\nThat's what your parents chose. \n\nPlease don't think you got them back. The second your brother gets out they're going to try to get you to forgive him and be around him again, and do you want that? They didn't choose you before. They won't now either."
        ]
    },
    {
        "post_id": "a6g9dk",
        "author": "pizza12355uqu",
        "title": "My (29F) step daughter (18F) wants to give the present I bought my other step daughter (15F) and take all the credit.",
        "url": "https://www.reddit.com/r/relationships/comments/a6g9dk/my_29f_step_daughter_18f_wants_to_give_the/",
        "score": 3938,
        "num_comments": 636,
        "created_utc": 1544889743.0,
        "selftext": "Alright so I married my husband (37M) about 6 months ago. He had an 18 year old when he was 19 and was married to her mother for about 15 years.\n\nThey got divorced and we get his kids (15F, and 8M) for 2 weeks and then their mother gets them for 2 weeks. The 18 year old (let's call her Brittany) lives with her (45M) boyfriend. I've had a really great relationship with all 3 kids. Once brittany started dating her current boyfriend who is 45, the relationship between her and my husband really started going sour. I dont support her decision but her and I remained close and I did my best not to isolate her.\n\nAfter Brittany and I started growing closer she started taking more and more advantage of me and my kindness. Her boyfriend doesnt make much money and she doesnt have a job. Her sisters birthday is tomorrow and a couple of weeks ago she mentioned a nice coat her sister wanted and asked me if I would just go look with her.\n\nWe didnt have any luck at our local mall so I spent some time finding a nice coat on Amazon and asked Brittany if her sister would like it, she said yes and so I ordered it. \n\nWe dont get her sister on her actual birthday, but we are celebrating it today (1 day early). I had told brittany that the coat could be from the both of us, since I found it and paid for it but she did tell me the style/color her sister wanted.\n\nThen I get a text from Brittany saying that No, she wants to give it to her on her actual birthday and tell her mother she paid for it to prove that her and her boyfriend are successful. I told her I wasnt comfortable with that and I'm sorry but it's a group gift from us and for us, her birthday is today since she goes back to her mother's late tonight. I asked her to share her feelings and she said she is really angry at me and thinks I'm being selfish. I dont know how to respond to her. My husband currently has pneumonia which is why I'm turning to reddit and not him since he is really sick right now.\n\nI am new to being a step mom, and I'm really trying here. How do I respond to this? \n\nTldr: bought my 15F step daughter a present. My other step daughter wants to give it to her after she leaves our house and say she bought it.\n\nUPDATE: thank you so much for all of the advice! I truly am so grateful for all of it. Well last night my husband stayed home while I took my 15F stepdaughter and her little brother to dinner at her favorite restaraunt. I invited Brittany and she came with the 45M boyfriend. My 15F step daughter pulled me aside and asked if I invited him, I said no and she told me she really doesnt like him and if in the future we can ask him to not come. I told her I would have a conversation with her dad and her sister. After dinner we all came back to mine and my husbands home. It was pretty awkward, and when she opened the coat Brittany made sure to let her sister know that she picked it out and it was all her idea. I mostly just ignored it and enjoyed the birthday party. Later that night I went to drop off the kids with their mom. After the kids were inside their mom instantly said \"We need to have a conversation about Brittany's behavior.\" And I had a great conversation with their mother about everything, since her behavior is affecting both households and the kids. I talked to my husband and he is going to talk to Brittany, and we also talked about my role in her life and read him lots of the comments from all of you. Yes, the boyfriend thing is terrible, and my husband agrees that he is a predator. I know some comments mentioned the divorce, but overall, the two daughters have expressed the marriage was bad. Their mother had a long affair and it was all just a mess, I appreciate the comments talking about divorce and parenting, but we have all attended classes (me, husband, and ex wife) on co-parenting and we all try really hard to make these kids happy and have a healthy life. I know it's a tough road to navigate, but I really appreciate brutal honesty, and advice. ",
        "permalink": "/r/relationships/comments/a6g9dk/my_29f_step_daughter_18f_wants_to_give_the/",
        "comments": [
            "She’s asking you to lie and misrepresent. That’s all you need to explain to her. Firmly and gently say “I don’t lie”. And don’t be or say sorry to her over this. \n\nAs a parental adult figure in her life, you will help her in the long run, by not caving into to her manipulative demands. She is still mentally a child (judging from what you wrote) and sounds like she needs firm boundaries and correction. \n\nAs a step parent I know it’s a delicate act to win the kids over yet still be an authoritative figure. But she needs this. Good luck ",
            "[removed]",
            "\"I am sorry you feel that way. I hope you join us tonight to give the gift. I'm sure your sister will love it! You have great taste.\"\n\nDon't be surprised if she already told her sister some lie about where the gift came from.",
            ">she wants to give it to her on her actual birthday and tell her mother  she paid for it to prove that her and her boyfriend are successful.\n\nTell her you can't support her lying to her mother, not only because lying is not OK, but also because it would make you complicit in the deception.\n\nIf anyone is selfish here, it's Brittany. I understand that you want to have a good relationship with Brittany, but letting her take advantage of your kindness is not a way to accomplish that.\n\nI'd perhaps ask her carefully, when she has cooled down somewhat, why she thinks that letting her mother believe that she paid for the coat would prove that \"her and her boyfriend are successful\".\n\nPS: It's possible Brittany feels the need to \"defend\" her relationship not only because her parents are critical of it, but precisely *because* she's not completely happy in it; to smother her own doubts. Maybe hint that she can talk to you in confidence if she has any problems which she can't talk with her parents about.",
            "I cant get past the bf older than her dad. Yuck. That guy is a creep and she's a dummy. \n\nThat said, no, it's a group gift and that is that. Why should you have to scramble to find something else to give this girl? It is in no way your responsibility to make sure this daughter appears responsible in her mom's eyes (the bf and lack of job already prove she isn't. One gift wont change that.) I do agree with the other poster for giving her credit for picking out the gift. How to deal with her anger? Maybe say you're sorry you cant do more and end the discussion. She's 18, her brain isn't fully formed yet, she will get over it in time... or she won't, but you cant change it. If shes that type of person she would just find something else to mad at you for.\n\nFinally, try to make sure she's provided with birth control. This BF is bad news, the last thing they need is a pregnancy. ",
            "Ask her in a subtle way to repeat what she asked you to do. Possibly give her an anecdotal story and swap sides. Don't let her walk over you. I fully understand the needing to be on her good side vs being a good step mom thing, but you're setting herself up for more failure later in life.",
            "Please don't waver on this point.  If she's angry, she's angry.  So what? She'll get over it.  Do *not* let her guilt or pressure you into helping her deceive her mother. ",
            ">prove that her and her boyfriend are successf\n\nBut...they're not. Tell her that. Tell her you are not going to help her \"prove\" something that is not true.",
            "[deleted]",
            "OP, how is your relationship with their mom? This sounds like something that needs a sit down discussion with you, her, and your husband (or husband soon as he’s sick, but kept in the loop for now) to tackle what’s going on with her from all sides as a team. \n\nIt’s important oldest daughter feels she can trust you, yes. But it’s also important her mom knows what her eldest is struggling with and what she’s trying to do with this guy (get pregnant). Yes, she’s 18 and legally an adult. But I know I sure as hell needed guidance at 18 still. She still is a kid, trying to project this image of being an adult. It would honestly be ideal if both her parents alone too pulled her aside and bluntly told her how difficult it was having a kid at the age they did while also affirming how much they love her. ",
            "I'm 21M, so it's not quuuite the same, but...\n\nI remember when I was 18. Thought I was a grown-up, and that I knew how to adult. I didn't - I still, honestly, don't know jack****, but I'm learning.\n\nShe's 18. Explain to her how she's wrong; since you bought it, you get to say it's also from you. If she wants to appear successful in front of her mother, she can damn well act her age and try to get a job; if she can't, the she there's not much more to it.\n\nShould she throw a temper tantrum, point out how childish she is; I don't know her, of course, but I certainly hated being told that 3 years ago",
            "“You’re allowed to be angry, but I won’t lie for you. If you want to appear successful, work your butt off like everyone and actually be successful. When you’re don’t being throwing your tantrum, I’ll still be here for you.”",
            "[removed]",
            "“No.” Is a complete sentence. \n\nIt is not your job to make her look good to anyone when she’s done nothing to earn it. She’s an adult, she can get a job. \n\nI’m HELLA creeped out by the fact that her bf is 45, that’s disgusting. ",
            "[removed]",
            "Your stepdaughter seems to be controlling all the adults in her life. She does what she wants and expects to be catered to, no matter how many bounderies she stomps, because she knows: at the end of the day, the adults will do anything to keep her out of harm and to maintain open communication lines. She has all of you under control and she knows it. If you guys want to help her, you (both parents and their partners) need to coordinate your efforts and agree on bounderies. Seek the counsel of a therapist, if you dont know where to start. But for now: Don't JADE - Justifying, Arguing, Defending or Explaining. Remember, NO is a complete sentence.",
            "Yikes!  you 100% did the right thing.  Let her be angry.  Completely unrelated, I'd consider offering them $1000 a year for every year they *don't* get pregnant. ",
            "Maybe you should stop telling yourself that you're her step parent. I don't mean to belittle the title you have with her but just want to point out that she's not living under your roof, you don't have a parental relationship with her. I think being open to guiding her and communicating with her is great but once she expects you to do something you're not comfortable with, she's risking the relationship she has with you and not the other way around for you not yielding.\n\nYou can do everything right and she can still find a way to be upset. I guess you're going to have to let her be her and you worry about the little ones that you're actually parenting and setting an example for.",
            "I think it perfectly reasonable for you to say it's from both of you. She is eighteen and should get a job and pay for it with her own money, or at the very least have asked you beforehand. You do her no favors by helping her construct her little fantasy image that her boyfriend isn't a loser creep. Stand your ground, theres no reason to make it emotional she can either be happy for her sister and suck it up or put but that's not on you! ",
            "You were generous enough to offer the gift as a joint gift. She rudely said no because she wants to deceive her mom. This isn’t acceptable.\n\nI know you want to be friendly with her but you are also a parental figure, not her friend. She is obviously trying to prove that her life choices are working out when they aren’t and she’s manipulating you into helping her. Add her name to the card when you gift it to her sister and let her be pissed at you.",
            "If she wants to be “adult” enough to live with a 45 year old, she should also have to be adult enough to accept that you can’t help keep that charade up in front of her mom.",
            "Even with only the little information provided, it seems like her selfish reaction is part of a much larger problem. This girl could use some therapy. ",
            "An 18 year old girl with a 45 year old man screams daddy issues and naivety. If that were my daughter or sister, Mr. 45 Year Old would be getting a knock on the door and a warning to stay the fuck away from the little girl. \n\nHe’s using her for sex, and he’s a fuckin creep. That needs to be severed immediately, IMO. ",
            "The 18 year old is living with a 45 year old boyfriend. I can't even read about anything else about this post.... that's where I'd start with whatever other bs life drama you say is going down.",
            "If she wants to take credit and prove to her mom she is successful, then she needs to pay for it. ",
            "Tell her to fuck up and get her own coat if she wants to prove shes successful.",
            "Just from reading this, I feel sorry for for you, but you need to tell her no and to get a job. And if you don't do that then she will take more advantage from you than ever. ",
            "I'm half-sure I either work with your step daughter or work with someone exactly like her. Time to make her grow up.",
            "There could have been a whole post about how you are only 11 years older than your step daughter and how her boyfriend is older than her dad.",
            "I day let her be pissed. You’re not responsible for her emotions, especially at the level she has made SEVERAL purposeful decisions to be unsuccessful. \n\nLike, even the 15 year old probably knows that dropping out of school 3 times and trying to get knocked up by a 45 y/o dishwasher with a criminal record is not a great plan. \n\n“We can do a joint present or not. It’s not my business to help you convince your mom of anything, sorry.”\n\nLet her throw her tantrum and maybe just maybe if she has to deal with reality she may have a critical think about her current trajectory. But even if she doesn’t (which is likelier), oh well. You did a nice thing offering the joint present and she should know it and be grateful. ",
            "Her life is likely to get much, much worse before she reaches rock bottom and is willing to make changes. Your ongoing struggle is going to be how to be supportive and not enabling. It's going to be really hard, but she needs to see and feel the consequences of her choices in order to make new ones. You're going to be tempted to rescue her from this but only she can rescue herself when she is ready.  Maintain a relationship, but be alert to the times her requests are tied to emotional manipulation and not honest efforts.  It's going to be really hard and even harder when your babies are born and you're exhausted from the sudden life changes. You (and your husband) would benefit from some counseling efforts to establish boundaries and reasonable expectations and cement your relationship. She needs to see you two as being on the same team or else you are going to be continually singled out as an easy target. Take care of yourself, your husband, your other step kids and your babies.  She is screaming that she can take care of herself, so let her do it (or not). ",
            "She's testing boundaries. Stick to your guns. She is being selfish.",
            "Its more important that she has integrity than fake success.",
            "To let her claim it was her and her much older bf’s gift alone to your SD(15) is to do her a disservice. It will set a precedent for future interactions; you are a pushover and with a little prodding and a few tears, another’s way can be had.\n\nThere is a reason people can’t rent cars until they are 25. An adult age does not define brain maturity or any real sense of how the world works except through the lens they have been living.\n\nI would do a little more “research” on the 45 year old man who has very little money, with an interest in barely legal girls. Young can be easily manipulated by a more nuanced lover. But then again, even if you found out terrible things about him, it’s not like anyone else’s opinion matters right now to her. I am wondering if there is more to her seeming “daddy issues” but that is not really the topic of convo here.\n\nBest of luck OP",
            "No, he likely is a hebephile, likely had to spend a lot of time grooming OP's step daughter. He's scum and you know it.",
            ">After Brittany and I started growing closer she started taking more and more advantage of me and my kindness. Her boyfriend doesnt make much money and she doesnt have a job.\n\nPut an end to that right now...\n\nShe can go and join the rest of the working world and support her deadbeat bf if that's what she chooses. ",
            "Definitely, definitely DEFINITELY do not go along with her request. Let her be as angry as she wants to be, if that means she stops talking you, even that is OK. Your reply to her is \"I am not being selfish Brittany, I just will not be complicit in lying to your mother\".\n\nHer relationship with her FORTY FIVE year old boyfriend is deeply concerning and not something you should even appear to support or condone with a 1000 foot pole. If it all goes bad (which it almost certainly will), if it gets out that you even looked like you supported it, her mother and possibly your husband will throw some blame on you for it.\n\nWhen her dad recovers, consider having some serious talks with him about getting Brittany individual therapy. A relationship between an 18 yr old and a 45yr old has like a 1% chance of not being abusive. The reasons why a 45 year old would date an 18 year old are all very bad (for the 18 year old!) and the reasons an 18 year old would date a 45 year old are also all bad (for the 18 year old, they all play in favour of the 45 year old). While technically she is an adult, in many ways she is still a child. And just because a kid hits adulthood doesn't mean their need for guidance ends. You and her dad obviously cannot forbid her to date this guy (and that would be a bad tactic to take as well), but you could be gently guiding her to see how awful that is and therapy support to help her work through her daddy issues in a healthy, safe way. \n\nYou can find resources online to help get your husband to understand why a huge age gap like this is dangerous for his daughter, and the profound risks she's running.\n\nGood luck, what a nasty situation :( ",
            "Despite what 18 year olds think, they are basically still children, and prone to the outbursts, egocentrism, and immaturity that children display. You can tel her no and continue to show love and respect in other ways, and she’ll get over it. You can even offer to take her to get another gift for her sister that she can give to her with her mother if you want. ",
            "The fact a 45 year old targeted an 18 year old is disturbing and predatory. I mean, yeah there's nothing legally you can do, but it's still bad. \n\n\nAnyways, stick to your guns, the gift can be from you, or the both of you. And if she doesn't like it, too bad. ",
            "I know it wasn’t the point of the post, but god does this kid need some therapy. My heart aches at how she’s gonna look back at her life in 5 or 10 years if she continues down this path. I hope she has a good enough relationship with her parents that they can be there for her to fall back on for emotional support. \n\nAs far as your predicament, stuck to your guns. You don’t have to be confrontational, just reiterate that it was a joint present and that you enjoyed finding that present with her. ",
            "You paid for it, so you decide. You've said no, so she can go pound sand.\n\nIf they do end up having a kid, don't offer to help. You know she'll take you for all you're worth for free babysitting at a moment's notice, as well as money 'for the baby'. \n\nYou want to do something for the baby, set up a college trust fund that she can't touch (and the kid can't touch til it's 18+) and put money into that.",
            "Look at what you said in isolation. This girl is not your friend. \n\nBut specifically, what is she doing with the birthday present? She didn't get her sister anything. She assumed that you would just hand it over and not say anything, so it becomes you that didn't get her stepdaughter anything. She intended to lie about it to her family, and when you declined she lied about you.\n\nIt's probably time for you to stop thinking of her as a daughter or friend and start looking at establishing boundaries, or that baby she's hoping to use as a meal ticket will turn into a weapon against you. ",
            ">I am new to being a step ***mom***\n\nThis is a tricky thing for parents, but even though you are a \"step\", you are still a parent.  We want to be friends with our kids, but we are their parents first.  It's ok to assert yourself as a parent even if it hurts her feelings.  She's certainly never going to respect you if she knows you'll let her walk all over you because you just want her to like you.\n\nYour other comments suggest you have much bigger problems than this birthday gift, though.  She's definitely playing the parents against each other and it doesn't seem like she's facing any consequences for this disaster of a road she's headed down.  I hope you and your husband realize that you are going to end up raising a baby with the hurdle of two (probably just a young, single mom) selfish, entitled parents who will still want to do whatever they want and expect you to support it and make it happen for them. You're going to have 3 babies crying to be fed at night, 3 in diapers, 3 toddlers to chase.  I mean, this is a *real* shit show here.  Is she going to continue to be allowed to just live whatever life she wants, financially supported by her 2 pairs of parents?  Or is she going to just run back and forth to the other when she can't have her way with one?  \n\nThis is a real tough position for you.  As the step, you only have so much authority you can get away with on the big things.  But as far as the two of you and your personal relationship, you have the upper hand here as the adult and one of the providers.  \n\n&#x200B;",
            "That’s very manipulative of her. Tell her no. If she wants to appear successful, she needs to start making better choices. ",
            "Holy Jerry Springer batman!!\nAny 45 year old man who dates a girl younger than his daughter is a straight up piece of work. As far as the coat situation goes tell her to get her own damn gift now that she wants to involve you  in such a blatent bullshittery. Let her prove just how 'successful' they really are.",
            "*\"Brittany, it would be disingenuous to lie about how well you are doing to your mother. I can't respect that decision and I personally won't allow it. I've tried being kind because I don't want you to feel isolated, but it's become clear you are trying to take advantage of that kindness. That is also something I cannot respect and I won't allow it any further. If anything, you are being selfish by making such a request to deceive your mother. My offer still stands to present the coat as a group gift to (sister), but if your going to continue to act selfishly, then I will have to rescind that offer. You might be angry at me for that, but I cannot encourage such actions.\"* \n\n&#x200B;\n\nDraw that boundary and draw it hard. ",
            "u/pizza12355uqu, there’s always one more thing to remember when your stepdaughter blows everything: you have the entire text message conversation on your phone to prove your account to everyone who matters.",
            "You hold your ground because you're right. If Brittany is old enough to date a 45 y.o. she's also old enough to understand that what she's asking is for you to help her manipulate people in order to look good.\n\nShe needs maturing and this will be a good life lesson for her. ",
            "Remind her it’s about her sister and not her. ",
            "The 15 year old, after the update. Is this discomfort stemming from observation and instinct or is he behaving inappropriately? I’d find out. ",
            "After reading OP's comments, I'm sorry but this girl is as dumb as a doornail. I've never seen such a trainwreck and it's only going to get worse. OP, I would stay away from her and her drama, your husband should understand if he has a modicum of empathy. ",
            "I know you want to be her friend and have her like you. While you may not be her actual mom, you’re still in a parenting role to her. \n\nShe wants to take the gift you found and paid for and take all the credit because she wants to show her mom that her boyfriend isn’t a dead beat.  Obviously she’s being selfish. This isn’t even about her sister. It’s just about getting one over on her mom.\n\nYou should tell her that you’re sorry she feels angry, however wanting the gift to be from the group isn’t selfish. I’d try to gently say that her reasoning for wanting some credit for the gift is actually being quite selfish. You should point out that this is about her sister not making her decision to live with her boyfriend look good. You should also say something along the lines of how it is her choice to be with this man, and she’s technically now an adult. I’m assuming she wants everyone to respect her as an adult and therefore her choice in boyfriend, but she needs to start acting like an adult. Tell her that while you love her, and want to see her relationship with both her mom and dad improve over the boyfriend issue, you’re not going to take part in actively deceive either of her parents just to make her look a little better. \n\n",
            "If the coat was her idea and you purchased it, the simple solution is to let her buy the coat off you for the same price you paid for it and she can give it to her sister as a present. \n\nIf she's expecting it for free, that's a big fat no. ",
            "Do not give in, if she’s going to sulk because she can’t get a job like the adult she is pretending to be, then she can’t afford presents like a broke ass adult. Let her sulk and don’t lie for her. It’s nice if she likes you but that’s not your job and don’t add to that mess by lying for her to make her look good. If she’s ashamed she can’t afford shit and her old ass bf looks like a loser, then maybe she’ll be motivated to make a change. Don’t give her a hand out, if you do it once she’ll come to expect it. ",
            "Your step daughter seems to be living in her own little world there. But I'm guessing shes only doing all of this stuff to prove she can be independent. \n\nYou said that she wanted to give the coat as a way to show that her and her creepy bf are successful. She also wants to get pregnant, dropped out of school and is also taking the time to walk all over you. \n\n It seems she doesnt see you as a role model, she sees you as someone she wants to compete with. Being easy on her and being gentle isnt getting through to her. You need tough love. Talk with your husband after hes recovered about having kinda a slap in the face reality talk with her. Just you and her. That way you can show her that family isnt ganging up on her. The fact that all the men in the family told her not to date that douche makes her stubborn. Shes 18, she probably wants to feel like shes grown up enough to choose her own boyfriends, and telling her who she can and cant date is problamatic. \n\nMaybe getting out research about baby care. If she does become pregnant, shes more than likely going to ask you for money, babysitting, generally free service so she can do the things she wants. Pit your foot down AHEAD of time and tell her she'll probably have to be on her own if she truly wants to be independent and have a baby. Show her the costs of diapers, formula, hospital visits, baby vaccines, toys, beds, shoes, clothes, school, etc. Then if you can get the information, show her how much her 'bf' makes. If she tries to oull the 'but I'm your daughter! Why wont you help??' Calmly explain to her that her decisions have consequences and that you and your husband cant be expected to bail her out. \n\nShow her the costs of college and dental school while shes claiming theyre 'successful'. Show her the costs of having a house, and a car. That might be enough to make her snap out of this illusion shes in. \n\nAgain, just suggestions. I had the same thing happen with my niece when she turned 18 (immediately moved in with a 25m bf) and neither had a well paying job since both dropped out of college. \n\nWish you all the luck OP. Teenagers are one hell of an age. \n\n",
            "I think everyone has already given you good advice on how to deal with the gift situation. But I’d like to offer a different perspective on her pedo boyfriend. I think you and the family should try your best to refrain from making any more negative comments about him or the relationship. It is clear you’ve tried and it didn’t work, so now it’s time to take a step back. I imagine if she comes to a point where she wants to end the relationship, she would be hesitant out of pride and not wanting to be proven “wrong” by her family. Based on this situation it seems she’s still quite immature so youll need to modify your behavior to persuade her. ",
            "Step Daughter is 18, living with her 45 year-old boyfriend...\n\n\nO O F.\n\n\nOP, just say no to her.  She's going to end up with a lot of practice not having things her way before long.\n",
            "Tell your husband just as a heads up. One job as a parent is to teach our kids responsibility, this is one of those moments. Stand your ground and let her know that what she’s proposing will not fly. She’s gonna be angry for a little bit but if y’all have a relationship as close as you’ve described the anger will pass. ",
            "She clearly knows her relationship isn't working if she has to lie to make out like it's going well...",
            "Ugh. An 18 year old dating a 45 year old (deadbeat). Yuck. \n\nI don't have much to add, but I'm sure thats a very frustrating situation for your husband. :(",
            "Look at it this way, it’s not like she actually cares about her sisters birthday. Shes being completely selfish and using someone elses special day to make herself feel better about herself. You did the right thing, let her fester. You shouldn’t worry about making her feel better on the other sisters day. ",
            "Helping her lie would be such a wrong thing to do. The fact she would even think of this most likely came from her BF. \n\nTell her that she has 2 choices act like an adult and get 1/2 credit or get no credit at all, you love her dad ad will not help her become corrupted. ",
            "Saw your update. I hope your husband's talk with her helps. Though she my be too attached to this guy to see reason.",
            "It may be because of how short of a time in her life you've been around.  You didn't mention how long you dated so i don't know if you've known her for .5 years or 5 years, either way you're now a parental figure.  This could just be a power struggle between you and her, but i know i would have never tried to pull this on my step mom.  \n\nI'd let her know that she has two choices.  1. its a group gift, and given today, or 2. She can pay for it and then it can truly be from her.\n\nI 100% agree with telling your husband, and let him know that the decision is between both of you, and not just you.",
            "You’re trying to be the cool mom instead of the adult. That’s a problem. Take a stance and stand your ground. Stop wavering.",
            "“No, sorry. This present was bought with the time I spent at my job. Would you like it if you bought a present and I tried to take the credit for it?”",
            "I think you can hear her feelings as real to her, without giving in to a very sensible boundary of your own. The coat can be from the two of you together regardless of Brittany's response, because Brittany did help pick it out. You should be able to give it to sis on the day you are celebrating. You can be firm on your boundary while being kind and understanding to the situation Brittany is in, even if it is a situation of her own making. ",
            "Honestly, I think you are doing a better job as a step mom than you give yourself credit for. You did the absolutely right thing! \n\n&#x200B;\n\nAnd, IMHO, if she's 18 and acting like that, she does not have the maturity to date a guy that much older! I'm not being against age difference (far from me to do that), I'm just pointing out her maturity!",
            "Tell her that if she pays for the entire gift, she can say it's only from her. As long as your money is tied into it, the gift will be coming from you in part. \n\nHer bit about wanting to say it is from her only in front of her mother is telling. Mom is coming down on her hard about her boyfriend, and this is her chance to throw it back at her mom that mom is wrong and she is right. This poor girl is all sorts of messed up in her head....being born to young parents, them getting divorced, her dad remarrying, her step-mom trying to fit into the family..... She needs to get into some therapy.",
            " I'm sorry - 45?! The only reason a guy that old dates women with that big of an age gap is to manipulate and take advantage of them. I know that's not your business - It's her life. But. Come. On. \n\nAnd, as far as the present - you tell her YOU bought it. Plain and simple. She wants to prove that she's successful? Then she needs to prove it by making better choices. She's the one being selfish here and she needs to learn she can't keep taking advantage of you. If you do decide to let her take all the credit, then you should tell her she needs to financially compensate you for purchasing it. Don't give into someone's spoiled behavior like this OP!",
            "Nope, no. Don't let her use your money and generosity to make her appear to be something she isn't, as well as use you to try to make her family accept her creepy-ass boyfriend. ",
            "45 yr old bf... Your hubby has more problems than worries about a gift.  TBD, yes, group gift.  Don't give in! However, has your husband dealt with the 45 bf face to face?  Don't give up on the step daughter, in abusive relationships, they always start trying to isolate their victims.  When all family finally shuns away that's when things will get bad.  The bf does not have any good motives.",
            "In my opinion, you shouldn’t feel bad. She is 18, and if you paid for the coat, it wouldn’t be truthful or fair for her to claim that she bought it and take all credit. She is old enough to go out there and get things on her own...and if she hasn’t done that, it’s not your problem....it’s hers. You can be loving (and it sounds like you have) without letting her run all over you! ",
            "One is willing to share the credit, the other wants all the credit to herself, despite perfectly knowing she doesn't deserve it. Gee, I wonder who the selfish one is...\n\nIf you care about her, don't give in. You can forgive her later, but clearly she's lacking an authority figure who can keep her in check. It's great that you can be there for her but you also need to be firm with her, for her own good.",
            "So, I can’t help but think that this old man she’s dating is trying to groom her. I know this isn’t necessarily the topic of this post, but I think as her family, you should try to help get her resources she needs to leave him and try and create an environment that will make her feel safe to return to. \n\nI wouldn’t approach with the “you need to break up with him” because that doesn’t work (as someone who dated an older guy in high school and college). However, I think that getting her therapy help or other resources for this specific situation is dire. Especially if they are trying for a baby. \n\nBut at the same time, she’s a legal adult, and there isn’t a lot you can do, unless they started a sexual relationship before she was legally old enough. If that’s the case, GET HIS ASS ARRESTED, she’ll that you later.  ",
            "Haven’t heard it put this way, so I might as well frame it a little differently. You have strong principled grounds for disagreeing with your step-daughter’s actions: namely, that she wants to use this gift as a means of validating her relationship by lying about her and her boyfriend’s financial stability. First, you disagree with her dishonesty. That is fair, as dishonesty is not something you should have to tolerate for the sake of your relationship. Second, and more importantly, you - as would any reasonable person - have made a value judgement that her (18!f) relationship with a 45 year-old man is unhealthy, and ultimately undeserving of your support. Her using your generosity to falsely validate this relationship betrays your values in both honesty and as someone in a parental role with her best interests in mind. For you to condone her actions would be to betray your own values, which is something you have good reason to stand against. ",
            "You should update us on what happens. I got the popcorn.  ",
            "It seems you've gotten advice for the main issue here, but I think there's a lot more going on underneath that should be addressed. \n\nWhat was her relationship like with dad before you entered their lives? Has she ever expressed any discomfort with yours and your husbands age difference? I think dating the 45 year old is more of a cry for help than anything. It seems to me that its a quiet way for her to act out some repressed feelings involvong you guys together. \n\nHe definitely is predatory and sounds abusive. It's a dangerous predicament for her to be in, especially if she gets pregnant. What was her parents relationship like? How did their marriage end? Like, those are more rhetorical than anything, but worth considering in this case. If it was more stable with not a lot of fighting, then I wouldn't have expected her to go for a guy like this. \n\nI think she may feel left out or ignored and all of this that she's doing is a ploy to get negative attention from dad so she feels important again. Conning you into making her look good is a way for her to gain control of situations she feels may be out of her control. It's also possible she sees you more as a peer than an adult compared to her, and thinks you should be her buddy and not mom. \n\nFind small ways for her to gain some control back within the family. It may come off as condescending, but ask her if she wants to help you with chores and you could pay her for the work so she could get a late gift for her sister. Don't let her cross boundaries with you, explain that lying isn't okay and you want to work with her. Discuss her relationship, and gently point out things that are unhealthy. Above all, teach this kid to love herself. She needs that most of all, brat or no. \n\n",
            "You're not her friend. You don't need to cover for her terrible life choices. She should be embarrassed about her partner choice. Just be available and don't condemn the relationship to her. That doesn't mean letting her take advantage of you.",
            "Your step daughter, 18F, is looking for false validation of her relationship. And she's dating a guy old enough to be her father. That screams issues. Likely she wants acclaim from Dad, and she's sleeping with her older bf for that reason, too",
            "She is an adult. She needs to take responsibility. Tell her sister/mother the truth. \"Oh, she picked out the gift but she is struggling to put foods on the table. So I pay for it. She was too embarrassed to tell you she is that poor and that's why she told you she paid for it herself. Poor thing.\"",
            "Whoa. She is very manipulative. Her even having the courage to ask you to take credit for the gift, to me, shows she doesn’t have much respect for you. I’m curious while she was in therapy if she was diagnosed with a personality disorder. The reckless behavior patterns and disregard for others are red flags. And it seems as though she really tries to be the center of attention. (Just based on the few things you posted about) \n\nI’m so sorry you have to go through this with her. Stand your ground though. ",
            "She's going to be acting this way with you for the foreseeable future. Put your foot down now. \nShe clearly cannot be trusted based upon anecdotes you provided. So, make her earn it. And if she asks why, explain it to her. \n\nShe'll be mad. But that's on her. I hope she gets therapy and help but based upon the choices she's making you guys are in for a long road of heartache and manipulation. ",
            "You did the right thing. If you really want to you can get another small gift like a keychain or candle or something under 10bucks. Give to Brittany to gift 15f on her own. This may smooth things over for you and Brittany. \n\nI understand you want to keep the door open. But, Brittany is being dumb and needs to grow up.",
            "Giving in to a brat's behavior only condones even brattier behavior in the future. She'll get over it as soon as she gets back to needing more shit from you. ",
            "You did the right thing by saying no. She is an adult, and if she doesn’t understand why her request was rejected, than she has a whole lot of growing up to do before she can be taken seriously. ",
            "I’m sorry, but your relationship with your stepdaughter is going to have to get worse before it can get better. \n\nTo me it’s sounds like Brittany is probably a little manic, finding such an older guy etc, but ultimately it sounds like she has pain from her life and she feels like the world owes her something and this issue with the present is an example of this “why can’t you just give it to me, it’s not fair that you’re not”. \n\nShe needs tough love, she needs to realise that she’s responsible for her life and her happiness... that’s hard to do without tough love that sees that she needs to respect and love others to receive the same in turn. \n\nIf I were you, I would I would be firm but fair and rather than put too much energy into trying to help her, I would save that energy for her being angry at you and use that energy to be nice back to her and remind yourself that she’s in a rough patch and she’s finding herself and the way she fits in the world and in her family. \n\nShe may hate you for a while and be passive aggressive, but she needs boundaries and you can’t allow this behaviour otherwise you will be her ‘whipping boy’. \n\nHope this helps. ",
            "This is where you establish boundaries.",
            "No. She’s being manipulative. Tell her that you won’t participate in deception.",
            "Why would she think that this was even an option? That's what I would ask.",
            "Wait I fail to see how buying a gift with YOUR money and crediting it as a SHARED gift is selfish. If anyone is being selfish here it is HER. ",
            "As important as it is to be thete for her u can't be a doormat .. there will be times where u don't get along.\n\nI am a step daughter \n\nI see no issue in telling her no and if she needs the money to buy her something she can do some jobs around the house ?",
            "When I was 18, I dated a 34 year old man briefly. It really hurt my parents, because they knew it was sketchy though I couldn’t see it at the time. Now, I am so grateful for their concern. At the time, I did a lot of wrong things trying to justify the relationship. It sounds to me like that’s what your step daughter is doing now. \nI’m sorry this is happening, and that the responsibility and blame is falling on you. But I think you’re doing the right thing. To say yes would be enabling her to continue this delusion that she’s doing the right thing. \nAre you on friendly terms with her mom? I don’t want to necessarily suggest ratting her out, but since your husband is sick, maybe another parent could help the situation ",
            "Op, you've had enough good advice on the coat issue, but what i havent seen so far: your step daughter sounds like she could seriously use some therapy. Just the fact that she would consider dating such a creep and try having children with him indicates she might be dealing with some serious mental issues (insecure, low self image/esteem). \n\nBe careful with how you suggest it, dont paint it as something she needs (this will only insult her and make her less likely to accept), but I do think you or one of her other parents should help her get therapy. ",
            "Make her work for you to earn the cost of the coat. If she wants to take full credit, then she needs to earn full credit.",
            ">The 18 year old (let's call her Brittany) lives with her (45M) boyfriend.\n\nWut",
            "I know this is off topic but I need to know how your step daughter ended up with a boyfriend older than her father in the first place. I'm kind of baffled, horrified, and almost mildly impressed all at once. \n\nAs for the issue you're having, I would still include her in the gift (since cutting her out is only going to prove her point), but I would be wary about doing favors for her in the future. ",
            "Say no. Give gift JUST from you. Her bad attitude means she's loses the co-gift right.",
            "Honestly I would just go with your original plan whether she wants to be upset or not. She needs to figure out that she's not gonna get her way. If she is trying so hard to \"prove\" that they are successful then she should get a job and buy her her own present.",
            "She’s to old to be playing stupid games like this. You tell her straight up the gift from all of you guys. If Brittney doesn’t like it she can get her sister something else. As for her being angry. How can she be angry at you? That makes no sense. ",
            "Tell her if she wanted to prove she’s successful, she can save up money to be able to afford things in the future.",
            "Your step daughter is a train wreck, and giving in to her demands would fix absolutely nothing. So stick with \"no\" and live with the fact that she's just not something you can fix.",
            "What did your husband/birthday girl’s dad get her? Just curious. ",
            "Absolutely do not let her take the credit. You have the receipt and can still go with the story that it's from the 2 of you but do not let her selfishly take the credit to lie and deceive somebody else into thinking they are \"successful\" which they clearly aren't. I know how hard it is being in the \"stepmother\" role and trying to please everyone and not step on toes but this is unacceptable. This is where you stand your ground and dont let her walk all over you. She is despicable for trying to steal the credit and fool everyone. Sorry for the long rant but I deal with shit like this in my blender family all the time and it is ridiculous. You bought the gift, stand by it. ",
            "Sorry, I thought I heard the \"Deliverance\" theme song for a moment.  What did you say?",
            "Just let her be angry. She needs to learn that throwing a fit doesn't work in the real world. ",
            "Continue the kindness but stand firm on your own boundaries. Tell the little sister it’s from both of you, or you both picked it out. Hopefully she will come to her senses about a lot of things, and if not feel pride in that you didn’t react to HER selfishness and you’re still trying to do right by her. ",
            "You paid for the gift. She's seriously just being immature about the whole thing. If she wanted to give something herself she shouldve done the responsible thing and bought it herself. Please don't give into this! ",
            "I mean, honestly, I'd just say \"That's fine, fuck you too,\" and just say it was only from me. ",
            "i haven’t even read this because i can’t get past the “he had an 18 year old when he was 19” ",
            "Get yourself over to www.secondwivescafe.com and join. It’s free.  Loads of advice there from people dealing with the same stuff every day",
            "Say No. Stand your ground early on. Once you give in to her tantrum she's going to do it again. ",
            "If her sister wants to buy it for her and take the credit then set up a payment plan with her so she can pay you back for the cost of the coat in full. Only then may she claim it was her gift to give.",
            "I have step children myself and always stood my ground with what was right it was hard to do at times but in doing that my step kids respect me and we have a good relationship. I would do as you planned with the gift and if you want to feel better maybe you can offer her some help and guidance in some way with finding a job/future career so she can do nice things for her family(also take care of herself etc.) Dealing with a teenage step daughter myself I recently learned our brains don’t stop growing till we are 24 so as much as you think she’s an adult she probably could still use some guidance(whether she accepts it or not is a different story but either way at least she knows you care and you can feel good about offering to help).",
            "You need to tell her that if she's gonna be dating a 45 year old man, he at least needs to make enough money to support her and buy gifts for her sister.  Better yet, she shouldn't be dating that old at all.  Wtf is wrong with this guy.  ",
            "Honestly, she is just being childish as many 18 year olds. And trying to prove something that isn't true. From my perspective. So, I would just tell her it's a gift from both of y'all and if she doesn't like it, she can just suck it up. Tell her to put her big girl panties on. 🤷‍♀️\n\n\nSaying that is probably rude, and not very tactful. But that's the best advice for you that I have.",
            "You are doing the right thing. You told her you didn’t feel comfortable. She is freaking out. That is about her lack of emotional intelligence, not you. Let her know you love and care for her and this is what you can offer her. ",
            "Start by addressing the part where this train wreck is banging a guy older than her dad and realize that if she has someone that old he shouldn't have a problem being an \"adult\". Then point out that you are the parent figure in this episode of Jerry Springer and the child is being just that... A child.  A lying child.  Also, do not engage beyond that.  By engaging with anything other than fact of the matter you give her an audience\n  ",
            "She's obviously taking advantage of you and doesn't care about your feelings. She's a user. Put your foot down and tell her no. She'll either get over it, or she'll continue to use people. ",
            "If you’d told her days ago then it would be kind of different but seeing as you don’t have time to get another gift (even if you were comfortable with her doing that) then she’s going to have to deal with it. Hiding the truth will only make it worse. ",
            "An 18 year old dating a 45 year old? Tell her to get a job, and buy her own gift. Your husband is right. Keep your distance. This only gets worse from here. ",
            "Definitely say no! For one, YOU bought it with YOUR money. And two, she is being selfish, letting you buy it and then wanting to take all credit for it. Tell her to get a job and actually do something with her life. Props to you for trying to be a good step mom though, you sound amazing, and it really sucks she is trying to take advantage of your situation and kindness! ",
            "This girl is delusional.  An 18 year old dating a 45 year old?!?  There is only one reason for that!  Pure stupidity.  Don't follow along with her wishes.  Anything you can do to slowly steer her out of the situation would be good, so definitely make her uncomfortable.",
            "Your step daughters are 10 years younger than you? God do what they want just to get in there good graces lol who cares about anything else. Do what you can to ensure a good relationship with your SO's kids. Especially dont try to teach the 18 year old, she is not interested in your life lessons ",
            ">The 18 year old (let's call her Brittany) lives with her (45M) boyfriend.\n\nLol, what?",
            "Say no and never collaborate with her again on anything that requires money.  You might be a new stepmom, but that doesn't mean that you just have to go along with things you know are wrong nor do you have to let her down easy when she's being aggressive. ",
            "45 YEARS OLD WHAT THE FUCKKKKK",
            "I can’t get over the fact that her boyfriend is EIGHT FUCKING YEARS OLDER THAN HER FATHER, ew ew ew ew ew ew ew ew ewwwwww"
        ]
    },
    {
        "post_id": "afb24y",
        "author": "barnaclesss",
        "title": "Update: Am I [32F] being unreasonable with expectations of my husband’s [37M] parental and household responsibilities?",
        "url": "https://www.reddit.com/r/relationships/comments/afb24y/update_am_i_32f_being_unreasonable_with/",
        "score": 3914,
        "num_comments": 200,
        "created_utc": 1547323526.0,
        "selftext": "Original post: [https://www.reddit.com/r/relationships/comments/a63it9/am_i_32f_being_unreasonable_with_expectations_of/](https://www.reddit.com/r/relationships/comments/a63it9/am_i_32f_being_unreasonable_with_expectations_of/)\n\nMy original post didn’t get tons of attention but I figured I’d provide an update for those interested. \n\n**TL;DR:** I talked to my husband about how our household responsibilities are far from equally shared. He was very receptive to my input, open to change, and apologized for slacking off and being lazy. He also thanked me for communicating everything so well. \n\nAfter finally a month when the kids were laid to bed and there was more quiet and less chaos. I sat down at the table and discussed with my husband how I felt burnt out and exhausted assuming nearly all of the household chores and mental load. \n\nThis came after I came prepared with a written sort of cluster diagram of every chore that I do and all the mental “inventory” I have to keep track of in the house (e.g. shampoo, groceries, diapers, kids clothes, toilet paper, etc) I explained that I have to keep all the balls in the air, if I don’t, then it negatively affects how easy the household is run and will negatively affect other people. For example, if I just boycott keeping track of things that run low, such as toilet paper or diapers or laundry detergent, it’s not good for anyone. A kind of “emergency” situation would arise. \n\nIf my husband fails to do his chores, he was oblivious to how it implicitly places the burden on me to pickup the slack. His time spent on leisure activities and not his household responsibilities shifts more chores on to me, while diminishing *my* free time that I could have. The household is like a business and everyone has to chip in and do their part. \n\nAfter explaining all this, my husband was very open and apologetic of the fact he was so unaware of how his behavior and lack of action was negatively affecting me. He confessed his “radar” for seeing things on the floor or that need to be put away just wasn’t there and he really needs to keep working on making that better. \n\nHe also apologized for prioritizing his fun hobby projects over completing his chores first and then, consequently, leaving no time for his chores due to the interruptions of our kids. He also apologized for his lazy behavior and said he’s really going to make a better system for himself to get his household tasks routinely done that doesn’t require me asking. \n\nIn the end, he said he really appreciated me bringing this up in the way that I did and reaffirmed that everything I do “Does not go unnoticed” and that he is so thankful for all that I do. \n\nIt feels good to talk things through calmly as adults and come to a healthy solution that comes with concrete action. Here’s looking towards a less-stressful future ahead :) \n",
        "permalink": "/r/relationships/comments/afb24y/update_am_i_32f_being_unreasonable_with/",
        "comments": [
            "I'm glad you and your husband were able to discuss the situation calmly and he responded positively to what you have to say! I am curious however, did y'all actually come up with a plan to divide the household labor? I believe you when you say your husband *intends* to do more work around the home, but as they say, \"The road to hell is paved with good intentions.\" \n\nA plan such as a chore chart, timeline for doing chores (e.g. mop the floor every Wednesday, load the dishwasher every evening) takes away a lot of the need to develop \"radar\". Responsibilities are clearly and explicitly laid out which sets everyone up to succeed.",
            "Ahhhh I have had similar discussions with my partner [28M] and it always starts out amazing! He will get up, do the dishes, tidy up, put the night nappies in the rubbish but then after a week or so he’s back to laziness and hobbies first again! I hope that your husband sticks to this long term for you! ",
            "I kept waiting for the punch line. Good on your husband for his attitude. Can he call and talk to mine?",
            "Hey OP, you should update in a few months to see if your husband has actually made changes or if things have gone back to the way it was.",
            "Your husband is still not being financially fair because none of you domestic labor is compensated.  You say in your last post that expenses are split mainly 50/50 despite him earning 2-3x more than you; you justified this by saying he ends up taking on slightly more cost paying for large purchases and some bills.\n\nThis financial breakdown does not take into account that you perform +80% of childcare and household work-- which you deserve *money* for. This is why families so often share expenses, because its a team effort.\n\nYou and your husband deserve the same amount of financial freedom.",
            "Good on you! I had the same talk with my partner just before New years, about being exhausted and having to take the largest portion of responsibilities and most importantly - the initiative. It's extremely hard having to be the only one to set things in motion all the time, with household chores and general planning always running at the back of ones mind.\n\nWe were both in a rut, but are now in a much better place. Best of luck to you both! ",
            "My husband doesn't see things laying around either. It's bizarre. I had a half-full garbage bag on the ground because I was doing a kitchen clean out, and he tripped over it.\n\nHe goes 'Why did you leave that there?!' (he said it in defence because I said 'What the hell how did you not see that?!') and I'm like... 'I didn't leave it there, I put it there because I'm currently cleaning out the kitchen.' \n\nHim: 'How am I meant to know that'\n\nMe: 'Because I'm literally doing it right now, in front of you.'\n\nHim: 'You should have told me the bag was there'\n\nMe: 'I assumed you would see it because you're an adult with eyes. I'm actually really worried you didn't see that.'\n\nAll said while laughing, might I say.\n\nAnother time which completely dumbfounded me, was I asked him to bring 'the bags' outside, and he misinterpreted and brought the garbage out... to my car... to give to me (???). So I asked him to get the shopping bags instead, which he did. When I got home the garbage was sitting in the middle of the kitchen. Even though he'd brought it out to where the bins were. My brain, I just can't.\n\nBut he also starts reading from the middle of paragraphs and doesn't see signs. Like actual signs. He'll go 'how did you know where to go?' Because there's a sign right in front of us.",
            "Communication wins the day! ",
            "This isn't especially relevant but I am curious after your first post. Do you guys not have a shared bank account? The idea of paying everything 50/50 in a marriage seems weird and overly complicated to me, why do you do it like that? ",
            "I’d be curious to see how you put everything together to shoe him if that’s not too private. I need to have a similar discussion with my husband, and it’s kind of daunting even figuring out where to start.",
            "Haha love it! My partner does say just to remind him and he will do it but constant reminding seems like nagging. Seems easier just to do it myself sometimes ",
            "I’m happy for you that he was so responsive and I hope he maintains the contribution to the household chores!  \n\nThis issue was one of the main things that ultimately led to my divorce after 18 years together. I tried everything to get him to help more around the house, with the kids, etc and ultimately his hobby, job, and computer/phone always came before us. I would talk to him about it, he would get better for a bit, then fall back into the same patterns over and over again. It was super frustrating for me! There were other issues that led to the divorce but this was a big one.  ",
            " that's amazing! I love it. A supportive relationship where are you can come to new understandings through mutual discussion and understanding where the persons coming from. I think you have a great relationship. It's cool that he immediately got what you meant and agreed to be more on board. \nOne suggestion I have as you start to figure out what his new responsibilities will be is to take into account that people have different styles of what is really necessary to be done. Like with my husband he just doesn't care if things are on the floor, it just doesn't matter to him so I try not to put that on him because it feels forced when there's plenty of other chores he could do that he actually agrees are really important. Just a tiny tip as you move forward still be understanding of the other person's thoughts about the whole concept cuz of men and women can be really different about what they feel is a necessary level cleaning. ",
            "You’re me. You’re me literally in 3 years as we are pregnant with our first right now and I feel like that’s my future because it’s lready heading that direction. I would love to know exactly what tactics you used to explain how you were feeling without him just getting defensive and insisting he does enough when he so obviously doesn’t. My husband is also in front of the computer every waking moment he’s not working and I have no idea how to address that positively either. ",
            "You should also revisit your money situation. In your original post you said you pretty much go 50/50 on everything (he pays utilities, but you go for all the household stuff like detergent, diapers etc etc.) which will roughly come out the same I would think. Yet he makes 2-3x what you do. You should maybe do a 33-66% or 25-75% split then. Not only did you work yourself to the bone, you also contributed more financially pro-rata.",
            "My husband and I had a similar conversation during the first 5 years of our marriage. We found what worked was splitting chores based on preference and realistic expectations. Example: I don't mind laundry and he doesn't mind mopping so we each take care of that chore. We both hate cooking, but I get home sooner during the week, so I cook Monday thru Friday and he takes care of the weekend. He also Grocery shops, I do the meal prep. It works for us and keeps the fights at a minimum. ",
            "I’m glad the communication worked out for you! You sounds like a very busy person indeed, but there’s a great book by Tiffany Dufu called “Drop the Ball” that I think you would love. Her story reminds me a lot of yours",
            "[removed]",
            "I got halfway through this and realized I forgot to add apples and soy sauce to the grocery list, then had to check in for my flight tomorrow and write out the check for this month's dance classes for my daughter - lol. Glad you and so many others have this in check - because I sure don't!",
            "This is cheesy and probably nit-picky, but as much as I love your business analogy I think another astute point of view is to look at family life like a garden that has a variety of needs and requires work and effort for it to thrive ",
            "I have a saying : every time partner 1 say no partner 2 must say yes. For example : partner 1 does not want to change the diaper. While they get to avoid it, partner 2 must then change the diaper, because it must be changed. This goes with most things.\n\nI knew someone who was proud that he got to avoid buying presents for Christmas and birthdays, but his wife hated it too. Yet he applauded himself for d avoiding it, and so his wife had to do it always, because someone must. ",
            "Glad you worked things out OP. To make things even better for you I want to ask if you ever have your kids helping with the chores? My son is five and he's been helping me make things more bearable around the house since he was two. Last night he helped with four loads of laundry that had been piling up. He's strong enough to open the dryer. I have him remove all the clothes and take them to the bedroom where we sort it. Then he sorts a good portion of it! He also washed the dishes last night! All these little things help immensely.",
            "I read this and thought yes he’s a smart man. No arguments, owns it, proposes change. Also provides the woman the recognition she has earned. \n\nI hope there is another update. My guess is one will be needed. ",
            "But why would they be equally shared if you're a stay at home mother? \n\nNo shade, genuine question. I thought that was the point of having a stay at home partner.",
            "This is awesome! Your husband sounds like a good dude. Congrats on communicating your needs so clearly!",
            "I love positive updates like this. Communication is so critical. Delivery is everything too. You did an excellent job of stating the facts and not projecting. \n\nI have to have the same talk with my partner and plan to approach it in the same manner. \n\nThanks for the update! ",
            "I'm so glad to hear this. It matters so much to women that we hear that the work we do IS noticed. You handled the discussion like a boss!",
            "I love a good outcome. I’m glad you guys worked this out so well.",
            "Congratulations!  A couple of my married friends had this same conversation and within 2 months they hired a house-cleaner. Still win-win but before he started pulling his weight he would always say it was a luxery they didn’t need.",
            "Hoooray for being grown-ups! Reddit FTW!!!!\n\n&#x200B;\n\n(Off topic, but I think it's ironic that the spellcheck here -on reddit- doesn't recognize the word \"Reddit\", and always highlights it.)\n\nEdit: Fixed!",
            "I need to keep this for notes in the future. I’ve assumed all of the responsibilities between my wife and I and each time I try to talk to her about it, she goes straight to her phone or zoned out. When I call her out on that, she just looks at me and said “what?” Or “what do you want me to say?”",
            "Happy that things seem to be working out. I became a stay at home mom after our second son was born( they are 23 months apart) I did work half time before my second son was born. Then I stayed home after our second son was born and when he went to kindergarten I went back to work part time.  My husband worked a very demanding job 10-14 hours a day and sometimes got called in during the middle of the night.  We had no family in the area ( we recently moved to the Midwest from the East Coast) that I could depend on. Saying all this, I did it all, you name it I did it. If my husband was home on the weekends ( he worked weekends too) then he did some of the yard work.  But other than that, I pretty much did it all. My two boys are now 17 and 19. My husband and I just celebrated our 30 year anniversary. What I am trying to say is communication and patience is key in a marriage or any relationship. Your house doesn’t have to be perfect! Mine never was and my husband and children survived. Stay strong 💪 and remember you are the stronger sex and good luck.  Just an added note, the baby stage is the easy stage, the teenage years gave my husband and me grey hair 🥴",
            "I also wanted to suggest that you go ahead and give him praise when he is doing all these new chores. Give him the positive reinforcement that you wish you had all along :-). He basically agreed to make parts of his day a lot less fun from here on out, so you might as well make sure he knows that you appreciate it!!",
            "My opinion will likely be an unpopular one but it is true and pragmatic.\n\nYour husband is the one out working and making the money to support the family and you are a stay at home mother. In this situation my opinion is that you should be doing 100% of the household chores that don’t require heavy lifting, working with tools etc..\n\nRaising kids is difficult, I understand but it is not nearly as difficult as my job. Managing a department of 6 professionals, meeting timelines and budgets, traveling out of state 30% of the time, working late hours preparing presentations and reports etc.. Put on top of this all the stressful situations I frequently encounter at work like firing, reprimanding people and dealing with high stakes, high stress workplace conflicts on a regular basis.\nThere is a reason I get paid 150k a year for what I do when you can hire a nanny to raise your kids for much less than that. The last thing I am going to do when I get home from work is make dinner for the family, this is the wife’s “job”.\n\nYou can tell me that I am wrong all you want but the marriages where the man goes out and makes the money and the woman runs the household and raises kids have the highest success rate and results in the best quality children.\n\nAlright I’m ready, start flaming me...",
            "Should’ve divorced that’s the solution to every post on this sub.",
            "Is work related in any of this? I read you are both adults and have children and seem to be afloat so obviously you have financials in check could this be the problem? I also read that he puts his hobbies in front of his chores and so on which by the way good job for checking him on that it’s always good to be work first play later. If your husband is at work all day and comes home and still helps around the house he is 100% a keeper but if all he wants to do is relax after a long day of work then you guys should both work something out where you can accomplish this. I’m not bashing you in anyway saying just cause you are a woman you are expected to do all the house duties. If your out all hours of the day at your job you deserve a break too. Among your chores around the house is there anything time consuming? A avoided chore that no one likes doing if you will? On the up scale there is nothing wrong with this. You did right by keeping it positive and being adults about the situation.",
            "How many people told you to get rid of him on the original thread?",
            "You have to work with their strengths and compromise from there.",
            "Some people cant read minds. I( 39M) am one of them but that doesnt give him an excuse to not do any chores especially if he has time for leisure activities. \n\nDoes he work full time and your at home full time? i find often in other couples I speak to that there is a greater expectation for household chores on the stay home parent almost to the point where the partner who goes to paid work doesnt think they need to do anything once they get home.\n\nMy partner ( 39F) is a shift worker and works 4 days a week and I work 4 days a week so we share responsibilities equally around our household chores and 2 kids.\n\nI would also say if you are exhausted then it is important to give yourself a break and if some minor household chore doesnt get done it isnt the end of the world.\n\nTell him a good way is to do little bits of household chores every day it doesnt seem so big a job.\n\nGood luck.",
            "Been there (M53), but you can't buy that kind of radar and it takes years of training to be able to manage a home..\nI have never succeeded, but keeps trying..\nI have - without luck- tried to convince my wife that you cannot split a home in two equal halfs nigther chores but if two people try there best that is a success. ",
            "Ah yes. Now DUMP HIM. /s This is such a good update for this sub!! I’m so happy for you!"
        ]
    },
    {
        "post_id": "4oacaq",
        "author": "tea_recs",
        "title": "UPDATE: Me [36F] with my ex boyfriend [36M] of over 10 years, his wife [40F] has alienated him from all his friends and family and has started messaging me",
        "url": "https://www.reddit.com/r/relationships/comments/4oacaq/update_me_36f_with_my_ex_boyfriend_36m_of_over_10/",
        "score": 3904,
        "num_comments": 154,
        "created_utc": 1466032978.0,
        "selftext": "**[Original post:](https://www.reddit.com/r/relationships/comments/4infj1/me_36f_with_my_ex_boyfriend_36m_of_over_10_years/) - tl;dr: I think my ex boyfriend is being emotionally manipulated by his wife who is alienating him from friends and family. I want to help him but don't know how.**\n\nHi, even though my original post didn't get a lot of attention, there were some good responses and I thought I would update everyone as A LOT has happened in the last couple of weeks!\n\nSo I forwarded her messages to my ex's brother Fred. He called me immediately and said that he would try to get a hold of his brother as soon as possible. I forgot to say in my earlier post but Bill works as an independent consultant/contractor in IT so it was hard getting a hold of him in his workplace. Frank received a few responses from Bill, just short emails saying he was ok, but Fred wasn't really buying it.\n\nThankfully I hadn't received any more messages from Fiona (I didn't reply to any of her emails so I guess she gave up on me). I didn't think there was much more that anyone could do so just got on with looking after my own family.\n\nMy husband (let's call him Dan) knew that I was worried about my ex, and as a testament to what a great guy he is he set about trying to contact him as they both work in the same field of IT (I know apparently I have a very specialized 'type' lol). Dan is close to his boss and told him about the situation. Dan's boss contacted Bill through Linkedin to set up a Skype \"consult\". Dan's reasoning is that if Fiona is monitoring Bill's emails and social media then this will fly under her radar as she doesn't know Dan's boss and his connection to us. My husband is a sneaky clever bastard.\n\nThey scheduled the call a day later and my husband hopped onto the call as well. He didn't tell me exactly what he said, but the gist of it is that Dan and his boss told Bill that we were all worried about him and that if he needed help to just let us know. Bill broke down and started crying. He felt so helpless and thought that no one cared about him. Turns out she was reading all his emails and deleted all the ones from his family as well as controlling all the finances. She was also physically assaulting him and was too embarrassed to tell anyone (she's just shy of 5 foot, he's 6'4''). Dan and his boss told him to pack his bags and head to the airport and they bought him a one way ticket back home!\n\nBill arrived home a week or so ago and he's doing well. He's staying with his mother and father and Fred has been helping him get back on his feet and handle the legal stuff. Needless to say they are extremely grateful to my husband and his boss and have paid back the cost of the ticket as well as buying Dan and his boss several bottles of very expensive bourbon (which they insisted on, we were happy to cover the ticket but weren't going to argue with them). Dan and I told them that now he's home we were going to take a step back. His family is looking after him now and they don't need our help anymore we'll still keep in touch though and I think we'll always be close to Bill and his family from now on. Fred did tell me that she doesn't want to come back home so we don't have to worry about her turning up on our doorstep.\n\nI don't know how Fiona reacted (she hasn't sent me any emails so I don't think she knows I was involved) or what's going to happen legally because I don't want to be so involved anymore. It's time we focused on our family for a bit because I'M PREGNANT! Couldn't have picked a better man to breed with. Also, Dan's boss let Dan bill the hours of Bill's rescue as \"personal development\" because there are still decent people in the world.\n\n**tl;dr: My instincts were right, Bill was being abused emotionally and physically by his crazy (now ex) wife. My husband and his boss staged an intervention under the guise of work and bought Bill a plane ticket home. Bill's doing fine. He's going to counselling and everyone is giving him lots of support. My husband and I had fun times and now I'm knocked up.**\n\n\n   \n",
        "permalink": "/r/relationships/comments/4oacaq/update_me_36f_with_my_ex_boyfriend_36m_of_over_10/",
        "comments": [
            "[deleted]",
            "A+ on this entire update! This post had everything: travel, high stakes job interviews, awesome boss, a supportive husband, good triumphing over crazy, Fiona stuck on a giant island, and pregnancy! \n\n\nSeriously, so glad Bill is safe and I hope he goes into therapy and gets the support of his family. ",
            "Its so great to hear a situation where so many people stepped in to help-while keeping good boundaries.  You don't see a lot of that in this sub.\n\ncongrats on the little one. I hope you have an easy pregnancy.",
            "You, your husband, and his boss are lovely people. Hopefully ~~Fred~~ Bill can stay out of Fiona's clutches and his new life is much better.  Domestic violence and abuse is horrible, that's so sad she had trapped him. Glad he's out and free! She sounds horrendous. ",
            "Wow.  Huge, huge kudos to you, your awesome husband, and his awesome boss.\n\ne- And props to /u/Green7000 for the solid advice in the original thread.",
            "Your husband is an absolute rock star! You are BOTH wonderful people. I'm so glad things worked out and hope Bill is on the road to recovery. It sounds like he has the tools he needs, with supportive family and friends in his corner.",
            "Wow. What a ride. I'm so glad Bill is okay. Good looking out, OP.",
            "Every person who has been through domestic violence deserves to have someone like you, who won't give up on them no matter how much their abuser tries to isolate them.",
            "I am enormously impressed that at how this was handled. That takes some serious maturity on everyones part- especially your husband. What an absolutely fantastic man.",
            "We IT people are sly bastards when we want to be...\n\nYour husband is da real MVP for real. What a bad ass. I can only hope to be half the man he his. If any one in the world is owed a beer, its this dude.",
            "Y'all are some incredible people. Good on you and your husband OP.",
            "I *do not* cry over things on reddit. I just don't, I never do. But when I got to the part about him bursting into tears and saying he didn't think anyone cared about him anymore- something about this poor, utterly helpless and hopeless man who thinks his life is going to be this forever, finally getting a sliver of hope and realizing how much you all care about him, and that you *came for him*- well, it turned me into a blubbering mess. I'm so, so happy you did what you did.",
            "I can't upvote this post enough. \n\nWhat amazing compassion your husband has (most people I know would say eff that guy), it shows that he actively listens to you and your concerns about friends (even former friends) and family. ",
            "Thank you for not listening to those that said \"you couldn't do anything\" because \"he is an adult.\"\n\nWhile you can't help someone who won't help themselves, sometimes that person doesn't know how to help themselves. You opened that door for him.",
            "You, your husband and his boss are the people we need in this world. Congratulations on saving the life of another person who would have been more abused or worse, but mostly congratulations for finding one of the coolest guys out there :). I wish you all the best and your compassion made me really happy.",
            "She knew. In the crazy that is her mind she KNEW you and your family were the threat to total control of him. \n\nShe would never have let the other family and friends back of course but she hoped that by dangling that carrot in front of you, you would agree to back the hell off and allow her to complete the isolation. \n\nOf course it was too fucking crazy for any normal person to do, but pound to a penny that was the reasoning. \n\nYou and your husband (and his boss) are amazing and I really hope Bill can recover from this - his self EVERYTHING has been destroyed by this witch. \n\nCongratulations on the pregnancy too xxx",
            "Wow! You and your husband are amazing! So your new baby will be named after your husband right? OR he chooses the name? What about his boss - does his boss have a shitty name?\nCongratulations!\nAlso I'm in Australia, I volunteer to send her a thousand brown snakes and tiger snakes because being abusive is not cool!",
            "Woah! **I want to know what Fiona's reaction to all the separation was.** Good on you and your husband for facilitating the escape from down under!",
            "This is so incredible. I'm so glad guys were proactive because, as you can tell from Bill's reaction and from some of the comments in the original post, it's so easy for male victims of domestic violence to feel too much shame and for others to not take their potential abuse as seriously. Especially when they're in a different hemisphere. I'm so incredibly glad that he narrowly escaped a lifetime of abuse.",
            "I'm so glad you decided to help him. Reading the first post of people saying he can make his own decisions made me so angry, he was being domestically abused and manipulated and they wanted you to turn a blind eye. Thanks for being a good person :)",
            "This is a fantastic update. Very happy to hear everyone is now safe. I'm so glad your husband took steps to get in touch with him. It really means a lot that you both were still looking out for him. \n\nAnd Dan's boss. \"Personal development,\" what a guy. ",
            "Your husband is awesome.  You sly devil you!!! ",
            "Reddit sometimes gives me hope.  ",
            "Wow. This could be a movie! Glad he's out of that hell hole",
            ":')\n\nFucking A, OP. Thank you for sharing that and helping your old friend. ",
            "\"The true measure of a man is how he treats someone who can do him absolutely no good.\" - Samuel Johnson\n\nYour husband and his boss had no emotional connection to your ex but still worked out a way to help someone who can do nothing for them.  Those are the best kind of people to have in your life. You chose wisely. ",
            "You and your husband are a great team! Thanks for saving a domestic abuse victim. You've done something very important.",
            "You guys are wonderful people. Thank you for reaching out. ",
            "This is just fantastic.",
            "Wow, you are all such good people! Your husband is a wonderful man and you are lucky to have him :) And he's lucky to have such a great boss! ",
            "This reads better than most modern Hollywood movie scripts. Calling all screen writers, buy this story from u/tea_recs.",
            "You, your husband, and your husband's boss are all the type of person I aspire to be. Well done. You've earned your wings today, and I don't even believe in that religious mumbo jumbo.",
            "Well done to you for noticing something was off and well-done to your husband for helping your ex so much, and how fabolous his boss helped too! Congratulations on the pregnancy! A truly uplifting story.",
            "You and your husband are stars. ",
            "Wow, I just want to say I felt warm fuzzies reading this. Obviously, Fiona's actions have been awful, but it made me happy to see that countered by so many more people working to do good - you, your husband, his boss, Bill's brother... It's really wonderful to see what you all worked together to do to help Bill out. I'm really glad he's away from his ex, and hopefully he'll be able to recover soon from it all with his family's support.",
            "You guys are wonderful people.  Thank you! ",
            "Your handling of this situation is excellent! Especially knowing when to get involved and when to leave... and seeing how your husband handled things in such a good way. You both deserve to have each others!",
            "I'm glad decent people still exist.",
            "A very happy story to say goodnight with. Thanks for sharing, and goodnight Reddit!",
            "Thank heavens! I'm so glad you guys intervened. Bill was being isolated and didn't feel like he had anybody to turn to for help. Hopefully he can make a clean break and start over. \n\nCongrats on the new little person! You have a great hubby for him to reach out and help your ex. Kudos to hubby's boss too. ",
            "Bravo. This made me smile ",
            "This is one of my favourite things I've read on reddit, ever. ",
            "I came onto Reddit today feeling all sad and despondent and that all people suck, read this. Day made!!! Thank you for been amazing people",
            "Honestly, you and your husband sound like the most beautiful people. Thank you for inspiring me.",
            "Bills wife sounded like a complete manipulative witch.  Wouldn't be surprised if she used a cauldron every now and then. \n\nI'm glad your ex has left her to seek counseling for this. I was gonna say he should divorce her asap. And he did just that. Good job.\n\nBtw if he's looking to date again, tell him to try the Plenty Of Fish app or try imgur. ",
            "First of all, your husband and his boss is the bomb dot com!!\n\nSo impressed by his willingness to help out, especially when its helping out an ex of his wife's. But just in case, do be on the lookout for Fiona.. you can never be too careful.\n\nand CONGRATS ON BABY!!\n\n",
            "I LOVED this story!! Good Job all around!!",
            "I'm just so happy for Bill, I'm getting a little misty over here.",
            "That's a great story, happy ending, and congratulations. I often feel like I shouldn't follow my gut like that. Good reminder.",
            "Your husband is awful. I'm so happy about this update and I hope y'all are doing well :).",
            ">controlling all the finances\n\nGet his pay direct deposited to a new account ASAP.",
            "So glad everything is working out favorably. Congrats on the pregnancy, and on being awesome!!",
            "Awesome! This is one of the best things I've seen on reddit. ",
            "YOu and your husband are amazing people, i hope your ex gets back on his feet real soon",
            "Thank you and your husband for being awesome when awesome was so badly needed.\n\nGrats on your pregnancy! xo",
            "Oh my god I cried, you are all goddamn heroes. Thank you for your compassion and helping someone in need.",
            "I am so shocked and in aww at how this turned out. \nProud of your husband and his boss for helping a random stranger. \nSo happy this had a happy ending. Way to start my day out on a positive note. ",
            "Yaaaas! Good for all of you for stepping up when a fellow human was in need.",
            "You and your husband clearly have a deep understanding of the word \"team\". Amazing! I also hope your husband appreciates his boss. I don't know if I've ever worked for a company that would go to such extremes for a stranger. What a lovely outcome. ",
            "Dude good on everyone. I'm always amazed to see how people can come together to make something that is negative into a positive experience. It shows that there are good people in the world, which he needs to see right now to help him recover. ",
            "You guys are great people!",
            "Your a wonderful friend and yay for baby bumps.",
            "> Even though my original post didn't get a lot of attention...\n\nI thought the goal of /r/relationships was to seek advice on tough situations, which after reading your original post, seems like it got some pretty consistent, squared away feedback. Certainly better advice than I would have offered, since I would have recommended you protect yourself and your family from the drama. Also, the mere mention of FB drama is probably going to make your average redditors click *next*.\n\nThat being said, I want to laud you on your intuition and handling of the situation. By going through your BIL, you helped re-establish contact between the family members while avoiding conflict with the now ex-wife, and helped get the rescue of your ex-BF rolling. Not that many people would be willing to take on additional stress in the midst of a pregnancy, let alone have it also involve your husband in his workplace, albeit, a great guy who saw the concern and the opportunity to help out the guy.  Kudos for being a Mensch.\n\nP. S. Now that you've figured out how you *fell pregnant*, better make sure you find a way to avoid that such that you aren't victimized again. /s",
            "Man so many names. Who's Fred again? The dad?",
            "[removed]",
            "Poor guy must feel emasculated. First, he gets abused by his wife; then, he gets rescued by his ex-girlfriend and her new husband. This is in no way to denigrate the people that helped him. You definitely did the moral, admirable thing. ",
            "I'm sorry about the whole pregnancy... I'll go on many vacations in your honor."
        ]
    }
]