[
    {
        "post_id": "44il61",
        "author": "superbowlthrowaway1",
        "title": "Update: I [25m] won 2 tickets to the Super Bowl. My girlfriend [25f] is very upset that I'm taking my brother [31m] and not her.",
        "url": "https://www.reddit.com/r/relationships/comments/44il61/update_i_25m_won_2_tickets_to_the_super_bowl_my/",
        "score": 3902,
        "num_comments": 166,
        "created_utc": 1454798873.0,
        "selftext": "Original: https://www.reddit.com/r/relationships/comments/434ot4/i_25m_won_2_tickets_to_the_super_bowl_my/\n\nThanks everyone for the advice. It was very helpful. This was a very stressful and long few days. I'm just glad there seems to be a resolution. I had tried talking to my girlfriend and she was still clearly upset. I approached the conversation as many people said keeping an understanding that she was more disappointed than controlling and would come around. Unfortunately she was being unreasonable. She said \"I could go\" but that doing so would hurt her a great deal and that she would need some time to reevaluate things. I should have just ended things with her there but I was so sick of these tickets by this point that I didn't even have the heart to go even if I did decide to end things with her. As suggested by some of the comments here, I called up the radio station and asked if it was at all possible to transfer the tickets to my brother so he could go with his wife. They were totally understanding and awesome about it and said they were sorry I couldn't go but they were glad to put the tickets in my brothers name for me. I was just glad to have it behind me at that point. \n\nI told my girlfriend what I did and that I was staying here and she said that I was \"being dramatic\" and \"immature.\" She said that I transferred the tickets to my brother just so I could \"win\" the argument and look like a martyr. It was at this point I reached my breaking point. I calmly told her this relationship was over. I wasn't even mad at this point just confused that a person I thought I knew could act this way. She said she was gonna break up with me because of the way I handled this anyway so breaking up with her \"didn't matter.\" \n\nMy brother immediately told me I dodged a bullet and glad that she was out of everyone's lives. My brother's wife was totally cool about me using her ticket and didn't even question it even after I'm technically taking back my gift to her. They insisted that I go with my brother and it was their idea. So now I'm the guest of my original tickets that I won. Happy to say I arrived in SF a few days ago and am having the time of my life. My girlfriend didn't unfollow me on social media and I'm posting as many pictures as I possibly can. Thanks everyone!\n\ntl;dr - Transfered tickets to my brother. Girlfriend was still petulant and we broke up. Got to go on the trip with my brother anyway. ",
        "permalink": "/r/relationships/comments/44il61/update_i_25m_won_2_tickets_to_the_super_bowl_my/",
        "comments": [
            "\"You can't dump me, I'm dumping you, I was going to do it anyways, so the story is that I broke up with you!\" ",
            "[deleted]",
            "[removed]",
            ">My girlfriend didn't unfollow me on social media and I'm posting as many pictures as I possibly can.\n\nSweet justice.",
            "Although it's not required, I would highly recommend getting your SIL a spa giftcard or something of that nature. An \"experience\" of her own.\n\nShe did you a huge favor when she didn't have to. I don't know if she's a football fan or not, but giving up that experience is a big deal IMO either way. I think doing something nice for her would go along ways.",
            "Welcome to the Bay Area!  Glad you're having fun in our corner of the world.\n\nI agree with your brother.  And I think being here with your brother is going to make better memories than it would have with your ex.  Sister-in-law is also cool for understanding this.\n\nIf you haven't done so already, try and take in the Tech Museum if you have the chance before you leave.  A nice history of tech in the Valley, plus a true IMAX theater that is currently running Star Wars TFA.\n\nBe cool!",
            "I have a feeling that she was only going to stay with you for the Super Bowl and dump you after the free trip. To her, this breakup amounted to little more than losing a bet.",
            "Your (ex)girlfriend is a materialistic, immature child. She did you a favor.",
            "The best revenge is just having a great time. Sorry it ended this way but probably for the best. ",
            "Owww man you gonna have so much fun! The golden SB, possibly Peyton's last game, enjoy it to the fullest!",
            "This sounds like she is in middle school. Don't put up with her games and go to the Superbowl with your brother and have a dam good time.",
            "Jesus what a baby. \"How dare you have the good fortune to go on an amazing trip with your brother!.... How dare you resolve the issue by giving up that opportunity by giving the tickets away!.... How dare you break up with me, that was MY idea!...\" and now that you'll be posting pictures of the trip on social media, it'll turn into \"How dare you go on the trip anyway!\" \n\nDon't change a thing. Enjoy your trip. Post all the pictures. Let her boil over. Hopefully she'll get over herself enough to enter her next relationship maturely.",
            ">My girlfriend didn't unfollow me on social media and I'm posting as many pictures as I possibly can.\n\nOne of the only scenarios where not deleting someone on facebook works xD",
            "Man! Two wins!\n\nSeriously. I know breaking up sucks, but you don't want to be with someone who just drains the joy out of you.",
            "It's shitty that she put you in a no-win situation, but the good part is that you ended up winning anyway!  ",
            "> My girlfriend didn't unfollow me on social media and I'm posting as many pictures as I possibly can. \n\nThis made me laugh.  I'm glad it worked out for you!",
            "no super bowl babies for you sir. You fucked up big time. Haha just kidding. My wife would have told me to go with my brother. Find a woman that understands.  ",
            "YOU'RE AT SUPERBOWL 50!!! FOR FREE!!! Just think about that and smile.",
            "Lady justice boner of the day. Your ex sounded horrible. I'm glad you got to go with your brother, have a blast!",
            "Your brother's going to be with you your entire life.  Your girlfriend wasn't likely to be around as late as next month, apparently.  It's good that you and your brother will get to have the once-in-a-lifetime opportunity to go to the Super Bowl together and have that great memory, instead of you having it tainted by going there with this horrible woman.  \n\nYou absolutely did the right thing.  You'd always have regretted it if it had gone down that way.  Have fun!!  ",
            "Happy(ish) ending!\n\nETA: get something nice for brothers wife.",
            "Ha ha! That's hilarious. Post all the pictures!",
            "Have a great time at the game!! :)",
            "How do I up vote this twice. Good on you. Your brother and his wife are awesome. ",
            "Your brother is forever and your girlfriend is now an ex. You made the right decision.\n\nYou dont want to be stuck in a relationship with a little girl that would cause such a large issue over this.  \n\nHave fun!",
            "Sounds like a win / win. Enjoy the game and new life!",
            "You did a good thing bro and welcome to the bay area. Hope you have a blast and enjoy the Levis stadium, it's amazing and it's new.",
            "> My girlfriend didn't unfollow me on social media and I'm posting as many pictures as I possibly can. Thanks everyone!\n\nWinner.\n",
            ">My girlfriend didn't unfollow me on social media and I'm posting as many pictures as I possibly can.\n\nHahaha GOOD.",
            "I'm glad you found out now that she's an entitled brat, rather than days before your wedding or even after. ",
            "She was acting like a complete brat about this. You did the right thing by breaking up with her. Have an awesome time!",
            "Congrats on being rid of this spoiled, whiny brat. \n\nYour brother is right - you did dodge a bullet. Be glad that she's out of everyone's lives.",
            "Enjoy SF man! Im from the bay area. Enjoy the game!",
            "Wtf is she really 25 years old?? Holy shit, glad you broke up with her. I would never do that to my bf.",
            "If I were you, I'd hit up some local parks and meet some qt's who will show you around town!",
            "Now you see the difference between wife material and an ex. Compassion. ",
            "Hell yea!",
            "How do you know she didn't unfollow you? (As opposed to unfriend, which is visible?)",
            "Wait a minute. I thought you were going to mail me the tickets? Oh well, have fun! Go Lions!",
            ">My brother's wife was totally cool about me using her ticket and didn't even question it even after I'm technically taking back my gift to her\n\nNow THATS one hell of a woman. ",
            "What a great ending. After this trip, I bet you're going to be so glad that you went with your brother \"as the guest\", so all that drama can shoved to the past. \n\nEnjoy your trip, you two! ",
            "Awesome. Have fun! ",
            "Happy ending!",
            "Go Broncos!!",
            "post pics plz",
            "My best friend and I are super proud of you! Yay you're in my city! Have a great time with your brother because you deserve it :)",
            "Farewell to a manipulative, self-centered, petty person. Glad you had fun! ",
            "You dodged the crazy bullet for sure. I sincerely hope you and your brother have the time of your lives.",
            "Try Boba guys for the PMT, Sushiritto for the novelty (burrito sized sushi rolls, I suggest anything with raw fish), Blue Bottle, Sightglass, Fourbarrel.. any of those for the coffee! Lots of places to go in SF. ",
            "> My girlfriend didn't unfollow me on social media and I'm posting as many pictures as I possibly can.\n\nThis is the best solution.",
            "Posting on Facebook? Your pretty game is + 1000👌 how long were you dating ",
            "*No!You are not breaking up with me!*\n\n*I'm breaking up with you!*\n\nHow immature. Anyway OP you did well and enjoy the Superbowl.",
            "Well done",
            "Firstly, I'm glad you and your brother went as intended. Hopefully it's a good game! Second off, you need to not talk with your ex again, no matter how tempting it is. And you should get your brother's wife a big thank you gift too!",
            "Sounds like you did the right thing! If you need any suggestions of places to eat or where to go. Inbox me!",
            "Stay away from SuperBowl City",
            "I myself would also like to welcome you to the Bay Area! If you love outdoor and hiking, I highly recommend taking a short hike to Santa Teresa County Park near South San Jose and take the Coyota Peak trail to the peak. It's a short little hike and a good workout, but you will get an eagle view of the entire Bay Area from SJ to as far as the Golden Gate Bridge on a clear day. It is one of our hidden gem and personally think it's much better than Mission Peak where it's super crowded. ",
            "Welcome to the City! Hope you can find some time to enjoy other parts of the bay as well!:) enjoy",
            "Have fun tomorrow!",
            "Haha @ posting as many pics as possible. Good for you. She was trying to manipulate the situation and it didn't work. ",
            "The social media thing is great.  What a modern method of petty revenge.  Enjoy the game!",
            "Shit I would divorce my wife for free tickets to the Superbowl. Sounds like you did OK.",
            "I take my brother over my girlfriend every single time.  That's it;  That is your bro.  That is football.  ",
            "Tldr; you got super bowl tickets and saved yourself a ton of problems down the line by dumping a narcicist. Excellent week good sir.",
            "Have fun! And go Panthers! ",
            "Yous should post the link to this discussion so she knows that everyone agrees that she is an immature child. ",
            "So glad that you're done with that nonsense!",
            "Have fun at the superbowl! And congratulations on the bullet dodged!",
            "Have a great fucking weekend! ",
            "You did the right thing. I'm sure this isn't the first time she wasn't rational, or made herself seem like the victim. Sorry about the break up, but if something silly like this is what makes her crazy then I hate to be around her if something really major happened. Have fun at the Super Bowl.",
            "glad you're doing the last terrible yet most effective version of passive aggressive behavior I've ever seen. Kudos",
            "Have fun! ",
            "Upvoted for the posting heaps of pics comment. She will be all colours of envy and shame. ",
            "You both sound immature as fuck. Splitting up was the right idea.",
            "The update I've been waiting for...\n\nI'm going to credit Peyton Manning for ending this relationship.\n\nOmaha!",
            "I bet you anything this guy finds his future wife on this trip.",
            "Hell yeah perfect, she's acting like a spoiled brat. Post as many pictures as you can, and have the time of your life there man!!!",
            "AMAZING!! You have some good people I'm your life. Fuck that chick, what a bitch. :)",
            "Solid move, your ex sucked.",
            "Hell yea bro! Glad that girls out of your life. It's the god dam super bowl. That's a once in a life time opportunity. I'm glad you're getting to spend it with you're brother and that female is out of your life. Drink a beer for me",
            "Does she really enjoy the super bowl as much as u and your brother? bc she is being a \"drama queen\". So happy for u that u end up going with your brother",
            "hey op its me ur brother",
            "[deleted]",
            "You will have more fun with your brother. Women do not appreciate sports as much. Have fun!"
        ]
    },
    {
        "post_id": "b9yf8t",
        "author": "sarahj800",
        "title": "Update from original post of my bf (24M) not wanting me (22F) to take antidepressants.",
        "url": "https://www.reddit.com/r/relationships/comments/b9yf8t/update_from_original_post_of_my_bf_24m_not/",
        "score": 3881,
        "num_comments": 125,
        "created_utc": 1554508402.0,
        "selftext": "Here is a [link](https://www.reddit.com/r/relationships/comments/89h4nt/my_22f_boyfriend_24m_is_very_against_me_taking/) to the original post.\n\n&#x200B;\n\nIt's been a year, \"Eli\" and I are both a year older now than before, imagine that.\n\n&#x200B;\n\nI began taking my antidepressants a few months after the original post was made. I went through more therapy to be absolutely certain that I needed the medication. My therapist used the same multiple choice test on my feelings and symptoms twice (pre-test and post-test) to determine that nothing had changed/gotten better really over the course of 3 months or so. I began taking 10mg a day of an antidepressant and sensed a change fairly quickly. It took 3-4 weeks to fully kick in, but I think I started feeling it around 2 weeks. I am so much happier than before and I do not think about my life ending 3-5 times a week anymore. Now that I write that, I rarely think about it at all now. The things that used to seem like mountains are now just little mole hills. I cannot fully express how I wish I would have considered taking medication earlier. I feel like I wasted years of my life being so disgustingly unhappy.\n\n&#x200B;\n\nJust earlier this week I broke up with Eli because I will be moving away for a job and I was no longer happy with the way the relationship was going. I still care about him immensely, and because I care about him so much I knew it was best to cut things off if I could not see the relationship progressing further after 3 years of dating.\n\n&#x200B;\n\nI'm super excited to start a new chapter in my life!\n\n&#x200B;\n\n**TLDR: Took meds, broke up with boyfriend. Feeling insanely better! :) Thanks so much to all who originally commented and gave me advice! Or tough love!**\n\n&#x200B;\n\nEdit: corrected text.",
        "permalink": "/r/relationships/comments/b9yf8t/update_from_original_post_of_my_bf_24m_not/",
        "comments": [
            "Hey I’m so glad for you. Congratulations on your new chapter and I wish you all the very best. Lots of luck on your journey. \n\nI just love it when people check in with a happy update. Thanks for coming back!!",
            "Congratulations on really taking control of your life! I wish I would have started antidepressants much sooner than I did. I feel like I could have spent so much less time unhappy and not moving forward. ",
            "I really needed to see this post. I need to get back on my antidepressants and my husband does not want me to. I’ve been off them the eight months I’ve been pregnant and have watched myself deteriorate. I can no longer take care of myself. That’s how bad it’s gotten. I won’t. I need to get back on meds and he just wants to find “another way.” I’ve decided not to listen to him for the rest of the day. He can talk about vegus nerve stimulation all he wants. I know what works for me and I’m gonna see a doctor. Thank you for your update. I’m so glad you’re doing better. ",
            "I really wonder what was going on with your boyfriend and the many depressed women in his life.  I wonder if the relationship with his mom was really codependent when she was depressed, and when she got better she put up healthier boundaries and he felt deserted because he wasn’t used to that.  Maybe that’s why he dated two clinically depressed women and disapproved of them being treated.  Not saying I don’t empathize - it’s hard when a fundamental relationship like that changes, but it sounds like he needs some serious therapy himself.",
            "Awesome update, congratulations!!! \n\nI’m curious what Eli’s reaction was when you actually started taking them. Did he get pissed at first and eventually see how positive it was for you, or did he continue giving you shit for it?",
            "Well there's your answer. He knew if you felt better you'd dump him. ",
            "Awesome update!!!  I’m SO happy you are taking the antidepressants.  There is a horrible uneducated stigma related to these meds.  \n\nI took them for Bipolar, BPD, and PTSD.  Life changing.  Seriously, I get what you’re saying that it started almost immediately.  It does.  It happens seriously fast.  I never knew I wasn’t like everyone else until I was diagnosed.  When I first took the pills and started to immediately notice the difference I cried.  Not because I was sad but because I never knew I could ever not feel so bad all the time with my emotions changing daily/hourly.  I stopped being suicidal and always thinking of ways to kill myself.  Every thing changed for the better.  \n\nGood luck with your move.  I think great things are coming your way and you deserve it!  ",
            "Hey OP. I relented for years and finally took them. Literally saved my life. The way I explain it is like if all your issues are 'jagged' anti-depressants just 'round' or 'smooth' them off. They don't go away, it just feels easier.\n\nSounds like the relationship was possibly dragging you down too. Good luck.",
            "Nine years ago on Mother's Day, I came back to the home I shared with my little brother. We'd had a fight that morning before I went to work and I got off early, so I went to his room to ask him if he wanted some of the food I was about to make, a sort of apology. He wasn't home, his shotgun case was open on his bed, and his suicide note was on his desk. Apparently, he had tried to kill himself with booze and pills, and had told an online friend (who lived two thousand miles away) that he thought he was going to die that day. When he stopped responding to messages, his friend managed to contact emergency services in our state. When they found him, he was jaundiced, unconscious, and unresponsive. He lived. I picked him up from the hospital two weeks later (with a prescription for pills that he never filled) and we cried together and I told him that I was happy he was alive.\n\nOver the next four years, there was one more attempt and a lot of threats of suicide. Felt like we were always walking on eggshells around him. He was part of the generation of kids who were overly diagnosed with ADHD and absolutely loathed having to take pills in general. But! He found a freaking FANTASTIC therapist and paired with (the right!) pills and therapy, I can happily say that he's living his best life. In fact, he's on a backpacking trip now and the only time it occurred to me that there might be a suicide attempt was when I was typing this out and thinking \"oh, man, we would have been almost sure he wouldn't come back from that five years ago.\"\n\nI am glad that you (and my little brother) have taken control of your mental health. It is something that, far too often, is seen as a punchline. But it is so, so, so very important. You've got this, OP. And that means one less person is suffering. And maybe more who, after reading this, think \"maybe, just maybe, the pills will help.\"",
            "I'm so happy your life is going well!!",
            "Omg. Happy for you. Eli is going to blame this on antidepressants.\nMaybe when all of the women in his life got happier, they realized that he wasn't good for their continued happiness. ",
            "He's probably going to add you to his list of women who took antidepressants and totally changed, you know...",
            "I’m so happy for you but be careful....certain antidepressants can make you feel better but then you notice your mood change again instantly (ex. Zoloft) if you feel the need to change meds, do it! Do what’s best for you :)",
            "I’m glad! The things he said about anti depressants was completely bullshit. Like wow. How ignorant do you have to be? I bet the girlfriend he had who took antidepressants before you, took them and improved her life and ALSO decided the relationship wasn’t for the best as well. \n\nThat might sound hard. But sometimes people can be selfish and o my think of themselves. Sometimes people don’t want you to grow. There are people who are so used to “something” always going on, that when nothing bad is happening, it bores them. \n\nWho knows. But I DO know you’ve made such a huge decision and you should be excited and happy. And you deserve it!",
            "Best decision I made for myself was seeking medication for anxiety and depression, it's like night and day the difference I feel in myself. Really loved reading your update and it's nice to see you're doing well for yourself and taking care! ",
            "My best friend started taking antidepressants, and what a difference.  Sometimes life doesn't play fair with our emotions. I'm glad we have antidepressants, so we can play unfair right back. \n\nThanks for sharing that you took the medication, I think that helps to normalize something which should really be far more common.",
            "I've got to speak up and say that the things you've related about your ex do not indicate that he was able to be a safe or supportive person or even be in a healthy relationship, certainly not with someone who experiences mental health issues- so the majority of people at some point.\n\nIt can be extremely difficult for patients & professionals to determine whether a patient's issues are due to their original problems or whether they are side effects or a result of a misdiagnosis or a medication not working as intended. Certainly loved ones can be valuable witnesses, but they also often have biases, like in your case.\n\nYour situation was pretty straightforward, honestly. And many antidepressants are among the safest and best understood of all psychiatric meds. His reaction(s) were extremely emotional and not only irrational- what he describes sounds much more like the issues they were *prescribed for*- but extraordinarily dangerous. \n\nThinking of hurting yourself is not mild depression, especially on a regular basis; I understand it can feel very normal and controllable, but it is a symptom of severe depression & can lead to either chronically self destructive choices or impulsively dangerous/self destructive choices.\n\nI'm sure you're pretty familiar with all this, since you're seeing a therapist. (I hope so!) But I just want to reassure you that you don't have to put up with treatment like that; you are definitely worth treating straight away. We have the technology and the understanding to care for you! And I want to celebrate with you that life is so much better, too! Hip! Hip! Hurray!",
            "[deleted]",
            "Good for you for getting the help you needed, and your new perspective. I too took that same test from my therapist, and took it again 6 months later after therapy and a daily dose of citalopram and was ASTONISHED at how much better I was. I almost couldn't believe my original answers to the test.\n\nSo happy for you.",
            "I put off taking anti depressants for 8 years because I had taken them when I was younger to no effect. I hate to say I truly wasted 8 years being stuck in my mental health, but I did, and when I started taking anti depressants it didn't take long to see the difference and I do kick myself over it. But I am so glad to be where I am now, and I'm so happy you're getting some where better :) ",
            "I'm glad you are thinking of yourself first. I needed to restart antidepressants (I should have never stopped them, to be fair) and my new boyfriend never said a word against it. He just wants to make sure I am happy and well. This is the mindset of someone you deserve on your side, OP. ",
            "I am so sorry about you ex and happy for your new life. Your ex is selfish. This is about you, your life, not his. \n\nI was suicidal and my antidepressants saved me. It is just like high blood pressure medicines or antihistamines. ",
            "Good for you! I’m happy to hear that medication has worked out well for you and helped clear the fog depression puts so many of us in! \n\nCongrats on your new job and congrats on making good choices!",
            "I'm happy for you and your new chapter in life! ",
            "I’m glad you’re doing so much better! I know how scary taking antidepressants can be but they really can help,they sure have helped me.",
            "That is so awesome for you, that you found something that helped you! My very good friend who has had bouts of depression his whole life, fell into one about a year and a half ago that we were all very concerned about. I'm not sure how to describe it, but you could just see the curtain coming over his face when it hit him, which it did constantly.\n\nHe was in therapy, and they tried various things, but eventually he got a doctor that looked at the drugs he was taking and realized they weren't giving him *nearly* enough of a dose of Prozac(? I think?) to make any sort of difference. It was like the difference between a 10 mg and a 40 mg dose, IIRC, something quadruple what he had been on.\n\nIt took about two or three weeks, but the final week he lifted out of his funk for first a day, then back, then a couple days later another lift, then back, and finally one morning he woke up and it was lifted and hasn't come back since. It's been about three months now and he's doing great.\n\nSo I've seen first hand the effect the proper medication can have on someone who's struggling, and I'm so happy you found what you needed and are moving forward with your life in such a positive way!\n\nGood luck to you!",
            "I’ve been thinking about you since your original post. I’m so happy for you and proud of you! Such a wonderful update. ",
            "Congratulations on everything and I wish you the best of luck. Be sure to know that if you ever need anything, the people of Reddit are here to help.",
            "Congratulations and best wishes in your new journey. ❤️",
            "Go you for making the choice that was best for you! And go you for feeling so much better! I love hearing other people's success in life, and I truly hope things only get better! ",
            "Good steps taken! Just read the op, looks to me he likes to date women who are fragile, and you becoming more secure about yourself is scary to him. Also, if you get dull from antidepressants you should try increasing dose or change/add something else. I'm on 2 types, one is making me dull but overall better and the second gives me more energy and interest in things. Don't be scared to change things when they don't work out. ",
            "Congrats! Antidepressants changed my life, and I know they're not everyone's cup of tea, but ya gotta do what works for you. Your mental health is so important, I'm glad you received the help you deserve!",
            "Congrats! I used to think about dying 3-5+ a day. I started antidepressants and it stopped as well. I no longer take them because i couldn't make my appointments and my prescription lapsed. I'm not as \"happy\" while taking them, but I'm stable and still don't constantly think about ending it all. Overall taking antidepressants for even just a year drastically improved my life. ",
            "[deleted]",
            "I'm glad you're seeing improvement. I wish you luck! ",
            "Im sorry it had to go this route for your recovery to succeed. I suggest finding a bf with depression too, they know how you feel better then other people and maybe you can help him too. Me an my girl love each other to death and one reason is because we both have severe depression (so we can sympathize) and we both can help eachother if we’re in trouble.\n\nYo btw the suns coming!! Whos ready for SUMMER???!!☀️☀️",
            "I’m happy you conquered it.  Depression is an absolutely terrible load to carry.  Out of curiosity, what is the medication you’re taking?  Did you try anything else before you arrived at this med?",
            "This post gives me a lot of hope! Me and my boyfriend are going through a “break-up” but can’t stay apart and talk all the time. I have treated him bad in the past because of how depressed I was and trauma from other relationships. I just yesterday started going to a new therapist and going to be taking a different set of antidepressants as the last ones did not change a lot.  I hope it makes me a happier and a less agitated and less angry person.. Much love to you, I can imagine its been a tough journey for you.. ",
            "Jesus, how dare you take doctor prescribed medicine to try and help your mental health! /s",
            "If you had a heart condition and needed to take pills to stay alive.\n\nWould you stop taking them if your NON DOCTOR boyfriend asked you to?\n\nIt seems more likely the medication cost a fair sum of money and wishes to save money\n\nby saying \" You don't need a mood elevating medication that cost 15 dollars per bottle.\"\n\nWhat most \" Normal \" people don't understand is that those types medication\n\nare uppers and give people the energy they need just to live day to day.\n\nPeople who say \" You don't need medication.\" are so utterly stupid they remind me of\n\nthe fools who think the world is flat.",
            "Just curious,\n\nWhat happens when poeple became too dependant on anti depressent?",
            "If you don't mind me asking, what are you on now? I'm always curious to know what works for other people. I was given Zoloft as a teenager and I fucking hated it because it made me a zombie, but I tried Prozac later on as an adult after I finally found a psychiatrist who would listen to me and not push Zoloft on me. Prozac did wonders for me, especially when I combined it with Concerta (extended-release Ritalin). ",
            "That sounds stupid. Every one is subject to time. Even those who are immortal.",
            "Just wanna say you gotta eat right too. Eating right helps a lot of these issues.",
            "Just my 2¢ from my experience. Unless you have tried everything else I wouldn’t rush to get on an antidepressant. If so, talk with your doctor and ask if you will experience withdrawals when/if you decide to stop taking them. SWIM was on smallest prescribed dose of Paxil and weaned off slowly and went thru terrible withdrawals. SWIM has also been thru opiate withdrawals from years of use (“people” say the worst) and it’s not the same, but still terrible. I’d just suggest seeking other options before medication, but go that route it absolutely necessary. ",
            "Just be careful what kind of meds you take bc some are really hard to get off of and can give you side effects but doctors never tell you about how you’re going to get off it. My dad had a really hard time getting off his "
        ]
    },
    {
        "post_id": "508aoi",
        "author": "lunchanxiety",
        "title": "UPDATE: me [14f] with school it starts tomorrow and I have no friends in my lunch",
        "url": "https://www.reddit.com/r/relationships/comments/508aoi/update_me_14f_with_school_it_starts_tomorrow_and/",
        "score": 3877,
        "num_comments": 144,
        "created_utc": 1472516713.0,
        "selftext": "Original post: https://www.reddit.com/r/relationships/comments/5026qi/me_14f_with_school_it_starts_tomorrow_and_i_have\n\nFirst off- thank you SO much for all the nice comments and stories of being alone in lunch. It made me feel so much better!\n\nThis is a really happy update!\n\nI ate lunch outside today and I was sitting alone when four girls approached me. They had that they had all moved from different states and countries, and asked if they could sit with me. I was prepared to eat alone or approach some people like you guys said- so this was a relief! \n\nOf course I said yes! And we really hit it off. We walked around the school after we were done and chatted. We made a group chat and agreed to sit together again tomorrow!\n\nThey're all really nice and I think we're going to be good friends.\n\nI'm really glad I made some new friends- I'm not that scared of high school anymore!\n\nThe only bad thing that happened is I lost my textbook! I looked everywhere for it but it's gone. I don't even know where I left it... I feel awful and hope my teacher isn't mad. :(\n\nBut all in all it was a great day- thank you for all the nice wishes!!!\n\nTLDR: lunch went great- four girls sat down with me and we are friends now. Sitting with them again tomorrow. I did however, lose a textbook the same day it was given to me and feel awful... \n\nEdit: thanks for all the nice comments! I was told not to worry about the textbook and got a new one :)",
        "permalink": "/r/relationships/comments/508aoi/update_me_14f_with_school_it_starts_tomorrow_and/",
        "comments": [
            "I didn't see anyone sitting alone yesterday- but if I do we will go up to them! We're all interested in expanding the friend group, cause why not?",
            "Hey this is so awesome! I'm happy for you, reading this update made my day.",
            "[deleted]",
            "Nice that you made friends. For the textbook, be prepared to reimburse the school. Your teacher can only help you so much by asking the class if they have your textbook or something.",
            "[deleted]",
            "Yay you! Great update!",
            "That's great! Now you have the opportunity to \"pay it forward\" by inviting others who you notice are lonely to join your group. Make it a goal to help someone else feel as good as those four girls helped you feel. ",
            "Good for you, OP! I remember being at a new school in a new town when I was around that age. You should invite the girls over or to the movies or something! ",
            "Dude, textbooks come and go. Meeting new friends is a momentous occasion. ",
            "I'm a guy in my twenties and for some reason your post makes me go \"aww...\" Good on you girl! It's always nice to meet cool new people, and without effort, hopefully you guys grow and learn together! High school isn't as bad as everyone makes it seem, really, I wish I had known that when I was there...\n\nBut I'm glad things worked out for you in the end and good on you for commiting to involve people who may be eating alone as well- as the loner type, I always felt glad when people invited me to hang out with them. :-)",
            "I missed your original post, but this is a good update :) I always had lunch anxiety in high school. I was a new kid when I started 10th grade, and if it wasn't for an extremely friendly girl who asked if I wanted to sit with her on the 2nd day of school, I probably wouldn't have made the friend group I made. That was 10 years ago, and we're still good friends.",
            "This is great OP!  I was thinking about you today!\n",
            "I met my two best friends this way. We've been through a lot of life since then. Enjoy your time together. Make mixed cds for each other, share lunches, draw silly things and send notes. Be goofy, try makeup on at the mall, share clothes and stick by each other through break ups and fights.\n\nHigh school is good times. I envy you. Good luck and have fun and of course, have fun learning!",
            "great job, great start!  best of luck on your high school journey.  Oh, to be 14 again...",
            "Love your update, so happy for you :) All I can suggest is the be the energy you want to attract! Enjoy the next four years of your life hun ♥",
            "Missed the original, but I was in a very similar position to you once. All my friends had lunch in the other building after some adjustments early in the quarter, and I was left with sitting with one other kid that I didn't know. Clearly, he was in the exact same position, and we had to implicitly promise to each other to not miss a day of school. Ended up being pretty good friends for most of high school, then he got kinda weird. I guess that's to be expected from time to time with someone in that position, but it could have been SO much worse. Congrats! You will now appear much less weird to your peers and casual passersby. ",
            "Glad everything worked out for you, but shame about that textbook. Those are expensive! ",
            "Yea!!! That's awesome!!",
            "Aww, I'm glad it went well. I remember being nervous on my first day, too. With confidence and kindness you'll do great, man. Glad things worked out! ",
            "This makes me really happy!! You've got a world of new friends opening up to you!! I'm so glad it worked out! I had forgotten how nerve wracking that was for me in a new high school as well!",
            "My freshman year i made no friends lmao! Good 4 u though. ",
            "This post made me smile. Good for you, OP! Glad it worked out and I hope you have a great school year! ",
            "this is touching to read.",
            "I remember when I was in 10th grade I was in a lunch period that no other 10th grader had, wtf right? My guidance counselor told me to make friends with the seniors... yeah okay. Thanks for the great guidance. I sat the whole year basically by myself. \n\nAfter reading that 4 girls came up to you to eat with you and that they all moved from somewhere different really made me smile big because I know that anxiety feeling. I had it way too much and blacked out sometimes. Yeah I know, I'm a loser",
            "The night before my first day of high school I started to really freak out thinking no one would be in my lunch, I just had a feeling I would be alone. I was correct. I found one other girl I knew and we ate lunch together everyday and made some friends down line. One of the friends I made knew a girl that I would end up being best friends with and who would eventually be my first roommate in college. She's invited to my wedding next year too. I'm glad everything worked out for you, I genuinely mean that. Good luck with everything :)",
            "Yay! I was hoping something like this would happen. I hope you make many more friends this year. We were all cheering for you!! <3",
            "I hate when I read a post by a 14 year old and realize that they have better punctuation than me. \n\nI'm glad you're happy and keep growing the circle, lady!",
            "Don't worry about the textbook too much. When I was your age I got myself so worked up over a lost textbook because they're expensive. I ended up finding it in a classroom. Even if you don't find it, these things happen. Things tend to work themselves out, just like you saw today at lunch! \n\nHave a good school year!",
            "Good for you! I remember doing the same thing when I was at school. If my group saw anyone sitting alone we'd ask them to join us. Not all of high school is that bad.",
            "Now I'm 22, so I'm not old and still have plenty of living and learning to do but if there has been a single most significant moment in my life that would shape out the next 8 years of my life it definitely came in the first week of lunch my freshman year. I came from a Catholic grade school to a public high school where 90% of the class came from the 2 public grade schools and most people knew each other for years prior. I had 2 kids from my grade school in my lunch so I sat with them but didn't mix well and was just awkward overall. One of the days that first week a kid from one of my classes invited me down to his table full of kids, instantly got along with all of them, he has since become my best friend and so did his group of 6 other kids. Idk where I'd be in life if that series of events had never unfolded ",
            "Yay! So happy for you! You're going to do great in high school! ",
            "Aw I was thinking of you this morning and hoped it went well! Glad it did! ",
            "Omg OP I am so happy for you! I wish you the best with high school and your new friends.",
            "Bless your heart, this was adorable. \n\nDon't sweat the textbook too much, it'll get worked out. My first week of high school was marred by a pop quiz in English that apparently it is tradition to flunk (the teacher likes to brutally inform new freshman that reading is now real homework), though we did not know that at the time. I look back on it now and grin. You'll be just fine, dear.",
            "Yay! I'm glad it worked out for you! ",
            "if your school has a bookroom where all the textbooks are kept be sure to check with them as well as with the lost and found. If they don't have your book be sure to ask if they have any copy you can use as a spare, some schools will keep textbooks which are quite damaged for this instead of throwing them away (if you cannot find yours you will have to buy a new one eventually.)",
            "Great to hear! Hope you have an awesome time at school.. and that a lost textbook is the most of your worries. (Ofc its better that you find it, but you know what I mean)",
            "I am so happy for you! I was a shy, awkward teen and I really felt for you. I was sitting alone in my new HS's cafeteria when a girl much more outgoing than myself approached me. We had actually been best friends in elementary school and lost touch when our parents moved us to different districts. We have been best friends again for over 15 years.",
            "Late to the party. When I was in college I ate lunch alone almost every single day. Unless my room mate was free. I never understood how people were there at tables with 8 people. How do people have that many friends on the same schedule every day!?",
            "That is awesome. School is all about learning and having fun at the same time. You and your friends hit it off on the first day and I can see you'll be friends for a long long time.  Well done and I hope your teacher doesn't get mad about the lost text book. ",
            "First make friends at school. Then the world!",
            "Haha this makes my heart happy :)",
            "hey, I'm really happy for you and I hope you have a great high school experience <3",
            "Disregard textbooks, acquire friendships! ",
            "Damn I wish I was this nice in high school. ",
            "This is friggin adorable ☺️",
            "This is awesome. I remember being in your shoes, it seems like something so trivial now, but I would be so anxiety ridden, just turned 24.",
            "Aw mate, I'm so glad for you! Coming from someone who's changed schools 8+ times and done the don't-know-anyone-walk-into-canteen countless times, that's a lovely turnout ",
            "This is so sweet. Enjoy these years of innocence my lad where your greatest worry is your lost textbook :)",
            "Being alone can open you up to new things. My friend took a vacation by herself and had a wonderful time. She met new people and she said it was the best vacation of her life. ",
            "So, this is how those rolling herds of teenage females are created. ",
            "Hmmmm.... so redditors in four different countries got together and sent four girls to make your first day at school work out like you wanted?  Not bad.\n\nThis is probably the best update I ever saw on reddit. You sound like a great kid with a great upbeat attitude and I think you'll be just fine on all the 'first days' of your life.",
            "Sorry to hear about your textbook leaving you. You should hit the gym, lawyer up and delete facebook.",
            "I made some lifelong friends when I got placed into a lunch where I didn't know anyone. Glad you met some people!",
            "why do you wanna eat friends for lunch?",
            "Aw, I'm so happy to see this update!\n\nI actually just had my first day back to class. I just started graduate school actually, so a little different from you. But I'm in a new city, don't really know anyone yet. But I got to talking with a girl in class, and we hit it off pretty well too!\n\nThis post isn't meant to show that first days and new things are always lonely, but rather you will face many changes in life and it's always possible to find new friends. I was super scared last night, even though I've done this new city/new school thing before! Your first post and your update encouraged me too, and helped me feel less alone. Thanks for that!",
            "Oh YAY! I'm so happy you had a great first lunch! Way to go!",
            "If you want to make more friends, join a social club at school.  You'll meet a lot more people having similar interests as you depending on what the club's focus is.",
            "I am so happy to see this wonderful update from your post yesterday! Good luck making lots of friends and enjoying your high school years!",
            "This story warmed my cold heart :)",
            "This is such a happy update, I'm really happy you found yourself a group of friends now. :)\n\nGood luck finding your textbook!",
            "Looking for people alone in class or lunch gave me some of my best friends. One of which I am still super close to from hs even though we're over 30! And one I went up to in college led me to one of my SOs.\n\nThere might be some jerks you run into. A couple girls that I reached out to bit back, so to speak. Don't let it discourage you from doing it, though, because they are never worth as much as the good ones you find!\n\nGood luck and be friendly!",
            "Nice! Have a good year at school. ",
            "Girly, you might have met your future best friends. When I was 15,I started at a new school. There was another girl in my choir class that was new too. We ended up chatting a lot. One day I just asked her \"Hey, I really like you, will you be my girlfriend?\" She politely said, \"Oh man, sorry, I'm straight.\" I replied, \"Me too! We have so much in common!\" \n\nWe've been best friends since that day. She got engaged today and she called me before her brother. She didn't even ask me to be her maid of honor. She just started complaining on my behalf. You can make a good friend here. Just go with it. I'm leaving out the year and a half we didn't talk. My graduation night she left me alone. Friendships have ups and downs, but you'll find someone here. ",
            "This is how great friendships start. Its been six years since I graduated and my high school best friends, are still my best friends. Even if we live in different towns. ",
            "Your situation reminded me of myself when I was 15 years old. I knew a few girls in my class, but they were all sitting together, they were quite cliquey. I felt lonely and awkward, but somehow I managed to go and talk to a girl who was also sitting all alone and I asked her if she wanted to sit with me. Today, 11 years later, I am the godmother of her daughter :) ",
            "Awww yay! Groups from all over make great friends. I'm so happy to see your update. ! That's such a great result to have them come up to you!!! \n\nI actually moved from my hometown to another state and could not for the life of me make any friends there. I'd take my little one to the playground and everyone was standoffish. Went to a story time at the library and found a group where everyone was from elsewhere. Met some of my best friends. We all banded together since the locals were so weird and cliquey. ( it was high school all over again ) ",
            "this literally made me cry that is so great for you.\n\ntextbook wise, you can try and retrace your steps to find it. the school might have an online textbook though (for whatever class) so you would be able to use it. but i would definitely check the lost and found and with the teacher to see if you can get another one or if you can find it. best wishes!",
            "I'm glad it went well for you!!!",
            "This is exactly how I met one of my very best friends. Ten years later we are closer than we've ever been! It is pretty amazing the things we could miss out on if we stay in our comfort zones. Good for you for being open to making new friends and enjoying the process. ",
            "I was so glad to see your up date. Sounds like you and your friends are going to have a fun, exciting time at school! Your an awesome person, don't ever forget that!",
            "Hurray! Great update! I had such feelings of anxiety starting high school.  I was very shy so worried about talking to people not my friends.  Sounds like you were able to break that barrier! Good for you! Have a great year with some new friends!",
            "I loved highschool. I went into highschool knowing a handful of people in the grade ahead of me and only 1 other person from my middle school. I wasn't really scared and really wanted to make new friends. I genuinely miss seeing all the friends I made in highschool every single day. I'm 23 now and I rarely see my 2 best friends because we are all so busy, and only talk to a handful of some other highschool friends. Cherish your highschool time and make as many friends as possible with no fear!",
            "Eh, the textbook, they become useless in about a year, don't worry lol. Congrats ",
            "i wish reddit existed when I was a kid to give me advise. Good news and best of luck to you op",
            "This is so nice to read, glad it worked out OP",
            "I was really hoping to find a positive update to this one.  I'm so glad it worked out for you!",
            "Nice!\n\nGood luck in school!",
            "This is so cool to see Reddit help someone young with this problem. High school was so depressing and scary for me sometimes and it made me happy to see someone be helped with their worries of high school. I hope everything keeps going well for you!",
            "You're awesome. When my stepdaughter moved in with us, and changed schools, she ate her lunch in a bathroom stall for two months.\n\nSo, go, you.",
            "Maybe someone turned your textbook into the office or teacher that has that class?",
            "wow! i'm happy for you! wish i had people like that when i was in school and eating lunch alone",
            "Wow so glad you met those girls! Sounds like you might have been lucky enough to fall into a ready-made friend group. Congrats on starting school",
            "Hey, F 22 here. Best thing I can advise you is not to take anything in high school too seriously. Not the people, not the studies, and certainly not yourself! Make sure you're passing your classes, and everything else will fall into place once you get to college. \nMost of the friends you make in high school won't be your friends once it is over. It is just how it is. Focus on doing the right thing and being the best you you can be! Sorry if this was off topic, I just wish someone had told me not to take things so seriously. I made my own high school experience a living hell!"
        ]
    },
    {
        "post_id": "36d73i",
        "author": "nayahs",
        "title": "UPDATE! I found out my boyfriend's [19M] surprise present to me is to take me skydiving. But I [18F] have a crippling lifelong fear of heights. What do I do?",
        "url": "https://www.reddit.com/r/relationships/comments/36d73i/update_i_found_out_my_boyfriends_19m_surprise/",
        "score": 3880,
        "num_comments": 273,
        "created_utc": 1431955317.0,
        "selftext": "UPDATE TO http://www.reddit.com/r/relationships/comments/36618q/i_found_out_my_boyfriends_19m_surprise_present_to/\n\nWell, I've had an eventful 24 hours.\n\nSo to recap: on the 16th, my best friend Sara, who is friends with my boyfriend Alex, decided to warn me that my boyfriend was going to take me skydiving for my birthday, to which I completely freaked out about.\n\nSo I read through everyone's responses. Towards the end I was watching videos of first time skydivers over and over again, trying to psych myself up to do it, since I decided I'd probably regret it if I didn't go (even if I had a panic attack on the way there.)\n\nAlex came over the night I posted––I didn't mention the skydiving to him exactly, but I did reiterate and try to explain how bad my fear of heights was––and he was acting rather odd about it. He understood it completely, but just smiled and said, \"Don't worry about it, we'll get through it together.\"\n\nHe then took a really quick exit. I tried getting in touch with Sara, but she wasn't picking up her phone; she just texted me to come over at night.\n\nSo later that evening (on the 17th, the day before my birthday) I went over to Sara's, who lives in the same building as me. A few of my girlfriends/future flatmates were there. We chilled for a while, I talked about how terrified I was to skydive but that I'd decided I would give it a try. Sara had a weird, half-amused look on her face, and just replied, \"Oh it'll be over soon! He just wants to help you get over your fear!\"\n\nThen around 11 PM I got a random text from Alex telling me he was coming over. He came over to Sara's and the two of them couldn't stop giggling. At midnight on the 18th they both wished me a happy birthday… then Alex said, \"So, Sara told me you already know what I'm going to get you.\"\n\nTo which I replied, \"Yeah?\"\n\nAnd then Alex said, \"Well, in about eight days, we're going skydiving from the highest drop in Europe.\"\n\nI started visibly freaking out at this point. Alex and Sara burst into laughter. Then Sara said, \"Fuck, I can't keep this up anymore, I feel so bad. We're joking. We wanted to scare you!\"\n\nAlex grabbed my hand and he said, \"Of course I wouldn't take you skydiving! I don't want to kill you! We just really wanted to fuck with you since we knew you were catching onto us… Your real present is around the corner.\"\n\nSo I looked around the corner and there was a fishtank, all set up with a couple exotic fish, a heater, and a filter (just like I wanted)! My babies are safe and sound and I'm not getting pushed out of an airplane, reddit!\n\nHe apologised profusely and said (since a few days earlier I was beginning to to catch onto the idea that they were getting me fish) that he wanted to make sure my present was a surprise and that he had no idea how deep my fear was. He said he was extremely sorry he'd ever caused me to freak out like that, but that he was never planning on taking me skydiving.\n\nNow Alex is taking me to the Natural History Museum and we're gonna go for bubble tea and pancakes. I'm thrilled to pieces. This has been a really good birthday.\n\n**TL;DR: I'm not getting pushed out of an airplane. Instead I get adorable fish. I love my life.**",
        "permalink": "/r/relationships/comments/36d73i/update_i_found_out_my_boyfriends_19m_surprise/",
        "comments": [
            "Thank you for cheering me up on a gloomy day.  I hope you have a fantastic birthday and your fish enjoy their new home.",
            "That is not where I thought that your update was going. Yay!!",
            "I'm so glad him and Sara weren't banging.\n\nOn that note, yay good boyfriend! Happy birthday, OP!",
            "That's awesome! I'm glad things worked out with you guys.\n\nAnd I gotta say, there have been a lot of posts lately about people's SOs pulling really shitty/mean pranks, and this is a situation in which the prank was actually pretty good. He can say he \"got you\" but he also takes the opportunity to re-affirm that he would never actually make you do something like that, and it all ends happily with fishes and a great birthday. \n\nSounds like you guys have a pretty good relationship! Keep it up. :)",
            "WHY ARE THERE NO PICTURES OF THE FISHES?!?!",
            "Aww that is so good to hear! I'm glad that he knows you well enough to avoid something like that, and it sounds like he has a sense of humour to boot!",
            "Yay! Much better present. I was really worried when I started reading this update. I hope you'll stop by /r/aquariums soon and show us your adorable birthday fish!",
            "Happy birthday! \n\nNext year you can go skydiving!",
            "Glad it all worked out! Is your new tank cycled? If not, do lots of water changes at first or the fish might die. /r/aquariums can give more help. ",
            "Excellent!  Happy birthday!",
            "I awwed so hard.\n\nBut it's interesting.  It sounds like you maybe learned that you might want to confront your phobia sometime.  Maybe not in a *forced* way though...",
            "FWIW, getting pushed out of an airplane (more like stepping out and getting pulled backwards) *is* an amazing way to conquer a fear of heights.\n\nI did it 3 years ago, and I was horrified in the plane on the way up, it felt like such a rickety thing and I had to put my feet out on the landing gear outside of the plane and lean backwards with the tandem instructor to 'jump' out.  \n\nAnd the moment I was out, my fear was gone.  I knew the tandem cable would hold, I knew my instructor had done this over ten thousand times without incident, I knew the chute would open because I watched him pack it meticulously.  I was just enjoying the freefall, the huge view.  I actually forgot to do my part in it and tuck my legs, so we fell a little faster than we were supposed to (instructor was not amused).  \n\nAfter that experience I don't feel the least bit of fear when I am in 'high up' situations.  But, I did this on my own, by my own choice, and was not dragged into it by others.  Keep it on your mind as an idea and do it if you decide it is worth doing.",
            "I have to wonder if that fish tank has been cycled. They usually take a month to establish the right bacteria load and chemical levels. If the fish bite the dust that'll be why - though maybe he's been cycling it in secret.\n\nHappy birthday!",
            "Well this is just adorable.",
            "Happy birthday! That's fucking hilarious, OP, I'm so glad that it was all bullshit and now you can enjoy your fishies without the fear of being dropped from an airplane!",
            "Happy ending! YAY! ",
            "Happy birthday. Terrible joke but good way to distract you from the fish",
            "Happy birthday!\n\nI'm so glad I read this, I'm so glad it worked out like this! This is an awesome update.",
            "I'd be furious if my SO made me anxious as part of a long running joke.\n\nGlad you're happy with how it worked out.",
            "Get that sweet karma at /r/Aquariums ",
            "Oh Christ, how fucking adorable",
            "FWIW, most people who have done tandem diving will tell you the height thing isn't a huge deal. You're high enough there's no sense of depth anymore -- you're just looking down on a flat painting that looks like the ground. You don't get a real sense of height until you're maybe 1000' up under the canopy. And at that point you've still got enough adrenaline to not care. \n\nIn case they decide to surprise you for your 21st birthday or something!",
            "Awesome! Were you at all disappointed that you don't get to jump out of a plane?",
            "You should have done it. Facing your fears is terrifying but afterwards is one of the most satisfying feelings.",
            "OP! You should take him sky diving for his birthday. (You can stay in the plane)",
            "I also have a big fear of heights... but for whatever reason I really want to go skydiving :|",
            "I took my sister skydiving.  She was afraid of heights too and was freaking out on the whole way up (to include the drive).  Right at the door of the plane when they were going to jump, she put her feet against the sides of the door and pushed back to keep the instructor she was attached too from jumping.  \n\nThe instructor being completely used to this, slapped her legs closed and jumped out of the airplane.  I was next to go and off I went.  It's completely surreal to be so high up and detached from the Earth.  I'm falling, but I don't feel like I'm falling (you don't get the funny feeling in your stomach).  You just feel the wind and see this massive planet flying towards you.  It was completely intense, but so calm at the same time.  I really don't know how to explain it better than that.  Once I got to the ground, my sister completely covered in tears (of joy and fear, haha) ran over and hugged me.\n\nI bet the amount of people who regret going skydiving are few and far between, and it's probably one of the safest thrill seeking hobbies around.  You have a higher chance of getting hit in the car on the way home than you do getting injured jumping (at least with a tandem jump).\n\nSpeaking of dangerous things that's not skydiving... On my way home I had so much adrenaline, that I was ready to fight two guys twice my size.  I'm a tiny guy too, and a huge pacifist, but that adrenaline....  It was a good day.",
            "Since you mentally prepared yourself to do it, you should just go for it. ",
            "Your boyfriend is such a butthead, in the best way possible. Happy birthday and enjoy your fishies! I'm not sure where you live, but my boyfriend is really into fish as well, and there's a great store in Essex County, New Jersey if that's anywhere near you.",
            "Thanks OP. Now i want pancakes and bubble tea...",
            "YAY!! Ok - so now we know he's a keeper :)\n\n\n*Nana internet hug*",
            "Thought you were getting a threesome. ",
            "Oh my gosh, that is so cute. Glad he decided not to torture you.",
            "For his birthday, you should take HIM skydiving. Save the current courage you had until now for then. Who knows, mid-ground scenario maybe you get over your fear and your boyfriend lands terrified of heights.",
            "Wow. Your \"friend\" and boyfriend seem like douchebags. Using your worst fear to freak you out for days? You were scared enough to ask a bunch of strangers for advice. Why do people think shitty pranks like this are funny? They intentionally stressed you out over a period of days for no reason. Fuck them both, they owe you huge apologies.\n\nETA: wow, there are so many people here who obviously don't have phobias because it's in no way \"cute\" to cause you the anguish that they did.",
            "D'awwwwwwwww :')",
            "oho! Nice prank! Happy for you OP, also Happy Birthday!",
            "Yay! What a sweet boyfriend and friend :) Enjoy your fish tank and birthday!",
            "Fish tanks and a museum!  I like this guy.  Seriously.",
            "On the one hand, I'm glad he did actually get you what you want, but on the other hand, he caused you a great deal of unneeded anxiety, and not only that, your friend was in on it.  She knows how afraid you are of heights, and yet she participated in this...\n\nI think they were both being major dicks and I'd really rethink things, personally.",
            "yay fish!!!",
            "But no bunny? :(",
            "Sure is nice to see someone's hopes and dreams not getting crushed for once. ",
            "Happy Birthday! Sounds like you have an awesome boyfriend. Enjoy your day!",
            "He's lucky you have a good sense of humor.",
            "glad everything worked out in the end for you. But as someone who also has a fear of heights and has been skydiving, it was one of the best experiences of my life. it was definitely scary but once you jump out it's not nearly as turbulent or scary as you think, I felt as if I was under water lol floating through the sky",
            "Happy Birthday <3 ",
            "This was such an adorable read. Glad you didn't get shoved out of an airplane! Congrats on the fishy too~ :3 Happy birthday!",
            "hahaha brilliant",
            "I can hardly imagine the feeling of relief you must have had the moment you found out you didn't have to jump out of a plane.",
            "Wow, sounds like you have an awesome boyfriend and a good friend for them to go through the effort to make your birthday special! It's nice seeing pleasant updates on here. ",
            "I smiled so hard I split my chapped lip.  Totally worth it.",
            "Are you me? I love my freshwater fish tanks, natural history museums, tea time and will never skydive. I like you. Let's be friends. ",
            "That's so cute :3",
            "If it helps I have pretty bad fear of heights but skydiving was actually fine ",
            "Who has bubble tea and pancakes? That's crazy. ",
            "BEST UPDATE EVER!",
            "Maybe the fish wanted to go skydiving?",
            "What is the deal with bubble tea?",
            "i just wana see a photo of the fishys",
            "Marry him.",
            "Thank God!  There no way in hell I would go sky diving. I was going to say how awful your bf was to even think of doing this knowing how afraid you are. I'm happy for you that it all worked out and it was a joke. The fact that you even entertained the idea of doing it makes you a super hero!",
            "So long and thanks for all the fish! ",
            "I'm glad it worked out for you but as someone who ALSO has terrible fear of heights (I can't even get on a fairly smallish ladder without vertigo) I have jumped out of planes twice (once in the military and once right after) and have flown a lot. I don't know, I guess at those heights my brain doesn't comprehend the distance. Too abstract.",
            "Fuck you and your happiness!!\n\n\nJust kidding.. I am really happy for you.. Awesome bf and awesome friend!! Cherish them!!",
            "Go through all the steps, know his family well, know that his priorities are in line with yours.  That said, this action suggests that he is a real keeper.  You might go skydiving for your 50th anniversary...",
            "Messing with you was a pretty dickish thing to do, but it looks like it worked out ok. I'm glad you're happy.\n\n(Still, I was really hoping your post was going to be \"I went skydiving after all and it was awesome.\")",
            "Statistically. You have a higher chance of living by jumping out of a plane with a parachute. Than staying in it.",
            "Glad it worked out!  Guess he does listen to you!  I stand corrected.",
            "As a side note, what is bubble tea?",
            "This actually happened to me for my 31st birthday from my then husband. Blindfolded drive out and everything. I cry from going up too many stairs, so flinging myself out of a plane was never something I ever entertained as a viable fun afternoon out. I went through with it, and truly enjoyed my experience. Would do again!",
            "I would have had my pants down right after \"we just wanted to fuck with you\"",
            "If you're serious about him, take him skydiving as the next gift to him. It will show how you are willing to expand horizons for him.\n\n\nPlus if you don't die, your fear of heights can always be tempered by, well, this isn't nearly as high as that time I willfully jumped out of an aircraft",
            "Keep him. Jesus Christ, keep him.",
            "You should take your fish skydiving.",
            "Your BF is the king of the trolls :)",
            "Whew. I'm also terrified of heights and there's no way I'd jump out of a plane for fun. I need a couple of drinks just to get on the damned thing. ",
            "Best. Update. Ever! :D happy birthday x",
            "Go do some indoor skydiving! It's rad.",
            "Get to the ground as safely as you can.",
            "Yay for fishies!",
            "Nova?",
            "You should go scuba diving with him.",
            "I did this for my girlfriend and i was a little bit nervous.  Dont be!  You dont get the drop feeling like you do on a rollercoaster.  You can barely tell you are falling and that took the scare out of it for me.  I promise once you do it you will fucking love it! :)",
            "Happy Birthday,  nayahs!\n\nlol, no one figured it out, reddit failed for ones. Kudos to your BFF for getting an awesome present and out smarting redditors :)",
            "Now I feel like shit for saying what I did in  your original post.  I take all of that back.  Your boyfriend is awesome.",
            "YAY! AQUARIUM BUDDIES UNITE, YAY!!",
            "What a keeper :)",
            "Insert \"everything went better than expected\" meme here",
            "But this is a good outcome, don't you need therapy or something?",
            "And then he'll force you to skydive INTO the fishtank\n",
            "YAAAAAY! What a cheeky turd but all can be forgiven for fish, bubble tea and pankcakes, YAAAAY!",
            "My aunt is also, but she loved it when she went. I think she went like three times the next month. Everyone's different though",
            "Dammit, go skydiving anyway :)",
            "D'aawwww\nThis is probably the first time that I consider a post about height anxiety cute.",
            "HA! This is great! Love that you psyched yourself up by watching skydiving videos, omg so adorable.",
            "This sounds incredibly fake",
            "[removed]",
            "I had a tiny thought he might be messing with you, but then I figured I was watching too many romantic comedies. :) I'm glad you're not going to get pushed out of a plane after all. Happy Birthday!",
            "Keeper. Grats, OP!",
            "I say face your fears and take skydiving lessons with him!",
            "Im deathly afraid of heights and so claustrophobic that I can't even ride in an elevator, but I was a paratrooper in the Army and I still skydive a few times a year..one of the most exhilarating experiences you can ever have.",
            "This is one of my all-time favorite updates. I'm so happy this worked out, OP!!",
            "Man I just read the first thread and it made me so sad to see everyone ripping on your boyfriend when he clearly had positive intentions. I'm so happy that it was all a joke and it sounds like he did what he could to make amends for freaking you out so badly.\n\nSounds like a solid dude. Happy birthday and enjoy your fish!",
            "Whether you are scared of heights or not it was a dumb gift. Sky diving isn't something that you spring on someone... It's something that you should WANT to do and prepare for. Your boyfriend isn't the sharpest tool in the shed.\n\n\nEdit\n\nI meant to post this on the original post. Glad to read her boyfriend isn't as much of an idiot as I thought.",
            "I'm glad this worked out.\n\n\nIn other news, I'm now horrified that if I ever play a prank on a girlfriend, that shit is going on the internet",
            "BEST UPDATE EVER! Surprised the top comment isn't someone asking for pics of your fish. ",
            "As someone with a knee-buckling fear of heights who went skydiving, let me assure you that it sucks just as bad as you thought it would.",
            "Remember, it's not the feat of heights that is crippling.  What is crippling is falling from a very great height.  Broken legs, paralysis, that sort of thing.  Good luck.",
            "Hah, your boyfriend is awesome. ",
            "He's a keeper!",
            "You guys are seriously so cute and adorable haha. ",
            "In all seriousness though, you should totally try to work up the courage to face your fears and go skydiving. I did about a year ago and I would 100% recommend it to anyone else. The plane ride up to your drop zone is quite terrifying, but once you finally make the leap, all your fears are washed away because it's such an amazing experience. Plus, your instructor helps you along the way and makes the whole thing very easy.",
            "I have a fear of heights and went skydiving, you missed out because it was incredible!\n\n**EDIT:** Love you, Reddit.",
            "tell him",
            "That was cute as hell I'm smiling",
            "You should of forced him into skydiving. You would get to face your fear and get over it which would be good for you.....and you might force the fear into him.",
            "In the long run you'll regret not skydiving. ",
            "For what it's worth, I was afraid of heights my whole life. I was really into snowboarding and it was a problem for me, it really cut down the amount of cliffs I could drop & jumps I could stomach. I went skydiving as a way to conquer my fear, and it worked.\n\nThere was never a more terrifying moment than standing in the open door of a plane, seeing the ground below you in those square plots you see outside the window of a commercial jet. There was never a more satisfying moment than the seconds I after I jumped.",
            "Skydiving is not heights. It is distance. There is a difference.",
            "[Serious Response]\n\nDo it.\n\nHe is trying to help you with something that you have told him that you are having a problem with. The best way to get over a fear is to show you that there is nothing to be afraid of, by exposing the reality behind the fear.\n\nHe cares enough for you to think of a way to help you conquer your fear. You should go with him! Jump and do it, that way you can say that you can. \n\nYou won't necessarily be unafraid of heights afterwards, but the fear should definitely be lessened. ",
            "Hey if Alex is ever single...wink wink. ",
            "Now turn it around on him, start crying about why you didn't get to go skydiving in Europe. ",
            "Damn, I am kinda bummed out you didn't actually go skydiving. I was kind of hoping for a story about surmounting paralyzing fears. OP, you should seriously consider going skydiving with him just to get over it. You would be strapped to an instructor in tandem, so you wouldn0t even have to think about anything. I seriously think it would help you to begin to think more rationally about your fear, rather than let it keep running a part of your life.",
            "If you want to stop being scared, just jump. ",
            "Bitch",
            "Skydiving in Europe at age 18? How did you fall for that?",
            "If you love him you will go and say thank you. If you cant overcome that then you wont last in a marriage.  Just my opinion!",
            "[deleted]",
            "Fuck him til he can't walk,  if he makes a noise, give em a bj,  make sure he can't even Blink! ",
            "You need to go anyway. Exposure therapy.",
            "Suck it up or don't go."
        ]
    },
    {
        "post_id": "53w447",
        "author": "secondwife9",
        "title": "My husband [44/M] told me he wished I [37/F] was dead instead of his first wife. I'm devastated.",
        "url": "https://www.reddit.com/r/relationships/comments/53w447/my_husband_44m_told_me_he_wished_i_37f_was_dead/",
        "score": 3876,
        "num_comments": 415,
        "created_utc": 1474500770.0,
        "selftext": "My husband \"Nick\" was married to his first wife \"Vanessa\" for 5 years and they had two amazing kids, \"Luke\" (15/M) and \"Lila\" (13/F). Sadly, Vanessa died in an accident 11 years ago when the kids were very young. I started dating Nick 8 years ago and we started off very slowly for obvious reasons. Nick has always been a little more distant than anyone I'd ever been with, but he and the kids lost Vanessa so young that I understood it. \n\nAfter 3 years of dating, Nick asked me to marry him and I moved in. I've always had a really great relationship with Luke and Lila and they were happy for me to marry their dad. I had wanted an actual wedding, nothing big, but Nick really didn't want one so we got married at the courthouse with just Luke and Lila present. We had a really fast engagement, but it worked for all of us. \n\nI have loved being Luke and Lila's stepmom and officially adopted them after I found out I was pregnant with our son \"Casey\" (2/M). The kids have been so great with Casey and help out so much. Nick was wonderful during the pregnancy and had always been a really loving dad and husband. \n\nBut Nick has been pulling away a lot the last few months. He's been even more distant than usual and working late nights and going away with friends almost every weekend. I've tried talking to him, but he's been impatient with both me and the kids. I found out I was pregnant in June and am now 21 weeks pregnant with a girl. The kids are excited to have a little sister, but Nick just seems so indifferent to everything and everyone. He's been missing soccer games, Lila's birthday, doctors appointments, etc. Casey is too young to notice, but Luke and Lila are so hurt by their dad's absence. These kids are so good and they lost their mom so young and I'm infuriated that Nick is ignoring the kids like this. \n\nLast week, I finally sat Nick down and told him that he needs to stop disappearing and be more present in our lives. We're going to have another child soon and before we know it Luke and Lila will be grown up and going to college. After an hour of arguing, he screamed at me that he wished Vanessa was still alive and that I had switched places with her and died instead. He also threw in some awful comments that I need to stop pretending I'm Luke and Lila's \"real\" mom and that I'm only half the mom Vanessa was. The final straw was him saying that he never even wanted any kids with me, but did it so I'd \"keep busy and leave him alone.\"\n\nI'm so beyond hurt right now. I know I'm just his second choice, but I've always tried to honor Vanessa and tell Luke and Lila how lucky they were to have her as their mom. I love ALL of our kids more than anything and I'm just so heartbroken. Nick barely pays attention to Casey now and doesn't even acknowledge the pregnancy. He somewhat apologized this weekend and took all three kids to lunch, but he won't even look me in the eye. He seems like he wants to talk, but he doesn't say anything and I'm too upset to even be near him. \n\nI'm not sure where to go from here. Honestly, I can't even be around Nick right now and if there weren't any kids involved, I'd leave and never look back. I'm not sure if he's cheating or the thought of a fourth child is stressing him out, but I'm devastated and not sure how or why I should save this marriage, besides doing it for the kids. Any advice is desperately needed right now.\n  \n  ---   \n  **tl;dr**: My husband has been distant and ignoring our kids. When I confronted him, he told me he wished I had died instead of his first wife and that I'm only half the mother she was. I'm currently pregnant and not sure how to fix this or us. ",
        "permalink": "/r/relationships/comments/53w447/my_husband_44m_told_me_he_wished_i_37f_was_dead/",
        "comments": [
            "Oh man. This is so fucking heart-wrenching, and I honestly just want to give you a hug right now. You've got so much on your plate.\n\nIn your shoes, I think I would tell him that he has a choice between therapy and divorce. Get *yourself* into therapy as fast as you can- you've had your heart shattered by someone you love, you've been parenting alone, you're facing the possibility of a divorce. Even if you do couple's counselling, individual therapy needs to happen.\n\nMy only other piece of advice for you is to not leave the house. If it comes down to it, leaving can affect the divorce. Actually, no, I have another piece of advice for you- consult with a divorce attorney now, even if you're not sure you're going to go through with it, to get an idea of what you need to do during this period.",
            "He's has 2 kids with Vanessa and he's going to have 2 kids with you. Do you think he feels resentful because his new life is 'taking over' his old life? I can imagine that it hurts him tremendously to realize his ex wife is a distant memory and I can see how your new baby will serve as a physical reminder of how the years have passed. This could be a huge stretch.. I'm just speculating what my concern would be if I was in your husbands shoes. Its possible he feel very guilty and disloyal because he moved on and built a new life so he's lashing out on the person who helped him build this new life. You. \n\nI do want to say what you've done is amazing in that you helped to rebuild a home without disrespecting their bio mom's memory and I have no doubt you've been an awesome mom to your children. You do not deserve such hurtful words and whatever his reason I don't think I would be able to forget them. I really hope the best for you guys.",
            "He is looking at the past through rose colored glasses, a 5 year relationship that tragically ended years ago. It can be easy to forget all the times you were frustrated with a person.\n\nIt takes work to stay in love, to merge a family, to help people through deep heart-rending grief. For him to say that you aren't half the woman his first wife was is cruel.\n\nWho knows how Vanessa would have dealt with a partner who is being cruel and terrible like your husband is? You are competing with a memory.",
            "One thing that sticks out to me is that your child is 2 and that 11 years ago your stepdaughter would have been 2.  I wouldn't be shocked if a milestones like that has kicked up a lot of feeling about her death. Since this behavior has started up, have there been any other milestones (kids birthdays, deceased wife's birthday, their anniversary of dating or marriage, when they found out they were expecting, etc) that could have exacerbated any issues he was having?",
            "There has got to be something else going on. Honestly, it sounds like you are describing affair behavior. Late nights, distance, missed opportunities, disappearing every weekend, blaming you. There has got to be something else going on. ",
            "Your husband sounds depressed. He is disconnecting from everyone, his perception is skewed, his emotions are volatile, he isn't logical, he is irritable. \n\nSounds like his mental health has gone way downhill. I would have him talk to a doctor. ",
            "Not sure I could come back from that comment. Plus it sounds like there's something else going on. ",
            "[deleted]",
            "My husband lost his first wife. He used to get kinda upset around anniversaries or important dates. But after while, that stopped. He got help, he moved on. \n\nHe never, ever said anything so horribly hurtful to me. As a spouse to a widow/widower, I think we always have insecurities about measuring up to the deceased spouse. To have that thrown so awfully in your face? No. Unforgiveable. Especially since he refuses to apologize or offer to seek help. \n\nOP, I know you are in a very bad place right now. You're pregnant, and trying to keep it together. You can do this. \n\nThe way I see it, Sir Buttface has 2 options. Which you can present as you see fit, if at all. \n\n1. Grovel, apologize and seek immediate therapy.\n\n2. File divorce papers. \n\nObviously, this what I would do and you need to decide how you handle it. But for me, that level of cruelty cannot go on. How this ugliness ends is up to him. \n\nIt certainly seems possible he's having an affair. I would bring it up. \n\nIt seems more possible he's having some hefty issues that he is dumping on the rest of you. That isn't fair. \n",
            "OP he said he wished you were dead. That's scary as fuck especially if he's emotionally unstable right now. I don't know how any amount of grief or depression could excuse that or how you could ever work past what he's said. You've also said you know you were never his first choice, your husband of eleven years shouldn't make you feel like that. Don't forget need hiring the kids too. If you're worried about losing the kids, I also just wanted to add (because a lot of people have wronf ideas about adoption) you will get custody of you fight for it, because they're legally yours. Good luck, you're a great mother and person.",
            "He's had it hard losing his first wife, yes. And perhaps it's stressful and painful for him and that is, of course, understandable. \n\nHowever, I cannot imagine a situation where it is EVER acceptable to tell your loving spouse that you wish she was dead instead of your late wife. This is beyond childish, this is not okay no matter what he himself is feeling. \n\nBeyond this he only KIND OF apologized? \n\nIf you let him get away with this kind of behavior now without repercussion or action then you're only going to become his emotional punching bag. \n\nI'm not saying you need to leave him right now, but I think you should seriously consider the possibility that this relationship is not good for you. \n\nYes, he clearly needs help of some sort, but you are not obligated to just sit back and let him treat you like garbage in the meanwhile.",
            "My mom died and my dad remarried. If he ever said this to my stepmom I myself would disown him, forever, until he offered the apology of a lifetime that showed full self awareness and shame. Grief may be the explanation for his actions, but it is not an excuse, whatsoever.\n\nI want you to internalize this: everything that's happening is a reflection on who he is, it says nothing about who you are. At all. His memories are outweighing reality, and his lack of self awareness about this has caused him to lose a complete grip on everything, to the point of cruelty.\n\nIf I were in your position the next thing I would look forward to is the day you and him behave civilly for the sake of your children, with all other vestiges of your relationship kept in the past where they belong. (But I'm just an outsider with limited info who doesn't actually have to live your life so what do I know.)\n\nI'm sorry he did this though. Sincerely.",
            "My first thoughts were guilt and fear.  OP, you're having kids at the same age gap as the first wife and it feels like history is repeating itself. Nick is so fucking terrified that he'll have to go through that loss again, but at the same time, building a new life feels disrespectful to Vanessa. So, he lashes out at you so he's not losing you, he's choosing something else, and absolving his guilt about moving on at the same time. \n\nAll obviously a god awful shitty fuckface thing to do to his wife. Absolutely not an excuse, and OP, I can't tell you what course would make you happier long term. What I can tell you is that if I die and leave my young children without a mother, there is nothing I'd ever want more than for my babies to be loved as you have taken in Luke and Lila. I 1000% promise you that if Vanessa were able to, she'd be raging at and disgusted with Nick even more than you are.",
            "I could never forgive any of this. I'm so sorry. He took a shit on your lives together. He invalidated your *children* and said they are *unwanted.*\n\n>I can't even be around Nick right now and if there weren't any kids involved, I'd leave and never look back.\n\nDivorce. Do you have family that will take in you & the kids for a short time? Do you have a job? There is nothing to save here. Even if he's not cheating, he has already gone past the point of no return. He does not respect nor love you. Nobody would say something like that to someone they loved. That you're a bad mother? That he didn't want the child that is already here or your the one you're pregnant with? I can't fathom saying something so cruel. Run.",
            "Go to therapy for yourself. Demand that he goes to therapy as well. There is no saving your marriage if he isn't committed to at least trying to save it.\n\nYou should also consult with a lawyer about your options, particularly what happens to your step-kids if you were to divorce. Whatever is behind all this, he mistreated and neglected them too. I don't know that he would be a successful solo parent if the worst came to the worst.",
            "Do NOT stay for the kids. That is the worst thing you can do.\n\nAnd yes, you are Luke's and Lila's \"real\" mom. Vanessa is their \"real\" mom. Vanessa can't physicallly take care of her babies any more and I'm sure she appreciates/would appreciate you taking on that role. They deserve to have a mother, even if she was taken from them. ",
            "This isn't behavior you work through, this is just someone you leave. He isn't coming back.",
            "You need to start keeping track of everything. How often your husband is around, his erratic behavior (with times, dates, witnesses like if the kids saw/heard anything) any drinking or reckless behavior because if you get divorced these poor kids should not be left with him while he's going through whatever the hell he's going through.  \n  \nI'd say therapy now (individual and/or couples) or you serve the divorce papers before the year is out. I don't know how you could recover from him saying that shit. Good luck. It sounds like you're an awesome mom.",
            "After that revelation there really is no saving this marriage. As hard as it is to hear it seems he hasn't been emotionally present in this partnership for many years. I personally don't think theres anything left to salvage at this point. Im Sorry. Best of luck with the rest of your pregnancy.",
            "Nick sounds like a real douchebag to be blunt. He doesn't realize what he has. I'm sure he's beyond hurt still from his first wife but he shouldn't have ever went forward with any of the steps in life that he has with you if he wasn't able to put forth the emotional effort that you deserve.",
            "Don't stay with him just because of the kids.",
            "God, I don't even know what to say. You sound like a wonderful person and I can only imagine that wherever Vanessa is, she feels immense gratitude to you for loving her babies as her own. I can't even imagine. If I were you, I would consult a lawyer and ask them what the best course of action would be in case of the worse case scenario so that you and the babes are safe and protected from any legal action. First thing to do before that though, would be to ask Nick if he's open to therapy for the two of you, and for the whole family, maybe even some grief and coping therapy for them. Is the anniversary of her death approaching? Maybe he's acting out because of that, and the thought of a new baby might have him feeling grief over the fact that he feels it should be with Vanessa? Maybe he feels guilt over her death. I'm not sure, this is all from an outsiders perspective! \n\nEdited: truly I'm unsure if he's cheating, that wasn't even in my mind until I saw the comments. I feel like maybe he's feeling an overwhelming amount of grief or stress. Not that that justifies what he said to you AT ALL though, and you definitely need to make a statement to him that he was in the wrong for that, and that Vanessa is gone. As far as you and the kids are concerned, and even in eyes of the law since you adopted them, they ARE your damn kids. And you clearly love the hell out of them. He needs to shape the fuck up or get the hell out. You don't deserve that. And I do feel for his grief. It's so hard to lose someone you love. But you can't let the past define and control your future. He needs to leave the past behind before he gets lost in it and forgets what really matters now.",
            "Whatever is going on with him, be sure to document everything. Aside from its usefulness in the case of a divorce, having a timeline of things and it being written down may help him see how bad his behavior has become.",
            "Are his parents alive and in the picture? Or siblings? Could you try talking to his family and mention he's been acting strangely and see if they have any clues for you?",
            "my sister told me she wished i had died instead of our other sister\n\nwe don't talk much anymore ",
            "This has nothing to do with you. It sounds like he's had a recurrence of his grief, maybe he's feeling guilt about \"moving on'. He needs to deal with this, go to therapy and apologise profusely. I wouldn't blame you if you couldn't forgive him though.   \nI feel like he probably didn't mean any of those things he said, but they were coming from a place of hurt. Still not acceptable at all though. I lost my partner too, I have one child with my late partner, and I'm now married and have another child with my husband. Personally, I have never felt like I wished I had my late partner instead of my husband. More like \" oh, I wonder how my life would be if John hadn't died\", not wishing I had one over the other.  And if I did, I sure as hell wouldn't tell him that. There is no point even thinking those things, it seems like he hasn't dealt with his grief properly, and it's not OK to take it out on you. That, or he's just a major asshole. ",
            "According to the law, you ARE  their \"real\" Mom. You adopted them. End of story. ",
            "Here is what I would do. I'm not saying this is what you should do, I'm not saying this is the healthiest thing to do. But as a mother facing a survival situation with four children, including an infant, and a man who has revealed himself as my enemy who really would prefer I would just disappear, this is what I would do.\n\nFirst, I would give him room to backpedal and restore the relationship to a superficially friendly footing without any big discussions or analysis or apologies or revisiting the argument. I would say I know some awful things were said in the heat of the moment the other day, but I want to put them behind us because we have such a good life together, and I don't want to discuss it, I just want to get back to normal.\n\nSecond, I would give him space to do whatever bullshit he wants to do, whether it's to avoid day-to-day life, have an affair, or whatever. I wouldn't ask where he's been or where he's going. I'd handwave his absence with the kids (\"You know how busy Dad is, Lila. He works so hard for us.\") I would become so pliantly accepting of his bullshit, as long as it isn't actively imposed on me, that our home life would become relatively serene.\n\nThird, I would get my ducks in a row while the younger children progress to school age and the older ones get to the moving-out stage. Get a qualification, get some money together, do some part time or volunteer work to get references and become employable, all that. Get all the papers together you'll need for the divorce. Start building friendships and a social life that are outside the marriage.\n\nFourth, when the older two move out and the younger two are at school, I would get the hell out.\n\nHe's played a long con on you, OP, so I would play one on him. Otherwise you're going to spend the next few years in custody battles, being villainised for trying to take a poor widower's kids, and struggles to rebuild your financial and professional life, and he'll probably fight you for custody of children he doesn't even want in order to avoid child support. It will suck big time no matter how you do it, but in your shoes, I would play it smart and come out with the least pain I could, for me *and* the kids.",
            "I don't really know what to say about your situation, but I'm also 21 weeks pregnant with a girl, so my heart goes out to you having to deal with this AND a pregnancy. If you'd like someone to talk to, consider me a friend. I'm sending positivity your way for you and the kids (especially the little one in the oven).",
            "Are your kids, mainly Casey, as the baby is not born yet, near the age that Luke and Lila were when Vanessa passed? \n\nHe could be regressing and building a defense without knowing, because his marriage with you may be in a similar place to where his and Vanessa's marriage was before she passed.\n\nThis indicates that he didn't properly cope with her death, and often traumas can resurface regardless of external circumstances. Even if timing isn't similar, I would think this has to do with inability to cope with her passing. ",
            "[deleted]",
            "Honestly? It sounds like he might be cheating... You know why I have that feeling? \n\nBecause if this really was about Vanessa, like he says it is (and all he said was cruel so please do not take it at heart), he would be holding on to his kids with Vanessa like there was no tomorrow. \n\nIf this was about Vanessa and the past life, he wouldn't be ignoring his first two kids with Vanessa. Not in a million years. \n\nThey are the last real and tangible connection and memory with Vanessa and he is treating them like nuisance? \n\nRight. S/\n\nSomething else is going on there. And that something else smells like an affair. \n\n\nEdit: Also, the attitudes you describe he has been showcasing as of late, are textbook affair actions. ",
            "I would guess that your husband is NOT cheating on you. He's in pain. He's trying to put distance between himself and the people who love him. But you present a problem. He can't easily withdraw from you. His cruel words are tools to get you to \"go away\" on your own. He's deliberately playing the role of the \"bad guy\" because it's expedient to that end.\n\nI've done the same in personal life. I lost a child (not mine biologically but he was a son to me). I wound up leaving my marriage and children behind. I had zero self-worth. I was satisfied with being hated. I actually thought it was best for all involved. Anger can be empowering, so I let my family hate me.\n\nI came close to suicide, which is also easier when everyone hates you.\n\nI'd worry about your husband. Try not to take his words to heart. It sounds like he's on the edge of something very bad.",
            "So basically you're telling me that he was married to his first wife for 5 years, they had a son and then two years later a daughter, and then just two years after that his wife died in an accident.\n  \nEventually he recovers and marries you, you love his children like your own... and then you have a son, and two years late you're pregnant with a daughter... what happens in two more years? \n  \nMaybe the deja vu is making him feel like he's going to lose you, so in his fear he's pushing you away so he doesn't get hurt again. That doesn't completely justify his action, wishing death on you is still terrible even if it's because he's so scared of it happening. It's like he's trying to use reverse psychology on Fate.\n  \nHe really needs therapy again, and you need to tell him he does, if he wants to save this marriage.",
            "He's either very depressed and needs therapy and possibly medication... or he's cheating.",
            "Please post an update when you leave him.",
            "There is no justification for his behavior. He crossed the line. BIG TIME. If you want to reconcile with him, ask for couple therapy.\n\nFrankly, you are the bigger person and he doesn't deserve you. ",
            "Every time I think I've seen the worst scumbags humans can be, another one comes along... Whatever his issues, the way he is taking them out on OP is... ",
            "You deserve happiness just as much as he does. Anger often creates regrettable actions. If 'you' want to salvage your marriage because you want to, then find out if he wants to as well. Neither of you should stay together for your kids, this just delays what is wanted 'now' and can create an unhealthy environment for your family. Time apart may help to see things differently. I would be devastated to have been told those things - this is on him to atone 100%. No matter how much mending he may still need, he was wrong to say those terrible things. If he wants out of your marriage, he doesn't have to tear you down in the process. I'm so sorry this happened. ",
            "You know, it might also be a good idea to get your husband to see a doctor. Sometimes sudden changes in mood or behavior can be the result of something like depression or even a tumor. \n\nI agree with what the majority of people are saying. All you can do at this point is prepare yourself for the worst and trust that whatever happens is for the best. ",
            "I'm not gonna say whether you should or shouldn't stay with him or pass judgement on him as a person or a father.\nI will say losing people is hard. Losing your wife and mother of your children is unbearably so.\nHowever no matter how hard the loss is , it does not excuse that. Nothing does. There is certain things that can be excused for grief. Wishing death upon your wife and comparing her to your old wife the way he did is unacceptable.\nHe needs to know, whatever you decide to do from this point onwards he can't be let off the hook for that.",
            "Lady, I don't see how you come back from this. Remember that you have officially adopted Luke and Lila. You're seen as their mother in all legal ways. You are entitled to some form of custody. I'm so so sorry. Good luck.",
            "He doesn't deserve you.",
            "You are repeating the kids like his wife in the same order. \n\nSon, daughter like his ex-wife. Maybe he is panicking because of that  ?\n\nMaybe you remind him of the past(because of the 2 kids similarity) or because the situation is very similar to back then when he lost her ?  ?\n\n ",
            "Holy shit he said he wished you were DEAD!! I wouldn't be able to move past such a disgusting comment from someone who's supposed to love me",
            "Sorry, but for me, this would change everything in a relationship. ",
            "Besides the death thing, the worst thing he said was that about you not being the kids real mom. I'm sorry he said that. It sound to me like you ARE their real mom. You chose to mother those children when they needed you most. That was a noble and loving choice. ",
            "People can say awful,  hurtful things in the heat of the moment.   And Nick said the most awful thing he could.   It sounds like you two have had a good marriage until recently.   Something is happening in Nick's life that is having a drastic impact,  and he isn't sharing that with you.   It's causing him to withdraw from you,  your marriage and the kids.  You and the kids are suffering because of whatever is happening in Nick's life. \n\nIs that a fair synopsis?  If it is,  then it is so important that you find out what is going on with Nick.   If you can get him to communicate with you about that,  then at least you'd know what you are up against. It could be anything,  right?  Work pressures,  midlife crisis,  an affair,  drug addiction,  etc.  Whatever it is,  you need to know.   Maybe you and Nick can accomplish this first step on your own,  but I'd recommend marriage counseling.   By yourself if he refuses,  but preferably together.  A really good counselor can help you both work through the mess,  find a foundation to rebuild on,  and repair the marriage.   Also can help you with the decision to end the marriage if it comes to that. \n\nJust from personal experience,  the not being able to look you in the eye.... I do that when I am horribly ashamed of something I've said or done.   I think it's possible that Nick is regretting those words and is sorry and ashamed of himself.  He just hasn't been able to gather enough courage to actually express that yet. \n\nGood luck to you and your family. \n\nEdit: after reading the other comments,  I totally agree that your marriage is sort of repeating what happened to Nick and Vanessa.   Love,  marriage,  a son,  a daughter..... And then the loss of his wife.   Could it be that he sees the parallel and is subconsciously afraid that he'll lose you,  too.   He might be distancing himself to protect himself from losing you.   \n",
            "What crossed my mind is he might be scared of losing you like he lost his first wife after they had children. Perhaps your pregnancy is bringing that to the front of his mind and he isn't good at communicating his feelings leading to his blow up. It could also be depression, maybe suggest couples counseling, if you don't think he would seek help alone. Another thought that crossed my mind, could your husband be using drugs? Some of the things you said made me think of someone hiding substance abuse. \nI'm sorry he said something so cruel to you, it's definitely uncalled for and if it gets worse or continues into abuse ( even verbal abuse however this was said in the heat of the moment and is out of character for your husband) please don't hesitate to remove the children from the home (you did adopt them) and leave until he gets sorted out. ",
            "First I'm so sorry you're going through this.  \nIs it possible that having your children possibly bright back unresolved issues he had from losing his first wife as it seems your youngest is about the same age your older children were when it happened?  I may be reaching but it seems like he's never dealt with things properly and now having another son and daughter with you might be reminding him of the past.  ",
            "I feel like I'm missing a lot of the details, still.  It feels like he just became like this overnight, and just switched personalities entirely.  There literally has to be something else, because I almost don't believe someone who is married for a good amount of time could say that to their spouse without any history of abuse.",
            "He has to be out of his mind to have said something so horrible to you of all people. I'm guessing it's stress-induced based on what you've written- no history of alcohol or other substance abuse? How is the financial situation? Job security? Notice I'm not jumping straight on the affair-train.  \n\nY'all both need therapy stat. You need support and he needs third-party professional help. \n\nThen couples sessions with another counselor or each of yours. You've got a lot of little ones dependent on you both and you deserve to be happy and feel loved. xoxo",
            "I have no advice but if U were ever to die I hope my son could have a step mom like you. YOU SOUND AMAZING and selfless and kind. ",
            "My dad talked that way to my mom once. It's an extremely immature thing. Very childish and primitive. Like a schoolyard insult. He is a very sick man. ",
            "Honestly, it sounds like some pretty serious depression. He could be cheating on you, but I think most likely he's hitting midlife crisis age and thinking back on a lot of stuff that maybe he never properly dealt with.\n\nI'd say that line about talking to a therapist or a lawyer, his choice. If you even want to forgive him that is- I don't know if I would after someone said something that hurtful to me, personally. Either way though OP it sounds like you're a great wife/mother. Trust your gut and do whats right for you and the kids",
            "You could suggest couples therapy to find out if he has \"checked out emotionally\"  or something else.    Sometimes when a partner \"checks out\" emotionally they start avoiding their partner and eventually becoming resentful for no good reason.  Even when a partner does that its another thing to wish someone is dead!  With his previous history it could be more complicated.",
            "So, maybe your husband is having some issue with emotional baggage from his first wife, or maybe it's some other emotional issue.   But I doubt it.  He's not that deep.  \n\nYou said you looked at some bank or credit card statement, yes?  I'm not buying that he's going places \"by himself\".   He's married with 3 kids and one on the way.   WTF is he going to be \"by himself\"?   And if he gave you some bs about too much chaos at home and he needed some quiet time I'm still now buying that.  \n\nDon't forget, when men get scared, they get angry.  \n\nSo he was avoiding you and the kids and when you confronted him, he lashed out.   He's hiding something, don't chalk it up to some vague emotional issue up in the sky somewhere that you can't see.   \n\nI also think your husband is jealous of the attention you're receiving for being pregnant.   That's why he most likely is doing whatever he's doing.   He's lashing out to make you go away so he can get everyone to feel sorry for him and soak up all the sympathy.   Yea, she left me, I was such a good husband to her, blah blah blah.   Except this time your kids are older and know what's going on.   If he is having an affair, it doesn't mean you have to split up.  But you need to know for sure.  \n\nCheck his phone and his email.   ",
            "Does he drink frequently?  Anything going on at the job that may be adding extra stress?",
            "I hated reading this.  I really hope nothing but the best for you and all children involved. ",
            "Grief is possibly the most terrible weight to carry around - it poisons and changes people to the point of being nearly unrecognizable -- if unchecked or unsupported (professionally). \n\nGrief may have pushed him too far and made me say and think and feel those awful things.. He needs help, he needs therapy. He needs to put Vanessa behind him and realize what is in front of him, while still being able to keep Vanessa's children balanced and recovering as well.\n\nAfter my mom's suicide when I was 25 and my youngest brother was 7, our family grief therapist taught us many things about grief. One thing in particular was that we will all re-live her passing at various stages in our lives, more so for the 7 year old but us adults as well. This very well may apply to him, too.\n\nTackle the grief therapy, and hire a PI to see wtf he started doing in his time away from you. He's probably depressed and being an asshole about his grief by pushing away the people who love him most, and very possibly cheating, too,.. somehow.\n\nDon't engage with him, remain aloof and pretend his actions and whereabouts don't bother you to keep the drama to a minimum, grab a few therapy sessions for yourself, and maybe some for the kids too - grief is huge and can drown entire families - protect yourself and the babies, and get yourself the support to remain present and supportive for all four kiddos. \n\n",
            "Honestly, you aa SHOULD be his first choice by now. It's been long enough. You have a child and one on the way. You shouldn't feel second best anymore. I'm just so sorry any of this happened.",
            "To be honest I would never be able to forgive someone who said that. I'm so sorry you ever had to hear that. I don't really have any advice, I'm just kind of mind-blown.",
            "I lost my mother very suddenly when I was 23 years old, and if I found out my dad ever talked to his girlfriend the way your husband is speaking to you, I would be LIVID. I can't even begin to imagine how you feel. Your husband obviously has something serious going on. It sounds like he's either having mental health issues or having an affair. You need to get him to therapy asap. Those children are beyond lucky to have someone like you who cares about them. ",
            "I know your husband is going through a lot, but that's probably at the top of the list of the worst things you can ever say to your SO. He's got two choices - therapy or divorce. ",
            "There was a fantastic book written by a Laura Munson called \"This is not the story you think it is\". Her husband tried to explode the family one day when he was 45. She realized that he was generally unhappy with his life and having an adult sized temper tantrum. I recommend reading it. \n\nJust going off what you have said here, I think your husband is hurting and having a temper tantrum of his own. Think of the thousand of ways he has shown you over the years that he loved you and your family. He is hurting and was trying to hurt you as well.  It still sucks even knowing that, particularly since he stabbed at your insecurities. \n\nI would suggest individual and couples counseling for both of you. Communication and patience are key if you want to save your family. ",
            "Jesus you're a saint. If my step mother treated me half as kindly as you treat those kids, or even loved me half as much, my high school years would have been incredible.\n\nI think everyone else here has already given you enough constructive advice, but I really wanted to just say that you have a good heart, please don't let these shitty circumstances change it. Your husband doesn't deserve your kindness, but in the future, I hope, you encounter someone that isn't so distant and truly lets you in. ",
            "Still young. Leave him. He doesn't deserve you",
            "Counseling, OP. Personally, I would have smashed him in the face, but that's me.",
            "Sounds like he may be cheating.\n\nEveryone else has given all the advice I'd probably give, but honestly-- don't let him bring you down by saying you're not their \"real\" mother. You may not be their biological mother, but you've practically raised them! You are their real mother, don't let anyone tell you otherwise!",
            "He's cracking. Get him in therapy STAT. In the meantime, I would take the kids and leave until he gets his mental shit together. Just to be safe.",
            "Your husband needs to fucking get over Vanessa.   She's been dead a long time and sounds like he's been with you for even longer than he was with her.   Life goes on.  Why shit on anything good you have because you suddenly feel like Vanessa was the better wife?   Maybe he can't deal with having so many kids, maybe he cant deal with many things but none of them are your fault, or your kid's fault.   He's beyond a douchetastic asshole and I think it would be a dealbreaker for me.   Wish me dead?  Fuck you, I took on your children as my own and loved you with all my heart, and you wish me dead?\n\n\n\nFuck it take all his money and kids so he can go have that fucking life he wishes he had.",
            "I'm going to give your husband a provisional pass. He said some terrible things, but he's under some terrible stress.\n\n I would speculate that he's had this building inside him, grief, and rage, and even anger at himself for trying to be happy with his wife dead. It's possible that you just tore open the festering wound, and let out all the nasty shit inside. Sometimes, after an event like that, one can look at themselves, and see how much trouble they are actually in. I hope your husband can do that.\n\nIn order to qualify for the pass, he needs to (preferably unprompted) apologize to you. This would indicate that he has, in fact, looked at himself, and realized that he took out his hurt on you, and that it was wrong.\n\nAdditionally, he needs to go to some kind of therapy, or counseling, or someone, and talk with them about his feelings. Let him go on his own, or go with him, but this isn't couple's counseling. This is him needing help to heal his own injuries.\n\nIf he refuses either of those, then things may not be salvageable.",
            "Leave this marriage for the kids.",
            "Just want to give you a virtual hug, I'm 22 weeks with a girl too. One preggo hug to another!",
            "I don't have much to add besides what people have already said. So just came here to tell you what an amazing mom you are , he's so lucky to have you besides him . Hope he wakes up and realises it .",
            "Regardless of the outcome, I can't imagine coming back after his comments. Not sure what level of abuse and doormat status you're willing to accept, but you husband needs a serious reality check and a major apology that requires probably years of commitment and action to repair. ",
            "I am honestly so sorry you are going through this. You seem like an incredible mother who is giving unconditional love to three (soon to be four congratulations!) children! You mentioned that you know you are just his \"second choice,\" but I don't feel like you, someone who seems so kind and loving, should settle or be comfortable for just being someone's second choice. It is unfortunate \"Luke\" and \"Lila\"'s mother has passed away, but that in no way makes you secondary to who she was. You are a completely separate entity who has given nothing but care to your new family. Please don't sell yourself short- you seem wonderful. Best of luck with your situation! ",
            "Could this be a health issue? Brain tumor, mental health, etc..? ",
            "your son is approaching the age one of the kid's was when his first wife died. me thinks he is concerned it might happen again...and lashing out. could be wrong.",
            "Have him go to a therapist because he might be suffering from depression. Get him diagnosed or ruled out. FYI depression is something that is very difficult to cop to. Don't force him to therapy but suggest strongly that he go. You should also go to therapy your own self, and maybe even marriage counseling. If he isn't willing to really try, really make an effort to atone for his hurtful words, there is probably no saving your marriage. ",
            "If I was in your situation, I would be just as frustrated as you are. \nI would get so hurt, that I wouldn't even be able to be in the same room as him, talk to him or look at him. I would choose a divorce. \n- Those words were extremely mean! I wouldn't even hesitate to leave him. So many parents get divorced now days, which proves that it is possible to make it work without living together. ",
            "Could it be that you are on your second child with him (one girl/one boy) and it's all too similar to his first relationship and he's either afraid that something is going to happen to you and he's going to be left with all 4 kids or it's just bringing all the memories and trauma back from his first marriage? \n\nIf that is the case, I personally don't think that's a \"get out of jail free\" card. I would be expecting he either gets himself some therapy as well as couples therapy and make some changes or that's it. If I'm honest, I don't think I'd feel his words could be taken back if I were in your position so I would probably already be looking at the most amicable way to split. My focus would be the smoothest transition for the children. If you do split, do not remove Luke/Lila from your life as it'll be like they've lost a mother all over again. They are old enough that you can speak a bit more openly and explain what's happening (obviously don't bad mouth their father even though it may be hard as it's ultimately his words/actions that's done this, but try to be as honest and upfront as possible and be available to speak with them and spend time with them if they need/want it).\n\nI am so sorry this has happened to you and the kids. Doesn't hurt to consult a divorce lawyer (some do free consultations) just to understand what options you have, even if you don't go through with it. ",
            "Wow.  I wish I had something constructive and positive to say to you but in your shoes, I'd be so angry I'd have bashed him with a frying pan like some fishwife in a cartoon.  For real.  My god.  I cannot imagine your hurt and anger.  I do not even know what to say to you except I am so sorry your husband did this.  What a jackass.  \n\nI will say though, this is not on you to fix.  This is his damage and this is entirely on him to make amends and fix if indeed it can be fixed or saved.  He better crawl, and crawl through broken glass to get you back.  I understand he had a loss, and a trauma and he's grieving, but grief and trauma doesn't excuse you hurting and abusing someone else like that without provocation or cause because of your pain.  It just doesn't.   My guess is though, he married you to get a mom for his kids.  And nothing more.  And the reality of that is crashing down on him now. I'm sorry.",
            "I feel as though if he really cared, he wouldn't have been ok with just a courthouse wedding knowing u wanted better. I feel like he tried to forget the love of his life who died but realized hes stuck with the 2nd prize and is tired of it.",
            "Were your kids Casey's age when his first wife died? Could he be having some kind of flashbacks, or maybe having repressed feelings and memories come up?\n\nYou should demand couples counseling. I know he went through a lot but that is no excuse to treat you and the kids like shit.",
            "What on earth. You should leave him asap. It's never okay to tell  your partner that you wished they'd be dead. You should not accept this and get out of this relationship.",
            "First - on phone so please forgive formatting\n\nSecond - you seem like a wonderful person and I'm very sorry you're going through this. \n\nI'm sure my thoughts will be buried but I wish you all the best anyway \n\nMy fiance has depression and very early in our relationship he said some unreasonably cruel things to me. Specifically designed to deal the most damage. I stopped talking to him. I had never been around depression before and had no idea how it really manifests.  It was a particularly bad episode. When he came out of that one, he was apologetic to me but didn't grovel or beg me back. He took time to explain how depression works - I did some reading too - it's scary stuff. It's a complete inability to feel - for him it made him feel almost powerful - he could hurt me (with words) and there would be nothing I could say to hurt him back. But also, in that mindset, he rationalizes that I'm better off without him anyway so if he hurts me and makes me leave, he's doing me a favor. \n\nReading about your husband reminds me a LOT of the time. I'm NOT a psychologist so I can't diagnose him but I would bet good money there is some mental health issue happening - others have suggested PTSD too. \n\nI came back to him on the understanding that a) I did not trust him (at the time) and he would have to deal with the consequences of that breach of trust and b) he needed to actively seek help. \n\nTo this day, he knows that I am here to support him as long as he continues to actively manage his disease. I also told him he gets 1 \"depression made me say it\" card - and he's used it up. I won't stand for being torn apart like that again. But, so far with his active management he hasn't hit another low point like that.\n\nNot everyone can stay with someone battling mental illness and if it's not something you're up for its not a sign of weakness on your part. It's exhausting supporting my fiance at times - and sometimes the knowledge that he may never get better makes me want to quit. But I love him and and I will support him *as long as* he's trying to help himself as well. \n\nIf I were in your shoes I would basically lay it out - therapy (individual AND couples) or divorce. I'd meet with an attorney to get your ducks in a row before making any kind of ultimatum because reality is - he may chose divorce. Like an alcoholic - you can't *make* someone seek help for their mental illness, but you don't have to stay and watch them destroy themselves either. \n\nYou seem like an amazing mom, and an amazing human being. Whatever choice you make I am certain that it will be a good choice and will come from a place of love and selflessness because people like you aren't capable of making selfish choices. ",
            "People in this thread are being a little hasty in suggesting there's an affair going on. There's no evidence to suggest that, particularly when guilt over his dead first wife is a plausible explanation for his withdrawn and erratic behavior.\n\nOP, I would recommend you and your husband seek therapy if you want to save the marriage.",
            "One thing I haven't seen mentioned is that it sounds more like depression than an affair.  Being distant, irritable, saying mean and hurtful things all sound like depression.  \n\nMen in particular are taught they don't get *depressed* so they tend not to talk about it when they feel down.  Anger is the easiest 'go to' emotion. \n\nI really feel for you - and honestly the whole family.   You must take care of yourself and I seriously agree that therapy for yourself is needed.  \n\nJust be mindful there is more than one possibility for the behavior. \n\nWishing you the best!",
            "I would be so gone. I can't imagine the feeling of knowing my husband would want such a thing. How extremely cruel. Even if said in anger omg wtf.",
            "I am really sorry this is happening to you. ",
            "Therapy or divorce. I push for the latter. Saying something that was purposefully trying to hurt me in such a horrible way is completely disgusting. I'd hate myself if I stayed with this person.",
            "Sometimes it's better to break up for the kids instead of letting them watch you fight and be unhappy for years. What he said is seriously not okay and you should try to get out as soon as you can. I'm so sorry this has happened to you and I wish you the best. Keep us updated. ",
            "Vanessa never had the chance to be twice the mom you are, so your husband said that to be intentionally cruel. \n\nHe sounds like he is in another period of deep grief and is handling it poorly. That's no excuse. He needs to get help and you need to protect your 3.5 kids because if he were half the parent Vanessa was, he wouldn't be bailing on them. ",
            "This sounds like a combination of two people I know - one lost his wife almost 10 years ago in a car accident when their one child was ten months old... the other is a clinically depressed alcoholic.\n\n\"Working late nights and going away with friends almost every weekend\" says to me alcohol and/or addiction. \"He screamed at me that he wished Vanessa was still alive\" sounds to me like something you say when you're self-medicating your depression with alcohol.\n\nDid he get grief counseling years ago? I'm guessing not and that grief is now taking over.\n\nHe needs an intervention. He needs to be told that if he doesn't get therapy immediately, he has to go away.\n\n",
            "He is probably feeling extremely guilty.  You are having a girl, two years after you had a boy- the same exact thing he did with Vanessa.  He could even be almost reenacting what happened to him.  He could be fearful that he will only have you for a few more years.  He needs counseling.  This isn't an excuse to say reprehensible things to you.  I would also consult an attorney because he may try to sabotage the relationship.  You need to know what you need to do in case this does go south.  He needs to know that how he is treating you is not ok.",
            "I hate to be that person, but I never fuck with widows. Problems like these almost ALWAYS seem to come up in the future. And honestly, if I were the widow, I don't know if I'd be strong enough to move on. And how would I really know when I'm ready? It's a tough situation to be dealt in life.",
            "Could he be having a midlife crisis? Or maybe he is reliving his past with his first wife?? The going out and ignoring his children along with his treatment of you is not cool. I'm with the others, make him fess up, go to therapy or GTFO.",
            "As concerning and hurtful as the outburst is, the longer term pattern of being distant and uninvolved in the kids lives is, IMO, the bigger issue/red flag.  There's definitely something major going on and we can only speculate as to what it is.  I'd create the right moment and say something like \" Hey, I know that you are a great father and husband and your recent distance/uninvolvement is way out of character for you. Is there something going on that I can help with even if that help is to just listen and help you feel like I've got your back?\"    If you think it's appropriate you could even involve the kids in the conversation.  But I'd definitely frame it it terms of \"I/we are worried about you\" not in terms of \"hey we need x from you.\" ",
            "This was really hard for me to read because this is the kind of behaviour I know I sometimes pull on my loved ones.\n\nIf Nick is anything like me, then he is significantly, significantly depressed and the inexcusable vitriol he has spewed at you is not how he truly feels, but part of a self-destructive spiral.  When I become very depressed (which has happened relatively often throughout my life), I tend to lash out at everyone who cares about me in an unintentional attempt to sabotage any good relationship or happy thing I have in my life.  I don't know why I do this, and I also can't stop myself once I'm set on that course.\n\nFor your sake, I hope that your husband is reacting like this for similar reasons, because I cannot imagine someone being so cruel in earnest.  Whatever happens--and that may include disrupting your family with divorce proceedings, depending on Nick--I hope you can hold on to the knowledge that your children love you, and that Luke and Lila truly appreciate you as their \"real\" mom because you ARE their real mom.  So was Vanessa, but you are, too.\n\nI am sending out as many good vibes as I can muster because I truly want this situation to work out for you and your family.  It sounds like you have all had a very rough go of it, and you all deserve to be happy.  And you, OP, deserve to feel loved, appreciated, and supported by your husband and partner.",
            "It would appear that the husband is still grieving for his first wife.",
            "OP - have you and your husband been married for 5 years. Going by your timeline, that seems to be the case but I just want to confirm. He lost Vanessa after 5 years of marriage and I'm wondering if the time-frame is triggering some grief. \n\nI went through an awful and traumatic breakup a few years ago after 6 months of dating my ex. And in my next relationship with a different person, I found myself very anxious and depressive at the 6 month mark.  \n\nBut as others recommend, therapy can't be suggested enough. Regardless of if the 5 year mark is triggering his behavior or not. ",
            "I'd say work to save it. I can't imagine losing a spouse suddenly but a distant friend of mines husband was murdered by a random idiot, just wrong place wrong time, they had a young child and it's VERY VERY VERY hard even yeeeeaaars later.\n\nI won't pretend to understand how he's feeling at all and I think his not being able to look at you could be shame and embarrassmet about saying things he knows you didn't deserve and can never take back.\n\nRevolutionary act of love? Tell him you doubt he meant it and you're ready to talk or support him whenever he is. You and the kids love him very very much. Sometimes deep pain needs *deep* love to heal.\n\nI'm going to wait with you for advice from others because lots of folks have a good two cents or something to contribute.\n\nBut first things first, I'm sorry you're hurting and you sound like a lovely and loving wife and mom.",
            "Its evident how warm hearted you are to your kids. Your concern is first about them, nurturing must come naturally to you. I wish your husband realized this. Those words had to sting. Big Internet Hugs to you. ",
            "The things he said are not ok.  You didn't come in to replace their mother, you came in and tried to be the ebst parent you could be.  Fuck him, seriously do not stay together for the kids.  If he feels this way about you it will just poison the relationship.",
            "Sounds like a mid life crisis to me",
            "I think you should tell him he needs to go through therapy. As far as the comments I'd tell him to shove it up his ass. Even if you and him can't work it out, he doesn't need to live his life this way. Get him some help if nothing else but for yourself and the kids. Remember also this isn't your fault, you did nothing to start this, but you will finish it! You got this momma. <3 *hugs*",
            "Divorce him. There is NO coming back from what he said. Grief is not an excuse for saying that, or neglecting his children. See a divorce lawyer ASAP and work out how you'll sort assets and custody.",
            "I'm so glad you adopted the kids so after the divorce they won't lose you and be stuck with just their shitty Dad. I don't see how you will be able to stay with him now you know what he really thinks.",
            "There is zero doubt in my mind he's having an affair.. ",
            "Could you talk to him with a marriage counselor?  You could tell the counselor, in front of him, how hurt you are, and he could explain himself.  The counselor could keep things from getting out of control, and could help your husband deal with whatever is going on with him that's causing him to act this way.  S/he will probably recommend he see a therapist on his own.",
            "Are there any other family members you can reach out to? Do you have a good relationship with Nick's parents or siblings? It might be that he's not able to open up to you about what's going on because you're so closely linked to it in his mind, but he might be able to hear what another family member has to say. \n\nRegardless of what's going on with him, what he said to you is not ok and I hope you know you're totally justified in feeling angry and heartbroken about it. I know all of your focus is on the kids and you sound like a really great mom, but please make sure you take some time to yourself and allow yourself the space to vent and feel all of your feelings. ",
            "I wish I had some advice, but I don't. Still I just wanted to reach out to you - that is so, so hurtful and I'm sorry that it happened, I can only imagine how you must be feeling. Huge hugs to you, you sound like a wonderful mom and just a wonderful person.",
            "Your husband needs to see a therapist right away.",
            "Oh I completely understand how you must feel awful! I'm so sorry your husband said those things to you. Those comments can be extremely hard to undo and I do hope you get through it. You got some awesome advise already. Will you sent us an update?",
            "How about taking the kids to your family's house for a week and leave your husband behind to give both of you some space? Then negotiate how he can make up for this incident. If he won't try to get you back, just divorce him and take the kids with you",
            "Any drugs involved?\nMidlife crisis?\nLiving in the past?\nAnxiety?\n\nIt doesn't matter what the cause is. He needs to talk about it with someone outside of your relationship, who knows about psychology and relationsships.",
            "I feel like it's both things people have suggested, that he's having an affair to drive you away, to divorce him, so that, even if fate is against him and kills the second woman who had his two children, you will be just that, the second mother of his children, and not his wife, therefore he won't be widowed a second time, haha suck it fate!\n\nIt sounds really stupid. It is really stupid. I don't think I could forgive it. Even if he's just trying to push you away and there is no affair, I don't know if I could forgive what he said, either.\n\nYou didn't deserve such a spiteful comment or his distant treatment. You sound like a great adoptive mother and all your kids are lucky to have you.",
            "This is depressingly sad because none of this is your fault.  \n\nI'm not excusing his behavior at all but have seen this exact thing happen, literally only within the last 5 years with my cousin. I went to his wedding and less than 3 years later to his wife's funeral. It wasn't just 3 years of marriage it was many years of dating, people seem to focus on the years of marriage as the only timeframe.  \n\nThey were an amazing couple and very in sync. They were perfect together and when a relationship ends so abruptly when things are so great, it's hard to move on. But, people try. They are told to, encouraged by friends and family to \"move on.\" So, that's what my cousin did.  \n\nBut, it isn't what he wanted. He wanted his wife and the family they created, he didn't want to create a new life with someone else. What other choice do some have? Be alone or start over.   \n\nHe didn't marry her but he was with his ex-gf for a couple of years before finally ending it because he couldn't move past his ex. SHE was his first choice and in his mind his only choice. He left his ex-gf and although he's still very depressed over the loss of his wife, he acts very different and has said how relieved he is to stop having to try and fall in love when the love of his life died.   \n\nI skimmed through the other comments and didn't see anyone mention how maybe he just doesn't want to pretend anymore. When a relationship ends without consent from the two parties, who are very happy with each other, that's tough to move on. You are his second choice and he obviously cannot move on from the fact that he didn't want to have to even make another choice.",
            "It sounds like he's going through a major bout of serious depression. I've struggled with depression for most of my life, and the behaviours you are describing sound similar to some that I have exhibited when feeling depressed/bleak/suicidal.\n\nUnfortunately I can't even give any advice on it, because when I'm in the thick of an episode like that, even human interaction from a loved one, or someone reaching out telling me \"it will all be better\" just makes me feel worse and more detached. \n\nI would consider talking to a counselor, even just by yourself at first (pushing these sort of things on people can backfire) to learn some coping strategies, or better ways of reaching out to your husband.\n\nWhen you lose a loved one that close to you, it's human nature to find the \"blame\". Often people point it inwards, but when they can no longer take it, they will go through a calloused, emotional shut-down and become distant, irritable, and even lash out at the ones they love.\n\nI think your husband is still hurting deeply from what happened to him, he has regrets, and he has not moved on/properly dealt with it all yet. Sometimes people bottle it up, put it on a shelf and try to cover it up/run away. But it eventually comes to the surface.\n\nLife is cruel like that. I wish you the best of luck. Be there for your kids right now, and don't take anything outrageous he might be saying to heart.",
            "Other posts are suggesting he might be cheating, based on his behavior. But it sounds to me like he never *really* grieved the loss of Vanessa and this is running-away behavior because he can't deal. My guess is that he is distraught at your new pregnancy and that he feels like he's not honoring her memory, but he's projecting it onto you. \n\nRegardless, it's clear to me that Nick is in a lot of pain and can't handle it. The things he said are incredibly hurtful, but they don't reflect on you. That's his pain and sadness speaking. And though /r/relationships does often jump straight to it, I really do think Nick needs to see a therapist in a bad way.\n\nThis is a hard stuaton for both you, Nick and the kids, but don't give up yet. There's hope and a path through grief. You guys just need someone to show you the way. ",
            "Have you legally adopted Luke and Lila? My biggest fear here is that you haven't, and that you won't have any rights to them if you leave.",
            "He needs professional help. He may have been raised in a 'mean' house, like I was. Because of my upbringing, I always can think of the cruelest, cleverest, most cutting thing to say when I'm fighting, because thats what i was taught will 'win' the fight. After a few decades out of that environment, it isn't the *first* thing I think of, but it's always there if I want it. It's like I have a radar for others' pain points. It's awful. Even when I was a kid, I said devastating things during fights that I really didn't mean at all. \n \nWe have this myth that something said in anger or deep emotional stress or drunk must be true, as if overwhelming feelings and loss of control expose our dirty secrets and make us unable to lie. But think about this: are you *really* unable to lie if drunk or angry? Also what we say may be true-ish, but only in that nanosecond before we rerlect on our words. Not to mention, our brains often lie to us--mental illness can cause us to believe deeply ideas that are not true. I have wanted to rid the earth of my terrible existence and give my husband and kids a \"chance at real happiness\" without my stupid failure face around. I have wanted to die; I've looked at guardrails on the highway to crash into; and I've looked at bridges to drive off of. I got help and I got better and I know how real the lies felt.\n \nI think he may be having an affair of sorts--an affair with the idea of suicide. He has pulled away from everyone, won't bond with your youngest, and has verbally burned bridges with you. He is trying to destroy his life, either figuratively or literally. The counterpart of gloomy depression is angry depression, but your brain is still whispering terrible \"truths\" to you. Until you get a professional trail guide to walk with you out of that wilderness, it surrounds you and will kill you. \n \nAnd if I'm right and he gets better and swears what he said wasn't true and that he loves you and that he's sorry, believe him.\n \n\n",
            "In 2008 I lost the \"love of my life\" \"the One\" I've tried to have relationships. I can't NOTHING compares to the passion that we had. I'm sorry you had to experience this.",
            "So you've been married for five years, the same amount of time he and his First were married. You're also expecting your second child with him, the same number of kids he had with her. This isn't coincidence. He's experiencing PTSD and is scared shitless he's going to lose you too, knows that's irrational, and is channeling it as self destructive depression. He needs a good therapist who specializes in grief and PTSD. ",
            "He needs grief counseling.  Like immediately.",
            "I can't say much for advice that hasn't already been said, but I really wanted to reiterate that you are an **amazing** person, mother, and wife. Your (step)children are very lucky to have you, *especially* right now.\n\nPlease don't take anything Nick has said to heart. Whatever it is he has going on right now, he was wrong, and quite frankly, an ass. \n\nI'm so sorry OP. I'd give you all the hugs if I could. I hope this works out for the best for you, and I hope we get to read a happy update.\n\n<3",
            "It sounds like he's going through something that you may not even be able to guess. Something like a midlife crisis where he's reassessing where he is in life and how he got there as a man as a husband and as a father. It's nothing that can't be fixed if he wants to. As you said he's not only taking it out on you but also all of the kids so it's definitely something going on with him and you're the one that's closest to him so he's hurting you the most. What I would suggest to you is to be patient and continue to be as loving as possible. Pray for him that his heart would change and he would become that husband and father he was once again. He will only be more of a miserable person if you lose your patience and retaliate. You've got to be the strong one right now and you can be!! Us women have a strength and resilience that sometimes we don't realize. Love begets love just as hate begets hate. Be the strong one.. take the higher road and be patient. He didn't mean what he said to you and I know if you're loving with him he will feel the weight of the guilt about what he said to you and how he's treated you in this time. You guys also need counseling through the good times and the bad. For all of you married couples reading here you have to give your marriage preventive maintenance; it is a journey and only the strong prayerful ones last through it. So be strong!",
            "Never ever stay together just for the kids. It creates such an unhealthy environment full of resentment. It is not fun growing up in that situation.",
            "Sounds like he's going through something. You've been with him for 8 years. So I have to ask if he was like this before now?\nIf not, then there has to be something stressing him out or some medical condition. \n\nI say that because while he may grow distant from you, the same wouldn't be true for his children. \n\nPersonally, I think taking a heavy handed approach to getting him back on track will do more damage. This makes things harder since generally men don't like opening up about problems. They (we) prefer to try to figure out a solution on our own. Unfortunately we can get a bit testy while trying to solve these issues. \n\nSo you may need to *gently* let him know that you've noticed that there may be something going on and his behavior has changed. He may open up to you. You may also want to suggest that he seek professional help to get him through whatever he's going through. Explain that his behavior is affecting the children and you just want things to be okay with the kids. \n\nHe may (will) give some resistance at first. But may give in after thinking it through and realizing that others are noticing that there's a problem as well. ",
            "Go to therapy-you need the support and help in figuring out what to do.  See a lawyer and find out what would happen with the kids were you to get divorced.  You have adopted the kids so they are just as much yours as your husbands-you have as much right to custody as he does.\n\nFrankly I would do both of these BEFORE you talk.\n\nIm sure you are a wonderful parent-much better than your husband is.\n\nIm sorry you are going through this.",
            "I wouldn't advise you to divorce immediately, this man knows he did something incredibly bad and he wants to make amends. Give it time if not for anything else then for the kids.",
            "Man, this sucks.  \n\nI don't have any useful advice but I hope that you and him are able to overcome this and become a stronger couple and family. Who knows, maybe some day soon you'll be renewing your vows and you'll get then the wedding you always wanted. But while this is going on remember than in these difficult times you should also worry about yourself and feel good with yourself. No one can take that from you, especially when you *know* all of the good you've brought to your family. So stay strong and I wish you the best!",
            "My Dad died when I was 5, she remarried when I was 8... and my stepdad took on three of us.  The first year or two was ok, then I remember just praying between the ages of like 10 and 18 that they would divorce.  I loved and needed both of my parents and I didn't know what that all looked like, but the constant tension in my house made me feel sick all the time.  I didn't want to be anywhere but my room most of the time.  There are similarities in the issues between them as the issues you're having, but not exactly.  No one had to deal with additional children either should they split so I understand this is more complicated.  However, not only was this detrimental at a young age to my confidence and backbone... but it lead to so many problems I'm still dealing with now as a 33yr old single mother of one.  The issues that are coming up over and over from the turmoil I was in... ugh.  It wasn't so bad we should have been on Jerry Springer, but it was enough to do damage to everyone.  They eventually divorced when I was like 25 but there were huge serperations in there after I went to college, it was totally different those last 10 years how apart they were.  I spend a couple weekends a month seeing my stepdad still of course.... In summary, even those stepchildren that love you so much, just want peace more than anything.  As a fellow mother, I think I would leave to create more peace for everyone.... but I only know how to be a mother, not a wife.  I just don't know how you reconcile in these conditions.\nFinal Note- My parents have been dating again for 2 years maybe more.  It took time apart to heal for them to figure out how to communicate.",
            "Even his first wife wouldn't want to be with a douchebag like him, do what's best for you you and focus on you and the children's happiness. Whether that means marriage counseling or divorce nobody deserves to be put through what he's putting you and your family through",
            "Sounds like \"nick\" needs a therapist/psychologist seriously. I doubt you are the root cause of any of this, he is just lashing out against anyone who is close to him from his loss. Get him to a therapist/psychologist  ASAP! ",
            "In life it is hard to not take what happens to us personally, but that is what we need to do.  We must realize that rarely things happen because of us.  You are a wonderful woman and just know that your husband said those mean statements not because of who you are but because of a mental issue.  He is going through some type of problem in his head.  I am by no means excusing what he did, merely explaining what I think of the situation.  His actions aren't a reflection of you but more so a reflection of his own mental degradation.  Whether the marriage is salvageable is up to you. In many instances you are going to have to be the bigger person/take the high road and if/when you salvage the marriage he may never even acknowledge your sacrifice but such is life.  It is tough.  ",
            "I don't think something is up with him as others have stated but more that he is snapping, because his new life with you is, for lack of better wording, replacing that of his and Vanessa's life and he maybe almost feels guilty for it. He's not allowing himself to be happy. ",
            "She died right after the birth of their second child from the math.  You're reaching the point in this relationship that he was at in the last one at the time when she passed.  He could be distancing himself from you because he is afraid to feel that hurt again.  As a new dad to a second child, he probably started to have a lot of the same feeling which, in his memory are probably tied to the grief of losing her because he was probably still feeling the new-ness of the second child when she was taken.  Just a thought.",
            "Honestly this sounds like it has very little to do with you. Hopefully that will make it easier for you to stay connected with the kids while their dad is going through some shit. He sounds like he's stopped enjoying being involved with any events or things he used to do and clearly he's been thinking about the past and has a lot of hurt still left. It's natural for him to still have some wounds, but it's not okay the way he is dealing with them. \n\n I think the easiest way to help the entire situation is to recognize the battle he's going through within himself (which may be depression or anxiety or just grief that never got dealt with). This doesn't excuse his actions but it may help you deal with the hurt he's throwing your way and make it easier to try to just lovingly help him get help with a therapist weekly and go from there.",
            "I don't have any advice, but I just want to say that you sound like a great stepmom and those kids are lucky to have you. I'm glad you adopted them and intend to stay in their lives, no matter what happens with your husband. ",
            "How did she die? Also, this guy sounds like a psycho. I know it's hard to lose someone, but telling someone you supposedly love that you wish they were dead and that they only had children with you to shut you up is not. Normal ",
            "OP you're getting some wonderful advice here so I really just want to reiterate what a lot of other's have already said. We all grieve differently. Despite what we're told there's no prescribed \"do it this way\" for dealing with the death of a spouse. Loss on that level isn't something that ever really goes away, which you clearly know and are very sensitive to, and even when you think you're \"done\" with it, it can rear its head years and years after the physical loss has happened.\n\nYour husband sounds like he's in an immense amount of pain right now and he has no idea where to put it. People have already commented on the symmetry of your situation and that of his previous marriage and I'm sure he draws comparisons and thinks about her every day. What she missed, what the kids missed, what he missed with her. How could he not? I truly don't think that cast's any reflection on his feelings for you, I really, really don't. \n\nWhat I'm wondering is if some of his issues are stemming from fear. As another poster pointed out the time frame of his first marriage and yours is pretty close. Is it possible he's dealing with a huge amount of fear over losing you the way he lost his first wife and he's insanely overcompensating the other way by distancing himself? He may not even realize that's what's happening. Everything he's doing, sleeping in another room, cutting himself off from you and the kids feels so much like putting up walls and distance so he doesn't have to go through another trauma when something bad happens to you.\n\nObviously we don't know all the details of your fight and without a doubt what he said to you was totally awful. But I don't know if it should be the thing that defines whether or not your marriage ends. There is no question that was the absolute worst thing he could have said to you under any circumstances but I'm positive it really is worth getting to the heart of where those words came from and why they came out at all. That's not to cast any responsibility for his outburst on you, you in no way deserved that.\n\nCouples counseling is absolutely a necessity here. You two simply aren't communicating anymore. It happens and it can be helped and fixed. You are dealing with incredibly deep seated and very tragic issues here and I know you know there's no quick fix here but I think based on what you've said that this relationship, this life is worth fighting for.\n\nYou truly sound like a wonderful person who really deserves happiness and a good relationship and you've done something amazing in becoming a part of this family. Please hang in there and see if its possible to work through this and please, please let us know how you're doing.",
            "Any chance he's distancing himself from you because he's got an unconscious fear history will repeat itself? You have a 2 year old boy together, you're about to have a girl together. These kids have roughly the same spacing as Luke and Lila. Two years after Lila was born, Vanessa was gone. \n\nSo therapy, together and apart, and re-evaluate from there. What he said to you was horrible. If he won't go to therapy, I hope you do, and I hope you go.",
            "Wow. Just wow. I'm so sorry. I don't know how you're still sane after hearing some of those words other than to say that you're a tough lady. You must know that he said those things to emotionally cripple you and I hope you don't let it. Big virtual hug.",
            "After reading your story, I was really hurt as if I was you. You are pregnant too fragile with painful words. What kind of husband is that? All I can advise is to have a serious conversation with him. Ask him why the changes and etc. But if he is not willing to open up and continue being a jerk, I think it's time to say goodbye. Focus on your baby instead. It is not good for a pregnant woman to feel emotional pain. If he doesn't want you to become a mother to his children, then fine. He's being abusive to your patience and love. Your baby inside your womb is much important. Stay positive and happy. Your true love is your baby. Wishing you all the best in the world and congratulations for having a baby girl. :)",
            "> I know I'm just his second choice\n\nCan I ask, if you always knew that you are \"just\" his second choice, why did you marry him? I don't think most people would be okay with being anybody's second choice.",
            "It sounds to me like your husband took his first wife's passing really hard. It has been a long time, but I think he's still healing.\n\nThere's no rush to leave just yet, but maybe give him some space to let him think. It might be good to get to a lawyer and see how you could approach this.\n\n",
            "Please girl leave as fast as you can. It does not matter if he is stressed about something - as angry as one can be, THIS should NEVER happened and it is NOT okay. What kind of love do you think he is going to offer to the newborn?\nYou deserve so much better, you sound like a wonderful person. The kids will understand.",
            "He is probably grieving and isn't coping well. He is probably very happy and is feeling guilty or missing his first wife. I will wager he doesn't mean what he is saying and is speaking out.\n\nI would demand therapy. ",
            "Honestly this is why I could never be in a relationship with a widow or someone whose fiance/boyfriend died while they were together.\n\nI just couldn't dealt with it, you're a great woman, but you need to ask yourself if you can come back from this and what does it need to happen for you to forgive him, and the first thing he does is want to work on it, and he doesn't appear to want to do that, you didn't said if he was drunk when he said all that, but even so I do believe those are his real thoughts, and sorry but a marriage like that doesn't really work and probably will end up hurting the kids more that being apart and see you happy.",
            "Seriously? What then fuck",
            "Ask him if he wants a divorce point blank. If he says no, then tell him you 2 need to start couple's counseling ASAP.  \nIf he can't talk to you on his own, a mediator might be able to help you guys out.  \nI'm so sorry he said something that terrible to you. Try not to despair too badly.",
            "I once witnessed an experience, just like yours. My father had said almost the same thing to my mother. \"I wish you, your whole family, and our son never existed, so I wouldn't hate to care about what y'all think anymore.\"\n\nI was 12? at the time, and I hadn't known what it meant to be so resentful towards family. After all, I had only known love from everyone in it. This includes members of my family that are distant from me in itself, after having relatives in Paris, France - Saigon, Vietnam - Nashville, TN - ect. What hate could arise from such a loving family that chose to stick together and work things out, day by day to ensure the safety and success of the young?\n\nNow I am 18, just starting college, and I can truly see the efforts my parents have made for me. They chose to stick through a very rough marriage, with a kid that always hated not just the immediate family, but the whole family, because they knew that I was the determining factor on whether they stayed or not. Whether my parents divorced, or stuck through it because of me. I was the only child too, spoiled out of my mind, to an extent where I wouldn't have to care because my parents still loved me.\n\nYou see where this is going, right? I'm not trying to be the most selfish being on the planet right now, because I'm not making this post about myself. I'm doing this for the kids. Think about it, he's got 2 kids to worry about, plus the one that's on the way (congratulations, btw). What would you think is better for them? \n\nMy parents chose to stay together, and fix their marriage (sorta) in order to keep me in school, show me that love can be hard sometimes, and honesty is the best policy. They truly loved me in the aspect of education, loyalty, and the fact that you can always learn from a bad experience. aka their marriage.\n\n**TL;DR** I strongly suggest you stay together, and work things out. Like that one 'Family Guy' episode said, \"I'm the best you got!\" Learn from the experience. Start slow. Cool, calm, collected. Do it for the kids, so they can experience. Teach them to fall, so that they can learn to get up.",
            "[deleted]",
            "He's clearly cheating on you and then he said such vile things. Please leave him. ",
            "[deleted]",
            "He's having an affair for sure. ",
            "\"Last week, I finally sat Nick down and told him that he needs to stop disappearing and be more present in our lives.\"\n\nWhile you are absolutely correct in thinking that, saying it to someone who obviously has mental health problems (I would assume a personality disorder of some sort) is not ok.  People with personality disorders are like drowning people; If they want to be saved, and you are trained to save them then everything can work out.  Most people, however, are not trained to save someone with a personality disorder, and most people with personality disorders do not want to be saved.  It really seems to me that you are not equipped to deal with your husband's problems, and that is ok.  Would you try to save a drowning person who doesn't want to be saved with no life raft and no lifeguard experience?  NO!  You need to protect yourself and your kids (they aren't trained in this area, either).  Don't try to save your husband.  Unless he apologizes profusely and makes drastic changes to his behavior, you need to get the divorce and distance yourself from him.  \n\nAlso, even though he thinks you are over-stepping by being there for his biological, and your adopted kids, you are 1000% not!  you adopted them so they are, by law, your responsibility.  Do your best to take them away from his toxicity until he figures things out (which will probably never happen as it is very difficult to recover from a personality disorder).  Look, the dude is isolating himself anyway so let him isolate, but don't give him the opportunity to bring his toxicity into you and your kids' lives.  This will be very hard on your kids, by the way.  This is a tough life lesson, but one that is essential that they learn at this point.  \n\nAll this being said, you really need to analyze your own actions before making any major decisions.  Make sure you didn't do anything to hurt him and drive him to this behavior.  Hell, even ask him if you did anything.  One of the last things you want in this kind of situation is for you to get a divorce, take away his kids, etc. only to realize in hindsight that it was actually something that you did that pushed him to this behavior.  Was he working too hard (both at home and at work)?  Were you actually getting between him and his relationship with his kids?  These kinds of questions are important.  From your writing, it seems like you have treated him well, but writing can only really tell so much.\n\nStill, if he doesn't apologize and change his behavior, then it doesn't matter if you did something wrong.  His behavior right now is dangerous (in an emotional way) for you and the kids. You may both need therapy, or maybe only one of you needs it.  Just try to keep in mind that relationships are still two-way streets, even if one of the parties is extremely out-of-line.\n\nAnd something for later on down the road to think about... Try to objectively reflect back on this and figure out how you may have missed warning signs of this kind of thing coming.  It really sounds like he never got over his first wife, and that should have shown in some way before now.  When you do this, do not, under any circumstance, make yourself feel guilty or beat yourself up in any way.  You may do that unintentionally which happens to the best of us, but don't think you need to feel bad about this in order to process it.  \n\nBest of luck to you.",
            "[deleted]",
            "[removed]",
            "Nick's behaviour and what he has said to you is inexcusable, but is there any way you're behaving or communicating that might cause such behaviour from Nick? What are your fights like? Nick sounds depressed and you guys as a couple need to get to the bottom of it - which won't be easy and maybe not even possible by the sounds of it. He needs to work through his feelings about his previous wife and together you need to rebuild your relationship."
        ]
    }
]