[
    {
        "post_id": "hxzwcl",
        "author": "throw1316away",
        "title": "Update: My(M26) wife(F26) is not happy",
        "url": "https://www.reddit.com/r/relationships/comments/hxzwcl/update_mym26_wifef26_is_not_happy/",
        "score": 8117,
        "num_comments": 419,
        "created_utc": 1595734413.0,
        "selftext": "Original Post: https://www.reddit.com/r/relationships/comments/hm1wdi/mym26_wifef26_isnt_happy/?utm_source=share&utm_medium=ios_app&utm_name=iossmf\n\nThank you everyone for the advice from the original post. I just wanted to give the community an update. My wife finally got back yesterday from leaving to go see her sister. We talked for a little bit yesterday, but still came to the same thing she has been telling me. She doesn’t want to be with me because she doesn’t feel in love, emotionally connected, or intimate towards me. She views me as a friend. I told her she needed to choose either we work on this and go to counseling or it’s a divorce and we cut ties. She couldn’t decide and said to give her the weekend. \n\nThis morning I woke up early, made her breakfast and brought it to her in bed. Then took her out to eat for lunch and desert trying to just spark anything to see if she would agree to work on it. Well we sat down again after getting back and she said she wanted a divorce and she was 100% on that. \n\nIt was tough. A lot of crying, sadness, hurt, and all the emotions one would feel. I ended up just going to my room and she left for the night. I decided to get out and do something so I jogged and listed to some music for a bit. It helped. \n\nI came to the realization that we all have such little time on earth and I don’t want to waste it moping around. I want to improve myself physically, emotionally, and mentally. I want to just enjoy life and find myself again. So I’m going to do that and one day I might meet someone who is perfect to continue the journey of life with me. \n\nSo I’m still sad and hurt, but all that to say I’m moving forward and trying to be positive. Thank you all for your support.\n\ntl;dr Wife wants a divorce. I’m trying to stay positive and move one.",
        "permalink": "/r/relationships/comments/hxzwcl/update_mym26_wifef26_is_not_happy/",
        "comments": [
            "The end of a relationship is hard but it’s also such a great opportunity for growth, self compassion, and fun. The initial part of the separation is hard but just know that you will be okay, slowly things will get better. \nYou’re still so young, you’re going to find someone that’s a better match for you. Just give yourself time to grieve and take care of yourself. When my bf and I broke up I listened to “Breakup Recover Podcast” by Barbara Stevens, she’s so calming and has a way of making you feel cared for and safe. There were days where I felt like shit but I would force myself to listen to it and I never regretted it. \nHope you find happiness within yourself soon!",
            "I’ve come to know that most relationships \n are temporary, but that doesn’t mean they can’t spark joy and laughter. This decision was hard to come to but the love and care you have for each other will always remain.  Allow yourself to truly experience self discovery and to focus on bettering it- take a class, learn a new language, try to find new and exciting purposes.",
            "I read your original post and I just want to say that I’m sorry and I’m really proud of you. You know that you have done absolutely everything you could have done to try and maintain this marriage. As you move forward in your life you won’t need to question if it was something you did or if there was something you could have done better; this marriage ending is completely on her. You are willing to take criticism and improve on your shortcomings, you compromise and work as a team player, you persevere and you show compassion. You are a wonderful partner and now you’ll have the freedom to find someone who will be just as willing as you to put everything into your relationship. I wish you all the best as you heal and eventually feel ready to find someone new!",
            "I got divorced at 28 (my partner also requested it after I felt I had done everything I could do) and it was hard at the time but ended up being the absolute best thing that ever happened to me. Hang in there, treat yourself kindly and follow your dreams, I'm sure you will thrive. All the best.",
            "You’re still so young! You’re only 26!!! You have you whole life, a positive attitude and a whole lot of life experience now!",
            "I read your original and update. I’m sorry you’re going through this but there’s still so much ahead of you. In time you might come to find this was the best thing for you. \n\nI’m your age and from age 17-25 I was with the same guy and although we didn’t actually make it to marriage we were pretty close with cohabitating and having a dog together etc. That relationship ended and it was very difficult but it has afforded me the opportunity to make changes in my life and finally live the way I wanted to. This is all to say that you should keep hopeful and work on yourself. Good things are still to come!",
            "I’m 32 and have to start over too. We’ll be ok!",
            "Hey! You will be okay! As time passes you’ll see how happy you’re going to be instead of dragging this unhappy marriage around! You did your part. Take time for yourself  and eventually when you least expect  it you’ll find the person who gives you what you deserve! Positive vibes your way!!",
            "I’m so sorry to hear things didn’t turn out the way you wanted. Good job on focusing on the positive and I hope you enjoy life more than ever!",
            "Hey if you want to talk message me, I'm the same age and also going through divorce (my wife left me for another man) I've been trying to parse my feeling with my situation but maybe having someone to talk to might help both of us. If nothing else maybe we could give some insight to each other, I mean if you want it.",
            "I feel you man. After my fiancee broke up me with me this year I also started to take care of myself much more and it feels great!\nI would recommend a podcast called The Minimalists. Maybe start off with these like I did:\nEpisode 158 about selfcare and episode 148 about breakups.\nI also started intermittent fasting and that really helped me achieve the goals I wanted body wise",
            "I’m so sorry. Divorce is really painful. I  also am very freshly divorced following some very traumatic shit. \nIf I could offer you some grains of advice? People are going to say things like “you’ll find someone new and better” or the like, and I for one know how fucking incredibly hurtful that can feel when you are mourning the person you wanted to be with. The idea of dating again feels nauseating. Trust your gut and give yourself time. The expectation should never be to rush in to the next relationship, though some people will act like it is.\nWhat I can say is that being alone is okay too. You want to let yourself feel the feels. Divorce can hurt so much. The grief is literally so painful and can hurt worse than experiencing the death of that person, because they are still here and you can’t have them. This is normal, and no one will be able to shoulder it for you, but it will get better in time. I think I spent an entire month straight crying, like real crying. I thought the grief was going to kill me. \nTwo things that helped the most were a solid mindfulness practice, and getting in to my own place. I paid for a subscription of Headspace for a guided meditation approach, and there are great programs. I am in a month long “dealing with sadness” routine. I can say with 100% honesty that I am different -and better- on the days I wake up and commit to meditation before starting my day. For real, for real. \nIn regard to the place, my former husband and I had a magical home and I had to stay and get it sold, after he moved away out of the state. Being in that home was insane torture. I closed last Friday, and moved last Sunday. Last Sunday was hard, I cried hard when I drove away the last time, but guess what? I haven’t cried since, of even felt the need to. Get in your own space, and get a few things for yourself if you are able. \nAll in all, sorry to ramble, this is just fresh for me, 1. Find peace within so that you are bringing your best you to the table IF YOU DECIDE to date again, being solitary is also okay, 2. Get in your own space. It may not be perfect in physicality, but it will be perfect because it is your own, 3. Let yourself have the feelings, and give yourself permission to let those feelings go when they no longer serve you, 4. Stay sober",
            "26 is so young, and you still have so much time to build the life that you want. Keep that positive outlook, and my condolences regarding the end of your marriage.",
            "I read your original post, that's extremely odd behavior on her part. I'd also point out that you went beyond trying to fix your marriage and became a doormat.\n\nI would also suggest speaking with a lawyer in regards to an annulment instead of a divorce. Your post implies the marriage was never consummated and my understanding is an annulment will relieve you of the obligation to pay any sort of alimony or future support.",
            "I hope you can get through it well buddy.",
            "The end of a relationship/marriage is always tough. Just keep your head up and ride it til it passes. Some days will be tougher than others. Just stay focused on yourself and best of luck to you.",
            "These posts hurt my soul and my fundamental understanding of relationships. Obviously my understanding is flawed and incomplete. I wish you the best of luck. Just know I met my now wife and mother of my child when I was 24. Stay strong and be the best you buddy.",
            "Things will get better. Im glad that you're staying composed and want to congratulate you for handling it the way you did. Good luck 💖",
            "I am sorry OP.\n\nBut one thing that stands out to me: you've bended over backwards for this person. Did the emotional and all the other work for her, as she demanded it! Glad that in the end you asked she'd show up for this marriage or quit. She knew immediately she wanted to quit. \n\nI (35F) have had a tendency to also invest myself heavily in my couple, to care more and to be passionate, to remove obstacles for my other half. To accept being friendzoned and taken for granted, while I'm passionately invested. Not anymore! Am single for a year and built a fabulous life. I won't date again until I found someone who is as invested, enthusiastic, who communicates well and makes sex and intimacy a priority. Someone who passionately loves who I am and who has a healthy amount if self-love.\n\nBeing a couple is about being a team, loving on each other and going on an intimate adventure as lovers (sex, intimacy, love). It's about supporting each other. \n\nShe just took and took and didn't give much. Work on feeling well and tour self-esteem. You're worth finding someone who is a proper adult and who cherishes you. If that's not happening, don't get involved. It takes 2 people loving, appreciating each other and working hard on the relationship.\n\nShe sounds manipulative, cruel and happy for everyone to serve her (very entitled).\n\nI'm sorry. All the very best to you!",
            "It’s so weird that she said she sees you as a friend. What does she think a husband is? The root word of boyfriend is FRIEND. You’re supposed to know each other like the back of your hand. You’re supposed to be just like room mates who help each other. The crazy libido and sex always ends and the honey moon phase always wears off. It is really sad she doesn’t know how to appreciate someone caring for her and having her back because she will definitely miss it when you’re gone.",
            "Keep your head up man. From reading your original post it seemed like you were willing to do everything possible to try and work on your marriage; unfortunately it does take two people to want to fix it. Use this time in your life to find peace within yourself and to make your life what you want it to be.",
            "You're really strong bud. That's really impressive to have that outlook.",
            "Divorce is a rough road. Its up and down. The last 11 months have been some of the most hellish of my life.\n\nBut now that im almost through the tunnel (finalize next month with our settlement), its refreshing. I look back at so many unhappy moments and situations that i don't have to go back to anymore. Looking back at it, i thought I was happier in those moments than I really was\n\nHopefully you have a similar experience, because divorce is a fresh beginning- a chance to find somebody who is in love with you the way she wasnt. \n\nI highly recommend subscribing and visiting r/Divorce  - it helped me a lot",
            "From the first post:\n\n“After we got engaged the intimacy started to die down and a couple months before the wedding my wife cut of all sexual acts stating she wanted to wait until we got married.”\n\nThere’s a reason this is considered a red\nflag, and the reason is that you end up marrying into a dead bedroom. Sounds like your wife had started to fall out of love with you, and the actual wedding accelerated that process.",
            "You are 26 and have so much life ahead, give it a few years which will fly bye and realize you are one of the lucky ones who did mot waste a minute more of your life. Next one will be better, trust me.",
            "Seems like you did everything you could, maybe more! \n\nI really admire your values. You have set yourself up well to be a great life partner. The next person in your life will be very lucky!",
            "Honestly you are going to find someone and realise how much was wrong with your previous relationship. Things that just became normal. I was with a guy for 7 years and I never felt unhappy necessarily but there wasnt that crazy in love connection I have with my partner now. But for now, rediscover who you are, have some fun and enjoy life for a bit.",
            "[deleted]",
            "So from what it sounds like, your wife has a serious issue with expectations in a marriage. \n\n\nJust for background, as I read both your posts about your wife, it reminded me so much of how I used to think of marriage, that my husband was going to make me happy. He tried, he really did, and after the first year of marriage, he came to the conclusion no matter what he did, he couldn't make me happy, only I could do that. So he gave me an ultimatum. Get into therapy to figure out how I can look to myself for happiness, and also, help treat my major depression. He's not one to give ultimatums, but after him working so hard and me just wanting more from our marriage, more from him, but not knowing what exactly I wanted, he realized I needed to figure that out. I did. \n\n\nI went to therapy, did all the work, and tried really hard to figure out how to not look to others for my happiness. I took assertive training classes which worked really well and taught me to stand up for myself, and basically grow up and mature emotionally. The ultimatum came 21 years ago, and me and hubs are still happily married, with reasonable expectations. \n\n\nIt sounds like your wife is depending on you to make her happy, and when she's not happy, she tells you to do things she thinks will finally make her fulfilled and happy, but when you do it, she's still just as unhappy. She continues to look to outside situations to make her feel better, but doesn't realize that no matter what you do, it will never be enough because the calls coming from inside the house. (Ha! Couldn't help it!) but seriously, she needs to look at herself to make her happy, not you.",
            "It's fine if you divorce as you are young and your relationship is probably beyond repair anyway. The most important thing though is that you learn from the experience and don't repeat the same mistakes the next time around. \n\nTo be really blunt: you are a classic doormat. Throughout the entire relationship with your wife, you never set reasonable rules and boundaries. She said she doesn't want sex - ok honey. She said she wants to uproot and move - ok honey. She said you need to do most of the house chores - ok honey. The thing is, you weren't making any decisions to agree with her. She knew that you had no spine to fight back and took full advantage of it, losing respect for you in the process.\n\nSo the most important thing is that before you get into another relationship, you need to learn how to assert yourself and actually live the way you want rather than conform to everything that your partner wants. Of course to an extent you can accommodate, but it has to go both ways and it should never be that one person does all the giving and the other all the taking. No healthy relationship can be built that way.",
            "To be honest reading your posts, I think the first good thing she has done for you thus far is force the divorce issue. It's hard to think about, when you are consumed by the struggling of making someone love and be attracted to you -- you're so wrapped up in pleasing them and courting the things you want to see in them (affection, arousal, love, respect, the person you thought you knew in the honeymoon phase, etc), you forget to do your own assessment and evaluation of your needs. \n\nI don't know if she was cheating on you, I don't want to make assumptions, but she had some reason for being checked out for several years. I think it sounds she really never valued all that you provided (as the bill-payer, house-cleaner, chore husband) because she had always had that from you. It doesn't sound like she sought to bring the same or similar improvements to your life -- what was she putting IN the \"pot\"? In what ways did she really try to actively figure out, how can I make this man feel happy and loved and valued as more than a friend, and then do that consistently. \n\nYou're 26, and you will take this self-knowledge with you, and when you are ready, you'll spark a much better relationship with someone who will be attracted to the person you are at your core, and seek to kindle and take care of that attraction. All you have to do is focus on yourself and figure out, who do I want to be and what do I want in a partner, and you have time to do that. And if you can, be grateful to your wife - not for the outcome, not for the pain, but for recognizing that she needed to let you free, so that you could find someone who can actually love you.",
            "Stay strong friend, one day at a time...",
            "I have some situation, bro. You need to live communicate with people. Try to not stuck on anything. Find a friend, whom you can talk all your experiences and issues, call him averytime and free your head from thoughts. If necessary - write to me ;)\nGood luck.",
            "It is good to know that you still have that positive attitude despite of what happened with you and wife. Keep up on improving yourself and hopefully you will have that relationship you always wanted in the future.",
            "sending love. it will feel okay soon",
            "Then I guess OPs life isn’t happy. Amiright?",
            "OP, you should be extremely proud of how you handled this hurdle in your relationship. This was not the woman for you and that's clear now, but one day you'll find your person and they'll find you. \n\nThe hard times won't end there because *any* relationship takes some work to go well. However, you know how to handle yourself when things are getting rough. You know the right steps to take to make things better, and you have the heart to do it. \n\nDon't be discouraged if you find that you're fighting or drifting in your new relationship, because it will happen sometimes. Just remember what you did here and do it again, and if you've really found your person they will *also* be 110% invested in making things work. Good luck!",
            "This is gonna sound weird but I'll tell you what I told my friend: Congrats man, your 20's just got given a clean slate! I know this shit hurts and it's not fun but as long as you're able to talk about it and take care of yourself physically, mentally, and emotionally then the rest of your time to \"be young\" will be worth it single or not.",
            "I’m so sorry you’re about to go through a divorce. But from what you wrote in your first post, it seems like this will be for the best for you. You and your wife have been together since you were very young adults and got married very quickly. It doesn’t seem like the relationship ever really worked aside from some new relationship energy, which, of course, isn’t sustainable. Also, your wife seems like a very unhappy person in general and she’s going to have to do a lot of work on herself to find that happiness. You can’t do it for her and she can’t do it for you. I think you’ll both be better than fine in the long run. Good luck to you!",
            "I’ve been where you are and it’s soul crushing at first. It gets better slowly and one day you will wake up and feel ok. It took me a few years but it finally happened. I am now happier than I ever thought I could be life with a wonderful wife and another child. You can’t make someone stay and commit who doesn’t want to be there no matter how much you love them. Be very cautious of your ex circling back to you when their new fantasy life turns into real life. Always remember they didn’t want you when there was something out there that they perceived as better and you don’t ever have to be second choice for anyone. Best of luck and much love to you internet stranger.",
            "I make this comment out of pure wanting to help. Maybe she's gay. I was in the same position with my boyfriend, always asking for more, and getting so angry then he did something wrong, until he put a stop on me, covid happened, and I had lots of time to think about my life. Many, many tears and weighing about 3 pounds less, yup I'm gay. This shit does happen",
            "Divorce is the right decision.  You, frankly, deserve better.  You made all the efforts to change and to save your relationship. Also consider that your stepmother might be right about your soon-to-be ex.",
            "You’re absolutely right life is too short to waste it moping around but it’s also to short to waste it on people who don’t love you and cherish you, (and from reading your last post she didn’t sound like she did...I mean she wanted you to change and improve and pull your weight but what was *she* doing to help improve the marriage? Sounds like a princess complex to me. It takes two to tango..you dodged a bullet imagine being married to that for life?) you did the best you could (and frankly I believe too much, she didn’t sound like she deserved it)but it ending was on her not you, cut ties with her and put her in the past where she belongs and make room for someone *much* better.\n\nAlso don’t focus too much on “self-improvement” because it sounded like you already did it for her (she didn’t deserve it but those improvements were still good regardless)...but it wasn’t your fault it ended man so there’s no need to look for flaws...just focus on healing and being happy.",
            "Good for you mate. I hope you heal quick and meet someone who will complete you.",
            "Hey, I know this a bit too late but just wanted to share my experience:\n\nI started to act a bit similarly to your wife when I was 25-27 y old. I felt physically exhausted all the time, I gained quite a lot of weight in a short time, wanted to leave my home town (because of anxiety issues), and started rejecting my boyfriend at the time and even the next boyfriend after that.\n\nTurned out that I had a (storage) iron and D vitamine deficiency, and it had affected my well-being and mental state quite a bit. After I started taking iron supplements, I started feeling a lot better and my relationships have become much more stable.\n\nI would recommend to your wife that she goes and takes the tests. Even if you don't want to continue together, it would good for her to check out that she is not affected by any physical issues.",
            "You're still young you have plenty of time and when she wants back tell her you had your chance I'm with someone better!",
            "You sound like a good dude",
            "I'm so sorry to hear that man I'm going through something similar but keep your head up! Focus on being the best version of yourself and one day you'll find a partner that will love you forever. Best of luck man you seem like an awesome guy!",
            "The end of something means the beginning of something better. I was devastated when it was time to file for a divorce. I nearly broke me. I didn’t understand it at the time, but that needed to happen in order for me to grow. This may not make sense now, but you will eventually begin to see that it was something that needed to happen in order for you to thrive!",
            "I read both parts of the story and sorry man but from what I have read this marriage wasn't going to work out as soon as it was official. I mean she put little to no effort of trying to keep this relationship intact while you on the otherhand did. Seeing you as a \"roommate\" after going through all the way to marriage is just cruel... but hey I'm glad that you're trying to look forward! Keep it up buddy",
            "You are a good person OP and sometimes people just fall out of love. The fact that you are willing to work on yourself and realise that life is too short to not enjoy it is a fantastic thing. Do take time to heal yourself and do things for fun, just for you. Eventually, you will find someone who will want the same things as you are. Also you are 26, you literally have your entire life ahead of you.   \nYou've got this!",
            "I’m really sorry things ended the way they did with your wife :( I think it’s great how positive you are being. It seems like you have a lot of healthy plans to help you cope with this  I hope you can heal and continue to live a happy life :)",
            "Im glad your still young, you have so much time left! Ofc it’s heartbreaking, but I mean at least  your not like 36",
            "Sorry for what’s happening bro. I’m glad you came to the realization about life being short and what not. Time is definitely something of an equalizer, no one can buy more time. We tend to change as people and sometimes people just grow apart. It’s good to amicably part ways, and look forward to the endless possibilities that the future offers. Good luck buddy",
            "You’re going to find someone that’s going to value what you bring to a relationship. You tried and gave this all you could, I’m so glad you have a positive outlook and I hope it stays with you moving forward because you deserve so much better.",
            "You have a really healthy outlook. Let yourself grieve, it’s ok. But yes get out there and live your life!",
            "You've done all that you possibly can in this marriage, so please never think it is your fault. Also, I hope someday that you've already healed your wounds from this experience, so that you don't have to fear giving your best in your relationship to someone who wants to do the same for you.",
            "> After we got engaged the intimacy started to die down and a couple  months before the wedding my wife cut of all sexual acts stating she  wanted to wait until we got married. After getting married that didn’t  change. She stated she just didn’t have the hormones she had when we  were young and crazy and her sexual drive just wasn’t there. \n\nhmmmm I dunno about this",
            "I don't see why it has to be either/or. This is a person who has been important to you. Cut ties, but when you're ready, form a good friendship.   \n\n\nI think you're a good guy, for what it's worth. You're serious, well-intentioned, responsible. What a catch! Look for a better fisherwoman next time. :p",
            "Good for you. I get it hurts, but ultimately this is the right call. Pick up a copy of No More Mr Nice Guy and get to work on you.",
            "if she can't decide immediately it is divorce time.  Get a lawyer.",
            "I'm glad she's finally let you go. You were never going to give up on the marriage. She kept you at arms length while you did all the work in the marriage. I find it cruel how she treated you. You deserve better and you will find someone.",
            "When John Green went through a hard breakup of a long term relationship, his mom told him that one day he would realize that that was the best thing to ever happen to him. One day you will look back and be greatful for this experience. It gets better, I promise you that.",
            "You deserve better man",
            "Hugs, you will survive and thrive",
            "If two people aren't the right fit, it's no ones fault. You worked damn hard on something you care about and that's a quality you should always keep. When you do your best and work hard to keep a marriage together and it ends anyway, you can feel like, why did I bother? But don't.  Perseverance and attention to your spouse is something you should like about yourself.  You can always say you did your absolute best and have no regrets that you could have done more.  \n\nHonestly, at 26 you're already better than most husbands at 46. Lol. What you learned from this will make you ready for your perfect partner.  You are already sure that you are a good partner so keep that confidence in yourself. \n\nAllow yourself the grief that will come from this split. If you acknowledge it and process it, it goes away pretty soon. It makes some people think that they want to get back together but that's because it can be confusing.  You will feel the loss of what you expected your life to be.  The frustration of having tried so damn hard and failing anyway. (It take two to work it out) The uncertainty of starting a new life on your own, and more. Let it all flow through you knowing you did your best and that things will be ok and that you ARE a good partner. You're going to feel refreshed after it's all out and dealt with. Best of luck to you. You sound like a catch.",
            "[deleted]",
            "Good for you OP! You are handling this great, way to be strong and confident. Way to be mature. If you keep at it you will find someone much better for you.\n\nA cathartic breakup album I like: Beck Sea Change.",
            "You are so young and you have a good grasp of reality, really you are on the right path. If you can, go see a therapist for a while to help you move past that hurt. i went through all in my early 40s and it was rough after 15 years together but I prevailed. I'm still alone but I'm at peace, if I meet someone it will be meant to be. Be strong. 💜",
            "Man you're dodging a massive bullet, I read the og post and damn bro she was never into you. Good luck out there and don't beat yourself up. There's women out there who will throw themselves all over you if you're a catch. So don't settle for less again.",
            "My first marriage ended in 2012. Even though it was a bad marriage and my ex-husband is a person who will likely never be able to be a good partner after all the trauma he suffered as a child and young adult, the end was hard. I kept imagining it like I was on a path and had some idea of the future and then suddely I found myself in a river on the way to a waterfall having no idea what was ahead and how I'd survive the fall. \n\nYou are still really young and truly let yourself learn from this. I imagine you are better aware of what you need from a partner and what is required of you than before. It will hurt and there will be harder and easier days. Don't beat yourself up on the hard days. Find things you like to do, like jogging, that make you feel good. Try and meet people with similar interests as friends and get back to what you like. \n\nI hope you have support from friends or family for this hard time and it will get better!",
            "Just read both posts. Speaking from a female perspective, sounds to me like your wife isn’t happy with her life and thinks that the problem is that she doesn’t love you when really it’s because she’s not embracing all the positive experiences you guys share (dates etc) in a positive way. \n\nUltimately she’s already checked out of the relationship and I don’t think she’ll realize the reality of the decision she made until down the line when she realizes she’s still not happy even though she’s single. \n\nI think you made the right call, going through a divorce sucks but no point holding on to someone who’s not holding you back. You’ll find someone else to love and appreciate your character and the work you put into your relationships. \n\nBest of luck!!",
            "A new door has now opened for several new possibilities! Stay strong, most importantly stay positive and you'll overcome anything that comes in your way!",
            "I wish you the best, brother.",
            "So sorry this is happening to you, but it’s definitely for the best.  You are SO.YOUNG.  If you were ten years older, you’d still be young!!!  There is so much to life that you’ve been missing out on in this passionless marriage.  Take things slow, heal, and ENJOY your life.  It may take a while, but you will find yourself.",
            "The right person is going to appreciate everything you did that she didn’t ❤️ don’t be discouraged, you’re very, very young (albeit older than me) and perhaps married too young but it’s a learning curve, you can only become stronger through this. I wish you luck, love and happiness",
            "Go forward. You young you have a whole life. You have to live one day at a Rome for you.  Yes you will find the right person.   I did after a 42 yr old marriage that ended in divorce 2 yrs ago after my ex  cheated and remarried",
            "Don't worry bro you got this. Just think of it as a new adventure. Make sure to have fun and make the most of it.",
            "I mean it sucks,  but it really sounds like she isnt willing to put the effort in. You tried and she didn't and this is were it's at now. I feel she didn't understand that a relationship requires both parties to work on it.",
            "All relationships end at some point one way or another. You sound like such an empathetic good soul who is going to make your future partners so SO happy. I am glad that you didn’t spend thirty years with a roommate for a partner and hope that you two did make lots of good memories along the way.",
            "“I came to the realization that we all have such little time on earth and I don’t want to waste it moping around.” \n\nThat’s an excellent way to put it. Major props to you for realizing that and having the right outlook on this. It sucks for sure, but it’s better to start working on yourself as soon as you can and get through it.",
            "What doesn't kill you makes you stronger.",
            "Honestly, you sound like an amazing partner and a great catch! I can't imagine you'll have a hard time finding a new partner. Don't be afraid to be a little selective, you deserve a partner who puts just as much effort and love into you and your relationship as you do!",
            "Good thing you found this out early on bro. Imagine the pain and waste of time if she cheated and led you on for the next 20 years after you already had kids together.\n\nYou dodged a bullet, you need to celebrate with your friends and have some alone time too. Just appreciate life and be happy that your future will not be with someone who is not right for you. You'll KNOW when you meet the right girl, just be patient and don't let people's beauty distract you from a mismatched personality.",
            "I hope you find someone that makes you happy and appreciates you! You deserve to be happy, OP.",
            "From what I know there are certain actions and attributes that kkep women interested in a relationship.  Dan Bacon on YouTube,. Marni wing girl, etc I think you will find it interesting.  There is also the possibility she found some newness in another relationship, and women have a tendency to pull away.  I can tell you if you work on yourself, get in your best shape, get to your best financial position, you will have the satisfaction of her telling you she made a mistake!  But make no mistake my friend, if you have a woman that wants to leave you she is that way, don't take her back move on.  You can't overcome the past! Look forward and have a great life!",
            "Man, i'm going through the same with my 8 year gf. This is really sad and hard. I wish you the best and i'm sure we  all will meet that perfect someone who loves us for who we are. Reading you has helped me stay strong too. Take care! :)",
            "You need to understand that you aren't responsible for her happiness.\n\nShe is.\n\nYou didn't cause this and you can't fix it.\n\nWork on being the best person you can be and see the warning signs in a relationship sooner and end things before they get this bad. Things were already broken when you married her and, based on what you wrote, she was never a good partner.",
            "[removed]",
            "Hey man, watch corey Wayne on YouTube and read his book: 3% man. It changed my life and Made me understand So much about women. Please give it a try! You can read it for free on his website or for a few bucks on amazon. I promote his work to every friend that strugles with women. Start with the video: “do this when she backs away” and let me know what you think.",
            "Congratulations mate! And I mean that in all honesty because look at the life you would have lived had that state of the relationship continued till death due you two part. God that sounds terrible. Now you have the opportunity to try again with someone new which is exciting! So wishing you the best of luck, you seem like a husband others would wish they had.",
            "I’m sure someone has said this already but at least you can come away from the relationship knowing you put your best foot forward through and through. I don’t even know you but I’m proud of you! Keep your positivity. It’s better to cut ties from someone who wasn’t willing to put in the same amount of work you put in. Sending my well wishes to you.",
            "There doesn’t seem to be anything else you could have done, man. It’s a shame the way things turned out, but you’ve got a level head on your shoulders and I have absolute faith you’ll be able to find whatever it is you’re looking for out in the world! Just remember that you deserve all the happiness you find along the way, and when the lightning starts striking while you’re filling your picnic basket up, sometimes it’s best to make some cocoa and just enjoy the storm. \n\nSending good vibes your way, friend!",
            "[deleted]",
            "You tried. It will be difficult but you deserve better. Move on.",
            "I’m glad you have an answer now but you are right. She needed to choose to work on it. It seems like nothing is glaringly wrong, like abuse, and I fully believe “the one” doesn’t exist. You just love someone and decide you want to make it work because of how much you love them. Sometimes you love them enough to make it work, sometimes you don’t.\n\nI do not think you got married too young (I think many young marriages can work out... of you want it too). I hope you find a healthy way to move forward and I wish the best of luck to you.",
            "Remember you are not responsible for her happiness.  It sounds like this was completely external and had nothing to do with you.  SHe needs to be alone for a while I guess.",
            "I'm so sorry I hope you feel better soon. You have the right idea move on since you can't control it. I was your age when I was in the same boat with my ex husband. I was feeling the same way as your wife. I will say its probably just as hard on her as it is on you just give her the time and space she needs. Eventually I figured myself out but he was too hurt to work it out after and he moved on. I'm very haooy for him and we stayed friends in the end. Please don't beat yourself up this is something she needs to work through. Show her you're ok and stay friends if you are ok with it.",
            "You have the right mindset when it comes to trying to better yourself and it’s unfortunate that she did not have that. She probably feels like this “just happened” but she made these choices. You are young, you guys don’t have kids, and you have learned so much about being a better partner from trying to fix this which will serve you a lot in future relationships!",
            "As a relationship coach this kind of thing tears me apart. I wish I could talk with her. I filed for divorce in 2017 and dropped it 3 months later and now I'm more in love with the man I married than ever before. I feel so grateful that I got the chance to better myself by taking responsibility for my own joy and happiness. It's not your job to make her happy, it's hers. I'm so sorry she didn't learn this yet and is putting it on you. I know that's what she is doing because I did it myself and only now am I accountable for my own happiness. Feel free to PM.",
            "Feel free to express your emotions in healthy ways like crying. In your life, this is a major trauma. If you lost a limb you'd be out of comission for a while. Emotionally this was a major trauma. You're emotionally dismembered currently. Feeling all of your feelings is normal. There are people here who love the respect you've had, not only for that person, but for yourself. You are a strong person, and its our ability to feel and process emotions that build even more strength.\n\nKeep doing what's good for you as long as you aren't hurting yourself or others :) as an alcoholic, I would turn to to drinks. Thats an example of a bad way to cope. Thats not to say, you cant have one night with the boys. But one is enough. After that its at risk of being a crutch. Then you lose the strength and need the crutch. Don't  be like me, be like you and give yourself the 110% you were giving to that relationship, give yourself the same patience and love that we know you have within you.\n\nStay strong, brother.",
            "Sorry to hear this. I hope y'all learn from your experiences being married. Although I'm sure I can't imagine what you're going through, both of you sound like decent people and are handling the entire divorce maturely. I hope y'all can be friends and end your relationship with no bad blood. Take care.",
            "You're still young, any woman would be lucky to have you, you go through so much effort. Your wife sounds indecisive, immature, and doesnt value you or your marriage. Her deciding to end things now is allowing you to dodge a bullet, friend.",
            "Wishing you all the best ❤️",
            "After reading your original post and the update, I’m happy for you that you will likely go on easily to find someone wonderful to spend life with that reciprocates love,intimacy, and compromise. You sound like you put effort into relationships and are willing to admit there are areas to improve, which most people don’t. Keep your head up, and be glad this happened now  versus 10 more years of you being strung along... you deserve better.",
            "I’m so sorry that you worked so hard and it came to nothing. \n\nThis one is definitely not on you, and even more; you’re leaving this period in your life as a better person, someone who has been working on himself all this time.\n\nwhoever you find next will be lucky, because you know how to bring something to the relationship, and that’s not a small thing. Good luck OP!",
            "You did the right thing. It will hurt for right now and a while into the future. Take some time to be single and heal. Don’t jump into a rebound relationship - it’s too risky that you’d get caught in a wrong fit again. \n\nThink about you want in a partner. Talk to your friends and ask them what qualities in a woman they would pick for you. They might not overlap, and you should delve into the mismatch to find out why. You might realize some of your choices don’t actually work for you. Figure it all out. \n\nI promise you, time will heal. And one day you’ll just feel like youve processed your marriage and put it to bed, and you’ll move on. And when you’re not looking, you’ll meet someone perfect for you and you’ll be happier than you had ever imagined. And you’ll know in your heart that you made the right decision.",
            "You're so young. You get a chance at a different life.... feel the heartbreak. That's okay... Enjoy getting to know yourself... It'll be interesting when you look back on this time and see how it contributed to you who become.  Best of Luck!  Now go enjoy the shit out of this life.",
            "Its okay to feel sad, really feel into the sadness with some emotion releasing meditation. Dr. Aziz has a good podcast on it (dealing with breakups episode)",
            "Let her leave and don't look back. She's sleeping with somebody else or she will be the second she's gone. I'm sorry to be blunt about it but it's true. When a woman says that she loves you but she's not in love with you anymore, it's the biggest b******* excuse ever made. Women say crap like that because they don't want to feel guilty when they screw you over. American women are excellent that doing bad stuff and then blaming you or making excuses why. Find yourself somebody who actually loves you. I'm sorry that it had to be this way, but too many men have been in this exact situation. Just be happy that you don't have children in the middle of this. I'll pray for you",
            "You’ll be fine, some people don’t want to put work into relationships and will always think they can find someone who can make them happy and feel loved at all times. That is a very selfish attitude, it’s not your job to make her feel happy every second of every day, that would be exhausting!She will never be happy if she expects a perfect marriage, that’s a fairytale someone fed her in life . Me and my husband fuss and don’t agree on just about everything but at the end of the day we are perfectly content with our life together, only because we understand that we are individuals and have our own ways. You will find someone who believes that marriage is worth fighting for . I’ve been divorced and tried to stay together and thought I wouldn’t ever do it again, I didn’t tell my current husband I loved him for over a year we were first dating, we were together for over 7 years before we married and have been married for 8 years. Like I said you’ll be fine, just take the time for yourself and someone will be there for you when your ready.",
            "Honestly, a sexless marriage was the obvious clue.  My gut tells me you will be happier without her.",
            "Excellent. You're on the right track.",
            "Man - That's a horrible place to be.      First thing is to get a good divorce lawyer.      Then try to function, in your everyday life.    Do not move out of the house.  Have her move into a different bedroom.    Have minimal spoken word, with the wife.   Block her on all social media.   Just have cellphone number for contact.    Request text message only.     Be comfortable with the silence.    Take your time to process your feelings.    If the wife is in the house, have minimal contact - don't need to be reminded too much.    You will have the same emotions, as a bereavement.\n\n* Shock and numbness – this is usually the first reaction to loss, and people often talk about \"being in a daze\"\n* overwhelming sadness, with lots of crying\n* tiredness or exhaustion\n* anger – towards the person you've lost or the reason for your loss\n* guilt – for example, guilt about feeling angry, about something you said or did not say, or not being able to stop your loved one dying\n\nThis will take time to heal.    Set yourself a purpose, something you have wanted to do.     Go to the gym, remain fit.    Make yourself a better person and be kind to other people around you.    Surprising that helping others, helps with your own healing.  Become an even better person.      Have good fortune going forward.",
            "Hey man. When I was 24 years old I had to leave my ten year long partner for reasons unrelated to your story. I was devastated. I was sure nothing would ever get better. I’m 29 now and happy? So happy that it makes my time with my ex look... very unhappy, despite previously thinking it was my “happiest time”. Perspective and time really do heal all wounds. I’m genuinely excited for you to find the right person.",
            "Very sorry to hear that, but you're really young and this is definitely for the best. Life is too short to be with the wrong person. Your wife doesn't appreciate you, there are plenty of women that will.",
            "I am sorry for your loss. Divorce is like grief. You grieve the death of the marriage.  The lessons you learned from this change in your life will serve you well in the future.",
            "My dude, don't make the mistake a lot of people make and keep unnecessary contact or share past memories with each other.\n\nI almost God damn guarantee that she will be in contact with you looking for some kind of reassurance whether it be in a month or 5 years. Take pride in this, not because you're playing games but because in the end it shows yourself that you were always worthy and it was the other person.\n\nUse this is become your best self. It's funny how we look back on relationships, how the one we thought we loved just ends up being a funny story between you and your next wife.",
            "good for her, remember she is not the only person for you.....time to figure out what you really want for yourself",
            "I'm sorry to hear that you're going through this, but it seems that you're a really grounded person and will land on your feet. You have so much life ahead of you!",
            "You're still young, it probably doesn't feel that way but you have plenty of time to find someone else. Also, you'll be doing it with a whole new perspective of what the adult you wants in life, not what you thought you wanted when you were in your late teen's and early 20's.",
            "Man THIS IS YOUR MOMENT. It took me so long to realize that these moments are your crucial signal to become the man you need to be. No more nagging wife, no more sulking over her games and the hurt she brings. You COULD NOT become who you needed with her in the picture. Life will sort things for you. Something about her was preventing who you should be. Get in the gym, chase that dream goal, do what you need to develop because no you’re free from that stress. I’ve been here with someone I thought would be my fiancé. I am 1000% better than I would be if she didn’t mess it up. She helped me be who I am today and was an experience to learn from and that’s all.",
            "Sorry to hear this brother\n\nBut she might have found a new partner or someone on her mind.\n\nIts better to move on focus on yourself.\nExercise,reading,following the hobbies and work on the finances.\n\nIn the long run , those who throwaway the loving partner  either live in regrets or always pretend to be happy.\n\nThose who are always honest and faithful ends up getting what they deserve.",
            "Hey, I read your original post, and want to say I'm in your shoes. I'm a female, and my husband ((soon to be Ex)) all of a sudden decided he doesn't want a relationship. I've come out of this relationship pulling all of it for over five years. I'm in a much better place now. I feel amazing that I no longer have to walk on eggshells around him.",
            "You are such a good partner that supports your significant other! I wish my bf can be at least 10% like you",
            "That's a good positive attitude! Hope you find your love one day! But for now, love yourself first.",
            "Dude I loved your last paragraph - it's so true.  I'm really sorry this has happened, and even though you've been through a lot you're still really young and have your whole life ahead of you!  You don't have any kids, and you have the freedom to be a 20 something year old!",
            "It was absolutely heartbreaking to read your original post, but this just shows no matter how much effort we put into a relationship if the person is not right for us, they just aren't right for us. On the other hand, I am really happy that you got rid of someone who doesn't appreciate you as a person, and all the efforts you were willing to put to make things work. I am 120% that the right person for you will be absolutely over the moon for you even if you put HALF the efforts you were putting in to make it work with the wrong one.\n\nAnd all the way from this side of the world I wish you nothing but the best and happiest of lives, treat yourself kindly (you deserve it!), keep the positive attitude and the good work. It will take you very far. And not only to find the right person for you, but closer to fully loving and appreciating yourself.\n\nI wish you the best, OP! :D",
            "Youre doing it OP! One step at a time!\n\nHows life at the moment? :(",
            "This was a really oddly comforting post. I am not going through anything similar but your post still brought me a lot of peace. I know you’re going through something awful and I don’t want to make this about me, but I guess I just wanted to let you know that you sharing this really struck a cord with me. Made me feel like any anxiety I have about the future or worries of things that could happen...I just have this feeling that you know what? It WILL be okay, no matter what. I’m not an easily moved person, but this was a weird type of inspiration- so thank you for that. I hope life continues to improve for you, this is the start of your upswing",
            "Idk if you check your throwaway, but I really hope you’re doing great right now man.",
            "You're both brave and smart for helping everyone move on so you both can feel happier. Remember it's okay to grieve. You'll have days of relief and days of sadness. That's okay.\n\nWhenever I'm between relationships I like to try to be proactive and seek out experiences and information that will help me grow and give me better tools to use in my next relationship. I highly recommend \"Seven Principles for Making Marriage Work\" by Gottman. Unlike most relationship \"expert\" advice, the book is based off of extensive, scientific research. I've read it many times and am reading it with my current partner rn. It's a pretty easy read, and the things you'll learn from it will help you in friendships, work relationships, and family relationships too! \n\nEnjoy this time of endless possibility and be gentle with yourself 💙",
            "Sorry to hear that. But judging by this and your original post, you are much better off without her. Find someone who puts as much effort into the relationship as you do. Idk, it just seemed like you were constantly changing yourself in order to please her when she never stopped to think that maybe she was the problem.",
            "Dude you dodged a bullet. She's given you bull crap answers to your pleas to stay married. It was never about you. It's always been about what she's wanted. She probably already has the next objective in her sights which pushed her to finally cut the cord. \n\n\nShe did not \"go see her sister\" even if that's what the story her sister covers for her with. \n\nYou can never win her over because she thinks she can do better. You were loving and loyal but her friends/society tell her to play around only to \"settle\" when she's past 35. Be prepared for her to circle back when life doesn't go her way or when she's older and all the good, loyal men are married or have given up on relationships\n\n\nGo on YouTube and watch \"Better bachelor\". You'll see your situation much more clearly. \n\n\nIf you let it sit as is, you'll think you are fucked up, unlovable, etc. You're only seeing the act she wanted you to see in this breakup. You are worth more than you feel or how this relationship attempts to portray you. \n\nDon't let this sham marriage ruin the next one. Don't go into the next relationship blind. And especially don't take her back because she'll just casually leave you again.",
            "You sound like an amazing guy! You are going to find somebody and be very happy, I’m glad you got out of this marriage while you were still young, learned your lesson, have grown, and are now ready to live a happy life with the right person, when the time is right!",
            "You'll hurt for a good six months, and then another six months after that of ups and downs. It does get better, I promise, and you'll move on to a new life. The right life for you, and then you'll have a better understanding of fate.",
            "Jesus, you’re 26! You have your whole life ahead of you!\n\nYour wife did you a huge favor in initiating this divorce. \n\nPlease learn from this. You’re too young to be trapped in a sexless, loveless marriage. If you’re the only one trying, that’s not enough. If your partner doesn’t treat you well or show you she lives you, she’s not a good partner and you’re better off alone (and/or finding someone else).",
            "You sound like a really good dude and a great partner. You deserve someone who is going to love and cherish you and put just as much into the relationship as you do.and your gonna find her",
            "[deleted]",
            "Crazily above and beyond. You sounded like an utterly amazing husband. You'll find the love you need one day FO SURE. Good luck in your self discovery!!!",
            "Ask her \"What is his name and how long have you been cheating on me?\"\n\nDo not say another word. When she asks you a question, do not answer it. Just stare at her.\n\nDon't tell her how or what you know. Re-Ask the question if necessary, but say nothing else.\n\nIt will take a few minutes, but she will start to tell you part of the truth. She will admit there is another guy but they have not had sex, or maybe she will claim it was only a kiss.",
            "Can someone honestly explain me why u marry so young?",
            "I wish I was as brave as you are. I need to do the same honestly.",
            "Idk if you’ll even read this.... but I’ll share. I am 41 years old, and very happily married. I was married to my ex-Wife for 7 years, from the ages of 23-30. We married in Las Vegas, and lord we went on a million wonderful adventures together. We both had great careers, and life was good.  Fast forward to May of 2008, things are very different between my wife and I.  The year leading up to our demise was filled with her making statements about not loving me, and wanting out. It absolutely broke my heart for years to come. I cannot express the importance of putting yourself first. I remarried 2 years later, and it was a mistake, totally. I was so hurt I ended up marrying a woman with two almost teenage daughters. I didn’t love her.... it was a short marriage, with the both of us leaving on good terms. So by 2011 I’m single, and ready to stay that way. I was at the point your at right now. I took a few road trips alone, and began going to the movies and out to eat alone. It was nice to know I didn’t need to be with someone to live my life. The years that followed were fantastic(single years 2011-2016). I can’t say enough how important it is to master yourself and love yourself before committing to another. It seems cloudy right now, but I promise it clears up and your wiser, and more at peace. Good luck my friend.\n\nEdit: I was 32-37 in my single years.",
            "I didn’t see your original post until now but this is for the best. You’re still very young. You sound like a great catch. Don’t change. Just keep your standard for who you date very high.\n\nWhen you said she wasn’t happy with your level of chores around the house, I had a feeling she taught you to do everything because of the comment your parents made about her being lazy.\n\nIt sounds like you gave 110% and she gave 50%.\n\nAnd you’re exactly right, life is to short to waste time on someone who only loves you 50%.",
            "Wow, thank you so much for commenting. I know I need to be single and be comfortable with myself. It’s something I struggle with because I’ve always had someone. So the desire to have someone and not be lonely is there, but I just have to push past it and be alone. Master that and then I can truly be happy. So thank you again.m for commenting. Glad to see you are happy now.",
            "I have a feeling this is going to be the best thing that ever happened to you and the worst thing that ever happened to her. Unfortunately, some of our mistakes are only clear in hindsight. You sound like a caring partner who put in the work to make it work; she was unwilling. You both are very young, and this will be on your side as you navigate your way through this emotional time. Someone is going to appreciate you and you’re going to make a great husband ... for someone who is also looking to put in the work. Relationships are a lot of hard work, and one person cannot do all the heavy lifting. You can only try so much and be met with so much rejection before you have to accept that it is what it is and you’ve got to cut your losses. I’ve been there.  It will get better, but it’s pretty painful at first.\n\nI wish you the very best. She might change her mind at the last second because she’s scared; don’t give in, OP. You deserve to be someone’s first choice and you will be.",
            "Good for you for snapping yourself out of it, but also don't worry about being sad. It's ok to feel bad, and to not expect it to get better right away, especially if you are dedicated to making improvements. Just do be patient with yourself. There are better and worse days ahead, but each dip gets shallower, and each peak gets a bit higher. A therapist once told me that pain is like carving something into a tree. The pain itself never vanishes, but proportionally to the size of the tree, it gets smaller as time goes on and the tree grows.",
            "Have you spoke to her about things you can improve? Do you help with house work? Is your sexual life all about you and she just gets done what you want or do you actually listen and figure out what she really likes? Do you do things she likes or ask what she wants to do? What are her passion, her hobbies? Can you be a part of some of them? It's not a one day decision that she doesnt love you. And I'm not saying it's a one way street either, but do you know what her love language is? Maybe you're doing the love language you think is right for her vs what she really needs. Look up love languages and talk to her about them.",
            "i’m sorry.  this is tough.  but you will survive this and great things will come !",
            "I wish u all the happiness my dude. Ur both so young and u have some much of ur life ahead of u! 💙💙",
            "You’re both married at 26.... of course you’re not happy",
            "Time to buy a very good gaming pc.  And get a very good lawyer.",
            "Mate reading this crushed my heart. It really fucking sucks to have found Love so soon, only to lose it like that. I read your other post. You tried so hard, gave it your all. And you would have given even more if it meant getting back the person your wife once was. I recently, and still am, experiencing something similar to what you're going through. Even though we're about 7 years younger, my ex and I, who were together for much less time than you and your wife, we went through what you've gone through, in much less time. She lost her feelings for me. Admitting to me that I pushed her away by overwhelming her with my love. These are something's that Ive come to know. They apply to my situation, so maybe they apply to yours.  I was BAFFLED when my ex broke up with me. I put in so much effort, bought her surprise gifts and made time just for her and did my research into the things she was into so we could have common interests! Why would she leave me if I put in so much effort to be the best boyfriend I could be? A good friend of mine helped me realize that it likely wasn't me. My ex has a history with mental illnesses that she refused to address. And that those mental illnesses made her think she isn't deserving of someone that loves her. That she isn't deserving of being loved. She told me she HATES therapists, and would never return to therapy after a single session she had. With that having been said, she wasn't willing to change herself to be a better partner, not just for herself, but for you. She wasn't willing to put in any effort into the relationship. It wasn't my fault I had so much Love to give, she wasn't willing to accept it. In your relationship, your wife may not be willing to accept your Love. Why? I have no idea. In my case, mental illness is the probable cause, but since every case is different, I can't say for certain what your case is. Perhaps since you both married so young, she may have seen her marriage as a roadblock in her career path. And she wasn't honest with herself and what she wanted, so she may have resented herself for not making a change. Just know that is 10000000% NOT your fault. And I'm inclined to say it isn't her fault either. Of course it sucks Major Ass, but it would be wrong to guilt trip her into a relationship. She wasn't willing to put effort into rekindling your relationship. My ex was the same way. Even though I never changed who I was, and I only ever tried harder to make her happy, she still denied me. Just like you only ever tried harder to be a better partner, your ex just wasn't willing to accept it. The facts that you read books and were willing to go to counseling with and for her shows that you had much motivation, and Love to give to her. The fact that she would get angry when you merely brought up the topic of rebuilding your relationship points to a larger problem she may not be sharing with you. Perhaps I am wrong, but I speak from my experience. My ex shared less and less of her life with me as she lost her Love for me. I'm sorry for what you're going through Brother. You tried so hard. But it wouldn't have mattered if you tried harder. Ultimately the problem lies within her, and as long as she refused couples counseling and reading books to even try and rebuild your relationship, nothing will change. Relationships are like chains. Chains are only as strong as their weakest link. Like Chains, a Relationship will begin to crumble if one chain looses it's strength. If one partner decides to stop putting in effort to heal the relationship, no one can prevent it's collapse but the partner that gave up. Nobody can change her mind but herself, and until then, all other attempts will likely end in disappointment. Maybe if you did something of grand proportions, she would fall in love with the sight, but a relationship is about loving someone at their worst, as much as you love them at their best. If she doesn't love you right now, and you love her as much as you do, you will only experience pain in your attempts to regain her. I pray for the best for you brother, we have a long road in front of us. The good thing is that we aren't the first, or only people on this path. As bleak as things may seem, believe me, they get better. I am now much better than when I was when my ex broke up with me. I lost my appetite for about a or two week, and even developed an illness due to the stress she put me through that lasted two weeks and may have even left me scarred! And although I know it is wrong to put blame on others, it can bring me comfort to know that our relationship failed because of something lacking on her end. What matters, is that I don't harbor negative feelings for her. Rather, my goal is to come to a point of apathy. I wish to care for her as I would any passing stranger on the street. I'll use what I can to make me feel better now, as long as I know that it won't hurt anyone, and won't lead to me holding a grudge against her. I hope you found some use of my comment if you got this far bro, I pray things will go well for you and your wife.",
            "Good on you, she drained you emotionally and psychologically. You many not realise it now, but she wasn’t worth it- all she did was complain about your relationship and when you both agreed to try and fix things she completely refused to. She treated you more like a manservant and not a husband to love and to be intimate with. Someone out there is going to be perfect for you; and she wasn’t it. Hope you are well :)",
            "I spent 15 years with a woman, two children, trying to figure out if we loved each other, or hated each other.  Finally decided it was both.  We came back from a week long vacation, and she packed up in the middle of the night.  Moved in with her tennis instructor.  Her tennis instructor??? How fucking clichéd is that?\n\nIn the end, it was for the best.  I took the kids.  Five years later, I’m remarried.  Happy as fuck. The kids are great.  The divorce was the best thing that could have happened.\n\nShe got pregnant with the tennis instructor.  He’s pushing 40, can’t make a living giving lessons, so she’s supporting him and the kid.  He’s thinking about going back to college and wants her to pay for it, but refuses to marry her.  She’s miserable.  Karma.\n\nLong story short, better to find out about it when you are only 26 and haven’t sunk more wasted years into it.  Wishing you the best.  The next chapter will be better.\n\nP.S. A couple of suggestions.  Don’t go looking for love.  Avoid the apps and websites.  My grandmother once said, “You will never find love.  Love, when you are ready, will find you.”  Give yourself time to heal.  Find love inside yourself.  When you have love to share, then love will find you.  I knew my wife for years as a friend.  Never thought of her romantically, then one day, BAM!",
            "After reading the original post, I am actually glad for you that she chose divorce - at least both of you will feel happier in the long run and find the happiness that you both deserve. Take some time off to recover from this and think through what you want for your next relationship (nobody is going to rush you to get over it). :)\n\nOh and most importantly, when you become a better person than before etc etc, PLEASE DO NOT ACCEPT HER if she ever comes back to you with all that \"I realised I am still in love with you, can we get back together\" nonsense. You saw how much effort she was willing to put in during this marriage, and you know how much effort you put in to salvage the relationship. A leopard never changes its spots, so don't get yourself into that same trouble again. You deserve better!\n\nStay strong!",
            "[deleted]",
            "Reading your original post, the only thing that I can say is that the marriage was over before it even began.\n\n> My wife and I met close to 6 years ago. Crazy over each other and really  intimate. After we got engaged the intimacy started to die down and a  couple months before the wedding my wife cut of all sexual acts stating  she wanted to wait until we got married. \n\nThis indicates that she had already checked out of the relationship months before the marriage, and just wanted to get the marriage thing done. After all, why would she expect things to be different after the marriage in regards to her libido? She wouldn't, but since you probably still wanted to do it with her, it was a carrot to be dangled in front of you to get to where she wanted to be.",
            "the fact that she ended intercourse and said wait after we are married seems manipulative plus a person sex drive does not go to zero overnight drop in intimacy is allways a red flag and need to be addressed ,you never said what feeling rejected over the years felt for you i wanna know ,plus relationships are a partnership one party doing all the work is never good sign ending it here is a blessing ,i hope you see this as a lesson that i also learned ,never take upon your self to make  relationship work it has to come from both sides ,do not keep score or anything as long as both of you are making an effort ,intimacy makes relationship stronger when it drops you should make the effort to work on it right away even therapy if you need to bcz it is the ultimate bond lovers have .",
            "It doesn't feel like it today but it gets better with time. Allow yourself time to enjoy your own company again and it won't be tht hard to meet someone who enjoys you too. Don't rush into anything. The end of the rainbow doesn't always contain gold, sometimes there is a human dressed in condom wrappers playing pretend. You will be alright. Chin up!",
            "Love is temporary, doom is eternal",
            "Wow man you’re so brave, you got this man, I wish I had your strength",
            "This is why we have a very high  divorce rate . All marriages have difficult  times . We sometimes don’t know what we’d do without them in our lives and sometimes worry about taking them out and spending the rest of our lives in prison! Marriage is very hard work just like being a sane , rational parent is when the kids make us want to run away and change our names. The marriages that last are the ones that both sides work at staying together every day and realize that that is why you made the commitment for in the first place , better or worse!",
            "You have got an opportunity to find someone who respects and loves you. I think a lot of your wife’s issues are laziness plus she will never find happiness as she seems an uncontent person. Stay strong.",
            "The thing is that you do TOO much and she takes you for granted.  HER LOSS NOT YOURS! Let her be, she will realize in the ens what she's lost.",
            "I'm really sorry to hear this. It's very clear that you did all you could. You're a real catch, and you're going to make someone else very happy one day. Now it's time to look after yourself with compassion and move into the next stage of your life.",
            "My guy, get a love doll. Trust me it helps",
            "It's good that you don't have kid.  I am 32F and in same situation as yours. I have a son 5yrs old. We own a restaurant, where i work full time with no other jobs, while my husband have a full time job and help me sometime in the restaurant. My parents and my husband have no good relation.\nConclusion: I am stuck in my life. Where you are being able to  move on. Have patience and move on. I literally know it is very hard to break a relationship. Me and my husband tried many times but comes.to the point that we have to be together for our son.",
            "I read your original post. I married about the same age you did, very young. I have been married for 26 years and have an amazing relationship with my husband. We have definitely had ups and downs, been through tough times where we weren't sure our marriage was going to survive. The difference is we have both worked so hard to make sure that we could get through whatever came our way. Your wife had no interest in trying to fix the relationship, just to find reasons why it wasn't working. I think you are absolutely doing the right thing by ending it. Otherwise you will spend all YOUR time trying to make her happy, but this will eventually end up in resentment and bitterness. Move on and be happy, you deserve that.",
            "An end is always hard but if we stay where things are \"fine\" we never grow. Things would never be exciting, things would just always be just okay, if that.\n\nYou sound like a great partner from what you've written in both posts. You will find someone who will love the things you offer and you'll find someone who equally wants to give you the same. You deserve happiness and I hope you first find it within yourself... From there I feel you will eventually find great love.\n\nWhile this hurts, I do believe this is the best possible outcome.",
            "This is so hard but you have a great attitude about it. I wish you well, you deserve someone that wants you as much as you want them ♥️",
            "\"My wife finally got back yesterday from leaving to go see her sister.\"\n\nYeah, she wasn't with her sister. She's already got another guy on the hook.",
            "OP, I believe that the best men phase is between 30-40 yo , so you are almost there.\n\nImprove yourself and enjoy it.",
            "[deleted]",
            "> I came to the realization that we all have such little time on earth and I don’t want to waste it moping around. I want to improve myself physically, emotionally, and mentally. I want to just enjoy life and find myself again. So I’m going to do that and one day I might meet someone who is perfect to continue the journey of life with me.\n\n> So I’m still sad and hurt, but all that to say I’m moving forward and trying to be positive. Thank you all for your support.\n\nThat's sad man, but a good attitude going forward. Reading original it is not clear where things fell apart. Glad you don't have kids. The young and pregnant with a dirtbag's kid relationship post bum me out because that is something that will change the rest of their lives, in five years you have a chance to not be effected by this.",
            "I had to go through a divorce to find my true match. Now I need her to lose some weight....",
            "So she said she needed the weekend. You ignored that and tried to force intimacy anyway?",
            "I know this is an old post but I would bet lots of money that if you give it a few years she will absolutely realize what a dumb ass choice she made.\n\nAnd there will be no one to blame but herself."
        ]
    },
    {
        "post_id": "bp332x",
        "author": "ifbwisbwkanqozbfiwn",
        "title": "My(24f) dad (56m) committed suicide about 2 weeks ago and Im having a hard time grieving and being in school. I don't want to drop out. (UPDATE)",
        "url": "https://www.reddit.com/r/relationships/comments/bp332x/my24f_dad_56m_committed_suicide_about_2_weeks_ago/",
        "score": 8073,
        "num_comments": 271,
        "created_utc": 1557952174.0,
        "selftext": "Hi everyone, my last post wasnt super popular or anything but I just thought I'd update you guys anyways!\n\nAbout a month ago, I went back to school a week after my dad died, and obviously the last few weeks have been super hard. It took me awhile but I ended up getting back on my feet, ultimately school has become one of my biggest outlets as far as keeping myself busy goes. I ended up passing all my classes with all A's and B's and I'm on track to graduate this fall.\n\nThank you to everyone who believed in me and encouraged me to keep going. Its people like you that really helped me get through one of the hardest chapters of my life.. \n\nLife can be really fucking hard, so sometimes you just have to take the small victories where you can.\n\nMy Previous post:\n\n[https://www.reddit.com/r/relationships/comments/baw2yr/my24f\\_dad\\_56m\\_committed\\_suicide\\_about\\_2\\_weeks\\_ago/?utm\\_source=share&utm\\_medium=web2x](https://www.reddit.com/r/relationships/comments/baw2yr/my24f_dad_56m_committed_suicide_about_2_weeks_ago/?utm_source=share&utm_medium=web2x)\n\n# TL;DR I didnt drop out and I passed all my classes\n\n**EDIT Wow never in a million years would I expect my post to blow up this much. I dont really know what else to say other than thank you. I try and find little signs from my dad and today I think it's all you guys, rootin for me. ❤️",
        "permalink": "/r/relationships/comments/bp332x/my24f_dad_56m_committed_suicide_about_2_weeks_ago/",
        "comments": [
            "I didn’t actually see your initial post but this struck a cord with me as my dad committed suicide last month and I too now have choices to make about school. I’m so sorry for your loss but well fucking done with those results! 💗 as the Kris Jenner meme says you’re doing amazing sweety",
            "I didn’t see your first post but this update made me tear up. I’m just a stranger but I’m proud of you! It’s hard to focus on school when your head is elsewhere. You kept your focus and got great grades! Keep it up.",
            "Congratulations!\n\nAnd my condolences about your dad.",
            "I’m so sorry about your dad. I am glad you’re managing.",
            "Hi Friend. \n\nI just want to say that I'm proud of you.\n\n&#x200B;\n\nMy dad killed himself when I was 14yo (22 years ago). I didn't take any time off school either so, I just want to throw my 2c in based on my experience. You can disregard it if you wish.\n\nI'd like to say; PLEASE PLEASE PLEASE go to counselling regularly. Get it out. Talk about it to EVERYONE. Cry, be kind to yourself, you're human! Noone expects you to get over this in 2 weeks, 2 years or 20. My experience has influenced my entire life for better (and sometimes worse). Some days you'll grieve so hard it feels like your heart and brain might spontaneously combust and your'll hate god (or whoever) for letting humans feel this bad. Other days you'll hate on your dad for putting you through this and then on calmer days you'll feel overwhelming forgiveness and understanding for what a fellow human felt the need to go through with to escape their personal torture.\n\n&#x200B;\n\nI'm sorry for your loss. If you ever need to talk please hit me up. \n\n&#x200B;\n\nSending you love, light and healing. ,3",
            "Proud of you! When my father passed, all my support system left/I had dropped out of school. It is SO good you are keeping yourself busy + around people. Life sucks, but you're doin' good. Keep your chin up!",
            "I barely made it through school after my dad died of cancer, and only by staying high all the time and not dealing. I wouldn't recommend that, I hope you manage better than I did!",
            "Good for you for taking care of business. That’s an overlooked huge accomplishment. Anyone suffering from a loss who can still manage to get out of bed and carry on is a hero.",
            "Sorry about your dad.   \n\n\nIf you can turn that around into As and Bs, you are made of METAL and no one can stop you from doing what you want to in life. Remember this.\n\n  \nAnd be kind to the rest of us once you own the world, 'K?",
            "I might be a stranger, but oh boy if I'm not proud of you, you have a person in Mexico cheering up for you, I'm really glad you are bout to graduate in fall, and I'm really sorry about your dad, my condolences.",
            "So proud of you and I know your dad would be too. Lots of love ❤️",
            "Sorry to hear about your father. My dad committed suicide approx. 3 years ago. I'm just finding some normalcy this year, after coming to terms with it. PM me if you ever want/need someone to talk to.",
            "I'm truly sorry about your dad. I hope that you can navigate the rest of your classes and get yourself through graduation. Grieving isn't a step by step process, some days it will intervene more than others. Remember we're here on those days.",
            "I am so sorry to hear about your dad. \n\nMy father died in not great circumstances when I was young. I wasn't able to keep going with school successfully. Pleased you managed to pass all your classes - that is a huge achievement. \n\nI hope you manage to get support and therapy as needed.. Wishing you all the best in your next steps in life.",
            "Congrats on passing, and with such great grades as well! Your dad would be really proud I bet. My dad died when I was 11. If you ever want to talk, drop me a message x",
            "Sorry to read about your dad. I didn‘t see your original post when you posted it, but I‘m glad to read you‘re doing well. My dad committed suicide my last semester of college, about 2.5 months before I graduated. I took a week off from school, but afterwards concentrated on school (as best as I could). I ended up passing with all A‘s and B‘s. It‘s an incredibly difficult time as you‘re still processing everything while trying to maintain the life/work balance. It took me a good 4-5 years to really be “okay” with it all, and even after 10 years I still struggle from time to time. Take time to truly grieve. It’s important. Either way, I’m sure he’d be incredibly proud of you and what you’ve accomplished.",
            "So proud of you. I wish you the best",
            "Congratulations!!! Loss is never easy, and neither are words to convey empathy. It gets easier, as you know and are already seeing. Your dad wouldn't want you ruining your own life because of something he did, so be vigilant and stay strong my friend. Make him proud!!",
            "I'm really glad to read this. I was dealing with the death of both of my parents and strongly considered dropping out. I didn't but I barely passed and wish I had pit more effort into it.",
            "So sorry about your father. I cannot imagine the grief you are experiencing. I can’t say I would’ve been able to continue with school so congratulations! Make sure to give yourself time to process your pain and seek help if you need it!",
            "I am SO happy to hear this. I knew you could do it.",
            "Good on you! Life doesn't give you a guide or a cheat code, it's just life. Difficult, unfair, and tries to bring you down. I admire you, your strength and your determination, no words can make you feel better or replace the emotions you went through but you are strong little one. Stronger than I could ever hope to be. I'll keep you in mind friend.",
            "I’m so sorry to read about your dad. Congrats on your success, you deserve all the happiness in the world and he would have wanted that for you as well. Wherever he is, your dad must be super proud of his girl. ❤️",
            "I'm so sorry for your loss.\n\nI'm so proud of your perseverance. \n\nI lost my parents years ago, my dad to Alzheimer's in my 30's and my mom to just getting old (heart, but so many other things, too) in my 50's. \n\nI'm old, but I've discovered that the older I get, the more I appreciate both of my parents' wisdom. The stupid (I thought!) saying that sound like platitudes but are really the clues to how to live a good life as a decent human being. I wish you the same. It's very comforting. And you're never too old to miss your mom or dad.\n\nAs my parents told me all the time (to intense rolling of my eyes), \"A job worth doing is worth doing well,\" and, \"No one benefits from your education but you.\" Sounds like you've got those two down pat! I think your dad would be very proud of you.\n\nGood luck to you and in your future studies!",
            "I'm very sorry about your dad but you are doing well",
            "Yes! Good for you!\n\nSummer is perfect to take some time and work things out without the pressure of school.",
            "Sorry to hear that. I hope you have someone who you can open up with and let the healing process begin. Just remember, it takes time to get over something that huge. I lost my dad 12 years ago and there are still moments where I just want to throw up my hands and say fuck it.\n\nJust remember that time heals.",
            "My partner also went through the same thing around the same time too. It's really hard on her and she still has issues dealing with the problem. But she's goes to mutiple therapies and keeps trying her best. It's been a while now and she's not okay but she's doing her best. She's crying less and also wanted to give up on her Animal vet tech job. I told her that her dad wouldnt want that and she should keep at it because that's what he would want. He wouldnt want her to fall apart.\n\nI'm very happy to hear you stuck through your class. Make sure you see someone and talk to them about your issue. Like a psychiatrist or something. I'm not going to say life will be 100% okay but you can still find happiness moving forward.",
            "I'm really proud of you, and I'm glad school is helping and that you're on track to graduate!",
            "I lost my mom in 2018 she committed suicide as well. She was 44 and im 22. I follow the subreddit r/griefsupport it helps a lot.  If you need anyone to talk to tho, I'm here.",
            "Congratulations! I am proud of you!",
            "My dad did the same two and a half years go. I'm sorry to hear this happened to you. Please message me if you're ever feeling lost or alone.",
            "That is great news about your grades!  \n\nMy dad comitted suicide years ago when he/I were the same ages as you guys.\n\nI went back to work right away (which weirded people out) but I needed something to occupy my mind.  I do remember that it took me almost a year to be able to concenrate on reading anything more than a magazine.  So I'm impressed that you were able to keep up your grades.  That's a real accomplishment.  I'm sure your dad would be really proud of you.\n\nI'm sorry for him that his pain was greater than the desire to keep plugging along.  It's hard to get your mind around.\n\nHang in there.",
            "Good job! I'm 27 now and my dad took his own life when I was 19. I dropped out of school. Finally went back when I was 23 and I recently graduated nursing school. I'm proud of you for sticking it out! There is no way I could have.",
            "I’m sorry I didn’t see your first post, but so glad to see this update.\n\nMy mother is the one who has been through this, not me - my father and her mother got cancer at the same time. My father recovered, her mother did not. She stayed in that semester of her masters and didn’t get the best grades of her life (mainly Cs) but built a FANTASTIC career, with all of the compassion and strength and intelligence she learned from her mother.\n\nI know no words can make this better, but I know beyond a shadow of a doubt that your father would be so, so proud - and that you are building a life on the lessons you learned from him.",
            "For OP or anyone else having similar issues, try talking to the Dean of Students. I *think* every university has to have one (in the US, and I’m not sure about community colleges).\n\nI was severely depressed and tried 3 different antidepressants that gave me hives, followed by withdrawal symptoms. I managed to keep up with all but one class and I was able to work out a plan with my professor to finish the class after the semester ended. It kept me from having to take an extra semester of school.",
            "Very nice work, hope you can harness that discipline going forward in both academics and professional career, then you will be very successful! Remember to allow yourself to process your feelings as they come, and take that time out before making important or impactful decisions.",
            "Yayyyy!! Good for you!!!",
            "Kudos to you for being a survivor. I am sixty now but when I was 24 my soul mate took her life just as I was in final exam week of graduate school. I finished the semester, barely, and I know the difficulty of grieving when someone takes their life and leaves loved ones behind.",
            "Good for you. I'd only suggest that when school is done with, you take some time to properly explore your grief and let it out. You don't want to keep it bottled up and then have it affect you later on.\n\nBest wishes good buddy",
            "I am so proud of you. \nMy mom took her own life when I was 12 and it never gets easier and I realized pretty young that you have two choices in life when shit hits the fan to let it destroy you or let it motivate you. \nHang in there and keep kicking life's ass.",
            "I didn't see your previous post but this hit me. My dad died 9 years ago last December and at the time I was 12 and had not long started high school. Although obviously being upset I remember also being confused as to why this happened and why my dad decided that he preferred to not be in my life anymore. I don't believe it gets easier but I do believe you slowly learn to get used to him not being around anymore. It sucks.",
            "Oh, I'm so incredibly sorry to hear this and simultaneously impressed that you managed to pass all of your classes!\n\nPlease, please,please take care of yourself now that school is completed. Those feelings you have tamped down, may come back and you may have to deal with another round. It's normal. Its ok. Be kind and gentle to yourself. \n\nInternet hugs from a far flung internet stranger. I wish you health, healing and success.",
            "I didnt see your initial post but my heart breaks for you. My dad committed suicide when I was younger so I can empathize with some of what you are feeling. There is no right way to grieve so just know whatever way you feel right now is how you should be feeling. I know people say that there are five stages that you work through in grief, and yes I did experience them all, but you don't have to go through them one by one. There is no set time for each so called stage in my opinion. If you yo-yo back and forth then that's what you need to do, If you spend a week or years being angry (which may be what I did) then that's what you need to do. Processing sonething like this takes time, especially in these first few months and even in the years that follow. Don't be ashamed if you need to cry in the bathroom, take a mental health day, or buy some really cheap vases at the thrift store and smash them. Make sure you surround yourself with people who love you and will be there for you. A good support system is the best thing right now. People who will just be there for you, to listen to you and how you are feeling as time goes on. I highly suggest counseling-it doesn't have to be right now but maybe down the line. \nAlso take the wins when you can get them. Keep yourself busy and try to do things you enjoy. You are doing great!\nIf you need someone to talk to message me.",
            "I’m really sorry man. My (19) dad (55) committed suicide 2.5 months ago. I dropped everything. Quit my job stopped going to school etc etc. Let me tell you though don’t do it. It has hurt me so badly these last couple weeks both financially and stress wise. Now if you need to I’d contact your administrators and let them know your situation. Maybe they’ll allow you to push your classes out a bit so you have time to grieve. I’m truly sorry man but don’t make any rash decisions right now. It might hurt you more.",
            "Well done for staying strong. I'm so sorry to hear about your father. \n\nThe fact that you could get through this proves you're a very strong person. Good job",
            "I'm so sorry for your loss. I lost my dad in January to suicide as well, and it was incredibly difficult to function as a normal human for the first few weeks. Your dad would be so proud of this accomplishment! It takes some serious commitment and strength to pull that off and I'm sure you got a lot of those traits from your dad. Here's to more success and to always remembering those we lost <3",
            "Congrats! And I'm sorry for your loss. I lost my mom while I was still in school, and also went right back and threw myself into it and work to keep busy. I will heed some caution, though. While not everyone is the same and deals with their grief differently, make sure you are not avoiding it with school/work and allow yourself some time to sit and process it. Speaking from experience, i completely neglected to do that, and 10 years later I'm learning how much that effected me and my relationships.",
            "Well done, stay strong and stay focused. Keep it up, I can’t stress enough that things will eventually come to pass, it’s what you’ve achieved in that time that matters.",
            "Imagine how proud he would be of your accomplishment in the wake of such a loss.\nSays a lot about your resiliency",
            "Aw, OP. My heart goes out to you. \n\nThey say that grief is like a wave, and they're big and will hit you hard in the beginning. But there will slowly be more space between the waves, and they will get smaller and smaller. They'll still exist--in loss that's inevitable--but it will get easier.\n\nTake care of yourself.",
            "[removed]",
            "💔so sorry for you.",
            "Sounds like u have it all together. Stay strong and all the best!",
            "I'm so sorry. My dad committed suicide as well and time makes it get better. I think about him every day still. Sometimes I cry. I love him so much and wish I could bring him back but I can't. Time makes it better, I promise.",
            "I am very sorry for loss. \nI hope you aren't going through this alone.  \n\nPlease reach out to you school to let them know what is going on.  They may have resources and policies to assist you that you don't even realize you may need. \nMy very best wishes.",
            "Awww. My dad died in a sudden accident while I was in school. I’m doing great now, with a degree and a job, but it was the hardest time of my life to get through. Great job powering through!! If you need a buddy to chat with though, feel free to PM :)",
            "Two of my closest relatives took their own lives. Stay strong and focused. Forgive yourself. Love yourself.",
            "Wow I can’t even imagine what you are going g through but I am so happy to hear you are back in school and staying focused. My boyfriend of two years committed suicide when I was in college and I let it effect my grades and nearly lost myself thinking it was a good excuse to just completely abandon all goals. Eventually, I got back on track but in hindsight I wish I just focused on school and kept preoccupied with more healthy outlets. I’m sorry for your loss. It does get better after loosing a loved one to suicide. I know that seems impossible, but it does.",
            "You dont have a small victory, you have accomplished a huge one!  I'm sorry for what you are living with.  Loss hurts. Keep going forward and make yourself proud.  ❤",
            "Hey... My(then 21f) mom (47f) killed herself when I was in school, still am, community college.. it was fucking hard. I am so fucking sorry for your loss!!! Please know you are not alone and that you have the right to grieve in any way you choose. You can talk about him or not if you want. I love you and I hope you find comfort soon! Take a break from school if you have to, I'm here if you wanna talk about life xoxo goe",
            "I didn’t see your initial posts, but wanted to offer you my sincere condolences. I hope you have some good supports in place. Regardless, I recommend talking to a professional about what you’re going through. Grieving is always a long road, and this is sure to be even more difficult. Good for you for forcing yourself to go to school, and congratulations on your upcoming graduation. I’m sure your Dad is very proud of you. It might not seem like it, but as someone that’s struggled with depression try whole life I can say with confidence that he loves you very much. When you’re depressed you are so convinced of your lack of value you that you tell yourself you’re going to be doing your loved ones a favour. It’s so fucked up but your mind plays tricks on you:(",
            "I’m so sorry you lost your dad in such an awful way, but I’m so proud of you for not giving up. You’re a rockstar!!!",
            "I am so sorry you are going through that",
            "Congratulations on not dropping out.  You and your dad are the same age that my dad and I were when he killed himself in 2005.  Now that you have gotten past this hurdle, please take some time for yourself and get therapy if you haven't already.  I didn't do it for myself and I'm paying for it now.  Good luck!",
            "Hey, I'm so glad you made it! I'm sure your dad would be proud and wouldn't want you to drop out.\n\nI have no idea how it feels and can't even imagine it, but I always think those who passed wouldn't want us to fall because of them.",
            "Poor dear, my dad killed himself in 1971. I was in 8th grade. While I have had wonderful people and times in my life, who he was and what he did is always with me. Since his suicide, it become ingrained in me as an option for relief from my pains and problems. Funny thing is, it's sort of a fleeting thought that immediately fades away, but its always nagging.... stub my toe? Kill myself..... break up with my boyfriend? Kill myself.... burnt the toast?  Kill myself..... only quick passing thoughts to be immediately put aside... but always popping up in my mind... with counseling, and some anti depressants on occasion, I grew to understand those ingrained, fleeting thoughts as a basic learned response, not let them overwhelm or rule me.\nI had many happy years between then and now, and you will to. Stay strong, honest and reach out to others. Good luck little sister.",
            "I saw your initial thread and I am so glad you decided to keep going. You mentioned in the last post your dad wouldn't have wanted you to drop out and you made him damn proud! \n\nI'm sure it's still not easy, and it won't ever get easier, just a little more manageable everyday. Keep working hard for him and congrats!",
            "CIT here, totally rocks that you were able to still pass! I hope your seeeking services if you need them.",
            "YOU CAN DO IT. My baby brother passed away due to an overdose a few weeks ago and I feel it. I believe in you and wish you health, happiness and success. Be patient with yourself. You can do anything in this world.",
            "I didn't see your original but I am so  glad you are making it. Talk to someone, suicide is so much harder than just losing your Dad. God's peace.",
            "That's awesome! Good job! Will you go summer semester, or start again in the fall?",
            "Never never stop looking forward.",
            "Glad you made it though. I remember it was SO hard. 17yo, hopped on a plane to say goodbye to my dad over Christmas break. Stayed two weeks, enough for the funeral. Came back for spring semester, almost like nothing happened. One of the hardest times in my life. All of my family was half way across the country. I kept going back through our texts and HE always asked how an exam went and made sure so to say how proud he was. Hang in there OP, it DOES get better. It takes time and effort, make sure to take care of yourself and seek comfort from family and friends, let them be there for you. He would be so damn happy that you made it through this. He loved you and that is something that lasts a life time. Here if you want to talk!",
            "Your victory is inspiring, I'm taking this positivity into my day today! Thank you!",
            "I just wanted to say fuck those professors who offered no accommodations and encouraged you to drop out. After a bachelors degree and two masters, I’ve run into enough professors who were so far up their own assholes that if you were to take them out of their fantasy land collegiate bubbles and place them in the real world they wouldn’t last long. This is real life. Keep it up and I encourage you to look into therapy if you haven’t.",
            "Just remember: we are with you. :)",
            "I’m so sorry for your loss and admire your resilience and determination in the face of such sadness. Wishing you peace and ease in the time to come.",
            "You deserve happiness. Much respect to you.",
            "I was kind of in the same boat a year and a half ago.  My dad passed away with no notice, and I ended up not being in any condition afterward to continue on the last month of classes as a result of it.  Mad props to you, you're definitely stronger than me.",
            "Congrats.  I missed the original post.  That must have been a real struggle for you.  I'm sorry for your loss.  Having dealt with loss myself, I used my daughter's needs for stability in the home as a focus and outlet.  You accomplished an amazing feat.\n\nNow, take the time to grieve this summer.  You deserve it.  Nothing I say will make you feel better, but know that we are here for you if need support, a virtual shoulder to cry on, somebody to scream at (make sure you use all caps so we know you're screaming) ;)  Healing will take time and school will swing around again to give you more distraction.\n\nLet us, or at least me, know how things go in the fall.\n\nAgain, sorry for your loss.",
            "There is nothing I can say except to admire your courage to hold fast in the face of such grief.",
            "I didn't see your initial post. But i just wanted to say that I'm proud of you. I know it's hard to be at school after a tragedy like that. I hope you continue to do well in school.",
            "didnt see the initial post but im still very happy for you!! comes from a video game but \"the only way is through.\" Great job finish school strong and I wish you all the best",
            "Sending hugs and good job! You can do it!",
            "One option is to medically withdraw from your courses. If you talk to the schools counselors and let them know you aren’t capable of performing your best because of the circumstances, they can let you withdraw. A medical withdrawal does not impact your GPA, you will just have to retake the classes you aren’t finishing the following semester. Take time to take care of yourself.",
            "Hey, I'm so proud of you.  I can relate, although no one I know has died.  My fiance broke up with me the week leading up to finals.  We'd been together for 6 years and I didn't see it coming at all.  It was so freaking hard forcing myself to study and complete assignments when I was just broken on the inside, but I somehow pushed through and passed with all A's.\n\nIt's really hard to keep going when something devastating happens, and to come out with such good grades is nothing short of amazing and really speaks to your dedication and drive in the face of despair.  I'm proud of you!",
            "My dad committed suicide two years ago and it destroyed me for a while. You come to realize that life will always be different now but you have every right to grieve how you need to and for however long. 6 months or 10 years and you’ll continue grieve the loss. You’re strong and doing amazing.",
            "I didnt see the initial post but so proud of you for working through it and succeeding. That must have been hard, but Im sure your dad would have wanted to see you succeed, so I'm sure you have honored him by pushing through. Im very sorry for your loss.",
            "I didn’t see your initial post but good for you being able to talk about it! My brother passed away 2 years ago and it’s still something new to me and it’s hard to grieve. All I can say is talking to friends and family is the only thing that helps. I was in school at the time was able to sort of put those feelings off until I could finish, then I really took the time to grieve. Best of luck to you and remember people are always there for you!! ❤️",
            "My brother (and only sibling) jumped off of a 16 story high-rise. I quit my job while I underwent therapy. Took me years to get to a good place. I’m floored you continued schooling and wish I had an iota of the strength you have. Your dad would be very proud of you.",
            "I'm so sorry for your loss, take good care of yourself.",
            "There’s nothing like missing your dad. One day at a time, and don’t be surprised or disappointed if 5 years later you discover some of your choices are still affected by his loss. It’s okay. It’s part of being human and you’re doing just fine. Head up, shoulders back. We got this. Lots of internet hugs to you.",
            "I understand your pain, my dad very unexpectedly killed himself at the beginning of last month. One of your replies said that he took a piece of you when he left, and I'd not realized it until I read that it but that is how I have felt too. \n\nGlad to hear you are doing well again in school, internet stranger. Keep your head up",
            "I know you have a lot of replies, but I just want to say that I am so proud of you!! Keep your head up, you’ve got this!",
            "Im sorry for what you are going through",
            "Keep this for the rest of your life when you need to be reminded of how strong you are. :)",
            "I didn't read the original post, but after reading this, I just want to say that this internet stranger is SO proud of you! I can't even imagine how difficult it was, but you made it to the other side, and I couldn't be happier for you!",
            "Sending you a huge virtual hug. You are doing great. 💖",
            "Saw this and wanted to leave a comment. 3 years ago my mom committed suicide when my last year of high school started. For context, I lived alone with her as we emigrated to a foreign country, so I was super lost after it happened. University applications were opening up and I could barely concentrate to study. My school offered me to just not come to school, and that they will still send unis the same marks that I had before without the need to complete more assessments. I actually turned it down and kept on going to school, and that was imo the best decision I could've made for my mental recovery. Keep yourself busy, keep yourself focused on your goals, there's no better way to move on than that imo. Your dad will want to see you living strong for him too. It's been 3 years now and I can confidently say I am now a much, much happier person than I was before it all happened. It may seem all so dark and uncertain but trust me, it will be all good again if you just keep fighting for it.",
            "I’m so sorry about your dad. I’m so proud of you for pushing through. I bet your dad is super proud of you, if you believe an afterlife exists. You’re a rockstar. Be kind to yourself.",
            "Saw this post and it touched all my heartstrings. My father committed suicide when I was a teenager. And it feels like the hardest thing in the world to just continue on, and it’s not easy. \n\nSo proud of you and your dad is too. Much love.",
            "good job op keep it up and keep yourself up",
            "Arnold Schwarzenegger didn't attend his father's funeral so he could finish his preparations before winning Mr. Olympia. He said it wasn't that he wasn't sad or grieving, he just knew he needed to do for himself what needed to be done. Grieve how you choose, just do what needs to be done in your life above anything else.",
            "There’s no shame in taking some time off to grieve. Just make sure you do all you need to do to feel better, and then get back out there and kick some ass at school!! You can do it!",
            "I’m so proud of you. My dad died when I was 23 while I was in school and I had to drop out. 3 years later and I’m finally ready to go back. You are so amazing and strong. I’m sorry for your loss, but so fucking proud of you for pulling through school.",
            "This is a big fuck you to those professors who told you to drop out. I know they're not obliged to go beyond, but why are some teachers such aasholes? Why can't some of them just act human and have some empathy? I've dealth with my fair share of issues in college so far and I've always been open with my teachers. Thankfully all have been understanding, but I hear so many horror stories of teachers that just dismiss their students troubles like nothing.\n\nCongrats dude! I'm so happy for you. Keep it up, don't overwork yourself, keep looking for resources from your university in regards of therapy or other accomodations. Wish you the best moving forward!",
            "Super proud OP !! I'm so sorry about your loss! But keep it up.. get busy.. love yourself and you have all your fellow Redditors for support whenever you need ❤️",
            "Hello! I didn't see your previous post but I just want you to know that I'm so freaking proud of you! Sending love and hugs all the way from Singapore:)",
            "I'm so sorry for your loss and SO proud of you for forging ahead. Hugs if you want them. Please know we're here for you, and please keep us updated. **More hugs for when you need them",
            "I'm extremely proud of you, and you should be proud of yourself too! Well done!\n\"when you feel like youre at the end of your rope, tie a knot and keep going\"",
            "This was unfair ...sorry this happened to you ...hugs..if you are ok you can dm me.",
            "I’m so sorry for your loss. I hope he rests peacefully. You seem like an incredibly strong person, I wish you all the best. Take care.",
            "Congrats on your success thru your very sad times! I'm sorry for your loss and pain.",
            "Congrats on your success thru your very sad times! I'm sorry for your loss and pain.",
            "Wow!!!!! Congratulations!!! I'm so sorry to hear about your dad. I couldn't imagine how difficult it must be. But you pulled through!! Big hugs!!",
            "congrats on passing all your classes. your dad would be proud!",
            "First of all I'm a survivor of 2 suicides both my brother's chose to end their lives which has been a journey beyond words. Look up Survivors of Suicide Loss /SOSL it's a self help group that gets together through out the country so Google it and you should see the name of the organization.\n\nSometimes they go by their original name Survivors of Suicide/SOS they changed the name out of confusion of people who called.\n\nThis is a group for families and friends of loved ones who committed suicide they use to have people who tried to commit suicide call so they changed it to SOSL.\n\nIt is a group that discusses where they are at on the grieving process. This group saved my life and my sanity. Try it out it will help you.\n\nThis is something you will never get over it's something you have to accept and it can be managed by coping skills. It never gets better it's just life will be forever different.\n\nOnce you understand that statement completely then you know your on the right track.\n\nI wish your family healing and may you find peace at this moment of loss...",
            "I’m so sorry you had to go through that OP. My heart goes out to you! You are so strong for being able to keep moving forward! Even though we don’t know one another I am so proud of you!",
            "I didn’t see the original post. And I’m sorry for your lost.\n\nA friend of mine went through similar situation. He was studying abroad when his mother committed suicide. He only took two weeks off school and went right back into it. Didn’t tell a lot of people about the reason of his absence either. He said the only way he knew how to cope was to keep himself busy with school and student organization affairs.\n\nEveryone deals with grief differently, and I hope everything goes well with you.",
            "You sound like an incredibly strong person. Im so very sorry for your loss. I hope that you can make sense and make peace with what has happened in a way that feels right for you.",
            "I'm so freaking proud of you. Take as much time as you need, dm me if anything starts to feel overwhelming please. I, too understand. 💗",
            "i'm so sorry. i was in a similar situation back in 2011 when my dad died suddenly during my last semester of college. i was enrolled in five classes and had just two months remaining. had to decide whether to stick it out, and i'm glad i did. i'm glad you did too. best of luck to you.",
            "Life is cruel and tough and sometimes doesn't make sense. Sorry about what you've had to go through but you're an amazing person so keep fighting, never give up. I'm proud of you and I'm rooting for you!",
            "I did not see your initial post but let me just say that I think you are very strong and brave for continuing to go to school.  And you did amazing - so congrats on that!",
            "I'm so proud of you. I had a really hard time when my dad died and didn't do so great in my classes. Luckily I was 18 so I had time to fix my GPA, but even better that you didn't have an issue to begin with. \n\nI know you're working hard, but make sure you take time to grieve appropriately. Best wishes <3",
            "I am so proud of you!!!! My dad's suicide drove me to go back to school after I dropped out. Didn't want to work a deadend job... But now I'm unemployed and going back to school again.\n\nPoint is... Take care of yourself and give yourself slack when you need it. This will be hard to deal with. It'll be 4 years in one week that we found him and I'm just starting to be able to actually deal with it. Hang in there and if you ever need to talk, let me know. We've been through a similar situation and I just hope you know how strong you are for pushing through.",
            "Many of us have gone through similar situations... or are going through tough situations now.  I imagine all of our hearts are with you... mine is.  Just keep going, and, if you have someone or something to pray to, do that! We are all in this together... but it does seem super lonely sometimes..",
            "So glad to hear this, was going to come and give you inspiration to do just this!  My father passed away at the age of 44 when I was 20, and I was nearly done with my AA at that point (needed to pretty much just finish that semester).  I went the opposite way of you and dropped out.  I don't waste any time regretting it because I am happy with where I am now, but that doesn't mean I wouldn't do it differently if I could.  I see now that once you give in to that kind of depression and let yourself give up on the things that propel you forward, you're actually just making it harder on yourself to latch on to normalcy and recover.",
            "My mom commited suicide early this year. I didn't think I would ever be able to move on, my only motivation to even try were my sister and dad. It's hard, it still hurts, but I now know that the wounds can heal, even if it's very slow and the scar will remain. I wish you all the happiness.",
            "I had a good friend complete suicide and it tore me up. I can't imagine if one of my parents had passed that way. Kudos to you for finishing up the semester and congratulations on your impending graduation. I'm very sorry for your loss <3",
            "Congrats! Hope you will have beautiful chapters in your life next 💕",
            "Well done, you badass! 💜",
            "[deleted]",
            "First, I want to say that I’m so sorry for your loss! That is such a terrible thing for someone to live through.\n\nBut second...\nWow! You’re not my child but I’m really proud of you and I’m sure your father is really proud of you, too!!! Seriously, what you’ve accomplished is no small feat! Keep trying to work through your emotions about what happened. I think you’ll do well, though. You really deserve it!",
            "I am sorry for your lost and am glad to hear you have putting yourself together :-) How strong you really are. This is my first post in reddit",
            "I'm so sorry to hear that this happened to you and all the reactions you are having are how you should be feeling about it. I'd recommend connecting with your dean of students on campus, who can help navigate and negotiate how to work through this experience and figure out what your options are on campus.  Good luck and know that there are lots of people to support you.",
            "My dad died unexpectedly and suddenly when I was in my freshman year of college, right in the middle of midterms week. Your post struck a chord with me because I also did not feel equipped to properly grieve, help my mother, work, and do school full time. But I did it, and so did you. \n\n&#x200B;\n\nSo I just want to say I'm super proud of you for passing and graduating in the fall.",
            "Respect, personal achievement overwhelming personal loss.",
            "My dad also committed suicide when I was 23, but this was 4 years ago. Well done for going back to school! Its a good positive thing to focus on, and from experience it does get easier to accept the decision that they made. Sending love 💖",
            "Talk to your school. They should be able to help you and make an exception for slipping grades, etc. maybe you can make up work over the summer or do current classes over in the fall. Find resources at your school and your community. Don’t force yourself to hold everything on your own two shoulders. Find a support system, and see what your school can do for you. Hugs and love . I’m so sorry",
            "I did not see your original post but this hit home from me. My [28F] dad [43M] committed suicide two weeks after I graduated high school almost ten years ago. I was set to attend school at Valdosta State University in the Fall of 2009 and it was about three hours away from my home, never been so far away in my life for an extended period of time up until that point. \n\nI unfortunately did not have as good of a turn around as you did - I ended up failing all of my classes, except for one I got a C in somehow. I left Valdosta a week before finals and never looked back. I went to two other small community colleges before I graduated from Georgia State two years ago cum laude. I’ve never spoken to a counselor, but I continue to suffer with a lot of guilt as I feel responsible for my dad committing suicide (LSS I turned 18, became a rebel, made my relationship with him go sour, kicked out, etc.). It’ll be ten years next month he passed away and it’s still super hard for me at holidays and my birthday and just every day life but it gets better. \n\nI’m so happy to hear you are doing well and I only hope you continue to flourish. <3",
            "That's inspiration right there man. Congrats, I know for a fact I couldn't have done it",
            "I'm just a stranger on the internet, but I wanted to just say you got this! I admire your strength getting through this incredibly difficult time and reading stories like yours makes me feel like I can get over the hardships in my life as well. Sending lots of good thoughts your way.",
            "I'm so sorry for your loss. \n\nMen especially older men committing suicide is a massive issue that no one talks about. Really sad.",
            "I don't mean to sound condescending but I'm proud of you. I lost my mom to suicide in '06 and for almost a decade I was an absolute wreck. I completely lost myself to depression, addiction and alcoholism; because I felt that it was my fault that she did so (I wasn't able to bring her to her Dr.) Things DO get better and just know that you are making him proud by doing the right thing. You can do this! Don't give up. In retrospect, I wish I didn't lose so much of my life in that haze.",
            "My mother passed away 2-3 weeks before I finished my junior year of college. It was really hard. But she would of wanted me to finish and graduate, and I did.\n\nYour father wants you to finish. You can do this.",
            "I went through the same thing - dad committed suicide during my senior year of undergrad the week before Thanksgiving break. I am so so proud of you for keeping it together and finishing up. Be kind to yourself.",
            "My dad committed suicide shortly after I graduated. I moved back home with my mom right after, and I couldn’t imagine having to function at such a high level while dealing with that intense, immediate grief. You should be super proud of yourself, that’s amazing. ❤️",
            "Girl, I know exactly how you feel. I'm so glad that you got the support you needed to finish school. When I was 20, my mother passed away suddenly. Autopsy was \"inconclusive\" and we still do not have a reason as to why she passed, 5 years later. I was in week 3 of the school term and was so emotionally exhausted, stressed, grief stricken and fatigued. I ended up having a long conversation with the dean who did the work of communicating to all of my professors. All of my professors ended up transitioning a lot of my work to online work, and I actually made the deans list that term. I definitely credit my school and professors for working extremely hard to keep me in school. I would not have graduated if they didn't go above and beyond to help me through it.\n\nPlease.\n\nTake your time. Be kind to yourself. This is a serious emotional blow that wont go away any time soon. When you feel ready, I \\*HIGHLY\\* recommend seeing a therapist, or a PhysD, that specializes in grief. You're doing amazing. <3",
            "Lost my best friend to suicide my senior year of college and crawled my way to the end so reading this I had to comment. The fact that you graduated is an incredible. Incredible achievement, and 1. Your dad would be proud. 2. BE PROUD AF OF YOURSELF! \n\nJust please make sure to keep fighting! I'm on 1 year out of college and thought the fight was over after I graduated. It wasnt. I can't speak to your exact situation but keeping that purpose, and strength is absolutely key. Don't let yourself slip. Keep hitting therapy if you're going, and keep setting your bar higher. Extremely inspirational so thank you so much for sharing!",
            "You are so strong! Congratulations on your upcoming graduation and I am SO proud of you for persevering.",
            "Damn, welcome to the club, abet a horrible one to be in. My dad did the same thing 15 years ago and while it's better it's only because the pain has dulled.  You focus on what is most important and just keep moving forward. . .keep doing that each day until your brain can process the horror. Do NOT give up your dreams because he made a bad choice.",
            "I don't really have much to say other than sorry for your loss and that it's not your fault.\n\nSeek out help in school when you can and mention it to your teachers; they are there to help and will often allow accommodations if within reason. Also, there's no shame in going to see a counselor if you need to talk about things and get some perspective. I'm glad you managed to pull-through the semester. Don't drop out, you can do this!",
            "Super late but keep up the good work. You're strong and you'll persevere, chin up.",
            "I’m so happy you continued. My dad died in 2011 \n\n\nLet me tell you. The grief it hurt so bad back then i could hardly breathe. I was tired but couldn’t sleep. Every second of every day i thought about him. For months. \n\nThen it became every couple hours the grief would hit me\n\nThen days\n\nThen weeks\n\nThen years\n\n\nNow I can think back on father with happiness not grief. I can think of everything and be happy. \n\nWhat I’m trying to say is you will keep on going through the hardshit. And for a while but eventually you will be able to be filled with happiness and think about your father.\n\nI wish you the best",
            "My mom committed suicide while I was in college, going back at the age of 28. Girl, I dove into my studies, I didn't know how else to cope. It became almost an obsession to me. I knew I couldn't quit even though that's what I wanted to do. You've got this. The pain will pass. Just push through it.",
            "So happy and proud of you!! Good for you!!",
            "I am really sorry about your dad 😔",
            "Super proud of you. I also lost my dad to suicide while I was in the middle of college.",
            "I'm so sorry, just know there are always people there for you. If ever need a therapist or someone to talk to just talk to your friends or a therapist. God bless.",
            "You'll probably never see this, but I just want to say that I'm so proud of you and happy that you were able to continue on.   Life is fucking hard, you can only do your best to get through it- keep at it <3",
            "So sorry for your loss!!! Please stay in school if you can.  Go to counseling or group therapy but don’t drop out. If you drop out you may never finish.  My mom died suddenly in my sophomore year of college and I threw myself into my work and graduated with honors.  I realize it’s not the same and you have my deepest sympathies but please don’t quit school or you are likely to regret it later.  Wishing you all the best",
            "I'm late to the part, but I just wanted to say congratulations. I lost my father in a car accident when I was in seventh grade, and it was one of the hardest periods of my life, but I can't imagine that it was a difficult as it is with suicide. But though I don't know you, I'm proud of you.",
            "i will say there are hard time in everyone life. Some has even more intense but this is make you stronger and successful. All the top successful men and women have gone through similar phases, don't stop, stay strong... study hard and you will forgot this time...\n\n\nOnly think about the better future ahead and work hard for it.\n\nand dont drop out of the school.",
            "My mother died of suicide 2 years ago (I was 20) and only now it has hit me hard, so proud of you going back to school! I went to college to do Biology a week after my mum passed away too. You've got this, your father would be very proud of you!",
            "The only thing you can do is put one foot in front of the other . They say time heals all wounds but it's not true so you just can't give into that feeling.... 1 day you'll have a really good day... or laugh really hard and you'll feel better .there's a lot of good things to live for.",
            "During my senior year of high school, my best friend committed suicide. I am so impressed that you finished school - I know how hard it is and will continue to be. I hope you find as much compassion for yourself and from others as you possibly can 💕",
            "Could you take leave from school for a semester  ?",
            "I feel as though I can share this, only because I am not sure any body (as in friends and family) know of this account or will recognize it. Anyway, I am SO incredibly proud of you and what you’ve accomplished even after such a hard time in your life. I didn’t see your original post but the update resonated with me, and I just felt the need to let you know how amazing you are to be able to stay in school, and keep your grades up so close to graduating. I too had a dad who passed away, even thought my story is no where as near similar to yours. To keep it short, I grew up and my mom grew up physically abused by him, but I forgive him for various reasons and the fact that he was unstable and extremely sick. An amazing dad when stable. Anyways he died from a drug overdose in 2014, and my mom tells me it wasn’t suicide but it’s so hard for me to believe. No more about that, I just think it’s so great how well you’re handling this, at least from what I can read on here. It’s been 5 years since my dad’s death, and I start college the year after (I’m starting my senior year of highschool next year). I’ve already attended my local juco college for a semester, and dropped out due to stress and some other issues. Some stemming from things about my dad. Anywho the fact that just a month or so after this happened with your father and you accomplishing this is outstanding and makes me want to work even harder to better myself mentally. I couldn’t even finish my associates due to stress and anxiety, let alone if my dad’s passing had been even more recent. So sorry for this being long, i’ve never posted or commenting before but Idk something about your story just made me feel like I needed to let you know how awesome you are and are doing. <3\n\nedit: grammar and sorry if the juco thing is confusing, I was doing a middle college program in highschool to graduate with an associates and my diploma.",
            "Welllll...from experience with a close family member passing away - you can appeal your semester without get any Fs etc. idk about the money spent, but if you feel you can’t handle it - talk to administration. Sooner rather than later. Death certificate might be required.",
            "Good for you. I failed out after my dad passed.",
            "I didn't see the original post, but this hits home.  I'm graduating this week and I lost my dad unexpectedly two years ago (heart attack).  It's shitty to read that your professors encouraged you to drop out.  I was lucky-- mine told me that they wouldn't blame me if I did, but they were really supportive.\n\n&#x200B;\n\nAnyway.  I'm a stranger but I'm really proud of you.",
            "I'm really sorry about your dad, but I'm really surprised that you are still making posts and still doing good in school, but I mean that in the best possible way, stay positive don't give up and I'll be here if you need me👍❤️😊",
            "I'm really sorry about what happened to you. I know how it felt like losing your dad all of a sudden, mine was killed intentionally. I know it's hard to accept, since your dad chose the path that he wanted. \n\nJust take your time. Grieve at your own pace. Learn to forgive your father. We all have our own struggles, but now you just need to be the stronger person between the two of you.",
            "Congratulations, mate. I was in a similar situation when my mum committed suicide a few months ago. Only, in my case, my grades got so low, it is now beyond recovery. Hopefully, I will graduate with not-too-bad grades next year. Cheers to you, though! Keep slaying!❤️",
            "I love all of you in these comments (and OP). Humans aren’t always so bad. Gives me hope.",
            "I didn’t see the first one you posted but that must be really hard and I’m glad you’re getting better",
            "I know this is an old post, but if you are going through a serious hardship such as a medical or family emergency that keeps you from attending school; you can pay a visit the school administrators and speak with your Academic Adviser. They might be able to get you a one semester suspension that wouldn't permanently effect your degree (and it's a great solution for keeping financial aid). If it is in the middle of the semester, speak with your professors about it a.s.a.p. They should be able to work something out with you, so you get some extra time to complete your coursework.\n\nI have epilepsy, and unfortunately I needed to use these resources several times. They are there for a reason though.",
            "Hey it's okay my great grandmother and grandfather died when I was born so I never got to meet them but I was still sad all of my friends had greatmothers and fathers but I didn't I still was strong though I was bullied I'm a tomboy I have a lot of friends that are boys but they help me I have girl friends but their also tomboys and I wasn't on my feet yet I was still on my knees but they made me laugh and I have two brothers a dad a stepfather a mom and a stepcousin they make me laugh they got me on my feet and I believe in you can get on your feet with your friends and family and I'll be their for you if your lonely or not lonely I'll always be there for you",
            "I'm sorry for you losing your father.  Perhaps you will be able to explore what drove him to such depths of despair at a later date and after you've adequately grieved so that you can possibly find ways to avoid the pain he must have been feeling."
        ]
    },
    {
        "post_id": "nhr3yo",
        "author": "Far-Challenge-4300",
        "title": "UPDATE : I (46F) have hurt my daughter (16F) by giving her friend(16F) a few books",
        "url": "https://www.reddit.com/r/relationships/comments/nhr3yo/update_i_46f_have_hurt_my_daughter_16f_by_giving/",
        "score": 8032,
        "num_comments": 128,
        "created_utc": 1621599463.0,
        "selftext": "[Original post](https://www.reddit.com/r/relationships/comments/n7jcfj/i_46f_have_hurt_my_daughter_16f_by_giving_her/)  \nI found the perspectives and guidance I received really helpful. I decided to just spend some time with her. She loves to bake and we baked together and we had some movie nights. her comments melted away and she became happier. \n\nwe were baking yesterday when she came out to me. I didn't make a big deal out of as I felt she didn't want me to. I just told her I loved her before continuing to bake as if nothing happened. We did have a conversation later on. \n\nShe told me that she and her friend had been together ( scary, how well kids can hide things.) Her girlfriend wanted to come out but she didn't and it had strained their relationship. It seems, they had a fight before we gave her the books to her (ex?) girlfriend and that had hurt her. Their relationship is in the limbo and she doesn't want to come out to the world right now. My husband ordered a small pride flag to keep in her room. The world is a bit crazy right now and we want her to have a space where she can be herself.  \n\nTL;DR : My daughter came out to me, her friend was actually her girlfriend and they had a fight.",
        "permalink": "/r/relationships/comments/nhr3yo/update_i_46f_have_hurt_my_daughter_16f_by_giving/",
        "comments": [
            "[deleted]",
            "I wish I had you as my mother. No I'm not gay but to take the time to learn from others on how to take care of your daughter lovingly is a really good trait and she is lucky that instead of you responding back in kind or from a place of negativity, you are responding with love.",
            "Captain Bloody Obvious says: You’re good parents.",
            "I love hearing stories like this. My son came out to me at 15, I’m so glad he felt comfortable opening up to me. It’s so hard being a gay teenager, the world can be such a cruel place. But at least when they get the love and support at home, it makes it a little bit easier.",
            "Ah, so her comment about wanting to read those books was accurate. Maybe re-purchase the LGBTQ+ ones again so she can read them?\n\nExcellent parenting!",
            "These kinds of stories always make me really happy, but also a little jealous. I wonder how different my life would have been if I’d had parents that supported me when I came out. She’s lucky to have you both.",
            "I hope to be a mom one day. Every time I come across a post like this with excellent parenting I try to log it away in my memory bank as a standard to strive for. Your daughter is very lucky to have you.",
            "You have NO idea how much you have positively impacted these two girls' lives. Thank you so so much for adding so much good to the universe.",
            "Way to go, mom! Sounds like you handled that perfectly. Your daughter is lucky to have parents such as yourselves.",
            "Well done, Mom.  That's some fine momming.",
            "I have a feeling your husband suspected this and didn't want to out his daughter but didn't know what to do. Good work on the support baking and movie nights, I'm sure she loves you guys very much.",
            "You are great parents 💕",
            "Aw now I see why your daughter was so upset, and I see why her gf was upset. Of course they *should* be able to tell everyone, but society is still a little behind and your daughter is rightfully nervous. \n\nGood on you for how you handled it.",
            "One of the most important things for LGBT youth is feeling loved and supported by their families. Thank you for being there for your daughter, and keep up the good work ❤️",
            "A pride flag for her room!! You two are wonderful, supportive parents! Keep up the great work💜💜",
            "Thank you for being there for her. ❤️",
            "Great parents, thanks for making the world a little brighter.",
            "Great job parents!! ❤️",
            "Wow, she is so lucky to have parents as kind and loving as you. Some unfortunately are not that lucky. You handled the situation perfectly. Just keep loving and supporting her, mama.",
            "Aww nice to see some good parenting on here.",
            "How does that crown feel, Queen?",
            "It’s so lovely that you made space for y r daughter to process somethings with you. If she’s not a big reader, but wants to delve into some LGBTQ issues, perhaps some graphic novels or documentaries would be more to her liking.",
            "Ok this is wholesome",
            "You are such a good parent. When I was in high school I was on the exact same situation as your daughter, where I was in love with a girl who wanted us to come out before I was ready. I didn't have supportive parents at the time (they have since come around) and I can't imagine how much easier it is for your daughter to have you there by her side.",
            "I love reading this kind of positive updates ❤ You are awesome and your daughter is definitely lucky to have you! I wish more parents were this supportive.",
            "Seemed to work out decent enough. We're all emotional creatures at that age, trying to sort out our life and who we are and it looks like you have a good kid there and I'm not surprised because you seem like good parents. Just be there for her when she's ready, that's huge.",
            "It’s posts like these that make we feel like I can learn from parents such as yourself. \n\nThank you for posting. Bless you for being understanding, supporting and loving parents.",
            "You were right that something more was going on. I'm glad your daughter felt safe enough to come out to you and your husband and that you are supporting her through this. The world is scary right now so I understand her hesitation to come out, but I also understand why it caused strain between her and her girlfriend.\n\nThis is a very heartwarming update. Thanks for sharing!",
            "Was not expecting wholesome content ;;",
            "I am proud of you for asking for advice and being there for your daughter. Now get you guys some new books to read as a family.",
            ">we were baking yesterday when she came out to me. I didn't make a big deal out of as I felt she didn't want me to. I just told her I loved her before continuing to bake as if nothing happened.\n\n>My husband ordered a small pride flag to keep in her room.\n\nDamn you two sounds like very good parents. Bravo for handling this perfectly and supporting your child. Unfortunately it's not always the case so it's nice to read 👏",
            "As someone who came out as a teenager, I want to give you double high-fives!",
            "I'm proud to be human today.",
            "good god i wish you had been my mom.",
            "You are lovely parents 💖",
            "Wow, I hope I will be this amazing of a parent if my son needs me like this one day!",
            "Just gotta say reading this made me smile, you guys are great parents :)",
            "Oh man this was my suspicion. I'm so glad you two talked and thank you for being a good human and a good parent.",
            "These are the friday feels we all need but never actually get from Redddit!!! Bake a pride cake this weekend!!",
            "Often it's the most complicated things with the most simplest of answers. Great work at parenting OP. You are what every person coming out wants their parents to be.",
            "as a grown woman who has only recently fully realized that I'm bisexual this post made me tear up! how supportive and loving you and your husband are, how kind. if I hadn't grown up with parents who believed that being gay was a sin I think I could have realized 15 years ago.. and not carried around so much guilt and conflicting emotion. \ni'm so happy for your daughter and your family. thank you for the very sweet update.",
            "That little gesture by your husband had me teary eyed. You're good folks.",
            "Oh a flag is a great idea!  When my daughter came out we got her a hanging rainbow crystal window charm so rainbows dance in her room.  I like the flag idea.",
            "Thank you for loving her. My own parents are not great, and you both sound wonderful.",
            "I really hope the two of them can work things out 🥺❤",
            "Upon reflection, this makes so much sense based on what you said in your original post. I'm glad it's working out within your family.",
            "Really nice job between you and your husband. Coming out to your parents is hard and I think acknowledging it without making it a huge deal or a joke is the best way to go about it. If you want, you could also both decide to read some of the same LGBT+ books and have a sort of pseudo book club where you discuss it when you’re done. If you do just ask your daughter if she’d prefer fiction or non fiction or both.",
            "Omg the little flag for her room made me cry! Beautiful parenting",
            "The world would be an amazing place if all parents were like you and your hubby. Glad to hear a happy resolution to this story. Since it was handled so well, I suspect your daughter will be more open in the future and you won't encounter this kind of issue again. Kudos!",
            "Aww mom. What a teen ride. Wholesome but gaaah.",
            "You are a great mom and your daughter is lucky to have such accepting and supportive parents. She and her friend/girlfriend will work things out eventually. I can't imagine having to deal with something so stressful when I was a teenager but the world is a much more open minded place these days.",
            "Can you be my mom? Mine disowned me.",
            "This is so sweet, parents of the year!",
            "You sound like a great mom. Your daughter is lucky to have you!",
            "I'm over the moon that things worked out well for you and your daughter!!!\nI'm not a parent, but I do want kids at some point and this is exactly the high like of standard I'm going to hold myself to.\nShe is going to remember this for a long time to come.",
            "Honestly, I (Millennial F) was dating my then best friend (also millennial F) right around your daughters age. My parents still don’t know, she was over all the time, and we had a really bad falling out. That was honestly my first guess when I read your original post. I’m so glad your daughter felt safe enough to come out to you and that you two are spending more time together.",
            "As a teen the first thing I thought is that they’re probably dating. I’m glad this turned out well!",
            "I know this is an update post, but I just wanted to add: you don’t have to come out to be openly queer. It’s an option she may like. I’m bisexual and have known that about myself since middle school. I never made an announcement, just lived my life and dated who I wanted. I wore pride stuff or mentioned being queer or what have you always like it would be just as expected as cishet-ness. \n\nHope it all works out for your daughter and the other girl and they at least salvage the friendship. You handled it great!",
            "Great update, in a backward kind of way I think you showing such support for her friend maybe helped her to come to terms with coming out to you. \nHope your daughter and her friend can recover something, they must both be navigating through very stressful waters right now - they’re both lucky to have such a level headed and positive influence in their lives!\n\nKeep being yourself please OP",
            "Honestly you sound like a great parent",
            "You sound like great parents! Great update❤🧡💛💚💙💜",
            "You didn't know they were together though.",
            "This makes me so emotional. Way to go, mom!",
            "this is just so, incredibly sweet. amazing job.",
            "your daughter is very very lucky to have such supportive parents...",
            "You are amazing parents. I love you.",
            "i know you've heard it a million times in these comments, but you really are such a wonderful mom. as a queer kid with a mom who isn't nearly so loving or accepting, your post moved me. wishing you and your daughter the best",
            "You are a great person. I didn’t see your first post but I am happy to hear the outcome!",
            "Wow. What fantastic parenting.",
            "This made me cry. You are such great parents!",
            "This is lovely. Thank you.",
            "You guys are great parents. :)",
            "Well done. Resolved perfectly",
            "What did you bake?\n\nAlso you handled that perfectly. I hope your daughter and her friend work thinks out some way.",
            "This really warms my heart. You’ve given your daughter invaluable support and love, and while she’s not ready to come out yet, this experience will surely make her much more confident and assured in her truth.",
            "You are a wonderful mother, don’t let anyone tell you different! Everybody wants to judge who’s right and who’s wrong, but don’t even know what morals are. With your support alone that child will do amazing things, regardless their sexuality ❤️ you should be proud!",
            "This really warms my heart. You're good parents and ykur daughter will remember this and be grateful as she grows older.",
            "You're the kind of parent that saves lives.",
            "My parents always said \" I dont care who you're  with,  as long as your happy.\" For 2 years I hid from them the fact i was gay. When I told them they said it doesnt matter and that they still just want me to be happy.  \n\nI'm so different  from them and they still care about me  and I value that.",
            "OP, would you be my mom?",
            "Much love, OP. Glad you soothed things over:) keep being awesome parents.",
            "I wish all kids that want to come out had parents like you and the same love for their kids no matter what.\n\nThese kids are killing themselves and being thrown out for loving who they want to love. For who makes them happy.\nAll parents should want their kids happy no matter what.\n\nI’m glad the girls have your love and support and I’m glad the air has cleared.",
            "That’s great. I’m glad things turned around. I hope you keep up spending solid one on one time with her. I can see it being hard for a 16 year old if they felt you liked their gf more than you liked them.",
            "Oh...Can you be my mom?  The little 13yr old queer kid in me wishes I'd had this kind of coming out support and love.",
            "I hope there is a PFLAG or a gay student association she can join (she can wait or just join some online forum.)",
            "I am literally crying wishing that my mom had even a pinch of the compassion that you do. \n\nWhat a wonderful mum you are.",
            "Good job, mama! I’m so happy for her and for you.",
            "16 practically bursting at the seams with emotions just tryna find her identity.. it'll get better.. with parent so supportive this will pass. .I hope to model this type of parenting with my kids",
            "You're a great parent. Wish I had gotten that sort of reaction when I came out"
        ]
    },
    {
        "post_id": "4zkbp3",
        "author": "thisgirlisonawire",
        "title": "UPDATE: I [26f] opened my husband's [32m] snapchat and it was a very explicit picture and caption from a girl. He's sitting not 20 feet from me & I don't know how to handle this.",
        "url": "https://www.reddit.com/r/relationships/comments/4zkbp3/update_i_26f_opened_my_husbands_32m_snapchat_and/",
        "score": 8015,
        "num_comments": 205,
        "created_utc": 1472152951.0,
        "selftext": "Link to original post: https://m.reddit.com/r/relationships/comments/4z9cgn/i_26f_opened_my_husbands_32m_snapchat_and_it_was/?ref=search_posts\n\nAgain, I am overwhelmed by the support and love I've received from everyone. It feels great to be comforted and cheered on by you all. Thank you **so much**.\n\nSo, husband cheated. He has been since \"maybe two weeks before last Christmas\", according to him.\n\nI was very calm when confronting him and took the advice many of you gave me by telling him that he needs to explain to me who Roxy is and why she is his \"best friend\" on Snapchat. His face gave him away immediately but he still tried to lie to me at first. \n\nHe said that she works with his friend and they met when his friend invited her out to lunch with the two of them. At first, he claimed he only met her about two months ago. He said that they're \"best friends\" because he doesn't receive many snapchats from others and she is extremely active on the app. He said she just sends randoms and is really into fitness, so she sends a lot of \"inspirational\" snaps on being healthy and living a better life. He said that every once in a while, he'll send her something back, like a picture of a cheeseburger or something just to tease her about her level of health-consciousness.\n\nFirst, I asked why he didn't just tell me about her. He said he didn't even think about it because she's just an acquaintance, not even a friend. Then I asked if he'd ever received anything even remotely inappropriate from her.\n\nHe answered with, \"Not on purpose\". I'm assuming he went with that because he knew I opened that snapchat and he probably knew it was a bad one.\n\nI asked what \"Not on purpose\" means. He got very defensive. Started raising his voice and saying he doesn't need to explain what that means, that sometimes people accidentally send the wrong snapchats to the wrong people. Then he had the nerve to say something along the lines of, \"I feel like I'm on trial here. People warned me that you'd get crazy when you're pregnant but I never thought it'd be this bad.\"\n\nNow. As some of you mentioned in my last post, it seems amazing that I'm able to keep such a level-head. That is because I was raised by a mother who always told me that you *never* accomplish anything with anger. That you can be emotional, passionate, upset, etc. without ever raising your voice. Messages received quietly and concisely are just as loud and clear as messages received through yelling and screaming. That is how I have lived my life for 26 years, with the exception of just a few blow ups (I am human).\n\nThis moment was an exception. I didn't exactly yell and scream, but I became furious. For him to try to blame this on me being pregnant? How unoriginal and offensive. Long story short, he said he'd never seen me this crazy and I told him that I'd never seen a picture of another girl's pussy on my husband's snapchat before. He came back with that I shouldn't have looked at his snapchat. I came back with that it was an accident but even if it hadn't been, there shouldn't be any reason he's receiving snapchats like that for me to see- accidentally or not- in the first place. I told him that I may be pregnant but I'm also an intelligent person and I am his *wife*, so I knew he was lying and I deserved to know the truth. I asked if I could see his text messages to see if he's been texting Roxy. He said sure. No messages. Then I asked to see his Facebook messages. He looked like a kid caught with his hand in the cookie jar. He told me no. I asked why.\n\nHe finally broke and started to cry. Told me he couldn't let me see the messages because they would hurt me. Because they were inappropriate. \n\nThen it all came out. They screwed in the backseat of her car the **first** night they met.\n\nThis is already long so I'll spare you all the details. But it's been an ongoing affair for months. No, they did not always use protection. Although I was recently screened for STIs, I'll be getting checked again in light of this information.\n\nMy uncle already assured me that if he was unfaithful, we would cream him in court. Really the only thing I'm willing to fight him tooth & nail for is our home; I put a lot of effort and money into making this home my dream space. I won't be seeking spousal support but I will seek child support. \n\nI'm obviously heartbroken and told him to go stay in a hotel or with Roxy for all I cared (I confronted him last night). My mom & sister stayed with me last night and let me sob all over them for hours. Right now I'm sort of numb but I'm also thinking very clearly. I know what my next 10 moves are and I feel supported and secure in my decision to leave him and keep my baby.\n\nA few things I just wanted to clarify: My husband is not a lawyer; his good friend is. There was some concern for my success in court if my husband is a lawyer. His friend is in environmental law so, while I'm sure he can provide some advice, he will not be my husband's divorce lawyer.\n\nThere were suggestions of me terminating my pregnancy. I fully support the right to choose and I would probably terminate the pregnancy if I was in a different financial position and lacked a support system. However, I work as a marketing manager for a large company. Not only does this allow me the privilege of working from home about 50% of the time, but it also grants me financial independence. I do not rely on my husband for money and I really never have. He works in tech so, while he makes a good salary, I will have no need for spousal support. I have a phenomenal support system; this baby will be loved so dearly by so many. Yes, I will have to deal with my husband for the rest of my life if I have this child and it will make future relationships for me more difficult, but it is worth it. I've wanted this baby since day one and I am her mother, which means that I am strong enough to raise her alone because I *have* to be strong enough.\n\nHere's to hoping for a speedy divorce. I'm ready to be done with this marriage. Which is crazy because just a few days ago I thought my life was as close to perfect as you could get.\n\n**tl;dr** Husband admitted to an affair. I will be proceeding with a divorce and will keep our baby. I'm numb but calm and feeling good about my decisions and how I handled the situation. I know there is a long road ahead of me and this will all probably *really* hit me soon. When it does, I'll mourn and grieve the end of what I had thought was a happy union. Right now I'm in self-preservation mode and much more focused on how to come out of this in the best position possible. Thank you so much for all the advice and support, Reddit!\n\n**Edit:** Formatting\n\n**UPDATE:** I know it has been only a short time since I posted this update but I need to tell you all how amazing all of you are. Wow, this much support is just... wow. I wish I could reply to all of your comments and messages but because of the volume, I'm just going to say thank you from the bottom of my heart to each and every one of you who read my posts, who commented, thought of me, wished my baby & me the best, messaged me, and anything else. I am currently at my parent's condo, sitting outside at their pool, sunbathing my little baby bump and reading each and every one of your amazing and empowering comments. I just want you all to have that image; that **you** have made me happy and content in a time when I am short on both. This is proof that love does exist, even if it doesn't within my, now over, relationship. And that is a powerful thing. \n\nLove to you all.\n\n\n**Me again:** I was going to post more details on what happened during the confrontation with my husband, etc., but then I decided against it. I should keep some details private; it's likely my husband has seen this post. \n\nI will leave you with this:\n\nMy dad and I were up late talking last night and, as usual, he had the perfect thing to say to me. He told me that weak people are afraid of strong people. He told me to keep on terrifying the weak ones. That way, the only people who won't fear you are the bravest, strongest of people and those are the people who are worthy of you.\n\nThen he said my husband is a spineless turd who couldn't kick it with the strongest woman in the world.\n\nJust thought I'd leave you with that and encourage everyone to \"be terrifying\" by being strong and not standing for nonsense.\n\nThis is the last I will post on the matter. I have a lot ahead of me with everything and will probably go quiet on Reddit for a while. Time to get ready for court and to \"be terrifying\". :)\n\nThank you, thank you, thank you again. Love to all of you and best wishes.\n\nLove,\n\n-T ",
        "permalink": "/r/relationships/comments/4zkbp3/update_i_26f_opened_my_husbands_32m_snapchat_and/",
        "comments": [
            "I've been thinking of you since I saw the original post a few days ago. It broke my heart to hear this, you deserve a thousand times better than a man like him.\nYou've handled the entire thing with utter grace by the sounds of things, I for one could not keep my cool especially if I had pregnancy hormones whizzing around my body. I am flawed by your measured response and strength to leave someone who quite clearly doesn't deserve you. That is true strength. Your child is lucky to have such a strong mother and role model. All the best for the future, you deserve happiness x",
            "I'm so angry on your behalf. My eyebrows and blood pressure shot up at this part:\n\n> Then he had the nerve to say something along the lines of, \"I feel like I'm on trial here. People warned me that you'd get crazy when you're pregnant but I never thought it'd be this bad.\"\n\nYou're going to be so much better off without him. Your baby will be greatly loved, and you'll be a kickass mom. Good luck to you!",
            "I am so sorry to hear this, but it sounds like you're a tough and strong woman. You will get through this, fuck that guy. Sending my best wishes your way",
            "I think your mother raised you smartly. To be honest it's the people who don't show emotion and scream and go crazy that we should be afraid of. \n\nI also think a lot of people are *afraid* of this scenario exactly happening. Maybe they don't have the confidence and strong support-- and that's ok, every person and situation is different. \n\nBut I think a lot of people also back down once the confrontation happens because they rely on the influence of others (\"but you're pregnant!\", \"What about the baby?\", \"What will your family think?\", \"What about being a single mom?\", \"You can't raise a child by yourself.\") and all the other societal crap to influence them. \n\nOP, you and your fam are da real MVP here!",
            "Wow. He is so pathetic. I am so happy that you are financially independent, a career, and a great support system. You are a smart lady with a good head on your shoulders. Fight in court and get what you deserve. The (now) ex, fucked his life up dearly. He will have to live with himself for the rest of his life. When his girlfriend discovers your pregnancy, she will most likely bail on him. I am extremely proud of you. You have handled this like a champ.",
            "[removed]",
            "You're a badass. Your baby will be lucky to have such a tough Mommy. I hope your ex gets his, in time.",
            "This is not legal advice. I am a divorce attorney!  Here are my thoughts. You need to find yourself an awesome therapist ASAP. When you pop that baby out it is going to be so hard to co-parent. \n\nLook into reconstituting your estate. Unfortunately nowadays cheating is a common occurrence in family court. The best way to combat it is recouping all the money he may have spent on that chick. \n\nAsk for an entire Facebook download in discovery. It will show all his messages he has ever sent to anyone. Use it as leverage. Most cheaters don't like to go to court to air our their laundry. This gives you a stepping stool! ",
            "He meets her, for the first time, and screws her in the back of her car. \n\nHe's a worthless human being. It was that easy? haha, what an idiot. He's losing an incredible woman. \n\nWomen like roxy will stop the chase after they realise the wife has left him. Theres no longer an ego boost from ''im being chosen over his wife and feel so validated and so much hotter.''\nshes  not looking for a relationship lol. She just liked the high of being ''better'' than another woman because the husband chose her. She's not by the way, im laughing my arse off at the both of these two losers. ",
            "This kind of situation is what makes me scared to ever get married or have kids, but I have to say you are handling this as well as you possible could. I just want to say so so sorry as I remember your original post, your soon to be ex husband is a gross disgusting person. Also you are a champ and your daughter is lucky to have a mom like you.",
            "Good for you OP. Please continue kicking ass. ",
            "I personally would go Andrew Garfield on him from The Social Network.\n\n> You better lawyer up asshole, because I'm not coming back for [50]%. I'm coming back for everything!",
            "Hugs. You really are a strong woman. Your baby is lucky to have you as a mother, particularly when his or her father is such a shithead. Good luck.",
            "Huge piece of advice for you, DO NOT DATE ANYBODY UNTIL AFTER THE DIVORCE! Might not have even crossed your mind, might be a year before the devorce is finalized, but do not date! Doing so can instantly destroy any infidelity case you have and destroy you in court. This happened to my dad; mom cheated on him, they separated for over a year, he dated like a month before the final divorce hearing, she claimed he was always cheating with his new girlfriend so that is why she cheated. Existing relationship is hard to disprove, especially when they did know each other at the time. They split things 50/50 instead of her getting basically nothing.",
            ">  Really the only thing I'm willing to fight him tooth & nail for is our home;\n\nAnd custody of your baby. I'm sure your uncle is on top of this, but it's worth mentioning since your post is operating on the assumption you'll be the custodial parent, which is not guaranteed.",
            "You're some woman <3",
            "> A few things I just wanted to clarify: My husband is not a lawyer; his good friend is. There was some concern for my success in court if my husband is a lawyer. His friend is in environmental law so, while I'm sure he can provide some advice, he will not be my husband's divorce lawyer.\n\nI am a lawyer and TBH people often overestimate the effect a good lawyer can have. A bad one can certainly cause you all sorts of problems, but in most family law cases these days things mostly go by formulas and prior practice. \n\nFind yourself a good lawyer of course, as you want good work, but don't let them promise you results unless they can point to previous cases where a person got that result. \n\nI don't work in family law directly, but I am in a close field and I have had many people tell me all the bullshit promises their divorce attorneys made about them getting full custody or tons of money when the facts didn't support it. \n\nIn my experience the best lawyers are the ones who know how to ask you the right questions to figure out what you want, then work with opposing counsel, or fight in court to make that happen. But that is often a parenting plan with shared custody, or a reasonable split of the assets. It's things like not having his new partner around the kids, or making sure that you are in charge of decisions you care about, e.g. religion, schooling, health care. Lots of attorneys will say they will fight for whatever you want, but the really good ones will tell you the truth about your likelihood of success. \n\nOne more thing, I don't know what state you are in, but the first thing I would look into is whether your state is a no-fault state or not. If it is then the affair will likely not have as much impact as you might like. \n",
            "You're going to be an incredible mother! If at any point in the future you feel insecure or upset about the damage that idiot did to you, reread your own post here and remember you're a complete badass. You have my admiration and well wishes!",
            "I don't know you, but I am SO proud of you. You are going to be one Badass mom. When the dust settles go pamper yourself. Get your nails done (as long as that's safe while pregnant, I'm not sure!) or get a massage, or go treat yourself to a fancy dinner and movie, just indulge in some self love because you deserve it and you are awesome. ",
            "Your husband is a bag of shit.",
            "You give me a strong lady boner (yes I know I'm not using that term right). Here's to many happy years to come.",
            "You sound like such a kind person. I'm so sorry that this happened to you. I hope everything works out for the best and you find happiness very very soon :)",
            "Man I hope your Uncle is the kind of lawyer that burns everything to the ground so to speak, for you. But I'm glad you are financially independent and have a good support system.\n\nEdit: please try and get sole custody of the baby. ",
            "Praise hands emoji. You are queen of your own life, as every woman should be. \n",
            "Take his sorry as to the cleaners and get every penny you can, even if you don't need it now.  Put it away for your child's college fund.",
            "I am so sorry you had to go through this. You STBXH is an asshole. I wish you all the love and luck for you and your daughter in the future! ",
            "This is one of the posts on r/relationships which I really wanted to see updated. When I read your post, I couldn't help but feel for you. It's amazing how strong and resilient you are for handling the situation the way you did and choosing to divorce him immediately. Just remember, if you ever start to feel soft towards your cheating husband, the type of person he is. The pain may be tough but once it passes, you'll be more happy in the future than you could be by staying with him. Your husband does not have loyalty or values. You owe it to yourself and your daughter to prove that you deserve more than someone who throws his family under a bus for sleezy cheap sex. I hope you find someone who will treat you the way you deserve to be treated. ",
            "Well, you seem like an awesome lady, with a cool family and uncle and good detailed plan for now, the coming months and for your future as a parent.\n\n\nHe seems like a spineless lying turd who can barely plan for last Friday let alone tomorrow. \n\nCutting yourself free is probably going to be great for you and your child and terrible for him, but screw him, he dug his own grave and even made a very shoddy headstone with his attempts to lie.",
            "I read the first post,  and I'm so sorry to see this update.   You seem like you have a good level head on your shoulders.   What a fuck wad",
            "Honestly, it's not exactly a \"happy ending\" but hey, you fucking go girl. Half the times I read things like this they just forgive and forget, only to be back on Reddit with another issue a month or so later. I respect you for leaving his ass, supporting yourself, and providing a comfortable life for yourself and baby. 10/10 win ",
            "Your child will be lucky to have you as a mother! Good for you. ",
            "I'm so glad you have the support system you have to fall back on. Be prepared though for your husband to beg for forgiveness and another try with you. If that happens, will you take him back?",
            "there's a ton of glaring red flags that i'm sure everyone else pointed out but this one gets me most:\n\n>Long story short, he said he'd never seen me this crazy and I told him that I'd never seen a picture of another girl's pussy on my husband's snapchat before. He came back with that I shouldn't have looked at his snapchat.\n\nnah, if you're having kids together, things like that shouldn't be totally private. tbh, i'd be concerned, even before this, if he was secretive about texts or snaps or anything like that. y'all should know each other's phone passwords, i think. none of that should need to be private. that he thinks that's a valid rebuttal just bugs me so much - he thinks that y'all SHOULDN'T be allowed to look at each other's phones at all, and i can't imagine spending the rest of my life with someone knowing that i have to make an effort not to see *anything* they send to anyone else.",
            "I am sorry you were treated this way. You and your child deserve so, so much better. Best of luck for the future, I have no doubt you will \"cream him in court\" :)",
            "I am so sorry you are going through this. I can't imagine how heartbreaking it must be. \n\nYou are strong and you'll get through this, one day at a time. ",
            "\"Not on purpose\"\n\n\nOohhhh, that dirty rat.  ",
            "You haven't even had your baby yet, and already you seem like a great mom. I'm so sorry for what you've had to deal with.",
            "You know there is nothing wrong with seeking spousal support, right?\n\nEven if you don't want it for yourself, it could very well help you take better care of your kid. ",
            "Sadly my wife and I both had affairs early on in our marriage, though not to an extreme physical level. Fortunately with a lot of hard work and therapy, we worked it out and made our marriage even stronger than it was in the best days, pre-affair. So I usually lean towards encouraging people to fight for their marriage, especially when a child is involved. \n\nI can offer that your husband is very likely in what is called an affair fog, where he's basically been riding high and addicted to the massive amounts of dopamine that comes with being involved in an affair. If he could get enough distance and focus on saving his marriage, it's likely he'd wake up and genuinely realize what an idiot he's been. \n\nThat said, most affairs are usually gradual and almost sneak up on people...that he had sex with her the same day they met is pretty fucking bad. Especially that he continued it while his unsuspecting wife was carrying a child he helped create. Sounds like your mind is made up anyway, but I just wanted to share what insight I have from having battled back from affairs in my own marriage. \n\nYou're probably dealing with some serious emotional shock right now, though you sound incredibly resolved and clear-headed. But please take care of yourself, get plenty of rest, and try to not stay idle too long and let yourself gnaw away at it. Grief is a like a big city skyline with drops and peaks that slowly levels out with time.",
            "I will say that if you and your husband didn't fight as a couple you probably won't fight much as a divorced couple.  You may be angry about the affair for a while but honestly when divorced couples have problems it's because they had problems as a couple.  The basic dynamic and chemistry between you won't change, just your status.  This may help going forward esp. With the child.",
            "Why not seek spousal support? Fuck his day up.",
            "Godspeed onto your new life.  I wish only the best for you, and that you find a new joy in your new life ahead.  You are so very wise to think of preservation first, and grief later.\n\nPlease take time to grieve.  But I'm sure you'll do well.",
            "Fuck that guy. I hope you destroy him in court and get everything you want.",
            "One thing to remember when dealing with custody arrangements: he did not care about infecting you and *your baby*  with an STI. He abandoned the health of your child in order to cheat on you. ",
            "I posted in your original thread. Glad to hear you got him to confess. I told you to leave regardless but now you have some peace of mind that you're not breaking up a marriage over something minor. Take his ass to the cleaners in court and then move on. Good luck!",
            "The world needs more women like you! I am sorry that you have to go through this, but you're playing this curve ball perfectly! I am happy you're keeping your baby, because I'm sure she'll grow up as a strong lady like you! Thanks a lot for making the world a better place :) ",
            "You say you are strong enough to raise the baby alone but you do realize that by his actions he has lost no rights to the child right?  As long as he is willing, you will not be raising the baby alone. He will have the right to also raise the child with you.  Just not physically with you.  From his own home, half the time.  ",
            "Amazing how you think you know someone and they can blindside you like this. You got this tho.",
            "Dudes like this give all dudes a bad name. Don't let him ruin men for you; we aren't all cheating scumbags. I would wish you good luck on the divorce, and good luck with the kiddo, but I don't think you need it because you sound like a no nonsense gal. I think you'll do great. ",
            "Good for you. I saw your original post and thought how fucked up it was. I'm sorry you had to go through all that. \n\nThere are some good men out there,  you'll find the one for you àt some point or another.\n\nWant me to punch him? He seems like he needs to be punched.",
            "Lots of love and extra support your way! ",
            "Oh wow. I didn't comment on the original post because there was a lot of good advice and support. But wow. I'm so sorry. That must be heartbreaking for you. \n\n*hugs from an internet stranger*",
            "You sound like the strongest person, and I have 100% confidence that you'll make it out of this better than you were before.",
            "You're such a strong and inspiring woman. You're going to do great without him.",
            "What an absolute asshole. ",
            "You deserve so much better. You sound amazing and so tough! ",
            "Fuck yes. Stay strong. You have a good head on your shoulders. ",
            "I don't have any advice for you, but I just want to say you are absolutely amazing and an inspiration. I wish you and your little one all the best.",
            "Rip him a new hole in court! Get the spousal support AND the child support. See how fast Roxy runs after that LOL. ",
            "Ugh.  I read your OP and I had a feeling this would be the fallout.  Personally, I'd take him for every single penny you can, including spousal support. He deserves it.  If you don't actually need it, put it into a savings account to use for you and your daughter to take an amazing trip when she graduates or something.\n\nBe strong. You've got this!",
            "You are amazing. I am so terribly sorry for this situation you're in, but I'm glad to see that you are doing everything right for you and your child. I hope only the best for you in the future!",
            "Man what a crap person ",
            "This man is a grade A thundercunt. Good riddance. ",
            "OP, I'm sorry to read about your situation. \nI'm not sure what is going to happen once your daughter is born but he'll likely want to see her. He may even want to be in the room when you give birth (not unheard of.) \n\nIt's going to take time to heal, a lot of time. He was the man you loved after all. So moving on will be quite difficult. Let yourself heal, take time away from him. My ex cheated and left two weeks after the birth of our child. Sucked doesn't begin to cover it. But life goes on. Speak to your obgyn about your situation, they may be able to refer you to counseling if you need it. If after the birth he wants to see your baby, maybe have your mom or sister be the middle man. You don't have to see him, you do you and heal. \n\nTake care of yourself, cry if you need to buy you aren't alone. Your daughter is with you. ",
            "You are the type of woman and mother I aspire to be. You. Are. Amazing. And I hope that what has transpired with this man does not leave you doubting that.\n\nIn addition to having a kickass mother, your daughter sounds like she also has one zen af, stellar grandmother. So much love to you and to a clearly resilient, beautiful line of women.",
            "You've turned the shittiest situation into the best thing you can. I'm really proud of you OP! Life is only going to get better for you and your baby! You've got a great head on your shoulders and while it won't always be easy, you are prepared. I'm glad you have surrounded yourself with unconditional love of family. I wish only the best for you. Sending lots of love and strength your way!!",
            "You are so strong. Best wishes for you and your daughter - you said you had a feeling it was a girl, mother's intuition knows best ;)",
            "My sister went through a similar thing. Caught FF (we all refer to him as FuckFace) cheating on her when they had a month old baby. Fast forward 8 years, she's one of the most amazing people I know. It's so hard raising an infant alone, FF has custody every other weekend but he's a complete idiot when it comes to common sense. \n\nIt sounds like you'll be an amazing mother. You'll never regret having her and she'll add so much value to your life. My only suggestion is to get him for spousal support, bc fuck him ",
            "I'm very sorry that this has happened to you, OP! You sound like an absolutely incredible person and the way that your dealt with this was totally boss! I'm sure that you will be an amazing mother and that you child will be loved beyond reproach. I just feel bad that you will have to deal with your douchebag, STBX-husband for at least 18 years. He doesn't really deserve to be a part of the child's life, but I know the courts will say otherwise. Good luck, OP, and stay strong!",
            "Damn, you are one capable woman.  So proud of you!  I'm also sorry for your situation, but I can see you will be able to handle this.  Good luck!",
            "I'm sorry your husband couldn't appreciate the strong, intelligent, kick ass woman that you are.  You have handled this with incredible restraint and dignity.  Instead of falling apart you kept your head and did what needed to be done to protect you and your baby.  I am so impressed by you.\n\nKeep your family close, as they sound amazing and best of luck to you.  I'm sure being a single mother will have its challenges, but you seem like you will take it all in stride.  Remember that it's ok to cry and have bad moments, this is a horrible situation, but you'll come out ahead.",
            "You are amazing and strong and your daughter will be SO much better off for you not staying with that cheating liar. How dare he try to gaslight you claiming you're nuts! He deserves to hit rock bottom and even with a child, you can find someone better than him with both eyes closed. Kudos to you.",
            "Goddamn OP...props to you. Seriously. You are a very strong, very intelligent woman. I'm sorry all of that shit had to happen to you, but I'm glad your baby will have the support that she does, both financially and emotionally. Way to kick ass.",
            "I think you are making the best decision for you and your baby.  You sound very smart and level headed, good luck with your divorce op!",
            "I read the original post but didn't comment. But I read this one and I've just been talking about it to my cousin, we were saying that you are so incredibly strong and I couldn't imagine being in your situation and I admired how calm & mature you were and how perfectly you've handled it all. I wish you every ounce of love and luck life could possibly throw your way, your baby is incredibly lucky and will have an incredible role model to look up to during it's life. \n\nPeace and happiness to you x ",
            "Good riddance to that disgusting asshole. I gotta say I'm amazed at what a strong woman you are, I would have been a wreck in this situation.  ",
            "I'm so sorry, but I'm so proud of you. You are strong. You and your baby's support system sounds wonderful.",
            "I'm so sorry you are having to deal with this, especially as you are pregnant. I have been waiting for an update and hoping on your behalf that it was just a misdirected Snapchat.  Best of luck to you in the future. You seem like you will make an awesome mother. ",
            "You deserve a standing ovation. Sorry you had to deal with such an ass. It sounds like you and your baby will have a wonderful support system for the rest of your lives, with lots of love and care. I wish you the best of luck!!",
            "I'm so sorry, but I am so PROUD of how your are handling this. Proud that you're smart enough to leave him, but also that you've decided not to let his failure as a husband take something you want (this pregnancy) away from you. Destroy him in court. I'd also fight for sole custody - baby girl can see him when you or she decides it's a good time, but let him have no say. He lost the right to have her around when he fucked someone who isn't her mother.\n\nGood for you, OP.",
            "You've been on my mind since I first read your post. We are the same age and I just commend you for making such tough decisions (and remaining calm). I'm so sorry you married a child. Take all the time you need to heal and be the best version of yourself. You will rock on!",
            "I love your update! Too often people make excuses for their spouses cheating, you rock!",
            "We're the same age and I just cannot imagine being as much of a grown ass woman as you are currently being. I'm so in awe. ",
            "Congratulations on shedding dead weight from your life. I know divorce sounds awful but for some people it can set them free. I wish you love and happiness and I hope you and your baby have a wonderful future together. He can go to hell.",
            "I really don't get why people love to cheat honestly. But I am so glad that you are out of that mess. You will be an amazing mother and I praise you for being a tough badass. :)",
            "You are a fucking warrior. You handled it perfectly. Your husband is a piece of shit and I'm so happy you saw through it and dumped his ass. Good on you. You definitely deserve better. ",
            "You are so amazingly strong and your little one is going to have not only a great mom, but an excellent role model as well. Wishing you a speedy divorce and a happy and healthy nine months!",
            "Your child is going to be so unbelievably lucky to grow up with you as a mother. You are incredible.",
            "Pretty late to the game, but you handled that amazingly. I'm so sorry to hear this happened to you, because you seem like such a great person. But you seem so strong and mature, I'm sure you're going to bounce back from this in no time!",
            "Wow. You are an amazing woman. Good luck with everything, and i wish you all the best with your child.",
            "My heart goes out to you. And I'm super impressed with how you've handled all this. If I were you and he said the \"pregnant and crazy\" thing to me in that moment, I would've shut down and started silently plotting his demise. But I do not have as much self control as you. You are GOLDEN. Go you! I'm just so impressed, gah! I don't even know you but I do know for a fact that you will be ok. You're a strong woman. And know that there are a lot of us on this thread that want to tear into your pathetic, soon-to-be ex. <3",
            "Thank you for sharing. From one mom to another you got this and you sound like you have a GOOD head on your shoulders. Good luck and keep us updated ",
            "You are an inspiration. Your whole family, especially your baby, is beyond lucky to have you. Your intelligence and level head will take you wherever you want to go from here. Thank you for providing such an honorable example of how to handle such a terrible situation. You don't need luck, but I send you my best wishes moving forward. You got this! \n\nEdit: stupid auto correct",
            "Don't worry about being a single parent. My flatmate was in a similar position and she doesn't regret anything. With all the support you have you'll do great and be able to teach your kid the importance of self-respect just like your mum did for you.",
            "My god, you're so strong and amazing!! Wishing you and the baby the absolute best of luck, and that you really do fuck him over in court. You deserve every happiness after this bullshit!",
            "That baby is so blessed to have such a strong, smart mom. Well done and best to you both. ",
            "I'm so sorry for your hurt, but you do seem to be handling it well...best wishes for you and your baby <3",
            "Jesus. If he was going to try to lie to you, he could have at least gone for a more original and intellectually valid option than \"It's just your imagination, nothing to worry your pretty little head about! Your pregnancy hormones are obviously making you crazy! Not because there's anything suspicious about another woman sending me clear-cut evidence of infidelity!\" Pathetic.\n\nI'm so sorry you're going through this, but I'm sure that you will be better off without such a scumbag spouse. You sound like you're going to be an exceptional mother. ",
            "Props to you for sticking up for yourself and doing what is necessary.",
            "You sound like a great person and I'm sorry this happened to you. But I bet you anything for the rest of his life every single time he sees you or sees you with the kid he feels a pang of guilt and regret. I bet it will keep him up at night.\n\nYou'll be spared this and likely go on to raise a wonderful kid, work at a great job and find a worthy partner. It sucks now and I'm sorry that it does. But dollars to donuts you're going to be just fine. ",
            "Good God OP. Blessings to you and your baby. You sound like you'll be an amazing mother.",
            "I'm so angry for you but I'm happy that you're getting out of that shit situation with a piece of shit husband. Now if only we could e-babysit for you I would totally be on board :P",
            "God, he is going to regret losing a badass like you for the rest of his fucking life. Good job, momma.",
            "I've been following your post ever since I first saw it on here a while ago. OP, you are STRONG. Not just because you are handling this situation like the queen bee that you are, but your level head and your ability to think and plan is to be admired. As a child of a single mother (not saying you will be forever!) and a child of a nasty divorce, I can tell you that I never wished my a-hole of a dad was around considering he was a huge a-hole, and I had so much love from my single parent that was around. I am sure you will be the same, if not better for your little one. They are so lucky to have you as a mother. xx",
            "You are going to be one INCREDIBLE mother.",
            "I hereby designated OP the most mature person ever to reddit on reddit! You're an example to us all and your mom taught you well. I have no doubt you will pass on your wisdom to your little bun in the oven when she makes her appearance. \n\nPs.; your soon to be ex-husband is a dipshit. ",
            "What an ass he is. \n\nI'm so happy for you that you are so strong through this. You have more courage and motivation than any woman I personally know or ever heard of. \n\nGood luck to you. Congratulations on your pregnancy!",
            "You are so strong and will be a great mother. Your daughter is going places ",
            "I think you're doing the right thing, and your kid has an incredible mom. Your strength and integrity will help your child through a good many struggles in life. Please, continue to rock.",
            "OP I am so sorry.  There really are no words to comfort you at this time.  You need to know that under the circumstances, you are very strong.  Good for you in thinking smart, not many people do.  ",
            "Wow, such clarity. Much luck to you. ",
            "You're very brave and I'm proud of you OP. Here's to strong women!",
            "Damn OP you are an amazing woman.",
            "You seem like such an amazing woman. I wish you the best of luck in all of this!!",
            "Your strength is an inspiration. Good luck with everything.",
            "Good luck with everything in your future. You deserve the best. ",
            "I'm so glad you left that piece of shit. Good for you. You and your family are all rockstars. ",
            "I'm so sorry OP, you sound like you'll kick ass as a mom. \n\nMake sure you get some guidance on if or how you should involve the father in your child's life and if you choose not to make sure that they have some strong male role models.",
            "What an ass. His life sounds perfect. Beautiful, successful wife, New baby, great sex life. How could someone throw that all away?",
            "I didn't read the first part but I read this post. I'm really sorry... I can't imagine what it must feel like. I hate the thought of courts since my parents divorced. If there's ever a silver lining in this BS it's that your daughter is lucky to have her parents divorce while she's too young to remember it. \n\nMy parents divorced when we were old enough to understand everything and it completely messed up our adolescence. I now have GAD and borderline personality disorder and my sister has type 1 bipolar. Part of that was genes of course, but I know the stress brought it out. Their divorce was terrible, and when I say terrible, I mean by my father was making up insane lies about my mom committing crimes against him to get her in prison. \n\nI'm glad to hear you're keeping your daughter. Nothing is worth giving her up. My mom had me at 17 and I know she wouldn't change it for the world. She's now very ill with cancer and needs me to care for her too. You never know what life will give you but you just have to roll with the punches. Keep going, I wish you all the best. * *hugs* *",
            "I'm so sorry :( Please try and reduce your stress (easy right?) for the sake of you and your baby! And please except all the help that is offered! Good luck :)",
            "Numerous others have already said this, but I thought that one more message couldn't hurt. You're badass and already a great mother. I'm a few years older than you but hope to work toward your grace and strength in my own life.",
            "I am so incredibly impressed by you! Your Mama raised a strong, intelligent and self sufficient woman. No judgment whatsoever (I was actually glad to hear you're divorcing the asshat) but did you consider staying with him? What was the deciding factor to divorce? I ask because (although every situation is different) I've been married for 19 years and I'm not 100% sure I'd divorce my husband if he cheated, not that I ever believe he would. But then again, I'll bet you didn't think he would. Best of luck. Congrats on your impending bundle of joy. Take care! ❤️",
            "This is one of the most badass posts I've ever seen on this sub. \n\nYou are young, strong, and surrounded by people who are rooting for you. I am so glad to see you doing so well with such a painful situation. \n\nHere's to you and a new life! :)",
            "I loved your update. It's not some happy ending, but I love the way you faced this, the love you have for your daughter, and that you are financially independent with a solid family foundation. I love that, because of your independence and strength, you aren't trying to work through this with your husband.  You are free to fly away from him!\n\nI hate hate hate how life's most stressful moments tend to happen during a pregnancy. Keep yourself calm. Get out into nature as much as possible, and focus on your next steps like you said. It's all things helping you keep the stress levels mitigated and away from your baby girl. \n\nThank you for the update!",
            "Read the first post. SO sorry he is such and ass... He has some nerve trying to make you out to be the crazy one. Now everyone knows what a slimeball he is. ",
            "get any evidence of his affair saved. screenshot Facebook messages if you can.",
            "You're such a tough woman! Good on you. Your support system seems so strong and even though it will tie you to your ex, I never once got the notion that you don't want your baby. You have so much love to give even after all of this! Good luck and I do hope you find love again. Someone who deserves you as the strong woman you are.",
            "Oh my god, I read your original post and was hoping you would somehow update that this was a mistake. I'm so sorry to hear your husband is scum :(. But wow, I really admire you, you sound so unbelievably strong, I know this is extremely tough but you will absolutely get through it and come out better on the other side. And your ex will regret this for the rest of his life!",
            "If I were you, I'd never let him see the kid. He doesn't deserve to have a relationship with them. And what would he teach her exactly? That women are disposable and that men are untrustworthy?\n\nYeah, no. I'll pass on that thanks.",
            "In all of this, the real MVP will be your uncle :)",
            "Don't worry, everyone loves a hot mom, you'll probably find a new husband to be the little kids daddy",
            "[removed]",
            "[deleted]",
            "[removed]",
            "The above submission has been **temporarily removed** for **one or more** of the following reasons from the rules (as seen in sidebar):\n\n* It is an update post.   Our subreddit only allows a single Update to provide the community closure on the situation presented in your original post.  If you believe you will have more information to share with the community after a few more days or weeks, we advise you to hold off on updating the community until you can summarize everything into a single Update as you will no longer be allowed to make additional updates.  Updates made months or years after previous updates are up to moderator discretion for re-approval.  If your previous post was removed, we will re-approve it so that the community can now see it for context on your update, but it will be locked to ensure discussion stays on the Update.\n\nYou must make suitable edits to ensure that the submission confirms to **all the rules** listed in the sidebar, and in [wiki](/r/relationships/wiki/index#wiki_about_.2Fr.2Frelationships) (relevant for mobile users).  \n\n[Click here (once) to request re-approval](http://www.reddit.com/message/compose?to=%2Fr%2Frelationships&subject=Please+approve+my+submission&message=I+would+like+to+request+the+approval+of+my+submission+at:+%0A%0A+https://www.reddit.com/r/relationships/comments/4zkbp3/update_i_26f_opened_my_husbands_32m_snapchat_and/+%0A%0A+---+%0A%0A+My+submission+was+pulled+for+*being+an+update+post+without+links+to+original+post*.+%0A%0A+I've+read+the+sidebar+and+made+all+suitable+corrections+to+comply+with+the+rules.+%0A%0A+/u/thisgirlisonawire#btn) and then click send **once** only.    \n\nThe re-approval is manual, so send a **single request** only. Multiple requests do not mean faster approval, in fact they may clog the modqueue and result in re-approvals taking even more time.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/relationships) if you have any questions or concerns.*"
        ]
    },
    {
        "post_id": "bbbfo8",
        "author": "throwaway49204",
        "title": "[UPDATE] Me [31F] with my husband [35 M] married 2 years together for 10. He doesn't want his kids to be like me.",
        "url": "https://www.reddit.com/r/relationships/comments/bbbfo8/update_me_31f_with_my_husband_35_m_married_2/",
        "score": 7865,
        "num_comments": 135,
        "created_utc": 1554834360.0,
        "selftext": "https://www.reddit.com/r/relationships/comments/2i34pr/me_31_f_with_my_husband_35_m_married_2_years/\n\nIt took me 3 more years, but I finally left him last year.\n\nThis post helped me see how much was wrong in our relationship, but I was still so hesitant to leave.\n\nWe had pets and a beautiful home together and I loved his family and we had so many inside jokes and plans for the future.\n\nBut eventually it was all just too much for me to take any longer. The day after his parents' 50th anniversary party, I told him I wanted a divorce. I just couldn't see myself living like that for 50 years.\n\nI moved from the suburbs to the city with a friend. I rekindled some old friendships from high school and made a bunch of new friends who I am so thankful for. He kept the dog, I took the cats.\n\n**I thought my life was ending but it was just beginning.**\n\nI told my (very religious) family and they were all understanding and supportive. I've maintained friendships with a good number of our mutual friends, friendships I was worried about losing.\n\nI'm working on my masters degree and volunteering and experiencing life and love and art and beauty like I never thought was possible.\n\nI met a guy at a friend's punk rock show and we hit it off, but we are taking things very slowly. He is wonderful and so kind to me.\n\n**If you are in an abusive relationship, please don't be afraid to leave.**\n\nIt gets so much better. I still miss him from time to time. I feel guilty about getting divorced, guilty for wasting my parents money on a failed marriage. I miss his parents. I miss my dog.\n\nBut I am SO MUCH happier. My future feels uncertain, but that is better than feeling like a death sentence.\n\nThank you so much to everyone who offered advice and sympathized and even had harsh words for me deciding to stay.\n\ntl;dr: Left my abusive husband. Life is much better.\n\nEDIT: for those saying it didn’t sound that bad or abusive, you should know it got worse. It did escalate to physical abuse, us sleeping separately/no intimacy for a year. \n\nIf you think you are too old or too much trouble or have too much baggage or are too much anything, please believe that it is possible to find love again. Both loving yourself and having someone else love you 💕",
        "permalink": "/r/relationships/comments/bbbfo8/update_me_31f_with_my_husband_35_m_married_2/",
        "comments": [
            ">My future feels uncertain, but that is better than feeling like a death sentence.\n\nYes! I remember reading once that what human beings are scared of most is uncertainty. So in a way, staying with your abusive husband -- while awful and full of emotional abuse -- was the safe option because you *knew* what you were in for. Leaving him was an act of bravery and I hope your future is full of warmth and love.",
            "I'm so glad you left and are in a better place. Good job. :)",
            "Good for you OP and thank you for the update. Sometimes it is so hard to leave unbalanced situations like that because at least you feel like you \"know\" your situation, and that can feel better than the unknown. \n\nI know how horribly he'll react to this so I can prepare for it.\n\nI know to walk on eggshells so I am ready for it.\n\nYou do your best to act as your partners \"handler\", like some kind of lion tamer. But relationships should not be like that.\n\nI am happy for you!",
            "Congratulations!  I'm so so very happy for you for changing how your story ends, please keep telling others so more people can be inspired to leave abusive relationships like you have! It must have taken  so much courage to take that leap , but so worth it!  And I totally understand where you came from and where you're going, my child's father would ask me such deprecating questions too, he broke me till one afternoon i was so low i hurt myself without thought, believing I deserved to be punished because I struggled to make him happy, but the moment I felt the pain I realized i was hurting myself for someone who obviously doesn't love me , when i should be healing myself for  my child's life.  I eventually left him a few months later, and my life soared after that! \n\n&#x200B;\n\n 7 years later I now have a happy home to myself and my little one with our cat, I spend my days free to do what I want with out walking on eggshells, my skin itself has cleared up because im not drinking as much, and my stress levels are down one million percent, Ive created hundreds of pieces of happy art and best of all, I met an amazing man who takes care of me and respects me who is everything I ever wanted!\n\n&#x200B;\n\nIT GETS SO MUCH BETTER!!!",
            "As someone who left an abusive relationship as well, I agree with much of this. Being uncertain if your future is so much better than being unhappy. I think I was so afraid of the uncertainty (of ending up alone, of losing people,  etc) that I didn't even see how freeing uncertainty is. If things are uncertain,  it means you can choose so many directions,  and there are so many possibilities. \n\nUncertainty feels like freedom once you leave a controlling and abusive situation. I never realized that when I was still in it.",
            "Hey, uh.. I've only been on this sub for a short while, but reading your old thread - and your replies - brought me unhappily back to the seven year marriage that I left two years ago.\n\nI'm really glad you got out. <3  It's hard as hell, but it's so worth it.",
            "Congrats on your new life, I'm glad you're happier, I wish you nothing but the best, and a new dog, happy new life x",
            "Congratulations on your weight loss! No longer will you carry that burden. I read online that it takes about 7 attempts to walk away from an abusive partner. I was with my ex for 2 years and tried multiple times to leave. I'm so happy for you! Congratulations again on your new life! You deserve it! And all the good and all the love that is heading your way! You Are Enough!!! xoxo",
            "I read your first thread, and I'm honestly shocked you were able to get out. He had such a stronghold on you. Congratulations on building the strength needed to escape this monster.",
            "I’m so glad you have found freedom. But remember, your parents paid for a wedding, not a marriage. Don’t feel guilty for the money they spent on a party because you left an abusive marriage.",
            "YES! This is how all updates to posts about abusive partners should go. Good for you OP and keep on trucking.",
            "Wow being so positive after a difficult step is incredible! Good luck!",
            "Congrats to you! So happy for you and even more so being a real life example of that there truly is rainbows after the storm and leaving, while scary and daunting in the moment, leads to a much better quality of life. ^_^\n\nWe are all deserving of finding our happiness, truly.",
            "Very proud of you. Congratulations! Life is GOOD.",
            "I’m so glad that you left and are in such a good place. Reading your original post, I am in a similar situation (constantly walking on egg shells because my SO is somehow always going through a stressful time - both of our lives are stressful, but somehow feels like he can say whatever and talk however he wants to me). Emotional abuse can take many different forms. Thank you for posting about the light at the end of the tunnel!",
            "I’m in this situation now except we have three kids. And I just feel trapped and like I’m suffocating but he won’t leave and I don’t have anywhere to go and sometimes it feels easier to just stay together for the kids instead of doing this.",
            "I know that was a tough decision and it hurts, but take some time everyday to remind yourself how strong and awesome you are. I don’t know you, but it makes me happy that you’re happy. :)",
            "Are you me?  Seriously though, it's the most amazing thing when you have someone treat you with respect and genuine caring for the first time, and then realize you deserved that all along.  I left my abusive ex last year and am now with the man I wholeheartedly believe is my soulmate (never believed in those before him).  When I start to feel guilty or like something was wasted because of that relationship, I just remember it's behind me and it got me to *here*, and there's absolutely nowhere else I'd rather be.  Stay strong, you have great things ahead of you!  :)",
            "Congratulations on leaving, I’m so happy for you :)",
            "Good for you! Things are so much brighter on the other side.",
            "Wow. Great update. I'm happy for you!",
            "Hell yeah! Keep on keepin on!",
            "I am glad you are safe and have room to grow in your new life.",
            "I am so happy you finally were able to put that behind you and start a new life. And dont think about it as a failed marriage because you tried so much. Sometimes things don turn out how we expect but Thank God were alive for another change. Curious, what happened to him?",
            "I'm so happy for you love. \n\nMost people tend to think that an abusive relationship does not only mean it's physical, it can be mentally and emotionally abusive as well! Whichever type of abuse you encountered, I'm happy you were able to overcome it for the better! Only the best for you! <3",
            "You are incredibly strong. Keep your head up and keep doing what's healthiest for you!",
            "This post brought a little tear to my eye. You seem like a lovely person and so strong. I'm so glad things worked out for you.",
            "Congrats! As someone who's gotten out of an abusive relationship (albeit not a marriage), I know how hard it really is. You're a badass and a strong person and you deserve all the good things.\n\nAnd re: your edit-- It didn't need to have escalated for you to still be 100% justified in leaving (but I'm so sorry it did). No one should treat their partner the way he treated you. Everyone deserves to be safe, respected, and loved in their relationships.\n\nPlease enjoy your newfound independence and best of luck in future endeavours, romantic or otherwise.",
            "I’m so happy you left and your life is amazing! This always makes my heart burst with happiness. I was in a 9 year abusive relationship, and the fear, isolation, and just uncertainty is what kept me there for so long. I just couldn’t take it. I wanted to kill him, then myself, I so was miserable and desperate. Thankfully, I had amazing friends who stuck by my side all those years no matter what my ex said, always filling me with love, letting me know I always had a bed at there house for as long as I needed it. When I finally left the big beautiful house, with all the expensive toys in the barn, with  just my couple bags of clothes and my pillow, my world as I knew it burning down around me... I had never felt so relieved and happy!! I could actually breath again!! And I’m happy to say I never shed a tear after I left (about him). I lived with my best friend for 2 months, then got my very first apartment by myself. I slowly started over, and life just kept getting better. Two years after I left, I met my soulmate. We’ve been married now for almost 3 years, together for 6, and I found a level of happiness and peace of mind that I had never dreamed ever existed. Reprogramming everything my ex did to me took time, and I’m still working on it everyday. But I feel truly strong, beautiful, and loved today.",
            "I'm so glad to read this, people need to read more stories likethis. It's so hard to leave an abusive relationship and takes alot of strength to do so. I've had 3 very close people in my life be in abusive relationships (sister, sister in law, and close friend) some emotional and some physical. All of them found they strength to leave and better their lives. My sister left with 2 kids while pregnant with a 3rd and it's been financially hard but the 4 of them are all happier and healthier. A smaller house and less possessions is worth your health and happiness, best wishes OP",
            "I made it about two paragraphs into the OP and i was like \"yeah fuck that guy\"",
            "Who told you it doesn’t feel like abuse? It totally did. Those people who told you are just in denial with their own abusive partners.",
            "Good for you! I know it's so hard to leave when you've known someone for so long.",
            "I also left an abusive ex husband and there was turmoil, personal absolute turmoil everyday in deciding what the best thing to do was. In the end felt it was better for my child and my own sanity. Going to court was the worst but on the other side I can breathe a huge sigh of relief daily. I was able to secure a career again and sufficiently rely on myself. I tend to stress easily but man oh man I have saved myself. Be kind to yourselves. No one deserves abuse.",
            "Wow I was JUST thinking about this original post the other day and thinking about how hurt I would be if my husband called me names and treatment me that way. I am so happy you left him and are in a happier place!",
            "I needed to read this. Thank you for sharing.",
            "You sound happy.  I don't think when we are young that we really think about just being happy.  We just think about what is expected of us to be considered successful.  Or at least that is what I did.  So nice to see that you have found a place in your life you can be happy!",
            "I'm so happy to hear things have turned around for you I'm excited at all the new opportunities you have ahead of you",
            "This is such a beautiful post to read.\n\n&#x200B;\n\nCongratulations for loving yourself and taking care of yourself!!",
            "Cool happy ending, thanks for sharing.",
            "Thank you for sharing your uplifting update!",
            "Good for you. I hope your life continues to improve, and im so glad to hear you were able to get out of a toxic relationship. All the best to you OP.",
            "wow thank you so much for sharing you are very brave and I look up to you and your strength!",
            "Going through my own divorce (by my own choice as well), so it's always nice to hear stories of people making it out happy out the other end. \n\nGlad you got out of what sounds like a moderately abusive relationship. All the best!",
            "I’m so glad for you, OP. Congratulations!",
            "Happy for you. Everyone deserves someone kind.",
            "Good for you! Keep rocking!",
            "What a beautiful and inspirational post! Very happy for you and this has given me hope that one *can* turn their life around and achieve happiness and well being. Congrats gurl!",
            "> **He doesn't want his kids to be like me** \n\nWhy the hell did he marry you then?\n\n> tl;dr: Left my abusive husband. Life is much better. \n\nGood for you.",
            "I'm so happy for you!  I grew up with a father that sounded like your ex, and it definitely messed with my head and outlook on life.  Not having kids with him and moving on to bigger and better things was brave, inspiring and all around awesome.  Your future sounds happy and bright, I'm tearing up a little with joy for you.",
            "well done! fantastic update!!",
            "The path from insensitive to verbal humiliation to abuse is so hard to accept, and then adapt to. For me, I doubted myself and still do at times.  But like you I’m out now.  What seemed like uncertainty changes and the future seems bright again.  So glad you made the leap!!!",
            "\"I thought my life was ending but it was just beginning\" - same thing when I left my ex spouse (we have kids together). I couldn't even  comprehend how good it was going to be. And my kids net benefitted too.",
            "Thank you so much for posting this.\n\nI'm fresh out of accepting that I can no longer take the lies, cheating, and abuse myself. Logically I know he's an absolutely horrible man and I need to stay far far away. However I'm still battling non stop urges to reach out thanks to the control he had over me for so long.\n\nI'm trying to keep my mind busy with the things I love, but it's so far from easy.\n\nSeeing this post reminded me that if I can just stay strong through this initial withdrawal period, there is something so much better for me on the other side. A world of people I can trust and hobbies I love and accomplishments that aren't taken from me.\n\nThank you 1000 times over for posting this.",
            "Thats what people dont understand. \n\n*It doesnt sound that abusive*\n\nSTOP SAYING THAT. IT ESCALATES. ALWAYS. \n\nNow that she's out she can pick out abusive men from *miles* away. I know this because I can too. \n\nHow he spoke to her. His behaviour...reeks of narcissism.  When our friends come to us and tell us their partners are behaving like this we should never say this behaviour is ok or not that bad. It is that bad and it will get worse. \n\nI am so glad you got out. I know the happiness you are feeling. People in my life that I haven't spoken to in years have sent me messages to tell me I am glowing now. \n\nIt really is a freedom like no other. I spent 18 years in a prison. Everything is new. Everything. And its awesome. In happy that you get to feel that too.",
            "Wow. You're original post could've been written by me. Like you, I left and happy I did. Congrats on your new beginnings!",
            "It's always a good way to judge the status of your relationship and where it may go in the future is if you feel you could be celebrating your 50th anniversary with them down the road.",
            "\"Better the devil you know\" really isn't true.   Glad you decided to remove yourself from a bad relationship to put yourself in an uncertain future!  It takes guts.",
            "I am so, so proud of you.",
            "i, too, left an abusive relationship and was SO scared at first. at the beginning, it’s gonna suck. bad. but nothing compares to the happiness and freedom you will experience once you restart your life. for anyone reading, PLZ get out. the benefits far outweigh any temporary grief you might experience.",
            "Way to go! Congratulations!",
            "I’m so happy you had the strength to leave someone recognizing he clearly did not respect you. \n\nSo so happy for you",
            "Thank you so so so much for sharing this❤️ \nGod Bless you! 🤗",
            "Wish I’m brave as you. Best of luck, OP! 💕",
            "What a great update. You were so brave to leave and should be proud.",
            "I left an abusive relationship and it was so frightening. But I have this very clear memory of months later, going for a walk and feeling so light and near giddy. It just came over me that I was free. It sounds like you are doing you in the best way. Congratulations on leaving and being a total badass.",
            "Happy for you OP, thank you for the happy ending. :)",
            "I'm so happy for you, wishing you the best. It's strange how sometimes we can't see how bad things are on the inside of the situation.",
            "I’m so proud of you! Jumping into an uncertain situation like that can be terrifying. It sounds like the world has gotten a lot brighter for you.",
            "I just want to let you know how proud I am of you and how happy I am that you are doing so much better. I’m sorry that things didn’t turn out the way you may have hoped when you were with him, but I’m happy that you get to have this sort of rebirth and evolution. I wish you the best on your future endeavors and I hope for more happy updates!!!",
            "What an excellent update! Good for you.",
            "Good for you!!!  I can relate as I got out of a long term relationship that was similarly destructive.\n\nI'm happy that you are able to see a brighter future for yourself. That, in my mind, is the most valuable thing.  Good luck with the future and your happiness!",
            "Im so happy for you! I hope you live your best life!",
            "You’re brave! We have one life, we need to enjoy it!",
            "Congrats on being strong and courageous enough to leave and create a new life for yourself. I'm proud of and happy for you!",
            "I’m so proud of you for taking everyone’s comments on board and then making the decision when it felt right to you! I’m so sorry you had to go through what you did but I’m so so happy that you’re in a better place now! You Deserve happiness and I sincerely hope you stay happy!!",
            "This will probably get buried but I have to put in my two cents. I am so happy for you!!! Life is way too short to stay in an unhappy marriage.\nI left my emotionally abusive husband after a 6 year relationship and married for just under 2. It was hard. My very religious family all turned against me and he turned my 13 year old daughter against me in the process. I’ve been fighting for months to get her back. But.. I’m happier than I’ve been in a long LONG time! I have an amazing boyfriend who’s loving and supportive and has held me up through this. Things do get better and it’s not always easy to follow your heart but it’s so worth it. Congrats!!! ❤️❤️❤️",
            "I am so happy to hear this and that you got out of that situation. The future is yours for the taking!",
            "I’m just upvoting your entire post, this is such a honest and critical post that I think so many people need to see.\n\nI’m so proud of you, and I’m ecstatic that you’ve seen the other side and how you’re living your best life.\n\nTake care and stay well xx",
            ">He kept the dog, I took the cats.\n\nThis was unexpectedly heartbreaking. I hope the animals don't miss each other too much. But you did the right thing! Have a great life ahead and please cuddle the cats for me :)",
            "Oh I know this feeling so well. I'm so happy for you! Even though it's hard and uncertain, even though there are things you might miss, you did the right thing. It **will** get better.\n\nWhen I left my ex (also abusive) it was terrifying, but I suddenly felt so free. I would walk down the street with a huge smile on my face because I knew he wouldn't be waiting at the end to tear me down. I'm remarried now and the difference is night and day, I can't even imagine being back where I was before. All the best to you, I hope you have a shining future!",
            "I teared up reading this. Having worked with domestic violence victims, I've seen how hard it can be to change your entire life. You should be extremely proud of yourself. Very happy for you.",
            "First of all as a comment to your original post, I understand his outburst but it definitely was not deserved. If he’s never communicated to you how he would want to handle a situation like that, that’s not your fault. Anyone in your position would have assumed someone would want to know that kind of news as soon as possible, and I don’t think you could’ve expected him to react the way that he did. You have empathy *because* you told him, knowing he may want to hear that from you vs. finding out on Facebook. The fact that he reacted in such a volatile way says more about who he is as a person than it does you. Thank god you didn’t have kids with him because he’d screw them up way more than it appears you would have. Kudos to you for leaving him - he’s not worth the toilet paper you wipe your ass with, and I hope he comes to that realization when he’s alienated everyone around him.\n\nAs a child of someone whose father behaves exactly like your ex, it fucks you up mentally in ways you didn’t expect and lasts well beyond childhood. When all you hear from someone is criticism and negativity (no matter who it’s directed at), you start to assume everyone behaves that way and that the reason is you. It’s even worse when you witness it as a kid between parents - my father has been verbally/emotionally abusive my entire life, towards everyone but especially my mother and me. Spent the better part of 25 years chasing after his affection and approval with not much to show for it. I can’t begin to explain the kind of choices I’ve made romantically because I craved the male attention from them that my dad couldn’t bother to give me. The worst part was that in one way or another they almost emulated him. I’ve since cut my father out of the majority of my life and for the first time in my life I’ve taken a step back from dating to focus on bettering myself as a person and understanding what I’ll tolerate and what I deserve. It’s taken a very long time to come to that understanding and I know I’m far from the end of the road. \n\nYou made the best decision possible by leaving him and I’m happy for your new beginning with Mr. Punk Rock - if you eventually do want children and he’s shown you he’s up for the adventure, I hope he’s everything in a dad a kid could want, and everything you could have hoped for (and more) in a partner. You deserve to be happy ❤️",
            "Good for you! I’m glad you are finally living your life.\n\nI am like you on the subject of having information withheld. My mother does something similar. She does it because she convinces herself it would be too distressing to the other person but in reality, SHE does not want to deal with negative or emotional reactions from loved ones. Recently my father was admitted to the Hospital from being very sick. There was a chance he wouldn’t make it. He has been sick for a while now and we all know he may not have much longer. My mother did not want to tell my brother or my niece. She said “you know how Robert just freaks out..” well yeah, his dad may be dying and it’s normal to freak out. She didn’t want to tell my niece, age 20,  because “you know she just had two wisdom teeth cut out a week ago..” ok I know she had dental issues but she deserves to know what’s going on with her paw, who she loves dearly. I was like “mom do you think it’s fair to them to keep them in the dark? What if he doesn’t make it and they didn’t even get a chance to come see him? How would you feel?” She agreed and finally told them. When she did, my niece asked mom over and over if she promises she is telling her everything. She was doubtful that she was being 100% honest. I pointed out that the reason she is like that is because she doesn’t expect you to tell her all of it. That’s just a recent example but there have been many things and continues to be things, over the years she’s not forthcoming about. It’s only when shit hits the fan and she has no choice that I, find out things.",
            "This post made me cry, I'm so so  happy for you! And please ignore those who are saying it doesnt sound bad, emotional abuse can be crippling and cause so many mental issues or lead to suicide. I hope the guy you're with treats you well and that you have a wonderful life <3",
            "[removed]",
            "[removed]",
            "[removed]"
        ]
    }
]