[
    {
        "post_id": "bto2oo",
        "author": "Ohlordnotfriday",
        "title": "[Update]Friend [37/F] is about to be turned-down for a promotion she has dreamed of for years. I [36/F] know it's coming and don't know how to support her or what to do.",
        "url": "https://www.reddit.com/r/relationships/comments/bto2oo/updatefriend_37f_is_about_to_be_turneddown_for_a/",
        "score": 3710,
        "num_comments": 318,
        "created_utc": 1558974819.0,
        "selftext": "[Previous Post](https://www.reddit.com/r/relationships/comments/b47frm/friend_37f_is_about_to_be_turneddown_for_a/)\n\n&#x200B;\n\n&#x200B;\n\nLordy. Where do I begin. I need more help. \n\n&#x200B;\n\nThe guy they wanted took the job - way more than they initially wanted to spend. My friend was devastated. I followed the advice here and told her she did a great job and how proud I was of her, but the other guy did an amazing job and I didn't know what would happen. She was confident that she was going to win - she had more experience with the company vs. his experience & education. At 4:55 she got a call thanking her but that they went in a different direction. HR offered to meet to discuss how she could improve and to stabilize working relations with the new guy. Shortly there after it was announced company-wide he had agreed to take the job and they were thrilled. She took the following couple of days off and didn't respond to text or email. She just completely took some time away (fair enough). She returned mid-next week and found-out that he wasn't going to start until a couple of weeks later and that she had time. Then a company-wide email went out announcing that not only had he finished the final requirements for his MBA and took first place in his final case competition beating every other school in the country but that he was starting sooner than anticipated. A lot of emphasis was placed on his Ivy League education, which really irked Tina. \n\n&#x200B;\n\nHe would come in occasionally (before his start date) to meet with senior executives and his team members and pushed them to get unvarnished thoughts - a lot of them really complained about working conditions on the team and major obstacles they faced. A few really told him the unvarnished truth. \n\n&#x200B;\n\nHis start date rolled around there after, and the hype was real. He hit the ground running and his first week was incredibly busy. On day one he held an open meeting where he came in and immediately banned weekend emails (some teams were expected to check/respond to emails 7 days a week), gave staff commensurate working hours to the rest of the company (we never got summer hours or flex time, which he immediately changed) and followed-up on promises made by previous staff. He rolled out new processes, budget models and is a far more effective at advocate for the team - so much so that all the old time staff have become his \"followers\". A lot of people were worried about being fired (performance had been way down) but we're already seeing a glimmer of hope - the cuts he made preserved his staff, meaning they have a little less cash to spend but a lot more bodies doing the work. All told, they're better off now ( three weeks in) than we were this time last year. The staff love him, he's very approachable, informal and because of his connections to senior leaders in other departments, that team gets a lot more attention than we used to. Our old boss was sweet and kind, but she was incredibly ineffective. I'm considering transferring back into that unit because the working environment is better than where we are. \n\n&#x200B;\n\nThe problem has become Tina. She's tried to question his leadership, she's openly annoyed with colleagues and feels like she's the only person who doesn't \"see\" the truth. The value in the new guy is his ability to change - our teams work in close collaboration and their team is a lot more productive now than before and are getting better quality work done - they've started conversations with old clients and the business funnel has grown. VPs openly comment that he'll be moved up in short order. Yet, Tina holds are horrible grudge. It's obvious with how she interacts with staff and colleagues; she complains when he's not in the office and complains when he is in the office. I know of a least a few people who are growing weary of this and two have asked me to say something to Tina (since we're friends). Another threatened to go to HR. \n\n&#x200B;\n\nFor all his connections and Ivy League education, the guy is also a really strong performer. He has an activity board up showing process and change and people feel less dour, except Tina. She's complaining non-stop. It's impacted our relationship to the point where I've been avoiding her. It's been two months since she found out and three weeks since he started, and I feel like \"enough is enough\" that said, she's a single mom and I don't want to see her fired for being silly. \n\n&#x200B;\n\nI'm really not good with confronting people, I don't know what I should say. \n\n&#x200B;\n\ntl;dr the new guy started and the hype was real. he's been great but Tina took rejection so badly that I'm worried she's going to be fired. I'm not sure how to handle this. She's going to get fired if she doesn't stop complaining and people want me to speak with her.",
        "permalink": "/r/relationships/comments/bto2oo/updatefriend_37f_is_about_to_be_turneddown_for_a/",
        "comments": [
            "I have seen plenty of people react poorly to a disappointment in their career, and this bad behavior put them permanently out of the running for future opportunities.  \n\n&#x200B;\n\nAs a friend, you could say to Tina, preferably with respect to a specific behavior, \"I understand your are disappointed, but complaints like this are going to give people a negative impression of you.\"  You can also try to set limits on how much complaining you're willing to listen to during your non-work time, but the more urgent problem, it seems to me, is to keep her from losing her job over this.  \n\n&#x200B;\n\nReally, her supervisor or manager should be the one talking to her about this.  If they are thinking of firing her then they should be talking to her about the problem and giving her a chance to get it together.",
            "Tina’s only hurting herself in the long run. When this guy moves up in the organization, Tina’s the next logical candidate for his current role - as long as she quits acting so unprofessionally. I’m not saying she has to become the guy’s biggest fan; just quit moaning and whining.\n\nThe way Tina behaves now is what upper management will think of when they’re looking at her for other roles. If she can show that she can be professional with someone she doesn’t like, she’s laying the groundwork to show she can be a good team leader in the future.",
            "Dang, yo. He banned weekend emails AND found a way to prevent layoffs? I like this guy.\n\nI'm sorry I don't have much more advice to offer. Regardless of Tina leaving or staying, at least you have a good boss in the mix.",
            "This guy sounds like a human rocket - we had one of those become director of our department once. He was fantastic - and he bounced out of the position less than two years later to become a VP elsewhere. Happily he had laid down a lot of great groundwork; years later we're still better off than we were before he came around. If \"Tina\" gets on board maybe she could be the one to take over when he moves on (as others here are also saying).\n\n&#x200B;\n\nWhat she does with this moving forward is everything. The hire was a professional choice, not a personal one. When someone feels like they did their best and it wasn't enough, the sting IS brutal, but if they can try to see it as a chance to learn and improve and kill it (or something else) next time around.. it may help. Maybe.\n\n&#x200B;\n\nIt's hard fitting into the world sometimes. I really hope Tina is able to find a way to work with this setback instead of against it.",
            "OP, I remember your previous post and hoo boy, do I feel for both you and Tina. It’s really hard in this situation. I understand her feelings completely, especially if some of the reasons she wasn’t picked for the job had to do with lack of training in ways and opportunities she didn’t have, like schooling. \n\nThat being said. Companies and jobs are there to profit, and this guy sounds like a scoop for your company. It also sounds like they offered to support Tina by providing her feedback on ways to improve. \n\nAs other posters have said, Tina was considered for the promotion and could at some point move up when this guy does. But not if she stays bitter and at odds with the team.\n\nCould you take her out for a happy hour drink? Let her rant for a bit and then give her some tough love. “Tina, you’re an incredible woman who has been through so much and you have so many valuable skills. But you’re really hurting your prospects at the company by badmouthing A. He’s been great for the team. Him getting the job over you wasn’t personal for him, and blaming him isn’t going to get you anywhere. I suggest at the least, keeping your frustration to yourself or at best, working through it, and demonstrating maturity and cooperation by learning from his techniques.”",
            "Tina needs to get on board or she needs to be let go. The only thing she is doing is setting herself up to never be promoted or fired.",
            "This has happened to me twice: the other candidate was chosen and I had to train them to do the job I applied for.\n\n\nBeing bitter for a couple of days or even a couple of weeks is understandable, but at the end of the day she will become known for being a pain in the ass and being a terrible team member... tell her she needs to cool it at work with the comments as they damage her future. If she cannot cope, she should move department or job.",
            "I remember your post. I actually really feel for Tina although she is kinda asshole. I applied for this job, didn't got it but now I'm going to work for the summer in the same place lol. I have to admit, after reading this post I'm scared I won't be able to act naturally around the person who was chosen. \n\nBut yeah, I can see why Tina is bitter. But for her own sake, she should get over it. There's not much you can do. You can always have a conservation with her how she's hurting herself and her career with her behaviour, but it's up to her to change her it.",
            "Honestly, it isn’t your responsibility. Either speaking to her *or* protecting her from the consequences of her actions. I know you’re worried about the whole “single mom” thing, but in the end it has nothing to do with you— and it’s not like Tina is unemployable otherwise, she’ll find other work. The reality is, she probably is going to be fired. And going by how she’s acted up until this point, it’s probably going to be a messy and dramatic affair. Why take on that extra stress into yourself?",
            "All you can do is say that objectively the guy is doing a good job, has come in from the outside and folk have quickly responded to his way of working. \n\nAlthough you realise it's hard for her to hear, there's no point in taking it personally. You can't always get what you want in life, and holding on to these feelings is going to hurt her friendships as well as her career prospects. From reading the OP, it sounds like this guy is very sharp, but has also benefited from privilege/connections inside the company, so it's no wonder your friend is a frustrated. \n\nYour friend is obviously tenacious and hard-working, so there's no point in poisoning the well because this decision went against her. This is not how a leader responds to a decision not going their way. Furthermore, as others have mentioned, it sounds like this guy is going places and will soon be promoted again, leaving the seat empty. Advise your friend to take a breath, pipe down and learn from it. She might well get it at the second bite.",
            "Frankly, I'm not really sure why I get all the hate on this guy from Tina's end. Yes, he's benefitted from a ton of privilege that Tina hasn't--but he's also the best choice for the job. Why don't you go to Tina and say \"hi there Tina, I'm really sorry to see that things didn't work out. I know you hate hearing about his Princeton MBA. But listen, other people can tell you're clearly annoyed at him, and it's hurting your standing at the firm. This really sucks, but do you think you could try to cool it and cultivate a better working relationship with him?\"\n\nI get that this sucks for Tina, but it almost sounds like the firing will be well deserved: part of professionalism is dealing with crap like this without throwing a fit and holding grudges.\n\nIf Tina is really upset, she should get a job somewhere else and quit.",
            "One of the most important qualities in a leader is being able to work with all personality types and backgrounds. Sounds like Tina is way too bitter. She should be focusing on continuing to improve herself so that WHEN this guy moves up in the ladder, she can continue to advance in her career. You've already said she has put the time in with this company, I would try to sit her down for a conversation to put it in perspective. It could simply be that no one has pointed out her crappy attitude. Let her know, flat out, that everyone else is on board with this guy, and sucking it up and at least pretending to be on board, is in her best interest too. If she still doesn't listen... she deserves to be let go.",
            "I have personally been in a position where I was interviewed for a job which would have been a promotion for me. I actually got the job being the most qualified candidate. Two days before I was supposed to start my new position, the person who left came back to his old job. I could have been bitter about it, but I chose not to be. I looked at from the perspective that management believed I was good enough to be interviewed for the job to begin with. I stayed professional and did my job. A few months later, another opportunity opened up. A new job was created. The job was not only higher paying, it was a critical job that could have a long term impact on the company. I don't know the reasoning, but the job was offered to me first without any formal interview. Of course I took the job.\n\nThe long and short of it is to advise Tina to don't look at it as a bad thing. Management remembers people and sometimes things will turn out better than expected. But attitude and how you handle rejection can make all the difference in the world.",
            "Tina is going herself a disservice. When I read the description of this in the previous post, it sounded like the hotshot was groomed for the position by the AVP (given the answers and direction the company wanted to follow). But the hotshot sounds like he's doing a fantastic job and everyone is happy in the team.\n\nTina needs to be a team player because the hotshot will be moving up the ranks really quickly and he'll leave the job in a few quick years. She got beat by someone more qualified and her sulking isn't helping.  \n\nMy advice to you to give to Tina is to suck it up and become this guy's mentee (not a brown-noser). If she shows initiative and can learn from this guy, there could be an opportunity for a promotion when he leaves. That's only when she loses the attitude.",
            "I feel bad for Tina. I've been in a similar spot, and even reacted in a similar way. It's childish and unprofessional, but I get it.\n\nWhat helped me, and what might help her, is letting her know how this is affecting other people's opinion of her (without naming names) . This guy won't be there forever, but after he's gone she won't get the position if she continues to drive everyone away with her negativity.\n\nI'd outright tell her she not only needs to cut it out, but actually probably needs to work on reversing the effects of what she's done. She needs go win people back so she's ready for the next opportunity.\n\nAnd since it seems like this guy is extremely talented, it's also an opportunity to learn from him. Top performers like to work with top performers, and if she can show her value, there's a chance he'll be willing to develop her to replace him when she goes.\n\nThere's a delicate component here about age, and how humiliating it might feel for a middle aged woman to have to learn from some hotshot guy in his twenties, but I'm pretty young myself, so I have no advice to offer there.",
            "Everyone pay attention.......Don't be a Tina, Tina will be fired because she didn't get her way. \n\nObviously, HR saw something in this guy that they liked and went after. Promotions based on education alone make very poor leaders statistically. I am an HR Manager, and when I hire people, a hire a personality, not a diploma. I look for so many different qualities. \n\nMany Tina's in the world today. Maybe she should self reflect and evaluate herself. Work with HR, see where she could improve. It seems to me though, she has already made a scene. She should probably look for another job. I will fire someone extremely quick for toxic behavior.",
            "This is not your circus any more.  Tina probably needs to move on; she is probably more valuable somewhere else than being resentful here.  If you do nothing, she will probably lose her job.  If you try to persuade her to act better, she will probably lose her job \\*and\\* you will probably lose the friendship.  If she loses her job, she may need you for support so damaging the friendship right now isn't optimal.\n\nI'd try to be neutral, to let her do her thing, and to really just not respond to most of what she says.  There's no way your taking a side here can help her.\n\nThe best thing you can probably do for her is to persuade her to keep her head down while she gets her resume out there.\n\n\"Tina, the management here doesn't see your full potential the way you do.  You have probably hit a dead end here.  I think you should start looking elsewhere.  And in the meantime, you should probably really just keep a low profile.  Right now, they're all in love with Bill and if you rock that boat you'll just get worse references.  Focus on yourself right now, not on setting the company straight.\"\n\nSurprisingly, when people get fired in situations like this they usually end up much better off somewhere else.",
            "I was in your exact situation, except I was the hiring manager.  We had a very senior person (X) in a niche area retire and it took me 18 months to convince leadership that we needed to backfill that position.  (I was super frustrated. Although it was a key position, it wasn't one that affected C-Suite day to day and it took 3 presentations to leadership to get the backfill - and yes, it took 18 months to get those three presentations on the calendar and I used a different appeal each time - what worked was coming in with a spreadsheet showing what wasn't getting done, go figure.)  \n\nAnother employee (A) worked under X, had similar expertise and stepped in and take over some of X's duties in addition to her own.  (A also reported to me but I will say that she didn't do the whole job X did but she kept the trains running.)  So when we advertised the position, A was the front runner.\n\nThen came the interviews - we had a panel and A came in *certain* that the process was just a formality.  She was unprepared for the questions from the panel, emphasized her experience in her current job and was just not able to say how she would approach and improve the new job, like she hadn't even thought about it.  We interviewed 5 people (including A) and we had a candidate (Z) who already had X's job in another context and who was super prepared to discuss issues in our organization.\n\nSo Z got the job - and A was beyond pissed.  She and I have mended our relationship (I'm her supervisor) but it's been 5 1/2 years now and she'll still go off on it sometimes - including recently in a face-to-face with our big boss.  The boss was unimpressed and mentioned A's lack of professionalism to me.  \n\nThe job is about to open up again (Z is retiring) and I worry that A, through her own actions, has already cratered her second chance to get that job.",
            "I would suggest having one, and only one, heart to heart conversation with Tina. “Tina, I understand your disappointment but your reaction is going to hurt your career in the long run. This guy is a talented person and he’ll be promoted in a short time. You want to position yourself to take his place. Please, set your feelings aside and learn from him. Focus on being a team player and continuing to develop your skills.”\n\nThen step aside. She’ll either take your advice or she won’t, but you’ll have done all you’re able to do.",
            "I would have honestly suggested she start looking for a new job (did not read previous post so forgive me if I'm missing something). She's not happy, she feels her work betrayed her and it doesn't look like she's doing herself any favors there. Is applying for a new job possible for her while she continues working there until she gets hired somewhere else?",
            "Thats a tough situation and I think it’s really lovely that you’re thinking about her future but I also don’t think it’s yours to singlehandedly fix. You can have a conversation with her and tell her strongly but empathetically that she’s going too far if you so choose - just something brief, simple, and doesn’t go into the territory of “the other staff and i have been talking” so she doesnt feel isolated. After that, its HR’s problem - chances are, when she realizes her job is at risk, she’ll either get frustrated and leave for somewhere else or she’ll decide its not worth it and quietly simmer. If she does neither and blows herself up, then that’s on her and nobody else.",
            "There’s not a ton you can do at this point. Have a conversation with Tina about it, and if she doesn’t change, then it will be what it will be.",
            "Looks like they picked the right candidate and dodged a huge bullet at the same time.",
            "I eagerly await part 3 where new guy and Tina start their affair.",
            "A few years ago I applied to become the head of my faculty (I'm a high school teacher). I had done the job before, was highly educated, and had the support of my colleagues. I never received an interview and they hired someone external from the school.\n\nWhile I was miffed I didn't get the role, that had nothing to do with the new guy. I made an effort to help him transition and actively shut down gossip about him.\n\nHe turned out to be an unpleasant fellow and began a whisper campaign against me and some other teachers. He made a series of complaints against me to the principal which I was able to show were baseless. I bowed out of it, and eventually requested to work in a different faculty to avoid any unpleasantness.\n\nHe resigned suddenly at the end of the year and I was asked to take over. My principal, understandably, doesn't like having to admit he made a mistake, but he recognised that the wrong person had been employed.\n\nTina is doing the absolute opposite of what I would recommend. What does she gain by undermining him? If he's good at the role, she appears bitter. If he's bad at the role, she's not trying to improve things.\n\nThere is no way for her to benefit by doing what she's doing. If she can't bare to work with him, then she should transfer sideways. Otherwise she's going to sabotage her career.",
            "You said Tina has battled all her life, poverty, racism, sexism, health issues, so she views what happened as just another example of being put down.   Tina basically has one great skill and it's tenacity, and it's her go to weapon, so then only thing she knows how to do when things don't go her way is to fight.    Her whole life people have been putting her down and telling her she can't succeed, and she's proven the critics wrong every time, so she's thinking this is no different.   Except Tina is very confused.  \n\nAll those times she was told she couldn't succeed it was bystanders telling her that she couldn't succeed.  This time was different, in this case she was in a one on one competition and she got knocked out.    Nobody said she couldn't succeed, in fact everyone probably thought she would succeed, but she ran into someone smarter, better educated, and more connected, **BOOM** knocked out.  It happens.  \n\nThe new guy just re-wrote the rules for the job she wanted.   Unfortunately Tina can't recognize that the rules have just been re-written, either because she is convinced that it's just another case of discrimination, or because she's not smart enough, or educated enough to recognize the change, and it's probably both which makes this even harder to address because each problem has a very different approach for being solved.      She won't be able to recognize the rules have been re-written until she can admit that she wasn't denied the job because of discrimination.    \n\nOP, as her friend you need to get the thought of discrimination out of her head, but be warned, fighting is her go to weapon so she's probably not going to be willing to give up her best skill without a fight.  Which means she'll probably end her friendship with you before she gives up her strongly held belief.     \n\nWhen you speak with her you need to let her know that she was the best of the other people interviewed, but this guy was on a different level.    If the interview was a dance competition everyone else came in a did well known dance, and when it was the new guy's turn it was like when Michael Jackson moonwalked for the first time,  it blew everyone's mind and automatically re-wrote the dace rules and raised the bar for everyone.    Don't tell her that she's annoying everyone because she'll just see that as more proof that she's right.   You need to let her know that it's obvious that she's not adapting to the new rules, and just like any job when the rules change the people who can't adapt will be left behind.    \n\nMake no mistake it's going to be really hard to help, and there is a strong possibility that she'll shoot the messenger, you.  So you need to be prepared to have the friendship end.    Honestly this probably isn't going to end well for Tina, even if you do confront her.   \n\nAnother approach is that you don't confront her and let it play out, because if she does get fired she's going to need a friend, and maybe the best value you can add is being her friend after it all falls apart.   Having her lfie fall apart an not having many friends will put her in even a worse situation.     \n\nA third approach is to take her side and agree with her, and tell her it's time to start looking for another job because it's clear they are against her, and her staying just means that at some point they will get rid of her because they don't want the person who is right sticking around to say \"I told you so.\"  This way Tina knows she needs to behave until she finds another job.",
            "Tina is proving that she wasn’t the right person for the job by the way she is acting and it’s obviously not going unnoticed. She’s ruining her chances for future opportunities. I would be cautious at getting too involved. You don’t want to be lumped into a category with her because you are her friend. I’ve seen that happen in my own company where one person’s bad behavior gets applied to those around them-guilty by association. Good of you to be a caring friend, OP, but proceed with caution keeping your professional best interests as your priority.",
            "I work in law enforcement. One of the biggest factors in getting promoted is how you reacted when you didn’t get picked. Sometimes they won’t pick a person just to see this. A person who behaves the way your friend is would be done. A person who keeps a good attitude and works toward their goals will get promoted.",
            "Your friend Tina REALLY needs to improve herself. And it sounds like she has so much to improve on. It was definitely the right decision for them to not choose her even based on her actions alone after this whole thing.\n\n>She was confident that she was going to win - she had more experience with the company vs. his experience & education.  \n\nThis just sounds utterly ridiculous. Seriously. What day and age does Tina think she lives in?? Just because you have more experience doesn't mean you automatically beat someone who has less. Jeez.",
            "Everyone else has already given great advice but I also want to say, I would be careful to make sure everyone else at works knows that you don't feel the same way that Tina does. Tina's basically a sinking ship at this point, she's heading straight for a firing, and you don't want to get dragged out with her just because you're worried and trying to be her friend. It mostly sounds like you aren't doing it but just be careful that you don't get dragged too far into this.",
            "I cannot believe a grown ass woman is pouting like a child at work. She needs to grow up, act professionally, or will get fired.",
            "He brought in budget models before starting?  I wonder where those came from...",
            "This guy sounds like the chosen one who will lead us from the darkness",
            "Tina is going to get fired if she continues with the bad attitude. People will complain about her. \n\nThat being said if i worked somewhere and they 'hyped' a new hire. It would be annoying. Its just the new guy. Also if they hyped his MBA from an ivy league school I would be even more annoyed. I don't care about that stuff. Smart people just care if they can produce. So I can get why people would be annoyed. However, people seem to like him. \n\nI don't know what you can do. If someone is so angry and bitter they self destruct its on them. If it was me and i got passed over even if the other person was more deserving, I would look for a new job because there is no point in staying. However, I would keep my mouth shut until I got the new job because I don't want to get fired. I have had shitty bosses where I had to keep my mouth shut about hating them out of fear of being fired. \n\nI dont know if you can do anything for her, but if she is going to attack a new manager that everyone likes, complaints will make it up the chain and they will get rid of her.",
            "Management watches how people take criticism and rejection. If she’s not handling this well, she’s likely ruining her chances for any advancement in the future.",
            "I would fucking hate to be in Tina’s shoes right now. She got turned down for her dream job, which sucks, and everyone looooooves the new guy because he’s genuinely awesome. She’s behaving badly, and she might even know it, because literally this guy’s existence rubs it in her face how she wasn’t good enough. On top of feeling like a failure, she doesn’t have anyone in her corner rooting for her. Yeah, she’s totally acting like an asshole right now, and she’s alienating the support she probably desperately needs. Lots of people in this thread have pointed out that she’s digging her own grave. \n\nBut she’s not being “silly.” She’s fucking crushed. A lot of people would quit if they were in her shoes, after suffering a disappointment like that. Sometimes cutting your losses and moving on is the healthiest option. It can be hard to let go of a grudge when it’s in your damn face everyday.\n\nSo who are you to her? Who is she to you? Can you grab the damn shovel out of her hands, and tell her you love her? Can you summon compassion for where she’s at? Or do you think she’s just being silly and should be over it already? \n\nBecause if it’s the latter, keep out of it. Don’t bring your judgement to her doorstep. If the former, then it’s a lot less about what you say- and a lot more about how you listen to her. Take her for dinner or a walk, and ask her, really ask her how she’s handling the new guy being at work. Then shut up and listen. Empathize. If she can’t let her anger go, maybe suggest she grieve and move on. And if she doesn’t handle it well, then... welp. You can’t control her fate.",
            "You need to sit her down and tell her that not only is her behavior a bit much for you and your peers to keep hearing, but it will actively prevent her from ever getting promoted. It sucks to get passed over, but openly bemoaning other people's success doesn't make her good leadership material and runs the risk of getting her fired. She should take the time she has with him as a superior to learn the skills and knowledge that made him the better candidate so that she can use that to her advantage when he leaves this position. If you're good friends with her and not just her colleague or work friend, it's your job to hold her accountable to uncomfortable truths and not feed into the \"woe is me\" mentality of getting passed up professionally. Let her know that you're telling her all of this because the alternative is someone going to HR instead and getting her blacklisted for promotions or, worse, fired. This dude's qualifications aren't a subtraction of her own and no one (probably) is viewing it that way.",
            "Thanks for this update, I was curious about what happened afterwards. 🙏🏻",
            "If you are a good friend and can talk candidly to her without risking your job, i'd take her out somewhere private and talk about it. You might need to be blunt with her to give her the wake up call. Don't sugar coat it.   She might need some therapy to help deal with it but she needs to realize that if she can't get 100% in line with the new team she should probably quit instead of getting fired since that is where it will lead too.  She obviously felt owed that spot and that it was a done deal. She needs to get over it, accept it and not hold any of that against this guy.  I'd suggest she try and take this opportunity to learn from him since he is the new hot thing. If she can learn his style and what makes him so great and successful she can use that knowledge on top of hers to become a bigger asset to the company or to another company.",
            "I'd be a little bitter about it too but this lady needs to learn to put on her game face at work and be positive and productive. I worked in a very unfair situation for a long time and I just told myself that putting on a smile and working hard was for my own benefit. I moped when I got home lol",
            "If i was her, i would look for employment somewhere else. She being resentful, acti g as you say makes her look bad.... unprofessional maybe, she is just acting aweful.\n\nMy advice to her..... move on, when you change employers you will get a bump in pay and probably can find something more interesting. \n\nThat would of been my advice to her long ago... jump ship, companies always like to include an inside candidate (for HR cover their ass reasons) but they probably always intended to hire from outside the organization.....\n\nEmployment is tight now, jumping ship would reap a larger paycheck a d probably the change of scene will do her good....\n\nCompanies are no longer loyal to the employees \n  Why should we be loyal to them",
            "Honestly you might just have to give it to her hard. Say “You are clearly very qualified for this position however sometimes there’s just someone who fits the position a little bit better. This position was extremely competitive and says nothing about your worth that you didn’t get it. Sometimes you don’t always get what you want and it’s important that you learn that because honestly it’s pretty irritating hearing you complain all the time. This isn’t the only opportunity in the world so you can’t act like this just because you didn’t get something you wanted.”",
            "Well I counseled that she should position herself as the wiz kids’s successor- to play the long game. \n\nThe demonstrated total incapability to see her potential position or immediate consequences is a sign of fundamental immaturity and why she would have been a failure and probably has peaked. \n\nTina’s a child-perhaps a bright one- but a child nevertheless. \n\nMy guess is she sabotaging herself to lay grounds for an EEO legal action and she will expect you to be her key witness: you need to tell her NOW that you are no longer a member of Team Tina...maybe that will wake her up (at the very least you’ll have protected yourself.",
            "I feel really bad for Tina but what she needs to hear is knock it off. I wouldn’t feel good either if some Ivy League golden boy snagged my promotion but I’d keep my head up. Some other people have said that he’ll mostly likely move on to bigger and better things and I’m sure he will. When he’s gone eventually then Tina can get his position, but I bet she’ll only get it if she shows how SHE is able to adapt and how SHE puts in her best effort into the job with a level head. Don’t be afraid to kick her butt into gear, it’s for the best. However, if you try to help Tina only to find she wants nothing other than to dig herself a pit of despair, there’s nothing you can do. You can’t help someone unless they want to help themselves.",
            "I’ve been in a similar situation albeit lower stakes. Tell her as nice as you can to suck it up and basically channel her dislike of him into her work. Be polite and wait for him to fuck up or move on. It sucks ass but being salty is only going to hurt her.",
            "By her acting this way, she's only proving to her superiors that they made the right choice in not choosing her for the role. She's also showing them she's not going to be the right fit for any other role the next time she tries to get a promotion or change departments.",
            "Tell her the truth\n\nHe's great but will be moved up fast so she can apply for his job next time round but not if she pisses people off.\n\nTell her she'll ruin her career progression at this company if she doesn't change her attitude as everyone has noticed.\n\n\nHonestly this guy sound a great I wish he was my boss !!! \n\nYou're going to have to be blunt for the sake of your friends career. She doesn't want to settle into this new attitude because she's bitter. Either she needs to quieten down and get on with work or leave the company if she doesn't feel valued.",
            "I don't know why people are saying this is hard. It's not. I have some people recoil with resentment and I have seen people try to make it as hard as possible, and I have seen people rally behind. But then there are people who will soak up everything the person does and capitalize on it. That's hunger. That's drive. \n\n&#x200B;\n\nAnyway, you don't have to say anything if you don't want to, it's really her boss's call.",
            "I empathize a lot with Tina's bitterness-- this super privileged dude walks in and wins everything she wanted, and even does a much better job than she could have done, because of the benefit of his education and connections.  His success on the team is due in large part to relationships he has with senior leadership that she doesn't: she worked her ass off for her presentation, but he wins AND outperforms her for reasons outside of her control.\n\nThat said, she needs to figure out where she really wants to go from here.  As everyone else has said, this is a professional situation and she can't afford to sit around being bitter-- she's a single mom and if she tanks her career doing this it will haunt her for many years to come.  \n\nThat's the real challenge here:  not that she needs to \"get over it\", but that she needs a new goal in order to figure out what specifically to do in the course of getting over it.\n\nAs her friend, can you sit her down and talk through it with her?  Like this:\n\n1)  Validate the struggle and how frustrating it feels for her\n\n2)  Work out with her where she wants to go from here.  Does she want to shoot for the job after he moves on?  Does she want to take this opportunity to make a lateral or diagonal jump to another organization?  Does she want to take advantage of this guy's leverage to try to get some more single-mom benefits like flex time?\n\n3)  Once she actually realizes what her new dream is, then it's just a matter of how to get her there:\n\na - if she wants to take the role when he moves on, it's time for the two of them to sit down.  She can transparently say that she was disappointed when he got the role, but wants to build the future of the team with him.  You know how Littlefinger in GoT says \"Chaos is a Ladder\"?  Often in circumstances like this, Awkwardness is a ladder:  she can turn the very fact that they have awkwardness between them into an opportunity to make him her biggest champion, and her promotion changes go up drastically if he's the one advocating for her.\n\nb - If she wants to take a lateral move, it may be an ideal time to apply elsewhere-- her bosses and HR are likely to breathe a sigh of relief and give her a fantastic recommendation to go elsewhere.  Never underestimate the power of other people feeling guilty they didn't promote you.\n\nc - If she wants benefits, well, few managers seem to have the clout this guy does.  Turn that same awkward conversation into \"I know I was an ass but I needed some time, let's make peace and also can you help me out\".\n\nThe ball is in her court:  She's senior, she needs to act like a manger and take control.",
            "You don't do anything, expect from telling her that you feel uncomfortable with her attitude, please to stop. If she doesn't listen to you, HR is your next stop. \n\nBut I suspect the new guy knows what's going on and is just being gracious and letting your friend cool down.  It's his job to manage her tho,  so don't try to fix the situation. It's not your problem.",
            "Can you please give us an update if something else happens? :)",
            "Ask yourself if you think speaking to her would do any good. You know her better than any of us. If the answer is no, let HR handle it.",
            "Would like an update to this update.",
            "Does anyone wonder if the people in these posts ever get on Reddit, and are like, \"oh shit, this post is me. I AM Tina.\"  \n\nSome scenarios are so obvious and specific, even if Karen's name was changed to Tina.  \n\nI'm always curious behind the scenes. Someone tell me it's happened before?!",
            "\\*Popcorn eating Michael Jackson intensifies\\* \n\nLordy, I can't wait for the next instalment! \n\nAnyway, nothing you can do. Tina chose her reality and you can't shake that. In situations like this there are 3 questions to ask: Did you do it? Is it your responsibility? Can you do anything about it? Here the obvious 3 answers are: no, no, no. So sit back and enjoy Tina either growing up or getting the sack.",
            "I have seen this happen and the eventual result is that Tina will be fired. She better get with the new reality now before she is shown the door and embrace being 100% team member. Be brutally honest.",
            "Had this exact thing happen at my job. In my story, 'Tina' eventually was fired for being consistently rude, and even verbally abusive to her co workers. You are not doing her any favors by avoiding this. Help her to grow, or watch her crash.",
            "Uh. This is very much not your problem. \n\nThat said, it would be very good of you to try to intervene. I would hate for a single mom to lose her livelihood because she's bitter and lashing out. \n\nI would talk to her outside of work. Someplace she can be vulnerable. She honestly sounds like she needs to vent a lot to get it out of her system (at least, I hope that that's all it takes). But after she gets her vent time, and some tears maybe, she needs to rejoin reality, where she is a great person and a good worker, but she isn't the protagonist of a grand story, and other people sometimes are legitimately better than her, and that's **ok and not a negative reflection of her**. \n\nShe's been through a lot. She has earned a lot. She needs to remember that, remember what she's fought for, and not throw it away out of jealousy. Yeah, it's probably not fair, this guy probably had many more opportunities in his life than she did. That sucks. It's also not something that your firm is going to go back and time and fix. \n\nCount her blessings where she is. Let go of bitterness. Focus on her own work. Find **joy** again. That's what she needs to work towards, not trying to tear someone else down (even if he were doing a bad job, which apparently he isn't). \n\nAnd once you try, seriously, distance yourself if she continues. This is not your battle to fight, do not entangle yourself with these caustic office politics.",
            "Jealousy is a green eyed monster. Sorry but I recommend you keep yourself from her at a socially acceptable distance. She is slowly destroying her career.\n\nOr you can tell her the truth gently. She can learn from him. If she wants to advance her career, she can do a MBA.",
            "Remind her that leaders encourage their colleagues. Her not getting the promotion does not speak to her ability, just that there was a more fitting option for the time. If she wants to be considered for the position when he moves up, she needs to wipe the slate clean of her childish grudge. No one will respect her in that position if she is promoted next time if she continues to demean this guys efforts, when clearly she is the only one that's not impressed. \n\nAssure her that you support her and understand her position on the matter, but she needs some tough love on this for sure. She may be upset at first, but if she's a true friend she will understand. Good luck!",
            "She should be glad that he turned out to be so good. It shows that she wasn't passed over or disregarded. She should be proud that she was in the running with someone like that, and then start laying the groundwork NOW for her next move up in the company when he leaves. \n\nShe should be sticking close to him, learning from him, and positioning herself to be seen in the same light as him. \n\nIs it hard? Sure. But some people see someone better at something than them and feel discouraged. Others feel inspired. \n\nBut I think even if she turns it around tomorrow, the damage has been done. Too many people have noticed already, and that's all anyone is going to remember about her. \n\nBut I think she's committed to burning out, and displaying some learned helplessness with letting this take her down. I also think that you don't have to be involved in any way. But it's hard to watch.",
            "When things like this happen, what becomes more important is how Tina acts after being passed up. If ivy league hero gets promoted, then Tina like you said is logically next. She's going to have to work with him and uphold his previous work. If she is being \"that person\", she's going to make them think she's incapable for the position. Remember, it's not cause she wasn't worthy, but it's cause they had someone else better by far. As I've heard bosses say before, your interview already started for every possible position in the company the moment you walked in the door. She's only hurting herself",
            "Convince Tina that it will be easier for her to help get the new guy promoted than it will be to get him fired. Both scenarios open up the job for her to take another shot, and a successful incumbent usually has a good deal of input on who gets to take over for them.",
            "You already made it clear in your first post. This guy is leaps ahead of the competition, it would be stupid for your company to choose anyone other than him. Tina did a good presentation, that's it just good nothing amazing. There are so many good candidates out there but only the best candidate wins. Its ok to feel upset but if you behave like a sore loser, that is unprofessional and people get tired of you. Its happening to Tina.\n\nRight now its good that you are objective and can see the new guy for who he is. I think at this point your friendship with Tina is not the main concern, its how people see you as well because you are her friend. Multiple people have came up to you to voice their displeasure because they know you are her friend. I think you need to be firm with her on how childish her behaviour is and if she cannot accept rejection, she can't lead a team. You also need to start distancing yourself from her if she does not change, people are going to associate you with her and you don't want that. Especially if you don't even share her line of thought.",
            "Well, if she cant handle working under him she should quit. Seeing him at what would've been her job everyday is not gonna be gentle on her, so if she can't make the mental switch then it's best for her to leave.",
            "Can he come help my company? We are switching things for the worse too often.  We need someone like him!",
            "I hate to say it but your friend is sounding pretty toxic.  If she could only get past herself, she could have a bright future.  But right now she is her own hindrance.\n\nAs her friend, I think you should say something.  Try showing her different perspectives of What his presence could mean for her. and also give her a heads up of her own behavior.  She can be mad all she wants, but that won't change reality.  And if she doesn't watch herself she could end up shooting herself in the foot.",
            "Unfortunately I don’t think Tina will be in her current position for long.. I hope she is interviewing at other companies because she shot herself in the foot. She likely doesn’t have a future at your company anymore.",
            "\\>  I know of a least a few people who are growing weary of this and two  have asked me to say something to Tina (since we're friends). Another  threatened to go to HR.\n\nThen you need to tell her that other coworkers have voiced their concerned and she needs check her attitude before things escalate. She doesn't have to like the guy, but she needs to remain professional. She shouldn't shoot herself in the foot and potentially risk her job because she didn't get the promotion. \n\nTell her to keep any venting about the new guy off the clock, and at least try to give him a chance. It wasn't his \"fault\" she didn't get it. It's no ones. Like you said, plenty of other well suited candidates didn't either but you don't see them acting out about it. And while he may be privileged, you yourself said he clearly has put the work in to earn that success and is a likeable guy. So in the long run he would be a good ally to have for when she *does* eventually move up in the company.",
            "I would just be honest in a loving way, friendship is tough love sometimes and Tina needs to hear that she's being stupid and making herself look stupid and because of it people are starting to dislike her.",
            "Well. This is a very difficult situation you are in. It sounds like Tina has some insecurities that she needs to work out. By the sounds of it, new guy was the right one for the job and blew Tina out of the water and she is not only devestated about it but is insecure as hell. If Tina was one of my friends I would feel the need to get her in a private setting and openly ask her \"Can I be absolutely blunt with you?\". Then give her a much needed dose of reality that she so desperately needs. Ask her questions like \"What is the end result you are hoping for by acting the way you are?\" Tell her your concerns if she keeps on this track. If she rejects your advice and then gets mad at you, so be it. She's a big girl and she will be accountable for her actions. Good luck.",
            "That company is already a part of Tina's past.\n\nIt's a tough break but it's her personality that's really driving things to a bad place. She should update her CV and start looking.\n\nShe's also going to have to do some introspection in future. It's very immature of her to allow disappointment to ruin things for her this way.\n\nA professional adult would have done this in the tine she took off and cone back with a 'could be worse, make this work' attitude.\n\nShe's come back with the opposite.",
            "There's an element here of, you don't want to tie yourself too closely to Tina either because (i) she will get fired if she keeps this up or (ii) you'll be perceived to have the same issues she does if she is really loud about her unhappiness and everyone knows you guys to hang out a lot.\n\n&#x200B;\n\nThat said, I think you only \"owe\" her one conversation letting her know that while its normal to be upset, what's happening is that people will start to get fed up and/or gossip about her and it will hurt her more than if she just faked it long enough to change jobs or long enough for the new guy to move on up as he inevitably will.\n\n&#x200B;\n\nShe probably knows but if you want to show friendship, definitely worth mentioning outside of work.",
            "It’s a pride wound. I would encourage her to make the best out of the situation so she doesn’t burn bridges and “play the game” but to look for a new job. Put feelers out there. And if she says she can’t or she’s too busy then just shrug and say then you’re stuck here and people are talking shit, so even if it sucks, keep it to herself.",
            "So I think it’s actually MOST important that you say something and has the most potential to help your friend grow. I’m a (white) woman from a blue collar background working towards operations management in the very male-dominated field of manufacturing. My heart aches for this situation because it’s one I’ve been in plenty myself - feeling like I’m working twice as hard, forcing myself to ask for more, and being overlooked because it’s not as comfortable as the norm or being criticized more harshly than my male counterpart. It. Fucking. Blows. And many times yeah it is because of social constructs, but sometimes it’s not and it’s realllly hard to know the difference (if you even can) and get exactly the perspective you’re offering here, especially when you’re so hurt. \n\nWhich is where you come in. If one of my male friends would ask me questions about what MORE I could have done in those situations, or offered alternatives, I would usually bite their heads off. They don’t know what it’s like being a minority in the field and as good-willed as their statements are I was insulted by their suggestions that I wasn’t doing enough, especially when their suggestions were things I had tried three steps back and didn’t work. So I have a mentor that I go to. My mom’s boss is a long-time family friend, a badass manager with three badass daughters making their way in their own male-dominated fields, and I trust her opinion on these matters more than my own. She’s in a place I would like to be, but she’ll also call me out on my shit if I’m hung up on the unfairness of things. A lot of times it’s like “ok yeah this shit happened and it suuuuucks. What are you gonna do about it?” \n\nI don’t know if you’re comfortable mentoring your friend, but it sounds like you have a little more perspective and would be at least a reasonable ear. It might be a shock and hurtful for her to hear “actually I kinda wanna work for him...” but it might be the shock that shows her she’s being a bit harsh and reevaluate her approach. Alternatively, if you want to be there just as her friend I would recommend helping her find a mentor she could turn to that IS in a place where she wants to be so she can field these situations as they come up.",
            "She needs to look elsewhere for the job she wanted.",
            "I just took a course in being a people manager during change. Look up the Change Cycle Model. She's in a classic phase 2 spot, and it's extra bitter because she was turned down for this opportunity. It's honestly not your job to handle it, but you can support her as a friend with a listening ear and reassurance she's capable of her job.",
            "You don't wanna be grouped with someone like Tina who's being silly in the workplace.\n\nId have a hard and fast discussion over the phone  so you don't feel too intimidated. Otherwise, Distance yourself completely.",
            "I’ve been in a similar situation at work. The worst part was having to train the person who came in to do the job. I was the only one who “lost” something and people around me were excited to have a new passionate boss. It’s a very lonely place to be and sometimes I knew I was venting to the wrong people when I was frustrated. It actually didn’t help when my friends told me I should’ve gotten the job. \n\nThe truth is management (and a lot of the people who now work for the new boss) see her as a liability regardless of her expressed disappointment. They don’t want someone who was around before the changes trying to validate the old way of doing things (the one she was so proficient at doing). Advise her to pull her resume together and take steps to find a better work environment for her. She may need professional and personal counseling. Not from her current HR either. They just want gauge how big of a problem she is to the company. \n\nYou sound like a really good friend and person. This can happen to a lot of workers who try to advance and work hard. Especially as they get older. Life isn’t always fair. What makes it wonderful, in spite of everything, are those truly kind people you meet along the way.",
            "I don't believe this is real",
            "Has Tina never been rejected for a job before? My god. Maybe she's doing herself a favour by acting like such a child - being a boss is full of trade offs and disappointments, and if she can't handle them, then perhaps she's better off where she is.",
            "I can totally understand where Tina is coming from, especially if she's a woman of color and single parent who has worked her way up from the bottom while the new guy is a rich, probably white man coming from a world of immense privilege. It hits hard to be treated like a second class citizen all the time, and I'm sure Tina has had it up to here with being passed up for guys like him - regardless of what a good job he's doing, it feels to her like just another case of her race and gender disqualifying her from a position she is qualified for, which I'm sure she's experienced a lot.\n\nI would talk to her gently as you can about the subject and just let her know that she needs to be less obvious about her feelings about this guy and missing out on the position while she's at work or her job might be in danger. Maybe offer that she can call you after work and rant at you if you're willing, so she can vent without endangering her job. It sucks that she has to deal with that and I'm glad she has a friend who at least is trying to understand where she's coming from, and I hope you can help her keep her job.",
            "You've probably done all you can. Tina can either graciously accept that the company went with a better suited candidate and even if she was passed by she has the choice to accept and embrace the change or not.  If she wants to be looked at for when this guy moves up because he sounds like a high performer then she needs to bring her A game to the table.\n\nForward moving, being a team player and not self sabotaging will get her noticed on down the road if this guy really is doing so well that perhaps his position will become open to her in the future.  She could look into classes, certifications or actions which may sweeten the deal on her appearing to be a good candidate or she can sit there and whine and complain.  It's all her call.  Only Tina can save Tina.",
            "Pull her aside and tell her that she needs to accept this new guy as the boss or at least pretend to. That her attitude towards everything has been negative lately and people are seeing it. Tell her that you're telling her as her friend, that you don't want to see her lose her job. Encourage her to look for another job if she's unhappy. Don't let other people go to HR and watch her go down without warning her. If it was my friend I would tell her that ever since she didn't get promoted she hasn't been enjoyable to be around and that you miss the old her.",
            "Office politics are difficult and the people who know how to play are often the ones who go furthest. That being said, don’t let Tina bring down your promotability by your association with her. I’ve seen it happen because the higher ups often believe their staff is who they associate with. When you’re friends with someone who is bitter and toxic they begin to believe that is your attitude as well. Personal example: I was friends with a girl who became known for being a snitch (telling on others for rules infractions and such) so people thought I was also one because I was friends with her on a personal level. Took me forever to shake that reputation.",
            "One of the best ways to deal with change you're against is \"disagree and commit\". If you don't like a change in policy or personnel you can complain, make your case, whine as much as you want before it happens. BUT as soon as that change comes into effect you hit the ground running, working your ass off to support and work with the new policy or person. That is how you show that you're a team player. That is how you become memorable for all the right reasons and how you don't get passed over for the next promotion that comes along. \n\nYour friend had her chance to disagree, but she's fucking up royally being pissy about it after it's happened. For your sake, I would distance yourself from her and her behaviour as much as possible, so you don't get tarred with the same brush. Let HR deal with it.",
            "Let HR handle out.  No good will come out of you getting involved.",
            "Tina needs a reality check. But her ego has already been hurt so you’d need to give her a compliment sandwich. Start off with some good things about her and then get in to it, end with a positive note too.\n\nShe’s also missing the fact that if she’s nice to this guy, he could also recommend her for promotions within the company. You also never know who he might know. What if she applies for a role at a different company and the manager knows this dude and they end up calling him for an informal reference?",
            "“I understand you’re frustrated and even feeling a little betrayed, but one of the things they’re going to look for in [new guy]’s successor will be flexibility and openness to change. It seems like the rest of the team and the VPs are all behind him and his style. They may look like sheep, but it looks like he IS making positive changes. If you disagree, maybe try respectfully bringing up specific grievances with him. He may be interested in your perspective.”\n\nEmpathize. Rationalize. Empower.",
            "Dr. Dennis Hess I wrote a great book on leadership and how to face obstacles like these, you may be interested to read it.",
            "Definitely talk to her and tell her she’s going to be fired if she doesn’t quit her petty resentment and get over herself. She’s had time to adjust to reality and the fact that she’s still pulling this bullshit says a lot about her true character. Thank god she didn’t get the promotion and it went to an actual adult. I’d also ask her what her kids would think of her if they saw how she was handling this.",
            "It seems to me that this guy is quite open in his thinking and people minded. Would you be able to go to him to discuss the situation? I get the idea from your description he would be able to understand what and why she's acting out and might be have a solution that you are not in a position to implement and might help her in the future to be in a better position to take the role when he does move up.",
            "Who is asking you to speak to her? Why do you need to handle it at all? It's not up to you. You're all adults, it's a professional environment, the situation can play out as it will, and everyone can learn from it - including Tina.",
            "I would suggest letting her know what people are saying. She could very well lose her job when really the best thing to do is just be patient and wait for his inevitable promotion.",
            "I would love like a year update on if this dude is exactly what you all think he is. If he really cares or if he is just doing what he needs to to get where he needs to go.",
            "Sorry if this opinion has already been voiced.\nYou're not in a position where you can effectively challenge or change Tina's behaviour. The best thing you can do to help her out seems to be to make sure that HR handles this and that the case is presented to them in a way that's not all too unfavourable towards her. If a colleague is already on the way to tell HR then encourage them to do so quickly so they can intervene and hopefully help and support her before she does something really stupid.\nAnd it's not your responsibility to tell her, especially when the message is \"get over it and act professionally\". That's not a good message to hear from a friend but rather a boss or HR.",
            "If I was Tina, I'd start looking for another job instead of complaining. She should channel that energy into something tangible.",
            "The survival rate for everyone eventually drops to zero.",
            "It's unfortunate, but the problem here is Tina. IMO, it's pretty clear at present that the company made the right decision.\n\nIf she doesn't correct her attitude, she's probably not going to be around much longer.",
            "\"Tina I know that you ware more than qualified for this job, but sometimes an outsider, particularly someone charismatic, can pull of changes that long-timers can't and maybe that's why they went for him. If  you are right in the negative things you say, then you will be just as right if they let him go. You've made your position clear and that's enough.  But this isn't about him. Your resentfulness is showing too much and that's going to kill your career here and make people not want to hype you for this or other jobs.  One way or another, this guy is going to be moving on and you are going to be stuck or worse if you keep complaining and interfering.\"\n\n&#x200B;\n\nAs an aside, I've seen multiple people get fired or lose momentum in their careers after reacting badly to not getting a promotion. There may in fact be studies on it that you can show her.",
            "Sounds like we all dislike Tina!",
            "Frankly, forget Tina. Take this guy as your mentor and do everything you can to learn from him. People this \"with it\" don't come along very often. They are *so* rare, honestly. Do everything you can to learn about why he makes those decisions, and what his thought process is that keeps him focused on the important stuff (and how to tell what's important.) Seriously, you could learn more from this guy than you did in college. If you can keep up, people like this can make your career. \n\nTina will either get a clue or she won't. If she's truly incapable of letting go of grudges and injuries, then her career has probably maxed out. (That said, there's so much good advice in the comments here!)",
            "You can be honest about the negative effect she's having on others. This is the equivalent of letting someone know when they have something stuck in their teeth - information that's not fun to hear but that a reasonable person would be grateful for\n\n\n\"Tina, other people are starting to approach me about your attitude. It sucks that you didn't get this promotion, but the way you're handling it is getting negative attention from the other people we work with\"",
            "This is not your problem. \n\nIf you are feeling gracious, maybe tell Tina that you understand she is still having trouble with this new management, but people are noticing her mood. Leave it at that.",
            "I mean technically they can’t fire her for complaining / being annoying but yes people with bad attitudes who are spreading toxicity become a moving target for getting canned. The company will find a reason. \n\nI had the EXACT same type of co worker last year . We merged with another company and I saw her begin to unravel. She couldn’t handle the change and it was bad. Every day I walked in the office, she would be spewing toxic venom bad mouthing our current team or the team we were merging with. It was soooo bad. \n\nBut it was hard to call her out. She was really negative and mean and stubborn (she walked out on HR one time) and I felt if I stood up to her , she would turn on me. She was super toxic and I felt toxic vibes around her. She would twist everything around and make it super negative \n\nShe finally left but her last day she became negative and toxic to me and it was the longest most annoying day ever that I couldn’t wait for it to be over .... \n\nTread carefully.\n\nI would honestly take her to lunch and tell her you value her so much and to not beat herself up and maybe suggest her staying there and building her skills and keeping her mind open to a new opportunity if she doesn’t get what she wants there \n\nAt the end of the day maybe another opportunity could be waiting outside the company",
            "Honestly, your friendship is suffering either way, so even though it may be uncomfortable to talk with her, it can't make the situation much worse. If it's hard to talk face-to-face, write her a letter. Reiterate what r/birdmommy said, as they said it best: They're only hurting themselves in the long run, that you aren't the only person who has noticed her change in attitude, and she will be the next first choice for his position if/when he moves up, if she can keep her pouting to herself. No one wants to work with and reward the sore loser.",
            "I've been Tina, in a way. I don't do well with new leadership when they are not completely open about why they are doing the things they do. It feels like they are doing it just because they have the authority. I also don't like it when the new leadership comes in and makes suggestions or seems to step over my authority without talking to me and seeing what my reasoning for what I do is. The thing is, I know this about myself, and I try to minimize any damage by being respectful and being upfront about why I do things a certain way. It is still hard, though, at times. \n\nIt sounds like Tina is having a hard time feeling validated with her responsibilities within the company, and feels like everyone is going gaga over the new guy. If you are in a position to praise her, do it. But don't be patronizing about it. If you can arrange it, have a meet and greet between Tina and the new guy. Let her meet him and see that he is just a regular guy that happens to work there, and he has his own faults too. It will be difficult for Tina to move on until she can feel like she is a valuable member of the team again.",
            "It’s not your job to make sure Tina keeps her job. She’s a grown up ... let her do what she’s gonna do.",
            "Why is her behavior your problem? Stay out of it.",
            "Several times I've been a manager coming into a new job with an experienced team.  I'm not a superman like the new manager in the story, but I'm competent.  I'd say about half the time I end up having to fire the person who thinks they deserved my job.",
            "> she's a single mom and I don't want to see her fired for being silly.\n\nwell thats kind of you but she will be fired for being unprofessional and turning the office in a toxic environment.\n\n&#x200B;\n\nBeing a single mom shouldn't give you a free pass.",
            "Well, at least it's clear now that the hiring committee made the right choice. The guy is delivering the goods that he promised, and thank goodness - the only thing worse than Tina being passed over for the role, is Tina being passed over for the role by a candidate who's not as good as her. \n\nI don't blame Tina for being hurt. I don't blame her for taking some time off to process her feelings. But right now, she is shooting herself in the foot left, right and centre. This guy is doing good for the company. Her resentfulness isn't coming from a place of concern for the company, it's jealousy and spite and nothing else. And she's doing a *significant* amount of damage to her reputation at work as a result. \n\nIf she was complaining outside of work, then maybe you should say something next time you were hanging out. But because her behaviour is impacting her work and her relationships with her colleagues, this is for HR to handle, not you. No one should be asking you to talk to her, they should be talking to HR or her supervisor to have that conversation. \n\nYou really need to step back and wash your hands of the situation. You can't worry about her place in the company if she isn't worried for herself. Who knows? Maybe she's ready to move on to a different company where she won't have feelings of betrayal and resentment hanging over her. If she was in line for a promotion at this workplace, maybe another company would see her worth.",
            "This thread is why it's dumb to be so career focused.\n\nIt's just a fucking job.  Tell her to chill out.",
            "This isn't your problem. If others ask you to talk to her, tell them you aren't her mom/can't control her, and that's she's an adult making her own decisions. You don't want to be dragged down with her negative attitude. It is NOT your responsibility to coach or train her, and you can't change her. Just focus on your work, and on building positive relationships with others",
            "If you are her friend you can give her the ugly truth right to her face in a way she can understand. If not then maybe don't be friends with her. The whole point of having a close friend is they can tell you when you're on some bullshit because strangers and acquaintances won't. That's the line between friend and everyone else. What isn't your job is what she does with that info if she shapes up great if she doesn't great. You did the friends bit.",
            "I'll shoot it straight ! \n\n&#x200B;\n\nI am like that guy , Process driven , want performance but not at all cost , i want my staff to be happy and understood FIRST and after i expect performance. I take control and i make change happen for the greater good and not for myself.\n\nI am a natural born leader , i am a teacher. I don't step on others toes and i invite my enemies at my table always to turn them to friend. \n\nTina cannot display that , Tina would never compare to that guy. Tina should not be the next one to step into his shoes. Because at best , she would learn from him to get the job for herself and not for the greater good.\n\n&#x200B;\n\nI say let her learn from this experience. Let her complain , let her get the finality of how she behave. \n\nYou do not have to be IVY school educated to pull out what he do. You just have to know why you do it !  It should not be because you work hard , it should not be because you deserve it or even because you have the competence or experience. \n\nYou should do it for the greater good ( The synergy between your employeees need and the work that need to be accomplish ) \n\n&#x200B;\n\nWith the way Tina react , she doesnt need to be save from herself. She doesnt even recognize her colleges are happy now because she cannot see past her own self.\n\nThis kind of leader should never be in charge of people.",
            "Open communication is what is required here.",
            "Tina needs a better coworker than you.\n\nYour original post was 65 days ago. The guy took a couple of weeks to start. So he has been on the job for 2 months, at most. Yet here you are listing all the amazing things he has done etc etc. I think you are just willing to drink the koolaid because you realize the guy has connections in the company. \n\nTina sounds like an honest, hardworking individual. That quality will take her very far in the long run. \n\nI think you have a problem with Tina, you seem to have a need to put her down. Just stay away from her and work on your own character."
        ]
    },
    {
        "post_id": "adftvf",
        "author": "_frustratedthrowaway",
        "title": "[UPDATE] Girl [20s?F] who my [23F] ex [23M] cheated on me with reached out to me. Not sure how to respond.",
        "url": "https://www.reddit.com/r/relationships/comments/adftvf/update_girl_20sf_who_my_23f_ex_23m_cheated_on_me/",
        "score": 3703,
        "num_comments": 132,
        "created_utc": 1546850711.0,
        "selftext": "**TL;DR: The girl my ex cheated on me with randomly messaged me a couple months back, turns out she was pregnant! Kind of got closure, am very happy.**\n\nLink to original post: https://www.reddit.com/r/relationships/comments/9mb89u/girl_20sf_who_my_23f_ex_23m_cheated_on_me_with/\n\nHi all, my initial post didn't garner much attention, but I wanted to give a short update.\n\nI never responded back to Jessica and basically told her that while I understood she was guilty there really isn't anything she can and should do for me. Just that she has to make better decisions now and hopefully her guilt would mean she wouldn't hurt another person like that again. \n\nDuring the Holidays, my ex's dad greeted me a Merry Christmas. I was also told of the news that Jessica was 4-5 months pregnant with my ex's child. :O It lines up now, and I guess that's why she messaged me, because they found out around that time. Just wish she was really sorry lmao. \n\nAfter that my ex and I had the chance to talk. While of course I was still not ok with the fact that he cheated on me, I wouldn't wish ill on an unborn child. He has a lot of growing up to do, and is not the most financially stable person. It also turns out the girl is quite young. I told him that I wished him well despite everything. His dad told me that he still believes he can make something of himself. \n\nWhen my ex and I talked, he admitted to me that the reason he cheated was because he knew I was already going to break up with him. This is partly true because months before, I sat him down and talked to him about issues in our relationship, and I had wanted to bring his attention to the fact that things really were no longer healthy. I guess it was my prelude to an amicable break-up. He told me that there really was a better way to break things off, but that he was too scared to be alone after breaking up. So he made sure he had someone to run to when we finally broke things off. I just really wish we could have ended things better, he was my best friend. \n\nThe news shocked me, but in a way I guess I was able to get closure. I'm currently in a good and healthy relationship and starting the year with a really great outlook.  \n\nThank you all for the advice! I wish everyone had a great holiday!\n\n**EDIT:** Oh wow, I really wasn't expecting this to blow up! I thought my post was locked but glad I checked. I was sick last night and only had the chance to see it now!\n\nJust a few clarifications because a lot of people have questions. I'm sorry I wasn't too clear on the details, as I didn't want to submit such a lengthy post. I realized after re-reading my post how confusing I was! My apologies :)\n\nFirst is that yes, I did respond back to Jessica (the message I detailed in this post) ~~before~~ after (sorry I made a mistake!) the reddit post, but she responded again. I no longer messaged back after, hope that's clear.\n\nYou are all correct, based on the timeline she did get pregnant after we broke up/I discovered his cheating. What I didn't mention or was fully clear with yet is, around 4 or 5 months ago, my ex talked to me and told me that she and Jessica broke up, because they realized that they were in a relationship for the wrong reason. We talked for closure, but I realize now he was also testing the waters with me. I could be wrong tho! \n\nThere are a number of people who also question why I kept in contact with people in my ex's life, or why I even talked to him after everything. I agree that it isn't the most healthy or mature, and I call myself out on that a lot of times. It was just really hard to detach from his family, who I grew close to. When my ex's dad last talked to me, he told me that things will never change and he still loves me like a daughter. :') And while a lot of people don't agree with my last communication with my ex, I think it was helpful for both of us in the process of moving forward. I think we left the conversation clearing out that we don't have hate for each other, just wishing each other well. \n\nAlso, I have to admit that I don't have the most positive image of Jessica, and I watch myself a lot of times not to be hateful. It's hard to judge when you only have the negative things shown to you. She did a lot of hurtful things to me (outside the cheating), but in the grand scheme of things, I really don't know the full story anyway. With how the chips fell, I think all I can do now is wish them the best. \n\n2018 was a tough year. Went through a break-up, was cheated on, lost my sister, had to re-contact my ex to get things my sister used to own back (these are the things I referenced to in my initial post), and basically had to pull myself back up after all the pain and losses. \n\nBut I am glad to leave it all behind in 2018, and I am starting 2019 strong!\n\nThank you for all the positivity and warm wishes everyone! To a healthy year of growth ahead! :) ",
        "permalink": "/r/relationships/comments/adftvf/update_girl_20sf_who_my_23f_ex_23m_cheated_on_me/",
        "comments": [
            "2019 is going to be your year!",
            "Now you can cut all ties with them and move on with your life op!! 🙌🏼 Wishing you the best and I Hope you will find someone you deserve soon❤️",
            "Well, you dodged a bullet for sure.. too bad Jessica didn't, poor girl. Thanks for posting an update, and I truly hope you never have to deal with another childish man again. Hugs.",
            ">I never responded back to Jessica and basically told her...\n\nSo you responded or not? I'm glad this situation is finally over for you but I just don't get why you are interacting with any of them at all in the first place.",
            "Definitely shows he needed to mature and a keystone of that is communication. Doesn't sound like he was any good at it because if he was, you would've talked through the different feelings you were experiencing when you were in your initial rough patch. \n\nGood thing is, you already know the benefit of communication in a relationship and will learn from this experience. He will know what good communication in a relationship should look like, while becoming a 23 year old father.\n\nI'd take your path every day of the week. Good luck out there, legend!",
            "My first heartbreak was having my first real boyfriend cheat on me. And, he got her pregnant. I went from brokenhearted to relieved as hell in sixty seconds flat. Mind you, he was seventeen, so was she. I was fifteen.\n\nOnce his girlfriend had the kid, he kept calling me just to talk. I finally told him to forget my number and try to be a dad.",
            "\"It also turns out the girl is quite young\"\n\nYOU are quite young, so how young is this girl?",
            "From what you describe here, it sounds like he told you that you are responsible for his cheating.  Hmmmm....   \n\nHis honesty is not the same as keeping 100% of the responsibility for cheating in his own lane. \n\nI’m glad you’re doing better, OP.  ",
            "[deleted]",
            "I just want to point out he is disturbed for saying he cheated because you were going to break up with him. Uh no.. he cheated because he is an ass and you had nothing to do with that.\n\nAll the best, you handled it all with such grace and class. ",
            "Yea wow “I didn’t want to be alone so I took a younger female who had no knowledge of who I am and my issues and permanently joined her to my life.” \n\nHe’s fucking gross. ",
            "\\>   the reason he cheated was because he knew I was already going to break up with him. \n\nPeople cheat because they want to. They do it because they are selfish scumbags whose short term self-interest overrides whatever limited morals they do actually hold.  Him being afraid you would break up with him is simply the excuse he told himself for his behaviour.\n\n&#x200B;",
            " A quick add : your x told you he cheated because you were planning on breaking up. Despite everything, he still blamed you. Nevertheless, good you got away\n",
            "Why are you still in contact with these people?  Leave this mess in the past.",
            "[deleted]",
            "Happy that you seem to be doing ok! I feel bad for all involved - I don’t know whether his excuse of “being scared of being alone” was real, but I can imagine knowing that the person you’re with isn’t happy and is going to leave you can take a toll on you emotionally. Of course, it’s no excuse to cheat. But you guys are all young and relationships are so hard to navigate. It’s not like we take classes on how to break up amicably or when to say enough is enough. We just stumble into love and hope we don’t fuck the other person up. \n\nI wish all of you well (especially you and the girl’s baby). Life is complicated and there’s no time to hold onto hate or mistakes. I hope all involved can find fulfillment in life and that you find peace with all that happened and enjoy your new relationship! ",
            "Just wanted to say that I was recently in the same boat, my ex and I's relationship was pretty rocky and he chose to start a relationship with someone else instead of doing the right thing by breaking up with me first. It hurt at first but I was also relieved that he helped me make the decision for me - I didn't have to continue wondering whether it was worth continuing the relationship. Anyway, things are getting better for me and I hope it's the same for you!",
            "So since being alone would hurt him if and when you guys broke up he decided it was okay to hurt you instead by cheating. How did he think that could in anyway redeem him? He's a coward and he's just trying to weasel his way out of being responsible. ",
            " *I'm currently in a good and healthy relationship and starting the year with a really great outlook.* \n\n&#x200B;\n\nKeep this same energy all 2019, this whole ex situation is not your monkeys, not your circus. Thank u, next!",
            "wow.   So that kids entire existence is because your ex was too scared to be alone?\n\nWhat a shitty life that kid has in store for him.   Actually all 3 of them .",
            "\"I just really wish we could have ended things better, he was my best friend.\"\n\nThis is exactly how i felt about my ex :'(. Glad things are going well for you now! You handled this whole situation very maturely.",
            "As someone who has been in the exact same shoes as you (I’m a dude if that matters) I’m glad you were able to find the other side quicker than I did. We can’t dictate how long it takes to complete the healing process but when we move forward it shows willingness to begin that process as difficult as it may be. Ultimately it’s our own responsibility for our individual happiness and mental health and i hope you take solace in the fact that his parents have been impacted by you so much so that they side with you in this (which further shows you’re not in the wrong in any way). Best of luck and have a happy 2019. ",
            "> I sat him down and talked to him about issues in our relationship, and I had wanted to bring his attention to the fact that things really were no longer healthy. \n\nSome people might have interpreted this as an invitation to fix things instead of a breakup notice, but maybe that's just crazy talk. \n\nI wouldn't answer her back. She sounds like drama. If she ends up overwhelmed by her life, she has other resources that do not have to include you. ",
            "I find it hilarious and sad that when you tried to have a conversation with him about fixing the relationship, he decided to cheat on you rather than address the problems. What an idiot.",
            "question. \n\nIf \n\n> I never responded back to Jessica and basically told her that while I understood she was guilty there really isn't anything she can and should do for me\n\nIf you never responded back how did you basically tell her somethingg? ",
            "good that you've found an awesome relationship.  It's good that your ex did what he did so you could find your new partner. \n\none of the best things my terrible marriage got me was my new GF.  Had things not worked out they way they did I wouldn't be with my current awesome GF.  I go to bed with my arm around her and a big smile on my face. (she thinks that's super cute)",
            "You are very mature and handled such a big situation tactfully. Plenty of women would have slandered him all over social media, or destroyed his belongings, slandered the other woman, etc. But you were BEYOND the better person. Good for you. ",
            "You definitely dodged a bullet there. I went through somewhat of the same situation and got closure. I was dating a guy who went back in the military, switching from Air Force to the army and he was super stressed. We promised to marry each other and looked forward to a life together. He transferred to Alaska and I didn’t want to leave my life just yet to live there with him. I said the wrong things and we broke up. Felt like not even a month later, he was talking to some girl and got her pregnant. I found out when she was 20 weeks. He apologized and said he didn’t want me to find out and hurt me. I was already moving on and that was a big push forward. It was one hell of a closure. ",
            "I'm glad that you're in a healthy relationship. It sounds like you seriously outgrew your ex. I'm sorry that he handled things so poorly and hurt you, yet if he hadn't cheated on yo, perhaps you'd still be together. As crappy as the situation is, it sounds like he kind of did you a favor. Cheers to a wonderful life that gets better and better!",
            "\"lol, good luck\" is an acceptable response",
            "I am not a fan of the look at what you made me do defense.  He can revisionist-history his story all he wants to rationalize to himself that he's not a immature \\*\\*\\*hole, but he's an immature \\*\\*\\*hole.  You want to start a new relationship?  Fine.  Finish the first one first.  Don't cheat.\n\nHappy 2019 ",
            "Ahhh...real life.  I suppose the lesson is when you show your card be ready for all forms of response.\n\nSeems you handled yourself with dignity and maturity.  \n\nGood luck",
            "Quite the bullets you've been dodging..",
            "You know, sometimes crappy things can be the reason things grow. Like his manure is making your garden of memories even more beautiful. Yeah yeah, cliche I know, but it's better than you dodged a bullet. This will be a phenomenal year! ",
            "Hope you find the peace and strength. Though sad to hear your story, you're young and I believe you will find a friend, companion that appreciates you even in hard times and is with you rather than against you even in turmoil.",
            "[deleted]",
            "Well we face the music now and again.",
            "If it helps any, you will get to know that she was a back up. He couldn't have You, so he used her as a back up plan. ",
            "Sounds like you dodged a bullet; you should thank him for cheating on you. ",
            "Seemed like you dogded a bullet there. I'm glad you got closure and thanks for the update!",
            "You couldn't have managed it better. Hope your sailing stays smooth.",
            "Hey, at least you're not pregnant with that nutter's kid. HIGH FIVE!",
            "Oh, she will be sorry.  \nShe will have to share a child with this idiot. So I am pretty sure she is gonna get what is coming to her.",
            "Talked about leaving then surprised you got cheated on? Welcome to 2019 ",
            "You can get pregnant too if you want..",
            "Thank her for contacting you and move on!!!"
        ]
    },
    {
        "post_id": "9fxw4r",
        "author": "UnicornAshes",
        "title": "[UPDATE]: Should I (33F) tell my ex’s (28M) girlfriend that he pathetically contacted me?",
        "url": "https://www.reddit.com/r/relationships/comments/9fxw4r/update_should_i_33f_tell_my_exs_28m_girlfriend/",
        "score": 3704,
        "num_comments": 75,
        "created_utc": 1536977021.0,
        "selftext": "Link to original post: [https://www.reddit.com/r/relationships/comments/95u8md/should\\_i\\_33f\\_tell\\_my\\_exs\\_28m\\_girlfriend\\_that\\_he/](https://www.reddit.com/r/relationships/comments/95u8md/should_i_33f_tell_my_exs_28m_girlfriend_that_he/)\n\nOriginal post TL;DR - Dumped ex for cheating. His other unsuspecting girl reached out to me to tell me the details and saved me from further heartache. They’re now together and he has contacted me in an attempt to get me back. I’m not interested, but should I tell her?\n\n&#x200B;\n\nUpdate: Sorry for the delayed update for anyone that was interested, but I moved and life has been hectic. I read every comment on the original post and considered every option. A couple weeks after my ex initially contacted me via email, he sent me a text message asking if I would ever talk to him again. Like before, I didn't respond. A couple days after I moved, I messaged his gf/the previous \"other woman\" on Facebook since that was my only form of contact with her. I first asked if they were together, to which she responded \"yes\" a couple days later. In a brief conversation I told her that I felt I owed her the courtesy since she once extended the same to me. I told her he had contacted me twice in the last month and gave her the gist of his email. She said she figured that's why I was contacting her, said she really appreciated me telling her, thanked me, and said she hoped I was doing well. I told her good luck and went on my merry way. No catfighting, no unnecessary chatting. \n\nIn the end, I feel bad for her. Yeah, she made the horrible decision to get back with him but I'm sure she did hoping/thinking he had changed. He never will. Men like that don't. I was his unwitting fool for nearly 5 years, now she has that burden. I haven't heard from him since or heard anything from his family who still occasionally keep in touch as to whether she dumped him or not...my gut instinct is she didn't. Either way, my conscience is clear, a \"favor\" has been returned, and I'm still happily no longer with a cheater. Cheers folks!\n\n&#x200B;\n\nTL;DR - Contacted the gf, told her everything, she said thanks, we went our separate ways. No Jerry Springer.",
        "permalink": "/r/relationships/comments/9fxw4r/update_should_i_33f_tell_my_exs_28m_girlfriend/",
        "comments": [
            "I am glad you did that, because I would like someone to tell me if my SO was cheating on me or looking for other people to date.",
            "You did the right thing. ",
            "You did the right thing. I hear from others it's no one's business but frankly, with solid proof, I would like someone to tell me my partner is cheating. \nShe did it for you so it's good to return the courtesy.  I hope she comes around and realizes it's better to leave him and not waste anymore time on him.",
            "Happy to hear there was no hard feelings between you and the other girl. Ive been cheated on and the other woman was nasty to me. :[",
            "I remember your post! You managed this well. I hope for her sake she sees the light eventually.",
            "I had an experience like that years ago. The girl messaged me on Facebook freaking out. They'd been dating very seriously. We'd been casually sleeping together and old friends. \nI quickly calmed her down and befriended her. \nWe vented a bunch for a week. Then she decided she had to stay with him. I said cool see ya! \nShe was a self admitted drama queen. ",
            "Guys like this dont ever change. They just find new ways to add false hope with different promises. Sneakier and wiser is generally all that happens. If you're not important enough for him to value your relationship and cheat, it's not going to change when he gets caught. ",
            "[deleted]",
            "[removed]",
            "I think if all women in these kinds of situation handled it as respectfully and wisely as the two of you did, this sub would be empty. \n\nYou did great, keep being amazing. ",
            "Absolutely.  You did the right thing. If more women looked out for each other I feel like men like this wouldn’t get away with half of what they do.  Keep looking out for your sisters ladies. ❤️",
            "Yay! You did the right thing, I would have wanted to know if I was in her shoes.  Though I never understood how the 'other woman' would want to be with a man they know is not above cheating.  \n\n(TBH a small part of me wished it had turned Jerry Springer just because I like the chanting.... But thankfully glad it didn't)",
            "Not trying to be rude here, but she thought he would change for her? To him no one is special",
            "I think you 100% did the right thing and you should be proud of yourself, you’ve been through a lot, you’ve tried to help someone else out, clean conscience all the way. Karma will get his sorry ass. ",
            "You certainly did the right thing. She apparently has to be beaten over the head with the truth since your tap on the shoulder has gone unheeded. Such unnecessary pain. SMH.",
            "I actually don’t feel bad for her, she knew the type of person he is and took him back. His behavior will not push her away regardless so he’s not forced to grow as a person and move past the childish bullshit he’s pulling on women. Maybe she feels like she can change him, or that she can’t do better, but at one point she had the out and didn’t take it. It falls on her now.",
            "Wow! I’ve never read the story of someone so similar to my own. Mine was at this place, she took him back, I told her he was still trying to get back with me annnndddd she kept on dating him! And then got pregnant with his kid! They just got married and I’m sooooooooo happy I dodged that bullet.\n\nAlso, if you are like me, I hope you’re talking to a therapist and being proactive about the trust issues this can spur! ",
            "I read this as “telepathically contacted me” and was very intrigued. ",
            "We gotta look out for eachother, karma is real but it's not passive, you have to make choices to be open to good people and help them ",
            "Unrelated to the issue, but original post tldr at the beginning of an update post is the most mvp OP acts on this sub. Glad things worked out! ",
            "I love to see women looking out for each other. :)",
            "It’s really nice to see two grown women able to talk maturely in this situation. Saves a lot of time and effort.",
            "Ha. I told the girlfriend when my ex came back and contacted me. She was pregnant with their daughter at the time.  Guess what? They moved to another state and got married. You can lead a horse to water but you can't make it think.",
            "I’m glad it worked out well for you. I tried doing that when my ex contacted me. Sadly she was in the fog and didn’t believe me. As far as I know they’re still together. Good luck with a lying asshole sweetie, I tried to tell you.",
            "You did the right thing",
            "Well done, you did the right thing. \nWhen reading your original post I thought it was the right thing to do but that if she took him back after doing it to her before; by her being the other woman then she’ll probably do it again. \nI’d delete all contact and move on with a clear conscious knowing you went over and above and are way better off and sound happy without him. ",
            "You did the right thing. Been there before, better to know than not. ",
            "This is exactly how everyone should handle their problems , civilized ",
            "Military couples post here all the time. This is a recipe for heartache. Benefits alone are not a good reason for marriage. Nor is familiarity.\n\nEnd this and get your youth back.",
            "Ofc you should tell her,this man has obviously some serious problems and must be stopped.",
            "[removed]",
            "[deleted]",
            "Some of these comments seem a pretty harsh way to look at men to me. Society has fucked us up. No where in history have men in general been reliably monogamous. It seems to go against human nature. After all, how many animals have one mate for life? Not many. If we look at actual human behavior, divorce rates, etc, its pretty obvious what the norm is.\n\n&#x200B;\n\nBeing a 29M and in the middle of this predicament myself, its a matter of figuring out what I want to do. Of course there is no excuse for dishonesty. I have been open with my partner about my feelings on marriage and monogamy, and she wants to get married regardless. I don't see the benefits of monogamy or marriage. I have asked MANY long term married people to explain to me, almost begging them to convince me that marriage is a good idea. No one has been able to do it. The best answer that I got was from my counselor who has been married 19 years, who said something like, \"being in a committed relationship causes us to grow as people, because relationships are hard\". Not much of a sales pitch to me. My follow up question was, \"If you could go back, would you do it all over again?\" Answer : \"I really dont know\". Not encouraging, since they are both extremely successful in life in general, involved with service work in the community, and both seem to be very healthy people.\n\n&#x200B;\n\nIt seems like men and women are wired differently. Almost every woman I have ever met wants to get married, almost ASAP. I understand that this is probably for security and because they want a stable family, babies, etc. I believe that most men are NOT wired this way. It is not a moral shortfall, it is simple biology, compounded by our society. Im sure this dude you are talking about probably wanted to be exclusively with you, but is driven by his nature to procreate. It seems phenomenally unfair to expect men to conform to the archaic, unsuccessful social contract of monogamous marriage because that is what women want. The possessive nature of monogamy is a huge turn off for me. After all, I am not only yours. You are not my possession. It is truly ridiculous.\n\n&#x200B;\n\nJust my opinion. Once again, honesty is everything, and if he lied to you, that's not cool. Just keep in mind its not as easy and many of you would make it out to be. ",
            "Well if you think his attraction to you is pathetic, why not tell her?",
            "... No... You shouldn't.  Ignore the issue."
        ]
    },
    {
        "post_id": "4dzxtx",
        "author": "sluttygirl55",
        "title": "Update: Overheard roommates [20-24M] talking about how \"slutty\" I [20F] dress.",
        "url": "https://www.reddit.com/r/relationships/comments/4dzxtx/update_overheard_roommates_2024m_talking_about/",
        "score": 3692,
        "num_comments": 230,
        "created_utc": 1460174726.0,
        "selftext": "OP: https://www.reddit.com/r/relationships/comments/4dkl4r/overheard_roommates_2024m_talking_about_how/\n\nFirstly, I just wanted to thank you guys for being so sweet in the last thread. I was so stressed out and you guys made me laugh. : )\n\nFirst update was removed because I forgot a link, but I fixed it. Onto the update.\n\nBefore I posted, I was basically set on hiding awkwardly in my room or maybe dressing more conservatively when I left my room. After I saw all your responses, I was filled with a feminist, body-positive rage. These boys were not going to get away with slut shaming me. \n\nOf the three guys, I'm closest with Tom (Boy 1/3), so I decided to talk to him individually. I heard him coming up the stairs and I just took a deep breath and walked out of my room, smiled, and asked if I could talk to him for a minute. \n\nHe came into my room and we were just making small talk. I shut the door, summoned all of my assertiveness, and said, \"So, I actually have something weird to talk to you about. I heard you guys talking about me the other day.\"\n\nI'd like to say that I threw down with this boy, that I told him that sexism is not cool or funny and I won't put up with it and demand that he apologize. But instead I, um. \n\nI cried. \n\nA lot. \n\nI straight up just broke down, I couldn't even speak. Tom look absolutely devastated. He immediately apologized, said I wasn't supposed to hear any of that, but I wasn't really paying attention because I was just trying to get a grip on myself. There's nothing more awkward than crying in front of someone when you're \"not on that level\" yet. \n\nAnyway, I asked him if that was really what he thought of me. He said no, and that they were just being dumb, and that when Sam (Boy 2/3) brought it up he was really surprised and knew it was wrong but he didn't call him out on it. He said he should have, and he knew he should have, but he didn't want to make a big deal about it because Sam and Bob (Boy 3/3) were just joking around, even though they were being mean. He said it was shitty of him not to call them out and that by not saying anything and acting like it was funny, he allowed it to happen. He said that he has no excuse and he's sorry.\n\nThis checks out- from what I heard, it was mainly Sam and Bob saying the bad stuff. I said I knew they were just joking around but it made me feel horrible to be talked about that way, and that the sexism really slapped me in the face. \n\nHe agreed and said it was horrible, and he also said something like \"not that it's an excuse, but you're really pretty and I think thats why we were talking about you that way. none of us actually believed what we were saying but i think it was just wishful thinking and we were idiots about it.\" \n\nSo for all you guys who suggested that they were attracted to me- BINGO. \n\nI laughed and told Tom that I had a girlfriend. He said that was totally cool, and then looked embarrassed and said they must have looked like complete idiots bragging about how much I wanted to sleep with them. I agreed. \n\nTom asked if there was anything he could do to make up for it. I told him not to tell the other guys anything because I don't really want to talk about it anymore, but if they ever start talking about another person like that, even if it's not me, to speak up. He promised me he would and apologized about 9000000 more times and left. \n\nI heard him go into his room, and then immediately leave and go out the front door. I didn't think much of it and put my headphones in and played Trackmania for a while.\n\nLater that day I opened my door and there was a big cardboard box right outside my door. My first thought was that I'd ordered something from amazon and forgot about it, but it looked like a used box that someone had repurposed and taped shut. I dragged it into my room and opened it. \n\nGuys. It was a bouquet of flowers and a cake with the word \"SORRY\" written on it. \n\nIf you're thinking that I cried for the second time in three hours, well . . . you're right. \n\nAnyway, I'm sorry I didn't throw down with them like so many of you wanted. Unfortunately I am but a tiny creampuff. I'm working a lot on being more assertive but in this scenario I handled it as best as I could. Confronting Tom about it was actually super scary, but I'm proud of myself for bringing it up at all. \n\nI accept Tom's apology. He seemed genuine, and this does seem like a one-off shitty behavior situation. He's usually a pretty stand-up guy. The other guys . . . I don't know. To be honest, I wasn't super sold on them to start with, so I feel like I'll just continue to not pursue a friendship with them. And I'll continue to dress however I want. : )\n\nLastly, serious thanks to all of you for your responses. I was hesitant to post this on reddit because reddit can sometimes be . . . not so nice about women's issues. But yall are cool. <3 \n   \n**tl;dr**: Talked to one of the boys about it, cried a lot, got cake. ",
        "permalink": "/r/relationships/comments/4dzxtx/update_overheard_roommates_2024m_talking_about/",
        "comments": [
            ">Unfortunately I am but a tiny creampuff.\n\nAww, so cute. Good job on standing up for yourself. Assertiveness comes one step at a time. I'm proud of you!",
            "[deleted]",
            "So, I just want to say. You think you're a creampuff. You're not. You're a fierce creme brulee, with a carmelized hard surface who needed to work through an issue with a spoon, not a fork. You stood up for yourself and got your point across very clearly, and there is *nothing* wrong with showing emotion. *Nothing.* Others may say you  need to work on standing up for yourself more, but you did it. So you did exactly enough. \n\nThis whole idea that showing emotion is bad is just another way we play into these weird power politics of human behavior. When people are close, it just doesn't work like that. Showing emotion isn't weakness, and the feeling that emotions *do* show weakness is not okay. It's not wrong to care.",
            "[deleted]",
            "No matter what, you came out of this on top because you got free cake.",
            "Tom is a good guy. Peer pressure is always hard, but it sounds like he will figure it out. \n\nAnd you did good. Even if the confrontation didn't go exactly how you wanted, you got some good practice in. ",
            "This has me feeling all fluffy inside.\n\nI'm glad everything went well for you.  Hopefully they'll think twice when they go to talk about someone like that in the future.",
            ">So for all you guys who suggested that they were attracted to me- BINGO. \n\nIt's quite telling to me how displaying male attraction seems tied into mistreatment and degradation of said woman they're attracted to. And how so many guys seem to trip over themselves either excusing it or not calling this bullshit out.\n\nFree cake though.",
            "If I might add one point:  Thanks OP, I was a super douche bag coming out of highschool... really thoughtlessly sexist.  It took a similar situation to get me to pull my head out of my own ass.  \n\nGlad you worked this out for you; but also it sounds like you may have started Tom on a better path.  Sometimes, one real conversation is all it takes.",
            "I remember seeing Tina Fey interviewed (wish I could find the link) where she talked about being the first female head writer of SNL. \n\nShe once got advice from an old school female comedy writer who said, \"whatever you do, don't let them see you cry.\"\n\nFey's response, \"Oh, I blew that on my first day of the job.\"\n\nAs you know, she was head writer for years, and it was revelatory (to me at least) that you could cry and still be taken seriously because you were just being genuine and still can be strong.\n\nI've also slowly learned over the years that while other people may be smarter, stronger, or whatever, they can't argue with the truth. Your feelings were genuine and conveyed more strongly what was genuinely going on than any words needed to. \n\nGreat job. Glad to hear you're doing ok.",
            ">I accept Tom's apology. He seemed genuine, and this does seem like a one-off shitty behavior situation. He's usually a pretty stand-up guy. The other guys . . . I don't know. To be honest, I wasn't super sold on them to start with, so I feel like I'll just continue to not pursue a friendship with them. \n\nYeah... that's because they didn't apologize.  They don't deserve your forgiveness. Tom seems like a genuine person though.  Good on you for asserting yourself, even if it didn't go as planned - you still did it, got your point across, and mended instead of burned a bridge. :)",
            "about the crying: women often cry when they are angry, or overwhelmed.  We've been conditioned that crying is acceptable, anger is not.  Baby steps, girl.  You'll get there.  I am a former tiny creampuff.",
            "Hey, sometimes just regular communication works even without throwing down :) Glad you were able to talk things out with Tom! ",
            "Nothing wrong with crying when you're upset. I would have bawled when I overheard it, not just when confronting my roommate.\n\nI was rooting for you. I'm glad this worked out!",
            "You go, tiny creampuff!",
            "I can only imagine what an eye-opening event this was for Tom. We're raised with all sorts of gender expectations and it can be really easy not to notice how toxic this sort of masculinity can be. Thankfully the fella seems to have a natural inclination towards empathy, even if he went with the flow in the moment. I hope this has cleared up that cloud of ignorance for him and in the future he'll consider the sort of effects his actions can have on others.\n\nI am also one of those people who cries when they're mad, so I can understand how embarrassing that shit is and I'm sorry you had to deal with that. Fortunately, it seemed to help Tom understand you rather than drive him away (as opposed to say, dickhead misogynists who believe women only cry in order to weaponize their tears). It'll be good to have him on your side because I have the feeling this won't be the last asshole incident that will arise with these roommates...\n\nGood luck, OP. Oh, and I hope you enjoyed the cake :D",
            ">Confronting Tom about it was actually super scary, but I'm proud of myself for bringing it up at all.\n\nHey, I'm fuckin proud of you too, and I'm just some stranger on the internet! That sorta tension obviously hits you really hard, and I'm impressed you still pulled through the conversation with Tom.\n\nAnd for what it's worth, as soon as I got to the part where you burst into tears, I turned to tell my housemate about it like, \"And she's super embarrassed about it and stuff, but on the bright side that dude is *never* gonna fuck up like this ever again in his *life*.\" There are benefits to being emotional, such as anyone with any empathy not needing any extra convincing that they were a jerk to ya :P\n\nI'm glad you got a decent result out of the whole kerfuffle. I'd keep an eye on the other two just 'cause it can be hard to tell where creepy types draw the line, but that should be much easier with another housemate on your side. Enjoy your cake!",
            "You're adorable.  and yeah, it was pretty obs from your first post that they wanted to bang you.  Huge shit-talk like they did is usually jealousy, or in this case insecurity (\"why do I want her and she doesn't want me?  So rejected!!!).  Maybe you weren't a hard ass about this, but I think they empathize with you better for seeing how their words have effected you.  Enjoy that cake!",
            "Dang! I'm so happy how this turned out for you!\n\nIt's okay girl, I'm a creampuff too. I don't handle confrontation well, at least not when it's something I genuinely care about. I can rage ALL DAY in the office about equality and quashing racism, but put me in a situation where I have to directly confront someone about their views and... damn. Waterworks. Broken faucet. Collapsed dam. \n\nI feel you, fellow cream puff. I feel you.",
            ">  It was a bouquet of flowers and a cake with the word \"SORRY\" written on it.\n\nOh my god I would cry too. NICE SAVE, TOM. \n\nAnd we'll done, OP!! It's okay that you cried, it was a pretty upsetting thing to talk about. Tom's reaction is encouraging, that guy is gonna think twice before tolerating sexist bullshit in the future. You did good. \n\nI love this update. ",
            "I think you dealt with this brilliantly. Having a throw down with them would be unlikely to fix anything. But breaking down and showing him how much it upset you and fully explaining that will hit home with Tom much more than getting angry with him because people don't tend to listen to people when they're angry",
            ">Anyway, I'm sorry I didn't throw down with them like so many of you wanted. Unfortunately I am but a tiny creampuff. I'm working a lot on being more assertive but in this scenario I handled it as best as I could.\n\nHonestly, this worked out pretty well. The house dynamics are now 2-2 in favour of not being sexist asses, and one of the people on your side is a man now which, I'm sorry to say, goes a long way with handling other men who are sexist.\n\nYou did a damn fine job solving your problem, don't get hung up on what solutions a person who isn't you might have pursued!",
            "Great. Now I'm crying, too. Happy tears. You're going to ruin my rep.",
            "I am so proud of you - you didn't let any of us down by not laying into them, or emoting in reaction to a painful betrayal.  As much as you want to think you walked away, I'm here to tell you that you actually stepped up - you opened the door to healthy dialogue, and it freed you!",
            "\"cried a lot, got cake\"\n\nI love this so much, lol. I wish I got cake everytime I cried!",
            "Which Trackmania game?",
            "Hey, you don't always have to be all fierce and agressive to make a point about feminism. You heard them being sex is jerks, and you addressed the problem, that's way more than a lot of people have the courage for! Hooray for the courageous creampuff!!! ",
            "Standing up for yourself and being assertive doesn't mean that you have to rip peoples balls off. You got your message across, and you stood up for yourself. Way to go!",
            "Congratulations!! 😊",
            "You know what? You \"threw down\" in your oen, obviously effective way. Good on you! And good on them for realizing the glaring fact that they were super inappropriate ",
            "If you're upset and going to cry don't be ashamed. It's a natural response and likely put across how much what they said hurt you than any words could ",
            "I am so proud of you!!!! \n\nI wish there was a LPT (r/lifeprotip) /mental trick on how to de-puff and harden into a vitriolic rageful fire of a feminist in response to this kind of mess. \n\nnext time tell them to go wash their ass and exfoliate",
            "You know what? It's OK. You made it clear how not okay what they did is.\n\nThe only thing I would have done differently in your shoes was have him tell the guys how badly they hurt you so this could be a learning moment for everybody. But it's okay that you showed your feelings. It showed how serious you were. And it got the point across.",
            "I've read a lot of the comments below but I just wanted to say good on you for speaking up. I too am a cream puff and hate any type of confrontation. I would have sat in my room forever. You should feel proud of how you spoke up. Enjoy  your cake.",
            "So now OP you can have your cake and eat it too...glad everything worked out for you...",
            ">knew it was wrong but he didn't call him out on it. He said he should have, and he knew he should have, but he didn't want to make a big deal about it because Sam and Bob (Boy 3/3) were just joking around, even though they were being mean. He said it was shitty of him not to call them out and that by not saying anything and acting like it was funny, he allowed it to happen. He said that he has no excuse and he's sorry.\n\nTom learned something that all people should learn: we need to speak up when others are out of line. We need to speak up about misogyny like this, about racism, homophobia, and all types of bigotry. Good for him for recognizing his error and taking steps to correct it. If he's still feeling ashamed, help him get over it, ok?\n\nAnd good for you for speaking up for yourself. You and your friend turned a potential disaster (in your living situation at least) into a positive learning experience for both of you.\n\nThis was a nice update, thank you!",
            "While I still like the idea from the last post of telling the other two guys to stop their slutty behavior when they go around the house in their boxers... Well, it's not super realistic, I guess. You do what makes you feel good and happy. And if that means distancing yourself from the guys who feel the need to tear down a pretty, unattainable gal like you, so much the better.\n\nIn all, it seems like you've got a good handle on what you want out of this situation. Plus cake. Keep on keepin' on - free cake is shameless cake!",
            ">I was filled with a feminist, body-positive rage\n\nBoom! That's what I like to hear!\n\nYou did a great job, like others have said, it's all about baby steps. I too am a former creampuff. Well done!!",
            "Yayyyy!!! That's so great to hear. XO. ",
            "Dammit, I have so much stuff I have to do today but now I really, really wanna play Trackmania. It's been years since I played that.\n\nI missed your original post but I'm glad your situation has changed for the better, even if it means you've realised two of your housemates who you thought were your friends are actually idiots. Tom sounds like a stand up guy, even if he did fuck up by not standing up for you initially. He's clearly now learned something from this incident too.",
            "Hey don't sweat it, I'm a super crybaby too, I tear up in confrontations <_<\n\nYeah, everyone was super mad and indignant about it, but showing your vulnerability actually helps. It shows you're human, it shows you're not attacking them, that at the end of the day, it's about you being hurt. And it's still a form of calling them out. You did great. ",
            " one step at a time, the next time you need to stand up for yourself will be easier, and each time after that gets easier, although i hope you dont have to do that to much.",
            "Not only did this work out, this is probably going to be one of the defining moments in his life when he sees someone being disrespectful.  What a powerful moment and good ending.  Props to you for being so brave.",
            ">So for all you guys who suggested that they were attracted to me- BINGO\n\nFor which I was downvoted for saying.  Never change, hivemind.\n\n\nYou handled it well... I dont see how approaching with anger would have been a good thing or better than crying.  I'm glad the typical /r/relationships reaction of \"this is an afront to all women/these men are literally worse than hitler/its really just that simple\" didnt win the day.  ",
            "This is so great! Men need to know that having these opinions is *not* okay! If they don't like the way things are, *they* need to change. ",
            "Sounds like a great result! I'm glad Tom gave you a proper apology, fully taking the blame and doing as much as he could to make amends. \n\nI think most people are guilty of going along with other people's bullshit at some point or another. Hopefully he's learned a valuable lesson about speaking out instead of going along with the crowd.\n\nAnd good for you for talking to him about it! I know that takes guts in itself. ",
            "You go girl, I think you handled yourself just fine.  Like my drill Sgt used to tell us in basic:  \"Boy (he called everyone boy), Opinions is like ASSHOLES, erebody got one and summa them STANK!  Boy!\" lol.\n\nSo yeah, you can't control what others think, sometimes their opinions line up with yours and sometimes...eh whatever!  But keep on standing up for yourself, so what if you cry?  I cry, just about anyone who is self-aware cries.  ",
            "Well done, this is amazing. It's actually harder to be vulnerable and real than to work up a rage and scream about it. Sounds like he's a good guy as well. Yay!",
            "What a sweet guy!! ",
            "This is a good update. ",
            "Wow, Tom's reaction and reasoning is so well handled and so close to reality that people could learn about it instead of not knowing what to say and make it worse.",
            "This post made my prego ass hungry as fuck for cake and cream puffs. BRB, going to go sob in front of my hubby.\n\n\n\nP.S. You go girl!!!",
            "This is such a ridiculously cute update. I'm glad you decided to say something to one of them. I'm super happy Tom wasn't a dick. I'm sure next time the other two start being pigs, he will say something. So proud of you, girl!\n\nP.S.\nWas the cake fucking delicious and what kind was it?! I have to know!!!",
            "That is great that he apologized. I hope you feel a lot better. It was a shit thing to be saying in the first place. ",
            "I think your assertiveness in addressing it was enough. i also think your vulnerability was tougher than asserting dominance. I'm proud of you! Sounds like they learned their lesson. ",
            "Good for you for speaking up! It's really not an easy thing to do, and even though you cried, I'm sure that put yours and Tom's friendship on a new level and you now have someone there that you can trust. :) Be you, girl!",
            "Don't be a hard rock if you really are a gem, baby girl.\n\nGood for you. You handled it your own way and were true to yourself and it worked. Those things almost never align.",
            "Aww :)\n\nIt can be incredibly intimidating, but kudos on talking with Tom! Glad things worked out with him.",
            ">and played Trackmania for a while.\n\nAs if you weren't cool enough, Trackmania is the *shit*.",
            "I know that this has blown up, but congrats! I'm glad things ended well like that.",
            "Aww... love you, lady!  Keep sticking your neck out and taking those risks.  I promise it'll keep paying off.",
            "Good job OP. Nothing wrong with not being overly aggressive about it. You stood up for yourself and handled it beautifully. Enjoy the cake :)",
            "Best thing I've read in weeks!",
            "Tom sounds like a good person. I'm glad things are good between you guys now! Good for you for talking to him about it. I don't think you did anything wrong by crying, it definitely got the point across! And I think Tom is coming out of this as a better person so that is good too! ",
            "Thank you for this.",
            "Yooooooo, another Trackmaniac? Which one you play? I've been playing the new Turbo one recently.",
            ">Unfortunately I am but a tiny creampuff\n\nCan I steal this? ",
            "[deleted]",
            "You did good lady! I am one to cry in conflict situations so I totally get it. I would have cried too, haha. It doesn't mean you're not a strong woman! I'm so glad things worked out for you in this situation. Women have to deal with ALOT of bullshit in their lifetimes so unfortunately this kind of thing is extremely common. Keep rockin and being a badass! ",
            "You go, girl! I know that it makes a better story to come out guns blazing,  but delicate handling often gets much better results. You were vulnerable and showed him just how fucked up comments like that are, and it seems like he really took it to heart.",
            "This update makes me so happy! And don't worry I cry to when I get super worked up sometimes. I'm glad you went ahead and tackled the conversation, you deserve to wear what you want and feel comfortable in your own home. ",
            "I am so proud of you op :)  hug",
            "If anything, I think this was more effective than yelling - it let him know how his words affect people.  I bet you he doesn't tolerate that crap in the future.  Kudos for honest communication!",
            "Maybe it's just because I'm about to get my period but I had tears in my eyes reading this. That was so cute and thoughtful that he bought you the cake and the roses. I'm sure he felt terrible. You handled it the best way and honestly crying was a good thing. It allowed you to get the pent up hurt out and allowed him to realize that the shit you say can hurt other people. Proud of you also for confronting him about it!",
            "Thank you for making me smile on a sad evening, tiny creampuff :) I'm glad things worked out for you, and don't worry about not being more angry. It was brave of you to speak to him in the first place, and you managed to get across how you felt, which is the main thing. Plus he sounds nice, so you crying probably made him realise how wrong it was more than being angry would have done anyway - raging often isn't the answer, even if it's sometimes made to seem like the thing you 'should' be doing.",
            "You know, crying is not a bad response to this. I think you really drove home to him just how hurtful it really was, in a way that going all feminist rage would not have.",
            "I'm so happy you didn't take the top rated comments advice and escalate the situation. Good job OP. Very maturely handled. ",
            "Tom fucked up but I think he did a good job of apologizing and accepting he was in the wrong . cute to cry like that tho think I'd do the same after being attacked for no reason even tho I'm male ",
            "YA DONE GOOD DARLIN",
            "Glad you we're able to sort things with Tom at least, I think you should chat with the others. ",
            "Glad things worked out for you, and it doesn't matter that you didn't throw down. You still stood up for yourself, so I'm proud of you.",
            "I'm glad that this had such a good ending for you!   It sounds like Tom learned a really valuable lesson too that a lot of people don't.  ",
            "the cake is a lie\n\n(jk)",
            "How is this bullshit on the front page?\n",
            "Its weird because when I'm with guys I feel like we jokingly talk about stuff like what those guys talk about ALL the time. \n\nI suppose its hard to describe, but when guys joke around with other guys, literally no joke is off limits. Typically when we joke around calling a girl slutty or some other derogatory remark, it really doesn't mean she's a slut. Like REALLY. Its like when we call one of our friends an idiot or something when we know they aren't. \n\nI've ran into this issue a lot where girls are extremely shocked to see how guy friends joke with each other, but I think there's a basic disconnect in that we aren't serious at all about it. I know my ex girlfriend once got extremely mad because she read texts between me and my friend calling another one of our girl friends 'too annoying to go to this party' among other things referencing her looks. She wasn't that annoying, she was loud and obnoxious, but we were mostly just poking fun at that. Obviously my ex didn't take it that way. She wanted me to tell that girl directly to her face what I said. I told her she should show me the texts she has with her girlfriends about guys, obviously she dropped the argument right then though...\n\nMy point is that guys will joke about everything. I doubt they think you're a slut in a derogatory way. I know this all sounds awful and its really no excuse for being a douche, but this is how a lot of guys talk. Don't take it seriously. Its almost never serious. \n",
            "Wow, the power of feminism.",
            "Guys don't mean shit like that. Just talk about anything, im sure they meant nothing by it! ",
            "You don't get to control other people's speech.",
            "You're funny.",
            "If you would prefer, try /r/twoxchromosomes less sexism over there"
        ]
    },
    {
        "post_id": "8vxusi",
        "author": "BetterYak2",
        "title": "[UPDATE] Girlfriend [21 F] is furious at me [21 M] after my grandmother spoke badly and derogatorily about her in Spanish right in front of her",
        "url": "https://www.reddit.com/r/relationships/comments/8vxusi/update_girlfriend_21_f_is_furious_at_me_21_m/",
        "score": 3685,
        "num_comments": 240,
        "created_utc": 1530669336.0,
        "selftext": "Original Post: https://old.reddit.com/r/relationships/comments/8sf4ql/girlfriend_21_f_is_furious_at_me_21_m_after_my/\n\n(tl:dr- grandmother said racist and derogatory things about my girlfriend in spanish right in front of her not knowing she could understand some spanish.) \n\nPeople gave me a really hard time in my original post and it really made me realize how much of a dumbass I was being. I apologized profusely to Olivia and called out my extremely stupid behavior and basically begged for forgiveness. After a couple more days of being mad at me she was willing to talk to my parents and my brother who apologized and told her that they really loved her and that they didn’t mean to hurt her. They tried to explain the situation with my grandmother and why she behaved the way she did and they were just trying to minimize drama but that what she was saying was wrong and they should have stood up to her. My mother got her a gift set from bath and body works, costume jewelry and chocolate to go along with the apology. \n\nSo Olivia did forgive me and my family which I am so relieved about because I really am crazy about this girl. I’m definitely not going to take this for granted. A week ago my brother, Olivia and I went to an amusement park and my brother and her actually got along really well and she’s definitely convinced he doesn’t secretly hate black people. (I never thought my brother was racist - when he was in middle school he “dated” a black girl.) He's only 15 so I definitely don't blame him for what happened. It was my dad's fault for laughing. But yeah he really likes her and is glad she doesn't hate him. My mom invited Olivia to a beach with our family on Saturday (My abuela stayed at home) and although she mostly stayed by me and my brother she seemed to get along reasonably with my parents and seems to believe their apology (she was a bit hesitant to go). \n\nI have told my grandmother that if she wants me to be actively part of her life she must apologize to Olivia. My grandmother actually agreed to apologize but my gf doesn’t want to talk to her and I told her I will not force her to be around her but I did tell her that my grandmother is sorry for the way she behaved. \n\nSo yeah that's my update. I appreciate all the replies no matter how harsh. It really made my realize my stupidity. Still have a lot of growing up to do but I am really happy she took me back. \n  \n  ---   \n  **tl;dr**: Olivia forgave me after my parents and I apologized and we are still together. She still  understandably doesn't want to talk to my grandmother though. ",
        "permalink": "/r/relationships/comments/8vxusi/update_girlfriend_21_f_is_furious_at_me_21_m/",
        "comments": [
            "I’m happy for you that you didn’t get dumped, but I feel sorry for your girlfriend. That’s a crapload of family interaction for her...I’ve never been seriously offended by my boyfriend’s family and I don’t have to see them as frequently as you’re making your girlfriend see yours. You said yourself that your girlfriend was hesitant to go to the beach - maybe cool it on inviting her to hang out with people that make her uncomfortable. ",
            "Nice update. Happy to hear that it seems to have worked out as well as you can hope after something like that. Best of luck ",
            "[deleted]",
            "It might be nice to ask your grandma to put the apology in writing so your girlfriend has the choice to read it, or not, at her leisure. That means girlfriend isn't put on the spot and isn't forced into forgiving before she's ready.",
            "You’re really lucky Olivia forgave you. Folks, it’s time to stop “trying to avoid a scene” with our racist family members. If we’re not ready to call them on it and potentially cut them off if they continue to be that way, then we’re not allies in the fight against racism. It can’t all be on people of color to combat it.  ",
            "Well, that's awesome! Good job for seeing where you could've better handled the situation and addressing it after. ",
            "PSA: its fine not to walk on eggshells about race but remember, don’t counter someone’s own feelings and experiences of racism with “so-and-so can’t be racist! they have a black friend/colleague/partner”.   \n\nThat’s not what OP did it’s just generally not sound reasoning",
            "If she's already suffering insecurities before and such event happenes (ive read the old post), she might forgive but it would be really hard to forget. You really need to work extra extra hard for that. Time will come, no  matter how distant the memory was, it'll still come back to her and hurt her.\n\nSo, you have to let her feel confident and loved every single time you got. Seriously. \n\nI have been there (Olivia) and still hurt til now. (Though we're already married) T.T",
            "I checked the ages and it all made sense. This isnt something an older person would put up with.\n\nI was done with these types at 24. You're lucky to have such a sweet girlfriend because myself and most of my friends now at 27 would not tolerate that racist crap.\n\nGoodluck OP and let this be a lesson. ",
            "Thank God. OP, you are lucky this time and it may not be so lucky next time. When you see something wrong, speak up. May it be your gf, friends, or just some strangers.",
            "For what it's worth coming from a stranger, I'm proud of you for swallowing (familial) pride and being open to personal growth. Standing up to family takes a lot of guts and you are a much, much better partner to Olivia for doing so. Regardless of how it all works out in the long term, I hope you foster that attitude because it will help you more than you know.",
            "You shouldn't expect your girlfriend to want to talk to your grandmother ever. \n\nNot that I read that you want her to.\n\nI'm just saying that having racist shit forced in your face is one of the most ugliest and degrading experiences a person can go through.\n\nIt rankles for a lifetime and it can destroy your self esteem. It can hurt psychologically forever. \n\nYour girlfriend is still vulnerable and you should remember that.",
            "Like mi mami always says, “cara de tonta pero tonta no soy.” You’re really lucky your girlfriend reconsidered your relationship. Moving forward, don’t ever invalidate your partner’s feelings especially with regard to her blackness. Anti-blackness in the Latinx community is so pervasive and we need to be willing to go full-stop with family members who make racist comments. Just because people have black friends or have dated someone who is black doesn’t exempt them from internalized racism and colorism (because afro-latinx people exist).",
            "If you guys work out and end up having kids, realize that grandma will be racist towards them. Something to think about. ",
            "Glad to hear it worked out okay. Bigoted relatives are the worst.",
            "I'm not sure that pushing your abuela for an apology is worth it. If I were you I would tell my family that it's quite possible that Olivia will never want to see or speak to your abuela ever again, and that you hope they respect her feelings in the matter. You can kind of smooth over your brother's and father's behavior, as well as your own, with an explanation and sincere apology, but there's no explaining away your abuela. If your girlfriend is willing to tolerate her presence for the sake of family then that's fine, but don't judge or push her if she can't.",
            "She still deserves better. ",
            "Glad this worked out. \nI grew up an a bi-lingual household and it was (and still is among the immigrant members of my fam) to talk shit right in front of other people. It's a lowlife thing to do and I resent them for it. I have since learned that if someone hears someone speak another language around them they automatically assume it's about them. ",
            "That's cool and all, but you really need to interrogate why you are so comfortable with racism. As so many have pointed out, you knowingly put her in that situation, you didn't stand up for her, either to your abuela or to your father. Just because Cubans are culturally racist does not make it okay, and you should not make any excuses for it.\n\nYou need to have a frank talk with your abuela and your father -- NOT about disrespecting your girlfriend. But about how they come from a racist culture, and, if they want to be in YOUR life (not in Olivia's life, as you said, which ain't exactly much of a threat), they need to knock it the fuck off and realize they live in a pluralistic society. If they can't get onboard with that, either you cut them out COMPLETELY, or you are a racist by association.",
            "Goddamn it's upsetting that she didn't get out of this relationship. I sincerely hope she comes to her senses soon. ",
            "Good old racist grandma.",
            "Respect is not difficult if your family loves you. My in-law speaks badly of me and my family from the beginning of my marriage. I always tell my husband, “why don’t you stand up for me or say anything?!!” If you don’t, you’re actually agreeing!! It still continues 20 years later. Glad you addressed the issue early on.",
            "Look I just read both your posts and I had a few things to say:\n\n1 like a few other people said, you shouldn't assume people don't understand Spainish, many younger people in this country are trying, and many will say they don't understand most of it ir can't speak it because they don't feel confident speaking, but they can understand alot of what's said, as you've found out with your girlfriend.\n\n2. I wanted to say that it's really great that you took criticism from your first post and took it to heart and changed what you were doing poorly with; so many just get angry and defensive instead of learning. ",
            "Just curious - if your girlfriend hadn't understood your abuela, what would you have done? In that situation, afterwards, in the future, etc.? Would you have told your girlfriend about her, would you have talked to your grandmother privately, etc.? I feel like those are important to know.",
            "FWIW, I suspect your behavior during dinner was at least partly cultural. Honestly, when I was living in Central America (a long time ago), the single biggest cultural difference I noticed was how deeply ingrained avoidance of confrontation was, including putting up with way more crap to avoid making a scene. Of course you're American, but you learned your manners from a Latino family, so you have probably always gone out of your way to be nonconfrontational in family settings.  The reactions you got to your original posting were an excellent example of how, in American culture, we have much less patience for this kind of thing. ",
            "The biggest step to being an ally, and a partner to anyone, is to be willing to analyze our own behavior and admit when we need to grow. I'm really happy for your both, and I want to thank you for being objective and open to admit when you've made a mistake. It's good to know you are out there. ",
            "You're damn lucky Olivia is a total sweet heart. ",
            "I’m glad it seems to be working out, I’m kind of shocked at all of the harsh responses here. It’s an awkward and shitty situation, sure, but I can understand your position in this too. People say cut off your family/grandma and all that, but honestly I feel this could be a teaching moment for them instead",
            "Eell.. Grandma needs to shut rhe hell up...and be told that in front of saud girlfriend to show the defense if said girlfriend. Age is not license to be a turd.",
            "Sounds like your grandmother may be a bully. Shame on her and I don’t blame your girlfriend for not wanting to be around her...life is short...who needs it?  ",
            "I'm glad everything worked out!",
            "Honestly I had a slightly similar situation where my racist grandpa screamed at two black kids in my house (not his) to get the fuck out because they were African Americans (he said it much nastier\n\n\nA fight ensued and he tried to run over my mom with his weird gold van.\n\n\nMy suggestion is to cut off racist people, I don’t talk to that asshat anymore and a lot of other people in my family and my life is 10,000x better bc of it.\n\n\n",
            "You’re a lucky dude and I’m glad you and your family are working hard to get over that impression and it was good not to push the interaction with your grandmother, whether she’s sorry or not.\n\nYou got a keeper there, dude.  But always have her back.  I guarantee you this was not the first time she heard stuff like that and it will not be the last.  Even when it’s uncomfortable, step up.",
            "Happy that you didn't just brush this away and instead accepted her feelings. Good on your family for being so remorseful and good on Olivia for holding her ground with your grandmother!",
            "An interesting comment is that racism tends to be of slightly less toxic nature in Latin cultures. And racism, can be also more frequent or even used among friends. \n\nBut due to the toxic use in North America, it’s best to just avoid racism. \n\nSo it’s good to remind your family to update to modern times. \n\nRacists are simply throwbacks to injustice. ",
            "There's a lot of negativity in this post and I wanna say that you handled that amazingly! Honestly this is the way you learn- by making mistakes. So yeah you fucked up but you realized it was wrong and fixed it. I can see why she stayed with you. You're a great guy! ",
            "Thats so sweet what your mom did by inviting her and buying her that gift. Let me guess your grandma is your dads mom?",
            "I am so glad that this Grandmas situation was not a romance breaker.  Please remind your Lady that ( i am speaking as a Great Grandma) many seniors have damage to the frontal part of the brain. (behind the upper part of the forehead) This seems to cause the natural inhibitions and self control to diminish.  Rage, to come and go, or sometimes just totally kills off a seniors self control.  (we have all seen or heard of the mean, angry senior chasing and cursing kids playing in the street.)   Brain injury or diminishing is something that just has to be dealt with the best you can.   It is very possible that Grandma is in the coming and going stage of being able to say things kindly and tactfully and inappropriate anger.  Then again, maybe she has always been a sharp tongued, fiesty Lady.  I hope your romance is blessed with many fine memorable times.",
            "in the future u need 2 inform ur partner that ur family is racist so they can decide for themselves if they wanna meet them. don’t put ppl in situation like that n not even stand up for them??? ",
            "Abuelas can be such putas sometimes. Mine is",
            "I hope she leaves your sorry ass. I am SO SICK and tired of Latinos acting like NO ONE understands Spanish but them. News flash - it's not like you people speak Pig Latin or some other hardly known language that is very difficult to interpret.  Even with all the variations in Spanish from different countries/regions, slang, etc., most people who understand Spanish (even Spanish taught in a classroom) know what you are saying, so please think twice the next time you decide to talk shit about someone in your oh-so-sacred language that you probably can't even speak correctly your damn self. ",
            "and your grandmother is still alive ? SHAME",
            "[deleted]",
            "> People gave me a really hard time in my original post and it really made me realize how much of a dumbass I was being \n\nSo why do you make a second thread about it? The situation has not changed, the situation is still a bad one and will take some time to fix",
            "Honestly that's just part of what it's like being in multi-racial relationships.  Are you her first interracial boyfriend, and vice versa?  As  white dude living in Korea with a Korean girlfriend, people are racist all the time (granted her parents are extremely nice) but of course people say stuff in front of you because they assume you don't speak the language.  That's when you make them know that you know what they're saying, they get embarrassed and it's hilarious to watch.  Personally that's what I would have done.  \n\nSorry she blew up at you, glad you got it all fixed, hope your grandma takes a chill pill.  This is of course the 21st century and there's no room for that in family life.  But still, the whole situation seems blown out of proportion.",
            "Those people who were telling you to \"disown\" your grandmother are the real assholes here. So shes a mean, racist old lady..So what, shes still your grandma. She loves you and she is elderly and set in her ways. \n\n__The people telling you that your \"whole family\" is racist and that you should \"disown\" your abuela are thinking and behaving like angry teenagers.__\n\nWhat they dont realize is that the more you bring your girl around the family, the whole thing will be normalized and your grandma will have no choice but to accept that her grandson loves a black woman. ((Which I'm sure she already has once the family got on her about it)). I'm not saying bring your girlfriend to your grandma if she doesnt want to see her (understandably so). But no need to \"disown\" our fucking grandparents imo.\n",
            "Well what did you expect?"
        ]
    }
]