[
    {
        "post_id": "44xv3j",
        "author": "shitsand",
        "title": "My (29m) neighbors just moved in, and their son's room is next to my bedroom wall. His parents told me I need to move my room or stop having sex in it!",
        "url": "https://www.reddit.com/r/relationships/comments/44xv3j/my_29m_neighbors_just_moved_in_and_their_sons/",
        "score": 3676,
        "num_comments": 828,
        "created_utc": 1455039996.0,
        "selftext": "I've lived in this apartment complex since I moved out of my parents house when I was 18. I love this building, love my home, and I've never had a problem with any of the other tenants. \n\nA new family just moved into the apartment next to mine. At first, everything was fine. Their son was a little noisier than I'd like, but it's just something to get used to.\n\nAbout two weeks ago, the Mom approached me and took me to the side. She told me that she liked the apartment, everything was fine, except for one thing: her son's room was next to mine, and he could very obviously hear me having sex with my boyfriend.\n\nI apologized and said I'd try to keep things a little quieter. She told me that she thinks it's for the best if I move my bedroom, or have sex somewhere else, just in case her son hears. I told her that wasn't going to happen, but I would definitely try to be more courteous about timing.\n\nFast forward to this past week. My boyfriend (who lives with me part-time, but is a grad student on the go most of the time, so we don't always see each other) was over, and we ended up having sex. It was probably 4 in the afternoon. While we're going at it, there's a knock on the door. I'm not expecting anyone, so we ignore it, and the knocking continues.\n\nThen comes the shouting. I need to stop, I'm being disgusting, don't I know there's a child in the next apartment, I'm a degenerate, I'm a slut, I'm a hooker, etc etc etc. She went away eventually, but not after yelling some more.\n\nNow, I don't know. Am I being unreasonable about this? I don't think it's fair for me to have to adhere to someone else's schedule just because their son shares a wall with me. We aren't screaming banshees and slapping the headboard against the wall, but we're two adults doing what we love doing. \n\nThe woman caught me leaving for work this morning and told me that if I didn't stop \"exposing myself\" to her son, she would have me arrested for child endangerment. No idea if that's even a thing. \n\nWhat am I to do here?\n\n**TL/DR:** Woman thinks I am the devil because her son shares a wall with me, and he can hear me and my boyfriend having sex. I'm not about to stop having sex in my apartment, but I would like this to stop.",
        "permalink": "/r/relationships/comments/44xv3j/my_29m_neighbors_just_moved_in_and_their_sons/",
        "comments": [
            "[deleted]",
            "Tell your landlord about this situation ASAP.  Point out that yo  have a history -- a long history -- with no complaints (I'm assuming) so far, and this neighbor is being unreasonable AND ALSO HARASSING YOU.  Then, next time she comes around and is being a fucking lunatic outside your door, call the police!  ",
            "It may be embarrassing, but I'd document the harassment and then approach your landlord before she can. You've lived in this building for years and presumably have had no complaints made about you before. If you head her off at the pass with a record of the offensive, intrusive things she's said to you, you stand a better chance of getting your landlord on your side.",
            "Is this an issue of sex or an issue of two men having sex? \n\nEither way, I think you need to get to your landlord before she does.",
            "She moved into an apartment, after you.  She put her sons bedroom there, and is trying to get you to move?  Um, that isn't how it works.  She's delusional.\n\n\nAs a parent, I wouldn't want my kid to hear that.  But, I'm not going to make it someone else's problem when it is very clearly mine.  You aren't responsible for her child, she is.  She needs to put her big girl panties on, and deal with the situation on her end, not by asking you to change your life for her benefit. \n\n\nYou've already promised to try to be quieter (which is very considerate), you've done what you can.  At this point, I'd say she's harassing you.\n\n\nIgnore her.  I doubt anyone sane would take her very seriously.\n\n\nI mean, if you were screaming at the top of your lungs and were refusing to be considerate at 3 am, that's different... But if you want to not hear your neighbors at all, you need to not be in a living arrangement that shares walls...",
            ">I need to stop, I'm being disgusting, don't I know there's a child in the next apartment, I'm a degenerate, I'm a slut, I'm a hooker, etc etc etc\n\nYeah...what a great way to show her son how to treat other people. The irony. It hurts. \n\n>told me that if I didn't stop \"exposing myself\" to her son, she would have me arrested for child endangerment. No idea if that's even a thing.\n\nUhm. I don't think this is a thing. You didn't expose yourself. \n\nTalk to your landlord, tell them what she has been doing (screaming outside your door at 4am, etc, threatening you, etc). \n\nYour neighbor is nuts. It's her kid. She should move bedrooms with him if she thinks it's such a problem. ",
            "She should move her son's room if this is a concern to her. She can get a sound machine, hang heavy drapes and add other soft goods to muffle the sounds from her neighbors. It ain't your problem. ",
            "The cops, huh? Hardball it is. \n\nTell the lady to stay away from you and never bother you again, or it is *you* who will call the cops on *her.*\n\nThen do it. There's no law against fucking in your bedroom, but there *are* rules against harassing your neighbor.",
            "Do you suspect there's some level of homophobia at work here? (Her accusation of \"degeneracy\" makes me wonder.)\n\nIf she wants to completely control every aspect of her child's environment (which is pretty much impossible anyway), she shouldn't be living in an apartment complex. Talk to your landlord, document any further incidents, and if she comes around banging on your door again let her know that you will call the police if she continues harassing you.",
            "You need to report her harassment to your landlord. Screaming derogatory comments like that is totally inappropriate. Having sex in your own home is totally reasonable and normal. If you aren't having especially loud sex and you are doing it at a reasonable time when it's unlikely to wake people up or whatever then there is nothing else you should have to worry about. People have sex, and people have the right to have sex in their own homes free of harassment like this. When you live in a densely populated area like an apartment building it's inevitable that occasional sounds of people having sex will be heard. Your crazy neighbor needs to come back to reality or find somewhere else to live.",
            "I would pre-emptively call the cops and say you are being harassed. This lady sounds a bit crazy and she only just moved in. Things will probably get worse. You are free to enjoy your home however you see fit. ",
            "[deleted]",
            "yeah, no. she is ridiculous. please tell your landlord about the harassment right now before she escalates.\n\ngod I HATE people like this. They give the rest of us parents a bad name. Why doesn't she trade rooms with her kid??? \n\nI'm assuming here that you're not having outlandishly loud sex...although I don't really know what the standard decibel level for \"normal\" sex might be...",
            "Tell the management that she is harassing you, because banging on the door, screaming at you, and a costing you in the parking lot is harrassment. \n\nOn your lease it should have a clause about you having the right to peaceful enjoyment of the premises. It should also have a clause about quiet times, which are possibly for something like 9:00 pm - 7:00 am. It sounds like you were peacefully enjoying the premises during a time that was not a designated quiet time. \n\nI am not a lawyer, and you should probably run this by /r/legaladvice. They love tenant issues. ",
            "Your neigbor has no say in how you arrange the furniture in your room or if you have sex.",
            "I would complain to management immediately, you pay rent just like everyone else and you shouldn't have to deal with harassment in your own home. I am blown away someone would scream obscenities  at you through your door because you're being intimate with someone you're in a relationship with. I don't think you're doing anything wrong, I'm actually stunned that she would even try and make you switch rooms in your own apartment. ",
            "Complain that she has been harassing you. First to the landlord or management. Might as well get ahead of her as she isn't letting it drop. She can switch rooms with her son but doesn't get to dictate what you are allowed to in the spaces you pay for. ",
            "Do the kid a favor. The next time you have loud sex with your partner in your own bedroom, have a loud discussion about how to practice safe sex. Judging by his parents' attitude, it may be the only sex education he gets.",
            "I would have recorded her screaming obscenities to you. That way you have proof of her erratic behavior if she does end up reporting you to the police for child endangerment. Speak with your landlord and begin documenting everything. This women is completely out of line. Maybe it's worth contacting the police first to say you are being harassed.",
            "You've done nothing wrong.\n\nHowever this is going to escalate unless you find a way to deal with it and that way is NOT by moving your room and acquiescing to her harassment.",
            "If neighbour lady really thought that hearing you have sex was causing irreparable damage to her son, she should have taken responsibility and moved his bedroom herself. The fact that she's willing to expose him to this horror until *you* do something about it means she's just being purposely awkward, and kind of a bitch.",
            "practical advice:\n\nmove your bed a tiny bit away from that wall. just give it some cushion. pay attention to the noises your bed makes, against the floor, and against the walls, and springs etc.\n\nmake up a sexy playlist and get some speakers. put them touching the wall, hell even point it at them and play music when you do it. pull up the bass a bit, it may annoy them but they can't complain if you are actually making an effort to shield their child's delicate ears. \n\nif you're not into a soundtrack, a white noise thing might help a tiny bit as well.\n\nin my apartment, i don't hear my neighbors sexing, ever. unless it is the absolute middle of the night deadly silent. this means the regular ambient noises of: fans, showers, exhaust fans, talking, tv, etc, are jusssst enough to cover sex noises that are happening at literally any moment other than between 2 and 5 am. between 2 and 5, when i hear it, i swear, it's SO CRISP i feel like they are in the room with me.\n\none time i heard some sex from outdoors (middle of the day) , and i went inside out of curiosity, so literally 3 inches of difference and inside with door closed could hear nothing. even leaning up against the door, the window, listening. outdoor, so clear that she must've had a window open and directing her voice directly at it. so ambient noise is a factor.\n\nnot that you are obligated to do this, but personally i hate being the noisy neighbor (sex or otherwise) and i have found that these things help. also; padded carpeting, door draft stoppers.\n\nETA: the best music to sex to is the Jurassic Park soundtrack, free tip.",
            "Agreed that she is being completely unreasonable.  This is an APARTMENT.  It shares walls.  With people.  Potentially numerous ones.  I'm sorry but the expectation that there should be zero noise from neighbors is short-sided and unrealistic.  I would tell her that you've done what you can but the fact of the matter is that hearing things through walls is part of the price of admission for opting for an apartment or condo versus a single family home.  Whether it's moving her son's room, getting a sound machine, or something else, it's her problem to deal with.  You've already made a respectful gentleman's effort.",
            "Talk to your landlord/management *immediately* (as in today) and tell them that your neighbors are harassing you. Because that's what they are doing. Don't let your neighbors complain first. If they continue to harass you, go to the police.",
            "> Woman thinks I am the devil because her son shares a wall with me\n\nNo she doesn't. She thinks you're the devil because you're gay.\n\nHaving sex in your own home is not child endangerment, by the way. As long as you aren't in violation of any noise laws or rules, you don't have to bow to the whims of your neighbor.\n\nSo if you all were my tenants, I'd approach this as follows. I'd see if this could be resolved by some type of \"gentlemen's agreement\" to turn the TV or some type of music up during times of intimacy in exchange for her ceasing to act like a crazed lunatic. And if that were insufficient, I'd allow the new tenant to move to a different unit fee-free as long as she cleaned her unit into move-in ready condition.\n\n",
            "> The woman caught me leaving for work this morning and told me that if I didn't stop \"exposing myself\" to her son, she would have me arrested for child endangerment. No idea if that's even a thing. \n\nBe super careful dude. Not sure where you live, but if it's in the US, you don't want to be messing around with a crazy woman like this. She is trying to build a case against you. It's very worrying that she used that language (I assume you are not paraphrasing). \n\nDepending on how things shake down, you could be hearing from the police about this. Are there sodomy laws where you live?",
            "People gave enough suggestions to follow through with landlord. \n\nI'll give you a workaround, put on some music or TV... if they complain say you're watching HBO.\n",
            "Definitely take the majority advice here.\n\nI'd talk to the landlord, and give him a written copy of the interactions.  Email it, so there's a trail that you told him about it.  Definitely point out you haven't had any issues in the decade living there (if that is indeed the case).\n\nI'd watch the noise too.  Maybe she doesn't like the sex part, or the gay part.  Either way, if she's crazy enough to stick a recording device with a sensitive microphone against your shared wall and/or door, could it pick it up?  Regardless if you're at an appropriate volume level or not, her having a recording she can claim is from within her home that seems to be you having 'loud boisterous sex' might be considered indecent.  I mean, I'm no prude, but if my kid could hear two people of any gender having loud, wild, vulgarity filled sex, I'd be displeased (not saying you're doing that, but hopefully you catch my drift).\n\nTell her degenerate son to stop sticking his ear to the wall.\n\nBut seriously, get out in front of the situation and double-down on protecting yourself and keep your sex at a minimum for a couple weeks.  That would give the landlord a chance to digest and (hopefully) speak to the other tenant as well.",
            "Personally, I would play dumb. \"what are you talking about? no one was having sex. if you harass me again, Ill call the cops.\"\n",
            "Tell her to move her child's room. You've been there for ages and it's not your problem. Shit.",
            "[removed]",
            "Start documenting harassment and go to the police over it.  She's harassing you and that's illegal. ",
            "If the harassment continues do as everyone else has said and you may can add some sort of discrimination to the list since you are gay.  Would she say that if it were not a gay couple? Probably not.   Btw, how old is her son, not that it matters in any way at all, I am just curious?  He's not some unemployed alcoholic 25 year old is he?  lol ",
            "Don't just call the management, write them a letter.  Tell them that your neighbor asked you to keep down the noise (you don't have to tell them what noise), you have tried to be courteous but she's begun to shout abuse at you outside of your door.\n",
            "Your neighbor is absolutely crazy and threatening you with things that do not, in any way, apply to your situation. Call your landlord RIGHT NOW and say that she is harassing you. He knows you, you've lived there over a decade and THIS is the first problem about noise. Me thinks the lady doesn't like the \"homosexual lifestyle\" and is using her son as an excuse to try to punish you. It is HER issue, SHE needs to move her son's bedroom or SHE needs to move, period. Maybe somewhere without neighbors because she has issues with controlling other people. ",
            "If you think someone is going to report you either to the police, your landlord, boss.. ALWAYS try to beat them to it and bring up the issue first. You have a WAY better chance if you are the one to get your side of the story in first.",
            "Neighbor has crossed the fucking line into harassment by calling you xyz through your door no less. Yes call landlord asap. Seek advice. Keep on fucking.",
            "Sounds like homophobia is likely fueling her ridiculous behaviour ",
            "Instead of you switching rooms why doesn't she switch rooms with her kid if it's that big of an issue for her? ",
            "*Sorry Mrs. X, but I think you should swap bedrooms with your son.  I think he's been eavesdropping on me and if he doesn't stop I'm going to have to report the little spy to the police.*",
            "She needs to switch rooms with her son, obviously. ",
            "Just tell your awful neighbor that if she has such a huge problem with it, she needs to move her sons bedroom. Seriously, you've lived there for 11 years, she just moved in. It's not your fault she put her kids bedroom there.  \n\nAfter you tell that psycho to be a reasonable person, inform management of the situation.",
            "I'm gonna guess your neighbor is a homophobe. You have good advice here. Your neighbor is being unreasonable. ",
            "She threatened you with \"exposing yourself\" to her son who is a minor(?).  That has *VERY* serious repercussions if she is follow through with her threat.  I would talk to a lawyer if I were you as well as the landlord.  If she beats you to the punch you will find yourself playing defense against some potentially life ruining charges.  If she has the gall to threaten you with false charges you should believe that she will act on and try to have you incriminated on false charges.  I would record what I could and seek the advice of counsel and see if you should go to the police about harassment to beat her to the punch.",
            "Call the police on this abusive neighbor? Take it up with the apartment management? Tell her to fuck off?\n\nOr better yet: Turn up the heat! Get out the whips and paddles, crank up some porn and go on the offensive.",
            "This woman is a self-righteous tool. If she's so concerned about her son hearing you she could switch rooms.\n\n\nShe's full of shit. She thinks because you're gay that she's in the right. ",
            "Why doesn't she give her son the master bedroom and take the sexytimes-adjacent bedroom herself if she's so damned concerned for her son's virgin ears? Problem solved. \n\nIt also sounds like there's some serious homophobia coming into play as well. ",
            "Arrested? She thinks she's going to have you ARRESTED for having sex in your own home? I'd like to see the trial for that one. ",
            "A lot of people are saying this: report her to your landlord ASAP. Also tell her to switch bedrooms with her kid if it's such a big deal.\n\nAnd for the love of Christ, please record all of your future interactions with this woman. You can never have enough evidence, but you can definitely have too little. ",
            "It took me a second to realize this in the story, but I have a particular feeling that they're not totally ok with homosexual sex being heard. I'm not saying it's right for this woman to be a bitch about it, and I believe you should have the right to all of the consenting sex you want, but I can see this situation happening so much quicker with a close-minded neighbor.",
            "no one to tell a grown adult not to have sex in their own home. NEXT.",
            "She's threatening to falsely accuse you of an act that could get you labeled a sex offender. Contact the police immediately or she could wreck your life. The landlord is an inadequate measure when she's already stated indirectly she'll try to have you jailed.",
            "I recently went through something similar and was advised to go to the police and file a citizens request for prosecution. You're the one being harassed. I was told it would be best if you had a recording or video of the neighbor's harassment, but you can still file the request without it.",
            "Fuck that. I would get louder. ",
            "I shared a thin wall with a neighbor once... They would wake me up every morning around 6 am going to the bathroom.  \n\nSo I moved my bed out into the living room and moved the TV and couch into the bedroom. One night I get home from the bars at 2 am and we decide to watch Trapped in the Closet.  Even on the lowest volume setting on the TV, it was enough to wake up the neighbor and he started cursing and banging on the wall.  #sorrybro but that ain't gonna stop me from watching all 12 parts.",
            "We went through this a few years ago. The family moved in under us, and the mother would ram her ceiling with a broom handle if she even heard us walk across the floor. She complained about us having sex several times, even when we weren't having sex. \n\nEventually, my boyfriend had to be the one to switch apartments, mainly because she became so psycho and was harassing us. They ended up getting evicted for harassing the next tenant that moved in above them. \n\nDon't worry too much. Things end up working out eventually. ",
            "Tell the landlord, if she keeps yelling call the cops. Put that shit on paper. Any texts from the landlord get scrennshotted, she keeps it up landlord will break her lease and boot her.",
            "\"You just moved here. You can change rooms. I've been here longer and nobody has ever complained to me before, so this is your problem, not mine.\"",
            "OP, we need clarification.   Title says you are male, but the insults the mother used towards you are typically used towards females.  Are you male or female?\n\nJust wondering, because if you are male it is possible there is also some homophobia going on, too.  Aside from the general craziness of this woman...",
            "Why doesn't she move her son's bedroom? They just moved in and it shouldn't be that hard. If they have a problem with it, they should try to resolve it within their own home first. That's ridiculous. Next time she comes knocking on your door, call the police & get a report of the abuse she's putting you through. If it persists, file a no-contact restraining order.",
            "From your title I assume you are gay.  In the \"etc., etc., etc.\" tirade she went on was any of it homophobic?  If so, depending on the jurisdiction, I would consider strategically bringing up the possibility of a human rights complaint based on sexual orientation.\n\nI think a very gentle threat that this could be a case like that is going to make sure people... properly weigh... what their next steps would be.",
            "Depending where you are this could be a big deal if she starts complaining outside of the landlord. The climate here in the US is so hateful right now I wouldn't be surprised if some mayor or Governor wouldn't pass a law against two men having sex unless 3 walls are separating them from children ",
            "Tell the landlord that you are not getting the 'quiet enjoyment' promised in the lease.  It is not your problem it is the landlord's",
            "She asked you to move your bedroom. Did you ask her to switch bedrooms with her son? You were there first, why should you be the one to move?",
            "If she is so fucking concerned about having to explain sex to her shitty kid, why doesn't she move him to a different  room? She doesn't have a legal leg to stand on here, but definitely get the landlord/neighbors on your side.  You've never had a problem before, and being that you have lived there longer than they have, I'd say you have more going for your side of the argument.",
            "I'd file a restraining or no contact order on her for harrassment. It is your home, you are perfectly within your rights to behave as you have been within your own home. This way, if she contacts you, she's violating the no contact order and can be arrested.",
            "How loud are we talking here ? ",
            "Time to start experimenting with much louder and more obnoxious kinks.",
            "Your landlord should add acoustic panels at no cost to either party. It's not your fault the walls are thin.",
            "I'm not a lawyer but I don't think she can hold you liable, however she probably can hold the landlord liable, so even more reason to talk to the landlord.  You have the right to use your apartment, so does she, if there are issues where you can hear each other it's the landlord's fault.  Your landlord may decide to put in soundproofing, for example, rather than deal with a lawsuit from her.  Also, don't listen to me, I'm not a lawyer.",
            "Couldn't she just move her son's room?",
            "I'm pretty sure there's absolutely nothing she can do about you making noise during the day.  I'd tell her to go kick rocks. \n\nIf she has a problem with it, she can move her son's room. ",
            "Why can't she switch her son's bedroom with her bedroom? Are they vastly different dimensions?",
            "Report her for harassment to the landlord.  That's ridiculous.",
            "Tell the landlord about the situation you have. They might be understanding and could help you. At least you'll have the benefit of being the one who speak with them first, which will be helpful since they will be prepared before your mentally disabled neighbour does so. ",
            "Fuck louder, fuck prouder!",
            "why doesnt she offer to swap bedrooms with her child if shes so hung up on it...",
            "Tell her you haven't had sex since she moved in and any noise she heard must be from exercising with your live-in personal trainer. Suggest she put on an exercise tape of her own for her son to watch, if exercise noise bothers him. ",
            "What you are doing is not illegal.\n\nWhat she is going, the shouting and calling you disgusting names, is illegal.\n\nI would be documenting every interaction with her. Dunno the legality of this but you could even film her screaming next time she does it.\n\nIf she wants to play hardball, I imagine she'll be the one having trouble with the police.",
            "LOL. \" Stop exposing my son to your hedonism! Adhere to my commands pronto or I'll bring the law!\" \n\nYour neighbor sounds vexing. Maybe  she  should switch bedrooms with her son if they're so concerned about his innocence. Like other users have suggested, casually bring it up to your landlord and let him/her know your side. Then proceed to do you. It's your apartment, you've been there longer, and if you haven't had any complaints from others this isn't likely a real problem. ",
            "This is a part of apartment living....you were nice and courteous about it. If she doesn't like it she needs to switch rooms. Apartment life get over it. ",
            "Wow, she sounds pretty horrible. Here's an idea - why doesn't *she* switch rooms with her son if she's so worried about it?\n\nApartments have thin walls, it sucks, but as you said, you've tried quieting it down and it still isn't enough for her. She hasn't really got any right to demand that you have sex *somewhere else*, it's *your* bedroom.\n\nThere are some things you could do to lessen the sound more, if you're so inclined - pull the bed away from the wall a bit, hang a heavy blanket or something against the shared wall to absorb more of the sound.\n\nI would definitely go to the manager of the place, though, and file a complaint about her standing outside your apartment and calling you those things.",
            "Ok, there are two sides to this. As the child involved I would feel really uncomfortable having to hear two adults having sex next to my bedroom. As a mother to that child I would move my child immediately instead of trying to get the person next door to do so. \n\nHowever, if I were in your situation, I would move rooms just because I would feel really uncomfortable knowing a child could hear me having sex.\n \nI dunno, this seems lose-lose. No one should have to hear anyone have sex, and no one should have to move rooms. Your landlord should install something to insulate sound between your walls.",
            "So... Why can't she trade rooms with her son if she's so concerned? Call your landlord, and if she continues harassing you, file a police report.",
            "This is completely insane.  You're in YOUR APARTMENT.  She does not get to dictate what you do in your own home.  Talk to the apartment managers about her ridiculous demands.",
            "Your territory. You were there first. She chose to put her son next to your bedroom. She can be the one to switch bedrooms. If she can't handle that, she can move out. Her problem, and she can fuck off about it. ",
            "I love how their solution is to have you move your room after years of living there, instead of them moving their son's room after just recently having moved in....\n\nMan, parents of young children on an airplane are the WORST! In all their consideration for their children, they have absolutely ZERO consideration for everyone else...",
            "You call the cops next time and get a restraining order forcing her to move out. This isn't going to get better. You've been they  much longer than she.  There is no way a strait couple would get the same treatment either. ",
            "Send a male stripper in a police officer uniform to her apartment as a welcome to the neighborhood gift. ",
            "I handle all the tenants for my mothers rental properties. I will tell you right now that an 11 year tennant with no problems who pays rent on time (hold having an issue here and there its negligable if its a rare occurrence ) is much more valuable than a new tennant.\n\nNo kids? You wont damage my unit as much as soneone with kids.\n\nTalk to your landlord; and i can almost guarantee they will take your side.\n\nAsk her why she is listening to you have sex.\n\nShe bangs on your door and causes a scene; inform your landlord. She keeps it up; call the police. Fines for being a public nuisance are quite hefty.\n\nAlso on a matter of principal you do not tollerate some dumb cunt calling you a hooker, slut, or whore.\n\nYou tried to be courteous. Your due diligence is done.",
            "The lady needs to realize that living in a place like that there will always be noise.  She perhaps needs to reevaluate her stance as I doubt the police would take her seriously.  She is pointing the finger at you rather than taking responsibility.  As a parent if this is affecting her child, then she should change rooms not you.  It is her responsibility.  Further, name calling and harassing like she did is totally inappropriate.  I would speak to your landlord regarding her behavior.  This lady sounds like she really needs some boundaries.   Also, with no prior complaints I doubt you have anything to worry about.  I have been called on for noise complaints as well when I was actually sleeping and all the police did was listen then ask to keep it down.  They ended up refusing to come to the complex and notified management who told me that the neighbor called on many others and told him to stop harassing others or they would take further action on him.  ",
            "To be honest, you really don't have to do anything about it, it seems like the mother is being very disrespectful to you and your boyfriend's personal lives. \n\nI have a similar issue with my neighbors, they have knocked on my door a few times after midnight and complained about our volume cause I had some guy friends over and we were just having a casual drink and talk. The first few times I was still able to respect their opinion and told them I would keep the noise level down, but I think it is unacceptable for me to not be able to have a conversation and drinks with friends in my own home. \n\nEventually, I just told him to call the cops if he has any more complaints because I don't think it is my problem, and I haven't seen them for 6 months now.  ",
            "Eh, she's a mombie, she thinks everything revolves around her precious little snowflake. Fuck that. Talk to your landlord ASAP, and it might not hurt to talk to the cops regarding harassment. ",
            "Video record her the next time she harasses you about it and tell her if she doesn't stop you will call the cops.\n\nShe will likely threaten to do the same. Tell her no problem, you have all the evidence you need.\n\nYou have a legal right not to be harassed.",
            "[deleted]",
            "If she doesn't want to share a wall then she can pay a higher price elsewhere for the privilege. So long as you aren't being excessively loud this isn't your problem.",
            "I'm the president of a strata and I'd recommend you file a complaint about her harassing you. Banging on your door, shouting, and generally acting like a lunatic is not ok - it is a disturbance to you and to others. Threatening you in the halls is not ok. \n\nYour complaints about her might be corroborated by others, if they have not already complained about her hallway tirade. I assume you've never been a problem tenant, and the longer you've been there the better. If she tries to make a noise complaint against you, it will be important to note that she just moved in and is the first to say a word about you. If there are other units sharing any boundary (above, below, sides) with you that will matter too, since they have no issue and you have not changed your routine. She is the *only* one with any problem and is brand new to the building and stirring up trouble.\n\nYou could even complain about the noise from her kid's room, in case anyone else sharing a boundary with it has filed a similar complaint. Kid feet on your ceiling can be a legitimate noise complaint - they are deceptively loud and often people don't even realize it until they hear it from below for themselves.\n\nDo not be defensive about it. She's done more wrong than you, and you've already taken reasonable steps to reduce a level of noise which was likely not an issue in the first place (nobody has ever complained). Noise complaints are generally more consistent - music thumping for too long, loud TV, kids feet hammering on floors, that sort of thing. For more intermittent noise it has to be quite bad, or else we'd be sending out warnings for vacuums, coffee grinders, laundry buzzer, tenderizing a steak, forgetting something and walking across the hardwood in heels, etc...\n\nWorst case, if you're concerned with her threat, call the police non-emergency number. They could tell you easily enough if it is worth opening a file and recording some basic info. Having a case number as early as possible can only help you, should things ever escalate, but if that's overkill I'm sure the officer who calls you back would say so before wasting much time.",
            "Why would she expect you to move your room, instead of her moving her son's room?  I suspect her son is oblivious and her actual beef with you is the obvious one.\n\nIn addition to all the other advice: make sure you stay on the right side of the rules.  There are probably rules about making too much noise after a certain hour (usually around 11:00pm), so make sure that in all her fussing she doesn't stumble across a legitimate complaint.\n\nAlso, you could always just tell her you're working out.  She can't do anything to prove otherwise.",
            "At least she's an equal opportunity slanderer, i mean she called you a slut and a hooker and who knows what else, usually slut is reserved for females. \n\nBut seriously that shit is fucked up, you keep doing what you do and the next time that homophobe bitch says anything call her out and/or call the cops. Also chat with the landlord before she does.",
            "Three missing details: Age of the kid - and the actual question of how loud you are and what kind of noise you are making (objectively how loud is it?), and if the walls etc are uniquely bad/poorly constructed with respect to dampening sound (like extra thin?) There are noise bylaws and things like common courtesy that you could use to navigate this.  There is also the question of harassment, --- but no matter what you need to get out in front of this.",
            "Escalate before she can. Call the police and file a report of harassment. Go to your landlord and tell him she's been harassing you. Disarm her by playing her cards before she can. ",
            "Like that kid doesn't hear his own parents having sex in the next bedroom over. \n\nOr maybe he doesn't. You know, it's never the people who are getting laid who get their jimmies rustled about other people's sex lives. ",
            "I'm just going to take a wild guess and assume it has more to do with your sexuality than the actual noise. She's a bigot. ",
            "How old is the son?",
            "It seems to me that if it bothered her that much she could move her son's room. She sounds a little crazy, and honestly when dealing with crazy you might be better off switching your room if you have a two bedroom. I get that you were there first, but people who are willing to behave as she does are not safe. I might even move. I'd definitely talk to building management and I might even talk to the cops. By banging on your door and screaming insults like a nutcase she is certainly disturbing the peace. They do sell soundproofing materials. The apartment complex might be able to put up soundproofing tiles. ",
            "Get ahead of this and talm to your apartment management ASAP. I have a feeling based on the name calling that this is more about homophobia than the actual sex sounds.",
            "Talk to the Apt manager immediately. \n\nMaybe see about getting an restraining order against her. ",
            "Next time she starts going off on you from the other side of the door, record her. Even better yet if she is threatening you and calling you names call 911 and let them listen to her go off live as she does it.. Tell them she is totally irrational and you fear for your safety.",
            "Get your landlord to move her to another apt",
            "You seem to have done the most you could have done. You were kind to them, gave a quite reasonable offer about trying to get the the timing better for her, and went through with it. It is her place to move the bedroom if she wants to not have her son hear you having sex. I understand how it could be an annoyance on her side but she seems to have taken it too far. If your bed is on the wall I suggest moving it to the other side if you still have some kindness in your heart also if you have a building manager or similar type thing I suggest you report it to them if they do the attack again.",
            "She's harassing you and invading your privacy and you need to tell her to stop. You are paying your fair share of rent and you've never been a problem to other tenants nor have they been for you. \n\nShe's the problem, expecting to move in and have everyone bend over backwards and do everything the way she wants it to be done. Step up and tell her to screw off, she can move her son to another bedroom too. Also go talk to management before she does. ",
            "Update us please",
            "Lol? Tell them to switch rooms with their kid, and tell your landlord. So ridiculous",
            "Tell her to move her son's room if it's that big of an issue. If he's old enough to know what sex sounds like he more than likely already knows what's up, if not who cares it's just strange noises to him. Maybe that's just me though ",
            "Op this bitch is mad she's not getting dick. Kids sleep like rocks. She's the one hearing the fucking.",
            "Lots of comments here. But I wanted to say how ducking infuriating this post was to read. \n\nI can't believe how fucked in the head some people are. Honestly, I would have raged if someone knocked on my door shouting obscenities for something I'm doing in my own private domicile. \n\n",
            "Why don't they move their son's room?",
            "Does OP feel this was a homophobic tirade?",
            "Also check your state and local sodomy laws. While child endangerment is a stretch, many states do have sodomy laws on the books that would make sex between two men illegal. And if you are in a conservative area, you could find yourself arrested for sodomy. ",
            "Call the cops on her next time she starts abusing you. Maybe play music if it's not late at night? Other than that tell her to mind her own business. ",
            "Maybe she and her son should swap rooms. Problem solved.",
            "Op, I've been in your same EXACT situation and unfortunately I'm a bit weak willed so I caved and left.  After 6 years in a place I loved. \n\nStay, hold your ground. Do it for me!!",
            "Post this on /r/legaladvice \n\nI hope to see your post there. They can help you out a little more.",
            "Please be proactive OP! I really think it would benefit you to have your story out there (to the landlord or whomever) BEFORE this lady has the opportunity to put you in a situation where you have to defend your actions. Good luck! ",
            "Tell your neighbor to move her son to another room and/or to buy the little shit a pair of earplugs.",
            "All I can really suggest is get to the landlord first and try to get him on your side. This may sound really fucked up but the more you can make her look like a crazy Kim davis bitch, the better your case is. I think I read you're a long time resident so hopefully you're friendly with the landlord and maybe a few other people. Bonus points if you're able to get other people to say \"yeah fuck these people\", if it looks like you're not the only one who thinks they're crazy then you should have leverage. I'm sure most people have had that neighbor that they're just like \"ugh these fuckers again\" to and it looks like this family is it. Also if she gets up in your face again, politely suggest she should move her son's room. If she's still a bitch, just tell her to fuck off. If they are the crazy people, then chances are people are going to secretly nod in approval of your actions. Just make sure the cops don't get involved. Nobody wants that.",
            "Why can't she move her son's room? ",
            "Umm, the woman sounds unhinged.  I would write a letter to the property management company detailing the incident, without emotion.  You are not exposing yourself to her son, nor should you have to live as though you are renting a room in her space.  Proper documentation might help you if it escalates, which judging by her actions thus far, you might need to get a restraining order on her helicopter mom behind. She shouldn't feel free to harass a person in her own home or in the building.  ",
            "Tell her you have very in-depth dreams. There's no way neighbor can prove you're having sex with someone. Additionally, just play dumb when being questioned (which is also absurd-- don't feel obligated to explain anything to overly-controlling tenants nearby). Your new neighbors suck, so just play along. Legally, I don't believe there's much the spying/ border-line peeping-tom neighbors can do. At worst, check your lease for something about noise violation, but even then, you can play with regulations a bit. Best of luck!!!",
            "First of all, this is ridiculous. It is you *home* and no one should stop you from doing your own things within it. You didn't move into their home; you live in a frickin apartment complex. If they think it's endangering their son, they should move. They have no right to tell you how to live your sex life.\n\nTalk it out with landlord. Unless they are completely irrational, you should get the issue resolved soon.",
            "Honestly next time if she yells, record it. You could sue her for defamation, and of course speak to your landlord ASAP. ",
            "UPDATE",
            "I'd personally go power play and report her to Police for abuse/hate crime. \n\nThat's just me and my vindictive nature though. ",
            "Let her move out and buy a house if she has a problem noise that comes  with close proximity living. ",
            "Paperwork and evidence will save you.  Document everything.  ",
            "If she was that concerned, she'd  have already traded rooms with her son. ",
            "Calling the police for having sex in your own home?\n\nYeah I don't think you have anything legal to worry about. Crazy neighbors.",
            "You lived there first so it is entirely the parents responsibilty to move their son's room, not your responsibility to move yours. It's that simple. Your neighbors are idiots, to say the least.",
            "Hmm...11 years of reliable tenancy vs less than a month of whinger mum? \n\nGuess who's side your landlord will be on if you decide to complain first?",
            "The obvious things have already been said and I personally agree that your neighbour is a homophobic hateful bitch, but I'd like to offer some practical advice to calm things down because you will most likely be living next to this woman for the foreseeable future.\n\nSuggest to your landlord that some measures are taken to soundproof the connecting wall a bit better. Such as foam padding, a second layer of gypsum board, you get the idea. Get a quote from a cheap and reliable professional, offer to split the costs. \n\nThat's wayyy generous of you snd will confirm you're not doing anything out of spite. If your neighbour resists, she loses her right to complain ever again.",
            "She is being silly. If anything they should move their sons bedroom. Or place bookshelves to the Wall connecting to yours. ",
            "I don't understand all the responses here. I don't have kids, and even if it was a heterosexual couple banging loudly in the room next to mine, I'd have a problem with it. When you live in apartments with thin walls, you have a duty to try and keep quieter than usual to be respectful. You don't have a duty to just lump it and be understanding of other people's noise. What kind of crazy stuff are you guys doing that can be heard that loudly next door, and why can't you just lower the volume a bit or move out of multi-family housing? Lastly, unless you are best friends with the landlord, why would they side with the noise maker vs the complainant?",
            "Alright, I'm here for a little karma suicide, I guess...  \n  \nIs she in the right? No. It was not okay to talk to you like that. At the same time, I really don't think it's okay to just expect you neighbors to tolerate your sex noises. A lot of people are saying that the woman should give her son what I presume is the master bedroom so that she can listen to sex noises instead of her son, and I just don't think anyone here would actually do that. I think plenty of people here would be annoyed that their kid couldn't play in his own room because the neighbors can't turn down the sex volume. Haven't you people ever been teenagers? Quiet sex is a necessary skill.  \n  \nI'm sorry, but I really do think it's rude to just expect the neighbors to tolerate your sex noises and I couldn't just not say anything while all these people are supporting that kind of behavior. I know you are trying to be quieter, OP, but I don't get why it's impossible for you to keep it down. Everyone here is saying hearing your neighbors is part of apartment living, but so is putting effort into making sure your neighbors aren't disturbed by you.",
            "Your first batshit insane neighbour.\nWhat she is doing could constitute harassment but than again I'm not a lawyer. ",
            "Is moving your bed to a different wall in your bedroom an option? That might change things a bit. Otherwise, suggest that the kid can switch bedrooms with the parents.",
            "This bitch is crazy.. Who the fuck PURPOSEFULLY tries to interupt sokmeones sexy time to make them stop? Child or no child she is a rude ass cunt and she needs to get over herself. Why can't SHE move bedrooms? Probably because SHE doesn't want to hear it so she makes her child have that bedroom... ",
            "Contact your landlord/building manager and tell them your neighbors have been asking inappropriate questions about your sex life and harassing you in general (yelling, name-calling, etc...)",
            "Don't just talk to the landlord, insist upon filing a police report. That's harassment and defamation.",
            "She can't tell you shit. How old is this kid? I'm a parent of a 2yo who's very bright and attentive to her environment; if she overheard neighborsex I'd be like \"the neighbors must be playing their silly monkey games again!\" and turn on a fan. \n\nKids don't have strange, scary, cringy, tingly, confusing feelings from overhearing sex, unless they're about to enter puberty. This is the mother's issue. It probably turns her on and freaks her out. ",
            "Most people use a stereo on at the same time.",
            "I had a downstairs neighbor complain about sex and other things. She even tried to say I couldn't smoke on my balcony bc she was allergic to the smoke (she was not) and if I did not stop I would have to move. I informed the managment, they apologized for her and said to always inform them of any interaction because the tenants should not take matters into their own hand, and they informed her of the same. After that all requests went to them, and were quickly dismissed. They even offered to let her move but she refused. I think if you informed your management of the situation, and what they have done to you, they will give a similar response.",
            "if they can hear you having sex you are being too loud. you can fuck without your neighbors hearing. that goes for any activity. ",
            "I would complain to management before she does and if she comes over to yell at you, call the cops. \n\nThat and do some really kinky shit loudly enough that her stupid kid hears. What the fuck is wrong with people. ",
            "Call your building manager TODAY and let them know about her harassment/name calling. No delay, today!",
            "Yep.  She's a bitch.  If you aren't being REALLY LOUD, to hell with her.  Perhaps she should move her SON's room.  Talk it over with your landlord, get ahead of her, and have fun.",
            "Tell her you were there first.  If she doesn't like it she should move her son's bedroom.\n\nBTW - Are you free Friday night?",
            "Next time beat on her door screaming that they are breathing too loud.",
            "How to check if homophobia is a cause of this: if you're friendly with any straight couples in the adjoining rooms, ask them to have really loud sex and see if she reacts the same way.",
            "She has no right to tell you what to do in your own apartment.\n\nYou do have a responsibility to keep the level of noise reasonable, obviously. Try to be a little quieter during sex.\n\nYou don't need to move your room just because she wants you to. Ask her to move her son's room.",
            "Ahh OP you slut =']\n\nFuck them, tell her you were fucking in that room long before she moved in.\nIt's her fault he son is in the room, but she probably just jelly that you're getting some.\n\nThen you know, you could always comply, and start fucking elsewhere? The kitchen? Garden? Up against any adjacent walls?",
            "I mean.... it sucks having a crappy neighbor when you live in an apartment. Loud stomping, leaving garbage outside the door, parties, Christmas lights up until March. Whatever it is. A certain amount of apartment living requires a teensy bit of compromise. Are you a screamer? Tone it down. Is it the banging of a headboard? Put some foam along the wall. Compromise a little bit, then you can take the high road if she keeps complaining. Ugh, that sucks though. Shitty neighbors will make a person move faster than they want to (just remember that you are *their* shitty neighbor). Good luck.",
            "You're both in the wrong, keep it quiet, it's not hard. I doubt you're even trying.",
            "Talk to your LL. Sounds like you're cool with him. \n\nOnce that's done, tell her to metaphorically eat shit (obviously be nicer than me). ",
            "Puffy this lady is nuts, why doesn't she and her son switch rooms??",
            "If she keeps on doing what she is doing you can probably get her for harassment. Keep a record of what she does (audio recordings, hand written notes of dates and times that she has bothered you along with some quotes of what she has said, police reports for if she really doesnt leave you alone).\n\nShe is giving you more of a reason to call the cops than you are giving her. \n\nI actually wonder if the landlord can take action as well if he is notified and calling the cops doesnt work.\n\nAlthough, from my experience, one cop call can be enough to scare crazy neighbors into leaving people alone. I hope thats as far as it will need to escalate. \n",
            "You need to contact the landlord about this before she does. I don't mean later tonight, I mean now.  You need to get there ahead of her since she is already shown herself to be crazy. ",
            "Good fences make good neighbors",
            "I am not sure if anyone has brought this up but if she comes to your door again in a similar manner do not open it. You can politely tell her to return to her place and if she continues to bang and make a scene then inform her you will be calling the police is she does not. The last thing you want is to get into a serious argument with her in the hall. She cannot make you switch rooms and as far as I understand, if it is the daytime, you can pretty much be as loud as you want without any legal repercussions. There are obviously exceptions like if you were be over the top loud (screaming all day) but the only real issue would be one with the landlord. ",
            "Record your next interaction with the mother, so you have evidence of her harassment. Recommend she buy her son headphones, or move his bedroom, as the noises will continue.\n\nAlso alert your apartment manager pronto",
            "First off I would start keeping records of these interactions with her, a voice recorder would work fine. In case she decides to go batshit and start making stuff up to tell the police, having it on record would help you out immensely, because she already sounds kind of insane as it is. Second, tell her to move her sons ass out of that room if she doesnt want him to hear anything. She has absolutely no business telling YOU what to do in your own apartment. Youre not in the wrong here Lastly get in contact with your landlord before she does. Personally I think this is just the start of your troubles with her, people like her tend to do everything in their power to make your life hell. ",
            "If it's a 1br apartment what exactly are you supposed to do about the placement of your room?  Seems like *they* can move their bedroom next to yours and the kid's bedroom into the one they originally took for themselves. ",
            "lol have louder sex\n",
            "So why doesn't she move her son to another room? Is there literally no other room in the apartment that he can sleep in? Presumably his parent(s) are sleeping in a different room so why doesn't he switch rooms with them? This seems like such an easy fix.",
            "[removed]",
            "Immediately go to your landlord. She probably already complained and is building a case and you have no side to your story. Fill them in.\n\nAnd keep them updated. On everything.\n\nAsk them what you should do it she confronts you again and look for other neighbors who you do get along with and you can get people to vouch for your good tenants.",
            "I'm surprised you'd even feel obligated to give this matter any more of your attention...lol...tell her to eat a dick and buy her son some headphones if she's all that concerned.. not your problem at all!",
            "Maybe blast your stereo every time you do it...day or night.",
            "have an orgy just to establish dominance.\n\ndrank me.",
            "why they don't move theirs\n",
            "I think you've got good advice already, so I'm mostly reiterating to be proactive:\n\n1. Talk to your landlord about this before your neighbour does, and\n\n2. Make a report to police too, before your neighbour does; you don't have to allege harassment or any 'crime', just that she's screaming at you and accosting you in hallways.",
            "Get a restraining order. You feel threatened. Problem solved.",
            "You might want to explain to her that it would be much more beneficial for her to switch rooms with her child instead of placing the responsibility on you.",
            "child endangerment is a thing in most every state, but what you are doing in no way qualifies. "
        ]
    },
    {
        "post_id": "4lyc9a",
        "author": "cheekyhotchickenroll",
        "title": "I [18 F] left my laptop open and my sister [15 F] replaced everything in my \"Hobbies & Passions\" section on my resumé with just \"garlic bread\" as a joke. I unknowingly sent it out to about 20-30 businesses and now I have no idea what to do about it.",
        "url": "https://www.reddit.com/r/relationships/comments/4lyc9a/i_18_f_left_my_laptop_open_and_my_sister_15_f/",
        "score": 3677,
        "num_comments": 691,
        "created_utc": 1464738884.0,
        "selftext": "Yes reddit, I know how hilarious this sounds and I promise you this is not a joke as I am genuinely freaking out right now. I am soon finishing up secondary school (high school) and I'm looking for my very first job for the summer, so when I was filling out my resumé I didn't have a lot of experience to mention so I decided to do a hobbies and passions section, taking advice from others.\n\nI (stupidly) left my laptop out on the kitchen table today while I went to the shop to get some tea, and my gobshite of a sister thought it would be the joke of the century to delete my hobbies & passions section and replace everything with a single bullet point saying \"garlic bread\".\n\nNow, I had closed the Word Document, saving it, before leaving. She opened it, changed it without telling me, and saved it and closed it before I came back. She knows bloody well that I'm looking for jobs at the moment and she knew I'd spent the afternoon working on my resumé.\n\nI came home with the tea anyway and since I was happy with my resumé (I didn't bother to recheck it, I had no idea someone would change it to \"garlic bread\" while I was gone) I sent it to multiple job applications from an online hiring site, which had places hiring in my town. I'd say I sent this garlic bread resume to about twenty to thirty institutions in total.\n\nIt was only after I sent them that I decided to re-check my resumé, when I noticed the horrific alteration. I am absolutely mortified. I immediately confronted my sister about it, getting a strong sixth sense that she was the most likely culprit, and she thought it was fucking hilarious. She literally laughed until she cried while I was standing there nearly crying from stress and mortification.\n\nMy sister has always been a joker and she gets away with bloody murder, but this was so serious. I am sick of her pulling off this shite to everyone around her, thinking it's funny or cool or something. It was only when I explained to her the full seriousness of the situation, and that I had sent it to 20/30 places, that she copped on and apologized. Not sure if she was being genuine but the words \"I'm sorry\" definitely left her mouth.\n\nThen she had the audacity to blame me for it, asking me why I hadn't checked it before sending it off. I screamed at her that I had checked it multiple times before leaving to get tea, and didn't expect anyone else to change it while I was gone. She then back-pedaled and insisted that she meant it as a joke, like \"just a prank brah\" mentality but I'm having none of it.\n\nI don't know what the hell to do now and rectify the situation. I have never job hunted before, I don't know how serious this stupid mistake is. I live in a large enough Irish town but small enough for businesses to spread gossip, so I'm terrified that they'll all now know not to hire the \"garlic bread\" girl. Should I email the places I applied to explaining the situation, or will I sound like a complete knob?\n\nTechnically, it IS true that garlic bread is a passion of mine simply because it's delicious, but obviously it is not resumé-worthy. The businesses probably think I'm taking the piss and it's extremely unprofessional. I'm so annoyed that this is my first impression in the working world, I'm not even hired and I've fucked up already. Should I resend them my application with my resumé fixed? Should I move on and forget about the places I applied and apply to new businesses with a rectified resumé? Should I just fucking move town at this point since I've clearly made a fool of myself already? Also, how do I talk to my parents or sister about her stupid spoilt bratty behavior?\n\n\n   \nTL;DR: My little sister changed my hobbies and passions section on my resumé to \"garlic bread\" as a joke and I sent it out to about 20/30 business in my town unknowingly. I have no idea how to fix this.",
        "permalink": "/r/relationships/comments/4lyc9a/i_18_f_left_my_laptop_open_and_my_sister_15_f/",
        "comments": [
            "[deleted]",
            "Hiring manager here. Considering you're 18 and applying for (assuming) retail, fast food, customer service type of jobs - no one is going to disqualify you for the garlic bread. If anything, it may have the opposite effect. Maybe it'll make someone laugh and intrigue them enough to schedule you for an interview despite your lack of experience.   \n\nHiring managers look at dozens upon dozens of resumes a day. A professional resume is great...but chances are it's generic and something we've already seen a thousand times. Uninteresting. (Again, speaking given your age and lack of experience).   \n\n\nDon't bother emailing an apology (it won't matter). Ride it out. You'll most likely get a call back for adding humour onto your resume while the 100 other resumes all read the same.  ",
            "Only give your sister garlic bread for Christmas and birthdays (it is your passion after all) until she makes it up to you.",
            "This is a good lesson for both of you with a very light penalty. \n\nAt 18, the jobs you would potentially be getting are not going to have a long term consequence. \n\nThe lesson for you:\n\nMake sure to *always* check your resume before sending it in for a job. \n\nWhen I was applying for career positions, I applied to 100+ jobs, and I checked my resume rigorously every time. Also, make sure you *tailor* your resume to the job at hand, don't just send in the same one for every job. \n\nFor your sister:\n\nYou need to talk with your folks and your sister about what things are acceptable to mess with, and what aren't.  \n\nShe is grown enough to know at this point that you don't play a prank with things such as jobs. This is a lesson she needs to learn now, rather than later.\n\nOne of my friends from college had this experience with his girlfriend. As a \"prank\" she put in his resume that he was part of a well known American hate group. \n\nHe lost a chance to interview for a position at a prestigious organization he had been recommended for because of that, and it changed his career path. ",
            "I once included the sentence \"I enjoy being mentally challenged\" on a resume. I meant I like to figure stuff out.",
            "> I don't know how serious this stupid mistake is.\n\nAt 18 years old looking for a summer job, not very.  I know you're frustrated, but other commenters here have given you excellent advice as to how to proceed.  \n\nHonestly it is pretty funny.  I promise you will look back and understand that in the grand scheme of things, it's not a big deal...you may even laugh about it (maybe).",
            "*Technically, it IS true that garlic bread is a passion of mine simply because it's delicious, but obviously it is not resumé-worthy.*    I don't really think any \"passions and hobbies\" are resume worthy so \"garlic bread\" is about as good as \"reading, acting, volunteer work.\"  I think if I, as a personnel officer, saw garlic bread as a hobby on an 18 year old's resume, I might be curious but not condemning nor would I reject the applicant for the peculiar hobby.",
            "Plot twist: OP corrects the resume and new version has replaced \"garlic bread\" with \"garlic toast\".",
            "Fortunately the hobbies and passions section is the least important part of the resume.  It's embarrassing, but a lot of people might not notice, especially if the rest of your resume is solid.  It's not goofy enough that anybody is going to gossip about it, probably, so even if she's shot your chances at some of those jobs (which, unfortunately, is not impossible) those managers aren't going to spread the word to anybody else.  It's not interesting enough.  \n\nI wouldn't bother reapplying with a fixed resume, it might just draw attention to the original mistake if they didn't notice.  If they did notice, you'll still look inattentive and sloppy, so it's not worth it IMO. \n\nHowever, in my opinion fucking with somebody's job applications is serious fucking business and your sister ought to get that lesson from this.  She absolutely intended for you to not notice -- I can't see why else she'd save and close the file like nothing happened.  Password protect your computer. Don't accept her shitty half-apologies.  Tell your parents. If they don't take her \"pranks\" seriously, there's not a lot you can do, but if it were me I'd be frosty with her for a really long time. ",
            "[deleted]",
            "Everyone else has given you good advice about the resume.  Mine is:\n\nPassword protect your computer.  Password protect all your stuff, because you sister's \"jokes\" don't sound funny.",
            "I recently hired a women with a clever section of her resume, titled \"Things I Do Well\". Among her technical skills were nestled creative and chuckle-worthy entries such as \"Dress Myself\". Now, this was for a design position, so I appreciated the humor immensely and loved that she set herself apart from the competition. There's a chance you could encounter a similar situation with a local hiring manager. Take it in stride this time, and don't be afraid to make light of it. \n\nBut definitely lock your computer or check all important files next time! Good luck!",
            "[deleted]",
            "Get prepared to talk about how much you find garlic bread delicious in potential interviews.\n\nIn terms of the places you've sent it to, I'm on Team Let It Be. I think the absurdity of having \"garlic bread\" as your singular interest is potentially intriguing. And even if that comes across as a negative, the message of \"sorry for sending out my resume without quadruple checking it\" would come across much worse.\n\nAnd, look, you haven't ruined anything. It's not like every business in a thirty mile radius will hang your photo up on the wall in HR saying \"Don't hire this woman - cares too much about garlic bread.\" Most won't even see it. Most who do will chuckle. The few who think it's unprofessional won't remember your name next week.",
            "On the positive side, it's likely you are safe from Vampire employers now.",
            "Go round to the businesses with a new resume and some fresh garlic bread.\n\nBut really just consider the percentage of potential employers who received it in the grand scale of things.  It's tiny. Just use the motivation to continue applying/sending out resumes.",
            "Remember the girl who accidentally sent a hiring manager a picture of Nicholas Cage instead of her resume?\n\n\nNo telling how this will shake down - maybe it'll make you get noticed, maybe not - but as you're only looking for a summer job, not a career, at least the consequences are relatively low. Good luck in your job search.",
            "[deleted]",
            "As far as I know most résumées are skimmed trough, so if a business did not hire you it is most likely not the garlic bread.\n\nIf you are asked to come in for a first meet and the garlic bread comes up, you have a great selling point. Either if you tell the truth or be a garlic bread connaisseur.\n\nI dont know how the job situation is in Ireland, but if it is dire just resent it with a note saying the last resumé was faulty. \n",
            "Reminds me of the time my roommate added \"bitch\" after every \"you\" in one of my term papers. Followed by an interesting convo with my dean.",
            "No one has given you the right advice anywhere in this thread... here's what to do.\n\n1. Make 30 loaves of garlic bread... and don't half ass it. Show your commitment here. They need to taste your passion, your dedication to the craft.\n\n2. Print business cards with your contact information... same font and style as on your CV.\n\n3. Deliver fresh, hot, incredible smelling, melt in your mouth garlic bread to each company and make sure that you hand deliver it to the hiring manager along with the business card.\n\n4. Let the manager know that if hired, you'll bring the same level of passion and the same commitment to excellence as displayed in the garlic bread.\n\n5. Profit.",
            "Did you apply to any Italian restaurants?",
            "\"Hmm, solid education and degree from respected university...relevant work experience with references...and apparently loves garlic bread.\"\n\nHonestly if I were reviewing your resume, the garlic bread would probably get you an interview provided the school and work exp checked out. ",
            "You are going to give your sister garlic bread for every birthday and Christmas for the rest of your life.  Payback is a long con.",
            "You sent out your resume as a .doc/.docx file? Why not .pdf?",
            "Truthfully as someone who stares at a lot of boring, tedious, annoying, similar (sorry I sound horrible) resumes, all the time, I would LOVE to see something funny like this- and might actually reach out to you because of it! I am in a C suite position in a technology company and if the rest of your resume was ace, this wouldn't change a thing. So relax. Garlic bread is BOMB!\n\nMeantime, passwords. Good luck finding a job sister :) ",
            "This is the most Irish post I have ever read.\n\nAs soon as I read \"gobshite\" I knew you were Irish OP!",
            "Passions and hobbies shouldn't be on your resume anyway.",
            "Other people have given you good advice how to fix it since you already have. So here is a tip for the future to prevent this from happening again:\n\n*Always* check your resume one last time before sending it out to each job you send it out to prevent this kind of thing or something similar from happening.",
            "My resume got noticed for a great job because I wrote Harry Potter fanfiction under hobbies. Granted, it was a job related to working with kids, so it wasn't off the wall.\n\nI've heard of worse stories than this, so I don't think your future prospects are tanked. It's really crap of your sister though. ",
            "Now I want some garlic bread. \n\nDon't worry about it, your resume is fine. Garlic bread is pretty low on the list of things you don't want on your resume. It shouldn't be on there, but it'll probably be fine anyway.",
            "Nobody looks at the hobbies and passions section anyways, except for maybe at your interview to chit-chat.  It was an awesome joke, fist-bump your sis, and be confident you'll get job offers based on the strength of your professional qualifications, not on your hobbies.  \nI know it's a tough job market, but that's actually in your favor here- hiring managers are just looking at education, experience, and previous position(s); not even your name, and definitely not your hobbies.",
            "As someone who used to do hiring for a small financial office, I would be far more intrigued by \"garlic bread\" than one more rundown of Morman missions abroad or those stupid \"went to Haiti for a week to \"volunteer.\"\"",
            "I would like to double down on what your sister said. This was very funny and you should check your resume right before you send it.",
            "[deleted]",
            "If you do get an interview, bring them some homemade garlic bread.  Play into the passion.",
            "Apply to olive garden? ",
            "Your sister was seriously a dick for doing that, but she might have done you a favor.  I have a couple of things on my resume that have absolutely no bearing on my field but get me interviews because they make me seem a little more relatable and interesting.  I know this because employers have specifically said it's what made them bring me in.",
            "I wouldn't worry too much about it. It's not like she changed it to something outrageous like \"Kicking Puppies.\" Look at it this way, if a potential job asks you about your garlic bread obsession, you'll know they actually read your entire resume.",
            "Shit, I'd interview you based on how that made me laugh... and bring some garlic bread.",
            "I used to manage my university's bookstore and would often interview and hire 18-20 year olds with little/no work experience who had sections like that on their resumes. I wouldn't put that on my personal resume now because I am older/have real experience to take up that space on the page. BUT, when I was hiring kids for those starter jobs, if there was a section that had garlic bread listed a bunch of times, I would've thought it was hilarious. I definitely would've called you in for an interview and asked you a question about garlic bread. I personally am passionate about pizza and my design portfolio says j am pizza aficionado and my logo is pizza-related. People love that about me because it makes me memorable and is part of my branding.\n\nYou'll be fine. If the people looking at your resume have a sense of humor they'll think it's funny. If they don't, they won't. If you get asked about it in an interview, make a joke about your sisters prank but that you really do like garlic bread. Change your resume back and send it out to other places.",
            ">Then she had the audacity to blame me for it, asking me why I hadn't checked it before sending it off.\n\nNot right, but not wrong either. ",
            "A/B test it. Explain politely and resend correct version to random half the businesses, and leave as garlic bread for the others. Report back.",
            "Take some fresh garlic bread to the interviews. 10 minutes into the interview, take a piece out and start loudly munching on it. Offer some to the interviewer.",
            "I'm a hiring manager in the UK and have done recruitment for a bar/nightclub in a previous job. This would probably intrigue me to invite you to interview, so long as the rest of your CV matched the requirements. \n\nAnyway, here's my advice: Own it! Spend a bit of time online doing some garlic bread based research and try some different breads from local shops/restaurants and write a blog or something about them (it doesn't have to be anything major). That way, you either get someone who's interested and you will be able to show an above average knowledge of garlic bread or you won't be asked at all and they won't care. The important thing is that your prepared if the question does get asked. You will look worse if you can't offer a few facts about garlic bread. Also, it's a good opportunity to make a lighthearted joke about teeth brushing or vampires. Interviewing is not just about experience/knowledge, it's about getting to see someone's personality and if they are going to be a good fit for the company. A sense of humour is a very important trait. \n\nAt 18 and fresh out of school, you won't be going for any job that would look down on you for this (at anywhere you would want to work), your sister might actually have helped you stand out from the crowd too. \n\nPersonally, I wouldn't email all the companies saying it was an error because your sister (despite her faults) is right about checking things before sending them. \n\nAnother piece of advice is to export your CV as a pdf, which looks more professional and is not as easy for pesky siblings to edit! You can easily do this on Word by hitting 'Save As' and then choosing pdf under the 'Save as type' drop down box.\n\nRegarding your sister, have a heart to heart with her about privacy and boundaries. It is important to explain that you understand it is a joke, but she has put you through a lot of stress and possibly made your life more difficult as a result. End with a sisterly hug and then tell her she owes you some garlic bread as 'punishment'. You can even look up a recipe and make some together for some bonding. ",
            "One advice is that, ALWAYS send your CV in PDF format. Never in word format. The benefit is that some of the font faces or formatting that you do on word will not be shown in the same format across all computers. PDFs solve that issue.\nThe other benefit is that obviously it cannot be edited (that easily) by someone else.",
            "Could be worse. She could've wrote 'fuck you'  right in the middle of it. \n\nHonestly, I hire people and I would never even look at hobbies and passions. And would actually think it's a silly thing to add. I might also like someone who wrote garlic bread. \n\nThe bigger issue for me would be that you sent out something important without a final look over. ",
            "I fucking hate pranksters.",
            "Please tell your parents btw. She needs to learn where the line is between a prank and screwing up someone's life.",
            "I don't know why people think this is funny. This time it's just a resume, but what if she thinks it's so funny that she'll do it again to something more important? ",
            "Hiring manager here. We once gave an interview to (and actually hired) a kid who used tiny hammer icons instead of bullets on his resume. He was studying mechanical engineering school and the hammers were a conscious design choice on his part.\n\nI know this seems like a huge betrayal from your sister, but resume reading is a crapshoot. The advice thrown at you about being professional, using action verbs, having a synopsis, etc... that is all very generic advice. The stuff that will not offend the largest group of people. But the truth is that the reader is the only person who matters and you can't predict individual human beings. For someone as young as you looking for summer work, don't sweat it.",
            "can you get your parents to punish the little shit?",
            "I would first laugh at it, because it's kinda funny.\n\nAnd if they don't hire you because you like garlic bread, why would you even want to work there? Who doesn't like garlic bread? ",
            "It's 5:30am and I'm laughing so hard. As the owner of a company, I'd definitely ask you to come down for an interview. ",
            "I think your sister probably improved your resume. Seriously.  Don't contact anyone with a revision. People might think you have a sense of humor.  ",
            "Your sister's a brat but you're gonna look back on this and laugh after the 300th perfectly formatted and professional resume you email out into the void from which no response will ever return. Job apps at the entry level are machine gun, not scalpel, and this isn't a huge disaster (besides which, you should see how bad your competitors' resumes get with no help from bratty sisters at all)",
            "My apologies, hiring manager, I mistakenly sent you the wrong version of my resume. Here is the correct version.\" Don't bring up the garlic bread thing unless they bring it up first, in which case you can explain it was a joke that was mistakenly sent out.",
            "don't put \"passions & hobbies on a resume.\"\n\nthat said, if I did have to write them out, I would think it was funny & would use it for mine.",
            "Based on your style of writing I'm going to guess you live in Ireland. First things first - this is hilarious! You might not think it now but trust me, anyone who reads this will get a laugh out of it and it may even work in your favour. \n\nI do however suggest that you follow up with the 20/30 companies that you contacted with an email along the lines of...\n\n\"Hi <Name>,\n\nIt has come to my attention that I recently applied for a job at your company with a tampered CV!\n\nUnbeknownst to me, my little sister, in her infinite wisdom, decided to change my \"Hobbies and Passions\" section to only include \"Garlic Bread\". This is quite upsetting as if she really knew me well she'd know that my main passion is for hot chicken rolls (although garlic bread is pretty great!). \n\nIn all seriousness though, many apologies for the dud CV. My real passions are X, Y and Z and I'd love to have the opportunity to come work for your firm this summer. \n\nBest wishes,\n\n<Your Name>\"\n\nAs someone who hires people on a regular basis I get bored senseless by the majority of the CVs I receive. Being original and standing out from the crowd is hard... Embrace the mistake, own it, laugh about it. You'll be fine!",
            "Hopefully at least some of those potential employers include Italian restaurants. I wouldn't worry about sending an apology or anything. Password protect your computer, send out another 30 resumes and move forward. ",
            "No worries. You're 18 and nobody cares about your resume. ",
            "No resume should have a hobbies and passions section.",
            "When I was in grad school, I applied for an internship and in the cover letter I mistakenly put the wrong company's name... I never thought I'd hear from them again. But they called me in for an interview anyway and I got the internship. It's not the end of the world and there have been worse mistakes, so don't feel discouraged!",
            "I once sent out a resume for a security guard-type position that said I had \"excellent customer service kills\".  I was mortified.  I did not get that job, but I got something soon after and it's something I can joke about now! ",
            "Hi! I used to write resumes professionally....you would be surprised how many people suck at it.\n\nOne thing I started doing was in the \"Skills & abilities\" section I would add \"Able to leap tall buildings in a single bound\".  A lot of employers admitted they gave my clients an interview because of that one line...some of these were fancy-ass corporate positions.   The garlic thing IS hilarious....it makes your resume stand out! \n\nI wouldn't sweat it...any place that would specifically not give you an interview because of that one detail isn't a place you probably want to work, anyway. ",
            "Depending on the sense of humor of the companies it might work in your favor. My husband used to list \"Can tell the difference between butter and I can't believe it's not butter\" as well as \"Can do like 5 push-ups \" on his resume and at least one long term employer he had called him in for an interview because they found his resume funny and different.  Don't freak out yet, it might not be that bad!\n\nHe works in IT.   Results may vary by industry.  ",
            "Honestly, with you being 18 it's way more forgivable.  Employers barely even look at your resume anyway, assuming you're applying for entry-level retail jobs and the like. ",
            "You've gotten good advice. I think it might be enough to get someone to take a second look at your resume. Regardless, you have to do an update later and let us know 1) how many interviews you get from those companies, 2) if anyone brings it up, and 3) if you get a job from garlic bread resume. ",
            "You fight Fazoli's and Olive Garden against each other to drive your salary into the stratosphere.",
            "I would redo a resume and change the hobbies section to involvement and achievements and list awards or sports or clubs or volunteering you've done. Hobbies don't really have a place in your resume. \n\nHave that ready and multiple copies printed if you happen to get an interview. Hand it out at the beginning stating exactly what section has changed and maybe add why if they seem to be good sports. If not just say you noticed an error. \n\nIf you get no interviews or calls within a week, send the hiring team or person a personal email with the corrected resume attached with a short message introducing yourself and explaining why you are sending the email. If there is no person or hiring team listed on the ad just call and ask who is handling the applications or if you're local drop by with a copy of the new resume in person. You don't have to do that for all 30 just the ones you are most interested in pursuing. ",
            "I hope you know a lot about garlic bread for when they ask you in interviews",
            "It's a gamble but you could make this work to your advantage. Email them again: dear so and so. I recently sent you my resume in application for x position. Unfortunately, my sister thought it would be funny to replace my interests with \"garlic bread\". While garlic bread is indeed delicious, I'm also interested in x, y and z (list interests relevant to that position). I'd love the chance to talk to you further about this position!\n\nAt least you'll be giving them a memorable story, drawing attention to your resume in a positive way, and you can't exactly make things worse ;)",
            "Another hiring manager here! You'll be fine. I would actually assume garlic bread is something you're seriously passionate about and I would bring you in for an interview *because* of it. It's not a generic \"look at how great I am\" answer, but it's honest and it gets me curious to know you, which in turn makes you a more interesting candidate.",
            "Does your sister often forget to log out of Facebook?",
            "Wow your sister needs to learn that this was not okay.",
            "Not gonna lie. As an employer, if I'm hiring for an entry level role and a resume makes me chuckle by having garlic bread in hobbies. They are at least going to get an interview. \n\nI appreciate originality. ",
            "I'd suggest to your parents that your sister be required to give you her allowance until you succeed in finding a new job.\n\nShe needs to learn that her actions could have ruined your ability to make ends meet. ",
            "I have no advice because Garlic bread *is* a hobby of mine. I'm quite insulted you don't think it is!!!\n\n\nNo, in all seriousness, this is something you will laugh at it in 5 years but for now I would take the time to research into the companies you've sent it to and then tailor a quick resend of your cv with an email explaining there was a mistake. \n\nI say research because if the company have a website that seems quite casual/ funny then you can explain it away with a joke but if they are a serious company then you can send a sincere apology for the mix up. ",
            "I once sent out a batch of resumes with the first heading \"Ecudation\". \n\nIronic as it was, I never got any calls. I suspect you'll be fine though, everyone loves garlic bread ",
            "Yes, to reiterate, you'll be fine. One day you'll look back on this and have a good hearty laugh. Your sis is a gift, be thankful for her. There's millions of opportunities out there and you're a young pup. ",
            "The hobbies and interest section is just filler anyway, it's pretty meaningless. Wouldn't worry. If anything subverting it with a joke might actually improve your chances.",
            "You should really just print off your cv and go around to every where you want to get a job. Realistically at 18, youre looking for a job in super value or penny's. Make sure you speak to the manager, half the time that will be the interview and you may get the job there and then. ",
            "If anybody ask about details, you'll tell a small social activity group which called a garlic bread, for example some friends test&try new restaurants every week. It's not a big deal. :)",
            "no one cares about the hobbies & passions section",
            "Once I put the completely wrong \"available from\" dates on a cover letter - these dates were pretty important (a very temporary summer research position they needed someone for ASAP) and I was invited to interview but then I realised I had to explain I wasn't available until after that and realised this could have been at the detriment of the interview.\n\nI was going through some important and stressful exams at the time, and I noticed the dates were wrong after looking at expired orange juice in my fridge that had moulded (don't ask how this made me realise).\n\nIn a moment of sheer madness, I don't know what came over me, I messaged them with \"I am very sorry to report that I am unavailable for the previous dates, I mixed up my timing. I only realised this when looking at a carton of mouldy orange juice.\" As I said, I don't know what came over me, I think the exam madness had fried my brain.\n\nThe guy emailed me back and said he really wanted me to come in for an interview anyway. When I got there, he said that the orange juice story had made him laugh so much that he couldn't *not* interview me despite my start dates being unideal. He commended me for my ability to have a sense of humour and said he wanted his recruit to be a sociable person who he'd get along with. He'd even put the email up on the wall and shouted to everyone in the office \"hey guys! Orange juice girl is here!\". \n\nSlightly different situation to yours but people in recruitment probably still have a sense of humour- they're humans too. Considering that was not a part of the resume they really cared about, it may even do you a favour and make you stand out. ",
            "I would take this as a lesson that you should lock your screen when away from your computer , and not to leave your laptop in public areas. \n\n\nMaybe you should print out your resume and try to apply in person.",
            "If you want her to appreciate the gravity of the situation, just before she needs to hand in a batch of school work, tell her that you've added the phrase \"teachers are dumb shits who are too fucking lazy to read all the essays.\" \n\nThe truely evil part is don't actually do it, just tell her that you have. ",
            "I wouldn't say the blame is on you, but you should have checked your resume before sending it out to each company. It's not uncommon to tweak your resume to match the requirements and highlight your assets for each job. ",
            "You shouldn't have a Hobbies and Passion section on your resume",
            "Any chance you sent your resume to pizza hut and papa johns? Because that might help ",
            "I want an update of this when you got the job. ",
            "I would be pissed as hell but don't sweat it. One of my friends had \"shit\" as a typo in his and the hiring manager thought it was hilarious so he called him for an interview. He's been there for 10 years or so. ",
            "Your sister is kind of hilarious.\n\nYou're 18 and none of the jobs you get now will matter anyway. Which is why you're even putting silly nonsense like a \"hobbies\" section in your resume to begin with.",
            "First of all, remove Hobbies & Passions from your resume all together.  No one cares about that.\n\nSecond of all, I would say you have a 50/50 chance they'll see it as humorous, and it might actually work in your favor with the right person.\n\nLastly, let your sister know this was not okay and she needs to never do something like that again as it is potentially damaging your future and potential career.  I would say it would be worth it to mention it to your parents depending on how she reacts to you calling her out on it.",
            "Am I the only person that prints their resume to a PDF? Because that's the only way I know 100% that it will look like what I want it to.",
            "I would send a revised version. If they question say you used the phrase as a place holder on the first draft. By saying your sister did it. I would and maybe some employers would question how you handle pertinent things in the future. With HIPPA many employers can and do get squirrelly with private info. \n\nThat being said it's not the end of the world could be worse I had a friend that her ex edited her whole resume to make her out to be a prostitute then sent it to job sites. \n\nAs for your sister I would sit down and talk with her and tell her if she wants to be accepted as an adult she needs to learn to become one. This includes admitting to mistakes and making apologies when necessary jokes or no. \n\nThough honestly food is a good conversation point it may just open a conversation for you as an ice breaker. \n\nGood luck job hunting.  ",
            "I know this doesn't help you now, but for future reference, you should probably save it as a pdf/print it and scan it in as a pdf and send that out instead.  Sending a Word formatted resume is a bit tacky.  ",
            "Now I'm hungry for garlic bread.",
            "My resume had an interests/hobbies section wherein I described myself as a \"Neutral-good sorcerer,\" my D&D character at the time. \n\nMy boss told me it was what made my resume stand out, and now I have a great job. \n\nI wouldn't stress. And personally, I'd take a second look at a resume that mentioned garlic bread. You're right, it's delicious! \n\nMoving on to your sister. You mention that she's a joker and gets away with \"this kind of stuff\" often. She's 16, and getting to the age where she should be facing more consequences for her actions. Not everything is a joke. Please talk to your parents about this and let them know that you're tired of this being the case. It'll be up to them to levy consequences, but in the mean time, you can take steps to protect yourself from future pranks by keeping your personal affects in a private place and letting her know you don't trust her anymore. ",
            "Don't think this is very serious. I hate resumes with a bunch of bullshit filler about hobbies, it always sounds so put on. This could actually be a positive in some cases.",
            "That is hilarious.\n\nI would probably follow up with them with an email saying something like, \"Thank you so much for considering my resume. I realized after the fact that my younger sibling decided to change all of my hobbies and passions to \"garlic bread\". While that's not entirely wrong (because who doesn't love garlic bread), my other interests include _____, _____, and teaching younger siblings which pranks are appropriate. If hired, I will definitely bring garlic bread to share.\"",
            "At least you had the right phone number.\n\nBesides, everyone likes garlic bread.",
            "I mean if you applied to an Italian restaurant , it might work in your favor ",
            "Why does your resume even have a hobbies and passions section? That seems really odd and unnecessary to me. Is it because you don't have any work experience or something? Not saying it's wrong, I've just never heard of anyone doing that and it goes against most resume guidelines I've seen/used.",
            "Honestly I think she saved you. Saved you from the greedy corporate world. Just sell everything. Buy garlic bread and live man.. Just live",
            "Making lemons out of lemonade, since it's already out there, now would be a good time to research some kickass garlic bread recipes.\n\nThe Hobbies & Passions section is generally an icebreaker for conversation anyway. Might as well come prepared with some fun garlic bread ideas, anecdotes, and maybe some unconventional tweaks.\n\n\"Well, sure, you can make an excellent American Standard garlic bread, but why would you when we have so many options? For starters, use an Icelandic butter. Only fresh herbs. I prefer basil myself, but some prefer the more traditional oregano. If you're pairing with capers, perhaps a dill. The trick is making sure you've got a nice even spread as it is the melding of flavours that makes garlic bread such a wondrous dish.\"\n\nUse a hand puppet of Remy from Ratatouille to really sell it.",
            "Lesson learnt. She cannot be trusted but at 18 the world is not coming to a grinding halt. If anything as an employer and I used to get a lot of people your age if I see that on a CV I would have a giggle and add them to the list. \n\nNo one cares about your hobbies and passions. 'Passions' should never appear anywhere on a CV/resume. Employers at this level are looking for people with their head on straight and who will basically just turn up in the first place. \n\nWhen you get interviews and they ask you about garlic bread be honest and say your sister changed it for a joke. They will probably want to interview her as well. ",
            "Have you told your parents?  What did they have to say?",
            "If I got this resume I would bust out lauging and interview you.",
            "I once said, \"meowever\" instead of however in a cover letter. To this day I don't know how it happened, but the company got a good laugh from it, and I got a job. If you are truly worried, just resend your resume and say it is an \"updated edition\" as that will be the one they look at.",
            "They have resume formats online. They don't have \"hobbies and passions.\" Why? \n\nTry putting hobbies and passions into skills or experience where they belong. ",
            "If this just happened, I would pick a few places where I really wanted to work and had a shot at experience-wise, I would call the company and hopefully you speak to a clerk/assistant or something. Explain the situation and see if someone can help you out in making sure the correct resume gets where it needs to be. This is something that could garner sympathy, and might make you stand out in a \"she must really want this job\" sort of way. You're in high school - taking the initiative to own up to this is going to look good. If you do nothing I think you seriously risk being seen as a non-serious/waste of time applicant. ",
            "Send out very professional emails explaining what happened and attach a corrected resume. It will be one more way to get in front of recruiting managers. You will have corrected the issues. It's funny! I hope this plays out well for you!\n\nWorse comes to worse keep applying. It's not arms and legs. ",
            "Nobody has mentioned this yet, and I am also a bit of a jokester with a close older sister at about the same age difference as you too, so perhaps this applies to your sister as well. \n\nYou are transitioning into adulthood, applying for jobs, and all that business for the first time. It sounds like your sister is, in her own way, expressing her worry that things are changing - and the possibility that you will leave her soon. Is it mature? Of course not, but I wasn't mature as a 15-year-old either - especially with my more responsible older sister around who played that role for most of my life.\n\nI would definitely talk to her to try and give her context for why messing with your resume is unacceptable, but also keep in mind that she may be acting this way because she is afraid of the uncertain future and the possibility of you leaving or changing. She will have to accept this of course, but if you are close, I think she would appreciate it if you assured her that while you may be becoming an adult she will always be your younger sister and your relationship will not change; and that if she's lonely, she only needs to talk to you about it.\n\nHave an open talk - you might even say, \"break bread\" with her. ;)",
            "Relax, your sisters a dick but if you don't even bother to adjust your cover letter +resume and stuff to each company, chances are you are not gonna get hired anyway",
            "Never leave your computer unattended and not password locked.\n\nOther folk had good advice.\n\nOn some future day, you truly might look back on this incident and think it was pretty funny.",
            "The goal of a resumé is to get you in front of a live interviewer. Although having your hobbies and interested listed only as \"Garlic Bread\" might not be ideal, it is, honestly, hilarious; and it may well get you some interest from interviewers that want to meet the person with the quirky sense of humour. I'd suggest to you that this isn't worth breaking your relationship with your sister over. Express your unhappiness and disappointment to her in as constructive a way as you can, and then just carry on job hunting with a more appropriate CV. Good luck.",
            "Wow OP, I'm seriously impressed that you didn't just slap the shit out of her. This whole it's a prank bullshit needs to stop. I can't believe she would be so immature, have your parents never punished her for shit like this before? Unbelievable.",
            "I feel for you OP. At the very least she didn't put anything vulgar. ",
            "As a recruiter and HR Manger for a multi billion dollar company, myself and my team only look at experience and education. You're probably fine, but it wouldn't hurt to send an updated copy of your resume to a recruiter/HR dept and explain your situation. It's quite the laugh though! ",
            "Find 30 more businesses to whom you can send another resume.  This time, proof read it. \n\nNo, you shouldn't email the companies to whom you already sent it.  You'll look like a donkey either way.  This is may be your sister's fault, but your resume was your responsibility.  \n\nP.S. You're just as likely to get a ~~job~~ interview *because* of the garlic bread thing as you are to be *disqualified*.  Most resumes are painfully boring.  It just might pique someone's curiosity and make you \"stand out\".   ",
            "If it was my brother, I would smacked the shit out of him. Then he would have laid me out, because he was HUGE as a teenager.",
            "What I would do is email the places you sent your resume to and say something like\n\n\"while I do enjoy garlic bread, a joke was played on me and my interests were replaced without  my knowledge. My full interested are, blah blah blah and as you know garlic bread. I wanted to fix this because I would really like to work at (whatever place you applied). Thank you for your time ( whatever your name is).\n\nI think that it will show that you take your job seriously while making light of the situation. If I got that email I would take the time to read your resume. \n\n",
            "Go to a very nice french restaurant and ask for garlic bread.  Also get samples for interviews.",
            "I understand sibling jokes, sometimes when they get serious the sibling who did the joke should genuinely apologize \n\nAlso I laughed out loud when you said \"it's true, garlic bread is a passion\" \n\nIf you end up getting any interviews explain what happened and say that same sentence again, will probably help a lot in interviews ",
            "Goddamnit, now I really want garlic bread. ",
            "I initially thought she replaced all your experience on your resume with \"garlic bread\". Which would have been really bad, but now that I know it was just under hobbies...it's not so bad. \n\nShould hobbies be on a resume though? Don't know what it's like in the UK but I don't think that's common in the states ",
            "Either someone will have humor and hire you, or your life is over. Or nothing happens, and you relax in a few days and progress and think of it occasionally. ",
            "No harm done ... You're 18. Had you been 28, then I'd say shave her hair off in her sleep. You're fine, though. Good luck! ",
            "Just take solace in the fact that in today's market, it was improbable that you'd get hired in those places anyways :(\n\nShitty of her to do, but in the grand scheme of things this isn't that big of a problem. I would just resend/reapply with my resume to those places in like 2 weeks or so. I doubt anybody would be saying \"I'm not hiring because they had a weird resume sent to us a while back\". If anything, if they make the connection they might be curious as to what happened. They'll remember you because, if they actually looked to read the resume, that'll stand out, and that is incredibly important (and impossible if you're just applying online).\n\nWorst case scenario, places only hold resume's for 6 months so after that the whole thing will be in the past.",
            "This is the second time I've seen this problem and I have no idea why anyone thinks this would be even remotely funny.",
            "You're 18F with no real experience. This might be the only thing keeping you in the \"hmm, now I'm curious\" pile. Own it as your strategy.",
            "I seriously doubt many employers will even read the resume, but if they do, they might actually laugh at the garlic bread thing and want to interview you",
            "I am interviewing   teenagers for summer jobs right now and this made me laugh. I would call you in for an interview. Garlic bread is underrated ",
            "As far as your sister is concerned, fill her backpack with garlic? Best I got.\n\nAs far as your computer is concerned, I f you're on a Windows computer, windows+L will lock it immediately. On Mac, cmd+shift+Q to log out and lock the computer. It's not a bad habit to be in. (Obviously useless if there's no password, so)\n\nAs far as your resume is concerned, I don't know what country you're from, but many companies utilize software to see where you've applied, many will filter out carbon copy resumes, or resumes that don't have any of the keywords for the job app. Best practice (generally speaking), is to pick about 10 places or so, and tailor your resume to that place. If you can, hand deliver the resume with a cover letter, and ask to schedule an interview then and there. While some will redirect you to their online portion, those who don't will remember you a heck of a lot more than if you just send in an email. Yes, even for a summer job, even for your first job out of School.",
            "[deleted]",
            "She's only 15, if you tell your parents would they discipline her?",
            "Don't sweat it, just follow up with phone calls as you should do.\n\nAnd you're in the UK, it's a CV not a résumé. ",
            "Nothing if you applied to work at an Olive Garden. \n\nAlso, lesson learned, you should always proof read before exporting as  a PDF (the only file type you should send). ",
            "It's only the hobbies section, noone will care",
            "Weird how everyone in r/relationships sees this issue. If you were to have post this in r/personalfinance or r/jobs, you would've gotten a much different response. ",
            "Considering the types of jobs you're looking for, I think you'll be fine haha. I find the story quite funny and I'd hire someone who put garlic bread as a hobby. If you don't get a call back I'm pretty certain it won't be because of the garlic bread edit.\n\n\nIf you're going for more professional jobs in the future, of course then maybe it'd make a difference. However recruiters for casual jobs aren't looking for specific qualifications, just the ability to work in a team and some social awareness. A sense of humour helps too so it may be the case your sister did you a favour! \n\n\nIf you're applying for professional jobs, then messing around with your CV isn't funny at all but hopefully your sister will lay off the pranks once your career is at stake.",
            "I think you'll be fine. I'm currently reading through lots of resumes for a position my company is trying to fill. The Hobbies & Passions part is always the same boring stuff. Intellectual sounding activity, team sport, outdoorsy thing, blah. Seriously, if someone only wrote \"garlic bread\", I'd probably laugh and think that they have a great sense of humor and aren't afraid to do things differently. I might invite you simply because you stood out from the rest. Relax, you'll be fine. ",
            "Gaaarlic bread?\n\nCan't believe the lack of Peter Key references in here. ",
            "Not to be creepy but I recognize an Irish poster when I see one (LOVE the name) so good luck in your leaving certificate. I wouldn't worry about it. I would just resend the application, they probably know someone pulled a prank on you.Also if you are from anywhere near Dublin there are loads of waitressing jobs going in the heart of town.\n\n\nI would also talk to your parents about how disrespectfully your sister acted and how you feel she damaged your chances of getting a job/summer work.There should be some kind of repercussion for this kind of behaviour. This wasn't just a joke because (now its not likely) but it could have lasting consequences and it's clear she doesn't get that.",
            "You are the victim, but there is a lesson to be learned. \nWhen it comes to something important, always check before you send.\nI'd just make it perfectly clear to your sister that she is not to go on your computer anymore.\nI wouldn't worry too much about your resume, if I saw that I'd know exactly what happened. As a matter of fact it may play in your favor if the rest is impressive  (your schooling achievements etc.) That is a resume that would likely stick in my mind.",
            "Pretty please, could we have an update on this later?\n\nI would say the Internet had trained our brains to react to novelty. So when you have a HR person, or some middle manager looking at your CV, if you are not much worse than the average candidate in terms of qualifications, this will definitely make you stand out.\n\nCould even be an advantage, especially if it's some creative/media position, and showing personality resonates well with the company/team culture.\n\nIf nothing else, makes for an interesting interview opener.",
            "I honestly think that you will be able to laugh about this one day, but it might be a few years down the line. My advice is firstly, don't follow up with an explanation for any of these businesses. Put it down to experience. Some may throw your CV in the bin, some may invite you in out of a cruel curiosity to meet the garlic bread girl and some may just give you a chance anyway. It sounds like you're looking for entry level jobs and recruiters for these might still give a little leeway, but that's being optimistic and is fairly unlikely. The main thing to donis what you already know: learn to lock your laptop even if you only leave it for a second just in case your kid sister tries to mess about with it again. She may be sorry, but you won't fix her tendancy to tomfoolery overnight - that's part of her growing up.\n\n\nOther than that, spend some time learning as much as you can anout garlic bread. Evryone knows it's delicious. That can't be denied, but how many people know who invented it? Who first brought it to Ireland? What's the best bread to use? I know it sounds silly, but you need to own everything you put in a CV and be ready to talk about any of it in more detail if asked. This is an important point whether you're talking about garlic bread or have included something as filler because sometimes what gets you the interview when your CV is basically the same as all the other applicants is that yours includes that one thing that you have in common with the interviewer. Maybe they love garlic bread too and feel 1% more connection to you than to the other 200 candidates. Don't then show up knowing nothing about the dish.\n\n\nOverall, put this down to experience, let go of the mortification, forgive your sister and move on. Good luck, Garlic Bread Girl. Go get 'em!",
            "You don't really need a hobbies and passions section on your resumé, unless you do something uniquely interesting/ challenging like marathons.",
            "As someone who used to work as a recruiter and believe me when I say (in the kindest way) half the people you sent it to won't read it in enough detail to notice, another few wouldn't have hired you anyway and the rest will forget about it. It's really nothing to panic about.",
            "Start by taking hobbies and passions off of your resume. Employers don't care about that shit.",
            "It's just summer jobs, I don't think any of mine read my CV properly, especially not hobbies or interests.",
            "First, (though I am reading this post 9 hours on and it will probably be too late) try and see if your email client has a \"recall\" option if you sent it via email. If the recipient hasn't read it, it will be removed from their inbox.\n\nIf not,I don't know if I would bother giving a full explanation. Just send an email saying something like, \"It has come to my attention that my previous resume may have contained some errors, here is an updated version.\"\n\nIf you get an interview and they ask, then you can offer, \"Oh my little sister got at my laptop, siblings amirite?\" *laughter ensues*\n",
            "Oh gosh, all I can do is share a similar horror story.\n\nSo I was applying to colleges (thus around your age at the time). Including a few Ivy Leagues (which were a big longshot for me, but hey, why not). And I got a call/message for an in-person interview with an alum! So I sit through the interview and do reasonably well. I answer all of his questions pretty well, and I haven't had any major flubs either.\n\nTowards the end of the interview, the interviewer comments that he likes my voicemail message - I pause for a moment before my face turns beat red and I'm instantly mortified as I remember what my message was.\n\nMy voicemail was a recording of me and a friend, singing the following to the tune of the non-chorus party of itsy-bitsy-teeny-weeny-yellow-polka-dot-bikini (the \"she was afraid to come out of the locker\" part):\n\n>Hello you have reached -my name's- voicemail,\n\n>She's not here at the moment, you seeeeee!\n\n>Hello you have reached -my name's- voicemail,\n\n>Please leave a message   afterrrr  the beeeeep!\n\n>*-teenage giggles-*\n\nBut the alum interviewing me told me not to change it, that it made me stand out and made me memorable and unique. I thanked him and booked it out of there when we were done, still thoroughly embarrassed.\n\nI'd like to tell you I got into that school. I didn't, but I firmly believe it wasn't because of the interview (my grades were good, but not ivy league good, that sort of thing). But hey, I survived, went to a great school, and remembered the lesson! This isn't the end of the world for you. =)",
            "So are there different kinds of garlic bread?",
            "Let's be honest, I'll be surprised if you hear from any of the companies you sent your CV to but then again you weren't going to hear back from a significant portion of them anyway. In my experience, just because you're applying to a job that isn't going to be a long-term career for you doesn't mean that they have no standards about who they hire. If anything they make you jump through a ridiculous amount of hoops for a job. If it looks like you're taking the piss out of them, they're not going to get in contact.\n\nThe good news is they're not going to spread the word to every other business in town. You can apply to other jobs.",
            "You've had lots of great advice and I'm sure you'll be fine. I just wanted to ask, are you from the north west? I'm sure plenty of hiring managers will read this in Peter Kay's voice (even if they aren't from Bolton)",
            "The good news is that recruiters give so little of a shit about your \"hobbies / passion\" section that this probably won't be a deciding factor. I would ALWAYS ALWAYS ALWAYS try to speak to people in person and use in person connections ESPECIALLY for a small irish town with a sense of community. Try to figure out 30 or so people who are in positions where they are making hiring decisions but not so senior as to not have the time of time. Write them a personalized email with your resume, and ask if you can come by to interview. Troll their linkedin and mention how you're also passionate about getting into X field, and you'd love to grab coffee with them if they have a few minutes. If they don't have a job, get some leads on who might be offering a decent paid internship or junior position. \n\nDon't sweat the online app game. It's all smoke and mirrors, it's by and large for companies to fill slots that they could not fill either internally or through referral / network hires. ",
            "I screwed up on my own when I was job hunting a couple of years ago. We had an assignment in school that required us to build a fictional CV. I had stuff like having been a CEO in a hotel or something in it. Things that nobody would believe about a guy at the age I was. I named it like I would name a real CV and forgot about it. Then later I sent it to half a dozen places before realizing what I had done. So I know the feeling, though I don't know if it's worse or not that I screwed the whole thing up myself.",
            "Your sister likes Tumblr, doesn't she? That's the sense of humour I see a lot on that site.\n\nI say own it. At this point in your life, it's almost an asset.",
            "Google *Nicolas Cage CV* for a mistake to put this in perspective. \n\nNo one cares what goes in your hobbies and interests section. This feels mortifying now, but I promise you, it's not going to be a big deal to the people looking to hire 18 year olds for summer work. \n\n> Technically, it IS true that garlic bread is a passion of mine simply because it's delicious\n\nThis made me laugh out loud! With an attitude like this, I'm sure you'll be an asset to anyone who hires you. ",
            "True story.\n\nNobody cares. It's bad enough someone has to go through the vomit of self-indulgent, self-absorbed prosody that is your basic resumè but if I to pick the worst part of that mountain of shit it would have to be the Hobbies section. I literally care more about the mole on Kris Jenner's right toe than I do about what you like to do when you are not wanking off at your job. So I am just going to read garlic bread and smile beatifically and think \"Bless this girl. I think I love her already.\"",
            "I typically see 5-10 CVs a month and interview a couple of people from those. Hobbies is not a section on a CV I pay a lot of attention to, but if I saw this it certainly wouldn't put me off as I'd have at least one entertaining question to ask you. You'd be amazed how boring most CVs are.\n\nAs others have said, you'll be fine. Make it a talking point, being sure to mention that you've learned a lesson from the episode!",
            "20-30's not that many, that's maybe two sessions of searching.",
            "send a updated resume to the companies you sent them to, most will not notice and other ones will laugh about it. its a fantastic ice breaker to make you stand out of the crowd",
            "My ex sent out resumes with his previous job's responsibilities as \"pooping my pants\". Someone called to inform him, with a lot of laughter in the background \n\nJust change it and send out more resumes. Roll with it if anyone asks you, then take that chance to elaborate. It's not that bad, honestly, just irritating. Honestly, it may cost you a few interviews, but there's a chance you still get some call backs despite it.\n\nI don't even have a section for that on my resume; is this a new thing, or something to help younger people fill it out some more?",
            "I also think you should take garlic bread to each of your interviews. Just for fun ;) :P ",
            "Depending how many things you had put in your \"hobbies & passions\" section, you might actually be better off with just garlic bread.",
            "She did you a favor. Don't have a hobbies and passions section on your resume unless they are a big deal. Like, you chair a volunteer group or you tutor children on the weekends or something. Nobody cares if you like model trains.\n\nIn fact, you'll probably get a better response rate with the garlic bread version.\n\n\"I dunno, Jim. I'm on the fence about asking cheekyhotchickenroll to come in, but I really want to know what's up with the garlic bread\"",
            "Yeah I think you're definitely over-reacting. I really do believe unless you are applying to a Fortune 500 company MOST places don't look that closely at resumes. In my company I know they throw your resume in the garbage and just interview you if they see you have a degree and 3+ years experience, or they'll just hire you without peeking at it if you know someone in the company. If you're that concerned I'd try to go to the hiring manager in person and say \"Hey my kid sister is quite the jokester! I accidentally sent out my joke resume because of her! Kids, right? Anyways, here's my real resume and I hope to hear from you soon!\" *handshake* It'll be fine. Just keep trucking!",
            "I would totally give you an interview with that on your resume!",
            "Honestly some people will give you the interview because of the garlic bread. Sometimes weird and funny works. I once made a storybook resume for my friend. She was applying for ECE. 12 years later she's still getting calls back.\n",
            "As someone who knows how hard it is to find a job, this fills me with rage. ",
            "Just record your sister playing prabks on you and post them to Facebook. Situation solved.",
            "Accept the fact that she has no brain and move on.",
            "Idk but your parents obviously need to punish your sister by only giving her garlic bread to eat for a week.",
            "/r/GarlicBreadMemes would love this",
            "Did you apply to a bakery? \n\n",
            "Most companies don't read Hobbies sections. ",
            "Your sister got you good. Damn that's funny. I think you over reacted and no one personally cares that you enjoy knitting and long walks on the beach in your free time.",
            "Your sister might have just gotten you some interviews. It will make some good icebreaker conversation too. Not saying what she did was right, but worrying won't do anything for you now. \n\nRelax and think of something to do to her. If she can dish it she needs to be able to take it. Maybe she'll realize it's not fun being on the other end. ",
            "I know this thread is somewhat old but it cracked me the F up.\n\nI do a lot of the pre-interview screenings for my job and if I came across this, I'd definitely give you a shot at an interview.\n\nWith that said, 98% of my employees are between the ages of 15-24, so for many, it's their first job & it's a \"fun\" atmosphere. ",
            "As awful as this will come off, no one takes a teenager applying to work too seriously anyway. They're not looking for a list of publications and shit, they know you're new to the working world. If it was me, I'd laugh and move on. No long term damage. \n\nBut yes, I probably wouldn't hire you at that moment. ",
            "Hmm TIL 18 year old English girls use the term 'copped on'. Likely story. ",
            "As an employer I might actually be encouraged to call you if I saw garlic bread on a resume... ",
            "Relax, it doesnt sound like she changed anything other than Hobbies.  It's pretty funny and you can get bonus points in an interview if you can tell a funny story about garlic bread (if you are asked)",
            "Was it emailed out to the businesses, or is it a link to the resume you uploaded to the site? If the latter, quickly upload the correct resume and the may never even notice the changes.",
            "I wouldn't worry too much about it. If anything, it's a witty response, and there are sure to be garlic bread fans out there doing the hiring. \n\nAs for your sister, you reamed her out pretty good. From here on out, secure your computer and make sure you make it clear to your parents that her shenanigans could have cost you a potential job. ",
            "Don't work for any of the companies who can't understand a little sense of humor. Garlic Bread ??? LoL ",
            "I'm sorry for what happened, but shouldn't you have checked it again before you sent it? \nI'm paranoid when I send anything to an employer or a client so I triple check and check and check before finally sending.",
            "Better late than never. Asked a friend to look over my cv and he sent it back with edits. The only one I managed not to see was the change of degree from politics to \"bumming men\".\n\nI sent that to about 6 places before realising.\n\nIt says I had a 2.1 in bumming men, so at least I'm well qualified",
            "i have never seen in a serious resume a \"hobbies and passions\" section, so maybe avoid that in the future, but you're 18 and probably not applying to be CEO of microsoft\n\nthe people hiring for the kinds of jobs you are probably seeking would find the garlic bread comment funny and it might make you stand out, just don't blame it on sis and instead own it in the interview",
            "I wouldn't sweat it that bad. You never know, Sitting with 20 other boring typical 18 year old resumes filled with this or that it actually might make someone laugh and get your resume noticed...\n\n\nThat being said, from now until the end of time you MUST buy and wrap garlic bread for every gift giving occasion. (for at least a year)",
            "How my friend got a job at a high ranking law firm(among other things ofc). \n\nHis brother put \"Die Hard Nik and Jay fan(a Danish band people dislike as much as Americans dislike Bieber)\" in his hobbies. \n\nHe got a jobinterview despite not really having the credentials because they thought it was funny. He aced the interview and got the job. ",
            "As someone who sorts through resumes all day, if the rest of your resume was good, I would probably call you. That's one of the funniest things I've read in a while! \n\nYour sister does sound like a little shit though. It would have been funny if she had left the file open to give it away, or changed the file name to garlicbread.docx. Anything to give you a chance at realizing what she's done. but the fact that she closed it and hid her tracks kind of makes it seem like she didn't care if you accidentally sent this out for realsies. Seems like the possibility just made it even funnier to her.\n\nAnyway, I wouldn't stress too much. Don't call attention to it unless you get a call back and they specifically ask you about it.",
            "Just let it happen. It's the way of the garlic bread.",
            "A friend sent a resume with my boss with a whole Skills section full of stuff like \"I can make 30-minute brownies in 20 minutes\". My boss read it and was like \"Get this guy here ASAP\". We still work together.",
            "It's human nature to want to help someone who is in a position of vulnerability. When I waited tables, some of my best tips came as a result of botched service.\n\nYour corrected resume will get their attention, and you will stick in their memory. Your sister's prank could actually be to your benefit. Make sure to be gracious and not spew negativity about it, in any interviews. Prospective employers will be interested in how you handle this. Good luck!",
            "I'm from a small Irish town too (North Mayo),  chances are no ones going to read your CV unless you go in and talk to the manager anyways. Mention what happened, the manager might find it funny and it'll help them remember you.",
            "I own 2 small business and I'd totally hire you just because you have a sense of humor.",
            "I would hire you immediately as, I too, love garlic bread. I'm sure many will think it's funny.",
            "The \"hobbies and passions\" section is pretty archaic, so most people reviewing it will probably just take it as you being lighthearted. Plus who doesn't like garlic bread? This wouldn't have any impact on whether I would give you a call. ",
            "As someone who has spent years figuring out the perfect garlic bread,  I would welcome a candidate with whom I could share tips.",
            "Little late to the party here.  Don't fret over the outcome.  I currently have 250+ people your age working for me.  \n\nI would probably give you an interview just to see what's up with garlic bread.  Hs/college employers should hopefully realize they're #1 job is to develop you while getting a job done.  \n\nAs for your sister, it's time to sit her down, explain when pranks are good/bad and how to tell the difference.  \n\nIn life, this is a blip, but you don't want something worse to happen later.\n\nI'll be glad to provide feedback on your resume as well if you want to pm me.  You can anonymize it if you want.  ",
            "No one cares about hobbies on a resume and most would see it as a benign joke. There's nothing offensive about garlic bread.. Unless you're a vampire. In which case, would you want to work for them?",
            "lol-well, Im sure this is more than annoying but its not fatal.\n\nTh BEST way to get a job is to walk around your mall/downtown area with copies of your resume and go in and ask if the hiring manager is there and have a conversation.  My kids did this every summer and had 4 offers by the end of the first day.\n\nOn line apps often go into a dark hole and are never even read.\n\n",
            "I've honestly had interviews with places that skipped that section entirely.  \nThey see what they want to see.",
            "Calm down, this is not a big deal.  Relax, update your resume, resend to all the places that you sent it.  It is not a big deal at all, its not even a small deal, if anything, it's pretty funny.  You will laugh about this and your reaction, in the future. Enjoy being 18!!!!!",
            "When I review resumes first thing I do is run spell check.  If you can't even correct those things, that's sloppy.  If I saw this, and you didn't have a ton of other errors,  I would probably chuckle and think it an honest mistake because no one would knowingly ignore that.  I would most likely ask you about it during the interview though because I'd be darn curious for the back story.  ",
            "I think this is pretty funny. Lighten up.",
            "honestly this is brilliant.  i would interview someone who had this in their resume.",
            "I would say its diferent if you left the document open - but you didn't. She went looking for it, opened it and did this.\nThat being said, I doubt many places look at the hobbies and passions bit. You'll likely still get offers. If not, they won't ever remember you as 'garlic bread girl' if you apply years later. You could re-send the corrected resume and explain what happened though! Apologise, explain briefly and attach the resume titled UPDATED or something. \n\nTell your parents that your sister deliberately sabotaged your attempts to get a job. At the very least, talk out how you feel and let them listen to you vent so they can understand how you feel. This was a breach of privacy. You didn't leave the document open, **she deliberately did it and hid it from you so you wouldn't know before sending it out**. Wee gobshite should be grounded at the very least, her apology is an apology for being caught/told off, not for what she did. \n\nalso\n>Technically, it IS true that garlic bread is a passion of mine simply because it's delicious, but obviously it is not resumé-worthy.\n\nlmao good girl.",
            "You will be ok. Good thing you caught it, now just apply to more positions. ",
            "I'm not trying to blame you, because what your sister showed her vast immaturity, but in the future, it is always a good idea to double check your resume before sending it out every. single. time. Not because of pranksters, but because you could have accidentally added a random \"S\" when hitting ctrl+s (hitting the shift key by mistake) or something like that.\n\nAlso, it's a good idea to get into the habit of checking after you get your tea or whatever, because sometimes when you're looking at something for a long time, you miss glaring mistakes. When you get up and walk away, your brain and eyes will refresh. That's why its also a good idea to get someone else to look at your work.\n\nAnyway, if I were you, I would write an email along the lines of \"my apologies, I submitted the incorrect document. Please disregard the previously submitted resume and use this one to assess my qualification for x position.\" You don't need to overly explain or make an excuse. It probably is going to disqualify you from some companies, but for some it might save you. It's worth a shot!\n\nGood luck on the job hunt! Stay positive and be confident. Overthinking will only drive you crazy. The job search process is a roller coaster, so just tilt your head back and enjoy the ride til it's over!",
            "The Hobbies & Passions part of your resume isn't super important, all the relevant stuff should have already been covered elsewhere.  I don't even have room for Hobbies on my resume, so I've started leaving it off, unless it's super relevant for the position I'm applying for, which almost never happens, as like I said all the relevant skills and experience that the employer cares about would have already been covered in other sections of the resume.\n\nHobbies & Passions is a bit of a fluff really, after a bit of experience I think most people just leave it out, unless you're for example applying for some sort of a travel-related job and one of your hobbies and passions is world travel.  But again, in that case that would have been covered elsewhere in the resume anyway.\n\nGarlic bread under hobbies and passions would make me laugh, if I was the person screening the resumes.  It might signify to me that you are a good fit for our team - because we take our jobs seriously, but we also joke around a bit.  I mean, on the other hand I could be a hardass and assume that you don't take the job search seriously, but most people wouldn't assume that I don't think.  Most people would look at a section that isn't really that important and say \"ha!  good one, mmm garlic bread\"  \n\nSo maybe it's just me but I think in some cases this could actually help you, depending on what used to be under Hobbies & Passions.  After your skills and experience have been analyzed, and there's 5 positions but 50 applicants, prospective employers usually look for signs that you'd be a good fit on the team, in terms of personality.  And maybe it's just me, but someone putting down \"garlic bread\" under \"Hobbies & Passions\", depending on what the rest of the resume is like, is someone who takes the job seriously, but knows when to take it down a notch and relax.\n\nIt could go either way, really.  Overally I would say it probably doesn't matter.\n\nHaving said that, your sister should NOT have done this.  You chewing her out for it was necessary, I think, it reduces the chances of her doing something like this ever again.",
            "who knows maybe a hiring manager out there actually is a garlic bread aficionado ",
            "On my first resume, I messed up my years at high school so that it looked like I was held back and took 5 years to graduate.\n\nStill got the job. ",
            "A lot of people here are shitting on the sister but I think it's absolutely hilarious. He is young and there will be no real world implications. He will laugh his balls off in about 10 years. ",
            "You have gotten some great advice here. All that aside now though...    \n\nIs garlic bread *actually* a passion of yours, or did she make that up?",
            "I imagine you'll have the chance to return the favor someday when she shows up to school, goes to turn in an important assignment, and finds only garlic bread. ",
            "Just be prepared to have an interesting comment or two about garlic bread - but also how your sister doctors your resume unbeknownst to you. If you had a good attitude about it when I interviewed you, I'd not think anything of it. I'd probably thinks it adds character to be positive in the face of the negative. ",
            "This is hilarious.  You are 18.  In ten years, read this again and have a laugh.\n\nI think you are right to be pissed at your sister, but it probably isn't the end of the world.  Actually, it definitely isn't.  it might be hard to understand, but you will use this story in future interviews to break the tnesion, start off with a laugh, and leave such an impression that you get hired.  This might actually help you.  Everyone knows hiring is tough and in the future, this story will be a huge asset.  \n\nIf you are just spamming your resume, I say forgive her and move on.  Just find a few places your haven't \"garlic bread'd\" and start again.",
            "As an employer... I don't even look at the hobbies section.  You'll be fine. ",
            "After reading through stacks of shitty resumes, I might call someone in for an interview that was that passionate about garlic bread if only to break up the monotony. ",
            "You'll be ok.  Most employers don't read every word in the resume.  If someone asks, just say you put it in there for whatever reason.  I wouldn't admit to sending out a resume that wasn't proofread.\n\n",
            "It wont make a difference. Few companies do much with unsolicited resumes and the ones that are do so, because they have a demand to fill and might actually find that amusing.",
            "send it to an italian restaurant, its not fitting",
            "That's hilarious (but I would be mad if it were me). That said, I put a funny line about coffee in my resume... if an employer is uptight to the point they disqualify me over it, they're the type who would fire me in about 20 minutes for other things that come out of my mouth anyway, so I'll pass. If your resume is for the food service industry, this might actually stand out enough to get you a job. Also, since this is a just out of high school summer type job, you get some leeway. Believe me, I've seen enough people show up in street clothes and blow \"gimmi\" interviews by being stupid, that if you if show up looking presentable and act professional, you shouldn't have an issue.",
            "I wouldn't worry about it at all. When I was your age I intentionally put \"I have a keen interest in novelty socks\" in my hobbies and interests section. Usually the manager found it funny or ignored it all together. Either way I was never out of a job for more than a few weeks all through college/uni using that resume!",
            "Hello fellow Irish person. \n\nI worked in retail all through University, and when I was a manager, hiring people, I can honestly tell you that the hobbies and interests part was the last thing I was interested in reading. If anything, it might just make you look like you have a sense of humour. \nIt's not cool of your sister, but honestly, you'll be grand. ",
            "Hell, I'd bring you in for an interview specifically because of this. I love garlic bread and would find this genuinely entertaining. When employers are seeking to hire someone of your age - for what I presume is a customer service role - they want an employee who has a great attitude and works well with others. This would tell me you have a unique and outgoing personality.\n\nBesides, it could be worse. She could have listed something you passionately hate, then you have to tell the interviewer you in fact don't like garlic bread, or just get buried in a lie.\n\nGenuinely understand your frustration at your sister though, as I would also be infuriated if someone were to modify my resume just before I applied to jobs. It sounds as though she did not fully understand the implications of her \"prank\" and hopefully has learned from it. However, I suggest you do not stress about what the hiring manager thinks; I'm sure they got a good laugh out of it.",
            "The one time I sent my CV in for a job and got a site interview. The first question I was asked was, \"so, where did you go to school?\" I, indignantly, referred the person to my CV, at which point she laughed and said, she doesn't go through them for applicants. So, you're probably fine.",
            "I gotta admit, while I know this sucks for you , it has made me LOL for the last few minutes.  \n",
            "I'm so sorry this happened to you....but I had a pretty good chuckle at your expense. ",
            "Step 1. Murder sister. Step 2. Realize that murder is illegal and panic.  Step 3. ......... Step 4. Profit. ",
            "You're only 18, and applying for a summer job.  It's really not a big deal.  They'll probably just toss your resume.  Wait a few days for them to forget, and then send them another resume and they probably won't even notice.  Alternatively, if you want to look more professional, you can send them an e-mail that says \"there may have been a technical issue with my resume, attached please find a corrected copy\".\n\nIf you were an experienced professional applying for a full-time job, then this would be a major problem.  But at your stage, it's not going to matter. \n\nNevertheless, you need to put your sister straight.  Will your parents do anything to teach her that this is not acceptable behavior?  If not, you may want to cut off contact with her for a while so she gets the message.",
            "I've been a professional in my industry for about 5 years now. My first year on the job market I sent out a standard cover letter detailing what I liked about the company and only got a few calls before finally landing a job. When it came time to look for another gig I decided to go a different route. My cover letter details a story about how in 4th grade I convinced a group of boys to cross-dress and dance to Man I Feel Like a Woman. I've gotten more calls saying they loved that story and I'm fairly certain I landed my current and previous positions based on it.\n\nTL;DR: Garlic Bread is a legitimate passion. This could be a great way to find a job with some personality attached!",
            "It depends on who reads your resume. Most of the people who read resumes are not people but cold near-lifeless creatures with no heart or sense of humor. Hopefully you get someone with at least a small sense of humor.",
            "Bro your sister is a hero. That's some pro level prank game she got ",
            "Depending on the types of jobs you are applying for, it may not matter all that much. The hobby part isn't as important as job history / etc. I would most probably still give you an interview.   \n\nThen again, I do love garlic bread.",
            "Please rename that section \"Interests\". The word \"Passions\" seems very... scandalous? Or maybe too deep for a resume? Regardless, if I got a resume with \"Passions\" on it, I'd probably be a bit weirded out.",
            "I think you have a chance to turn this into something positive.  You can re email your resume, and explain what happened.  You will have their attention now and can also communicate in the email that you would be a perfect fir for the company, highlighting your accomplishments again.  You will certainly have their interest after you share this story and it will likely result in your resume being reviewed.",
            "How about we talk about the fact that you're 18 and have a resume? I've got a decade on you and I'm still scraping \"achievements\" together. And the mistake is genuinely hilarious and not scandalous (she could have put something dirty or incriminating on it).",
            "This is your fault. You sent them out without checking. That's on you. Also, nobody gives a fuck about your hobbies. Period.\n\nStop blaming your sister for your mistakes, you're supposed to be the adult here.",
            "If it makes you feel any better, I would probably laugh if I saw this resume come across my desk and would call you in for an interview just to see what the person behind the paper was like.\n\nIt will be fine. But you should plan revenge on your sister.",
            "Kid, this is not the end of the of the world. I've been an interviewer for top level positions in a company. Seen some whacky stuff on resumes. If that's your only error, you should pat yourself on the back. Word of advice- remove the Hobbies & Passions section.",
            "I think,re-do your resume and then resend them out with a well thought out memo explaining how things happened out of your control and how you handled it.the serious employers will appreciate you dedication and crises management skills.make sure to stay calm an relaxed as you type the memo.Tension can be seen in you prose.Just think,no biggie,i got this.Some one told me yesterday,i asked him what he did for a living,He said \"i make chicken shit into chicken salad\".He made me laugh so hard,but that exactly the way it is sometimes.Take this temporary weakness and make it one one you strenghs.Relax,dont panic,handle your shit and make it salad.Good Luc and Godspeed",
            "You'll be fine, I don't remember who did this, could've been me. Someone switched a buddies resume to state something about being good Hammond or some thing sexual of that nature, he still got jobs and interviews",
            "She is most likely embarrassed herself about this incident and doesn't know how to apologize or admit that she made a mistake. ",
            "I had an old boss called Andy Walther. I didn't quite remember his name, just that it was medium-length and started with a 'W'. \n\nI sent off a number of job applications that said his name was Andy Warhol.",
            "Sorry but this is super funny.."
        ]
    },
    {
        "post_id": "p6n201",
        "author": "throwaway3544558",
        "title": "UPDATE** My(31f) husband(32M) doesn't enjoy sex with me",
        "url": "https://www.reddit.com/r/relationships/comments/p6n201/update_my31f_husband32m_doesnt_enjoy_sex_with_me/",
        "score": 3655,
        "num_comments": 128,
        "created_utc": 1629275288.0,
        "selftext": "https://www.reddit.com/r/relationships/comments/p3j4zo/my31f_husband32m_doesnt_enjoy_sex_with_me/?utm_medium=android_app&utm_source=share\n\nI am on mobile so sorry if link doesn't work. I thought I should share what happened after the post to u guys since I got so many helping replies.\n\nSo first of all one thing I realised was that I never thought that he might not like what I like in bed. I believed he was also enjoying as much and never properly talked to him about it.\n\nAnd then me and my husband had a long conversation about the issue. At first he was like there is no issues at all. So I asked him what part of our intimacy did he like the most. He told me he liked undressing me and seeing me naked the most and then after sex cuddling as second. So basically the specific PiV part was not liked. I asked him if he has any specific thing he wanted to introduce. He didn't have anything perticular in mind so I asked him to look it up with me. We read some online stuff about different kinks. He showed interest towards blindfolds and handcuffs. So we bought it.\n\nThe next night we decided to try it out. He handcuffed and blindfolded me. Halfway through, he suddenly opens my blindfolds and tells me that it was even worse than before. So I thought it was a failure.\n\nYesterday night, I was thinking about some other stuff we can do when he came to me with the handcuffs. But this time... He wanted me to use it on him instead. At first I was like wtf?? But I decided why not it won't hurt to try. So I handcuffed him, took the lead. And for me... I enjoyed the fuck out of it. His reactions were amazing to watch. I did fumble a few times but we reached the end. He also told me this was hugely better. So.... Yeah looks like he was a submissive type. I myself am not a pure dom but I liked to take to lead too. \n\nAnd I also asked him that he told me at first that he liked seeing me naked so how is he also liking being blindfolded? He said that he did like to see me but the fact that he wasn't able to turned him on. Can anyone explain this to me? \n\nOtherwise reading ur replies was a big big help. So thank u to all of u. I would also be happy to say he is not asexual or has someone else. \n\nTldr: husband turned out of be a sub.",
        "permalink": "/r/relationships/comments/p6n201/update_my31f_husband32m_doesnt_enjoy_sex_with_me/",
        "comments": [
            "About the him liking not being able to see you. It's more of the same: submission. \n\nIt isn't the fact that he isn't able to see you what gets him off. It's the fact he wants to see you but can't or isn't \"allowed\" to. This fact basically underlines that he isn't in charge or that it isn't about \"what he wants\", if that makes sense.",
            "r/gentlefemdom Go to this sub and ask away. People there are very friendly and welcoming. You and your husband are in for a treat, trust me.",
            "No explanations needed honestly. As long as you both enjoy it just keep doing it. Keep communicating  and do things TOGETHER that in of itself is plenty helpful. Goodluck and have fun exploring with each other.",
            "Good old communication saves the day!",
            "This is a very sweet update. Well done to you both, and I hope you enjoy exploring this together.",
            ">And I also asked him that he told me at first that he liked seeing me naked so how is he also liking being blindfolded? He said that he did like to see me but the fact that he wasn't able to turned him on. Can anyone explain this to me?\n\nTaking away his sense of sight may allow him to focus more on the sensation of touch or internal sensations of pleasure.  When you're wearing a blindfold, you also enter the mind's eye, which is a unique way of experiencing intimacy (akin to why you close your eyes when you kiss).",
            "[deleted]",
            "Thank you for the update",
            "All I can say is that it's definitely a thing that happens.. I love my partner but it seems that I just tend to respond to arousing stimulus better without the visual there. It's not that they're unattractive to me or anything but I feel I focus a lot better on what they're saying/doing without the ability to focus on what I see.\n\n(Granted I am also grey ace so my sexual experience is a little different)\n\nEdited to add: I am also a submissive, and there's both an element of giving up my vision as part of the submission (not being allowed to see) as well as just the ability to focus more on other things. So it's possibly either or both in his case, or something else!",
            "I’m going to offer and alternative for you to consider.\n\nIt could be that you are too passive previously, and that he needed you to feel more excitement or to want it and do more about it instead of just saying you want it. It’s a psychological thing where he doesn’t feel that you’re being passive about it.\n\nNow why did I bring this up even though a lot of people have come to the conclusion he is submissive? Because I don’t think it’s that straightforward, and it might be extra information for you to think about.",
            "He likes seeing you naked because well naked is awesome.  And he likes the blindfold because you don't know what is going to happen next.  It's the excitement of the unknown.",
            "Do you have a lot of experience with sex? Like before him with other partners? \n\nLike I'm your age, but I've been with my partner for like 6 years and he was the third guy I ever slept with. I didn't realise it but after a while we communicated and short story short, I kinda \"suck\" at sex and am very vanilla and inexperienced. Like I'm not bad, I do the normal stuff like blow jobs, riding and stuff, but didn't generally realise I should be putting in more effort. And it wasn't a super complaint from him because he could still get off, it just could be better. We got a whole buncha sex toys, even bought an advents calendar of sex toys for xmas where we could try one new toy per day (hit and miss on them, not everything is our thing) and tried new positions, massages before getting intimate, handcuffs and blind folds etc, talking dirty. Plus I looked at porn and learned a bit from there. (Disclaimer! Porn isn't exactly real real, so wouldn't say you copy is 100%, but it's good for getting inspiration). Even he likes the submissive stuff, which generally involves a LOT of teasing before penetration. It makes him feel sexy/wanted. \n\nLike it's soooo easy for women to be fooled by the media and think guys just wanna fuck period. But guys need loving and effort too. Sex alone isn't enough.",
            "In terms of him liking not being able to see, maybe it allows his imagination to take over. Or maybe it heightens his other senses and that’s new and exciting for him. As long as you guys are both enjoying it, keep having fun.",
            "I can't explain how thoroughly my sex life changed when I started bottoming. I was always a bottom trying to top and sex was unfulfilling. Turns out, I just like getting railed. Congrats to you both!",
            "If he has a submissive side that wasn't getting seen, then it makes total sense that he wouldn't be as interested in PIV.\n\nMaybe he'd enjoy PIV while in a more submissive role? Rolling with the submissiveness might be a way for both of your needs to be met.\n\nI have a submissive streak, and find being \"in charge\" during sex kind of stressful, especially while penetrating. I would probably find it really hot to be dominated during PIV. There's something about your partner doing it *to you* for their own pleasure that makes it completely different. Maybe see if he would enjoy being restrained and / or blindfolded while you ride him.\n\nGood luck!",
            "Good for you, amazing communication and showing understanding- something a lot of people are lacking.   So glad it worked out for you!",
            "I had some familiar giggles reading this update. My husband insisted for MONTHS that he was the dominant type but whenever we tried to have specifically kinky sex with him in the lead, it would flop. I was honestly concerned he might even have ED because he insisted I was the most beautiful woman he’d ever seen. The first time I tied that man up, it was the best sex we’ve ever had. Sometimes men just really try to force themselves into roles they think they should be filling. The freedom to leave those roles can really open up a relationship.",
            "I totally commend you for exploring the issue as adults and having absolute respect for him. That’s one hell of a solid marriage.",
            "I explain it to you:\n\nyou are handcuffed and blindfolded: He has to do all the work, he even makes him cum himself from the thrust. I guess, as usual.\n\nHe is handcuffed and blindfolded: You have to move. He gets to enjoy a nice and surprising sensation around the penis ... you know ...\n\n\nI became frustrated with sex once I realized, that I was the only one who was thrusting, and she was just receiving my thrusts - all the time - without moving / giving back thrusts or surprising movements too. I mean .. she did .... when I said \"I am about to cum\".     She even was the opinion this is great sex - and I wondered what was missing for far too long tbh.",
            "Awesome. I hope I have such a glowing success story one day.",
            ">He said that he did like to see me but the fact that he wasn't able to turned him on. Can anyone explain this to me? \n\nPeople can like more than one thing, Mary. Also, generally, teasing someone by delaying or denying something they like is pretty exciting.\n\nGlad y'all are experimenting and having more fun.",
            "Awww I’m so glad you guys could work it out!",
            "He liked it because he's a sub, a pure submissive. You seem to be able to switch, so talk to him about sometimes YOU being one to be the bottom, like for your birthday or anniversary or whatever.\n\nLots of ways to do this! Give him a nice collar, and have him naked and wear teh collar on a rainy Saturday, which he makes you tea and rubs your feet. He may really like not always having it end in sex for him.\n\nIt can be really fun, enjoy!",
            "You would be what is called a switch: your mood can be dom or sub.",
            "Wow! That couldve turned into a big argument but your communication skills and open-mindedness saved the day! Good for both of you!",
            "Go y'all!  Have fun you crazy kids!",
            "Glad this story had a happy ending",
            "I’m glad you guys were able to talk things out, explore, and find something new and exciting! If you ever have questions, r/BDSMadvice is a wonderful community to reach out to and they have a lot of resources listed on their page. Have fun!",
            "alot of guys are submissive and two scared to say anything for fear of being less “manly”. My boyfriend and I switch off all the time",
            "normalise calling him submissive and breedable it really helped my relationship of 10 years",
            "This pretty wholesome in a weird type of way. Like many men feel horrible about being a sub but it's good he's comfortable with telling you this",
            "Get naked to you panties and heels by telling him to do it, and do it correctly.  Make him watch you while he is knelt and correct how he does it.  Lean on the dom side and try some rimming, ass play and have him eat you after he cums inside or kiss him after a blowjob.  All of these are very dominant and I have a suspicion he will love.",
            "\"At first I was like wtf??\" you've gotta tamp that down if you dont want him to lock up and never talk to you about it again.",
            "Knowing your nude.. visualising your nude but not seeing with eyes your nude is very umm stimulating\n\nif your both going down the bdsm track please work out safe words and no not the stop and go or yes and no \n\nenjoy",
            "I think you should do some reading up on sex and communication and relationships. You put yourself through a lot of misery because you don’t communicate well. I’m glad you took the initiative here but you have so far to go.\n\nLook for the books “guide to getting it on”, “sex is fun”",
            "r/bdsm is going to be the place for your questions about kink! this sub can be a little, puritan",
            "Try taking the initiative and doing sometime fun and new for him. He make be to shy to tell you what he wants, so you gotta figure it out on your own at first. Make sure you put his needs first and act like your enjoying it, even if it isn’t your first choice or favorite thing. Sometimes sex is a little gross and you just gotta do it",
            "Not being able to see your partner can add a sense of mystery and excitement, and it also forces you to may more attention to your others senses: listening to your partner, smelling them, feeling them, etc. I am very visual in the bedroom (very much a lights-on type) but darkness and blindfolds can be a fun occasional treat.",
            "When his eyes are blindfolded his brain takes over in trying to fill the gap, its really an amazing feeling. Me and my fiancee both work high position jobs where we have to make a lot of decisions, so to just let go and be blinfolded and having someone you trust working on you, its just an amazing feeling. Me and she are both dominating in real life, her more than me so I didn't even know I like being submissive till she tried it with me. Some days I am the dom and some days she is. Keep talking and keep exploring together Op, all the best!",
            "He's probably always pulling 31",
            "Your husband sounds like me. I am firmly on the asexual spectrum, and this is the sort of intimacy that works with my husband and I. Not saying he is necessarily, but might be another thing to look into. It's complex stuff, but learning who you really are and how you relate to others on important things like this is so freeing.",
            "Meh my husband kept walking away in the middle.",
            "I think a fair question to ask is why is it frustrating for him? In my opinion bad sex is still better than no sex, unless there's some other underlying dormant frustrations.",
            "I guess he can go fuck himself?",
            "[removed]",
            "Good for the two of you for communicating and experimenting.  My late husband and I called is sexploration as it is a journey for the two of you.",
            "He sounds the opposite to me. I don’t like it when my partner says she wants to climb on top, does nothing for me where as I much enjoy being dominant and controlling what’s going on. If all my partner wanted to do was be the dominant one, I would enjoy the PiV aspect either. Sounds like you both are communicating well.",
            "Hi OP, I would HIGHLY, HIGHLY recommend you pick up \"Not Always in the Mood: The New Science of Men, Sex, and Relationships\" for yourself and your husband to read.\n\nMy wife and I have been reading the book and it has been a pretty big help for her to understand my perspective/feelings on sexuality and for me to communicate those feelings better.  The book is focused on common myths/stereotypes about men and what research shows about how men actually tend to feel/act.  Note for others: this book is firmly focused on sis hetero relationship dynamics.",
            "Well.. time to buy deildos and strap ons  :P",
            "Have you tried penetration on him? A lot of men do enjoy it, and I've noticed it among more submissive men. It can be fun a lot of fun on your end, too!",
            "Some sex shops teach classes on proper rope play..good for you both for trying new things!",
            "Not sure if it has been linked but /r/sexover30 might be a good place to cross post",
            "In addition to what some others have commented about the blibdfold,it also adds to the excitement and anticipation,not knowing what youll do next and not being able to watch and see. Id maybe recommend trying sensory play too! Using wax/ice or maybe adding in floggers *i have one thats silicone and fairy snall,not used to much for whipping but more used for teading and creating light sensations on the skin* \nMaybe even introduce vibrating cock rings and things of that nature that could really spice things up further! \nMaybe add in some dirty talk to the foreplay to really build up anticipation before even laying a hand on him.  I dont think it has anything to do with him not enjoying sex with you and more to do with a desire to explore new things so take it as an opportunity and be willing to be open to exploring it with him!",
            "\"And I also asked him that he told me at first that he liked seeing me naked so how is he also liking being blindfolded? He said that he did like to see me but the fact that he wasn't able to turned him on. Can anyone explain this to me?\"\n\nYou could have so much fun with this!  Tell him you're touching yourself (it doesn't have to be masturbating) and then tease him about how much he's missing being blindfolded.  \n\nHe's already got a pretty good picture of you in his mind.  Let his imagination do some of the work.",
            "I think I can probably be of some help here. I was in a similar situation with my wife, after several years of marriage, sex wasn't as fun as it used to be for me. \n\nLike your husband, I liked the foreplay, and everything around the sex, but the actual sex act itself was kind of like \"Meh, I mean it feels good, but it's just not FUN\".\n\nI don't want to pry, but my wife is someone who can't orgasm from vaginal sex, so all of her orgasms are from oral or vibrators, and I always make sure she gets hers before me, so by the time it was \"my turn\", it almost felt robotic, and a little selfish. She never made it feel that way, or said anything to hint that she felt that way, those feelings were all from me.\n\nI felt like the actual sex part was just something I did because my body wanted/needed the orgasm. It wasn't an emotional bonding experience like it used to be. \n\nIn any case, long story short, it turned out that I am also a HUGE sub, and leaning into that life has made our sex life AWESOME for both of us. \n\nNow, your husband may not be as submissive as I am, and/or you may not be as dominant as my wife turned out to be, but here's some things that I think might help: \n\nRegarding the blindfold, why does your husband say that he likes seeing you naked but also likes being blindfolded? Because that's just part of the submissive mind. We like having our desires used against us, and being denied things that we want by those who are domming us. \n\nSomething simple to try is, one time you have sex, tell him right at the beginning that he's not allowed to orgasm until you say so, and then the first few times he asks for permission, tell him no. Make him beg for it a bit before you give in. \n\nIf he loves that, do it more, and then one day, when he's really desperate, tell him \"No, not tonight. Maybe tomorrow.\" And then let him stew until the next time. If he's anything like me, that will drive him WILD, and he will be very eager to please you next time. \n\nIf you two really get into that life and it's working for you, continue to look online for other ideas, but some of the common kinks for submissive men are; orgasm denial, being spanked, and edging. \n\nFor your own sake, I would also suggest being honest with yourself and your husband about how dominant you want to be, and how much you enjoy that role. Because if it's something he wants it likes, he's going to want it more, and it you don't enjoy it too, you'll end up in the reverse situation, where now you're not having fun. \n\nFind a good balance where you can hopefully both indulge your kinks. \n\nFinally, if there is a kink that you have, even if your husband  isn't into it, he might enjoy you indulging yourself, just because it makes him feel submissive to know that you're doing something just because you enjoy it. \n\nI hope some of that was helpful, feel free to ask anything else, if you like.",
            "I'm sorry but this is hawt 😊",
            "I love to be blindfolded, but that is mostly because I can't expect what is happening , but I have a mental image of what my partner looks like doing things, it is very exciting.",
            "The next chapter in the book is to see whether he likes being spanked.",
            "Alright OP! Getting your groove back! Also well done on actually communicating with your partner! Far too often people throw out the baby with the bath water when it comes to sexual issues in relationships!\n\nFun thing for you two to play with-  Don't undress until after he is blindfloded! Cuff his hands together in front of him and put on his blindfold. Then take your clothes off slowly, describing what you are doing, and occasionally grabbing his hands to feel where your skin is exposed. It will drive him crazy! Don't take the blindfold off until he is getting close and then rip it off right at the end so he can see all your nakedness that he gets a kick out!",
            "Everyone likes different things, and is into different things. There's absolutely nothing lacking or wrong with you. Your husband just likes different things. \n\nMe, I like to touch buttholes.",
            "I've read this a few times and get the feeling you may be overthinking things. You tried something fun, and it worked. Don't analyze that, find more fun stuff to do. Is PIV the usual only way you guys got off? While it is great, there are so many other ways. Oral, manual, watch smut together,  tie each other up more ways. It's not supposed to be stressful.  Cuddle first too, that ends up being amazing foreplay.",
            "Sounds like what he's really wanting here is more of you taking the lead and taking control than anything else.\n\nWhat kind of PiV sex were you having previously? Just missionary? It sounds like he was just bored but didn't really know how to express it.",
            "I love a happy kinky ending. Great job communicating with your person :)",
            "yo congraaaaaats\n\nway to go",
            "Aw, yay! I love a happy ending in this sub. The blindfold thing I think comes down to heightened sensitivity without having the sense of sight.",
            "Well to me it looks like he likes n loves you and he's a nice guy.\nWhat he said earlier he didn’t understand so he said basically everything without disrespecting you that he likes naked touch n hug but later he liked sub more. So What I suggest is you to talk more, because  I can tell you he wants to make satisfied and you want to him n this can be done by talking and trying new things, helping each other to have best experience 😊\nWhat he likes and also tell him what you like. If you like to be sub then tell him if you like dom tell him, if you like in the ass tell him, try and explore but always with respect. \nStay safe",
            "Lock him up in chastity and deny him orgasms and the ability to masturbate.  Once his balls fill all the way up he will be begging for you."
        ]
    },
    {
        "post_id": "7j6hws",
        "author": "marrisilver",
        "title": "A friend (24M) of mine (23M) apparently lied and told someone we slept together. Now everyone is congratulating me for coming out of the closet, and they think I am just lying because I am ashamed when I tell them I am not gay. The guy who lied refuses to tell the truth.",
        "url": "https://www.reddit.com/r/relationships/comments/7j6hws/a_friend_24m_of_mine_23m_apparently_lied_and_told/",
        "score": 3659,
        "num_comments": 312,
        "created_utc": 1513036305.0,
        "selftext": "This is a really strange situation. I hung out with a guy I sort of know at a bar for a while, and he asked to see my gaming PC so we went over my apartment. Jokingly, his friends were saying we were going up there to fuck (I live above the bar). We did a tiny bit of coke while we were up there, hung out and played games and talked about the PC for like maybe an hour and a half or so, then he went back down and I stayed up there. \n\nWhile he was down there, I dont know what got into him, but he must have told his friends some story that ended with us having sex. Or its possible one of his friends just thought that? I have no idea, he was really coked up when he left downstairs so I assume it was him who told the story. \n\nthe next day I awoke to a whole lot of people messaging me saying that they heard me and george (the guy) had sex and that they had no idea I was gay and they wanted to congratulate me and all that. I am not sure HOW this spread so fast, but 4 people hit me up. Apparently the rumor developed into not only did I have sex with him, but I also came out to him as gay? \n\nEither way, I wrote a FB status right there and then seeking to end this tirade, saying it didnt happen, me and george didnt do anything, its just some weird lie or rumor. A person (a gay man specifically) wrote that he didnt think george would lie about that and that he is disappointed that I felt so embarrassed to come out as gay that I would deny it after, or to accuse a gay man of lying just to protect my masculinity. that comment got 6 likes, and a few people responded saying they agree, that it came off like I was denying it to protect my masculinity, and that they believe george over me. Another girl wrote as her status \"when straight guys call a gay man a liar about them having sex just to protect his masculinity\" and it was kind of obvious she was referring to me. \n\nI dont even know what to say. For one, I hit up george, I called him, its been 4 days, zero response. I am not even sure if I have the right phone number. I am not even sure if its HIM spreading this rumor at all, it could have just been someone who saw him go up to my apartment. I've gotten a few more messages from people congratulating me for coming out, and that \"they had no idea!\" and stuff like that. I've told every single one, sorry, its just a rumor, some of them were like 'oh okay sorry'  and some didnt even respond, presumably because they saw my status and that guy who commented on it. \n\nI don't know what to do. I dont give a shit if I was gay, but I don't want to be known as gay when I am not. Its just a weird feeling because people have accused me now of homophobia over this and I just feel terrible because I have no bad feelings towards gay people, but I just want people to know, I am not gay. Like, this isn't true, at all. But now everytime I deny it it just looks worse. One of my friends hit me up and she said \"look, I know you are denying it, but on the chance you are gay and just feel embarrassed thats okay too!\" and it just made me realize I may never be able to shake this off\n\nWhat the hell do I do? I barely even know this george guy, he might never respond! \n\nEdit: In the title I said 'refuses to tell the truth', really its more like he isnt responding at all \n  \n  ---   \n  **tl;dr**: Being accused of sleeping with a dude, I am not gay. Its spreading all over facebook. ",
        "permalink": "/r/relationships/comments/7j6hws/a_friend_24m_of_mine_23m_apparently_lied_and_told/",
        "comments": [
            "A guy tried that on me once, telling everyone I slept with him when I didn't. I told everyone he was terrible in bed and had poor hygiene and premature ejaculation. ",
            "First of all...you didnt come out as gay. Even if you were, you would have been outed, so tell that gay person mad at you for changing your mind to fuck off.  ",
            "At least now, you know who to block on facebook and remove as friends.",
            "Honestly, on those statuses, I would say something like \"please stop erasing my sexuality - while I understand there is a stigma against being gay, it's incredibly insensitive to erase my own sexuality because of your preconceived notions. When I say I am *not* gay - you should respect that as much as a gay man when he says he *is* gay. You do not get to say these things to me.\"\n  \nEDIT: if you really want to stick it too them, you could say \"and furthermore, in the future, if you think someone has been outed as gay and it was obviously not their decision and they are appearing to deny it, maybe you shouldn't insult them. If I actually had been gay and decided to deny it, that would have been my choice, regardless of what you think of gay people who do that. I'm kind of surprised at the insensitivity people have been expressing to me when they think that I am hiding my sexuality - perhaps you are more a part of the problem for people in the LGBTQ community than you realize.\n  \nAs a sidenote - everyone should know I am a safe person to reveal these things to. And while I am not gay, I have no problems with anyone based on their sexuality.\nThat's the end of my discussion on this.\"\n  \nEDIT 2: I like what someone said about sexism being at play too - taking away sexual agency from you is demeaning, you can work that one in as well. Like \"By the way, on top of all of this - when you perpetuate this sexual rumor that I have clearly told you is not true, you are taking away my sexual agency. This is no different than some dude at a party lying that he banged some young woman upstairs. Me telling you that it's not true should be enough for you, and when you refuse to believe me, it's insulting to me and everyone else that is at the recieving end of lies like this.\"\n  \nYour \"friends\" are all pretty rude.\n  \nEDIT 3: you are free to use all of that verbatim if you feel like it.",
            "Get new friends. Yours are defective. \n\nSeriously, they're assholes no matter how you spin it. ",
            "Remove/block every single person not believing you and saying shit about you on social media as well as their numbers. \n\nIf you *were* gay, this would be messed up too bc that'd mean you were outed. I'm so sorry this is happening to you. Gay people can be just as mean and nasty as straight people and for your friends to say there's no way a gay man would lie about it and you're just homophobic/embarrassed... just so so wrong on their part.\n\nAt least now you know who you need out of your life. Good luck, OP.",
            "I'm gay and I think your friends are a bunch of assholes who are more interested in appearing progressive than actually being progressive. Even if you really had had sex with this guy, it would be inappropriate for him to out you to all your friends and fucking weird for them all to start congratulating you. Coming out is a fraught process. Your friends outing you and scolding you over it is not a pro-gay thing to do. That you're not gay and didn't sleep with this guy is just the icing on the shit cake. So I don't see any way to read this story in which the conclusion isn't \"OP hangs out with some real assholes.\" \n\nAt the end of the day, you've discovered that your friends do not trust you and value pretending to be pro-gay on social media over your friendship or your actual wellbeing. They're jerks. Dump them, block them on social media and move on.",
            "Maybe point out to the people that are insisting that it happened, that this is no different than a fratbro telling his friends he banged some chick at a party just to get a few high fives. \n\nTell them that if you were gay, you'd have better taste.",
            "I think you should make a new post and say, \"Honestly, I'm not even upset that someone told people I'm gay. I'm more upset about the fact that some of you would have no issue with someone outing me against my will, and also that any of you would believe another person over me when it comes to my sexuality. No one but me gets to define my sexuality.\" And then leave it at that. Anyone who comments and is a douche, block them. Anyone who calls you a homophobe, block them. Any person who tries to give you shit about your sexuality, block them. You don't need people like that in your life.",
            ">A person (a gay man specifically) wrote that he didnt think george would lie about that and that he is disappointed that I felt so embarrassed to come out as gay that I would deny it after, or to accuse a gay man of lying just to protect my masculinity. that comment got 6 likes, and a few people responded saying they agree, that it came off like I was denying it to protect my masculinity, and that they believe george over me. \n\nThat comment right there proves George has spread the lie or that, at least, he's letting it go on.\n\nForeword: I understand that I may have all of this wrong. What follows is conjecture, coming from OP's words. \n\nIt's very simple, really. George was hitting on you. His friends knew he was hitting on you (that's why they made the comment), and when they saw you go up with him they thought it had happened. Of course, it didn't work because you're not gay. But when he came back the story was on its tracks already and George went with it, and now won't admit that it didn't happen because he has a reputation to maintain. George is an asshole and a coward, basically; his friends are the kind of delusional, insufferable crowd who made lgbt identity a clique and thrive on celebrating a vague idea of gayness because they're too vapid to have interesting personalities of their own.\n\nHonestly his lie is very easy to dismantle. If you want, you can just have people confirm with him something about your body that he could only know by seeing you naked, or something. \n\nI wouldn't bother, though. I wouldn't feed it anymore. I agree with other users that the best course of action is to just tell these people to fuck off with their allegations. You can't prove that you're \"not gay\", and accusing you of homophobia is out of line. My normal strategy with people who try to twist my words into their own comfortable narrative is to very clearly take offense, shut it down and end the conversation. \n\nI would post something like \"I don't know or care why George is making these claims, I only know that they are false, and any idiot should understand that I can't prove that something didn't happen. But I take it as a personal offense that you would assume that I'm doing this on purpose, so I will not entertain this pointless argument any further. Believe whatever you want, but don't talk to me again.\" The point is making it about the story. Don't engage with the homophobia acusation, because that's a trap that you can't get out of: if you say \"I'm not gay\", you're in the closet; if you say \"I'm not homophobic\", that's what a homophobe would say, etc. These people thrive on finding a good scapegoat for their political narrative. Stick to the fact that his story is false. If someone asks you \"but are you gay?\", don't even go there, to be honest. \"My sexuality isn't important here. What's important is that this guy has made up a story.\" Don't deny or accept, don't adress homosexuality at all, because that's not relevant, in my opinion. The story is false. That's what matters.\n\nThen, just block these people. Alternatively, you can block without saying anything. ",
            "[deleted]",
            "*\"George, if I were gay, I could do a lot better.  Also, unlike some people, I wouldn't have to lie about who I've slept with to inflate my ego.\"*",
            "Block them all. It's just not something worth dealing with. No matter what they are wrong for doing this. If you were gay they outed you, if you were gay they shamed you on top of outing you because you denied it, I mean this sounds like highschool. Passive aggressive statuses, ghosting after starting a terrible rumor. I just wouldn't want these people to have any access to my life after this. If you say anything else at all I would just be like \"Hello to all. I'm not gay, and even if I were I'd still be blocking you all because you're a gay person's worst nightmare. Say I was in the closet and I did hook up with him. He just freaking told all of you my private matters and you all have the gall to shame me for being upset about it. So efu all and have great holidays.\" Because as upset as I'd be about this I'd be even more upset knowing if I was gay they actually don't give a rats ass about me. ",
            "Honestly, I'd just try to ignore it, and if people congratulate you say something lighthearted like \"It's news to me!\" If you act upset or deny it too strenuously then people will assume it's true.\n\nAnd if they were already joking about you two hooking up, then I think there's a good chance the guy just didn't respond correctly to a joke or question or they drew their own conclusions and ran with it. You might even try sending him a message telling him that you're not pissed at him, but you want to know what happened. Or just let it go, since you don't know him.",
            "Kind of had the same thing happen to me in high school. Had a gay friend who turned out to be \"in love\" with me and told some people we were secretly together or something and I got stuck in the same predicament that you're in now. I had a girlfriend and was comfortable about my sexuality so I didn't take offense to people thinking I was gay, so I just didn't get hung up on it and I didn't address it. I stopped hanging out with that dude because he was obviously manipulative and a liar, and just went about life as normal. People didn't really know what to think of me so I guess that made me somewhat interesting and whenever I was asked about everything I just told the truth. \n\nBut don't be making announcements on Facebook or wherever and don't get angry about the situation. I admit, if I saw someone getting super worked up about that I would suspect they were lying too but obviously I would be in the wrong. Just try to go about things as you normally would and if people try to antagonize you about it, get rid of them because their behavior would feel so much worse to you if you actually were gay. Lots of people will be showing you their true colors, take them at their word.",
            "Hey. I'm gay. And I'm sorry you are in this situation. It sucks. No nicer way of putting it.\n\n\nMy advice is to make another post reiterating that you are not gay. And while your friends may be well meaning, coming out is a private decision*. A gay person outing another doesn't give everyone permission to assume they understand another person's sexuality. If they really want to be supportive they need to take your word for it and end the discussion right now.\n\nThis may sound like an admission to some, but your friends need to understand that they are in the wrong here ",
            "I posted this as a comment to another reply, but I want to also post it as a main level comment to ensure that OP sees it.\n\nAs a gay man, I can tell you that calling out the hypocrisy of these folks will work in terms of helping get through to them.\n\n\"I'm disappointed at the comments that I've received to my prior post here. Those of you who are trying to shame me for standing up against being \"outed\" against my will are missing the point. They should recognize what a violation it is to try and forcibly out a gay man against his wishes. If I am gay, I'm clearly one who isn't comfortable with being out. That's a completely valid choice for a gay person to make. While I do not understand why, I can say for certain that George is lying about having slept with me. This is the last time I'm going to address things here.\"\n\nThat would make an impression on people. If it doesn't, well...they aren't particularly good friends to have.\n\nEdit: For the record, I'm absolutely suggesting you not claim your orientation. That's completely beside the point. Just call them out for their bad behavior and then deny having slept with George. Nothing else.",
            "My friend is trans. For the longest time she denied being any type of LGBTQIA+. I respected it because I firmly believed you know best your own orientation. A lot of people did not and were not only harassing her to just \"come out\" and \"everyone knows that he is a gay dude so what's the big deal\" but also, I and a few other close friends of hers were being told to force her out and chewed out when we refused, yelled at and some even shunned us for sticking up to a friend. When she did come out as a transwoman not a gay man, only one person apologised to her and no one ever apologised to me or the other friends for how people, all LGBTQIA+ people by the way, treated us before she came out. It's ridicolous. People get so worked up about being out and proud that they forget that not everyone wants to be out or that if they come out it might not be that they come out as gay.",
            "Yeah, it is actually considered poor etiquette to \"out\" people unwillingly.  So, anyone who jumps on that bandwagon of \"congratulating\" you is already someone not too familiar with the culture and history of homosexuality.  They are just gossipmongers who are looking to start some shit.  Let them look like idiots in the end.",
            "I realize you can't change this now, but I don't think I would have made a FB status about it. That said, I think all you can do is calmly set the record straight when people congratulate your or if they ask about it. If you want to edit your status by deleting or disabling comments under it, or by just removing the status entirely, that could work well, too.\n\nThere is no need to go shouting in the town square about not being gay. Just calmly say, \"I'm not gay\" and if others refer to that night, you can say, \"We played games and talked about the PC [or whatever it was], then he left. Nothing sexual happened.\" Anyone who persists or accuses you of being a liar can be ignored (or blocked if you need to do so for your mental health).",
            "I wouldn’t have posed to Facebook in the first place, but now that you have I might say something like this:\n\n\n “I’m pretty comfortable with my sexuality and I’d like to think that if I were gay, the same would be true. In my previous post I was met with judgement and outrage for denying (which probably aroused even more suspicion) the rumors about me. I’d like to point out that even if these rumors were true, there is never a situation where it’s appropriate to take away someone’s agency and out them against their will, so please step off your soapboxes. That said, it’s also pretty frustrating to be told you’re something you know you’re not, even if it isn’t a bad thing. No one likes to be lied about sexually. It’s a helpless feeling. I never wanted to embarrass George or accuse him of lying and I don’t even know if these rumors are coming from him at this point. I would’ve loved to have handled this privately but my attempts at contacting him were met with silence, so I had to clear things up publicly. \n\n\nHonestly, I probably should’ve dropped this but I got four “congratulations on coming out!” texts today and I had no idea I was gay/ I’d still very much like girls to date me. If that ever changes I will be the first to let you guys know.”\n\n\nOr just drop it and joke about it with your friends. Fully embrace it. Those are pretty much your only options. ",
            "I'd mention that you've been trying to get ahold of George to sort out how this rumour started but he's not answering you. People should be able to read between the lines enough to get that he's not saying anything because he knows he messed up.",
            "As a straight guy, for some damn reason I kept on getting accused of sleeping around when I was 20.  That was a sad lonely time and I really didn’t have many friends or girls in my life at that time.  The people I knew thought I was having one night stands when they weren’t around.  In truth, I was playing video games alone and depressed with no one to talk to.\n\nMost of the people I knew like this were with me in the military.  When I did sleep with someone, it spread like wildfire in 2 hours.  When my friend’s Mom died and the Red Cross pulled me out of the military for 4 days, no one knew anything about it, friends would have cared, but it wasn’t good gossip. People that act like that, aren’t your friends.  They are losers looking for the next piece of gossip.  \n\nI would say this.\n\n“I do not know what has caused me to be accused of having had sex with George and of me being gay.  I am not gay, I did not have sex with George, and I am not lying.\n\nYou have a choice to make, either you choose to believe what I am telling you, and stop accusing me of being gay and having had gay sex when I have not, or you get out of my life, I will not say more about it, this is a hard line, and if you treat me like this, I want you out of my life.”\n\nP.S. delete all previous notes about the topic.  Delete responses of people arguing about it, and ban people refuting your statements about what happened.\n\nA month from now, take that note down.",
            "Just stop interacting on social media. These people are clearly not your real 'friends'. Your real friends would believe you because your real friends would know you. None of these people know you.\n\nThis isn't social interaction. This is social media. There is a big difference. Unplug. ",
            "You could say:\n1. I did not sleep with George, that is a lie, I have no idea why it was created.\n2. I am not gay, that is a lie, I do not know why I am being denied my freedom of identity.\n3. If I were gay, I would have been outed against my will which is totally unacceptable.\n4. I have no reason to lie about this. I have nothing against gay people. If you think I am being dishonest, you are not my friend.",
            "Just like l tell my teenage son, the way to keep a rumor going is to feed the fire. Every denial, response, or counter attack will keep the rumor spreading. Logic will not work. Only through starvation will it die. But at least humans seem to forget everything within a couple weeks as they will flutter to a new fire. ",
            "What a sign of the times that people now feel the need to congratulate others based on something they can't control, like their sexuality. You're not doing anything homophobic; all these people are virtue-signaling nuts. There's a lot of good advice in this thread. I just commented to tell you not to feel terrible because you're not doing anything remotely wrong. The dude who lied and all these pathetic people are the ones in the wrong here, even if they outnumber you.",
            "use this opportunity to learn who your real friends are. ",
            "Once the horde is after ya I’m not quite sure what ya can do",
            "The other commenters here have a good point to consider cutting off people who refuse to believe you once you make it clear that you did not sleep with him, and that even if you did, you don't appreciate that everyone is so comfortable outing someone who may not wish that. \n\nI would go one step further, because I'm a horrendous person, and make up the weirdest shit about the dude, if he refuses to come forward and clarify that you did not have sex. If it's his friends who started the rumour, it's still his responsibility to clear the air. If he's refusing to respond to direct messages regarding a request to tell the truth, then he can deal with it coming back on him. ",
            "\"If I were a girl and I told you he was lying, you'd believe me and think he's a creep. But because I'm a man you want to justify his lies and creepiness because it's easier than calling him a liar and standing behind me. You're no friend of mine.\"",
            "\"Regarding my last post, this is the last time I'll address this. It doesn't matter if you are gay, straight, russian or martian, people can be douchebags. If I was I gay, you all would already know it. I don't have a problem with it. The point is George is lying. We did not sleep together. I don't really know why this story is spreading, nor who started this. If you choose to believe some twisted rumour, that is your choice. But I am presenting you the facts. \n\nAlso, consider that even if I was gay, do you think this would be the correct way of being outed? This behaviour is unacceptable by any standards. You choose what to believe. But please, do not spread any lies. And also do not rush to conclusions. It seems that when it involves any minority, people tend to jump in the bandwagon before checking the facts. How would people feel if I just started spreading a rumour that I slept with X, Y or Z, when it was not true at all? \n\nThanks for reading.\"",
            "My husband and I went through something like this. Still are in a small way. 'rumors' (and lies) suck. \n\nMy ex best friend is a guy. To make a long story short, he started to say that my husband has drank and passed out so many times... 'who knows what may have happened? 😉' So first he just started to imply that he and my husband 'did stuff' while my husband was blacked out. ( so not true... my ex friend ALWAYS gets blacked out drunk and just assumes everyone else does too)\n\nIt's escalated to the point where if we are in the same building as he is he acts very inappropriately towards us in various ways. He will either be highly sexual to us, or very deliberately an asshole to EVERYONE. \n\nWe do not speak to him anymore, and we cut out anyone who does. ",
            "If I were gay, I could do way better than George.  Besides, he confided in me that night that he has genital herpes.  I wouldn't put myself at that kind of risk of getting genital herpes for some fling.",
            "Delete Facebook. Fuck George's mom.",
            "\"If I were gay, I wouldn't be ashamed of it, I'd be proud and out. But i'm not.\"\n\nPretty much all you have to say.",
            "Then lie back and say you are embarassed because he had a small weenie.  If you cant save your rep.. ruin his.  I mean he did lie afterall.  :)",
            "Post this exact message, in its entirety, on your wall, ending with \"he might never respond!\"\n\nIt's weird and stupid, but understanding the context behind how someone is feeling makes it harder to disbelieve. This is a well-written post that should do the job. ",
            "I'm shocked that no one in your friend circle seemingly find anything wrong with you being \"outed\" by someone against your will. You haven't come out at all unless you've made a statement about it. \n\nWhile I'm no gay myself, I am bisexual so I realize that maybe I'm talking a bunch of bullshit.. But I would be increadibly offended if someone I know publically spoke about either mine or someone elses sexuality without the knowladge or approval of the individual it's in regards to. It could do *so* much damage to someones life if they're outed, but not only that, it's also increadibly personal. As other commenters have pointed out, I would focus on that. Don't put the focus on your sexuality because it's none of their business. Tell them that this if fucking offensive and disturbing behaviour, and tell them that you're increadibly hurt not only by them being perfectly fine with you being seemingly outed against your will, but that they would also not trust you. The people who won't listen to you are probably not worth the effort and can go fuck themselves.",
            "Not helpful, but it reminds me of the \"Life of Brian\" movie where Brian has to deny he is the Messiah.\n\nYou could always post the clip with a still not gay comment.\n\nOn a serious note, harassing you like this must make it difficult for any friends they have who are not sure how to come out. Who would want to end up in that kind of mess. Maybe remind them that they are making it difficult for friends who want to come out, but aren't sure how.",
            "Honestly I'd be blocking everybody who, after you've denied it, insists that its true. It doesn't matter how or why they get there, its extremely obnoxious.\n\nThese people aren't your friends and George is toxic. He must be the one spreading it otherwise he'd have surfaced to correct everyone.\n\nI'd honestly just go nuclear, I;d make another statment along the lines of what others have said (i.e. even if you were gay you would have been outed against your will and that is NOT ok. And then I'd tell everyone explicitly - for that reason alone if you chose to dismiss me saying my truth, you are blocked) and move on. Easy \"friends\" cull",
            "He is saying he has sexual relationship after giving you illegal drugs. Perhaps you were raped and do not recall the sexual assault due to the intoxication. In that case this guy is bragging about raping you on facebook.",
            "Choose better friends next time.... yours sound like a bunch of losers.\n",
            "I feel like this should be laid out as simply as possible since some of your so called friends seem dense. \" So there's two options. Either I'm gay and don't want to be out yet and being forced to, or I'm not and George is lying and I'm being made into some sort of homophobe when I'm just the target of unfounded rumors. Both are pretty bad and you should be ashamed of yourselves \"",
            "Just let it blow over. They will realize your aren't gay when you date. Assuming you date. ",
            "I'd do one last post to make things perfectly clear.\n\n\"Hey there.\n\nI'm going to make one final statement on this, and then I'm going to stop talking about it completely.\n\nFor anyone who isn't familiar with this particular ~~shitshow~~ series of events, the basic gist is that I spent a few hours hanging out with a guy who I thought seemed ok at the time. We played some games and talked for a while and then he left. Everything was fine. But then he told a bunch of people that, instead of just hanging out, we'd had sex.\n\nThat really pissed me off. I'm not sure why he did it. Was it for attention? Maybe? Was it to make himself seem cool? (look at me, I just had sex?) Does he have some mental health issues? I don't know and I honestly don't care. That's his problem to sort out with his therapist.\n\nWhat really pissed me off though, was that a lot of people believed him. Even when I told them it wasn't true. They just assumed that I was lying out of shame/to protect myself/whatever. That was really shitty of them.\n\nSo let me make things really clear, for those of you who have trouble understanding simple concepts.\n\nI'm not gay. \n\nDo I have a problem with gay people? No.\n\nAm I offended that some people now think I'm gay? No. There's nothing wrong with being gay. And what they think isn't actually going to affect my life. They can keep on thinking it if they really want - as long as they don't keep bothering me about it.\n\nIf I actually was gay, I'd own the shit out of it. I'd be the most fabulous queen you'd ever met. They would give me medals for it. And I'd totally get all of the hottest guys. \n\nBut I can't do that, because I'm straight. I'm just not into dudes.\n\nAm I angry that some people aren't taking me at my word when I tell them that I'm straight? Hell yeah. And if those people don't start respecting me? I'm not going to have much to do with them from now on.\n\nAnd one last thing.\n\nIf I WERE gay? I'd sure as hell be able to do a lot better than George. Because not only is he a liar, the lie he told could potentially have been really damaging to the person he told it about.\n\nThink about it. He didn't know at the time that I was definitely straight. To him, it was possible that I WAS gay. And if I WAS actually gay? Then that would have meant that he'd outed someone without their permission.\n\nAnd that's a really shitty thing to do to anyone. I'd like to think I could do better than a guy who would do something like that.\n\nThat's it from me. Peace out.\"\n\n ",
            "Because no man has ever lied about sleeping with someone? Lol\n\nIve heard men and even women lie about their sex partners. If you say you arent gay then you arent. If someone wants to say they slept with you and lie to friends then you tell them they are a terrible person for deceiving others and tell him you can revisit friendship when he comes clean.\n\nIf your friends refuse to believe you arent gay and even belittle you for telling them otherwise then tell them that they are not you and you are not gay- that it hurts your feelings they would FIGHT YOU over whether or not you are gay. Let them know that when they decide to actually listen to what you say then you can revisit your friendship.\n\nBlock them and make a post about what happened.\n\n“It appears that a now ex friend of mine spreads rumors that I had sexual intercourse with them. It is not true and I hope you can take my word for it.\n\nI do not identify as gay. I identify as a cisgendered straight male. If you want to question that or argue over it then feel free to unfriend me because im tired of people attacking me as if I did something wrong.\n\nHave a good day”\n\nIf you’re pety like me you can just say fuck off but whatever you wanna do",
            "\"Its just a prank bro\"",
            "just have a calm, metered response like its some wierd rumor, maybe make on facebook post, people will get bored and definitely reevaluate your friendship with this guy, wtf",
            "Sorry to hear this happened dude.  That George dude is a bastard and your friends are gullible. \n\nThough don't worry about this hanging over your head forever. It's like the news cycle with friend gossip. That stuff has a shelf life of a few days to a month tops. This isn't high school and this kind of behavior doesn't need to be tolerated.\n\nSo if you're friends can't listen to you. Which you should have the benefit of the doubt. Since you know yourself better then some random dude. Then it might be worthwhile to kick some people to the curb. \n\nAlso for your friend who said \"Its ok to be gay just in case\" Just sounds like they were covering every base and supporting you. Because it's true some people have trouble coming out. \n\nStick to your statement and leave it at that. If you keep picking at everyone's deluded comment about your sexuality. It will just keep this topic fresh in peoples minds  and you don't want that. \n\nPeople are gonna believe what they want. So be confident you know who you are and fuck what ever anyone else thinks. \n\nAlso I don't know if this is pertinent. But maybe save/screenshot all conversations and what not. just in case you want to go legal with this. I don't know what you could do. But it's best to save the evidence. Especially if that George dude made that statement in writing.\n\nHope this all blows over soon dude. Take care.",
            "Tell them he gave you an STD from his micropenis",
            "Don't react to it. That's me. When I was 13 I had family member post on my Facebook I was bi. It went around so quickly and everyone believed it. I fought and fought it and everyone asked why I was ashamed. I said I wouldn't be if it was true. They called me a liar and proceeded to hook me up with girls. Anyway, I always blew it off. Is hang put with them and explain the situation and they eventually would ask \"so, you're not bisexual?\" A few weeks later it just died down. \n\nWhat I'm trying to get at is, the more you defend yourself, the more people call you a liar. When you get defensive no one believes you.\nLet them think what they want, you know what happened and George knows what happened. Rumors suck and you either feed into it, or ignore idiocy. Don't fight, just let it go. It's easier.",
            "Bro, you are really bad at this shit. You should consider hiring a publicist because you are out classed here. /s\n\nI can get why this is frustrating because as you said: nothing wrong with being gay, you just ain't gay. Unfortunately just saying you're not gay is not cutting it. Blasting messages like that out is for people that are too embarrassed to address people in person. (People are going to call me an angry old bastard for that I suppose)\n\nHere's what you do to fix things:\n\n1. You probably need new friends: George seems like he either started this or is letting it ride. Fuck George. No more sweet computer games for George. Also, definitely no sex with George. You should probably not engage with George in social settings anymore... People will probably be understanding of avoiding George in light of part 2.\n\n2. Flip the fucking script: Respond to the core group of people that were there that night and are likely your ground zero crowd for spreading the rumors. You send them this message:\n\n>(Person's name), I have been really upset and hurt by everything that has gone on. I am devastated that so many people want to broadcast intimate details they have heard about me. It feels really invasive and I just don't know how to handle all this public humiliation. I can tell you one thing with 100% certainty: I have never and will never consent to having sex with George. I suggest you consider asking George what really happened that night and I hope you can see fit to giving me a reasonable level of privacy as you would grant any other friend.\n\n**BOOM** and now you're playing chess brother.\n\n3. Address the spread to the best of your ability: For anyone coming to you to congratulate your coming out, you respond with this:\n\n>(Person's name), I am a little baffled by all the people that have talked to me about coming out. I am not sure who has spread this rumor to you, but I can assure you completely that I have not come out to anyone. Any person that may have told you that is completely mistaken. This may have started with some rumors by (ground zero crowd). I am not sure if they thought that was some sort of joke but I can assure you I have not come out to anyone. Thank you so much for understanding.\n\n4. Close the loop: Hopefully step 2 will yeild a quick retraction, but if not now we come back to address George. If George has not recanted at this point, I would recommend you send via certified letter, this:\n\n>George, I have really been struggling with all that has transpired in the last weeks. My head is still reeling and I am not sure what to make of this. There are numerous people saying that we had sex the night we went up to my place to look at my computer and game. This terrifies me because I have no recollection of that occurring and can say with confidence that while I have appreciated our friendship in the past, there is no way that I consented to having sex with you. I need a written and signed response as to your recollection of what transpired that evening in the next week. If we did have sex you and I need to discuss this because it was certainly not consensual. If I do not receive a written and signed response from you in the week allotted I will have to report the assault to the police and have them take statements from everyone that has given accounts of a sexual encounter between us. I am very saddened by the need to send this letter but I feel I have no other options as you have actively avoided my attempts to speak with you to clear up this matter.\n\nBefore any of this I would highly recommend you remove any illicit items from your home as if you have to go to the police they may need to come take a statement. Please be 100% honest with the police about the pertinent details of this issue.",
            "This is a Kafka trap, it's like the chinese finger trap of Arguments. You deny it and it digs a bigger hole. Anytime someone calls or mentions or even references your 'homosexuality' just say 'Im not' and move on. \n\nIt'll take some time but eventually, especially if you have girlfriends semi-regularly, it should go away.",
            "My thoughts are lying about sleeping with someone is really scummy, and a bit weird. But the thing I would have an issue with here is being ‘outed’ (no idea if that’s an appropriate term, anyone feel free to put me right) against your will if you did happen to be gay... from what I understand coming out is a huge deal and George would be pulling a major violation of trust, even for a friend forget a potential partner... IF he did start these rumours, because that’s all they are at this point, you need to stay clear of him because god only know what else he will make up, liars will never fail to amaze with the nonsense they can concoct. You might end up in jail or worse if you’ve somehow ‘offended’ George in this little scenario he made up in his head. Then you need to hope that your circle of friends knows you well enough to know that you mean no offence or homophobia, but you certainly are not gay but if you were shouldn’t that information come from you and not second hand from old George? (Personally I think your friend who commented is foolish. I read this and the last thing that crossed my mind was this guy is looking to tear anyone down.  Some people are just in a contest with themselves to get offended by everything.)",
            "Man high school is weird as fuck...\n\n*looks at ages*\n\nWhat the?",
            "I think most of the commenters so far have a lot of great suggestions for how to handle this, OP. \nMy .02 is to think about how it feels to have this happen once to you and realize that it happens to gay people all the time. When I was a teen I was out as a lesbian, yet somehow almost everyone assumed I was straight. If I went (like you did) up to some guy's room to chat for a minute and do some coke (something I did often as a teen, lol) people usually assumed we had sex. I had to just deal with that fact. Since other guys saw that I seemed to be having sex all the time with guys who were actually just my friends they decided it was okay not to believe that I was lesbian and hit on me hoping for sex-ALL the time. It's actually the main reason I cut my hair super short now, so guys won't assume I'm straight. Anyway, the whole people thinking you're some sexuality that you're not--yeh, it's not fun, but it also doesn't matter what they think. The only people who matter in regards to your sexuality is the girls that you'd like to date. Ignore the people who think you are gay now or some bullshit. You don't really even need to deny it because it only matters in that having dudes hit on you all the time is annoying. If that happens, I'm sorry OP. :/",
            "Also you shouldn't do coke.",
            "This sums up the current state of American culture pretty well.  ",
            "This is why I deleted my facebook. Its just a cesspool of trolling and bullshit. Dont waste your time with these idiots.",
            "Choose better friends next time....  yours sound like a bunch of losers.",
            "Delete comments from nay sayers. Don't let people see that and block people who are posting about your business and \"straight guys protecting their masculenity....\"",
            "If people believe that, then they clearly don't know you too well. If they don't, why are you bothered about what they think? Just drop them. Get some new friends. ",
            "Do you have business contacts in your friend’s list? If so, go speak to an attorney, the consultation is free with many. Ask them to draft a letter to George about his slanderous comments to your friends. Then have that delivered with signature required. Then post the letter online and tell them any libelous posts will be met with contact from an attorney as well. Only do this if you make a statement that there’s nothing wrong being gay but to insist that you are something you are not is detrimental to both you and actual gay people. \n\nShouldn’t cost much for a quick letter after the consultation. ",
            "I do know that the more you stir crap the more it stinks. You have stated the truth and there is nothing else you can do convince those that believe it.  Move on. Don't discuss it again. Your future actions will be proof enough.",
            "A similar thing happened to me, with my best friend (F) who was also good friends with my boyfriend. She told him that we had had sex, if not some sort of relationship. I was shocked. And very mad. We (my boyfriend and I) just fought for a while. \n\nI don't know why you went to Facebook with this. I kept it private, as it was just between me and him. Ultimately he believed me, but my \"best friend\" did very little (if anything) to right the situation.",
            "I really think that you are being pranked really hard.",
            "Have a lawyer send him a threatening letter, telling him to tell the truth or he'll be sued for slander",
            "So tell your friends you have no problem of coming out if you are gay. He is just not your type. ",
            "Time for new friends, and a new circle",
            "Get of social media and wait for it to blow over. \n\nIn the end you know your sexuality. If people bring it up don't get mad at them. Calmly explain what happened and that you have no idea why the rumor started. \n\nPeople will think what they want but it doesn't affect you. ",
            "I might say to the comment: that’s true if I were gay and this wasn’t a rumor. Unfortunately, I am not gay and this is a rumor. Would you please have George reach out to me to explain? Thanks.",
            "This is something that is done to get back at you for something. ",
            "Bad Advice: You're now a gay man without the benefits. Damage control: come out as Bi. ",
            "You have So much power now op.\n\nYou can quite say anything you want. \n\nMight as well have some fun. \n\n\n\"He kept calling me daddy and had a micro penis\"\n\nLol, make the story so horrible that he has to admit the truth lol",
            "Oh and you should totally Delete the guy and girl and maybe even the people who liked that comment about you \"denying\" it.  You can delete comments on your posts. ",
            "That girl is such a drama queen, mind ur own business.",
            "I had a massive rumor about me being gay for a while.  It was amongst my high school circles, but when I was in university.  Some girl started it as revenge for something she thought I did.  Anyways I just ignored it or laughed it off if anyone asked or said anything.  After a while of me bringing girls around and, ya know, not being gay, the rumor just went away.  Took a couple years though probably.  I literally gave zero fucks the whole time, it was just funny to me.  ",
            "In middle school I got in trouble for kissing my best friend on the lips. It was very public and the rumors spread like crazy! My friend actually talked to a younger relative attending that school and [my name]+[her name] with a heart around it is still carved into the wood into the wall of the science room. My friend has a very unusual name so her family member noticed it. We never could shake the lesbian thing after that. I also have always had short hair and used to be flat chested and dress boyish and hung out with boys setting stuff on fire so to outsiders it looked legit. In high school a girl that was a lesbian and knew some of the lesbians at my school saw me at the bus stop in my uniform rocking a freshly shaved head and started asking around about me wanting to date me. So since I had a shaved head+ was obviously friendly with and talking to the known lesbians at the all girl high school it just picked up and continued on. It never did help I was a tomboy but I wasn't going to change my style. I liked who I was and never really denied it too hard because from the beginning I realized that this is a thing where the more you deny and seem like you care the more you convince people of what they want to think.\n\nI now have been working as a cook in restaurants for years and also when I was younger worked at a wood mill as well as some other male dominated places. I can drive a fork lift, I'm very petite but strong physically and people are surprised by my self reliance at work some times because I don't just let the guys carry all my heavy stuff. I don't have shit to prove I'm just trying to be a good co worker! Well even though those rumors are long dead I can still tell that when people meet me when I start a new job they can't tell if I'm gay or not and are trying to figure it out. \n\nJust roll with it it's not like girls hate talking to gay dudes and the people who you are going to bang will believe the mix up. I wouldn't fight it too much though because in my experience that did the opposite. Now when people figure out that I most def have sex with men they'll sometimes be surprised and certainly every lesbian I have worked with was not sure at first and trying to figure me out. \n\nIt's so weird to me because I'm much more girly now than back then and I don't feel like I look butch or anything but there is something about my personality and life experience that tells people I might be gay. It's been going on more than half my life now and I don't really care anymore I don't try to help people figure it out even because they always eventually come to their own conclusions and I have a good sex life so fuck it!   ",
            "This is one of those times when you need to get a bit cruel. As in laugh like hell and start telling mutual friends this person is having a psychosis of some sort and is seriously delusional. And that they need to urge him to get some mental health help, which come on they do. \n\nWhen people don't believe you say, \"Well, I mean of course I can see how he wanted all this, but nope I like women. It sucks for him I know and I'm sorry he's so deluded he thinks saying it means it's true. I hope the guy can move past this, because I sure have.\"\n\nThen switch the topic. Treat this like a joke/wow there is something wrong with that guy. Drop anyone who continues it and maintain that there is something wrong with dear George for letting his fantasy life get so out of hand. \n\n",
            "Well, if George is telling everyone you slept together maybe you should tell everyone that George gave you an STD he lied about not having. Nah, that's probably not a good idea. But maybe you could sue him for sexual harassment or something - you definitely didn't want this kind of attention from him so it would probably legally count as sexual harassment if you want to sue him for it.",
            "I'm bisexual. I spent two years making out with women while still calling myself straight. My friends correctly guessed I was closeted, but they didn't say a word until I actually came out to them as bi. \n\nIf you WERE gay, it would still be your choice to come out or not. Your friends are behaving terribly regardless of your sexual orientation. ",
            "Hey welcome back to high school!\n\nSeriously, just ignore it and move on. At most, just repeating \"Not gay.\" without any further explanation, and then \"Still not gay\", and \"just checked again just in case, but nope, not gay.\" \"Thought I might be gay since everyone was so insistent, but then I wasn't.\"\n\nTurn it into a joke and roll with it. No one actually cares, and no one worth even paying attention to would let it actually affect their behavior toward you. \n\nTell the gay guy who protested you're sorry to ruin his fantasy, but you are in fact still not gay despite his desires for the contrary.\n\nAt the end of the day, who cares. If the whole world thinks you're gay, it really honestly does not affect your life. Move on, ignore assholes who can't figure out that it was none of their business to begin with.\n\n\"Not gay, not homophobic. Hung out with George, had fun, but i'm 100% sure we were fully clothed the whole time. Maybe 95%\"",
            "You can bring up a different perspective:\n\nImagine waking up to people telling you congratulations for converting to Catholicism, and how pleased they are that you've gone public about being part of the Catholic Faith. \n\nYou're not Catholic and ask what they're talking about. They then say that they heard from an openly Catholic man that the two of you attended a Catholic Mass together. \n\nYou explain to them that you went to the library with your Catholic friend, and that you're not Catholic. You are then met with anger and people accuse you of hating Catholics and that you are insulting Catholics by not being openly Catholic. They insult you and tell you you're a bad person because you deny your Catholicism and you should be ashamed for saying you're not.\n\n\n\n",
            "> I dont know what got into him\n\nCocaine. Cocaine got into him.\n\n\n\n\n\n\n\nApparently you did not.",
            "As someone who is gay I am mad for you.  Mad someone would try and it you AND lie about it.  Made people won’t accept that you are not gay.  It is so aggravating I would more than likely cut these people out of my life if I were you. ",
            "Sounds like you have a really shitty group of friends. I'd ignore all of them! ",
            "These people aren't your friends. ",
            "Regardless of gender or sexuality, it’s beyond uncool to spread rumours of sleeping with someone. If you were female and he was male and he was spreading this rumour would the people blasting you shame you for defending yourself and saying “this isn’t true and this rumour is really hurtful”?\n\nWhy does the fact that it’s a gay man change anything? Why is it okay to bash you for “protecting your masculinity” if you WERE gay and wanted to not be outed? \n\nThe guy isn’t responding to you because he knows he messed up. I see this ending badly in him lying to cover his own ass. ",
            "Get a girlfriend problem solved right?",
            "TAPE HIM. Confront him in person, and TAPE THE CONVERSATION. Put it up on Facebook and watch the idiots melt.",
            "Post screen shots of you calling and texting him",
            "[deleted]",
            "Dude, you're in a lose-lose situation. Denying being gay (whether genuine or not) seems to just stoke the fire. I suggest not denying or confirming your sexuality - its nobody's business anyway.\n\nIf someone congratulates you for coming out, \"Just say, \"Thank you, but I'm really not gay and congratulating me is taking away the importance of coming out from REAL gay people.\" If they insist you must be gay, just ignore it and move on. You repeating the claim might be seen as denial. Tell them once and only once and then stop wasting your breath. Let them think what they believe. Them believing you're homosexual doesn't make you so.\n\nThey might get a kick out of it like they think they are pushing your buttons. If you react then they'll keep doing it. Either they sincerely believe you are gay and are scared to come out of the closet (none of their business anyway) or they know you're straight and are just having fun at your expense. Suck all the air out of their balloon by not reacting and make it really not fun for them. They'll stop or at least it will happen more often.\n\nTl;dr: Let this rumor die out. You can't prove a negative (that you are not gay) so just don't waste your time. Maybe get some new friends who will believe you when you say something and don't push your buttons. Also, decrease your coke usage with strange gay men.",
            "I don't know about you, but I have some gay friends, and in more than 5 times, they needed to sleep in my house (after too much drinking)\n\nOne time, we even shared a bed\n\nAll the people around us thought that I had sex with these people. I just said \"no\" one time, and it's done. I don't care about it.\n\nFor real, it have zero interference in my life.\n\nTry to discover if there are someone making this rumour to damage you. This exact person must be cutted off (and the gay accusing you of homophobia and the girl posting bullshits about you protecting your masculinity)",
            "[removed]",
            "Don’t need to be hetero sexual. Or macho, or masculine,  nobody should lie about that.  \n\nBut at the same time, don’t make it such a big deal that you’re not gay.  Like. Who cares about sexuality really?  It’s the principle that he lied.  He lied about something personal and made implications about you which were untrue. ",
            "You've already gotten tons of good advice so as a girl who was once in your situation (some dude was saying he'd slept with me when he hadn't) I'll share the (incredibly petty) thing I did which was to say 'oh yes that totally happened' and then follow up with some ridiculous lie about him.\n\nExample:\nOk you got me, I definitely slept with george. While we're sharing personal information did you know he can only get off if he's wearing Elsa's dress from frozen, and he bleats like a sheep through the whole thing? And he has a micropenis?\n\nPeople tend to start getting the message really quick. And the ones who actually take you seriously will get back to George who will I guarantee you stop talking shit real fast. ",
            "Tell them you used to be gay, but you were cured.. through prayer.  And, would it be okay if you gave your pastor their number so he can help them be “cured” too?",
            "Those are not very talented friends you have there, man.\n\nIf you want to be pure evil you could claim having gotten HIV and another STD from him in a few months time. Tell people that on Facebook and all other social media, tag him in it as the cause.\n\nLet's see how quick he is to say you never had sex.",
            "You could turn this around on George and make a public post about how George is trying to coerce you into having sex with him (that you as a straight male don't want at all) by spreading false stories about how you two have already had sex and than you're gay. How George is sexually harassing you.\n\nYou can give that story credence by filing for a restraining order against him.\n\n\nI know it isn't honest, but neither is George, fuck him for lying about you, you're just protecting yourself now.",
            "I'm not sure why people get so worked up over this stuff. You're not gay. You know you're not gay, so really, what does it matter? People will move on and stop giving a shit if you just laugh it off. The harder you fight this, the worse it gets. When it's brought up just stay calm and say it didn't happen. If they argue, just say something like \"well, you would know better than me if I was gay\" and then change the subject. ",
            "what does it actually matter if people think youre gay? people also think that god exists and vaccines cause autism. youll go crazy trying to make people believe the truth",
            "If you can find George on fb tag him and ask him why the fuck hes telling people you guys had sex. Im petty though soo...",
            "[removed]",
            "[deleted]",
            "This probably isnt too popular of an opinion, but personally i dont give two shakes of a rats ass what people think of me. My friends understand who i am and stangers are irrelevant. Let them think whatever they want, when it comes down to it theyre opinion of you wont change the fact that you are really straight, that business is between you and your sexual partners...\n\nThat is unless that you really are gay and these feelings are just the repressed cognotive dissonance of living in a patriarchal society.",
            "Maybe this is a golden opportunity to explore this side of yourself? Just my two cents.",
            "[removed]"
        ]
    },
    {
        "post_id": "dq6oky",
        "author": "AintNoLawsWithClaws",
        "title": "My (33f) bf (33m) keeps condescendingly saying “I have a job” as a response to things, yet he says this to me and our friends who also work, so it doesn’t make sense. How do I explain that this is a weird thing to say?",
        "url": "https://www.reddit.com/r/relationships/comments/dq6oky/my_33f_bf_33m_keeps_condescendingly_saying_i_have/",
        "score": 3652,
        "num_comments": 455,
        "created_utc": 1572626067.0,
        "selftext": "**EDIT #1: Oh man, this blew up more than I expected. Thanks for all the insight so far. I got a lot of responses that made me realize I did not paint a clear picture on some vital points, which I will do here and continue to add.**\n\n**a. Him saying \"I have a job\" involves a specific tone and inflection which is where the rudeness comes from.**\n\n**b. This is not his first job, nor his first job working these hours by any means. Nothing about this job is new beyond a different industry/company and the payraise.**\n\n**c. He goes out almost every night. To the bar. With or without friends. I am typically invited. I see him about once a week because of me needing time alone to do work / study, not him. I do not live with him.**\n\n**d. Him saying \"I have a job\" in this manner to our friends - not just me - is what made me see this as less of a \"he doesn't respect my job/work\" and more like a \"he doesn't realize how he comes off\" situation.**   \n\n**e. Yes, he is a functioning alcoholic. That is another conversation**.\n\nI'll try to add more as I realize what I've missed and respond to people. Thanks again.\n\n\n\nRelationship: off/on for about 2 years.\n\nI’ve been working from home for a while (freelance) so that I can take classes I need as prereqs for a graduate program. It’s been taking like... years (3?) but I’ve also been working. I finally took on freelancing/working from home so i could take certain classes that typically conflicted w normal work hours. It’s great. It also has created a less predictable sleep/work day. \n\nRecently my bf also got a new job which pays better and also requires more hours out of him. He used to wake at like... 10am-11 and leave work around 5 with a flexible schedule. Now he gets up at 6/7 to get to work at 8am.\n\nThis is a bit of background to explain my interpretation of bf’s behavior. \n\nMy bf started saying “I have a job” as a response to things, questions, comments. Things like “You should stay over at my place” or “Are you going to bed?” or especially “Are you going to the bar tonight?” even, which he does every single night and drinks with whoever there. I used to think this kind of response was just directed at me due to my working from home and working to start a new career. And yes, I find it insulting.\n\nJust last night we were at a friend’s house gathering, sitting around the fire drinking, and he kept saying he wanted to leave (yet filled a cup full of wine for the Uber ride home), so we started to get up to go. A friend made a comment like “awww you’re leaving! I wish you’d stay!” Or something similar. \n\nHis immediate response: “I have a job!” ... almost like an incredulous response. \n\nThis friend had a brief moment of confusion and said, smiling, said I have a job too!”. My bf just kept going, saying “I have to be there at 8!” And she again responded “I have to be at my job at 8am too!” and having this look on her face like... thinking this was funny in a way? Like she’s in grad school and working and hearing him say this to her. Like, man you’re talking to a bunch of 30 year olds not some fresh college grads. \n\nI tried to tell him that it doesn’t make sense for him to keep saying that to people... like who here doesn’t have a job? That it sounds condescending and it doesn’t make sense.\n\nHe just gets offended and pissed and shuts down. I don’t know how else to explain it to him. Help?\n\n**tl;dr bf keeps saying “i have a job” as a response to  people’s comments which is weird and condescending, and he gets offended when I try to tell him this. Don’t know how to proceed**",
        "permalink": "/r/relationships/comments/dq6oky/my_33f_bf_33m_keeps_condescendingly_saying_i_have/",
        "comments": [
            "[deleted]",
            "It sounds to me like he might just be upset/jealous that his new hours are cutting into his drinking/fun hours.",
            "My bigger question is that he goes to the bar every night. Every night?! I thought only husbands in sitcoms did that.",
            "It looks like there are two issues here: his punctuality, and the way he communicates. You said in the comments that he used to not care about being punctual at his previous job. Now he does. It's likely that this is stressing him out and taking up a lot of energy, and he might be worried about slipping and getting written up or fired for being tardy. The pressure/invitations to stay out late are clearly getting to him, because under normal circumstances, he'd love to do so.\n\nLet me make this clear, though: *this does not make it okay for him to snap at other people.* I struggle with chronic lateness, and it takes a lot of planning for me to be on time. But it's never okay for me to take that out on other people who have no issues staying out late and getting up early.\n\nMoving on, here are some things you can say in the moment:\n\n\"\\[Calmly\\] I know you have a job. That doesn't answer my question.\"\n\n\"If you don't want to stay over at my place, I need you to say those exact words. You're my boyfriend and I want to spend time with you. I am also willing to help you get out the door on time if that's an issue.\"\n\n\"What time do you want to leave after trivia?\"\n\n\"I know being on time is important to you and you're working hard to change your habits. I need you to stop taking your stress out on me and our friends. All you need to do is tell us what you need.\"\n\n**EDITED TO ADD:**\n\nAlso, he has a habit of drinking until 1-2am (and drinking more after he's left the bar)? You said in your edit that it's a different conversation, but this new schedule also affects his drinking habits. This post might fall under the umbrella of, \"How does my boyfriend's relationship with drinking affect the way he treats me, and our relationship overall?\"",
            "Hi, I was a functioning alcoholic until I wasn’t. You’re boyfriends behavior sounds really familiar to me. At the end, before I got help, things got really bad. I wanted to drink at home alone - a bar alone works too- where I could drink as much as I wanted to without anyone caring or noticing. \n\nGatherings where people weren’t drinking as fast as me, or where there was just a bottle or 2 of wine for everyone made me really antsy. I just wanted to get home where I had my own supply of booze.\n\nSo he says he wants to leave - he may be already agitated at moderating his drinking all night. And when people say, “hey stay longer” he says, “I have a job.” It’s a legitimate excuse to go home. A responsible one. Does he go to bed right when he gets home from these events or does he stay up and drink?\n\nI could be reading this entirely wrong. I just speak from my own experience. I hope I’m wrong. But I got a weird familiar feeling when I was reading this.\n\nThe slide from functioning to non-functioning can go incredibly fast. Take care of yourself, OP.",
            "I mean he sounds like an alcoholic that is mad that he doesn't get to sleep in as long anymore and is projecting all of his anger onto everyone else lol",
            "\"Bf, when you say \"I have a job\" it comes off as really insulting- everyone has a job, and yours is not more important. It makes me feel like you don't think my job is real. I do have flexible hours, so maybe instead you should say \"I have to be up early\"?\"",
            "Honestly, sounds like your bf is salty he has to get up in the morning and work a full 8 hrs (10-5 is only 6). He needs to stop being an ass and this might justify a conversation about his attitude about it or, the next time he gets all \"I have a job\" someone should say something like \"we all have jobs and none of us appreciate you implying we don't with your attitude.\" Or \"and we don't? So and so was only expressing that they enjoy your company, but we not any more so have a good night\" or just \"wow, that was unnecessary\". Return his awkward \"I have a job\" right back at him.\n\nSometimes people don't get what dumb thing they're saying is implying to others and need it spelled out that they're being jerks.",
            "Honestly I think, when things like this come up, people just have to accept that the other person is doing it on purpose. Yes, he said it to be condescending. That's why he tried to back it up with \"well *I* have to be there at 8\" and he just doesn't like hearing feedback about it because he doesn't want to change and that's it.",
            "[removed]",
            "I'm more interested in this part:\n\n> He just gets offended and pissed and shuts down. I don’t know how else to explain it to him.  \n\nIf he's not receptive to you talking to him about it, you might be at a standstill, especially since the usual prescription for relationship issues is communication. Failing that, the best option I can come up with would be to decide on a consistent, bottled response that you use for this, especially when he says it *instead* of actually answering your question. Eg, \"Are you going to bed?\" \"I have a job!\" \"Okay, so do I. So are you going to bed or what?\" When he inevitably gets frustrated by one of these interactions, explain that you are actually aware he has a job, but that doesn't always mean he isn't staying over/is going to bed/isn't going to the bar, and it'd be more helpful if he were honest with you when he doesn't want to do something instead of deflecting it this way.\n\nIdeally you would also address the fact that he seems to think freelance + school is less legit than a 9-5, but you might need to tackle that separately if he's not down to communicate about it.",
            "The functional alcoholic part is not another discussion, it's this discussion. \n \n\"I have a job.\" Is something you say defensively.  Something you say to prove that you're doing fine, that you're not making mistakes, and that you're still in control as a responsible adult.\n \n\"I have a job\" means you can't judge me for getting drunk every night. I'm keeping it together and showing up to work. \n \nI doubt he has any intention of being rude. He's scared to death, and those words are his talisman that everything is still ok.",
            "Maybe let him know saying something like \"I work tomorrow\" is a more appropriate way to word it.",
            "He’s basically angry he has to act like an adult.",
            "Get him a t-shirt that says \n\n\"I have a job\"",
            "Your boyfriend may also be an alcoholic? I know that's not what you're asking, but going to the bar every night is not healthy at all.",
            "I'm sure you'll get plenty of replies to help you with his weird attitude about his job, so I'm just going to address something else: your boyfriend is a severe alcoholic. He may have a job, but it likely won't last. In fact, I get the feeling that his \"I have a job\" statement is mostly him trying to convince himself that hes in control of his life, when it's really almost completely out of control.",
            "Me thinks your boyfriend is very immature for his age, and maybe insecure about his job status somehow, or WAS insecure and is now validating himself? Very strange responses from that dude. Everyone works.",
            "You’re just gonna have to snap back at him, something that will embarrass him for saying it. “I have a job!” “Welcome to the club!” What was he a waiter or bartender or something before?",
            "Your boyfriend reminds me of my step-dad. He sounds insecure and bitter about his lot in life and unable to adjust to the new lifestyle his new job demands, so he's just taking it out on others and pretentiously playing the martyr at the same time for the ego boost. \n\nThe drinking is only going to make this type of behavior spiral. Staying out every night drinking past 11 when you get up at 7 is practically the definition of alcoholism. He won't ever mature out of his resentfulness and learn to appreciate life with a drinking schedule like that.",
            "Buy a sheet of gold star stickers and next time he says that bust out a sticker for him, saying \"Wow! Good job!\". Then give one to everyone else who has one as well. \"Oh you do too? Wow!\"\nJk that might not go over well but it's super tempting.",
            "You understand he's an alcoholic, yes?",
            "No one needs a reason to leave a gathering. Complaining or asking why is just a social game people play. No one is going to stop being your friend because you can’t satisfy them with a good reason to leave.\n\nWhen it’s time to go home and someone complains or wants to know why, set an example for your boyfriend and say “No reason in particular. I don’t have to get up early. I’ve enjoyed hanging out and it’s just time to call it a night.”\n\nI’ve always respected people who can do that consistently. Its an indication that we’re all grown ups now.",
            "This might be off base, but it sounds like he has been a very immature person for a long time. He never had to wake up early for his last job and he has been a functional alcoholic for a long time. I get the sense that these two things combined are the reason for him pointing out his new job so much. He sounds anxious about the early rise time required for his new job and the fact that drinking late so often may make him late to work. He is expressing these feelings in an odd way but I think it might be related to the alcohol problem. People with alcohol use disorders rely on and frequently use thinking distortions, such as minimization, exaggeration, and rationalization in order to prove that everything besides their drinking is a problem. \n\nHim pointing out that he has a job so often is like him saying “look, I am responsible and I can’t possibly be an alcoholic, you guys staying out longer proves you’re less responsible than me, maybe you all have the problem”.  For him this simultaneously eliminates two issues; drinking is a problem for him and he feels insecure about his ability to maintain a regular job. Obviously his response seems out of left field and it can be condescending to many people but he isn’t responding for the benefit of others. My guess is that he is trying to convince himself he is a responsible and sensible employed person with no issues. It seems to be becoming a type of mantra he can use in order to maintain his disorder and not have to consider change.",
            "Ah this one's obvious, he's resentful and jealous that he now has to wake up at 8am. He thinks he has more of a job then you since you work at home and he's trying to make you feel insecure about it.\n\n\nYou need to have a very clear and honest discussion with him about this and ask him how he feels and tell him you won't tolerate it anymore.",
            "I'm a little late to your post so I haven't read all the comments,  but I'm going to add a perspective only because I read your edits before I read the post.\n\nI have a friend who is a functioning alcoholic who works a lot of hours. She doesn't think she's an alcoholic,  you want to know why?  Because she has a job and she goes to work.  In her mind,  alcoholics don't have jobs and they don't go to work,  so as long as she keeps doing those things,  to her she is not an alcoholic.\n\nI'm not saying this is why he is saying that,  but maybe it's part of him trying to justify that it's okay to be at the bar every night or to keep on drinking.  Either way,  this is bizarre and hope to see an update.  Good luck!",
            "Your boyfriend hates his job and he's taking it out on the people around him.\n\nBut the money is good, so he keeps doing it despite clearly being unhappy.",
            "This is less advice but more personal anecdote, when my father is drunk he will actively repeat the same thing, no matter the context, no matter if it makes sense. It’s normally either “it’s bed time” or “anyway...” since you mentioned your BF was a functioning alcoholic it could be the alcohol talking, it’s his “routine” of sorts.",
            "I'm going to attempt to empathize with your boyfriend here to give another perspective. (full disclosure - I have NOT read any of the 308 comments already here.)\n\nPeople who whine when adults need to leave are really frustrating and annoying. The rudeness is from the person who is basically putting someone on the spot for wanting to go home. He shouldn't have to explain himself. You guys are adults. \"It's time for me to go home. Thank you so much for a great time. Good night!\" should not require any further explanation. \"I have a job\" is, I think, his strike back at being expected (wrongly so) to provide some sort of reason for wanting to leave.\n\nAdding... Likewise, when people make plans, anybody should be free to say \"nah - I can't do that, but thanks\" without having to list the reasons why. Again, the rudeness is in expecting anybody to provide explanations for their decisions.\n\nDoes it excuse him being angrily dismissive? Not at all, and I'm guessing part of that is the alcoholism talking. I hope you both get help for that (for him as an addict, and for you as a person having to deal with his addiction).\n\nAdding a bit more... If he feels he needs to say something, suggest that he says something like, \"When my sleep patterns get out of wack, everything gets out of wack. Thanks for understanding.\"",
            "Jeebus, why do you want a future with this guy?  You can tell a lot about someone by the way they treat others.  Being condescending to friends?  No.  I can only imagine how he treats you when the chips are down.  Empathy?  Consideration?  How do you work as a team together?  I can guess that its only good when its convenient for him.  Don't continue with this relationship, you deserve better.  If you had kids, he'd end up being the divorced angry drunk of a dad who barely has a relationship with his kid.",
            "As someone who grew up with a dad who's a \"functioning alcoholic\" (lol), I suggest you be very careful and seriously evaluate where you see this relationship going.  Just because he maintains income, doesn't mean alcoholism isn't affecting him in other ways.\n\nI know you said it's a \"different conversation\" implying it's for another time, but no, the time is now.  Before he possibly (probably) bottoms out and drags you down with him.",
            "I know this one. He’s proud of himself but not feeling any sense of validation from other people. Even if you did hype him up extremely along with his friends it wouldn’t be enough. He’s over compensating for some issue he has. He is just super proud of himself and doesn’t know how to exert it without thinking his new job is his whole personality right now.",
            "So I'm in the latter half of my 20's and I am guilty of occasionally using this exact phrase and tone when people ask me to go out on weekdays.\n\nI don't think your boyfriend means to put others down, so much as express frustration and resentment for this terrible capitalist system that we all have to participate in.\n \nI totally understand how this comes off as condescending. \n\nHere's my perspective: \n\nI'm the kind of person who needs at least 8 hours of sleep, can handle no more than 2 drinks, and would like alone time to relax, in order to function as a human being during the work week. And it sucks when your cool, fun friends can all go to work AND be social AND love what's going on in their lives more than I could possibly enjoy my tedious 9-5 office job. \n\nMy advice: \n\nCommunicate. Tell him that this sounds resentful and arrogant, but gently. He probably isn't particularly happy with this point in his life right now. \n\nSuggest alternative language -- he can say, \" I can't, I have work tomorrow\". Most people get that. And if someone doesn't respect it, then they are the jerk.",
            "\"BF, why do you always say \"I have a job\" in response to people who also have jobs? What do you mean by that?\"",
            "So he finally had to start getting to work at 8am like half the population, and now he feels like he's superior in some way because he does it. \n\n\nI'd bluntly ask him what his point is when he mentions he has a job. \"so what? What is your point? We have jobs too. We have to be at work at 8am too. You're not special. Why are you being so condescending?\"",
            "\\>This friend had a brief moment of confusion and said, smiling, said I have a job too!”. My bf just kept going, saying “I have to be there at 8!” And she again responded “I have to be at my job at 8am too!” and having this look on her face like... thinking this was funny in a way? Like she’s in grad school and working and hearing him say this to her. Like, man you’re talking to a bunch of 30 year olds not some fresh college grads.\n\nSome people can drink and then go to work on 5 hours of alcohol induced sleep and function normally while some people need a full 7+ hours of restful sleep in order to function.   I know I cannot have more than 5 drinks and still wake up feeling OK even with a full 7 hours of sleep.\n\nSometimes its REALLY annoying when you try to make responsible life choices and your friends who have easier jobs/don't care as much/are secure in their jobs keep trying to pressure you into doing things you know are bad ideas.\n\nThat being said it is pretty condescending to say \"I have a job\" when clearly everyone else does too.  He should be saying \"I've gotta get to bed because I won't be able to function at work unless I get a decent amount of sleep.\"",
            "I want to give him the benefit of the doubt. Starting a new job, earning more, and having a more demanding schedule might be making him feel like he's leveled up and deserves more recognition. It's that \"nobody understands the stress I'm under\" kind of mentality. Maybe ask if he enjoys this job or if it's not what he expected. Either way, he needs to communicate in a productive way instead of insinuating that he has it worse than everyone else.",
            "I think he means it as a joke, I get it, it's probably the kind of thing I'd do but not condescending, really not sure, you should speak to him about it",
            "Why are people saying it's rude of him just because the people he's talking to also have jobs? It would be just as rude (more rude, in a way, because it wouldn't just be confusing) if they didn't have jobs. Unless your friends are expecting you to pay for them or are being jerks about you trying to leave the party early or something, why would you just be rude to them out of nowhere about something even if it is true? Is this the only thing he acts like this about?",
            ">He just gets offended and pissed and shuts down. \n\nHe'd rather shut down communications than resolve and issue. Is this the case for this one issue or is it part of a pattern? If it's part of a pattern, it doesn't bode well for the future of your relationship.\n\n>I don’t know how else to explain it to him.\n\nYou've already explained it to him. He understands your explanation unless he's a total idiot. He doesn't care what you think. He doesn't care what other people think.\n\n>Relationship: off/on for about 2 years.\n\nIt might be time for your relationship to be off permanently. Google \"relationship cycling\" to understand why people get stuck in off/on relationships. Google \"sunk cost fallacy relationships\" to understand why people stay in relationships well past the point where they get anything from their relationship.",
            "\"cool story bro, we all have jobs, get over it\"",
            "I was reading the updates, like huh, okay, yeah... saw when I read the last one I was like \"Ohhhhhhhhhhhhhhhhh duh\"",
            "Why are you investing your life and time with an alcoholic?\n\nLook 5 years in the future and ask yourself, is this the relationship I dreamed for myself?\n\nIf this relationship doesn’t make sense to invest your energy, love and time into then move on. \n\nI scrolled and scan read thru 400+ posts hoping someone asked you these basic questions.",
            "The guy is probably a lil resentful of his new longer hours so alot of priority going to his sleep.  So his night life of old is pretty much over.  Loss of the old fun times\n\nHe probably got pissed cause his passive aggressive \"I have a job\" declaration was a bit of a vent, it was dismissed and minimalized by your friend.",
            "Let me tell you how my girl would try to fix me:\n\nMe: Babe, can you grab me a beer?\nHer: I have a job!\nMe: ...\n\nMe: Babe, can you scratch my back?\nHer: I HAVE A JOB!\nMe: -_-\n\nMe: Babe, what are we having for dinner?\nHer: I have a job!\nMe: “ok ok...I get your point. I won’t say it anymore.”\n\nFriends: Why are you leaving early?\nMe: Because I gotta take a shit and I don’t like using public restrooms.",
            "I think what he means is he has a 9-5, which is a larger chunk of time than flexible freelancing and kind of burns you out. Every example you give seems to be him declining to stay out late so he’s not tired when he has to wake up early.",
            "Well you could stop trying to change his response and let him bear the consequences. Yes it's a dumb thing for him to say, people I know say stupid things like \"it's a school night\" when they've been out of university for 10+ years. Yes we all have lives, get over yourself OP's bf!",
            "Sounds like he’s resentful of his new job with far less flexible hours, but I’m sure he likes the higher pay (thus why he stays). Maybe the next time he says that to someone, ask him in front of the person that he said it to, “why do you always say that? You know that so-and-so has a job too, right?” and put him on the spot a bit. He’ll probably resent being called out, but he may stop saying that in the future... Maybe harsh, but he shouldn’t be rude to you and to your friends.\n\nYou could also sit down with him privately and ask him how the new job and new work hours are going for him, and let him know that if he’s not happy, you support him going back to his old job (if that’s an option) or finding a job with more flexible hours.",
            "Maybe he's super proud or nervous about his job and his insecurity or need for attention is leaking. Try Flex Seal.",
            "I think it would cause less confusion if he just said \"gotta be up early for work, i don't want to be tired tomorrow\"\n\nEdit: at the party he could've said \"wish I could stay but I need to be rested for work tomorrow, I have an early start.\"",
            "I would respond in the moment with “you are telling me a fact I know already, and not communicating clearly. What are you trying to tell me with that sentence? You need to be asleep by X pm? You are feeling resentful that I work at home? Something else?”",
            "i'm super late to this, but i don't think i saw anyone mention that this might just be a deflection\n\n&#x200B;\n\nhe might be feeling shame for partying and finally deciding to be responsible, someone says 'aw, cmooon' and he blows up more because he's already down on himself for slacking.  there could be lots of other semi-related reasons he might feel shame and be choosing to deflect, but does he put a lot of pressure on himself or is he specifically under a lot of pressure at the moment?\n\n&#x200B;\n\nif he's a functioning alcoholic as you say, both 'i have a job' and the drinking might be coping mechanisms for something else going on.  simply getting him to stop saying 'i have a job' might only fix the symptom, but not the root problem",
            "how will it hurt to ignore it? i used to say 'groovy' and 'totally'. phrases come & go.",
            "I’m imagining years ago, when he switched to a job with easier hours, his drinking frequency increased because he could stay up later and drink longer. Now he’s not able to do so, and his drinking problem is catching up with him. He’s starting to get angrier, more easily agitated, anxious, etc. It’s affecting his behavior. So now when he drinks, it’s more like he’s just numbing the anger instead of having fun and getting happy. That makes him prone to drunken outbursts because he’s just bottling things up and then lashing out instead of getting to the root of his emotions and dealing with them.",
            "It sounds to me like he is trying to be responsible and get to work on time, but his friends try to guilt trip him into partying harder and later than he feels is appropriate. Maybe he isn't wording it properly but I don't see the issue. Just because his friends are willing to drag themselves into work at 8 doesn't make him condescending for not wanting to do that. He isn't saying everyone else doesn't have work, but that he does and being there on time is a priority to him. This is a very good thing in a 33 year old man.",
            "Can't you ask him why he keeps saying that? Don't tell him what it sounds like and whether or not it makes sense (because it doesn't). Get to the bottom of why he thinks that's an appropriate response.",
            "who cares about this quote? you should be WAY MORE deeply concerned that he's an alcoholic. in 15 years do you see yourself  wanting to take care of someone with a failing liver and who knows what other kinds of diseases? choose more wisely.",
            "Same age - I have many friends who will say things like, “I have to work in the morning” etc in these situations, and it drives me bananas because well, SO DO I! I think what it comes down to is different people require different amounts of rest/sleep to function, but don’t know how to express that properly. I know I’m capable of being at 85% functioning on as little as 5-6 hours of sleep on a semi regular basis, whereas I have a friend who needs MINIMUM a full 8 hours or she’s zonked.  \n\nMaybe approach it in a way to express you sympathize he has made a big career shift (which takes time getting used to, as well!) and is tired and needs to leave earlier/sleep earlier/whatever, but maybe he can change the language he uses so not to come off as condescending. IE, “I wish I could stay longer too, but I need to get a good nights sleep to be functioning tomorrow at work!”",
            "Is he also a giant tree person?",
            "He sounds like him saying I have a job is him being the president. Unless hes saving lives everyday, he has the same responsibilities we all do. Getting up, going to work, paying bills.",
            "He's playing the passive aggressive card, lots of people I know have this mentality, to try to correct their rude behavior, you have to be aggressive back. Usually their behavior gets more and more annoying, to the point where you have to tell him off for your own sake. He can't just go around telling everyone \"I have a job...\" so you will have to force it out of him. You could say things like, \"I know what you're doing, so quit doing that.\" or \"You do understand that our friends know you're behaving like a dick, right? So stop already.\"\n\nAlso, to be frank.. I think it's pretty telling that you've been on and off again for two years. It's not a good sign",
            "Saying you have a job that you have to be at at 8am is just making excuses. I have a job and i get to work by 730am. When people ask why i don't go out drinking, it's two reasons, my dog wakes me up on the weekends at 7am, and i honestly just don't want to most of the time. I do go out and do things, but like seriously 90% of the time, i just don't want to go out, and I'll say that. My friends don't really ask anymore. They just get a shocked look when i do go out. In fact, i might be going out tonight, but we'll see what happens when i get home from the dog park.",
            "It's really irritating you which is more the point than trying to understand why he says that.\nHe knows its irritating you too.\nI guess there is something more he is not saying, finding it hard to say.\nSo u can keep pushing and crank up the tension or you can back off. He is more likely to tell you what is really on his mind if you give him some space to do it.\nI wonder if you know this too. It's a scary prospect if in fact this is about something else.",
            "My ex used to d this, and used it to insinuate that no one worked as hard as him. He didn’t respect my job (which was similar to yours) and it was an indirect way of him insulting me. Sorry you’re going through this. I feel your pain.",
            "If he got offended and pissed and shut down, you have explained it to him. \n\nNow he needs to grow the fuck up.",
            "[deleted]",
            "He’s having a very hard time with his new schedule.",
            "Is this his first ever real job or something?  Having  a job is normal life and not a special achievement in my eyes.",
            "He’s being incredibly glib and condescending. Is he generally like this?  If not, I would tell him exactly that. \n\nIf so, I may lose my fight against sarcasm and get very, very excited that he has a job. “I am so happy for you, omg, congratulations!  Janine, have you hear x has a job?  We should get drinks tomorrow to celebrate!”  Bonus points if you have a congratulatory card in your purse. Or, of course, a simple, “It’s about damn time.”\n\nNo, but don’t do that. Just passive aggressively dream of doing that. Speak to him like an adult and hold him to a higher standard of civility.",
            "Sounds like he’s starting to get burned out from his job to me. Does it excuse his behavior, no but it does need to be discussed for sure",
            "Fjdjdbdbdbdndndn.",
            "Maybe he no longer has a job and is overcompensating by always talking about how he has one?",
            "It seems like a communication error. He seems quite proud of his new job and wants to perform well. He probably didnt hold much of a proper job before this. He needs to communicate better. An appropriate response to \"can you stay over at my  tonight\", isnt I have a job. He probably means to say \"I cant risk sleeping in so I should make sure Im at my home tonight love\". \nIt seems he means well and his specific behaviour seems mature but his communication is on a grade schooler level.\n\nI strongly reccomend encouraging his hardworking reponsible mentality but get a coach or counseller to work on communication.\n\nAlso a great way to approach men isnt beating around the bush. Ask him to sit down and talk. Let him know you think he means well. Ask him if when he says he has a job means that he doesnt want to mess it up by being late or tired. Appreciate his hard work and let  know that you think he needs to communicate his thoughts better but can appreciate his effort.\n\nI wish you luck, if the conversation doesnt work you have bigger problems to deal with.",
            "> Now he gets up at 6/7 to get to work at 8am.\n\nPerhaps he can say he needs to get up early the next day, and needs his sleep. Not everybody has the same sleep needs. Your friends that have a job might be able to function the next day with less sleep than your BF.",
            "How is his new job going? How recently did he start? My guess is that it's not just about just the hours and having to wake up early, but just him expressing frustration or even signaling that he wants some support or wants to vent. Like, I know you're getting defensive about him saying this, given that your job and school is more flexible or at least less predictable, and he's locking into an 8-5 schedule, but him doing this is more about him and how he's feeling than directly about you or him taking an objective look at that friend's schedule. Yes, what he's doing is childish and maybe he does mildly resent that you get to define more of your schedule while his is more brick-in-the-wall-ish, but when a partner starts doing something different, it's usually a good idea to give them the benefit of the doubt that it's not coming from a \"I have a problem with you and want to start a fight\" place, but a \"Something is bothering me and I'm not sure what to do with these feelings\" place. My point is that rather than trying to battle him on the behavior, try to suss out/get him to open up why he's feeling the way he's feeling that is causing this behavior.\n\nIs he getting enough sleep? Do you think his drinking is maybe more of a negative (affecting his mood negatively) than a positive (a way to unwind)?\n\nThe only other advice I have, and this is because you assumed he was saying this because of your schedule, that maybe you look into aligning your schedule with his a bit more if you feel like you could be keeping a better schedule yourself. Like, if you're always up working/studying until 4AM and sleeping in until noon most days, maybe try getting up with him and doing some of that work/study in the morning and going to bed when he does a few days of the week. Like, sure, if you have a work deadline or homework/paper due, sometimes you have to stay up to get it done (I'm so glad I'm done with my masters, you have my sympathies), but aligning your schedule to his might make you feel a bit better about this, if you think you could be doing better with your schedule, and have the side effect of making him feel better out of solidarity. Like, I wouldn't do this to reward his childish behavior, but rather because you think \"Yeah, I'm not doing myself any favors grinding work/study in the wee hours of the morning and could be doing more during the day and I would feel better getting consistent sleep on a more consistent schedule\", if that makes sense.",
            "Next time your boyfriend spouts off with \"I have a job\", maybe point out that most adults work 40+ hours per week so his employment status hardly makes him unique. And that he comes across as condescending and even a bit naive when he acts like having to be at work at 8am is an especially arduous task. I mean, if you can't be honest about the fact that he's making an ass of himself, why are you in this relationship at all? Partners should be able to call each other out for rude/unpleasant/bad behavior without feeling as though calamity will ensue. Granted, my own wife is very sensitive to criticism and so even well-intentioned and gently delivered comments can sometimes trigger an argument...but that's part of being in a relationship. If he can't handle hearing your opinion, is your relationship strong enough to last for any length of time?",
            "So is this his first big boy job?",
            "It sounds like it’s more of an excuse to not stay places longer or something along those lines. \n\nI know for me I don’t like staying out late if I have to work. I get socially exhausted really easy and have to have time alone after. I can’t just come home, go to sleep, and then get up the next day. Some people can do that working the same hours and be fine. For me it overstimulates me where I can’t relax. So I like to go home for a bit and relax or spend some time alone. He very well might just want some time alone. He might just not be communicating that. I noticed people that can do multiple social things don’t have issues with this. So it seems strange to them. His phrasing is just odd. \n\nI would talk to him and just be pretty direct about it. Ask him why he says that and what he actually means by it.",
            "I would just reply with \"I have a job too\" or \"as do I\" and then repeat the question. Surely he'll eventually get the fact that it isn't an appropriate response?",
            "Talk to him, if he doesn’t stop then just have your friends subtly rip into him like your friend did.",
            "Next time he says it, tell him to stop saying it. You _know_ he has a job. You've heard it a hundred times before. It's a horribly condescending & incredibly boring thing to say.\n\nIt sounds like there are a lot of other issues in this relationship & it's all related. You need to talk it out.",
            "Why are still with him? He sounds like an alcoholic jerk. I hope you are not falling for the \"sunken cost\" fallacy.",
            "Sounds like he hates his job tbh",
            "Don’t think he’s committed to this relationship. “I have a job” sounds like code for “I don’t want to be around you and or together with friends anymore”.",
            "The way I see it you have two options. Either accept that he is imperfect like the rest of us (and may be a bit of a tool), or leave him because you dont want to deal with the things that you dislike about him. There is so the alcoholism thing which is incredibly scary and financially irresponsible, and would be a dealbreaker for me.\n\nRegardless, this is a decision for you and not for reddit. It's not that complicated.",
            "he probably says it as validation for whatever he does at least he is still responsible and has a job",
            "I DRIVE A DODGE STRATUS!",
            "This guy sounds annoying AF and seems to think he’s mightier than thou. And he’s an alcoholic? What good qualities does he have? If this was someone i was dating those two things alone would be grounds for me leaving them.  Actually, just one of those thongs would be grounds for leaving them.",
            "I am so interested in what everyone says about why OP's boyfriend says this. I have a friend that always says \"I have to work.\" As if none of us have to work. I own my own business and probably work twice the hours that she does. My response to her when she says this is \"I have to work too.\" It just seems so condescending when she says this.",
            "He sucks. No one else or what they do are as important. Ew, \"functioning alcoholic\" who talks down to everyone around him? No thank you and imo you deserve more and can do better.\n\nHe's 33. He's not stupid or oblivious. He knows and says this dumb shit in that way for a reason. Don't waste your breath explaining anything to him. Especially social interactions be as said before, he knows what he ia doing.",
            "I have a job that pays better than my SO’s and that’s about the extent of that benefit. I would never walk around spouting that shit. Also, all of my friends have jobs too and I don’t think I’m a unique and beautiful snowflake for having one. I went a year and a half unemployed after being laid off and it SUCKED but getting a job again sure as hell doesn’t mean I’m better than anyone else. You should have a frank conversation with your boyfriend about his bizarre and off-putting behavior. It’s super weird. \n\nAlso fwiw I’m 32F. And when I was unemployed I busted my ass to make money and get a job again.",
            "Sounds like your dude thinks that HIS job is the traditional-overly-important-male job that's putting bread on the table, now that he has a full-time gig. All the women are just working for fun and it's not as important as his men's work. If this bleeds into other aspects of his behavior, I'd consider where this will take you in the future. No matter what, his all-so-important male responsibilities are going to be used as something to devalue your work. I'd say dump if this future looks like a downward spiral. No point in being with someone who thinks like this.",
            "Tell him to shut the fuck up because he sounds like a dumbass considering you all have jobs.",
            "He sounds dumb. Next time he says that just say “what? No you don’t” and get all your friends in on it. Gaslight him until he starts believing you and doesn’t show up for work and gets fired. Then he can’t say this anymore.",
            "I love how your friend responded to him.  she is correct.  A lot of people have jobs , a lot of them get there at 8 some of them even get there at 6.  \n\nbut I think I understand his attitude .  \n  he's one of those people who probably thinks he's so busy all the time when in reality he's got quite a lot of free time to go to bars and parties and things like that.  But in his mind he feels busy , and that's why he thinks he can't do anything else other than prepare for bed and work.",
            "Heh, \"I have a job.\" I hate my effing job. But I like money. I'm probably wrong.",
            "In a weird way it sounds like he either hates this job or he really loves it and uses any opportunity to bring it up. lol",
            "Why are you dating a thirty-something functioning alcoholic you've been off-again, on-again with for two years, who you do not live with, and who you see once a week? That's the real question.\n\nRelationships go off-again for a reason. It sounds like you are working on building a real life and I'm not sure where a snobby alcoholic who gets offended when you tell him he's offending you/your friends fits into that. My vote is you dump him and explain, \"I have a life\" in that same inflection and tone he's wielding :p",
            "He's trying to convince himself that he's a fully functional adult. This is his way of over compensating for his problems. This is how he's come to define himself and there's probably some underlying sexism if he's saying this to your female friends. I'm his sure, but that's my suspicion. \n\nHe can't develop appropriate social skills when he's drunk so often. He can't guage the reaction of others when he's drunk and his only priority is getting more wine for the road (Uber).\n\nI suspect his drinking is impacting his performance at work and that is weighing on him as well.",
            "Girl what are you doing. “On/off for two years” “yes he’s a functional alcoholic” etc etc. Dump him and do better. He’s trash, needs therapy/rehab, and none of this is your job. Stop raising a child and start looking for a partner.",
            "It sounds like he’s an alcoholic, which means you’re codependent. You can’t fix him, so go hire yourself a good therapist and fix you.",
            "He's saying it instead of saying \"I want to go home now, please stop trying to keep me here\" maybe he's an alcoholic alone at home when he retires for the night, maybe not. But all he is trying to do is go home.",
            "As a person who gets mad when I'm up at 2am because of my girlfriend, I'd say maybe he isn't getting enough sleep.",
            "I would dump him and tell him hey get a job.  That will confuse him",
            "I think maybe he was insecure about his previous job as not being \"adult\" and \"real\" and he's both proud of himself and overwhelmed with this change. He may either think he's better than others, since he thinks he's super responsible now, when many others have jobs that have hard set start times, or maybe he genuinely is realizing he actually needs to plan to go to bed at a certain time and that's making him nervous, so he blames it on having a job, and not needing sleep. And then he's shocked that somebody else with an 8am job can function on less prep time/sleep.",
            "He’s an alcoholic. Cut and run",
            "My question is, why do you put up with his drinking?",
            "Pfft I’d just stop inviting him to things. ‘He’s got a job.’ The poor baby needs to sleep the rest of the time.",
            "Sounds like an ahole",
            "\"dude, shut the fuck up. You sound like a fucking asshole.\"",
            "Laugh at him like he's being weird and you think maybe he needs a lie down every time - like what he's said is a non-sequitur and you don't get why he said it, he must be drunk and incoherent.\n\nLet him know his pompousness is embarrassing him.",
            "How did you get into freelancing and is there a site you do it through? I'm a Test Analyst and have always been told about these magical jobs, but clearly I'm not quite so... Up there? I can't figure out where I am meant to turn!",
            "The fact that when you try to explain or talk to him about it he gets all pissed is about all the information you need. He can't even have a mature conversation about his insecurities.",
            "Sounds like a winner.",
            "He sounds unhappy, the drinking is a big problem, way way bigger than the \"i have a job\" nonsense. Likely connected anyway. He needs to talk to someone about why hes drinking so much and sort that out.",
            "I feel like you are focusing on the wrong thing. He's alcoholic, that's a much larger problem.",
            "OP you need to be more concerned on him being a functional alcoholic.... The way you breezed over it here leads me to believe you breeze over it with him in reality. If that's the case you're enabling. \n\nThis is 9/10 the majority of what this issues are. The whole \"I gotta work\" thing is just surface level stuff. Address is alcoholism issue and stop worrying about stupid stuff he's saying.\n\nAlso to add and not to make you feel bad but yalls relationship doesn't even seem mature at all. Yall are on and off for years, you don't live together and see one another maybe once a week?\n\nYou as well as he need to figure out in your 30s what are your long term future plans together. The relationship reminds me of one I had when I was in 19-20.",
            "Whenever someone who is an alcoholic is behaving oddly,  the alcoholism is rarely ever 'another conversation'. There's a good chance it relates to the behaviour in some way.",
            "Your boyfriend is a condescending jerk and always will be. He will continue to disrespect you and eventually turn violent if he has not already. Stop trying to fix him or counsel him. He is an alcoholic and a low life. Leave him now and get on with life.",
            "He needs to understand 33 is different from 23 both in that almost everyone that age works full time and that you cannot drink every night and happily go hard the next time. If his drinking habits haven't effected things in the bedroom yet they will if this is a ltr anyway. Maybe not now and not even 5 years from now, but someday. Drinking anything more than a glass of wine on a daily basis is not good. Some men are in some ways cursed with a strong constitution in thinking they can get away with it until suddenly the wheels come off as early as their 50s.",
            "I can get it. Doesn’t make it less assholey, if I had to guess, BF is using job as an excuse because he doesn’t want to hang out with the people making plans.\n\nAlso if he’s an alcoholic FUCKIN RUN",
            "I don't find it a weird thing to say, he probably wanted to leave and had made the comment dryly not expecting your friend to push it. I'd end up annoyed if I were being talked to like a child when I just want to get out the door. \n\nWhen he says it to you did you check the time you asked things? Plus he won't get to sleep in like he use to.\n\nMaybe you should try to get him to cut back on the drinking that seems more of an issue than him just saying he has a job?",
            "Is it weird or his he mocking the modern rite of passage that we use to determine everything from whether or not you get to receive treatment for cancer to whether or not you'll get away with international pedophilia....",
            "I think he’s trying to say, that he can do what he wants because he has a job, which I gotta admit, he sounds like a South Park character lol.",
            "Honestly, it sounds like you can't even have an effective conversation about this because of his general attitude. He sounds entitled making this convo even harder. This would be a deal  breaker for me cause if this is how he acts about this imagine his attitude to other more important things. That's kinda scary and you don't deserve someone that has that attitude.",
            "That 100% sounds like my father when trying to maintain an air of superiority.  Is it possible he's emulating a parent?",
            "Living nearby and only seeing each other once a week sounds like another pretty big issue.",
            "Stay on that grind fam. #RespectTheHustle /s",
            "\"I have a job\" is an excuse to not consider himself to have a drug problem.  In his mind, people who do what he does and don't have jobs are the problem.  The end.",
            "I wonder if there is something about this job or about you or shared friends that makes him feel insecure.",
            "Your boyfriend saying an inane phrase in a tone deaf context is not your problem, and you can just let him look silly to your mutual friends, and suck up a bit of embarrassment. You have bigger fish to fry in a relationship, and you don't need him thinking you're nagging him, or getting up in his social business. However if him saying that is because he hates his job, or because he's being condescending of your job, or something underlying the phrase... then please do address the underlying issue. Just saying if it's merely annoying...you might wanna let it go.",
            "He was probably trained by his environment growing up to say that. \n\nIf he has a job, he has a job. Jobs are important.",
            "[removed]",
            "Obviously he thinks he's some kind of saint now that he has to get out of bed before 10AM and he wants the whole world to know it. Basically trying to humble/martyr brag about his new responsibility and maybe forgetting that other people are wayyyyy ahead of him on that. \n\n&#x200B;\n\nPretty effing dumb really.",
            "Hahaha!  I have a friend that says this as well.  I always react with a smile and \"yeah!  We all do Buddy. We all do. That's how bills get paid.\".",
            "Maybe this behavior is why your guys are on and off.",
            "sounds like he either hates his job or assumes everyone who is in grad school is just taking classes and paying for their living expenses with loans?",
            "Seems like your boyfriend has just suddenly realised he’s an adult.",
            "Seems like dude is joking sarcastically .... I'm pretty sure hes aware of your jobs...I say just tell him hes annoying as fuck.",
            "I think your boyfriend thinks he has the most importantist job. And he wants other to know that his job is 1000% more taxing. \n\nHonestly I think your friend handled it perfectly lol. Your boyfriend knows what he's doing.",
            "You're being exceptionally obtuse.  He's saying something polite, because the alternative is saying, \"I'm bored and don't want to hang out anymore.\"  \"I would rather drink alone than spend additional time with you.\"\n\nHe's pointing to an obvious obligation and you're like, trying to lawyer that it's not a good excuse?  Where does this go?  You shame him into staying and being happy that he didn't get to leave?",
            "Okay, so he is directing these comments towards you, b/c he is childish. You work, and you support yourself since you do not say that you are living together. He literally annoys and insults other people to try to get at you? Luckily, it doesn't sound like he is getting to you at all. That is something you have going for you. Don't bite at all. He obviously thinks he is something special for working a regular job, which most of us do. Just laugh and tell him that everyone works a full time job. Ask him why he seems to need praise for something all adults do.   \n\n\nI suspect that you two will eventually break up. He is being silly and childish. I suspect that you will get tired of this.",
            "This is so condescending and childish, I wouldn't even know where to start. He obviously thinks he's better than his peers for some nonsensical reason so that really needs to be unpacked. The brazenness of this makes me think you should just straight up tell him he is pissing people off. If he keeps shutting down over it and throwing tantrums, find a man who is not acting like a child.",
            "He might be resentful of you having such a flexible schedule and not being able to sleep in as long. Especially if he goes to the bar every night. \n\nNext time he says this, take a second to pause. Let an awkward silence settle in and ask “When you tell me that you have a job, what is it you’re hoping to accomplish?” Let it sit. Don’t answer for him. Don’t say anything until you get an cohesive answer. Let him express himself. \n\nYour next answer could be “When you tell me that you have a job, I understand that you mean [whatever feeling he said], but it actually makes me feel really condescended down to and I really don’t like it. I know you don’t mean to hurt me, so can we stop with that particular comment?”\n\nAfter, if it comes up again, call it out. “I’ve told you I don’t like it when you say that to me. Let’s change subjects.”",
            "[removed]",
            "Lmbo i cant help finding this funny sorry 😂 i am 23 and have worked 2 jobs and still managed to do things in the lil spare time i got, usually only running off 3-5 hours of sleep, and now? Ft with twins, and i work from home as a sub contractor for comcast, so i deal with back to back angry people from 7-10 am, clean house and take care of kids, back at work 2-5 pm, finish cleaning/laundry, also making foods for them and husband and myself, on top of then dinner, putting kids to bed, dealing with them when they wake up, by now its 10 pm, then i have to make sure im taking care of my husband and spending time with him so he's not feeling neglected, so i dont get to bed until 12- 2 am generally. I Know thats all my choice, but my point is that if i am doing a shit ton of stuff 24/7 on what feels like no sleep (sometimes i have fallen asleep while working...) Then why cant he give his friends a lil time? They will stop trying eventually.",
            "[deleted]",
            "He doesn't want to party like you and your peers anymore, that's fine. He should use his words though, not those ineffective ones though.",
            "[deleted]",
            "So I think you should either encourage him to go to councling or have a deep talk nicely about his behavior. You’re clearly worried that this job is affecting things negatively and I think you need to help him break that down as he doesn’t sound like he’s doing well. \n\nIf you get him to talk, something I’d ask is if your stressed or whatever why keep working? Maybe he feels trapped or not appreciated and it’s coming out on everyone else. I think a good supportive talk would help things. It’d allow you to express your hurt for when he throws around “I have a job” but also allow him to know you’ll be there him and want him to be happy :)"
        ]
    }
]