[
    {
        "post_id": "a9ef94",
        "author": "WrongCompetition",
        "title": "UPDATE: How do I [23 F] back away from this guy [31 M] without losing my favorite coffee shop?",
        "url": "https://www.reddit.com/r/relationships/comments/a9ef94/update_how_do_i_23_f_back_away_from_this_guy_31_m/",
        "score": 3614,
        "num_comments": 255,
        "created_utc": 1545739438.0,
        "selftext": "[Original post](https://www.reddit.com/r/relationships/comments/9vjxrb/how_do_i_23_f_back_away_from_this_guy_31_m/) and original\n\nTLDR: I went out with a regular at my local cafe and it didn't go well. He's maybe a little unhinged. I don't want to lose my favorite coffee shop. How do I handle this without any awkwardness?\n\nSo I had been meaning to post an update about this for a while but never got around to it, and then last night something really big happened and I think its really important that you guys keep in mind that this is all happening in my second language, nobody involved in the story speaks English (Except Sarah a little bit).\n\nSo where we left off with my last post, I had had a conversation with Sarah about Derek that made me feel better. Derek later reached out to me, apologized, said he had drunk too much on an empty stomach and that he was embarrassed about his actions. \n\nI'm sorry you guys, but I agreed to hang out with him again, this time just over coffee. Things were fine and he further integrated me into the neighborhood by introducing me to the people he knows and inviting me to join other neighbors for drinks and such. He opened up to me about a traumatic event that happened to him in his past and about his mental illness. He brought me around his family and his nieces who were all lovely. Other people seemed to adore him. I really liked all of this and we quickly fell into a romantic relationship. \n\nDerek seemed to be almost flaunting the relationship around the neighborhood. I had one other conversation with Sarah where she asked me some questions about how I felt about him. I explained that I liked him but felt confused and that he was moving quickly. She told me, in English so I know she was serious, \"Take your time.\" soon after this Derek broke things off with me very suddenly, and rather forcefully. I found his sudden change of heart very confusing and upsetting. A week after he broke up with me I asked him to come over to my apartment to talk about what happened and we agreed to remain friends, since we'd have to see each other around the neighborhood. \n\nI spoke about all this with Sarah, who told me that she didn't know anything about it and said that she was sorry. About a week after I agreed to remain friends with Derek he invited me out for a drink, gave me a necklace, and we got a little bit intimate, but he clearly told me \"Do not talk about me at the bar.\" which I found very strange. \n\nThis is getting longer than I wanted it to be so I'm going to jump to last night. Sarah and the other woman who owns the cafe are a couple, they've been together for 10 years and they invited me to spend Christmas eve with them since they knew I would be alone. I brought up Derek, of course, and asked them why they thought that he wouldn't want me to talk about him in the Cafe. Silvia played dumb until we had some privacy and then she revealed to me that she and Derek had had a relationship while he was seeing me.\n\nAt first, he had lied to her and said that we were strictly platonic, but that lie quickly fell apart. Sarah said that she wanted to talk to me about it but never had the opportunity because we were always in the cafe. She apologized that some days she had acted cold towards me (which I hadn't noticed) and she said that after a few weeks she had insisted that Derek choose either her or me. Apparently, he chose her. Soon after that, she ended things with him completely. The next evening he invited me out for a drink to try to rekindle things\n\nSo Sarah apologized to me. She said she felt stupid and like a bad person, but that she had been feeling old and unattractive lately (she is 50). I told her that I wasn't upset with her at all, just shocked and that I was sorry I had been so oblivious to the real situation. \n\nSo, I definitely didn't see that coming. I'm not going to confront Derek about this, I'm just going to let it go and move on. Sorry for acting like an idiot. I wish I could say I've learned something but I probably haven't. \n\nMerry Christmas everybody.\n\nTL;DR: Derek and Sarah were together the whole time and Derek was trying to play both of us. Merry Christmas.",
        "permalink": "/r/relationships/comments/a9ef94/update_how_do_i_23_f_back_away_from_this_guy_31_m/",
        "comments": [
            "wait, wasn't Sarah the one who set you guys up on a date? While she was dating him all along? Why would she do that?\n\nThese people sound strange OP. If you love the coffee shop that much, by all means - but I wouldn't be attending their family christmases and being all buddy buddy.\n\nAnyway, highly anticipated update! Thanks for sharing!",
            "So it seems like Sarah is a piece of shit too if I’m reading correctly? She tried to set you up with someone while she was dating him (?), she knew you liked him and things were moving fast, AND she was already in a 10 year relationship with someone else. \n\nNot saying you need to cut her off, but I think it would be beneficial to expand your friend circle and meet new people. ",
            "Just FYI, I think you might have accidentally used Sarah’s real name in the paragraph where she revealed their relationship to you! \n\nSorry this happened, though. It sounds like you might be better off avoiding all of them for a little bit, and maybe start branching out to meet people elsewhere. They all sound a little nutty to be honest. Best of luck! ",
            "[deleted]",
            "this is absolutely bonkers and at this point I wouldnt care how good the coffee is, gross mud coffee is better than all this drama. ",
            "OP seriously, after all the good advice people gave you in your last post, you still continue to make excuses for people who DO NOT have your best interests at heart.\n\nWe already told you that Sarah didn't seem to have your best interests at heart when she made excuses for Derek's behaviour, calling him a \"good boy\" even after you told her how deranged he acted during and after your \"date\". \n\nAlso the fact that she pushed you into seeing him was a bad thing itself. She should never have pressured you like that when you were new there and relying on her judgment. Especially since he was an unemployed 31 year old in the first place!\n\nHonestly I still think you're a little clueless for dismissing Sarah's part in all of this. Seriously, re-read both your posts and imagine if a friend of yours had written it all instead. What would you say to her?\n\nDon't trust random people in a foreign country, male or female, young or old, to have your best interests at heart. You need to learn to trust yourself and your instincts. \n\nIf you didn't already do so (and I bet you didn't, because you never would have given Derek a second chance if you had), please read *The Gift of Fear* by Gavin de Becker. ",
            "Honestly, just get away from all of these people and do yourself a favor.  This sounds like an absolute shitshow.  Why even get involved?",
            "Wait I’m confused Sarah’s part of a couple with the other woman who owns the shop, and was dating this guy in the cafe?  What?",
            "I always try to give OPs the benefit of the doubt but...this really reads like some exceedingly poor creative writing. The crux of the first post is about him seeing dead people, and then it never gets addressed again. Sara's behaviour is baffling throughout. Details are all really vague- Derek asks OP to stop talking about him in the neighborhood? Sara and her partner invite OP for Christmas and then Sara seemingly tells her then about her affair, but without her partner noticing? ",
            "I would avoid this coffee shop, it sounds toxic too.Who does things like this to a friend....",
            "Jesus you are naive. I’d cut these people out of your life... like completely. Definitely DON’T start dating one of them. Again.",
            "Well that took a turn I wasn’t expecting. ",
            "Lol these people are horrible. I hope you at least learned not to continue a relationship with someone who was over the top and shitty right off the bat, because as you can see, that never turns out well!\n\nI know that these are the only group of people that you’ve really latched onto in this new area but I hope you have the self respect to cut them out. There are better people out there. ",
            "I'd stop hanging out with the entire circle, coffee is a small price to pay for peace of mind. ",
            "This sounds like a bunch of small time drama.  Like Sarah was just feeling bored and decided to stir up some shit, and Derek is an immature weirdo.  It’s probably best to move on, but I bet if you stick around these people, weird dramatic shit like this will keep happening.  Find a new hangout. ",
            "It is a coffee shop. Who cares.  Take care of yourself and leave the drama. ",
            "This is some CW shit.",
            "it was tiring just reading this\n\n\n\nfinding another coffee shop is infinitely easier than navigating these relationships, 100% politely bow out",
            "You need to find another coffee shop. No good people at this other one. Creepy guy and \"friend\" who was deceiving you. No thanks. If you *choose* to continue going there and interacting with these questionable people, you need to stop complaining and live with the situation you have put yourself in.",
            "I remember your OP. I definitely didn’t anticipate that you’d end up dating this guy. Anyway, it seems like a messy social group to be a part of. I don’t think I’d want much to do with them. \n\nI wouldn’t be surprised if this sort of drama, with people dating and having crushes and secrecy, is a theme in the cafe social circle. And you, as the “new girl”, we’re a pawn to add some more drama. \n\nI actually wouldn’t be shocked if Sarah and Derek had a flirtation before you even arrived, she did the whole “We both know we like each other, but let me set you up with my friend” thing, and seeing you guys together ultimately only made her want Derek more. I don’t think you’re getting the whole story from Sarah, and why would you, especially in front of her partner she cheated on. ",
            "She was cheating on her partner of 10 years? Am I hearing this right???",
            "They’re both assholes. Swiftly remove them both from your life and don’t look back, you’ll be much better off.",
            "You seriously need to hone your judgement/common sense skills.. holy moly..",
            "I'm older than you but take this with a grain of salt as obviously I'm not there in person to witness all of this.\n\nMaybe you haven't learned this lesson yet, but people would good intentions can still be awful in your personal life. Sarah and Derek, though they've made you feel at home and with friends, are pure drama (it seems). It makes no reasonable sense to encourage a 23 year old girl to go out with an older dude you're already dating. It's what kids in high school or college do when they're trying to believe everything can be cool if we're all just nice about it. In practice, you learn as you get older how ridiculously complicated that is and you can't just force your feelings to be one way or another because you want a certain situation to be true.\n\nSarah pushing you to give him a chance, him keeping from her what he was doing, him breaking up with you abruptly, Sarah inviting you around to \"confide\" the truth, Derek suddenly wanting to give it another go... drama and games. And they're pulling you into it. If you keep staying close with all of them, this Derek dating drama is going to be the main root of your relationships with them. It'll be the thing you always talk about and the main source of emotional confusion outside the relationships. This happened so many times when I was college.\n\nWhich is why I have a HUGE sideeye for 30 thirty year olds who engage in this nonsense. Most of us grow out or just get tired of that melodrama and opt for straight forward communication as we learn better ways to deal with interpersonal relationships. I'd put some distance in. Make new friends, search for a new space to hang out and avoid being a player in someone else's bullshit.\n\n&#x200B;\n\nEdit: Just reread Sarah is in her 50's? Run. A 50 year old woman encouraging this? No. There will be more drama piled on you and it won't be worth it.",
            "So... Sarah is a trash friend and despite people telling you to not get involved with either of these people and to walk away, you ran head on in. Sarah never cared about you and is playing you like a fiddle. Now you are saying \"probably wont learn anything\". You honestly need to seek some professional help because it sounds like a huge codependency issue.",
            "Wow, didn’t see it playing out like this. What an asshole! I guess it’s better to find out sooner rather than later though and rid yourself of him now! Merry Christmas!!",
            "Are Sarah and her partner poly? Suddenly this story and how she’s behaving make a lot more sense if so.",
            ">So Sarah apologized to me. She said she felt stupid and like a bad person, but that she had been feeling old and unattractive lately (she is 50). I told her that I wasn't upset with her at all, just shocked and that I was sorry I had been so oblivious to the real situation. \n\n\nShe is stupid and a bad person. Stop hanging out with her. Also why did you apologize to her? It is not your fault you were oblivious to a shitty situation. It might sound easier to just let it go but by sticking around these two, you're only setting yourself up for more of this. These people need to be cut off. Having no friends is better than having to deal with these two psychos. If you don't cut Sarah off what's to say she won't have another episode and try to make herself feel better by pulling another stunt. She is not to be trusted. Neither is Derek. \n\nStop putting yourself in situations that can easily be avoided. A cup of coffee is not worth the stress.\n\n",
            "Not gonna lie OP, the way you've handled this situation is strange.",
            "Your friend Sarah is shady as fuck. Drop them all.",
            "Wth, i remember i read this a while ago, but this didn't go at all like i thought it would.",
            "That is wild! I read your first post and was pretty concerned you would get stalked by this guy or something. Did not expect a love triangle. But I'm glad you're (mostly) okay!",
            "Not only was Sarah a bad person, she cheated on her SO!\n\nThis whole mess is crazy. I’d say you need to tell her partner, except that you don’t have evidence and the partner is likely not going to believe you, and cause you further problems. \n\nWhich seems odd, as this seems like a weird, close community so I’m confused how they could even keep this secret. \n\nI’m sorry this happened to you, you deserve better then that. ",
            "I agree with all of the others posting... Derek is not the only problem. Find a new social circle, this one seems to be a bit dramatic...",
            "Sarah is not your friend.  ",
            "Yeah, fuck that coffee shop and all the people in it.",
            "Dude I would stay away from all of them honestly. All those people sound unstable. \n\nSarah sounds like shitty friend, she was cold to you? \n\nBe careful girl, I know what it’s like move to a new area alone, but I’d find some new friends ",
            "Sarah sounds just as bad as Derek and I don't see why you're so quick to forgive her, or not even be mad in the first place. This woman has been manipulating and lying to you for months.",
            "No offense but this sounds like some made up cock bull BS.",
            "Wtf are these tacky people? Girl find new friends!",
            "Look up articles on the cycle of narcissist abuse. Particularly for romantic relationships. Derek seems to be touching on all the greatest hits - love bombing until he gets what he wants, devaluation when you start showing interest in him, and discard when you have real feels. These types of people are incredibly unhealthy, get away from all of this as fast as you possibly can.\n\nRooting for you!",
            "Is this coffee shop for special needs people? This whole story sounds like everyone included is emotionally disabled.",
            "[removed]",
            "Derek sounds like an absolute nut job. If I were you I'd find a new group of friends/new hangout spot. These people all sound crazy.",
            "Hate to say I told you so.... But anyway, just move on.  They are weirdos, and you deserve better.  Don't continue giving your time and money to people who are mean to you.",
            "So Sarah is in a relationship with a woman for the last ten years, cheated with Derek, then set you up with him WHILE she was cheating on her SO with him, demanded he break up with you, then dumped him and stayed with her SO... who’s Sylvia? \n\nEdit: Okay I didn’t read the other post, so Sarah is poly. Explains a little. She still messed with your head and heart for no reason.",
            "Uhhh wth are you doing?? Lol these people r crazy",
            "I believe you’ve been manipulated, OP. Sarah seems like someone who really craves attention, and losing yours wouldn’t be beneficial to her ego. Look at all of the red flags and reassess your friendship. I think dropping her is in your best interest.",
            "Oh no, OP. I’m afraid you might’ve missed a slip on your proofread. ",
            "Where the hell do you live?",
            "All of them are bad, and you should get away from them all. You really seem like you need to learn how to make friends better in general. ",
            "Really OP, how good is this coffee for this shop to be worth all this drama? ;-)",
            "TY for sharing.  This is some extreme guiding light shit right here.  \n\nMy advice?  Get out.  They all sound batshit crazy and im afraid a murder is gonna take place sometime in that coffee place.",
            "Ok now this whole thing is really weird! I would avoid that whole group, sounds like way too much drama and awkwardness. Sarah tried to set you up with him yet was dating him and was cold towards you for dating him? While she was with someone else? I think it’s all too weird now... you might want to start hanging out at a different coffee shop.",
            "What a mess. Move on and find another cafe to be your hang out place and a better group of people to hang out with. This wholeset up leaves me wanting to take a shower.",
            "I'm confused. Who had the relationship with Derek? Silvia or Sarah?",
            "Find a new coffee shop lol, damn ",
            "Must be some damn good coffee.",
            ">Sarah and the other woman who owns the cafe are a couple, they've been together for 10 years and they invited me to spend Christmas eve with them since they knew I would be alone.\n\n>Derek and Sarah were together the whole time and Derek was trying to play both of us.\n\nWait so... Okay let me get this straight, Sarah set you up with him while Sarah was in a long time relationship with the co owner, but she was also in a relationship with Derek? Was she trying to push him off and regretted it? Or she didn't know what she was doing? I feel like her involvement in all this...wasn't exactly well thought out. Even for a midlife crisis.",
            "Time to find a different place for coffee. ",
            "Honestly these people are both toxic. You seem very kind and trusting to keep giving them more chances, but you will only get hurt and manipulated if you keep spending time with them. This is all so twisted and strange and I’d recommend you avoid these people like the plague. ",
            "It's like an episode of Melrose Place! Lol",
            "You know, you're getting a lot of crap about this but I get it.  When you're in a foreign country and speaking a second language, there is a real sense of isolation and loneliness.  This can make you grab on to things and people that perhaps you wouldn't to such a degree, otherwise.  I also get how a cafe can just click for you and not wanting to give it up.\n\nAs it currently stands, the drama is over if you let it be.\n\nTake a breath, put on your big girl panties and take a step back from these people.  I get not wanting to be alone for the holidays but things are progressing too fast with not just Derek but Sarah and her partner.  Now you know they aren't the friends they may appear.  So, keep it professional, polite and don't fool yourself twice.\n\nKeep reminding yourself you have only known these people for a short amount of time.  Tell yourself your safety and well-being comes first.  Don't let yourself mentally give them excuses or ruminate on the 'whys'.  Just say that 'they're not the kind of people I hoped' and move on.  Keep telling yourself you deserve better until it sinks in.\n\nOP, perhaps consider finding some meetup groups, try a few new hobbies, a group sport etc.  Maybe find some ex-pats in the area so you can speak your first language a bit.  Expand your social circle so you don't feel like you have to cling so much to the few familiar faces.",
            "Weird question, but is this in Italy?",
            "Lol so it's was him who used and dumped you...what a twist. ",
            "Get better friends? Sorry if that’s blunt and almost an impossible proposition since those are your only friends and it’d be difficult to meet other people in that place you’re in but I wouldn’t want shady people like that in my life.  Sorry you had to go through that OP. Merry Christmas. ",
            "This story was wild, that couple who owns the coffee shop sound a bit off.  \nIdk, I wouldn't stay too close to them and perhaps venture out to other coffee shops every once in a while?  \nGood luck OP",
            "Hi. I loved you last sentence about being sorry because you probably had not learnt your lesson. I don't know why it made me smile and feel joyful,  maybe because some times that is how life feels. That we dance around, doing stupid things over and over. We know what is right, very often we pretend we are all wise and grown up, but really? No, we just keep making a mess. Sometimes it is good just seeing people accepting that part of them selves, laugh, and go on living.",
            "never mind whar Derek has that some normal and decent guy doesnt have--  what doe this coffee shop have that some other coffee shop doesnt?",
            "I think you use Sarah’s real name once by accident, might want to change that. ",
            "I’m so confused... who is Silvia? Sara’s girlfriend?",
            "Nooo he didn’t play her too because she was in a relationship wth ",
            "There have to be other people there you can hang out with. I would avoid this group of friends. There will be more problems and drama if you stick with these people. ",
            "I think you accidentally used Sarah's real name in the 6th paragraph",
            "I remember not liking sarah in the first post. She seemed not to be looking out for your best interests.\n\nListen we all make choices when lost in the penis sauce sometimes, that we wouldn’t make. This and loneliness is why I think you kept talking to derek after his first bout of crazy.\n\nDon’t beat yourself up, but find new friends. These people are playing stupid games you don’t need to be any part of ",
            "Out of all the options, there being a poly lesbian relationship between cafe owners involving one of those partners being his other girlfriend was way out there, and unexpected.",
            "Find a new coffee shop, and better friends. These people have been fucking with you. ",
            "I hope this also means you're not going to keep being a friend to Sarah (nope, not even a little bit).\n\nHugs OP",
            "Honey... I can't say anything new that these comments haven't told you already. Go to therapy.",
            "[deleted]",
            "My god, what a twist. At this point I would move completely forward and find a new coffee shop. I guarantee there are ones just as great as yours without all of the weird drama!",
            "This coffee shop is wild!!!",
            "My two cents: do you. Everyone here is saying to cut them off and all. If you still like the coffee shop, and can bring yourself mentally past the situation then keep going. The Derek thing is shitty. It was very shitty of him to even try. You say you will be putting this behind you and moving on, I am assuming you mean you won’t be entertaining the idea of dating Derek. If so, good. ",
            "Usually if something like this happens I just say I'm into super wierd stuff, and that makes them not want to be near you.  Or you are a cannibal and looking for potential meals.",
            "I think all three of you should avoid each other. ",
            "Heads up, you left Sarah’s real name in there somewhere. ",
            "This sounds like a tv show.",
            "Hey OP I think you left Sarah’s real name in their in one of the paragraphs!",
            "Oh my I recall this.  I don't think anyone could have seen ANY of that coming.  I am not sure what there is to learn from this situation to be honest.  You seem to be handling yourself quite well.  Merry Christmas and perhaps just find a new coffee shop?",
            "If it makes you feel any better about this—I’m deeply involved with a paranormal spiritual community where I live. They are not the most faithful circle of people when it comes to their partners.  Recently a man got in trouble for having 32 girlfriends (about 15 of them steady for years all at the same time) while married to a woman for 10 years. \n\nShe didn’t know. He was a good liar.  They usually are good liars. They use the same face to tell you about seeing dead people as the same face they do when they lie. \n\nBlock his number and never talk to him again. He will try to rekindle the relationship many times over. ",
            "> I wish I could say I've learned something but I probably haven't.\n\nEveryone's life story.\n\n&#x200B;",
            "All coffee is the same go somewhere else",
            ">I was sorry I had been so oblivious to the real situation.\n\nI hate that I always have to be so observant when I'm dealing with people... that at any point someone can hide their intentions. It's draining.\n\nA few days ago I learned that one of my friends got swindled by her boyfriend of almost 1 year. I've known her bf for 1.5 years and while I didn't dislike him, I didn't notice any red flags.",
            "You say man ura damn freak...and they say well fuck it then.....who gives a crap what u think anyway...",
            "Don't mix business and pleasure in the future.",
            "What a confusing and infuriating situation.  \\*hugs to you\\* Sorry you got caught up in their \"game\"...",
            "So Sarah and her girl are Poly?\n\nThere's really nothing to add here. I'm just gonna say I hope you learned some life lessons from this (even though you say you haven't). I'm sure your really embarrassed about how you handled this situation, since you aren't replying to any of these comments. Keep your chin up OP you never have to settle.",
            "[deleted]",
            "maybe you should be friends with that girl since you guys relate in terms of being played by the same jerk. ",
            "Sarah seems like a nice enough person.  I completely disagree with everyone who says you should cut contact with her just because she's poly.  Derek sounds sleezy to me; he lied to both of you and therefore shouldn't be trusted.  Congrats on breaking it off with him.",
            "I would just suggest that you don't take dates to your favorite places until later on. But it sounds like he already knew of the place, so dunno.\n\nNot touching the rest of this. I don't do drama."
        ]
    },
    {
        "post_id": "4cyij0",
        "author": "Im-inlove",
        "title": "Me [33 M] with my wife [32 F] 11 years, I'm falling for my coworker [32 F]. [UPDATE]",
        "url": "https://www.reddit.com/r/relationships/comments/4cyij0/me_33_m_with_my_wife_32_f_11_years_im_falling_for/",
        "score": 3612,
        "num_comments": 170,
        "created_utc": 1459549336.0,
        "selftext": "https://pr.reddit.com/r/relationships/comments/4btp9x/me_33_m_with_my_wife_32_f_11_years_im_falling_for/\nOriginal post.\n\n\nAbout 3 day's after my post I read all the comments and realized everyone was right. And I want to be 100% faithful to my wife and this woman is NOT worth losing my family.\n\nSome posters said something may be missing from my marriage. and I thought about it and realized me and my wife don't spend that much time together.\n\nSo I talked to my wife about it I told her how I felt and what was on my mind and we had a heart to heart. We cried a little and I don't want to lose her we made a schedule and are going to work out date nights for us to spend more time together.\n\nAs for Talia.\n\nMe and her met up and I told her the honest truth I'm married and I don't want to do something I'll regret forever. I told her my feelings were getting a little to inappropriate and that maybe we should not talk outside of work.\n\nShe agreed and told me she started feeling the same and that we should limit contact. She said it's for the best and that I'm a good man because most men would have just let it continue but I didn't.\n\nSo we ended our friendship.\n\n\nIn the mean time I'm going to focus on my family and my wife and distract myself from thinking of Talia. Looking back it wouldn't have been worth it because my wife has been with me through everything.\n\nWhen I lost my job when my parents died when I needed surgery. She's had my children and sacrifices for them and takes care of them without asking for anything in return.\n\nAnd I'm happy with her and I couldn't replicate all those memories with any woman. She's the only one for me and I realized and appreciate all the things she does for me and our family.\n\nThat's the update and hopefully I'll never have to return to this sub-reddit again.\n\n   \n**tl;dr**: got my head out of my ass and realized how important my wife and family are to me. I ended my friendship with Talia and am going to focus on my wife and family now.",
        "permalink": "/r/relationships/comments/4cyij0/me_33_m_with_my_wife_32_f_11_years_im_falling_for/",
        "comments": [
            "GOOD! Glad to hear, you did the right thing. The key to avoiding an affair is to cut it off when you first begin to feel things that are inappropriate, and to focus on your own marriage. I wish you all the best :)",
            "[deleted]",
            "Great to hear.  So many people don't realize that feeling like this for other people are normal and will develop even in spite of great relationships.  Part of being committed and dedicated is to squash these things before they get out of hand.  It's going to happen, it's OK, it doesn't mean you aren't with your \"soulmate\".  Everyone has doubts, and human nature seems to want us to get out and not be tied down to one person.  But commitment and dedication to someone we love and made a promise to is worth more then any fantasy you can dream of with that charismatic cutie at the office, even if they are wonderful.\n\nGood for you.  I'm happy for you and your family.",
            "This post makes me happy.  It reminds me of what someone told me years ago. \n\"There will be plenty of chances to cheat, but if you really are in love with someone, you won't throw away what you have had for years for something so small.\"",
            "I am pretty sure I commented in your OG thread that I felt like something was missing from your marriage. It sounds like you have taken some important steps toward reversing this potential problem by being honest and taking a bit of action.",
            "Excellent choice. I'm sure its one that you wont regret. \n\nGood for you. ",
            "So did you tell your wife you met up with Talia and confessed feelings for each other? ",
            "It's unbelievable that in the original thread everyone is like \"don't tell anyone, just cut contact and distance yourself\" and now that OP says he told BOTH his wife and the crush, every single being in this thread is going \"good for you, that's the right choice\". Do people even read these things?",
            "Good stuff, this'll end up making you and your wife stronger in the end. ",
            "lol, this is the least impulsive coworker hoookup story ever. Also FYI, assuming any of this is true, if old Talia is someone who would get with a married dude, run from her like the plague. She won't be new and exciting after a few months and then you'll be like \"oh Lord, I have to pay $2,500 a month to my ex wife and only see my kids on the weekends.\" ",
            "Well done, OP. Invest in the life you have.",
            "Good for you!",
            "I'm glad you are making efforts with your wife and fixing your marriage. \n\nThat being said, your conversation with Talia where you two confessed your feelings was *highly* inappropriate and unnecessary. ",
            "[deleted]",
            "Good for you! I've seen the kind of devastating trauma that can come from letting these things blossom into something more serious, and it's not something to fuck around with. I'm happy for you and yours that you've realized the grass is greener where you spend your time watering it. Best of luck to you and your wife, it sounds like you're on the right track. :-) ",
            "I just let out a huge breath of relief.  Good luck to both of you!",
            ">got my head out of my as\n\nThat' real good news mate. All the best for the future OP!!",
            "This is one of the best updates I've ever read! Good for you for sticking with your wife and working on the relationship. Best of luck in the future OP. :)",
            "Glad you were able to confront your feelings before things got out of hand and be honest with your wife, it takes some real guts to be tell her that. I think your marriage will end up stronger as a result. Something I will remember if I ever find a wife.",
            "I think you handled things well. I've seen it said a few times here and it's worth repeating. Everyone cheats for a reason. It's not always a good reason. It doesn't make it okay. It doesn't excuse what they did. But whether it's \"they're hotter than you\" \"I was drunk as fuck\" or \"we're just drifting apart and they were there to fill the void\", people have a reason when they cheat. This is important because you saw it coming up, and you've now realized the reason and are taking steps to fix it before something worse happens. And really, every once in a whole couples SHOULD take a step back and evaluate their relationship and make sure both partners are getting what they need out of the relationship. ",
            "There are good arguments for and against disclosing his feelings, it's a hard one. If it were me, I'd prefer that my partner didn't. But I can see how he's trying to be honest and move forward. \n\nThe bottom line for me though would be that he didn't act on his feelings, he decided to be honest and he's recommitted to our relationship. People are not perfect. I'd feel hurt and angry but I'd want to keep working on the relationship. \n\n\n\n\n ",
            "Dear OP, I think even realising your feelings and typing your original post needed great courage and strength from your part, and it's a pity that so many redditors readily set up an Inquisition and start judging so hard. It's only natural to feel these feelings and not everyone can so honestly and coherently arrange them and deal with them efficiently.\n\nIt's a loosing battle to compare something so fresh with daily routine. Because you're comparing the incomparable, the shallow and transient with the deeply rooted and timeless. You're lucky to have a wife who you are so close to and can share and understand each other at this level. ",
            "I would have been happier without any discussion of your feelings for one another, I would consider that an inappropriate conversation personally and a cheating act to have it. You don't actually need to have your every thought heard, and you could distance yourself and she could act like a professional about it at work.",
            "Yay. The ultra rare happy post. Congrats for figuring everything out OP, and I truly hope things continue to work out. I suggest keeping the scheduled date night for as long as possible. Life will get in the way, and you'll have to cancel every now and again, but keep it up. What better way to teach your kids how to keep marriages strong and alive by continuing to date their mom. ",
            "I was so ready to be mad at you; good job being a good person! I wish your family all the best. ",
            "Good on you dude. Too many guys try to have their cake & eat it too. ",
            "Thank you OP. My dad has been with my mum for 20 years. Her dream was to have a perfect family, she thought she had the perfect husband. She loved him through everything. She took care of him when he was ill and they thought he had cancer (bad diagnosis). She quit her job to look after him when he was getting his masters. She stayed at home to be a good mother. My siblings and I were blessed to always have a parent with us as we grew up.\n\nShe loved him with so much faith she couldn't even believe he would do such a thing. She never doubted him, and we had really respected him. But everything is different now.\n\nThank you for loving your family enough that you are willing to recognise this, and work through it, OP! Thank you thank you thank you. It gives me so much happiness and hope to you that there are people like you and your wife in this world. It really fills me with so much warmth. You truly love your family, please don't forget that!\n",
            "This sub has been a life-saver for sure. Good on you for coming here, taking advice, and changing. ",
            "Sometimes it takes the fear of losing something or someone to realize what they actually mean to us! ",
            "I feel like you two confessing your feelings to each other just advanced your inappropriate relationship further. Now your attraction is overt. It's like the next step.",
            "there's no April Fools on this sub, right??\n\ncongratulations and good on you!  you're helping to keep us dudes from looking like complete turds.",
            "Well done OP :)\n\nYou did a lot of things here that aren't easy. The self realization that this new thrilling relationship could lead to dangerous places. The courage to tell your wife that you think something was missing. The courage to put a name to what was happening with your co-worker and end a relationship that you were starting to find a little too fulfilling.\n\n> hopefully I'll never have to return to this sub-reddit again\n\nWe sure wouldn't mind if you came back as a commenter, you have a good head on your shoulders!",
            "I can't believe everyone is patting this guy on the back.  \n\n1) Your talk with your wife seems vague.  Did you actually tell her that you are attracted to a coworker you see everyday?\n\n2) He confessed his attraction to the woman he works with the coworker who reciprocated.  So now he is working with a woman who he is attracted to and who knows it and vice versa.  This is a ticking time bomb, and his wife has no idea this conversation took place.  This crosses the line to emotional cheating in my book.\n\n3) The right thing to do would have been to get another job or a transfer, then tell his wife the actual truth, that he was falling in love with a coworker so he requested a transfer.  \n\nI predict, and I hope I am wrong, that it is only a matter of time before he sleeps with this woman.",
            "Good for you! Glad to hear you've come to a conclusion that the relationship with your wife was worth fighting for. I truly hope everything continues to works out for the both of you. All the very best. ",
            "Good OP family is very important I would never give that up I'm glad ur focusing on them now :)wish you all the best :)",
            "Dude, awesome. ",
            "Good for you, man. I hope everything works out.",
            "badge fall lush divide observation chop office wasteful worthless vegetable\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
            "Awesome update!",
            "I am so happy to read this update. Some people just don't realize that the grass is greener where you water it. Wishing all the best for you and your wife!",
            "Not Just Friends is a good book for this.  I suggest you read it. ",
            "Good for you. Probably a really smart move. ",
            "Read the original post and then this update. Massive big up to you for doing the right thing by your wife and kids..I hope everything works out really good for you and your family :)",
            "Good man. It's all about making the decision, if you know what you want, and then acting on that. Making the time for what you really value, and communicating about it.\n\nI'm happy for you :)",
            "I think at some point most people think about the greener grass. Kudos to you for choosing to nurturing what you have to help it grow.",
            "This restores my faith in humanity a little. Thank you for the update, OP! You did the right thing. ",
            "Glad you listened to the advices good luck with your family!",
            "Glad you came to your senses and didn't screw up your life.",
            "You are a real man!",
            "If you were here, I'd buy you a beer,or whatever drink you'd like ",
            "Congratulations!!!",
            "Bravo Mate... Bravo. ",
            "Well done.",
            "Keep reading your update over and over again and stay strong.  Fall in love with your wife all over again.",
            "This is a great update. As a male who's struggled with infidelity, I'm really happy to see these kinds of success stories. Love the person you're with.",
            ">r we made a schedule and are going to work out date nights for us to spend more time together.\n\nDon't let the pressure of expected date nights make you give up and stop doing it. Date night doesn't need to always be traditional date stuff like fancy dinner and a movie or stuff like that. It should be sometimes but any time you spend away from home and away from \"family business\" can be used as a time to reconnect. ",
            "OP, look at the 2 x 2 x 2 rule:  evey two weeks is date night.  Every 2 months, get away for the weekend, every 2 years, take a vacation.  I know that's sounds easier said than done.  Give it try...",
            "Just read through the original and this update.  Good for you!  It's hard to do what you did, and I know you'll be happier for it.",
            "Well woah hold on a minute - what shows does she like?",
            "It sounds like it'll benefit you to read the 5 Love Languages book also! ",
            "The life you want, the marriage you want, you already have. Whatever deficiencies exist, YOU CAN fix. I'm glad you made the right choice. Even if things don't work out, you didn't take the coward's way out. Good on you.",
            "Thank you for giving us the update and I'm very glad you're refocusing on your family!\n\nThere's a common pattern that can happen here: you made a strong act of will to overcome temptation, but a while later when your guard is down, you might relax your efforts and fall easily into the very thing you're resisting now. \n\nSo I'd advise you to be alert to anything like that happening with Talia.  Now that you both know that you had feelings for each other, it's all the more likely that in a moment of weakness, or a moment of frustration when you're looking for support, you'll want to head her direction and she'll be glad to see you coming. Maybe you can go back and read the first thread if that happens.  Wishing the best to you and your family!",
            "Fucking posts like this make me smile from ear to ear. ",
            "good on you, wonderful update",
            "Well done. It's ok to face temptation and you dealt with it in the right way to an amazing degree. ",
            "Wonderful update, OP. All the best to you and your wife!",
            "Bravo!",
            "Good job! ",
            "This is the best update I've seen in a while. ",
            "You're a good man. You did the right thing. I'm so happy to hear men like you still exist! Your co-worker is right, other men would let it continue to an even worse state. \nBut instead of giving in, you decided to push yourself to what you know is the right thing to do. \n\nGood job. I hope you and your wife continue to have an amazing life together. <3 ",
            "Talia is right, you are a good man. Good luck",
            "You did the right thing seeking advice. Your an amazing person and you have put faith back in many lives reading your post. Thank you!",
            "You're a good man",
            "I think I teared up a little reading this :'( it's so touching",
            "> So I talked to my wife about it I told her how I felt and what was on my mind and we had a heart to heart. We cried a little and I don't want to lose her we made a schedule and are going to work out date nights for us to spend more time together.\n\nNice! +1\n\n> Me and her met up and I told her the honest truth I'm married and I don't want to do something I'll regret forever. I told her my feelings were getting a little to inappropriate and that maybe we should not talk outside of work.\n\nAwesome! +10 \n\n> So we ended our friendship.\n\n+100! You win man of the year! Good shit man, reading this type of shit gives me hope for humanity haha you're a very mature person and you did everything you were supposed to do. You communicated with your partner, you were honest with your feelings for talia and you cut contact. More people need to take notes on this. \n\nI just recently had to cut off a friend of mine I used to like because she was trying to show interest in me even though I just started dating someone. I was really oblivious to what she was doing but my girlfriend gave me a wake up call and I decided to cut my friend out of my life because I don't want to jeopardize my relationship. \n\nBest of luck man! You're gonna be fine!",
            "This is uplifting to read. You're being a good man and making the right decision, even though getting to where you want to be wasn't the easiest route. I admire you. ",
            "It's like anything new and exciting, great for a while but it too gets old over time. Might as well find ways to enjoy what you already have. ",
            "I wish consensual non-monogamy was more of a thing. This sounds like a scenario that could have benefited from it.",
            "omg you are such a good guy!!",
            "[removed]",
            "Omg you need to learn how to use a comma.",
            "I was in a similar situation, but went the other direction. ",
            "See OP, I know how you feel. Only if the polygamy was legal.....dumb laws "
        ]
    },
    {
        "post_id": "i8uxei",
        "author": "Chonkybean",
        "title": "UPDATE: I (21 f) believe my boyfriend (32m) of 1 year is emotionally cheating on me &amp; I don’t know how to talk to him about it.",
        "url": "https://www.reddit.com/r/relationships/comments/i8uxei/update_i_21_f_believe_my_boyfriend_32m_of_1_year/",
        "score": 3601,
        "num_comments": 255,
        "created_utc": 1597300536.0,
        "selftext": "Edit: I’m just now looking at reddit since I posted this and I did NOT expect this many replies, holy baloney. Thank you all for your kind words, encouragement, and tough love ❤️ also, I just realized my title is weird, (&amp;amp;) I think that’s because I’m on mobile and I copy/pasted the title from my previous post. Sorry about that! \n\n[original post ](https://www.reddit.com/r/relationships/comments/gq23vq/i_21_f_believe_my_boyfriend_32m_of_1_year_is/?utm_source=share&amp;amp;amp;utm_medium=ios_app&amp;amp;amp;utm_name=iossmf) \n\nMy original post didn’t get a lot of interest but there were a few people who asked for an update and I really just need to vent. \n\nThe night that I made my original post, Rick called me to tell me he was going to visit his brother who lives in a nearby city (Jolene also lives in this city). As soon as he called I knew what was going to happen but I kept my mouth shut because I wanted concrete proof. He was sharing his location with me &amp;amp;amp; I watched (and took screenshots of) him drive directly to her house, and stay there for 2.5 hours. I even texted my sister who lives about 20 min away from Jolene about it, and she drove there and took a video of his truck in her driveway. \n\nNeedless to say I was absolutely pissed. I cried to my mom about it, then went to his house and packed up all my stuff &amp;amp;amp; brought it to my parents place. Not long after I got back to their house he called me to tell me he was headed home. \n\nI asked him “so are you going to tell me the truth about where you were tonight?” \n\nHe acted oblivious, said “I was just at my brothers, what are you talking about?”\n\nWhen I said “okay, if you’re going to lie to me that’s all I need to know” he immediately started apologizing, saying he just went there for a visit, he just wanted to see her daughter, and he wasn’t trying to hide anything from me.\n\nMy favourite part was “if you would have asked I would have told you, all you had to do is ask!” \n\nUmm, I JUST asked you, and you lied to me??? So he asked if I would come and talk to him in person the next day. \n\nThis is where Dumb Bitch Me ™ comes into play. \n\nI went the next day after work to talk to him. I asked him to be honest and tell me if he slept with her. He said no. We had a long conversation of him saying he fucked up but he didn’t want to lose me, etc. etc. At the end of it basically we decided to still be together, but that it was going to take a lot for him to regain my trust. My one condition for him was to not talk to her, and if she did talk to him, or visa versa, I needed to know about it. I told him if that makes me a psycho bitch then he should just break up with me.\n\nSo for about 2 weeks we were still in a relationship but not spending near as much time together, saying I love you, or having sex. Basically it was like we “restarted”. HOWEVER during this time, she remained his best friend on Snapchat, and he continued to hide his phone from me. After two weeks I had gone to visit him, and we started talking about the situation. He was accusing me of cheating with someone to “get back at him” (with zero reason to believe this), saying he feels like he’s walking on eggshells and that I don’t trust him and he can’t trust me. I asked him what he wanted to do about it because at this point I was so done with putting in all the effort.\n\nHe told me he wanted a break, and I told him I don’t do breaks. So we decided for a week we would just have some time to ourselves, but the rules of a relationship would still apply.\n\nI left to go back to work, and that week he went and stayed the night at her house 3 times.\n\nThat week was so fucking hard for me, laying awake at night watching his location on my phone, knowing he was in bed with her. I barely wanted to exist, let alone go to work during the day.\n\nSo that weekend, I went to see him again and broke it off for good. I decided on my drive there that I was going to keep it simple and not blow up at him, so all I said was “I don’t think we should be together anymore”. He hugged me, and his eyes got teary which was hard, but literally the next day him and Jolene were publicly dating, and still are.\n\nNow I’m dealing with the aftermath of them turning certain friends against me as well. I’m not sure what he says about me but I’ve already had a few people “unfriend” and “unfollow” me. I guess I just don’t understand how it’s not blatantly obvious to these people that he cheated on me but oh well. I wish I could tell everyone the whole story, and show them all the screenshots, so everyone would see what they really did but I know that’s not the right thing to do, and honestly it’s not the kind of person I am. \n\nThe hardest part of this all has been the overwhelming feeling that I’m not good enough. I have always struggled with my self esteem, but this has completely destroyed my confidence, and I feel utterly worthless. I can’t get past the thought that I was just a placeholder for him until she wanted him again. \n\nTLDR: Rick went to see Jolene behind my back, I confronted him but we stayed together. He went and stayed the night at her house 3x so I broke up with him, now I am the bad guy and also Big Sad™",
        "permalink": "/r/relationships/comments/i8uxei/update_i_21_f_believe_my_boyfriend_32m_of_1_year/",
        "comments": [
            "Those 'friends' who cut you out without hearing your side were never good people begin with.  Breakups are always hard but it does get easier and soon you'll find yourself stress-free from all the BS that came with having an idiot bf.\n\n\nSpend this time to love yourself and realise how amazing you are.",
            "One-day you'll find someone who loves you all if you and you'll look back laugh about this then never think of it again. It might be hard now but it'll get easier, he's 32 and acts like a 17 year old ...",
            "Him being an ass has nothing to do with you or your worth. Perhaps consider some counseling to help work on your self esteem. It can be helpful to have someone to talk to about those things. \n\nAnd there is no shade here, but please be extremely careful in the future about dating someone that much older than you until you’re at least in your late 20s. Even then, proceed with caution. While not everyone in their 30s dating a decade+ younger is an abuser or a creep that is taking advantage of someone with less life experience and more patience for B.S., enough are that it’s worth keeping your eye out for.\n\nI’m sorry that things worked out this way, but I’m glad you’ve seen his true colors and dumped him without wasting any more time on a cheater. I hope you enjoy all the happiness in the world in the future.",
            "He’s clearly taking advantage of you. I hope you get through this and find happiness. ✌🏼",
            "Wow it's good that you threw out the whole man! You should be proud that you came out the other end of a shitty shitty relationship and that Jolene can continue dating a cheater. I went through a particularly crap break up which inevitably caused some division in my friend group (albeit not incredibly dramatic) but what made all the difference were the people I had as my support. I really relied on my closest friends/family in the months following the break up and I think that's what you need. People who cant see what he did was clearly wrong dont deserve your time and honestly blocking people online can really help you in terms of moving on (I did this myself 10/10 would recommend). Basically now it's time for you to look after yourself! You are worthy of love and you deserve everything! Take yourself on a nice date, buy yourself flowers, go out into nature, get involved in hobbies. You're living life without a dead weight on you anymore which makes you free to do whatever you want! Xx",
            "This is terrible. He sounds like a total loser. Hope you are alright.",
            "32 year old dating a 21 year old is 100% a loser",
            "How dumb do you have to be to cheat in your girlfriend while also sharing your location with her on your phone? I, for one, am happy that you’re no longer dating a dictionary-definition **idiot**.",
            "Him cheating is not a reflection of you at ALL. \n\nHE is insecure and needs validation from other women, and it was easy to get from her.",
            "> I’m not sure what he says about me but I’ve already had a few people “unfriend” and “unfollow” me. \n\nHe already told you what he was going to tell them - that you revenge-cheated because you “crazily” accused him of cheating with Jolene. When he accused *you* of cheating with zero evidence, he was test-running that story for the breakup he knew was coming. That’s the narrative he’s going with, I’d bet my actual savings account. \n\nI don’t blame you for not wanting to participate. But I’d also remind you that defending yourself and telling the truth is not “dramatic” or unreasonable. If someone spreads lies about you, you have every right to clear your name. I do think starting a social media war is a bad idea, but if any of the friends who have unfollowed you are important to you, I see no harm in reaching out to ask them what they’ve heard, and to give your side of the story if they’ve been fed falsehoods. They might believe you, they might not, but at least you’d know you tried.",
            "Dude you were dating a man 11 years older than you, and now he's turning your friend group against you? This must be the midwest..",
            "Look up Narcissistic personality disorder, triangulation  and smear campaign (he’s smearing your reputation like he smeared his ex). Make yourself familiar with the disorder so you recognise the signs and don’t attract another toxic personality type. \n\nJust be glad that you escaped before you were permanently entangled with this ass. His ex will be suffering soon just like you have been. \n\nAlso a word of warning, narcissists love trying to get back with their exes (as you know) so be careful he doesn’t try and win you back just so he can do it all again.",
            "Go post them screenshots. it would have been fine if they just left you alone but if theyre going to turn the narrative they deserve to get the rug swept under them. Otherwise hope you find better people and friends to be around cuz breakups are hard yo. best of luck",
            "Just let it go. People know the truth, they aren't stupid. Its just that some people think cheating isn't a big deal and rather side with him. You don't need them.\n\nFrom your story, I pretty sure this guy was manipulating you the whole time. Why would a 32 y/o be dating a 21 y/o in the first place?",
            "I believe age gaps can work. I do not believe there is anything inherently wrong with an age gap in a relationship. But, in my experience, a 30 year old man looks for 20 year old women so that he can manipulate them. I feel like he took advantage of you. I'm sorry you went through that and I'm glad that you're out. \n\nThe Big Sad is rough. But please, if you can put it into perspective, know that you didn't lose anything of value. You truly didn't. You only gained from his departure in your life.",
            "Thanks for updating. It sounds like you're better off without him anyway. The problem isn't with you, it's with him",
            "Keep your head up, you know you've done the right thing.\nIf friends are siding with him without even talking to you then that says a lot about them...you will make new, better friends than that.\nTry to remember this was all his doing and he's an asshole, do things that make you feel happy and your self esteem will grow.",
            "[removed]",
            "V proud of you!!! I hope you are too. Just the fact that you didn’t blow up on him says a lot. It’s frustrating when someone fucks with your trust. But it’s easier to just drop the loser and go be better off!",
            "I'm so so so sorry about this. You don't deserve any of this and I'm going to tell you something I wish id heard a lot sooner than 25 years old. You are enough. YOU ARE  ENOUGH. YOU ARE ENOUGH.\nYou are enough for you and absolutely no one else matters when talking about your self worth. I know it's tough now, but just remember that your self worth is defined by YOU. Not him, not your friends, not your parents. YOU. You define how you want to be treated and anyone who can't respect that should go.\nThink about those friends you call family im sure you think they're worth their weight in gold. I PROMISE they feel the same way about you & you deserve a partner who feels the same way.",
            "Hey, I'm a 21(f), if you need to talk about it, vent, or just need a friend to message, I'm here for you! \n\nYour ex sounds like trash, you sound like a trusting, empathic soul. Please don't think you're not good enough. Some people will think that the grass is greener, it won't take long before he realises it isn't ❤️",
            "He turned you into someone who feel the need to stalk your own boyfriend. That's not good, your trust is broken and there's nothing you nor him could do to change anything. I'm glad you've let go.",
            "YOU ARE 100% NOT THE BAD GUY, please understand this!!!!  \n\nYou’re still so young and deserve so much better than a scumbag who can’t give you his 100%. I promise you there is someone waiting out there, who will show you the love and affection you deserve. Time will mend your heart but please do not give him any more time and thought. You’ve got this 💓",
            "You never had a chance with this guy. He still loved her, no matter how badly she treated him.  It was inevitable that he went back to her.  She’ll likely slip again and mistreat him.  Just block him, drop his location finder, shut him off every way you can, and move on and find someone who treats you as his number one rather than “good enough for now”.",
            "I don't get why you're not talking freely on social media about how hard it is to be cheated on.",
            "Girl, good for you. You broke up with this man in a very mature way when he deserved a lot worse. That speaks volumes about you. If there's anyone in this whole story with low self esteem, it's him. A respectable confident person never puts themselves in a situation to sneak around, hide, lie, cheat or abuse someone else's patience, trust and good will. And the fact that he was doing all of that at the age of 32 only shows you what a loser he is, and how \"far\" he's made it in life.\n\nAlso, don't let a bad experience with a messed up individual dictate how you're going to feel about yourself. In fact, work on building up your confidence and loving yourself after this experience. Assholes like him can smell the insecurity in other people, and they deliberately go for people with low self esteem because no one else would take their bullshit. \n\nYou deserve so much better, and you will find it, because you have your life ahead of you. The right people will always stay.",
            "He's manipulative. Those tears of his aren't for you, he doesn't care if he hurts you he just cares about serving his own needs and wants. I'm hopeful for your future love life that you're experiencing this harsh lesson at a young age, that you don't learn the hard way after a couple of decades spent in a vicious cycle with such a toxic person. Learn early how to spot a superficially charming, manipulative, unempathetic, gaslighting narcissist, how to read people for disingenuous versus genuine emotions (spot a liar better), and learn to trust your gut. Guys like this do tend to date younger than themselves by a significant age gap because they're too emotionally immature to have much success with women their own age (who, generally speaking, tend to be wiser to his brand of bullshit, though not always). Guys like him are emotional adolescents in the bodies of grown men. \n\nI'm curious: how old is Jolene, and when did *they* first get together?",
            "He’ll do the same thing with her, once he gets the itch for the fun of sneaking around hits him again! Some people get off on the crap they put others through. Just find someone who deserves your time , he doesn’t!",
            "1. He’s a 30 something year old dating a 21 year old.\n\n2. Fuck the “friends.” You honestly have more self-preservation than me. They weren’t your friends to begin with. You’re 21- you’ll find better friends.\n\n3. If he cheated on you, he’ll do it to her. \n\n4. You are so strong and have your whole freaking life ahead of you.\n\n5. If anyone’s self-esteem should take a hit, it’s his. Think of this as the universe giving you a lucky break-the trash took itself out.\n\n6. Cheating has nothing to do with how “good” one is or how “pretty” one looks. Jay-Z cheated on Beyonce. Brad Pitt cheated on Angelina Jolie.\n\nCheating should only go to show how trash the cheater is. You are beautiful and capable and amazing!",
            "Why are you dating a 32 yo?  You’re 21.  That’s creepy.",
            "Geez, what a loser. Be proud that you left that clown, and dont even think you arent worth it, for someone else's poor judgement calls. And as for the woman he is dating, in what world does she live in, wherein she thinks he will be faithful to her? Anywho, that aside the point. Its hard to hear and even harder to do, but please just stand strong. You did nothing wrong, and you arent the baddie in this.",
            "Wow fuck him... fuck jolene too\nYou are twenty you're young let me tell you something in most cases theres no reason for your boyfriend to be so close to his ex.he will give you every excuse in the book.... they're friends.. he loves the kid.. fuck that. Any 32 yr old man with a girlfriend isnt friends with women. ESPECIALLY not a fucking ex.... he gaslit and took advantage because you're 20 and you didnt wanna look crazy... there was nothing normal about it. He was a coward to string you along\nLesson to take from this is: if your man is happy at home he has no reason to try to be friends with any of his ex's",
            "Omg you are more mature & have more integrity than he ever will. Jolene deserves him, WOULDN'T IT BE A SHAME? if he does the same to her.....",
            "Damn the worst thing about how this ended up was he probably ruined one of Dolly Partons best songs for you :(",
            "He wants to build a stable of women that fulfill his individual needs without having to respect them as individuals.\n\nDoesn't really sound like a charmer.",
            "I felt this way too much. I’ve been there. It was the worst breakup of my life. Because I NEVER felt closure. Because how can you ever say “I feel fine that he cheated and lied about it. I feel fine that he made the rules to break them.” \n\nIt’s been years and I’m still dealing with the aftermath of having some confidence again.\n\nOne positive is it made me take ABSOLUTELY no shit from any man ever again.\n\nSo just know that you got this. It’s gonna be hard, but you totally are going to get through it.\nYou’re going to come out more aware from this. You’re going to become so much stronger. And you’re gonna kick the future’s ass.\n\nI wish you all the best in your journey back to confidence. If you are able to, I would really recommend a few therapy sessions. Something like this is really hard to work out on your own.\n\nBest of luck to you! Also fuck fuckboys.\n\nAlso this is a grown ass man. What a gross motherfucker. Who, at 30 years old, gets a 21 year old, and then cheats on them. Like, bro you already scored what you wanted. You need another??? This guy is a pig af\n\n\nPs. You’re so much more worth something than he is. You know the importance of a bond, of a commitment. You respect the rules. You tried to make it work. He was so spineless he had to lie. He was so worthless he needed two women at once because he feels so little about himself at 30. He knows he’s garbage. Therefore he gotta act like trash.",
            "Girl, is it possible for you to get out of the small town? Because the world is so much bigger than 32 year old men who never grew up and a crowd of people who buy every word out of their mouths.\n\n\nI've stayed friends with my friends' exes over them on multiple occasions. If they didn't even hear you out then they're not worth your time.",
            "Your friends didn’t cut you off. If a person can be turned against you without hearing your side, that person isn’t a friend, nor is it someone you should want in your life.",
            "> I guess I just don’t understand how it’s not blatantly obvious to these people that he cheated on me but oh well. \n\nPeople who watch a 30 year old date a 20 year old don't care about the 20 year old. I'm  sorry you had to go through this OP.",
            "you are a saint. if anyone did that to me, i'd flip out. idk how you kept your cool facing him for the breakup because i would have torn him apart.\n\nanyone who chooses to cut someone out of their life over relationship drama without hearing both sides is usually an asshole by default. they're not real friends, nor healthy friendships.\n\nyou didn't deserve any of this. not a moment. you're better than all of them. keep your chin up queen.",
            "You should be proud of yourself! Him and his friends are trash.",
            "Took you a while and you put up with way too much, but it’s good you ended it. \n\nI had to laugh at the dumb ass though, knowing his location was shared with you and then going to her place and then lying about it. \n\nLike others are saying, you’re 21. You have so much time to have fun and party or whatever you feel like doing. Move to a big city and live it up. Enjoy yourself.",
            "Don't want to be that guy but if he's turning your friend group against you, he may be telling lies about you. I think you should pursue this issue further.",
            "Rick is a piece of shit, Jolene is a scummy woman, and you deserve better. I’m so sorry you’re enduring this. That’s a terrible burden to bear, but know that it’s a reflection of them and not of you.",
            "A relationship a) ended and restarted again and b) built on cheating and lies ain’t gonna last anyway sis. In time you’ll be grateful that the trash took itself out 💕",
            "Bad people crosses our paths, sometimes as bf, sometimes as fake friends. \n\nYou got rid of bad person, in my opinion. He was cheating on you, gaslighting, lying to your face. Clearly he doesn't respect you. The break up part is bad, but in time you'll realize that you are a good person that did all you could to try to save this unsaveable relationship. \n\nJust don't blame yourself. It's not your fault he's an a\\*. \n\nAlso, if those friends unfriended you without even hearing your side of it, I'm sorry but they are not real friends.",
            "I am so sorry that this has happened to you. I was married right after I turned 21 and had been dating him since I was 17. He was 4 years older than me. My X husband destroyed my life. He cheated on me with a girl who was a guest at our wedding. Someone who should of been a friend and this girl had people following me and threatening me for divorcing him after he cheated on me with her.(I had concrete evidence)\nThese feelings of not being good enough and being down on yourself will linger for awhile but you will get through it. The best advice I can give is to take this time for yourself and to be ok with being alone. Don't go out on dates or have sex with anyone. Your head is in a very fragile emotional state and you must rebuild yourself before moving on. \nWhen I was going through my divorce, I spiraled out of control and ended up in an abusive relationship for over two years; which led to severe PTSD and other mental/emotional issues. Don't let that be you. Take care of yourself. Get yourself good and don't worry about what these \"friends\" say. If they were your true friends then they would be by your side, supporting YOU.",
            "Omg count yourself lucky for getting away from this dude when you did. You’ll be ok, you did the right thing. It does suck though. Cheating has nothing to do with the other person. Think about all the rich beautiful celebrities that get cheated on. It is a defect of him, not you!",
            "You will soon find that the relief of not feeling that anxiety and heartache while in that relationship far outweighs this current feeling of sadness. It will pass. Trust me, I have been through it. Stay strong, for YOU. You deserve so much more that what he was giving you. See this as a blessing because now, you have the opportunity for a brand new life! New man, new friends (:",
            "he played you and he played you hard. those were crocodile tears at the end, girl. learn from this never to give someone who does fuck all for you more than one chance.",
            "It’s easy to fall into this trap when you’re young that what a man thinks of you defines your self worth. A man wanting to have sex with you or date you does not make you inherently valuable. Think about women you really admire and look up to either in your life or in the media. What qualities do these women have? Do you think these women are valuable because of their marital status? Strive to be more like these women you admire. \n\nConfidence doesn’t just materialize out of thin air, it comes from practicing regular self care and self improvement. Focus on your studies, career, friends, exercise - things that make you feel good and fulfilled.",
            "Listen. It’s pretty fucked, but you 21 you got a shit ton of time to meet new people, as for your friends, I will tell you this when I was 21... I had a giant group of friends, probably like 40+ homies that I’d hang with on a weekly basis, I’m 28 now... and you know how many of those friends I even talk to once a year?..... literally 1 of them, friends aren’t at all what’s it’s cracked up to be, most of em will fuck you over anyway. Plus you’re 21... enjoy life man. Go out, meet a guy that respects you, most importantly, don’t loose hope and start being one of those people that are like “all guys are the same”... cuz in the end. You gunna pass up a really good guy with that perspective. Aye. Good luck.",
            "I've been in a similar situation when I was around your age, dating someone about 10 years older thinking I was in love, but later found out I was only there to pass the time until he got back with his ex.  I know how horribly heartbreaking and hurtful it feels at the time but after a while, when you begin to love yourself again, find someone worthy of your love, meet some people worthy of your friendship, you'll look back and be like, \"yeah, I didn't really need him, anyway, but it was an experience.\"",
            "Fuck that cheating, lying, POS guy.  You deserve better.",
            "Next guy will need to prove himself to you. Don't give second chances and trust your gut. You've learned a lot from this relationship. Now cut it and everyone associated out of your life. Block them on social media and focus on you and the amazing life and goals you have ahead of you. \n\n*Have a mantra :* **\"This sucks now but it will get better\" \"I'm beautiful, I'm strong, I'm worthy, I can do this\" \"I can do hard things\" \"This is temporary\"** *Even if you don't believe it, it helps to hear it and say it until you do.*",
            "Honestly you did so well I don't think a better response could have been given in context of the situation. \n\nI know it feels like hell right now and you question what sort of person you are, why he would do this.... Girl the problem is not with you it is 100% with him. Sounds like this 32 y.o. man still doesn't know how to be mature and have a grown up relationship. I went through something similar and what really helped me was to just grieve (to get it out of my system), get angry (cause you're entitled to that), and it was after all of that where I picked up whatever was left of my self esteem and learned how to put my needs and feelings above others for once in my life. This was truly transformative and soon enough time faded that pain.  So anyways what I'm saying is that you should look after yourself, do what you want to, feel what you feel, and live your life. Your ex is going to be stuck in that cycle and perpetually unhappy but you will have moved on.",
            "I understand it's hard when you're the one in the middle, but girl, next time you have physical proof that your boyfriend is in someone else's bed have the strength to pull the trigger! You could have had all the power in this scenario with that one move. But instead you played dumb and gave him the power to further break your heart with his lies. \n\nDon't dwell too much on this guy. He literally prefers an addict to you. You can do SO much better.",
            "\"If they'll do it for you, they'll do it to you\".  He'll end up cheating on her too...  They always do.  \n\nI know it sucks to be cheated on...I've dealt with that, even with my (now ex) husband.  It hurts to feel like you're not good enough.  But you are.  The problem is not with you, it is with them.\n\nRick is not man enough to end one relationship before beginning another one.  Jolene apparently has such little self-worth that she is okay with be a side piece.  The friends who have dropped you are not friends.  If you are truly worried about what people think, share a meme or something about a cheaters on your Facebook or something.",
            "I'm petty af and I would show them that he was cheating.",
            "Jolene sounds like the name of an annoying mermaid in legend of zelda",
            "OP, when I was cheated on I also took a huge hit to my self esteem and agonized for a long time about what I may have done to catalyze it, or what was \"inherently wrong\" with me.\n\nThe answer is ZILCH. Please remember that this guy is absolutely pathetic, pathetic and so is Jolene. Why on earth would she take back a guy who was essentially two-timing with a woman over 10 years his junior? Look up Narcissistic Personality Disorder (which someone already mentioned) and their actions might make a little more sense. I feel bad for her kid, who already idolizes a shitty dude and will have to grow up around their dysfunctional mess of a relationship and witness it implode in time.\n\nYou, on the other hand, have accrued some life experience which will make you stronger and more aware of red flags moving forward. What happened to you was very stressful and I suggest talking to a therapist to help rehabilitate your self-confidence moving forward (lord know that I wish I had!)",
            "Never take a cheater back. Leave the first time, scrape the sh*t off your shoes and move on. Taking back a man like this enables his behaviour. They NEVER change, unless they have a one night stand and confess it right away to you with lots of remorse other than that if they never tell you the truth and if it’s an ongoing thing it’s not worth the heartbreak.",
            "Gf, she wants him? Give him up.  The more you hold on, the more it makes you look less desirable.  You’re not.  This isn’t your fault and this isn’t even about you.  Cheating is a character flaw.  \n\nLet her deal with his BS full time & take away the whole forbidden aspect of their friendship. And those so called friends ?  If they were real friends they’d call you to hear your side of it. \n\nKeep your dignity, grieve the relationship but live your best life.  Be wary of the snap back - he’ll come running back to you once things settle.",
            "You did the right thing by dumping him, and it’s understandable you are hurt and sad. You didn’t do anything wrong, yet you were punished and hurt by the person you love. Add insult to injury, he’s now with the person he was cheating on you with, and you’ve realized that many of your friends aren’t good friends at all. You really got the short end of the stick. \n\nIt will take some time to recover, and I encourage you to practice lots of self care and self love. You are not at fault. You ARE good enough. You were treated very badly. You have so much worth. He failed you and failed himself. His poor character will show itself to others eventually.",
            "I once left somebody I'd been with for a long time for something shinier and the grass is never greener\nJust thank him that he didn't waste more time you're so young and it's probably a great lesson to have to deal with, just make sure what you take from this is positive",
            "That’s so terrible. :( I completely feel for you. Wishing you healing and all the best. He wasn’t good enough for you, he was the person who was lackluster - not you!",
            "Honey you dodged a bullet. With this kind of behavior and that kind of age gap theres a good chance he was trying to groome you into someone he could use and abuse at his leisure without consequences. Honestly I'm not sure how you couldnt tell he was a creep earlier but good on you for cutting him out.\n\nAs for those friends, they're not friends. Dont insult your real friends by lumping them in with that human trash. They took his side cause they're probably just like him, and they all deserve to be removed from your life.\n\nTake your time, heal and grow, and when you're ready go and find yourself a real man if you ever regain interest. Trust me, there are good people out there who will treat you how you deserve to be treated.",
            "Here's the thing. As a 20 year old you are young and you haven't had enough life experience to really see through things. I'm not insulting you at all. But, with age and especially for a woman, you gain a certain wisdom with men as you get older. The first thing I would tell you is to try to date men around your own age. A significantly older guy has played the field with lots of women and knows how to manipulate them, especially younger ones. And there is a problem with older men that ONLY date significantly younger women. Women their own age see right through their bs and want nothing to do with them. So more than likely there is ALREADY some issue with a guy like that. \n\nYou did nothing wrong. You trusted him and still he lied to you. Don't feel worthless! He is just one guy. There are so many better men out there that are worthy of you. You my dear are not the problem. Just be careful that he doesn't come crawling back when she gets tired of his crap and plays with your feelings. X him and her and all their friends out of your life. You will be better for it.",
            "This is total narcissistic personality behaviour. I was in almost an identical situation, complete with the same age difference, the ex with a kid etc. I didn’t know any better and thought it was something I did. \n\nListen to me very carefully OP, he will come back and try to get you back. It will not work out with the ex and it could take weeks, months or years, but he will try. Block him on everything, and if you get a “I miss you” message even if he’s still with his ex, delete and don’t reply. Do not be flattered because it’s just him trying to see what options he still has open. Please please please do not make the mistakes I did. Forget him and never look back!",
            "Awesome you got away! Now time for STD testing",
            "Hey honey... it will be okay. Try to find solace in the facts that YOU didn't do anything wrong. This was something that he did to you. Not encouraging you to be the victim either, but you dealt with this situation very well, I think! Keep your chin up, blah blah blah, all that good stuff. You will get through this. Love yourself harder than ever.",
            "The audecity that he has the balls to hug you after u broke up with him after he cheated 4 times in less than a month on you and lying ab it.",
            "Girl, he is and always was the bad guy and a huge fuckin loser. Dating older men doesn’t mean they’re mature!! Don’t date creeps in their 30s who are interested in you, because they’re....well creeps. This man is trash!! You did the right thing and are the only good thing in that relationship obviously. You shouldn’t place your worth on a man who obviously never saw it. Keep your head up, love!",
            "You're 21, the hurt passes. I had mine at 20. That shit sucks, honestly. It does pass eventually, even though in the moment I never thought it would.\n\nYou'll meet many more amazing people in the future once you're ready. I was single for about four years after mine, and I'm coming up to my first year. It's honestly really lovely, and a lot better than my previous relationship. Didn't see my ex for about five years, and those feelings were completely platonic when I did run into her.\n\nYou learn from all of this and it makes you a much better and stronger person for it. I promise :)",
            "I was in a very bad relationship that is kind of similar. I relate to the loss of friends, the lack of confidence , the cheating and the lying. You know what I learned: You don’t have to explain yourself to anyone. Don’t try to. They did you the favor of cutting out the fat. \n\nNow for your confidence: Find your passion. I went back to college. I was always athletic and fit, but I took it to a level that everyone thought I was 18. I built a career where I was very successful. Did things for myself financially that I never had before. Just knowing that I could do it all without help.... I was able to build myself back up! You can too.\n\nThe way you feel now is temporary. You weren’t good enough? This guy sucks. This girl is now stuck with a cheater until he moves on to the next girl. You were too good for him. You’ll find someone much better for you. You’ll learn to love and trust again.",
            "I know other people have said the same thing, but you're better off without those friends - and of course him. I lost 6-7 \"friends\" in a similarish situation where they all hid my ex's cheating for nearly a year and then acted really self righteous about it. He and some of them definitely did some kind of smear campaign on me to a few other people I considered friends. The fact they believed it still galls me a bit, but my life is far better not wasting time on them and their fake ideas of friendship. It won't feel like it for a while, but this is an opportunity to improve the people around you.",
            "Now you can make some friends your age that have similar interests. You got this! 💕",
            "You and I sound like the same person. I had a very similar experience and I have the same standards (no breaks, the whole weird 2-week period knowing your S/O is emotionally cheating on you but wanting to make it work, etc) except I didn't have all that awesome evidence and a friend videoing his car. You go girl. You may feel like Dumb Bitch but in my book you rock.\n\nIn fact, this happened to me in both of my long-term relationships, so my advice would be to you to try to identify any red flags early your next go-around. I didn't. Nothing is wrong with you. I promise. These people are just really good at manipulating. Best thing I did was spend over a year single to rebuild myself.",
            "He is not man enough, you did everything you could and more... it's not your fault, he was not the person you believed him to be. He purposely lied and hurt you... again it's not your fault, he would cheat on anyone if he is that kind of broken shell, and honestly you deserves better treatment and someone who will put you on first place. You are still young girl and he as 32 year old new exactly what he was doing. \n\n Trust me once a cheater always cheater, Joan will probably go through this soon too, not something I wish on my worst enemy, but she chose the lying man as someone trustful... watch it burn from distance and get someone better. Some real partner.",
            "Everything there is a post about a 20-year-old dating a thirty-something guy, you can be sure shit is about to hit the fan.",
            "Forget about that loser and find someone better. I have no doubts it'll cheat on her and maybe even try and get back with you",
            "Let it be known that he cheated to everyone!!",
            "Post the proof. He's a liar and a cheater, and he deserves to be treated like one. He'll probably cheat on her too.",
            "WOW, I am so sorry about the situation. On a positive note, at least you don't have to waste any time with a liar and a cheat. One step closer to finding your soul mate:)",
            "So Jolene is cool with being his sloppy seconds. He probably told her that he broke it off with you bc he's in love with her.\n\nIf you want to get him back, let Jolene it was your decision, not his for your relationship to end LMAO!",
            "I'm applauding you for being savvy enough to track him on your phone.  I wish I'd known how to do that when I thought my husband was cheating on me.  You should be proud of yourself for keeping the moral high ground.  You've been mature and reasonable and given him nothing that he can criticize you for.  none of this is your fault.  Don't let his behaviour drag you down.  No one can make you feel inferior without your consent.",
            "I invite you to flip your thinking around.  He is not good enough for you.\n\nRelationships are self selecting.  Those \"friends\" who unfriended/unfollowed you were not really friends.  Best to know who your real friends are.\n\nSeeing a therapist would help you with your self esteem/self confidence.  Good luck.",
            "Took a while but this is probably for the best, I mean 11 years difference is creepy af. When you were 11 he was 22, I'm 22 and I'd never even think about dating an 11 year old. I know that it's not exactly the same as a 21 year old dating a 32 year old but you're definitely at different stages of life sand like I said it's kinda creepy.",
            "Wow this guy is a total piece of shit. I know sometimes it’s difficult to see the light at the end of the tunnel but this is not someone you want, you’re just clouded right now. You ARE better without this guy.",
            "I went through this exact situation. And it sucks. I feel for you super hard. If you need to talk, you can send me a direct message. Seriously",
            "Yeah, I hear you, but if you don't show the screenshots I don't really see how people can read your mind and take your side.\n\nYou deserve to have your side known, and you need to stop taking on all his burdens.",
            "Break ups are so difficult and getting cheated on is the absolute worst. At least now you have a chance to find someone more honest and faithful. Jolene will be going through what you're going through now eventually.",
            "Congrats on ending it OP. The relationship wasn't healthy and was beyond repair, I think deep down you knew that.\n\nI think you should see a therapist for some of your trust issues. I'm seeing some red flags here 1.) Tracking his location 2.) Tracking his social media patterns 3.) Having your sis go check out Jolenes house. \n\nI hope you reach a point where you can trust your next partner again. Take some time to work on yourself and heal from this.",
            "I've also lost someone who I thought was my friend when I broke up with my boyfriend of 1.5 years. But she only listened to his side and took the step to unfollow me on Instagram. I was hurt but I should have known she would side with him given they went to college together.\n\nI have just been spending my time with those who have stuck with me through all the years before I got in that relationship. They have been with me through so much I try to think about them than the ex's friend.",
            "I hope you get better :/",
            "I’m so sorry this happened to you. It’s a good thing things ended as quickly as they did and didn’t prolong. It’s so shitty that he cheated instead of being honest with you first.",
            "Glad you took out the trash in the end. You don’t need him",
            "Sorry things ended up that way.\n\nDon't worry about the people who unfriended you. They're probably cheaters too and not worth anyone's time.",
            "Lol you ain’t the bad guy. You should consider yourself blessed. You dodged a bullet with a shit dude. Good work! Enjoy your life",
            "UGH honey why would you have EVER given him a second chance!!! You know better for next time sis! Know your worth!",
            "Sorry, how do you monitor his movements? Is this legal? Id be very careful with this. On a second note, good for you for getting out of this toxic relationship. You're only 21 so you haven't wasted a second, but only learned more about yourself and what you want in life",
            "Those friends did you a favour by cutting themselves out of your life. Rick is a douchebag and you will always be enough for the right person. \n\nI hope you find it in your heart to forgive yourself for trusting an idiot and rebuild your confidence again. You’re gonna be okay.",
            "People with low self esteem, or any weakness, really, get played\n\nRemember that",
            "Karma always comes back!",
            "It hurts to see that after all this being obviously his emotional issues you are blaming yourself for not being good enough. I totally understand you feeling that way but I just want you to hear someone say that it is and was never about you not being good enough. It was him seeking out someone else to fill the void while he was still emotionally attached to Jolene. I am sorry he used you like he did. But I'm glad you are out of that situation now. Allow yourself time to heal, invest some time into yourself and doing something you enjoy doing to help yourself heal.",
            "You are the victim here, but watching his location all the time wasn't healthy at all. Next time take care of your mental health too.",
            "I dont understand why you took pictures of everything and went back to him but I'm glad its over. This is why this man was dating someone so much younger would be my guess.  Take this as a learning experience and good luck!",
            "Listen to the song I hope by gabby barrett might make you feel better!",
            "\"Jolene, Jolene, Jolene, Jolene  \nI'm begging of you please don't take my man  \nJolene, Jolene, Jolene, Jolene  \nPlease don't take him just because you can.\" \n \n \nAs soon as I started reading this was all I could hear in my head. \n \nOn topic: do yourself a favor and don't give him another thought.",
            "Fuck Rick!   \nCongrats on making a hard decision for your happiness and not continuing in a bad relationship. Continue with valuing yourself and not wanting half ass things. I admire you for just breaking it off and being classy about it (I would have been petty af, showed him all the evidence and letting him know no wonder Jolene left him the first time, just to hurt him...yeah, I am not a good example of maturity) . You do deserve better and will get better.   \nAs for friends, they are not good friends and probably never were, apreciate those who are and you will see you will get more. Enjoy not having to deal with all of that and dedicate time for yourself, what you like, what you love, what you would like to explore.",
            "Put the screenshots on your FB wall. See what happens. But be prepared for all the drama after. If you are ok, just avoid thinking about them all. I know, easier said than done.",
            "The part where you said you don’t feel good enough and that your self eastern is low- I resonate with that. I was cheated on by a lot of past boyfriends and it destroyed me. I’m so sorry you had to go through this. Just know that there is men that will treat you right and do right by you, there not all bad OP. unfortunately I attract the wrong men, sounds like you may be in the same boat. Hang in there girl ❤️",
            "I can’t help but say that this whole relationship is very immature...on both sides. Break up, take some time to yourself and learn about what you really want from a relationship (friends and boyfriend) and what your standards are going forward! You can do this reset and come out awesome on the other side, you’re worth it!!",
            "This isn't a reflection of you, it is a reflection of him. You're better off alone for now, because you deserve you the most.",
            "No, telling the truth to your friends is exactly the right thing to do.  Lying to them to protect his reputation is not.  Good luck.",
            "Well girl. This happen with me. Almost the same thing. I know this is hard, I broke up with my ex almost 4 years ago and don’t have a relationship since, sometimes I dream with me breaking with him, calling him a liar and things like that. The last days I forgave him, I think this is the last thing I needed to do for going on. It’s hard, I know, but you better alone. The insecurity, the angry, the untrusted feeling, the guilty, everything suck when you are in this kind of relationship. And, you will be fine! Trust me. This will help you grow as woman, I say this for sure. When you’ll be ready, a nice guy will come trough. You can text me when you want! I’m not from your country, but can be a friend.",
            "He's trying to drag your name through the mud to cover his own cheating ass. Those who believe him and unfriend you aren't friends worth having. You are still very young and have plenty of time to meet other people who aren't lying sacks of shit. My advice to you is to avoid big age gaps, men in their 30s that date young women are manipulative and definitely don't see you as an equal. Just be happy he's gone for good and use this as a lesson ❤",
            "You don't say if you've cut contact with him at all, I'm hoping you have. If not, I highly recommend you do. He sounds like the sort of guy who will try to keep you hanging around just in case things go wrong with Jolene (also I have to say I love the song reference, but also reassure you that she does not sound as great as the Jolene from the song).\n\nDon't let him jerk you around, cut him off and keep him cut off. He's shown his true colors, and I wouldn't be surprised if he tries to cheat on Jolene with you. Don't fall for it, he'll only being using you.\n\nHe's trash, let her keep the trash she apparently wanted.",
            "It's okay, girl. Don't beat yourself up too much, the majority of women have that one toxic ex that was difficult to escape from. I think the best part about that is as soon as you have the courage to leave, you become a stronger and more independent person. \nYou begin to love yourself more, more so to the point that someone really has to be worth being in a relationship with for you to sacrifice your peace.",
            "Well.... Rick went to his Morty ig.... Like, between the two of us, we both went through some shit in the last two months. I met a guy I thought I was gonna marry and boom I got blocked bc \"he didn't want to he in relationship just yet\"\n\nSafe to say I've been hoeing around since then (and somehow haven't got covid yet??? Idk) but whatever. I know things are going to be tough, I know that it's going to be really hard for you and that you're going tk want to cry like a little baby and whatnot. I know I did. But right now, you have to tough it, you have to show him that you're so much fucking better than his worthless ass and that you can move past him, give him, Jolene, and all those fake ass friends the middle finger. You don't need them because they don't need you.\n\nNow, go to the store and get some damn ice cream because I know you're going to need it.",
            "Your ex is garbage of a person. When he begged you with tears in his eyes, that’s a tactic used by narcissistic people to manipulate you. He’s gonna cheat on her too. You deserve WAY better than that. \n\nYou’re 21. You will find a beautiful man who will love you and not betray your trust.",
            "> I wish I could tell everyone the whole story, and show them all the screenshots, so everyone would see what they really did but I know that’s not the right thing to do\n\nWhy not?",
            "I don't get why so many people share their location with their phone 24/7 especially dishonest assholes that try to lie without even thinking that their phone has already snitches on them. I'm faithful, I'd don't have anything to hide to anyone but still, I don't want to be pinpointed on a map for anyone to look up.",
            "Yo! \n\nPost all that! \n\nIt's kiiiinda petty, but it is exposure to his misdeeds. A person only vilifies another - unprompted, no less - knowing full well they've committed a heinous humanity foul when they're rife with guilt.\nThe friendships it may have caused you to lose may be friendships you can do without, but having known that feeling that you may be like at and treated differently, myself, that feeling is awful.\n\nIt might just be a part of the spiral that occurs in these situations\n\nHowever, there's a series of catches to giving into exposing him...\n\nIt won't fix anything.\nIt won't fix him. \nIt won't fix this. \nIt won't fix the pain.\n\nShit, it might make all that worse...\n\nThey say the best revenge is living well...\nPerhaps that's the best route. \n\nLove yourself. Know you're worth your own appreciation. Cherish the good. Remember the bad. Someone good and worthy of you will notice and be there for you in the future.\n\nBad decisions and choices follow each and everyone one of us - everywhere, everyday.\nIt's the decision (or not) to act on them that matters most.\n\nBreaking up with this butthole was the first step in recognizing your self worth. \nStick to it!\nBelieve in yourself!\n\nI hate platitudes like, \"time heals all...\" but having been in a very similar situation, trust me when I say that's really all it takes.\n\nTake care and best of luck!",
            "Just want to throw out here that feeling of being \"not good enough\" or worthless is just a symptom/side effect of a breakup like this. It's totally based in your old reality of this person's opinion of you mattering, which it no longer does, and in the future, you will forget you ever felt this way, I PROMISE. It happens to everyone.",
            "There's a lot of emotional baggage on your ex's end that it sounds like it would be the focal point of your relationship instead of actually being able to establish trust and focus on each other individually. \n\nIn all honesty, I wouldn't date a 32 year old at 21. You just started the fun part of your 20's and were dealing with a shitton of emotional baggage from someone. Focus on men who want to be with you and are in their 20s; I promise it will be more eye opening, and you'll be able to build stronger connections.",
            "I’m so sorry that you’re going through this, you deserve so much better. Make sure you take time for yourself to process the emotional and mental abuse that you went through. Being Gaslite is emotional abuse and that’s exactly what he was doing to you. I am so sorry. Hugs from an Internet stranger.",
            "I genuinely don't understand people who do this shit. The disrespect is something my brain can't process. How can someone be so self involved, so *gross*?? Sigh. The worst part is how much they try to insult your intelligence by being so fucking *lazy* about how little empathy they have for other human beings.",
            "You ABSOLUTELY  did the right thing. And I know it must have been hard for you. But in my opinion, at the end of the day, what matters is that you know the truth. You were there, you know what happened. And for next time you will have a higher guard, or maybe a better term, BOUNDARIES and you will hopefully find someone to respect those boundaries. Also, being you know the truth, and well me personally, I believe karma happens to the best of the best lol. So whether they last or they don't, chances are they won't, but even if they do, they'll both get theirs. And you will get yours! ( which is going to be something totally awesome I just know it. 😉) \nAlso wait, did I read hes 32 and you're 21?? Yeah I'm usually that age gap to with the guy I'm dating and the other 2 I've been with, long term too. Age don't mean a darn thing clearly huh? Lol. But no you did the right thing, and early on too. I wish I would have done so in my past relationship, but at the same time, everything happens for a reason. ❤\nBest of luck on your journey, have fun!!",
            "People don’t cheat because their partners aren’t “good enough” \n\nSometimes they cheat because their partners are “too good” and they are easy to take advantage of. But ultimately, people cheat because monogamy doesn’t work for them and they’re to scared to either be single or enter an non-monogamous relationship. \n\nPoint being, his cheating has nothing to do with you and everything to do with his own personal flaws.",
            "Gotta love when someone cheats and then convinces your friends to hate you. Same thing happened to me, except my “friends” only listened to what she said because they wanted to fuck her. I guess that’s the drawback of dating the girl who’s liked by the whole school",
            "Ignore people commenting and stereotyping you for being in an age gap relationship. I started dating my SO when I was 19 and he was 35 many moons ago and we’ve been happily married. Nobody knows the circumstances of anything and nobody knows you or him. People talk about judging and how it’s so bad; and go judge people’s relationships. I’m happy you left him and I hope you find true happiness that you deserve. You’re free from that mess!",
            "He is an idiot for doing this to you! He is not worth the time or effort! You haven’t done anything wrong and there is nothing wrong with you! It is normal to feel the way you are feeling right now but you should know that you have done the right thing by leaving him. He lied and broke your trust and you deserve a million times better! Keep your chin up and know that you are better than him. You will lose friends when things like this happen but they aren’t really friends if they are willing to take his side over yours, he is the bad guy not you. I’ve lost friends recently that I was friends with for over ten years, it hurts but if they don’t have your back they aren’t really friends! Hope you can move on and stay positive! All the best xx",
            "You’re right you weren’t “good enough” for him you ARE TOO DAMN GOOD for him.   Give yourself time to grieve the relationship and know that those unfriending you aren’t friends you need or really want. \n\nI wish you luck in the future. Be assured, your real love is out there.",
            "Just focus on building up yourself. And remember, this too shall pass.",
            "I'm just really sorry you're going through this. I'm sure it's very lonely. You didn't deserve this. I know it doesn't feel like it now but this is going to be an experience you can hold onto in your future relationships that will have taught you so much about life and love.",
            "Good that you broke up with him. He was a complete jerk, such a toxic person. How could you say you aren't good enough? It is him, not you, who isn't good enough. No one deserves this and you know better than anyone what you went through and how he made you feel.\nThere is more to life than having a partner. This is of course a very important part, but it is only a small part. And you have the whole time in the world for that.\nEnjoy being young, have some healthy hobbies and you will forget about him with time. And find better friends, those suck clearly...",
            "It really hurts to get dumped like that. In this instance, he may have done you a favor. You're seeing him for what he really is. And you know better now. Just use it as a learning experience. But never trust him again.",
            "My gut sank reading this, he is so horrible. I can't imagine how upset you must've been seeing his location at her house. \n\nJust know that you deserve better, because he was being an ass. The only mistake you made, was choosing a jerk as boyfriend. (Also you're ~35% younger than he is, or he is ~50% older than you are. Just let that sink in a bit. It's a big gap, and most of the time it doesn't go well when you're still so relatively young)",
            "He went out with someone so young because you’re vulnerable and easier to control as opposed to women his age. I’m sorry this happened to you. Good on you for knowing your worth! Who cares about what people say, you know your truth.",
            "Those people were never your friends. Good for you for cutting all that bullshit out of your life. You just built up some great emotional muscles. Go flex them. Prioritize yourself,  your happiness and people who treat you well. You've done great here.",
            "Jolene, Jolene, Jolene, Jolene\nI'm begging of you please don't take my man\nJolene, Jolene, Jolene, Jolene\nPlease don't take him just because you can\nYour beauty is beyond compare\nWith flaming locks of auburn hair\nWith ivory skin and eyes of emerald green\nYour smile is like a breath of spring\nYour voice is soft like summer rain\nAnd I cannot compete with you\nJolene\nHe talks about you in his sleep\nAnd there's nothing I can do to keep\nFrom crying when he calls your name\nJolene",
            "He was ten years your senior and cheated on you, lied to you and then abused you. Move on!",
            "I hope you get the satisfaction I did when I was in a very similar situation and got a text from the other girl a couple months later wanting to have coffee and talk because she needed some healing because their “relationship” fell apart and I got to tell her to go fuck herself. Either way, I can tell you that you will look back on this and gag because you won’t be able to understand why you dated such a loser. Life only gets better from here.",
            "Girl, once a cheater, always a cheater. They know the victim will take them back and they will do it again because they know the victim is easy to manipulate and control.",
            "No one 32 that is mature would go anywhere near a 21 year old.  You are only going to find the emotionally stunted ones if you go for that age bracket.",
            "Those \"friends\" aren't worth having. Eventually, one way or another, the truth will come out and then they'll feel really stupid for not getting all sides to the story.\n\nCut the ex out completely from your life, turn your back on him (think of him as a cancer you desperately need to get rid of)  and get the best revenge possible by living your very best life.  One day someone worthy of you will come into your life and you'll wonder what you ever saw in your scumbag ex.",
            "You don’t need friends line that get better ones",
            "You’re still young. Move on cos you’ll find better :)",
            "Jolene, Jolene, Jolene, Jolene!\nI'm begging of you please don't take my man",
            "Hear me out.\nYOU. ARE. ENOUGH.\nHe was the one that fucked up and if he starting dating her the next day he wasn't worth it. I'm porous of you, you're strong. I hope only good things come to you, you'll survive and please don't think you lack something. You don't.",
            "I love how I got downvoted. Ya’ll can’t handle the fact that some people are in happy relationships with people of a different age group and so you have to associate it with manipulation or grooming, its pathetic",
            "21 is barely an adult and 32 is a grown ass man, i’ve never seen such relationships go well, obviously older men like having young girls date them as a sign of status, it’s all physical.",
            "go nuclear and post the screenshots. if he wants to tarnish your name you should set the records straight",
            "I'm so sorry this happened to you girl. He should have just accepted the breakup when you tried to the first time. It will always be a mystery why men who have another woman in their pocket still try to keep the first one in their hand. A man that is 32 years old should be acting more mature than that. You acted 100x more mature than him. Don't sell yourself short. You have a ton more going for you. Use this time to build your self esteem and work on yourself. See a therapist. Do things for yourself that you enjoy. Get out and travel (when it's safe to to). Write down some long term goals you want to work towards. Good luck with everything.",
            "You are young, hot and too good for this. You literally have your whole life ahead of you and don’t need any of this baggage. Take some time for yourself, go out and have fun. Maybe even do some casual dating (I recommend “seeing” a couple dudes at a time 😘) but no commitments for a bit. Take a break to breathe and just really date yourself and fall back in love with yourself and your life. Your person is out there, and even if they weren’t - you are enough. If you need a galpal to talk to hit me up, and maybe if we happen to live a reasonable distance we can be IRL friends. I always need some girls by my side, but also am a pretty good listener. Chin up, babe. Proud of you. You and I both know you did the right thing, no matter how much it may suck right now.",
            "I [barely legal, F] am having issues with my controlling manipulative boyfriend [ageless, old as the universe itself, M]\n\nNo offence but what did you expect to happen with such a power Imbalance? Most dudes who can’t date their own age aren’t going to NOT use the upper hand that they have to do literally anything that they want",
            "Lmao bruh I’m 26 and I wouldn’t mess with a 21 year old",
            "Uggghhhh... such a long story.  Why in the world did you bother going to talk to him when he already proved he lies and you can’t trust anything he says?  Sorry.  I couldn’t read all this.  Just dump him immediately next time and deny him closure.  Nothing good will come from humoring him and he needs his ego lowered.",
            "Cheating on you and your guitar amp? Damn",
            "Update for you: you were never the gf. She waa.",
            "SOMEONE PLEASE tell me what \"&amp\" or just \"amp\" means or stands for! I've looked it up on Webster's online dictionary, urban dictionary, asked friends and ppl smarter &/or more net savvy than I... Nothin. I've especially seen the term a lot in video titles on porn sites that I watched... Um ... exclusively for researching the term. But hmmmmm still no luck. Can anyone gimme a golly-dinged hint here?\nThx in advance & sorry I have no good advice for OP",
            "Women:\n\nStop. Fucking. Dating. Old. Creepy. Men. \n\nJesus fucking christ.",
            "I'm glad you finally came to your senses.\n\nAnd fuck those 'friends'.",
            "Men can't be true friends with women unless there's some attraction. I have found this time and time again. They might deny it but men don't spend time with women unless they have to or they're hoping that something could happen.\n\nI think I've been cheated on by every guy I've dated (at least emotionally but also physically). I'm 29 now and I just don't don't think it's worth investing all of your energy into one person anymore. It's too easy to cheat. \n\nThe only married I know who don't cheat are super religious and don't cheat and separate because they see marriage as something more than a piece of paper. There's a few that just match up like puzzle pieces but they are the exception. \n\nI am so sorry this happened to you. I wish I could take your pain away. They won't be happy. Their relationship started on a lie, soon enough they won't trust each other anymore. \n\n❣️",
            "Sounds like Rick dodged a bullet",
            "just another age gap post",
            "*looks at age gap* \n\nCant say I’m surprised a relationship between someone fresh out of childhood and a 30+ y/o didn’t work out.",
            "The result shocks absolutely no one given that age gap lmao",
            "Did you ever make it hard for him to see his daughter? Were you ever jealous or insecure about his relationship with her? Just follow up questions."
        ]
    },
    {
        "post_id": "i909r5",
        "author": "ElFriday",
        "title": "[UPDATE] Mom thinks our relationship could be better. I'm happy where it's at but don't know how to tell her.",
        "url": "https://www.reddit.com/r/relationships/comments/i909r5/update_mom_thinks_our_relationship_could_be/",
        "score": 3588,
        "num_comments": 211,
        "created_utc": 1597326686.0,
        "selftext": "[Original Post Here](https://www.reddit.com/r/relationships/comments/i76bqk/mom_thinks_our_relationship_could_be_better_im/)\n\nTL;DR: I wrote down what I wanted to say, including boundaries. She didn't blow up, but as predicted, she didn't take responsibility either. But I've now done everything I can and can move on.\n\nNo one asked for this update, but I guess I wanted to give some of you \"told you so\" rights? I was able to use bits and pieces from almost every comment. From preparing myself for it to not go well/needing to hang up on her, to making sure I didn't fall into the trap of explaining/listing out past incidents. I basically said the following:\n\n\"I'm happy for \\[list of accomplishments she's had\\]. Unfortunately none of that erases 20+ years of lack of support and actions by you that clearly indicated I wasn't a priority. I'm not looking for explanations nor apologies. I've worked hard to make my peace with it, and I've worked hard to get our relationship to a point where I can maintain my mental health and have you in my life. So when you say it could be better, in my mind it's right where it needs to be. If that's to change at all, I have some boundaries that **need** to be followed: \\[list of boundaries, some specific but two big ones of *Respect my boundaries* and *Respect when I say 'No'*\\]. If you want us to talk more, I'm happy to pick up the phone. You have every right to ask things from me, but have to respect when the answer isn't what you want to hear.\"\n\nFirst question was if I thought our relationship was better before my stepdad came around - No.\n\nNext was asking for examples when she didn't support me. I told her she'd have to do some reflecting because she was there for the same events I was, and it's not fair to me to ask for that emotional labor. She said she had done \"lots\" of reflection and couldn't see it \"until \\[stepdad\\] came into the picture\". She pushed a couple more times for examples. \"Is it because I missed some events *your dad* was at?\" She stopped when I called her out the second time for deflecting responsibility for her actions. I told her multiple times during this portion that she doesn't have to remember/own up to anything, but she does have to live with the consequences.\n\nHer last question was, \"Is there any way we could ever push past this all?\" I told her this is what \"past this all\" looks like. She pushed back a little bit, but when it was clear that I wasn't moving an inch, the call ended with \"Well, thank you. You've given me a lot to think about.\"\n\n\n\nNone of her questions or responses were any indication she was worried that I was hurt. She was trying to find justifications I might listen to, anything to poke holes. There was part of me that wondered if she always recognized how much neglect there was and just didn't want to face it, but claiming \"lots\" of reflection and not having a single incident come to mind that didn't involve blaming someone else answered that question. While she was \"calm\" while she tried to respond, her tone was very tense. Worst case here she continues to try to push boundaries and I cut off contact and it's one less stress in life, best case she respects them and it's one less stress in my life (I know this is likely a case of she'll respect them until she doesn't). The important thing for me was that I was up front with her and set clear boundaries. I've done my due diligence to telling her how our relationship could \"change\" (I used \"change\" instead of \"improve\" very intentionally with my mother). I'm relieved. Ball's in her court and I have some answers. Thanks again for the advice, sharing of your own experiences, and encouragement. It gave me the confidence and a plan for that phone call.\n\nEdit: some typos\n\nEdit 2: I'm relatively new to posting on Reddit so forgive any etiquette missteps please. First, thank you to the kind strangers for the awards! My first. Second, thank you to everyone that commented. I'm both happy and saddened that I'm not alone. I appreciate the perspectives that everyone brought; it gave me some new things to consider. Third, thank you for the recommendations for groups, books, resources! I fully recognize this is just one step in a lot to finding peace and have some reading to do. Good luck to everyone who's going through something similar, whether it's family or friends. Stay strong!",
        "permalink": "/r/relationships/comments/i909r5/update_mom_thinks_our_relationship_could_be/",
        "comments": [
            "I've had this same conversation with my dad. He knows there is something to repair, but he wants examples just so he can argue with me about them. \n\nWhen he says things like this; \"She pushed a couple more times for examples. \"Is it because I missed some events your dad was at?\"\n\nI tell him \"that sounds like work you need to do in therapy. I can't help you work to an understanding of your actions when I'm the one that was impacted by them.\"\n\nHe won't go to therapy, but I refuse to conduct therapy with him. So we are very low contact now.",
            "Good for you!! Setting boundaries with parents is hard work, sometimes the hardest work we will do and you did it kindly, directly, and firmly. I hope you can pat yourself on the back and find a way to reward yourself!!",
            ">\tNext was asking for examples when she didn't support me. I told her she'd have to do some reflecting because she was there for the same events I was, and it's not fair to me to ask for that emotional labor. She said she had done \"lots\" of reflection and couldn't see it \"until [stepdad] came into the picture\". She pushed a couple more times for examples. \"Is it because I missed some events your dad was at?\" She stopped when I called her out the second time for deflecting responsibility for her actions. I told her multiple times during this portion that she doesn't have to remember/own up to anything, but she does have to live with the consequences.\n\nWow!! This is fantastic, I almost want to send it to other support subs to sticky on top. You really couldn’t have handled her better.",
            "What you did took guts. Kudos from this internet stranger. Its hard to be in the position you're in, and you handled it well. Stay strong, and good luck.",
            "Holy moly you’ve got some amazing emotional intelligence.\n\n> Next was asking for examples when she didn't support me. I told her she'd have to do some reflecting because she was there for the same events I was, and it's not fair to me to ask for that emotional labor.\n\nThis is amazing and I’m stealing it",
            "I have saved this post for my future discussion of this with my own mother. This is the closest thing I have read that matches exactly what I have gone through. The only difference is that she and my bio dad have stayed together, which makes it tricky for saving my relationship with my dad. All other stories I’ve read with narcissistic parents have them splitting up with their “normal” SO. Thank you so much for sharing your experience. I am very proud of you for maintaining your assertiveness and enforcing the boundaries you need to stay on top of mental health. That is so much easier said than done, and I am so happy for you. Hopefully it’s not weird for an internet stranger to say lol. I hope only the best for you in the coming years, and that you are able to continue holding your own 💕",
            "Good job on being gentle but firm! I'm impressed.",
            "Wow.  Good for you!  That must have been very difficult.  I am impressed how you handled such a conversation so clearly, with focus and held to your talking points without getting sucked into her version, etc.  Thanks for sharing.",
            "As someone who has had to set difficult boundaries with parents who don't get it, I just had to comment. I am so damn **proud** of you! What you did was so hard and took so much self-love and strength. I hope you recognize your efforts and the amazing way you're protecting yourself while still being honest about your feelings. If you can carry this method of handling conflict forward in your life, you'll be the most successful version of yourself. I'd love to offer you anonymous but supportive internet stranger hugs. <3",
            "This was a very difficult thing and you handled it exceptionally well.",
            "you did so well!! we're all really proud of you (◍•ᴗ•◍)❤",
            "Congrats to you on handling the situation as well as you did.  It sounded like a difficult conversation, but you made your points known, you set boundaries, and you didn't allow her to trample them.\n\nIt sounds like classic manipulative behavior.  She is trying to get you to JADE: **J**ustify, **A**rgue, **D**efend, or **E**xplain.  She wants you to engage so she can gaslight you and explain her horrible behavior away.  By not engaging and not JADE'ing, you aren't giving her any room to manipulate you.",
            "Kudos. And I think you're right. She's not reflecting on it, simply waiting you out.",
            "Hi love. It seems like we share moms. I could describe her and her behavior exactly the same way down to a word. And her complete lack of understanding on what she has done and reluctance to face its consequences. I have solved this for myself but just going extremely low contact and interacting only on my own terms, and it seems you have got that figured out. I promise you with time it’ll become some distant thing that is not central to life, it’ll be almost incidental and have no large influence over your life and emotions. All the best of luck to you",
            "I have a very similar relationship with my mom and literally minutes before I read this, she was texting me with her usual baits.  I held firm to the tone and distance I have committed myself to in the last few months of therapy and it was hard and uncomfortable. I know she will not take kindly to my detachment and will respond with self righteous rage - the knot I know so well was tightening in my stomach.  \n\nAnd then I read your post and it was an injection of hope.  Like some cosmic best friend  reminded me that we already know what we need and how to maintain it for ourselves.  And that I'm not alone with my crappy mom and the baggage she's given me, nor am I alone in the pursuit of health.  I didn't know I needed all that until you gave it to me.\n\nThank you.",
            "I just want to say - I read your first post and it sounded so much like my own mother and I. My mom is also an addict (drugs and alcohol) and we’ve never had a relationship. She was emotionally abusive and borderline physically abusive and also had a string of very violent boyfriends. She was diagnosed with cancer ~12 years ago and thought that would absolve her of all wrongdoing and we’d have an instantly perfect relationship “because she’s dying and doesn’t have much time left.” She even had a similar blow up at me because I sent her a text last year on Mother’s Day and didn’t call. She even pulled the same line: “Well, I’m your mother, so you should call *me*.”\n\nI only talk to my mom about four times a year. I don’t think I could tolerate speaking to her more often than that. I know this hurts her, but it’s what’s best for me after being subjected to all of her shit growing up.\n\nEven though I know it’s best, I do still feel a lot of guilt sometimes for “denying” her a better relationship. I just wanted to say I’m really happy you were able to advocate for yourself and your needs. It’s really, really hard.",
            "Your mom is going to have to do a lot of work to ever get to the point where she can even recognize that her past (and present) behaviors were toxic and destructive. When people have self-defense mechanisms in place, they often see their associated behavior as positive or benign. She likely cannot remember what she did because her judgment at the time was so clouded. Many times, I've only been able to change my behavior when I see someone else doing something I hate and then it clicks for me that I do that too. \n\nSometimes too much damage has been done and sorry just doesn't make a difference. Sounds like you're in a good emotional place. If your mom had experienced any real emotional growth, she'd be proud of you for your boundaries instead of annoyed that you won't be her emotional crutch.",
            "Please check out /r/raisedbynarcissists and even better, /r/raisedbyborderlines - they've helped me a lot.",
            "Children always want to have a relationship with their parents, even when the parents have abused them emotionally, physically, or spiritually. We, as children of abusive parents say things like, when they get older, they will realise what they have done and they will be sorry and want to apologise and make up for it. I am sorry, but this is rarely the case. \n\nRight now, you still want that relationship with your mother, and your are bending over backwards, still trying to make it happen. It is great that you are giving her limits and boundaries, but you are still hoping when she is giving you clear signs that objective others can notice [I suppose, like me], she is not going to change - she is not taking responsibility, she does not see a problem in her behaviour, is trying to make you do the work [she is asking you to give examples of her behaviour when she knows full well what they are]. By saying the ball is in her court, you are still hoping, and you are not looking at the whole picture - you want the happy ending that will never happen. \n\nThe reason I say this is from experience. My mother [I rarely use this term anymore] is a narcissist. She did everything your mother did and maybe more. I kept telling myself, she would change, because I dearly wanted it to happen. I wanted a mother that cared. I thought that with time, she would mature, have insight into her emotionally stunted behaviour. I believed she would take responsibility for the nasty things she did - take responsibility and blame for the things that she did to the family and other people, but it never happened, no matter how many times we talked, negotiated, set boundaries, or whatever. She would always revert back to \"I don't know what you mean\", or \"your are being unfair to me\" or \"I didn't say that\", when all those things happened. Your mom is an emotional child who will probably never take responsibility for her behaviour, and you have to prepare yourself for that. You need to make a line in the sand where you say, \"this is enough, I will no longer do this anymore. I have given her enough chances\".\n\nI finally went non-contact. All I can say is I wish I did it years earlier. It is such a relief not having her in my life. I came to terms that she will never take responsibility for her behaviour because she is just a 3 year old in an adult body.",
            "I feel so proud of you, AND inspired!! It shows that you have done a lot of work and whether it works out with your mom or not, it seems obvious you have learned to love and respect yourself in such a healthy way. 🙏🙏🙏",
            "I relate to a lot of the behaviors you described in your mother. I’m so proud of you for having this tough conversation and setting boundaries! Thank you for sharing, you’ve really inspired me as well",
            "You did amazing! I missed your original so I read it from the link before this and she reminds me a lot of my mom. They likely never will accept responsibility or change. Maybe look into cluster B personality disorders and the out of the fog website. It may help explain how she cannot see or care how she is responsible for the pain she causes.",
            "> None of her questions or responses were any indication she was worried that I was hurt. She was trying to find justifications I might listen to, anything to poke holes\n\nSorry for butting in, but this pinpointed the frustrating part about discussing boundaries and parenting with my ex-wife this morning. I say \"You don't understand why I'm upset\" she says \"I don't emphasise with you?! I give you so much encouragement!! (i.e. telling me what I ought to *do*, *think* and *feel*)\"",
            "My parents are dead now. I can say from experience that it feels good to be honest with a parent, but that you may never hear the things you want from that parent. In this case, it sounds like you're looking for her to take very specific responsibility for certain things, and to apologize in a meaningful way. That may never happen. In the interim, you've done the right thing.",
            "I just wanted to say I really appreciated reading how you handled it. I learned something from your experience. Thank you.",
            "You did an amazing job. You should be proud of yourself. It’s good that you noticed that she was looking for others to blame and you didn’t let her poke holes by citing specific examples.\n\nShe will likely continue to deny her behavior for the rest of her life.\n\nAnd watch out for “love bombing.” She’ll probably try to get you to lower your guard.",
            "Good to see an outcome that wasn't horrible. Hey at least you have the foresight now that if she doesn't contact u again you'll probably be better off without it, and if she continues to try and make things worse, you can ditch her completely. She may be your mother, but by golly she isn't someone who loves you like you were her child. \n\nThis is her hole she dug and she can lie in it.",
            "It's amazing how many people think that they can do whatever they want, hurt you over and over, but when they snap their fingers still expect you to come running to \"push past this all\" like it's your job to figure out. \n\nThis random internet stranger is very proud of you.",
            "Bravo. You did the best any of us could do about the situation.",
            "Seems like you did a great job here!!\n\nI'll throw in one other thought:. If Mom is either in 12-step or other therapy in keeping sober, she will voluntarily apologize to you.  You should not have to prompt or ask at all.  The point of her apology is for her to demonstrate that she understands your issues from a point of view that isn't hers.  She hasn't passed that test yet.",
            "This is a great update, you should be proud of yourself",
            "Thanks for sharing this. Sounds like you did great. I’m going to use your plan as a template for dealing with a friend who has boundary issues.",
            "wow you did a really great job handling this. it also gave me a good way to respond to my own parents when they ask me to list examples of neglect. I'm so tired of bringing up examples they can't remember. Thanks for posting.",
            "Thanks for posting this, I missed your first post but am needing to have a similar conversation with my mom. This has helped me a lot.",
            "I'm proud of you. I didn't see your first post until I saw the update, but you did really well. I'm so tired of some people (not all) in recovery thinking that all is forgiven and forgotten now that they aren't doing whatever they did now. Emotionally draining people will always drain you, it doesn't matter if they are sober or not. Best of luck.",
            "[deleted]",
            "Wow, I'm so impressed with you for how maturely you were able to have that conversation. Reading your words was like a description of my relationship with my own mom in many ways and I'm not sure I'd have been able to do so well as you did (I don't have conversations like this with mine... Avoid avoid avoid is my strategy). I'm proud of you. That could not have been easy to articulate/hear/stay composed for, but you did it. Wow.",
            "Congrats on setting boundaries.\nMy grandma doesn’t respect boundaries and has done some less than ideal things she refuses to acknowledge. But my mom doesn’t want to completely loose her from her life so they talk once a week on Sunday. And there are a couple of topics my mom refuses to talk about. She’ll tell her mom to stop talking about it once and if she continues will normally  just say she has to go now. If her mom calls on a different day she normally won’t answer the call and will text her that they’ll talk on sunday. \nIt’s not ideal and she doesn’t always have fun on the calls but it’s what she decided she could handle.  Keep up the firm boundaries and good job having the hard conversation and holding your ground!",
            "Well done! I had this talk with my mum January this year, and it sucks so I can empathise with you. Well done on taking that big step. Good luck with the enforcing of your boundaries going forwards (as I can imagine she will try to hoover you back to her in a month or so' time).",
            "This is such a great example of having and keeping boundaries. You did amazing OP! You should be proud of yourself! :)",
            "Very well done to you, op. I did a similar thing last year with a family member. Unsurprisingly, I don’t here from them anymore.",
            "Hi OP! I remember your last post, and can I just say I’m proud of how well you managed the conversation? You redirected when needed and didn’t let your mom take over the conservation it seems. \n\nIt can be so difficult to set boundaries with parents, but is very important when it involves a parent that tends to have narcissistic tendencies. I’m glad she didn’t blow up, and that you were able to confront her in a good way. \n\nSending you good energy and well wishes, stay strong and firm in your boundaries. You are valued and cared for!",
            "I was going to say that maybe she actually had no idea what she did wrong but almost anyone might at least guess that their selfish, alcoholic behavior could cause problems.\n\nIt sounds like you're doing exactly the right thing for your own health and wellbeing.",
            "Eventually, I'm going to have to tell my parents that I went no contact with my abusive sister (so holidays will look different).  My parents enabled a lot of that abuse, and it has strained our relationship.  The way you handled that discussion with your mom is amazing, and I've read this twice and saved this post so that when I'm ready/have to have that conversation, I can hopefully remember the maturity and grace you showed.",
            "It sounds like you did everything just right while prioritizing protecting yourself. I've recently tried several times to reach out to my mother to repair our relationship (which she broke) only to have to accept the truth: she doesn't care enough about me to take accountability for her actions. I can't forgive her until she admits everything she did and didn't do and actually asks for forgiveness. So that leaves us at an impasse. I think every woman wishes she could have that Lorelai and Rory relationship with her mother but the sad truth is that a lot of mothers simply aren't capable of that.\n\nI'm trying not to take it too personally. My mother is a psychologically damaged individual and her behavior is a coping mechanism. I actually feel really bad for her because she's never going to be honest with herself and is never going to do the work required to heal mentally. She's not a happy person and she probably never will be.\n\nAt least now, having gone through all this with her, I know what to do and what not to do when I hopefully become a mother myself some day.",
            "Very proud of you for standing your ground! It sounds like your mom is very emotionally immature. I would highly recommend the book “The Adult Children of Emotionally Immature Parents” By Lindsay C. Gibson. I’ve been reading it lately and it’s changed my life. It’s made me feel seen and given me strategies on how to maintain my mental health while having my parents in my life.",
            "Well done its tough when it is family. Our boundaries are often blurred.\n\nMy only comment is that sometimes our memories play tricks on us. It is proven that we remember things differently to how they happened and can often leave the things out that made us feel bad or we didn't want to remember. \n\nI have had a similar situation to yours with my dad and he didn't know any of the events that pained me so much when we had our chat. This bothered me as it caused me so much pain, how could he not remember?! \n\nSo i told him and he didn't have a clue as to these events. They were so etched in my brain but not his so Sometimes I think its OK to say 'like X or Like Y'. In your original post you mentioned she was an alcoholic and that may have altered her perception with it all or had a different perspective. \n\nEither way you did great and Good luck OP 👍",
            "It sounds like you have this relationship where you need it and a path forward that you set. Great job.",
            "\"...it's not fair to me to ask for that emotional labor\"\nWow. That is such a mature, fair statement, that needs to be heard by all the adults that failed their kids by choice. That's beautiful and I'm so happy you stuck to what you know you need/deserve and didn't give in to her. Good for you.",
            "Wait... do we have the same mom?",
            "Can I just say you are great at explaining. The amount of details here is the first time I think I would be able to offer truly sound advice on a situation. Too bad you know what you’re doing already (I guess that’s a good thing though).",
            "Well done! I am so impressed with how you handled this and your emotional intelligence. I tried to have a somewhat similar conversation with my mother last year, but it didn't go this smoothly and we are now no contact, yet she still keeps pushing boundaries (e.g. going behind my back to find my address after I refused to give it to her). I'm saving your post just in case she comes back and I end up needing to have this conversation again. \n\nFrom your last post: \"trust her to be my mom - works for like 6 months - get blown up at because I don't want to take her recommendation for a trash can\", ***I felt that***. I was planning a wedding at the time, so there were a  lot of trash cans for her to have opinions on.",
            "You handled this magnificently. I really admire that. I wanted to thank you, oddly, because I struggle in a very similar manner with my own mom. I often feel very confused and hurt, with little knowledge on how to handle situations in a way that is fair to myself. The amount of maturity and self-respect you displayed is incredible—and must have taken a lot of work, as it shouldn’t have been your job in the first place to advocate for yourself to this extent, as she is *supposed* to be the parent. Either way, I’m sure you know all of this. I just wanted to thank you, because I feel I am somewhere along the journey you have been on for years, and reading your posts helped me feel lot less alone and a lot more valid.",
            "First, this post was so helpful as an example of boundary setting. Thank you for laying out what you said, it was perfect. Second, I personally think your mom did better than many people would in listening to you, but most people don't change as quickly as your mother thinks she has. Hopefully this may bring some perspective to her perceived change, because as you pointed out, her reactions show she hasn't fully grasped the impact of her choices. She may need some time to process what you told her and learn from it, or she could continue to sweep it all under the rug in hopes you'll \"get over it\". I really hope it's the former, of course! \n\nEither way, you did wonderfully--it was healthy, strong, and empathetic. Thank you for the update!",
            "I’m going to save this post because it is so well articulated, I could use so much of this if my mother ever cornered me into a conversation like this. Thank you and best of luck to you!",
            "Wow! You did an incredible job! Thank you for writing this all out. \n\nI’m well past this stage with my parents, but it took me years and several attempts to be able to articulate my boundaries as concisely as you have.",
            "Proud of you! I did something very similar with my mother and was so afraid, I recorded the phone call. She went as far as to say I was sexually abused by my stepfather because I “was a difficult child”, I put up a thousand walls between us and two years later she called me.\n\nShe has grown, completely owned up to all the abuse and her wrongdoings and what she wishes she had done. She cried, apologized. \n\nI’m not saying this will happen to you too, but know that I didn’t feel an ounce better, in fact I just felt worse because I new empathy for her and all the abuse she endured from both family and her husbands. I have found peace in knowing she will not continue to abuse my kid brothers, and proud that she is also trying to confront her mother (my maternal grandma) about the trauma she caused her.",
            "Well done! The ball is in her court, indeed. \n\nYou did yourself proud.",
            "You are so brave for standing up for yourself!! You deserve whatever peace it brings you. Here’s to hoping your mom listens❤️",
            "I feel like this is a complicated one. Drinking is often something people turn to out of desperation and trauma. It hurts the people around you, but it's a sickness too.\n\nShe's probably in serious turmoil inside and while it's not your job to fix her, and likely no-one can, it sounds like she's doing some serious personal work. She's given up drinking, she's dealing with realising that the love of her life is a jerk and that must be painful, and she's trying to repair things.\n\nMy mum apologised to me for a lot that happened in my childhood and that felt good but I'd realised long before that she was human, she'd had a shitty childhood herself and she was doing her best with the tools she had. She's now a fantastic grandmother but it didn't happen overnight to be who she is today, and honestly even tho she wasn't a great mum, she's always been a person I admire and who I got a lot of who I am today from.\n\nSounds like your mum is getting older, doing some personal work and trying to be a better person now. She loves you in the best way you can. Set boundaries so that this relationship doesn't hurt you, but maybe rejecting her is too much. Don't hold out too much hope that it's going to be sunshine and lollipops, but try letting it be a bit more than it is now.",
            "There’s a 12 step program called Adult Children of Alcoholics. It’s for those with a parent who was/is an alcoholic. The meetings are free and they might help you find peace in all this.",
            "Oh my gosh you did brilliantly! \n\nNo, seriously. The way to handled that was inspiring.\n\nHow I wished I would of had used those words with my own mother years ago.\n\nThere is only upwards from here, and probably some stuff to unpack but now you only have the emotional work to do for yourself and not others, right?\n\nI hope that you are able to heal yourself and move on with your life ❤️❤️❤️",
            "This update is so satisfying to read! Your entire process start to finish sounds really healthy.",
            "My relationship with my mother wasn’t nearly as hard as yours but I had to set boundaries with my mom and we had some tough conversations and the deflection and refusal to accept responsibility and lack of acknowledgement of the hurt you feel? YES. I’m glad to hear you stick to your guns and held those boundaries. It can be so hard.",
            "Your mom sounds a lot like mine. I had to set boundaries a few months ago and it was the hardest thing ever. I have been in therapy for almost two years now due to the impact my mom’s behaviour. I was diagnosed with CPTSD and an anxiety disorder thanks in part to her shit parenting, histrionics and (clinically diagnosed) bipolar disorder. \n\nYou’re doing the work to keep yourself safe and to heal yourself. It is hard but it is so essential for happiness in your own life. I liken reckoning with your abusive parent to taking on the big boss at the end of the video game: you can work on yourself only so far before you have to face the big boss and level up. Establishing boundaries with my mom was a huge breakthrough in healing my anxiety and being happy and functional in my other close relationships, even my marriage. \n\nI hope you soon begin to experience the benefits as well. I truly believe that when you grow up with no boundaries it becomes delightful to assert yourself and you can just keep going because it feels so good. Blowback is inevitable with these types of people, especially if she’s just waiting you out as others pointed out. Prepare yourself for it, and stand your ground. From reading both your posts, I don’t think your mom *can* actually understand how she hurt you, and she could never make amends with you in a way that could heal you. It sounds like you accept that, and the next step is giving yourself permission to grieve that relationship you deserved as a child and never received. Be kind to yourself, and know that everyone is worthy of love and respect just as they are.",
            "[deleted]",
            "Just wanted to say that you’re amazing and strong and as an internet stranger, I’m so happy and proud of you for realizing what a healthy relationship looks like and demanding it for yourself. You’re kicking ass.",
            "This was beautiful to read. Thank you for updating.",
            "You handled this very well. Was compassionate to your mother's situation, held true to what you were comfortable with and valued your feelings and politely, logically and fairly expressed yourself, your needs for a change in the relationship without shitting on her and getting caught up in emotions and the past.\nSo awesome. You did your research, thought carefully about everything and did what you thought was right. Really awesome. Hope things keep going well!",
            "First of all, mad props to you for standing up to your mother and sticking to your guns.  I (50M) have had numerous such calls with my father (75M), and they are excruciating.\n\nThe biggest problem I have with your mother's behavior in trying to push her agenda on you is her complete and utter lack of understanding of the 9th step.  Making amends is not a \"blanket\" apology, as you so eloquently put it.  An apology, several apologies, many apologies, these are just the beginning of the amend.  The purpose is to acknowledge specific incidents and freely admit responsibility with in intention of changing one's behavior.  It is, above all, an act of *humility*. \n\nIt doesn't sound like your mother does humility any better than my dad does.  Many times I have had to tell him to go back and do the 9th step, because completing this step once does not absolve the alcoholic from future transgressions either.  It's not a \"Get Out of Jail Free\" card forever, even if it is done right the first time.\n\nIt occurs to me that maybe your mother is not in a 12-step program.  If that is the case, then the chances that your mother will be able to rebuild her relationship with are nil.  If she is in a program, she needs to complete the 9th step.  I'd tell my dad to read it to me, which pissed him off, but it prevents him from weaseling out of his responsibility.  Making an amend I'd not simply an apology, and certainly not a vague, all-encompassing blanket apology.  Until your mother can make amends, she cannot complete the 9th step, to say nothing of the remaining three.  If she cannot complete the program, she will be incapable of having the type of relationship she wants with you, and you seem rightly unwilling to move forward without her accepting her responsibility.\n\nArmed with this information, you can now state you case with crystalline clarity.  She completes the 9th step, and then the rest of the program, or she is done.  If she does it correctly, those acknowledgements of her behavior must be accompanied by *her* making statements of how *she* will behave differently, *her* asking what *she* can do differently.\n\nA quick example: \"I apologize for not respecting your boundaries with regard to calling at 6:00 am. I would like to amend. What is the earliest time I am allowed to call, and under what circumstances may I call earlier?\". This kind of language is really gonna stick in her craw, language like, \"what am I allowed\" and \"may I\".  It means giving up control and becoming vulnerable.  It's terrifying, and on some level I sympathize with your mother, as I do with my father, but I don't tolerate his bullshit.\n\nThe kicker is that I am a clinical social worker, and I've worked with hundreds of substance abusers.   It is much more difficult when it is someone you love, and that person has hurt you so deeply.  I would be remiss if I did not make that suggestion that you talk to a professional about your feelings so that you are not facing this on your own.\n\nI apologize for this being so long, and I truly hope that you are able to gain some reinforcement and insight from my past experiences.  If there is anything I can do to help, please do not hesitate to contact me.\n\nGood luck and take care.",
            "This is a perfect example of lack of emotional maturity (your mom). She is making this entirely about her and unfortunately is probably not even aware of it, as most aren't. You did really well! I hope for her own sake she will reflect and become more self aware.",
            "Holy shit you and I might have the same mother.",
            "Hey /u/ElFriday, I only just read your first post and after reading the first paragraph or so, and I thought you were me. \n\nMy mother is an alcoholic, she's narcissistic, she's rude and abusive. She has the worst taste in men, and also Golden Child'ed my half-brother. She made next to no effort with me, unless it somehow benefitted her, and for the most part I had to learn to completely cut her off from me emotionally. \n\nHowever, it wasn't until last year I actually went fully no-contact. I'd tried boundaries, I'd tried calling her out on her bullshit, but ultimately she decided that making me her scapegoat for her poor and frankly shitty life choices was more important than trying to maintain the low-level relationship we had. \n\nIt's hard, and especially when you're brought up to be told how terrible of a daughter you are, how selfish and uncaring you are. How rude and disrespectful you are for asking for the basics. It's really fucking hard, the guilt initially made me feel the worst. But I can honestly say that one year on of no contact I am much happier. I still sometimes get those pangs of guilt when she tries to text me, or when she tries to use the rest of the family against me, but honestly, finally giving myself the power to shut her down and take her out of the life has allowed me to give me the power to reflect and understand how much she has hurt me. With recognising the hurt comes the process of healing. \n\nI really hope you're able to achieve what you want with your relationship with her. All I wanted to say though that despite what she and others will say, you're not horrible, awful, or selfish. You, we, well we deserve better, and sometimes that is the form of absolute silence from the mother's who have hurt us.\n\nFeel free to message if you ever want to chat, and good luck. ♥️",
            "You did amazing OP. *Hugs* and well done",
            "You handled that call very well!",
            "This sounds like a fantastic result, OP. \n\nI'm proud of you for sticking to your boundaries. Even though your mom kind of pushed back, I'm happy that she ended the call relatively calmly, in a mood to reflect on the past, and with a thank you, at that. \n\nI'm glad you were able to do this.",
            "\n\n>Next was asking for examples when she didn't support me. I told her she'd have to do some reflecting because she was there for the same events I was, and it's not fair to me to ask for that emotional labor.\n\nIf you don't mind, I'm stealing this for my conversation with my mother! This is amazing.",
            "[deleted]",
            "Why the flip do you care what your mom thinks???",
            "What do you call a nearsighted dinosaur?",
            "Do-you-think-he-saurus",
            "I think you handled the situation as well as it could go. But I also think that sometimes, if the person actually has the ability to learn from examples, they are needed. Memory is a very easily manipulated Fang, and a lot of people don't see the vents the same way.",
            "If u and ur believe it then more power to u ..now do he think that or is that what you and your mom think?? The problem is between u to not u and your mom.\nA non supportive person is a serious issue in a relationship and no one needs to be there if they don't want to..after 20+years of being in a relationship with my wife she felt like it was time for a change..I did 90% of the everything compared to her 10..so she left me went with him now she's alone and she's never going to blame her self for this mess i thought I could make it better but i had a change of mind and heart..move on with a supportive partner gain ed my respect back for myself and her on the other hand is searching for for supportive person to be in her life...so support that person before someone else does..",
            "Good work OP. Keep the boundaries firm. I hope you can both find peace.",
            "You seem a bit harsh. Its one thing to give her punishment for something she did, it’s another to refuse to say what it was. People don’t learn from mistakes if you refuse to tell them what the problem is. Everyone remembers different things.",
            "[removed]"
        ]
    },
    {
        "post_id": "50wyhc",
        "author": "Mummicans",
        "title": "My [20F] family is calling my niece [13F] a traitor because she went to the police and told them what her dad were doing to her brother [14M]",
        "url": "https://www.reddit.com/r/relationships/comments/50wyhc/my_20f_family_is_calling_my_niece_13f_a_traitor/",
        "score": 3582,
        "num_comments": 144,
        "created_utc": 1472870967.0,
        "selftext": "**Was doing, sorry for typo**\n\nLong story short my nephew is an extremely gifted athlete. What I did not know is my brother would push his son to the point he was dehydrated. As the story goes one day after school his sister walked into a police station and told them what was happening. The police went to her house and they found my nephew dehydrated and dry heaving into a toilet.\n\nFast forward my niece and nephew moved from California to Ohio to live with our cousin [26F]. My family is calling my niece a traitor because my brother is now depressed he can't see his kids again\n\nMy Nephew even told me he could not thank his sister enough\n\nDo you have any advice on what to do, because I don't know anymore.\n\ntl;dr: Family is calling niece a traitor ",
        "permalink": "/r/relationships/comments/50wyhc/my_20f_family_is_calling_my_niece_13f_a_traitor/",
        "comments": [
            "Your family is putting their support behind an abuser. This is usually because they are all very invested in whatever dysfunctional relationships they've maintained to remain unchanged - including being abusive themselves.\n\nPut your support behind your niece, and think long and hard about people who would disparage a teenage girl for protecting her brother and whether you want them in your life.",
            "Your niece is great. Remind her of that when your family is being jerks. It takes a lot of strength to stand up like that to an authority figure who is abusing someone, especially when it's a parent.",
            "Wow, that's really messed up that your family would support child abuse. Because depriving a child of water to the point of dehydrate is deadly and child abuse. I would ignore your family and let your niece know she did the right thing, if you had known you would have helped sooner, and you're there for the both of them if they did anything. \n\nSeriously though, I would rethink my relationship with my family. I don't think I could ever associate with a person that would support the child abuser over the child.",
            "This is a form of denial. It's easier to believe it wasn't that bad and niece is just a tattle-tale. \n\nWho do you want a relationship with: your niece, or the family members excusing child abuse? You're not going to be able to have both. ",
            "For god's sake, do your best to emotionally support your niece.  Make sure she hears from you and others that she was NOT wrong.  \n\nShow her this thread if you want, with posts from complete strangers supporting her decision to look out for her brother, knowing it was right but knowing it would cause an uproar.  She's brave, very brave.  Literally, she's a hero to do the right thing and face the unwarranted backlash.",
            "Honestly?  You should tell anyone that dares defend your abusive brother that you're disgusted with them, and that they're welcome to talk to you again once they come to their senses, but not before.  Show those kids that they have a safe and trustworthy family lifeline in you.",
            "Wow, that was an incredibly brave step that your niece took. Your nephew could have died from that abuse. \n\nI don't know what you can do about your family. Whenever they call your niece a traitor, laugh and say 'that's a good one, it's not like people die from dehydration!'. Let them know just how ridiculous they are being. It's absurd.",
            "So your brother wants to see his kids again? He'd better start by accepting that he was abusing them.  Not all abuse is sexual abuse or complete neglect. He might try genuinely apologising and asking *permission* to see them again. Then hoping they and their new carers agree. He's lost the right to see his kids, it's now a privilege he must request and hope for.\n\nGood on your niece. I hope you can help her out, it's going to be hard for her too.",
            "> My family is calling my niece a traitor because my brother is now depressed he can't see his kids again\n\nWell, maybe he should've thought of that before doing stuff that made it unsafe for the kids to be around him.  At least this way, his son's still around to miss.\n\nYour niece done good, and you're a good aunt to stand by her.  If the rest of the family can't see that, you don't need them.",
            "**WHAT THE FUCK**\n\nDo you know what happens when an athlete gets pushed to train when that dehydrated? They have a fucking heart attack, that's what. It sounds like your brother was close to killing him to make him hit whatever his sports ideal weight was. God forbid it was a punishment because that level of evil demands your brother be blinded. Do you know how fucked up things have to be to give a teenager a heart attack?!\n\nThis is as bad as if he was slapping him around or fucking him. Would you want anything to do some one who abused a kid like that? Or anyone who defended such an abuser?\n\nAs for your niece she is a damn little hero. I hope someone gives her a scholarship.\n\nThink about that next time someone calls her a traitor or defend your ex-brother.",
            "Your niece is a smart cookie. Props to her for getting her brother the help he needed, and props to your cousin for taking them in :) start blocking those harassing family members.",
            "Play the documentary Trophy Kids for your family.  It's on Netflix.  If that doesn't bring them around nothing will. ",
            "Wow your brothers poor kids. I'm glad they don't have to be subjected to that torture anymore . Sometimes parents just don't care about their kids they care about how their kids make them look, how their kids make them feel Etc. So unhealthy. Hope he learned his lesson your brother but I doubt it",
            "\"Hey family, maybe if Brother wasn't an abusive asshole who was literally in the process of murdering his son, Niece wouldn't have had to report him. You reap what you sow, eh? It's not Niece's fault Brother is a piece of shit miserable excuse for a human being. It's his.\"",
            "Tell everyone who calls your niece a traitor that in fact your brother ought to be on his knees thanking her.  She saved him from going too far one day and accidentally killing his son.  She saved her brother's life.   Tell them that at least your brother still has a chance to make up with his son one day in the future; it's difficult to do that if the kid is buried six feet under.\n\n For proof you can google some cases of kids who died from dehydration while practicing sports, there are several but this sub won't let me link them.",
            "Your niece is very brave. You can't change what your family think, no matter how wrong it is. Just make sure you let your niece and nephew know that you are proud of them and on their side. It sucks having the whole family against you but even just the support from one person can make a whole world of difference.",
            "Well, it must be depressing to have the mouse you're torturing taken away from you, but really, he has nobody to blame but himself.  This whole idea that the person who tells is somehow responsible is ridiculous.  If brother had been a good parent, it wouldn't have mattered what niece said.\n\nPersonally, I have cut family members who acted like that out of my life, and it was the best thing I could have done.  I would recommend to you, and your niece and nephew, that anyone who is standing up for his abusive dad is someone that they shouldn't spend time with.  It says a lot about them that they are more concerned about the abuser than the victim.",
            "A \"traitor\"? Your family is talking like their 10 year olds. She did the right thing. Unfortunately sometimes you can't change the minds of unreasonable people. \n\nTake comfort in knowing who in your family you can rely in in the future.",
            "It looks like your nephew and niece now have a much smaller family of origin now. \n\nKeep in constant touch with them. Remind them both that your niece probably saved her brother's life and that they're both great kids. Tell them that anybody, no matter who, needs to be strong enough to face the truth about themselves. Tell them that people who cannot face the wrong that they do are weak. \n\nJust stay in touch, because those kids will need all the love, support, and validation that they're not getting from their family. ",
            "Your nephew could have died.  Your nephew could have suffered serious, long-term, or permanent complications.  Your nephew was being physically endangered by the situation he was living in.  There is no gray area here.  Your niece is amazing.",
            "Firstly, your brother should be able, through therapy and work, get a chance to see his kids again. He needs to do both. I've seen a lot of stupidity in he name of \"pushing\" gifted athletes. It's done out of ignorance, not evil. You need to talk to your brother and he needs to be the one to end this \"traitor\" nonsense. Next, he needs to take responsibility for his actions and start to fix himself. \n\nI would suggest he gets therapy, and start meeting with some real athletes in FCA or a coaching organization, so he can understand how real athletes are made. Once he's made the effort, he will be able to approach his kids and the police. \n\nHe has to be the one.",
            "All you can do really is support your niece and nephew. She did right, and as well as you know your brother is a scumbag and he shouldn't be anywhere near children. \n\nIt sucks having a family who will stick up for an abuser, but that's not on you. You've said what you had to, ignore them from this point forward. If they try to bring it up, shut it down, you don't need to deal with their bullshit, or your brothers bullshit. \n\n",
            "Go and do something nice for her (and maybe also for her brother.) To let them know that you stand behind them and don't consider them traitors.",
            "I'd tear them all a new asshole for their behavior. Is he depressed his dangerous and abusive actions have caused him to lose his child? Tough. Maybe he ought to enter a program or see a psychiatrist who can awaken within him a sense of responsibility and remorse. Are your family members unhappy the two were brought somewhere where they can be raised safely? Maybe they need therapy as well. I'd suggest all of those things, just that way, and if they don't like it -that's just too bad. ",
            "Tell them they're the traitors for forcing a 13-year-old to do what they should have done to protect her in the first place. Insist that they not project the blame they should be feeling themselves onto a CHILD in order to scapegoat her. Make sure to press upon them how pathetic all that is.",
            "Your niece is very brave. It's very easy to ignore abuse. Either because you don't know any better at the time, or your scared of the consequences. Or you simply don't care.\n\nStick with your niece and nephew. They need you more then the rest of your family does. If your family decide your a traitor too so be it. It'll probably make your life easier not having to put up with them.",
            "I would call them child abusers when they call her a traitor and hang up on them.   Why would you even want to argue with these monsters?  They are defending the indefensible and blaming a child for putting an end to her brother being abused. \n\nWhy are you even bothering to try to reason with these people?  Your nephew could have died.  There are dozens of cases where kids have died from this exact same thing.   ",
            "Who gets mad at a 13 year old girl for reporting child abuse? ",
            "Only thing I can think is tell them you actually approve of what your niece did. I know you're already doing that lol. Just keep on.",
            "Support your niece, even if it's against your brother. \"What he was doing was wrong and (Niece) did the right thing to report it. If it wasn't serious, they wouldn't have been removed from the home. But it was and (niece) saved her brother from their father. She's not a traitor, she's a hero.\"",
            "Hearing how the family is sympathizing with the abusive father reminds me of how people sympathized with that woman who murdered like 11 of her children to collect on their insurance. Mary Ann Cotton, I think. Her trial was delayed due to her being once again pregnant, and she put on a great show of nursing the baby and crying when the child was taken from her that some people began to say how cruel it was to remove a baby from its mother. They seemed to have completely forgotten that this is the same woman who literally murdered every one of her own kids, and nearly every child under her care. People are so easily swayed when they don't really care. These people are feeling sorry for the father because they're easily swayed.",
            "Your niece was really brave and she deserves all the support she can get. Don't doubt calling out the asshole relatives.",
            "Cut the water supply to their homes. It's not important after all",
            "If your brother wanted to see his kids he should have taken care of their health better. You don't try to kill the people you supposedly love. I hope your brother gets therapy to figure out why he felt the need to do that to his son. ",
            "Your niece is brave and compassionate and deserves every ounce of your support.",
            "Don't bother arguing with your family. They're too invested in maintaining the status quo--star athlete, sacrificing father, everyone's dreams coming true. Walk out of the room if you have to.\n\nInstead, throw your support behind your niece. Send her nice messages, be interested in what and how she's doing, take her and your nephew to lunch if you're in the area. Make it very clear that you're proud of her and she's an incredible young lady that you're happy to be a Cool Aunt to.",
            "That's just stupid and makes no sense. Why push someone to excel only to deprive them of water they need to be at their best? Makes no sense. He could just be using the sports as a cover for malicious abuse and control over his son's water intake. Serious abuse and freaking scary! Good for your niece. ",
            "Yeah no your whole family is toxic, if you want you are so justified to go no contact. Also I hope they are doing good where ever they moved to 😁",
            "Your niece is a hero. Support her and don't bother with the people in your family defending the child abuser.",
            "It is because they know it was supposed to be them who helped your nephew and they did not have the guts to do so. A little girl showed them what  it means to love someone and they cannot digest that. ",
            "Your niece and nephew are the ones that need support here. Your family either will realize they're being dumb asses and come around, or they wont.\n\nYour niece and nephew might be being told what his father was doing wasn't that bad. Make sure to tell him it was and he shouldn't have been put through that. Emphasize that thier feelings are the valid ones here.\n\nAnd make sure your niece knows she's a good sister for what she did.",
            "> My Nephew even told me he could not thank his sister enough\n\nThat's how you know you did the right thing.",
            "your niece is a HERO of the highest category",
            "tell your family that you don't condone child abuse and back your niece up.  if what your brother was doing was ok, the kids would not have been removed from his care.",
            "support your niece and nephew as much as you can. the real traitor is your family, your brother ... that's no way to treat children",
            "You should have nothing to do with those evil enablers. Can you imagine them around your kids? Shudder",
            "Give your niece and nephew as much love that you have to give and let them know your on their side. The rest of your family can go jump. ",
            "Do what you can to be supportive of your niece and nephew. So many people turn a blind eye and ignore child abuse like this. You are a strong, brave person to stand up for these kids.\n\n\nIf you want to maintain a relationship with the rest of your family, I'd shut down all discussions of the topic hard until they learn to not talk to you about it.",
            "The Father is the traitor. He abandoned love and reason in raising of a child.",
            "So your family thinks, your niece is at fault that the police found out, not your brother who abused his child in the first place? What kind of thinking is this? ",
            "Tell your niece that she did the right thing.  Anyone that tells her otherwise doesn't deserve to be a part of her life.  Your nephew could've died, or ended up with serious health complications.\n\nYour brother's a child-abusing shitbag.  Your family is a bunch of abuse-supporting and child-demonizing assholes.  ",
            "Rally around the kids, show them as much love and support as you can.  Your niece did a brave thing.  She spoke up and stopped a cycle of abuse.  Tell the rest of your family they are enabling an abuser and should be ashamed.  That child did nothing wrong.",
            "Support your niece and try and make your family see the err of their ways.",
            "Your niece is a badass. There are plenty of adults who wouldn't have the guts she demonstrated. Keep an eye on her. I suspect she is going to some amazing things in her life.",
            "Actions have consequences; he shouldn't have abused his son. *Stay out of this*.",
            "My advice? Cut off the family who supports the abusers and support the girl. Ghost anyone else. ",
            "it's probably not that the rest of the family agree with the abuse; at least not all of them. they likely don't know how bad it was. try to explain the situation however you need to so that after the talk they understand what really happened. if they still take his side, *then* they can fuck off. don't let people suffer for ignorance. maybe some of the kids family can be salvaged, because they must be feeling very alone and confused right now",
            "A bunch of adults are shaming a young girl for reporting abuse? And you haven't called them out on it yet?",
            "Nope not at all, very serious and willing to defend my view absolutely even if offensive to others unfortunately. Big into family and loyalty and often extremism on certain things. Bet your a real spineless wonder in life though, aren't ya?!? ",
            "I recommend a more subtle approach until you're completely independent. If they're the kind to support abusers especially after seeing thing from the victim's perspective, who knows what they'll do to you if they find out you think differently.",
            "There's really not much you can do, everyone makes a choice to be an asshole. What I would suggest is simply ignoring and not participating in any conversation that concerns that subject. Simply, punish such opinion by not discussing it and giving it attention. Take the ball away, refuse to play the game. This might not help them change their minds, but will help you to keep yours.",
            "anyone allying with the abuser and bot supporting the two kids is a piece of shit.  cut them out of your life",
            "cut that part of your family out as much as possible they are horrible human beings",
            "Your niece was brave, and did the right thing. Those who support her dad are supporting an abuser. Keep defending and supporting neice (and nephew of course)",
            "Tell your family to fuck off. Your sister saved her brothers life. The father shouldn't have been pushing him to the point of dehydration. Wtf.",
            "Some epic level denial",
            "Traitor to whom? Your niece is a brilliant child.",
            "What your family is doing is awful. The niece was right to do what she did, and major kudos to her. ",
            "What your niece did was so brave; at her age, going behind the backs of adults to report something to the police that was dangerous and abusive is so laudable. Support her, be there for her, and make sure she knows she did the right thing, and that nobody has any right to make her feel bad about it. Your brother has brought this situation on himself, and it sounds like both your nephew and niece are happier away from him.",
            "Please tell your niece from this internet stranger that she was extremely brave and did the right thing, regardless of any pushback she might be getting now.  I'm proud of her!",
            "Reassure your niece she did the right thing, and let her know you are proud of her.\n\nTell your immediate family to get some therapy and reexamine their priorities.",
            "Your niece saved her brother. I have two older cousins who had a father similar to what you described, and they're kinda messed up in part because of how he treated them. She's  very brave.",
            ">My family is calling my niece a traitor because my brother is now depressed he can't see his kids again.\n\nYour poor brother is depressed he can't continue to endanger his son's life anymore :(\n\nSeriously, next time your family brings up stuff like this ask them if they think your nephew's life is less important than your brother's *feelings*.",
            "If you were to ask them \"Is 'brother and 'nephew' being together more important than 'nephew's' well being?\", what would they answer? - since I can't comprehend their logic behind supporting your brother in this.",
            "No.\n\nAgain, stop, \n\nHe is no longer be father of that young nephew of yours.\n\nNot at all. And you know it and he BETTER know it",
            "The suffering got relief from something that can in fact kill you. \n\nI'm shocked y'all not beating your brother's ass to this second...  \n\nNobody but her noticed that the boys thirsty, no one at school sat him down and said \"Son you looking funny, go see the nurse. Riley! Go with him, make sure he doesn't die on the way\"",
            "Get her alone to talk to. A councillor. Good luck to them.",
            "shitty people will always be shitty. Doesnt matter if they are family. He knows he was in the wrong. ",
            "How has your brother reacted to this, outside depression?  Does he recognize his errors? Has he apologized? ",
            "I agree with everyone here and there is nothing I could add to be more useful.\n\nBut... how? Why? He is kept chronically dehydrated, or was it a one time thing? Is that on purpose to make him work harder or something? Wouldn't he do better if he were allowed to drink water? How do you even stop someone from drinking water, wasn't he in a bathroom presumably with a sink he could get some water out of?",
            "teenagers don't get removed from their homes because they are dry heaving over the toilet... what's the real story?",
            "The obvious answer is to get a divorce.\n\n\nJokes aside, your niece is a hero. Reassure him every day and make sure he knows that what he did was right.",
            "[removed]",
            "[deleted]"
        ]
    }
]