[
    {
        "post_id": "4sms3v",
        "author": "ConfusedWriterGirl",
        "title": "UPDATE: I [31F] realised I recently have feelings for a friend [34M]. We've arranged to go out for dinner next week, but I'm not sure if it's a date. Help!",
        "url": "https://www.reddit.com/r/relationships/comments/4sms3v/update_i_31f_realised_i_recently_have_feelings/",
        "score": 3569,
        "num_comments": 168,
        "created_utc": 1468411222.0,
        "selftext": "My first post didn't get that much attention, but I thought I'd update in case it helps anyone else in the same situation.\n\nOriginal post: https://www.reddit.com/r/relationships/comments/4r1j71/i_31f_realised_i_recently_have_feelings_for_a/\n\nSo Last Thursday Jim took me out for dinner. He came to pick me up and I was still super nervous, even though by that time I was pretty sure it was a date. He opened the door of the taxi for me, but I went to go around the other side, thinking he was just getting in the car! He looked really confused until I figured out that he was being a gentleman and we both ended up laughing about it. It kind of broke the ice as he seemed a little nervous too.\n\nWe went for cocktails, then for dinner. Despite my insistence, he paid for everything and it was just perfect. We were chatting for hours and before we knew it, they were closing up around us.\n\nJim walked me to my taxi and kissed me goodbye. My stomach flipped over and I felt like a teenager - I couldn't stop grinning on the way home and fell asleep with a stupid smile on my face.\n\nThe next morning, I woke to find a text from him telling me how much he'd enjoyed our date and that he'd like to see me again soon. I couldn't wait either, so invited him over for dinner that Friday evening. He didn't leave until Sunday lunchtime. :-)\n\n**tl;dr**: It was a date. We are now dating and I feel like I've won the lottery. :-)",
        "permalink": "/r/relationships/comments/4sms3v/update_i_31f_realised_i_recently_have_feelings/",
        "comments": [
            ">I couldn't wait either, so invited him over for dinner that Friday evening. He didn't leave until Sunday lunchtime. :-)\n\nHoly shit, girl. Way to go!",
            ">I couldn't wait either, so invited him over for dinner that Friday evening. He didn't leave until Sunday lunchtime. :-)\n\nATTAGIRL\n\n",
            "[deleted]",
            "I love this story! Such a rare \"feel good\" moment on this sub.",
            "Always nice to hear a good update. All the best!",
            ">so invited him over for dinner that Friday evening. He didn't leave until Sunday lunchtime. :-)\n\nHow did he change clothes/brush his teeth/bathe? This is what I am most curious about now",
            "aww this is awesome! Can't stop smiling for you! Love a happy update.  Can't wait to see all the updates to come. You're well on you way to making a post where Reddit starts commenting \"Why are you with him? Just leave him.\", then you know you've made it and your relationship will have come full Reddit circle ;-)\n\nJokes. In all seriousness, routing for you! Thanks for the update, need more like this. ",
            "Congrats!! My life's pretty  shit atm and reading your post actually put a smile on my face. Hope it all works out for you two :)",
            "He sounds horrible. Break up with hi...\n\nWait a minute, I'm confused. Everything is happy and good. But it's still /r/relationships so I feel like I should tell you to break up.",
            "This sounds almost identical to when my SO and I got together. Seriously. The confusion, nervousness, him insisting on paying even though I protested, not hiding that we wanted to see each other again immediately, all of it except the activities. Been nearly 3 years now, and the wedding is in October :)\n\nSo, go you! What an adorable update!",
            ">...he didn't leave till Saturday afternoon...\n\n#getsomegirl!!!",
            ">**tl;dr**: It was a date. We are now dating and I feel like I've won the lottery. :-)\n\nYay! Best wishes to you both. :v)",
            "This made me all warm and fuzzy. LOVE me a happy /r/relationships update.",
            "Love... it could destroy you... or solve every problem in the world :)\n\nCongrats!",
            "Yay!! This makes me so happy! :) Congrats!",
            "ahh such a good ending to the story!! Hope it works out OP",
            "This is insanely cute. I just read your original post. I'm glad you updated.",
            "You get it girl! Woo! Happy for you!",
            "Awwwww!!!! Thanks for the smile this morning!",
            "Love this, it brought a tear to my eye!! I wish you a world of happiness! ",
            "I love this update. You guys are too cute. Best of luck!",
            "If your user name was confusedartistgirl instead, I'd ask if your name was Pam. \n\nAnyway, congratulations! ",
            "Amazing ! So happy for you !",
            "Ooh la-la ;) may you have many more weekends similar!",
            "So great to hear!  You go!",
            "I hope it works out. I also hope he's a good guy to you.",
            "This is the cutest thing ever! Congrats OP :)",
            "Awesome, this made me smile.\n\nNICE WORK!",
            "This is so adorable. I love it.",
            "> tl;dr: It was a date. We are now dating and I feel like I've won the lottery. :-)\n\nWoohoo!!!\n\nI wish you all the best in your new relationship.",
            "Send us pics when you have kids. \n\nAll the best. \n\nDont forget about us.",
            "congrats!! also, aren't multi-day dates the best?!",
            "Just went back to read the OP. This whole thing is so cute and so precious! Best of luck to the both of you! ",
            "Wow! Bravo! I guess he came to have a dinner with breakfast also.  :)",
            "with all the depressing posts today this was a breath of fresh air. thank you for the happy update!",
            "This made me smile so much! Thanks for the update and good luck to you two. :)",
            "Awwwwwwwwwwwwwwwwwwww congratulations OP :) All the best!",
            "D'awwwww awesome! Sounds like you two are having a great time. Best of luck! \n",
            "This is utterly adorable. I'm happy for you :)",
            "This is kind of how Gone Girl starts. Hot!",
            "Good luck to you, this sounds exciting for you! My now wife and I were friends for about four years before I asked her out. It was wonderful that we knew each other pretty well and didn't have to take the time to go through the awkward get to know each other phase. ",
            "I like stories that end in sexy times. Congrats! ",
            "Fantastic! . I so happy for you ",
            "Wow! You're story made me smile! Thank you!",
            "YAY!!!!  So awesome for you :)  I am glad to see it went well",
            "This whole story and update brought tears of joy to my eyes. I'm a sap for a sentimental love story. ",
            "This is such a nice change from what you usually see on this sub. Congratulations!",
            "This post made me smile big.",
            "So...now plan a date and ask HIM out.",
            "Yay!! I'm super happy for you. I hope everything continues to go well.",
            "I'm so happy for you! Last month I married the friend I developed feelings for. This is going to be awesome for you!",
            "Happy for you. That just sounds like the perfect romantic comedy ! Hope u two are happily ever after ;) ",
            "This sounds like a book I would like to read. Hey OP, make it happen!",
            "Awww you guys are so cute! Gluck!!!",
            "Fuck yeah! So good to read something **not** depressing on here for once!\n\nCONGRATS!",
            "This is one of the most awesome and adorable updates I've ever read in this sub!\n\nCongrats! ",
            "Aww this made me smile :) congrats",
            ">so invited him over for dinner that Friday evening. He didn't leave until Sunday lunchtime. :-)\n\nDid you have an orgasm? ",
            "Dawww! Oh the feels! Brings back so many memories of how my SO and I started :) I'm glad things worked out so well :)",
            "Bleh, I don't pay for everything anymore, haven't in a long time. I felt it was better to stop infantilizing the women I dated.\n\nDespite that pessimism in my post, glad you had a good date.",
            "Just a side piece of advice from a guy for anyone in the same position. If you are a girl and want something serious wait to have sex. The older you see this isn't an issue but if you are early 20's the more you make the guy wait the better your chances of making it last. Guys like a challenge and need a challenge. "
        ]
    },
    {
        "post_id": "co8b4l",
        "author": "Throwingawayaway2",
        "title": "An update on a post from 7months ago about my partner's (f27) depression and its impact on my (M27) life.",
        "url": "https://www.reddit.com/r/relationships/comments/co8b4l/an_update_on_a_post_from_7months_ago_about_my/",
        "score": 3572,
        "num_comments": 275,
        "created_utc": 1565383727.0,
        "selftext": "7 months ago I posted about my girlfriend, her struggles with depression and how it was impacting my life and my personal needs. I got some really helpful and empathetic replies which I was really thankful for. Post can be found here:\n\nhttps://www.reddit.com/r/relationships/comments/aajrls/my_depressed_partner_27f_and_the_effect_it_has\n\nI wanted to write abit of an update, partly for those who helped but also to show that it can sometimes get better. \n\nA couple of months back my partner was due to get her contraceptive coil removed. She struggled with irregular periods whilst on the coil so she decided that she didn't want a replacement and wanted to get back to a normal cycle. \n\nHonestly, her mood changed almost immediately. It was so quick. As soon as it was out, she started feeling better. Her want to do fun stuff has returned, and the sex drive is slowly increasing. We have already had wayyyy more sex in 2019 than we did in the whole of last year. \n\nShe is now off meds, and even though we are going through stressful times (moving house man... NEVER AGAIN!!!!), Her moods recover to a norm far quicker.\n\nWe do more family stuff now. I'm typing this from a camping holiday together, and my stepdaughter is doing well at home and at school, bringing home a brilliant report for the end of the school year.\n\nI don't want this post to come across as bragging. I just wanted to point out that it seemed that the cause of my partner's illness was a hormonal imbalance that was exacerbated by her contraceptive coil? I'm unsure of the science behind that but we are certainly doing better. \n\nThank you to all those who helped our situation before. \n\nTL;DR My partner struggled with depression until her contraceptive coil was removed. Our lives have improved alot since. Thank you to all those who helped and commented!",
        "permalink": "/r/relationships/comments/co8b4l/an_update_on_a_post_from_7months_ago_about_my/",
        "comments": [
            "This is amazing! I think it’s shocking the effect birth control can have on women’s bodies. So happy she is doing much better now",
            "[deleted]",
            "This should always be considered when women change their reproductive system (or even as they enter into perimenopause). Thank you for posting this because a lot of people, women included, don't realize how serious this can be. \n\nIt was mind blowing for me to realize that after getting off the pill in my late 30s my PMS just went through the roof. I'm seeing a doctor about PMDD in a few weeks, and the knowledge that this is just my hormones fucking with me is so helpful. I'm not crazy. I don't suck. It's a medical condition that can be managed. I can get through this. \n\nI'm so happy that y'all are able to get through it as well.",
            "I'm not surprised that removing the coil had that effect. Contraception like that can have big effects on people, and it varies widely. When my wife went off the pill to something different, it had a very big effect on her. Glad to see things are going so well for your family. Wonderful news.",
            "I was so angry with doctors and people telling me the IUD had no side effects and was ‘fantastic.’ I had a horrible time on it, and glad I listened to myself and no one else and took the horrid thing out. Moods got better, infections disappeared and people said even my face got less puffy and back to normal. People don’t realize it can really f*ck you up.",
            "Interesting. My psych reackons that the Mirena IUD is one of the leading causes of increases in depression/anxiety in women atm but the research isn't there because they don't want it to be (I know it sounds a bit conspiricy like but as a med prof I actually agree with her - funding goes to those that can afford most of the time, but hopefully with increases in mental health stuff it'd be good if they actually did fund some research into it...anyway...). \n\nI currently have one (have for the last probs 6 years or so??). Unfortunately for me, the Mirena IUD has been a lifesaver for me, as I have AWFUL PMS and cramping pains etc (like throwing up when I get periods cos the pain is so bad...) so not having a period since it's been in has been amazing. However it has made me wonder how much of my moods (would get low/high swings) has been me and how much is due to the IUD. However I've also got a family history of depression etc and am now on meds for it, which I think seem to help lift me outta the fog a bit. Just really interesting to hear it from another too. It's just annoying that the IUD for me has been so good. Wish there was a way to fix it without having the impact on moods etc so much. Anyway that's my 2c.\n\nGlad to hear things are improving! Ps never discount other meds or talking to someone if needed too, sometimes it can actually supplement the improvement process and really help too! 😊 Best of luck!",
            "That’s great! I’m curious — when you say coil, do you mean she was on the non-Hormonal copper iud or the other hormonal options?",
            "Birth control pills killed my libido (literally), among other great effects on my body. Luckily I found out It could be risky for my safety so I stopped taking them",
            "So scary that birth control can do this but my body depends on the pill I’m on now. Hormones go mad as soon as I come off it. Depression, temper and crazy mood swings. But way higher sex drive. Honestly can’t win",
            "Can I ask how SHE feels about the changes? What I mean to say is, was she aware of the behavioral changes or was it something that only you noticed. Im so happy that things are better for the both of you, being depressed and in a rut is hard and hard on those we love!",
            "This exact same thing happened to me. I battled severe anxiety and depression along with crazy mood swings. I truly started to feel psychotic. I knew something was wrong but couldn't figure out what could be causing it. After EIGHT months of this, I go to my OB for a regular check up. He asks how I'm doing on the pill. I said it's fine but then mention the anxiety and such. And he's the one who made the connection for me. I changed to another method and it was night and day. I felt like a brand new person. It sucks women have to go through this to avoid making babies... I feel for your girlfriend and every other woman who's gone through hormonal hell.",
            "Wow this blew up abit overnight!\n\nFor those asking, it was Mirena. Mixed with some tough times in life and getting rid made alot of difference. \n\nMy partner does still attend 'person centred councelling' though the sessions are alot easier than they were. \n\nThanks everyone!",
            "I had the Skyla IUD for about 9 months. I was more depressed than I've ever been in my life and didn't feel at all like myself. It also reversed almost immediately when I had it removed. Your girl is not alone!",
            "God I'm glad you figured it out. I had both the arm implant and the IUD implant... Absolutely horrible. I have depression as it is but wow, it literally made me suicidal.\n\nNeedless to say I'm on a low dose pill and doing a lot better- I'm glad she is, too.",
            "I'm so happy for you and your partner dude! Depression is hard, it requires a lot of commitment.",
            "I just finally sought help for my depression 5 hours ago. I thought I had it under control and tbh barely admitted to myself that was what was happening. It made me short with people at work and the love of my life. I hadn’t realized it until a few days ago just how fucked up it all got.  I moved cities and haven’t had much of a social life. I would say shitty things and lash out to those I care for. At times I would have suicidal thoughts and just feel an insane amount of grief which I couldn’t understand because my life has been the best it has ever been these last few years. Even so I would still just cry and hide it from those I love. I didn’t think about the effect my birth control has had on me too. Thanks for sharing. I’m hoping to have the same result soon.",
            "My best friend went on the nuva ring after I told her how much I liked it. She basically went crazy. The hormones really fucked with her and the effects stayed there for a couple months. I had zero problems with it, except for it falling out. :)\n\nShe's got an IUD and I have a hormonal implant in my arm and it's still fine for me. Except acne. Boo. It's pretty crazy how that stuff can affect people differently.",
            "I’m so happy for you guys! I’m glad she’s heading in the right direction and that you (finally) may have determined the issue. \n\nBirth control can be some crazy stuff. What works perfect for some women can make others depressed and apathetic. I felt like trash on the pill but settled into the shot just fine, no issues.\n\nIt might also be prudent to have her have a hormone panel done to see that everything is in good order again, too. Women, much like men, can have low testosterone, which can lead to the same depression etc we’d see mentioned in those late night “low T” commercials aimed at men.",
            "Also, the biggest change we've experienced isn't necessarily the return of sex drive, but actually we've noticed we laugh together alot more. We have a goofy sense of humour so it's nice to be silly again.",
            " Birth control can do that. I was on the pill for a few months and realised that I had been WAY more depressed since starting that particular pill (I was on a different one before, but switched when I moved back to the UK after spending a year in the US). \n\nWhen I switched to the implant, my depression didn’t go away bc I’d always had it, but the improvement was amazingly noticeable. \n\nI’m glad that this update is positive!",
            "I struggle with depression as well, and when I was with my ex, I was on hormonal birth control. It wrecked absolute havoc on my mood and exacerbated an already fairly serious issue. I was in a dark place internally, I gained a fair amount of weight, struggled with an eating disorder (existing problem but I had been on my way to recovery prior). When I went off the pill after he and I broke up, i almost instantly felt better, in the same way your partner did. I ended up switching to a copper IUD and I recommend it to everyone that I talk to about birth control. It gave me my life back lol. Glad to see a good update!",
            "Some birth control absolutely devastates certain people. It's no joke and so unfortunate. I love hearing a happy ending! Congrats!",
            "The science is that birth control screws women up to no end. It’s sad and frustrating and difficult and it doesn’t seem like anyone cares enough to make more than a few non-hormonal contraceptive methods and whether or not everyone has access to them. Even the female condom is twice the cost of a mans. *sigh* I feel for your gf and I’m so so glad she’s doing better.",
            "Are you talking about an IUD here?  My wife had one years ago before we started trying for a kid, and I swear her mood was heavily affected as well.   Very interesting.",
            "Hormones in your body can screw up your mental chemistry. There’s an IUD called Paragard which is without hormones if she ever wanted to have that kind of protection again but without all the crazy hormones! It’s 99.9% effective and honestly doesn’t bother a lot of women one bit. I’m glad she’s doing better and that your relationship is getting stronger!!",
            "That's great news! The hormones in birth control can definitely mess with your head. I wanted to murder basically everyone all the time when I was on bc and I had no sex drive. That all changed when I stopped taking the pill.",
            "By coil do you mean IUD?",
            "I remember one year, my Dr changed my birth control and it really made a difference. I went from having a high sex drive, being cheerful and affectionate to not even wanting to be touched or held. I was irritable and snippy with my bf. Had 0 sex drive and tmi, couldn't even get wet (in my early 20's!) \n\nAfter a couple months I went back to the Dr and was told them it was affecting me in a way I've never experienced. They changed me to a different pill and within a week I felt better. I wanted to cuddle, have sex and spend time with my bf again. It's crazy what hormones can do.. I think I've been on 4 different types of the pill over the years and only that one specific one made me feel that way.\n\nI'm happy things are going well for you and her mood was able to turn around! Good for both of you!",
            "I often wonder if my iUD has impacted me negatively mentally and this is one of those posts that make me question it more and more. I'm so glad things have turned out better for you two.",
            "This happened to me with the mirena. I had it removed and my mood swings improved INSTANTLY. hormonal birth control can be good but for some it can really mess you up. Glad she is doing better!!!",
            "I seriously struggled with moods while on the pill. Doctors never took me seriously until I found a female doctor who believed me because she'd been through the same thing. This is going back 10 years now, it's a lot more recognized now than it was then. Looking back it scares me how different I felt all because of one stupid little pill",
            "If it was the Bayer company coil, then you just got saved. That coil has caused a lot of suffering to women. A documentary about the coil is an eye opener \" the bleeding edge\".",
            "I have been going through almost this exact same thing. I've been off my birth control for about a month now and it's amazing how level headed I feel now. Even when life sucks I feel like I'm able to get back to \"normal\" much quicker now. \n\nThe nurses kept telling me that this wasn't going to be a quick fix and that there were lots of factors contributing to my weight gain and mood swings. They are absolutely right, I won't deny that there could be a million other reasons why everything got better all of a sudden. I also can't deny however, how much pressure and how many side effects I've lived with just so I wouldn't get pregnant. I just want to find what normal is for me and thankfully I'm in a good position in life and in my relationship to do that :)",
            "Birth control is the mutherfucking devil. Have her look into the fertility awareness method!! You go off your base body temperature and cervical fluid to determine precisely what 4 days of the month you are fertile. Because amazingly women are only fertile 12 hours out of the month!! Fertile cervical fluid however can keep sperm alive for up to 2 days tho, so you block out 4 just to be safe and on those 4 days you use another method of contraception. The book Taking Charge of Your Fertility will have all the necessary information if anyone is interested in researching further. This is NOT the natural family planning method that says every woman has a 28 day cycle. This is based in biology and understanding the female body. It has truly and deeply changed my life!!!",
            "Thank you for being patient with her. I had a bad experience with mixing birth control and antidepressants, the chemicals I was feeding myself mixed with my shifted hormones resulted in me having a high sex drive to almost none at all. It’s been 4 years since that happened but my partner and I stayed together through all of the same things you seemed to have experienced and we have a beautiful life together now with a lot more going for us as individual people and as a couple. I’ve still got a lower sex drive than I’d like but at least I’m able to stabilise my moods without medication now, so, there’s that.",
            "I’m glad things worked out and that she’s feeling better!\n\nI also recently decided to see my doctor about depression related to my birth control. It took me a looooong time to figure out what was going on, and it was hard to admit I wasn’t feeling 100%. Unfortunately, I’m in a tough spot because my BC is combatting a lot of symptoms of endometriosis and I’ve tried literally every other type of birth control and it’s the only one that doesn’t give me horrible periods and migraines. My partner has been so patient and supportive during this process.\n\nAll this to say, I think I can relate to her. I never resented my partner when I wasn’t feeling my best—in fact, I think it was easier to let my guard down and feel/act horrible because he was a safe space. Does that make sense? This is not to say it’s the right approach, but I think once I realized that my mood affected him so much too, I needed to make some changes to my behavior. I’m working on verbally expressing when I don’t feel well mentally/physically so that he doesn’t assume it’s about him/us. \n\nAnyway, I hope things continue to improve for her and you!",
            "Same here, my Mirena IUD made me suicidal. \n\nMy doctor convinced me this was an almost impossible side-effect. Before putting it in. It's actually not that uncommon (according to official information).\n\nWhen on or going on birth control, please read up on what you are putting in your body. Start with the official leaflet, but don't limit it to that information. Doctors often have and convey their opinion, I've learnt.\n\nKeep in mind that mood disorders often go unnoticed and undiagnosed and that they use healthy females when it comes to concluding side-effects.\n\nIf you are predisposed to having mental problems, medical problems, etc. You might already be at a higher risk. \n\nAdvice: before going on birth control; track your cycle for two months without birth control then track it for two months on birth control. I think the app was called Clue, it allows you to report on your mood.",
            "I was diagnosed with anxiety and depression, prescribed antidepressants. Then I had the contraceptive implant removed from my arm, and no longer do I feel depressed. Can't believe for 3 years not one health professional suggested the two might be linked.",
            "I'm currently going through a similar situation with my partner, constantly moody, grumpy and negative and flies off the handle with little to no cause, I'm honestly at my wits end\n\nshe has been conplaining about her periods being irregular and at times its as if it never ends, it could very well be the iud",
            "Yea, my ex became a completely different person. When posts like these come up, I always suggest meds or birth control because it made my relationship miserable. Like who cares that you can cum into your partner relatively risk free if all the feeling, drive, and excitement she used to show that connected you guys is not there.",
            ">I just wanted to point out that it seemed that the cause of my partner's illness was a hormonal imbalance that was exacerbated by her contraceptive coil? I'm unsure of the science behind that but we are certainly doing better. \n\nThis is definitely supported by science. It's actually one of the official side effects, and so is a reduced sex drive. I'm glad you guys are doing so much better!",
            "I got my life back when I got rid of my hormonal implant. I had two suicide attempts whilst on it. The absence of how contraception affects the mental state of women is utterly disgraceful. I'm so, so happy for you both!",
            "This is awesome! Unfortunately birth control in all forms can really fuck with our moods so I’m glad she’s off that coil",
            "I went psycho on the implant I could feel myself changing. I was so cranky and had less than zero interest in sex - like, \"don't even look at me or I'll scream/vomit/cringe\" interest - they said it was normal until my body 'adjusts' at around 9 months after insertion. I got worse and then had anxiety and panic attacks. Finally Doctor removed it (said it was nothing to do with implant). It took nearly 12 months before I was myself again. I cannot take mini pill etc either as my body acts like I'm pregnant, nonstop as in painful breasts and all day morning sickness etc so I don't do birth control at all now.",
            "Birth control is the worst. Not to this extent but my wife (then gf) had very similar experiences (mood swings instead of straight depression) while on the pill. When she got off it was like a switch flipped.",
            "If it was the coil, it was probably the copper causing her symptoms. The copper, non-hormonal, birth control relies on swelling and an immune response to work. Copper is an inflammatory. So it probably caused inflammation systemically rather than centralizing in the uterus. Interesting that this can cause depression or other mental health issues.",
            "That is awesome . Maybe now you can take responsibility for birth control as it's seems her illness was 100% about that.",
            "Right on for posting this ! 😁 \nReading the comments about experiences different women have had with hormone change & mood is mind blowing, and everyone is so different. I was the opposite of the post, as in small IUD worked so well for me (least amount of hormone you can get in a normal contraceptive, because it's localized) .... But I did have a prev. experience when I took mini pill and I broke out in cystic acne, & sex drive was lost to the wind... Before that was on combined for 5 years & was great with that but had to come off cause of migraines... Made me think you know, maybe it's how much of a change it is you're making. Like, do people know that different combined pills have different hormone amounts in them? A senior nurse told me that - wild!",
            "You're not crazy, the pill and the IUD made me absolutely insane. I'm glad she got it removed and I hope you two can find a better solution to family planning.",
            "Im glad this has a happy outcome!! But remember that people start to feel the effects of the medication and feel like they can quit them cause they're \"better\" and fall back into depression. so maybe convince her to keep taking them for a little bit. Hormonal bc can definitely play sooo heavily on depression but that kind of depression that she had doesn't usually just stop.",
            "I used to be on depo...that quarterly shot....and it messed me up bad.  The moment I stopped I felt better.  A lot like your girlfriend did.  Birth control does a lot of weird stuff. I'm glad everything is going better for you both.",
            "I was on the Mirena IUD and was spiraling into a dark place after 6 months. Got it out a month ago and switched to a non hormonal IUD. I feel 100% better now. Sucks that they never warn about the horrendous emotional side effects. When I told the office why I was getting it out they went over all the other reasons why women end up removing it but seemed a little shocked at my reasoning. None the less, never will I place a hormonal birth control in my body. Every one of them exacerbated by clinical depression ten fold.",
            "I know so many people who have gotten super bad depression from birth control. It’s a super common side effect and should be better well known because it can really be deadly. \n\nMy friend never had any sort of mental health issues before, went on birth control, and wanted to die every day. Luckily she figured out the connection in a couple months but if she’d known it was possible when she started taking it she could’ve stopped immediately when she started getting symptoms.",
            "My birth control had a similar effect on me. I felt tired and depressed a lot of the time and had 0 sex drive. I tried a couple different kinds then ultimately decided to stop taking it all together. I feel so much better and although I do still struggle sometimes I don’t take 3-5hr naps every day anymore and my libido has improved so much. My depression and low libido was greatly affecting my relationship and it’s gotten so much better since stopped my birth control. It’s crazy how much of a toll a little pill can have on your life. Glad you were able to push through the bad times. Like you said, things get better.",
            "there is a lot of scientific evidence to back up what she has experienced. I’m glad you guys are doing better and she figured out at least part, if not all, of the cause of her issues. Hormonal imbalance is a nightmare. Good job for sticking by her side through it!",
            "I went off birth control and found out the weekly migraines I had for 10 years went away. I had tried going off it before and didn’t think it was the cause, but what I didn’t realize is it took about 4 months before they started fading away, and haven’t had one since. Really wish I had realized years earlier. I know BC is helpful to some but gosh there has got to be a better way for many...",
            "Personally my medication made me more depressed than anything. They made me gain so much weight and made me super lethargic.\n\nI worked my way off my medication, started exercising, stopped drinking, and now I feel better than I've ever felt before.\n\nI still have episodes obviously, but I feel more in control and smoke for bad anxiety attacks. Smoking has helped alot cause the whole process of grinding/loading a bowl is tedious and helps me get my mind away from the problem and then smoking helps me stay calm.",
            "I’m so glad that things are going better for you guys! As someone who is on a contraceptive and feels similar symptoms, I often wonder how my life would change if I were to be off of them. Thank you for sharing your story as I can relate to your partner and want to take measures to change my moods to make his life better. Enjoy your camping trip!",
            "I feel this so hard. I was feeling completely apathetic toward life. Then I went off birth control. Mostly because I was too apathetic to give a damn. \n\nHoly Moses did the feelings come back hard!\n\nNot feeling quite right? I recommend changing birth control.",
            "Just had a conversation with my daughter about this. We’re pretty sure her old contraceptive caused her anxiety.  Changed her pills and it’s totally better.  Same thing happened to me years ago.",
            "Honestly reading your post from months back it was almost like you were describing me. And I just had the EXACT same experience - just went off my birth control (pill) and I feel a MILLION times better. Sex drive is back, more energy, I feel happier and less anxious. It’s incredible, honestly. I’m so glad your girlfriend found this was the case for her while also sorry it cost her so much time feeling the way she did - it’s awful, I empathize! I can’t tell you how much I appreciated and still appreciate my SO for all he’s put up with so I’m sure your girlfriend has the same feelings towards you, OP. Best wishes going forward!",
            "Ugh, iuds and hormonal contraceptives can seriously screw with some people’s moods. Like, I felt so suicidal on any hormone treatment, and that’s not hyperbole. I’m so glad she’s off them and feeling better! My good wishes and regards for you and your family!",
            "I know and value all the great things birth control can do but also, fuck it, it’s insane how woman ca. Deal with putting their body through the hormone bombardment and other impacts. Just use a condom guys, everyone will be so much better off",
            "Wholesome flex so it's okay",
            "I took a BC pill for a week once and I cried everyday at everything. A cute dog on facebook. My hair. It was terrible. Quit the pill and went back to normal!",
            "I had Nexplanon for a year and it was terrible.  Horrible mood swings, I was angry at the world for no reason, and I had dark, depressing thoughts constantly. It got to the point where I thought it was just me, that no way my birth control could change me like this. I got it out recently and while I don’t feel 100% normal, I feel a better sense of clarity. Before, all of my thoughts were foggy and I was always quick to get angry or sad. The smallest things would make me burst into tears. I didn’t know anyone who went through a similar experience and didn’t have a ob-gyn to ask questions. Getting Nexplanon was probably one of my worst regrets in my life but hey, I couldn’t have known how bad it was until I tried it myself. I’ll stick to the combo pill for now.",
            "I am so happy you stood by her this whole time. \nWhen my husband and I got married, I got off BC becuase we wanted kids in the near furture and I was tired of BC side effects that were affecting our sex life. \nI spiraled into a depression after getting off of 5 years of BC. \nContraceptives can really mess with everything in the body. \nKeep in mind, if she's had depression once, she could have it again in the future. \nI wish the best for you guys!",
            "Can confirm. Stopping taking bc pills in March after taking various pills for over 10 years. I’m very happy and I doubt I’ll go back.",
            "Congrats you have been very patient and very helpful in dealing with this situation. Hats off to you for the unflinching support u gave and here is the result.",
            "My husband asked me to stop birth control after it made me too moody",
            "That is so awesome and now you can reap the rewards of a happy life again!",
            "Was on BCP and had crazy mood swings. Got copper IUD and never going back to all those hormones again",
            "Your partners situation sounds like mine only I’m on the pill.  It’s treating hormonal acne though so I’m stuck on it...",
            "I'm glad she got rid of that thing. I used nuvaring for three months and was suicidal for most of that. Never again.",
            "What kind of coil was it? The use of the word coil makes me think it was paraguard.",
            "So, just a question: was this a progesterone coil or a copper coil with no hormones?",
            "Nice !\nFucking hormones though... -_-",
            "I felt almost enraged when I started taking the pill and have never taken it again. It can absolutely affect your mood. I don't think you are bragging at all, it's really kind of you to update people as often people only hear about the bad stuff in relationships.",
            "Great to hear it's working out, good luck to your lives together",
            "First pill I was ever put in made me cry all the time!\n\nPlanning on getting my mirena (iud) out early next year (to try for a baby) and trally interested to see if it will change my moods and/or libido - it'll be my first time without hormonal interference in 10 years (have had injection, implant, pill and mirena coil).",
            "This is terrifying because the exact same thing happened to me. I was on the pill for a year and that entire time I was struggling with depression. I never connected the pill to this.\n\nLast December I decided to go off the pill and get an implant. It was like a light switched back on and I felt back to my normal self (as in pre-depression me) within weeks.\n\nThere really needs to be more awareness about how drastically birth control can change your mood. I never once thought that it might be the pill causing all of my troubles.",
            "Unfortunately birth control can really fuck women up. I struggle with depression already and when I'm on birth control it turns me into a raving lunatic. I'm aggressive, violent, cruel, fly off the handle over tiny things. Nothing like me in real life. I try to drop hints to my partner to about getting a vasectomy but he doesn't seem too gung ho about it. Maybe one day. For now, condoms are the way to go.",
            "I'm glad you are both doing better and also they need to do more research into the side effects of the various forms of birth control.",
            "I presume it was one of the hormonal coils and not the copper coil?",
            "Yeah I realized I fly off the deep end emotionally on birth control. Birth control is not fun as it does mess up your hormones and make you more emotional. Wish they had other options besides birth control to help women with bad periods",
            "Female dogs and their hormones.",
            "I'm so happy for you!!!",
            "Honestly contraception can mess with your mental health soooo badly. I am already prone to anxiety/ depression, and was also going through the most stressful period of my life so far when this happened but I was on the pill and I went into a spiral and was worse than I had ever been before. I didn’t even want to leave the house etc. \nI came off it and realised quite how badly it affected it! There’s definitely not enough research into that sort of thing and it’s just accepted as a side effect. \nAnyway, so glad things are looking up for you and your family OP!!",
            "While on the contraceptive patch, i was horribly depressed and anxious. My hair fell out as well. I had a period for 6 weeks. Never again! No hormonal contraceptives for me!",
            "I've heard many similar stories (RE depression linked to hormone medication).\nI would like you and her to do a post mortem on that  depression episode, the reason being that she (nor you) is immune to have it again in the future. It could be in a year, in ten, or never, but you should create a plan of action to prepare to cope if it does. And enjoy every minute  your newfound happiness:it is so, so precious!",
            "Yes, there's 2 types of contraceptive coils. One is just made of copper and the other has hormones. Hormones in contraception works for some. I suffered depression, had serious mood swings. You name it. Hormonal contraception is the devil! That's really good you've noticed the difference and she'll feel better in herself. I'm glad for you both 😊",
            "Oh yes this was me. The moment they removed my mirena it’s like Jekyll and Hyde. I suddenly felt human again. My doctors all said that it’s impossible for me to get depressed because of the low output of hormones but for me it was a huuuuge difference.",
            "Fair. I wouldn’t say it’s a conspiracy, just the dismissive attitude of some health practitioners . I was having genuine problems, they disregarded them and then gave me guilt trips for removing it. I spoke to another practitioner and it turns out they didn’t do proper checks, or insertions and it sounded like I had an infection plus hormone reaction.  First GP was telling f me it was my laundry powder ffs. Problems went away when I finally removed it. Everyone reacts differently. I really wanted to like mine as so many people raved about theirs.",
            "Dude, contraceptives can take a toll on people. I was on hormonal birth control for 8 or 9 years, and once I stopped it, most of my anxiety problems completely went away, and a lot of my mood problems did, too.",
            "This post gives me hope. I've been feeling incredibly awful and only after noticing my acne flare up did I put two and two together and realize it's probably my IUD...\n\nHaving a non hormonal one put in Wednesday, hoping this brings me back to some kind of normal.",
            "That's amazing! One of my best friends also got into major depression because of her contraception. I'm so happy that your partner is in a better place now and I really wish that the world would work on more medication and contraceptives without the hormonal imbalance",
            "Fuck, birth control is a fickle thing! I spent a year miserable on the pill and and as soon as I changed to an implant the better moods were obvious immediately! Glad to hear it's going well now!",
            "My depression greatly worsened with the hormonal contraceptive coil (IUD). The hormonal IUD continuously releases progestin which is similar to progesterone, the hormone that starts periods. This is also the hormone that causes PMS symptoms. In women who suffer from pre-menstrual depressive disorder (PMDD), the hormonal IUD can basically just cause depression for the duration of it being in you. :(",
            "Cutting out the contraceptive is top way to get healthier from my experience!",
            "This is easy science. Many practitioners of cupping therapy or Hijama knows this. When the body is made to withhold stuff that should be secreted out, then it can cause problems, especially in the case of women."
        ]
    },
    {
        "post_id": "pj17y3",
        "author": "ThrowRArmpain",
        "title": "Update : My (22M) roommate (22F) and I are stuck in a messed up relationship",
        "url": "https://www.reddit.com/r/relationships/comments/pj17y3/update_my_22m_roommate_22f_and_i_are_stuck_in_a/",
        "score": 3557,
        "num_comments": 64,
        "created_utc": 1630940965.0,
        "selftext": "[Original](https://www.reddit.com/r/relationships/comments/pfydgg/my_22m_roommate_22f_and_i_are_stuck_in_a_messed/)\n\nNever thought I would be updating this. I took the advice and decided to take it slow and just not spill my feelings but the idea of spending time with her without telling her my feelings felt terrible. I was pretty miserable for two days and she ended up asking me why I looked awfully sad and if she could do anything to fix my mood. \n\nI spilled all my feelings for her, it was probably the most unromantic confession ever. She was really surprised that I was into her. We spend the whole night talking. She told me she had been crushing on me for ever since we moved in. She said she never though someone as sweet as me could fall for a 'callous inconsiderate B' like her. \n\nI have never heard Bullshit like that before, she is a bit cold and she doesn't smile a lot but that doesn't make her callous or inconsiderate. She has done a million things for me since we have moved in. I think we both realize that we could have been together way earlier if it wasn't for our fucked up self perception issues. We mostly joked about going to therapy and shit we went through growing up. She is fucked up too but in a way different way than I am. lol. On a serious note, we are both planning on going to therapy. We could have been together for so many months! but we both thought the other would never both with the other. wtf.  My parents actively discouraged me from doing it and her parents said she needed therapy to be kinder. So haha. This is pretty scary but we both are gonna try to make this work.\n\nTLDR : Talked to her, she had feelings for me, we are dating now and searching for therapist.",
        "permalink": "/r/relationships/comments/pj17y3/update_my_22m_roommate_22f_and_i_are_stuck_in_a/",
        "comments": [
            "I love this kind of story! Even more, I love how mature y’all are being about it now! Instead of saying “we balance each other out and make each other better” you’re actively taking it upon yourselves to become better versions of yourself! \n\nSo happy for y’all and I hope you grow together for years to come 🥰",
            "That's awesome! Good for you! I'm really happy for the two of you!\nGoing to therapy sounds great, so many people would benefit from it!\nAnd really cool that you found the courage to tell her about your feelings!\nAll the best for your future! :)",
            "Do note that therapy can be intense for you both and might put a strain on your relationship too.\n\nIt could be great if you're going into therapy at the same time and find support in each other for all the hard things you'll work through. At the same time it might be a lot, to go through it yourself and also having to deal with a new partner that is also going through a tough time. You'll need to focus on yourself and that might be hard if your partner needs support too.\n\nDon't let this keep you from going to therapy(!), but be aware that the whole situation might get too much for one of you and to be open about it to each other.\n\nI hope it works out. 😊",
            "Don't stress yourself so much about the months you lost. You have a couple of years ahead! At least you guys are in the same page already. Celebrate!\n\nI'm happy for you!",
            "It’s a better story this way. Good on both of you for therapy. Because those fucked up self perception issues are hard to shake. They definitely creep in when you have conflict. Work on yourselves and then maybe some coupling counseling to proactively understand how to best communicate and support each other through stresses. Don’t wait to get help to save a failing relationship. Get help building a strong one. Good luck!",
            "Congratulations!\nThat's actually how my brother meet his now-wife.\nHe needed a place to stay, she was advertising for a room mate.\n200 applicants, and she picked him.\nAfter a few months of co-habiting they decided to turn his room into an office.",
            "awesome! i wish you all the best mate!",
            ">We mostly joked about going to therapy and shit...\n\nGo for it.  Therapy is a great way for two people that don't have a ton of experience talking about difficult things with their partners to learn how.",
            "> My parents actively discouraged me from doing it and her parents said she needed therapy to be kinder. \n\nWow, neither of your sets parents are not doing the two of you any favors in terms of getting into healthy relationships. Hope your parents are speaking from a \"don't x where you eat\" standpoint and are not trying to tell you who is \"in your league\". \n\nI can not tell what all is inner monologue and what you have actually told her, but it would be healthy for her if you express in which ways her parents are wrong. You have definitely described a kind and empathetic person. Just because she doesn't default to bubbly, she is looking after you.",
            "He shoots, and he scores. Good on you for not beating around the bush and shooting your shot. Don't worry about wasted time. Enjoy the time you get. You both deserve this. Have fun and good luck on both of your respective journeys! I'm a sucker for a happy ending. Thank you for sharing.",
            "Good luck to the two of you! You finally shot your shot and now you know. Therapy can be very hard work but it is never time wasted as you will find out all sorts about yourself you never knew. Yes sometimes you have to dig down into what hurt you and feel hurt all over again, but you will have a professional with you to guide you through it this time.",
            "I like to joke that finding a partner is finding someone with compatible insanities. Sounds like you two are really into each other and I hope it works out. Don't mourn the time you've lost, celebrate the time you will have together in the future",
            "Good for you. I wish you both every happiness you can grasp!",
            "congratulations on your budding relationship :') thank you for the wonderful update!! made me smile.",
            "This is great! Wish you both luck :)",
            "thanks to the mutual friend who set you guys.",
            "This has made my day, what a great ending, or beginning I guess! Best of luck to you both.",
            ">She said she never though someone as sweet as me could fall for a 'callous inconsiderate B' like her\n\nWhen people tell you who they really are you should listen. According to this post though you won't so best of luck to you.",
            "Yes my guy. Good luck!",
            "Can someone tell me the point of going for therapy?? How will this help??",
            "Op i have a strange opinion about your relationship with her but it’s complicated and I probably shouldn’t say it since things are okay between you.\n\nTake easy steps and don’t rush anything. A piece of advice is to expect anything when you’re in a relationship so you shouldn’t ever invest in others more than yourself in an imbalanced way. Do your best to solve any major issues impacting your life first and foremost. \n\nGood luck in your odd and interesting relationship, hope it’s a start for something better.",
            "Sounds awesome, great job!",
            "That's really heartwarming.",
            "I told my crush how I feel about her but she doesn't feel the same way.\n\nNow am drowning in sorrow.",
            "Talked to her, she had feelings for me, we are dating now and searching for therapist.\n\nCheaper and Better IMO\n\nTalked to her, she had feelings for me, we are dating now and **searching for church to recieve counseling** from a local Pastor / Rabbi / Iman/  DaDa\n\nFTFY",
            "If she has told you that she is a \" callous and inconsiderate B\", don't dismiss it but believe her and run. It will save you from future problems",
            "Great update!! You guys have fun.",
            "Actions speak louder than words. Insecurities beat the best of us. Could you have eased into it easier? Sure! But all’s well that ends well. Haha congrats man",
            "I'm so happy for you two! <3",
            "You are one lucky guy, hope it works out for the both if you!",
            "You both deserve to be happy and to make sure those issues that you have from your past dont ruin a good thing, go get that therapy still. Take control of your future and your well-being x",
            "Be careful cause if you break up you may still be stuck living together.",
            "I don't understand why people discourage therapy.  It's a great readily available tool that can really help people. Hope it goes great and you guys can live a happy life together ☺️",
            "That's how my husband and I started dating, after 12 years of friendship, took him moving into to realize how much we were into each other! =\\]",
            "i'm so happy for you",
            "I think this is super nice! Good luck!",
            "Good for you! But I assume there are details you’re leaving out about why either of you need therapy since there’s a lot of messed up shit that goes on Reddit of ppl who need therapy and tbh your situation seemed pretty mundane and vanilla",
            "Talk about the best case scenario!",
            "Aw that is so sweet, sounds like the plot of a movie , congratulations and all the best to both of you : )",
            "You must now push for a relationship that makes each other grow.",
            "wow! I love happy update!",
            "Most healthy part: they all go for therapist for this kind of issue. Very nice, and congratulation!",
            "This is so cute! I'm really happy for you guys, wish you all the best!",
            "Best of luck to you both. A great story and on to a happy life !",
            "Wish I would've done something like this in my early 20s",
            "Mazel Tov! But be real and open about how therapy is going. And be ready to hear from each other that you still need to be in therapy.  If you can trust each other that much,  you will do well.",
            "How wonderful that it has worked out for you two! Good luck for the future and enjoy your relationship!"
        ]
    },
    {
        "post_id": "j267bi",
        "author": "ThrowRAarrangedlove",
        "title": "My (25F) cousin (26F) resents me for not having an arranged marriage and blames me for hers.",
        "url": "https://www.reddit.com/r/relationships/comments/j267bi/my_25f_cousin_26f_resents_me_for_not_having_an/",
        "score": 3549,
        "num_comments": 186,
        "created_utc": 1601407269.0,
        "selftext": "Almost all the marriages in my family have been arranged marriages. My mum’s marriage to my bio dad was an arranged marriage but it ended up in a messy divorce and him completely abandoning us before I was even born. My mum had a love marriage the second time, despite the disapproval of her family, and has been much happier with my stepdad than she probably would have ever been with my bio dad. Because of this, my mum has always been very adamant that she would not try to force us (my siblings and I) into arranged marriages despite what the rest of our family thought.\n\nI’ve been with my fiancé (26M) for 3 years now, we got engaged 2 months ago. He’s met my parents and siblings but as far as the majority of my extended family were concerned, I was single until 2 months ago. Early last year, my fiancé dropped me off home after work one day and my uncle was there. My uncle is the oldest sibling my mum has so he’s seen as the ‘head’ of the family (i.e. he thinks he has a say in what the rest of us do). It was obvious my uncle was pissed, and he ended up grilling my fiancé and I assume he met his standards (a lot of arranged marriages are about what both families can gain from one another (e.g. wealth, influence, etc.)) so he told my mum to get us married quickly (he wanted to make it look like we had an arranged marriage before the rest of our family found out). My mum ignored him and told us to keep dating if it’s what we wanted. Over the past year, he’s mentioned me getting married to my mum every single time he’s spoken to her.\n\nApparently, my uncle assumed just because he’d given the ‘order’ that we were going to get married soon. He told my cousin (his daughter) that I had agreed to an arranged marriage and because I had and she was older, she should agree to the match he’d found her. My cousin never mentioned this to me, but she did agree to marry the man my uncle found for her. They got married late last year. They haven’t had a good marriage and my cousin is very unhappy. Her husband is incredibly controlling and hardly ever lets her go anywhere without him or a member of his family.\n\nLast week, she was over at my house when my fiancé came over to drop some of the clothes I’d left at his place over. When I told my family about my engagement, they all assumed it was an arranged marriage and I didn’t bother clarifying because it really isn’t anyone’s business. You don’t tend to do sleepovers if you’re having an arranged marriage, so my cousin knew immediately it wasn’t what she assumed. She started asking me questions about my relationship and I answered honestly. She got really angry at me and kept demanding to know why I didn’t tell her about him. The thing is, I’m very close to this cousin but I also know how our family is about dating and I didn’t want my male cousins trying to strongarm my fiancé (they’ve jokingly threatened this before). She pretty much blamed me for her arranged marriage and said she only agreed because she thought I was going to have one too and if I had told her I had a boyfriend, she would have had the courage to stand up to her family. She hasn’t spoken to me since.\n\nI do feel bad for her. I know how unhappy she is but if she had mentioned what my uncle told her earlier, I would have clarified. I don’t want this to be the end of our relationship, but I don’t know what I can do to fix this. Please help.\n\nTL;DR – My cousin agreed to an arranged marriage because she thought I was also going to have one. She’s since realised I’m having a love marriage and is blaming me for letting her agree to an arranged marriage when I had no intentions of having one myself.",
        "permalink": "/r/relationships/comments/j267bi/my_25f_cousin_26f_resents_me_for_not_having_an/",
        "comments": [
            "She's blaming you because it's safer than blaming the person who is really responsible here.",
            "I agree with the others that this isn’t your fault and that if your going along with an arranged marriage was such a big factor in her decision to do the same, she probably should have talked to you about it so you would have an opportunity to clear things up. However, this isn’t a problem that you can debate your way out of, so I don’t think it’s helpful to focus on trying to convince her that you didn’t do anything wrong. My advice would be to tell her that you’re sorry for the misunderstanding and that if you had known that it was being used to pressure her, you would have taken her side, and let her know that whatever she decides to do going forward, you’ll be there to provide support in any way you can. I think that’s all you can do, and once you’ve put that out there, unless/until she reaches out to you and wants to mend fences, I would try and stay out of it.",
            "This is in no way your fault. Your uncle is domineering and duplicitous. This is his fault. The problem with having parents like this is they take any resistance as a challenge to power. It is usually shut down harshly. Your cousin probably has no method of dealing with and all of that icky feeling is being directed at the only person she's allowed to be honest with, you.",
            "As the seemingly only person in this situation not trying to control her or force her into an arranged marriage, you're safe to lash out at. You won't be upset or angry with her for not wanting an arranged marriage. She can be open with her feelings towards you. \n\n\"Priya, I don't think I will ever fully understand your feelings related to your arranged marriage because I simply cannot live in your shoes, but I do want to be there for you and help you navigate this. Please let me know if you want to talk.\"",
            "She is projecting how she feels about herself onto you.\n\nWhile she can't use you as a model, she can certainly use your mother.\n\nTell her you and your family will be there for her if she decides to end her marriage and do something else. If she comes after you again, be kind but firm. She is responsible for her own choices, and she doesn't get to attack you because she wishes she had made the decisions you have.",
            "I like, like most people here, don't come from a culture with a significant arranged marriage tradition, but to me, it doesn't sound like this is on you. Yes, if you'd made a big thing out of how your marriage wasn't arranged, it would have put her in a better spot. But, I'm guessing you're under considerable social sanction not to do that, same as she was under pressure to get an arranged marriage.  \n\n\nThis isn't your fault, but she's in a position where she can't strike out at the primary people responsible for her misery, her shitty husband & father, so try not to be too hard on her about it & help her get out if at all possible.",
            "It’s not you she’s REALLY mad at - it’s her dad/your uncle. He withheld and twisted the truth about your engagement, in order to manipulate her into doing something she wasn’t sure was the right thing for her. He did this because he knew that she trusts your judgment and would think, “if OP is doing it and is happy with her choice, then it must be a good choice for me too.” He knew that she would find out the truth from you eventually, but he chose to lie anyway, banking on the fact that you would keep the detailed history of your relationship private until after her wedding. Who even knows what lengths he went to and what other lies he told to keep you and her from ever discussing it until now - I wouldn’t put it past him.\n\nYour cousin is right to feel like she was tricked and betrayed - but it wasn’t you who tricked her. You did nothing wrong! Her dad is the bad guy here. (Of course, I know he’s operating within a larger cultural context that influenced his behavior, and he genuinely believes that the arranged marriage was the best thing for your cousin - but, at the end of the day, he lied to his child in order to manipulate her into entering an unhappy marriage that she didn’t want, wasn’t ready for, and which isn’t working out. That’s bad parenting, full stop, no matter what culture you’re in.)\n\nNow, depending on how her dad raised her and how close she is with him, it may be very hard for her to recognize and accept all of this. She may still be in the FOG. It may not happen immediately, and she may push back against it. While it may take her a while to recognize that you aren’t the bad guy, I do think you should keep that line of communication open, so that she knows she can always come to you if/when she needs someone. Then, even if it takes a while for her to come around, she’ll always know she has other options.\n\nI would first tell her that you never knew that her dad was lying to her, and that you would have told her the truth immediately if you did know, and would never have helped him lie. I’d also say that you think what her dad did was awful, and you’re sorry that he used your engagement to manipulate her (“sorry” as in you feel sympathy for her pain, not as in pretending that you did something wrong). Then, I’d focus on providing her with emotional support for now, both in dealing with this conflict with her dad, and with her ongoing problems with her marriage/husband. \n\nI also think you should let her know that while you aren’t going to pressure her to do anything, if she ever decides that she wants to get divorced, you WILL help her do it without judgment. Tell her that whether she stays in this marriage or not, you will stay in her life and love her forever, no matter what. I’m guessing the rest of the family want her to stay married, and clearly her dad is willing to lie to make her do what he wants - so I think it’s important for her to know that you won’t pressure her one way or the other, and that your relationship isn’t contingent on her doing what you want her to do.\n\nWhen she’s had some time to cool off, and to recognize/accept that her dad is the villain here and not you - then I am certain she will appreciate knowing that she has at least one family member who is honest, loves her unconditionally, will support whatever makes her happy, and will not pressure her to do things she isn’t comfortable with. I’m sure that her dad isn’t providing any of those things, and she might feel like the whole family agrees with him. I hope she realizes you aren’t in the wrong soon - but if not, I think you should leave it to where she knows you care and are there for her, even if she’s angry. I know it’s tough to have her upset at you, and I’m sorry your uncle has put you in this position.\n\nFinally: I’m sure that your mom and stepdad would be willing to support/help your cousin without judgment as well. They can also  serve as role models if she wants to leave her marriage - your mom’s story proves that a woman in your culture can find happiness after divorce, and both of them can attest that marrying for love can lead to happiness and contentment, even if family members disapprove. So if your cousin rejects you now, then you might ask your mom to reach out to her.",
            "[deleted]",
            "Maybe remind her that your mom was in her position, and divorcing then resulted in her happiness now.",
            "Help her get out of her shitty marriage",
            "Help her get a divorce.  Help her start a life for herself so she doesn't have to go back to her abusive family.",
            "Your cousin should blame her horrible father for lying to her.",
            "Speaking as someone who comes from a similar culture of arranged marriages, I feel for your cousin. Women are expected to be the ones to \"adjust\" in the relationship going ahead and I highly doubt that she had any support in her parents (and presumably your other cousins who're clearly perpetuating the patriarchy). Having some form of parental support (as in your case) makes it far easier to make choices which buck the trend. \n\nThat said, is it your fault that she got into an arranged marriage? Not at all - that's her uncle and husband. In the same way, there's nothing you can do to fix it. You can just offer your cousin support and remind her that your mother managed to get a divorce when it was probably taboo to do so! Be there for her and offer her a place to escape to eventually. I'd say that she get a divorce if she's unhappy (because that controlling behaviour is only going to escalate and bringing children into that is a shit idea), but that's her choice eventually. You can bring a horse to the water but not make it drink and all that jazz.",
            "The real MVP in this story is your mother tho’ - in that background to not give a single fuck. That takes some spine.",
            "Help her get a divorce",
            "From your narrative, I would assume you are from India. The truth is you can't fix. Only thing you can do is, tell your cousin to be financially independent. If she already earning, no need to worry. Simply ask her to get divorce. And be ready for fallout.",
            "Your cousin is lashing out at you because she is being abused, and you're a safe person to take it out on.\n\nThat's really unfair to you, and of course it's not your fault, but she is in a bad situation. Tell her it's not too late to leave, and help her get in touch with domestic violence organizations where you live. They can help her form a plan to get out and stay safe from her ex husband and her family.\n\nAlso, tell her to make sure she doubles up on birth control.",
            "Hey, not your fault. I get the whole scene, I also arranged married. Luckily my situation is good, nothing was forced on me, I got to know her well before I said yes and it was upto me totally. No family pressure. Thing is, with your cousin, she had family pressure. I have other cousins who got love-married, so that precedence scared some of my family members, some uncle's were like \" ohh he's gonna set a precedent for our kids and they'll want the same and won't listen to us and we won't be able to do much\" etc. That's the scare here.  So in her eyes, you could've been a \"precedence\" for her, so she might be mad that you didn't tell her because if she had known, maybe she would've never agreed to the marriage at all. She's angry right now, so let her be. Just tell her your there for her, and if her marriage really is so bad, tell her you'll stick up for her (I know there's only so much you'll be able to do with all the family politics) but tell her to trust you and you be the best cousin she's got.",
            "How close?\n\nLike you guys grew up together , sleepovers, sharing secrets and goals, telling each other about bfs?\n\nI understand you kept your bf a secret for 3 years, but how do you not tell her?\n\nHow could she not reach out to you once she found out about your arrange marriage, whether to \"congratulate\" you or find out more details...and how did you not warn her?\n\nHonestly you both screwed up here, but it's her father's she should be upset with. Let's say you were never in the picture to begin with..did she honestly think he father would just forget about arranged marriages?",
            "I can see your cousin's point of view - she thought she was doing what was expected and required in your family and culture, got into an unhappy situation, and now sees that she was manipulated, both intentionally (by her father) and unintentionally (by you.)\n\nThat doesn't mean you did anything wrong, but just that your cousin deserves some sympathy and compassion in this painful situation. Maybe it would help her to speak with your mother, who has experience with an unhappy arranged marriage, divorce, and then a happier love marriage. Maybe you can arrange for them to meet for tea or something.",
            "Convince your poor cousin to arrange a divorce already",
            "Her anger isn’t about you. She’s frustrated about her current situation and doesn’t have a safe place to vent that so it’s randomly directed at you.\n\nArranged marriages can be fine in some cases, but they can also be extremely traumatic in other cases. She is probably going through a situation that is very distressing, maybe even abusive. \n\nBe there to support her. If she’s mad at you for nothing, let her be mad. If there’s any way you can help her from a practical standpoint, please consider that.",
            "It's easier for her to be mad at you than to be mad at her father who lied to her, or herself who didn't bother to verify his statement with you. \n\nYou don't fix this. This isn't your problem to fix. She'll either get over it or she won't.",
            "This isn’t your fault, it’s your controlling Uncle who lied to her. You don’t have share that information to anyone if you don’t want too, even if you are close to them. You’re allowed to have some secrets.",
            "This isn't your responsibility or your fault. Your cousin is a grown up who is looking for an easy target to blame all her troubles on, that doesn't make her a bad person but if she escalates this then possibly it does. \n\nYour mum divorced almost two decades ago when in assuming divorce in your culture would have been taboo. Although it is and can be difficult in 2020, your cousin CAN divorce, she doesn't have to waste the rest of her life in this guy. \n\nTalk to her about this gently, tell her if that's what she wants to do, you will support her.",
            "It sounds like your cousin is on your mother's path.\n\nI bet your mother has some great advice for her.  Maybe you should make the connection for them?",
            "As many have said, she needs somebody to blame, whom she can be mad at. And of course for her it would have been better to have an example to point to. Have you explained that you honestly feared for your fiance's safety? You are both being supressed here, and I hope you can work together even though it's difficult!",
            "I’m gonna play the devil’s advocate in this situation because I also grew up in a family like that. My parents were great but the rest are backward-thinking apes. \nI think your cousin, who you said you were close with, is hurt because you didn’t trust her. You didn’t want to tell the rest of your family because it wasn’t worth it and I understand that, but if you’re that close to her, you should have told her. Or at least, I think that’s how she sees it. So if you want to mend things with her, you should tried explaining why you acted the way you did and acknowledging you maybe should have more trusting with her. It will make things easier for her to see that the real culprit here is *her father*. \nIf it’s anything like my family, I would try and help her escape her marriage or do things to make her life easier.",
            "Here's the thing. You stood up to your family. She didn't. Using you as an excuse \"if you had told me I would have stood up too\" is just misdirecting blame. She likely is angry at herself, her father and her husband.\n\nYou did nothing wrong here. She can **still** stand up to them and get a divorce if she's that unhappy.\n\nArranged marriages need to die out swiftly in societies. These type of societies condemn premarital sex but are totally fine having their children marry a complete stranger. Like wtf",
            "Right now it is just an easy option to blame you because of her lack of courage and confidence to standup for herself and say no of her own accord. I don’t think she is upset at you, I think she is upset at herself and uncle but you are probably the easier punching bag she can unleash her hurt feelings on. Even if you told her about your fiancé and that you weren’t having an arranged marriage that still may not have changed anything for her. Your cousin may have spoken out and said she also doesn’t want an arranged marriage but judging by your uncle he may have convinced her to have one anyway! when she finally realises you are not responsible for her life choices, hopefully you may grow closer again!",
            "You did nothing wrong. I'm honestly surprised she didn't ask you about agreeing to an arranged marriage since your mother has a love marriage. You did not know about the manipulation taking place so you couldn't stop it. However I think she needs a punching bag. It's super selfish to do it and you should never do it but she needs someone to get angry at and you're the safest one to be angry at. I'd try to reach out and tell her that she can vent to you and you want to help her. \n\nI'm not you but if you want to know what I would do in your situation is say you'd let her stay with you and your fiance so she can divorce her husband. Do not feel like you have to, because you really really don't. But if it is something you could do, I think she'd really appriciate that. Abusive relationships are incredibly scary.\n\nPS if you'd drop you uncles email, I'd sign him up for the worst spam mailers ever. What he did almost made me puke which is why I feel so bad for your cousin.",
            "I imagine she lashed out as a result of misdirected resentment towards her husband, her current direction of life, and the man who manipulated the truth to put her in this situation. All I can suggest is be supportive of her, and hopefully when she pushes for a divorce you can be the family that the rest of your family haven't been.",
            "YTA: It seems you lied to save yourself from an arranged marriage, which is fine and dandy, but sad for your cousin. Manipulation all around, especially crazy uncle.",
            "What country do you live in? If therapy is an option, suggest therapy for her so she can work out her marriage/family issues. And remember, you’re both adults. Tradition is only “fun” if everybody consents to it. Your family’s values are very old-fashioned, and it sounds like they need a reality check.",
            "Your cousin believed her father lying and now she’s mad?? That’s incredible. I don’t understand the “arranged marriages” thing, not part of my culture (thank goodness) but, can’t she I don’t know .. change her mind, postpone? Either way this is NOT your fault. I believe she is mad at you because she can’t be honest.",
            "There isn’t really a way for you to fix this when you’re not the person she’s *actually* angry at.",
            "I mean, sorry her dad lied to her?",
            "> He told my cousin (his daughter) that I had agreed to an arranged marriage and because I had and she was older, she should agree to the match he’d found her.\n\nWell, your cousin rushed into a *massive* decision based on a pretty thin lie.  If she had done just about anything beyond just agreeing to the decision she could've found out that you weren't in an arranged marriage.  Her choices and lack of investigation led her to this point, not your relationship.",
            "At some point, a person has to own their adulthood and *try* to communicate effectively. It is neither your responsibility nor after-the-fact fault that your cousin refuses to own her adulthood by communicating her wants and needs. She’s being immature by blaming you for her unwillingness to become an adult and communicate on things that have such a large influence in her life (e.g., marriage). She’s guilting you for something her lack of personal responsibility and lack of courage caused. \n\nIt’s clear you’re sympathetic toward the oppression she lives under with your uncle being a domineering and controlling father and patriarch of the whole family at large. Your sympathy shouldn’t lead you to feel responsible for her lack of courage. She’s an adult. She can make the *difficult* and *uncomfortable* choice of standing up for herself—at least communicate her wants with you and/or other family members. Or, she can do what she did by cowering and silently submit to her domineering father and the marriage situation he demanded. \n\nIt’s never to late for her to turn it around and stand up for herself. Your mom divorced. Why can’t your cousin?\n\nReally, it has to be emphasized that she’s blaming you for her own ineffectiveness (e.g., not braving the act of communication, cowering to her dad and blaming *you* instead of her dad, acting entitled to pity when she didn’t do the minimum of speaking up to you if no one else in your family). It’s just hard to sympathize with someone who would blame someone else for their mistake or lack of courage rather than admit to their weakness and ask for help.",
            "That is A totally f'ed up family situation",
            "Damn I hope yall stop letting fake ass religion control ur lifes, like seriously. You people marry another man  yall dont know b.c of a fake ass god",
            "I fucking hate arranged marriages.",
            "There may be multiple reasons for her behavior. Maybe she's projecting onto you and is angry that you aren't suffering as much as her. Maybe she's attempting to feel powerful by tearing you down. It's easier for her to place blame on others for her own choices as for some people, they don't want to admit that their own blindness/stupidity caused their own situation.\n\nHer anger is not your fault in the slightest. To keep her in your life would be unhealthy. She may be family, but right now she is not treating you as how family should treat you. Leave her be in silence and let her sulk about her own life choice as this is not your problem to fix. Give her… say about at least 6 months before attempting to reach out to re-evaluate her behavior and if you want her in your life.",
            "She obviously has no place throwing you under the bus when you are blameless here. I'd tell her that it's outrageous for her to be blaming you for any of this. And that what she really needs to do is have a divorce if she is unhappy in her marriage and there's no fixing it, and blame either herself, or her parents (if they coerced her into the marriage) but that you were not and are not responsible for her life decisions, and she can either drop the matter or she needs to leave you alone about it until she's ready to apologise to you and own her mistakes.",
            "There’s no point in blaming her dad because that won’t get her anywhere so she’s upset with you. You have done nothing wrong. Congrats on your engagement and I hope you have a long and happy marriage.",
            "Tell her and help her to get a divorce, if shes unhappy thats all you need.",
            "My husband is kind of going through something like this with his brother right now. He is the younger brother and we met through friends, dated and lived together for years before getting engaged. His brother was pressured by family a lot once we got married, and ended up being rushed into marrying the girl he had been dating. It wasn’t arranged per se but it was definitely a case of her parents spoke to his parents and tada, now you’re engaged! And then they both kind of caved to the pressure. Both families really pushed a narrative that because they worked well on paper (both Indian, both educated, both from similar social strata) love would grow after marriage. Anyway they got married in February this year and were talking about divorce by April. It’s still dragging out now and they haven’t spent more than a few days together since the wedding. Both have a lot of anger and resentment towards their families and each other.\n\nMy BIL is angry with his parents but not with my husband because he’s been the only one in the family to just listen and not push any agenda. He took my husband’s advice to get into therapy and feels that’s been helping. I agree with other posters that your cousin is lashing out at you because she feels safe. It’s likely she has a lot of anger towards her father, but clearly he has too much power over her for her to really face that right now. It sounds like she just feels very hurt and betrayed by everyone. I feel for her, but it’s not your fault.\n\nAll you can do is tell her you’re there for her, and be someone for her to confide in. Women trying to leave bad marriages to abusive people are vulnerable, and even though it’s hard, it’s important you be there for her. Whether she leaves this guy or stays with him, she’s in a precarious position now, and she needs someone in her corner. Don’t let her be an asshole to you but don’t abandon her either.",
            "It’s not your fault. This is happening because she knows she wants to leave but is at the stage of wishing she could go back and undo this rather than facing what she needs to do because it’s hard and means accepting her dad lied to her and it was her dad (and her own fear of going against him) that got her here.\n\nThere isn’t anything you can do except be sorry for her that she’s in this position and wish her all the best / support her if she wants to try and get away (if you’re in a position to help).",
            "Looks like you are the scapegoat for a problem you didn't create.",
            "If she was your friend and she was considering resisting arranged marriage she should have told you. I mean that's how friends trust each other? Sounds like it wasn't that kind of trusting relationshio in the first place so she can't blame you. I am pretty sure her husband doesn't want her talking to you or anyone with nontraditional ideas so she's just trying to make you feel guilty. I doubt he'll let her out at all soon as she's had children. It's between him and her and nothing to do with you. Once you're married, she may try to involve you in her attempts to get away and she's guilt tripping you in advance. Judging by her husband, it could turn out dangerous.",
            "Quoting Big sick (2017), \" You know what we call arranged marriage in Pakistan, Emily? Marriage. Okay? We just call it marriage. \"",
            "Even if  you had arranged marriage would her situation changed . She should have thought about her self and not following what you do  . Its not your fault",
            "Maybe she can use this to find the courage to divorce her abusive husband.",
            "I’m sorry, but this is the most ‘if your friend jumped of a cliff, would you’ reasoning. She clearly had an issue with an arranged marriage to begin with, and decided to ignore her instincts because you were apparently having one. She hadn’t even discussed it with you. Sure, your uncle is very manipulative and domineering, but this isn’t your fault",
            "Can't she just get a divorce?",
            "So her father lied to her and she blamed you?",
            "I don’t think there’s anything for you to do here other than keep living your life. There’s nothing to apologize for because this has nothing to do with you. Your cousin went along with her father’s demands, and that’s on her. Good for you and your mother for breaking out of toxic and patriarchal traditions.",
            "Okay here are the things I noticed here:\n\n1. The whole partiachial thing with your uncle being the *head* and decision maker is completely bollocks. I assume you're from south asia because that's where these kind of family dynamics are accepted. \n2. Also hatred towards *love marriage* is toxic. South Asian society should understand marriage is between two people, not family. I have witnessed how people from arranged marriages got their marriage destroyed and their families either do nothing about it or make it even worse. In most cases, women get the worse hit. So I do not go along that line. \n3. I don't see why your cousin should blame you for her marriage to fail unless you meddled with her marriage. If there's anyone to blame it's your uncle aka her father because he's the one who rushed her into marriage as it was *their duty*. I know how Asian parents think there's nothing worse than a woman remaining unmarried after 25. The problem here is that they think marriage is a necessity when actually it's a choice. People tells me you'll be alone in your old age if you're not married. Well, I have a grandmother who was married and she's all alone in her home because her husband passed away. You'll always be alone in your old age no matter if you're married or not. That's how life works. So she needs to point her finger to her father who probably arranged the marriage without checking what kind of man his daughter is going to live with. \n4. Even if your cousin had a love marriage it still can fail and she has no right to blame you. She is using her frustration on you because in her eyes, you are happy and have freedom to chose a guy of your liking. She must be having angst that she could have a better guy, as I said her father chose a guy without looking further into it.\n\nI would say avoid her for sometime and when she calm down, you can sympathize with her and show that you care for her because she probably gone through a lot from her marriage failure. She needs all the support she needs. I mean you know that as you have seen how your own mother went through. And have a talk with your uncle and tell him he ruined his daughter's life, if possible.",
            "Wow. This entire story is a lesson in why arranged marriage is a bad thing. There's nothing wrong with recommending a partner for your son or daughter, but expecting someone other than them to make the decision about marriage leads to unhappiness and resentment, as we see here. Props to your mom for realising this and not subjecting you to the same. Hopefully your cousin calms down and can find the strength to leave her current awful husband, to find someone who will treat her well. It may be she's just irrationally lashing out due to her own pent up feelings. Hope you can resolve this.",
            "She got married to someone she didn't know and now it's causing issues.\n\nA friend of mine when I was in the military came from a traditional Indian family.  They set up things like family mixers before ”announcing” the marriage.  If the bride and groom don't like each other it became a party.  \n\nHi family had these parties for a year before find someone he liked and she liked him.  They still felt like they arrange it but th couple got a little say. \n\nI thought this was how arrange marriages were working in modern times.",
            "What a Godless mess. Humans like this uncle are evil and worthless, they are folk that destroy lives before they have even been lived. It isn't the way to be a human being. This dynamic does not speak positively to me at all about this \"traditional\" culture where he learned his ways and means.\n\nLove has to come first in life, without that what do we have on our deathbeds? Silly fool uncle will only have unending hell when he is dying, for putting power and cultural/family politics before love. End of little rant.\n\nWish I had advice, but what is done is done. I'd just say that cousin needs to find a way to escape and hopefully then the two can reconcile...while OP reduces contact with all these foolish and wicked \"traditional family folk\" to a bare minimum (well, at least the ones that support and make nice with uncle..they are cowards)",
            "OP, you have to tell your cousin that her dad knew and lied to her about it. And that when she tells him, he’ll most likely still lie to her. \n\nIt’ll be difficult, but for the sake of both your and your cousin’s happiness, y’all have got to stand up to your uncle and families.",
            "A little bit of a tangent here: do your cousin and your mum have a good relationship? I bet your mum could help your cousin get the courage to leave her husband if that's what she wants to do. Your uncle seems very full of himself and clueless that many in the family seem to want to shake up the traditional family ways.",
            "Yeah I’m gunna go on a limb and say this is way above Reddit’s pay grade mostly because I think a lot of redditors are commenting from a place who have *no* idea what/how/why arranged marriages work (myself included) and will make inappropriate calls due to that",
            "So just curious here but couldn't the cousin also get a divorce at this point? She is unhappy and angry at being in an arranged marriage. She could take the steps like OPs aunt did to divorce and find a love match. She did say had she known, she would have stood up to her father about it all so it really isn't too late. The cousin was lied to and manipulated into the marriage in the first place sssoooooo\nLike another person said it doesn't seem the family is too strict about divorce and such since OPs mother got one and the family still speak with her. I think this would be the next logical step in this whole mess. I feel bad for OPs cousin and I hope she can choose the next steps she takes to create a happier life for herself.",
            "What country are you in India? \nBecause if this is not in India then I’m sure your cousin can get out of the marriage easily. Also I understand the pressures of marriage and it’s not your fault you wanted to keep your relationship under wraps. So don’t worry",
            "It's in no way at all, not even in the slightest, your fault.  She needs to blame the right person.  I will say this all sounds insane to me because I really can't wrap my head around my uncle saying anything to my mom about me or arranged marriages in general.  \n\nGood luck and ignore your cousin.  She can get a divorce if she really wants to.",
            "As an Indian, this sounds very Indian to me. Or at least south Asian.\n\nThis is messy because she is obviously very unhappy with everything going on and is trying to find an outlet for all the unhappiness. This is not your fault, neither is it hers.\n\nYour uncle on the other hand....he essentially lied to his daughter. If he is so domineering to you when you aren't even his daughter, I can only imagine what it must be like for his daughter. \n\nYou should have a conversation with your cousin. Even though you owe her no explanation, maybe do explain what happened with the uncle in detail? Try to make her understand how her anger is misplaced. And you should also understand how trapped she must be feeling. She has nowhere to go, does she? She must have been raised in an orthodox environment, tricked into marrying her father's choice, and stuck in a possibly loveless marriage. I would be blaming the whole world too if I was her.",
            "Aww man, I feel for you and the cousin. I understand why you chose to keep it a secret, protect your space and energy at all cost. If you’re both close and you both keep secrets - that’s not a good sign. She’s right though, that if you’d opened up she probably would have had the confidence and courage to strut her own part, she can feel bad about that but she can’t blame you for protecting yourself. Give her some time, she’s still hurt. But also, think about why she’s hurt, there’s probably other girls in your family who will benefit from hearing the truth about your relationship, they too may find the confidence and courage to stand up for themselves. Loyalty and honesty are the bedrock of healthy strong bonds. You gotta look out for the girls in your family sis, even if it comes as a personal cost.",
            "She didn’t have the guts to stand up for herself so she’s blaming you. \n\nShe’s jealous of you and she’s the only one who’s responsible for her situation.",
            "I'm so sorry. This is hard. I'm sorry your cousin is blaming you for her decisions. You are not to blame here, not in the slightest. Please stop questioning yourself. You are in a crazy situation - don't let it dupe you into thinking \\*you're\\* the crazy one.  \n\n\nMaybe write your cousin a note to tell her you love and support her. In person, whisper in her ear about your mother's divorce and second marriage. Remind her it is always a decision to stay or leave, and if she had the courage to stand up to her father before, she has it now. It's possible she could even annul that first marriage (i.e. get it erased from records).",
            "She's being abused and looking for way comfort herself or have some control of the situation she's been manipulated into. blaming you is the safer option rater than the men who manipulated and could hurt her.\n\nI would guess the Uncle turning up that first time wasn't a coincidence, either he had started mentioning marriage to your cousin or had already scouted out the family he wanted her to marry and she was resisting. He need you to ’accept’ and get married probably because you where part of what was giving her the confidence to keep saying no to him. She might admire and respect you and your Mother more than you realise so in her eyes this ’betrayal’ hit hard.\n\nGently remind her you had no part of and no knowledge of your Uncles deception. If you are close then offer her your support as she might well be feeling betrayed, trapped, alone and without options.\n\nYour mother managed to get out with a child is in tow and manages to ignore and defy your Uncle, so it's possible with help she can too. Obviously this all hinges on it being safe for all parties involved.",
            "I am from a muslim family, and I would never nake my sisters nor my daughters to have an arranged marriage if they didn't want to, I don't support it, and I don't like it, even though it would be disobeying my whole family, it's a whole life not iust couple of months, I would sacrifice a lot more than nust standing against them to prove my point.\n\nIf you're close to your cousin you should've told her at least, I don't know what is the relationship exactly between you and your cousin, but you should've done that at least, of course you'renot obligated to, but out courtesy and care you could've advised her not to,\n\nAlthough she doesn't have the right to blame you it's her decision not yours, and the blame is all on your uncle, but now she realizes that tell her to stand against her family and get divorced cause she basically isn't forced to live an unhappy life just because your uncle say so, it's her life and she is in control, marriages is for life, she should take care of herself more, and I can see that she blaming you is coming from a deep frustration, just give her the advice, andI hope everything will go fine for you too",
            "Get married and leave your bio family and never see them again",
            "Your cousin is sad she has no women in the family looking out for her. If she had believed that was you I understand her being hurt.",
            "Yeah, you say you are close but you did not do anything for her.",
            "Why don't you people communicate better.\n\nStop avoiding conversation out of pride and give everyone a peace of your minds. This whole \"arraigned marriage\" shit is fucking horrifying. The rest of your family is casually treating one another like frickin objects. Yikes.\n\nWhy not cut off contact with such toxicity?\n\nYour uncle doesn't deserve to have contact with you or your mother if he's going to continue treating the 21st century like it's the 12th century and constantly disrespecting you and your spouse.\n\nWhy allow him to even _talk_ to your spouse? What...?",
            "She's pissed because she didn't stand her ground and make a decision for herself. I doubt she'll be able to recognise that though.",
            "WOWWWW! Im assuming your family is either indian or muslim? im Indian and i see this in our culture too often. \n\n&#x200B;\n\nFirst thing is, like you said this is NO ONE's business but you and your mom's and dads. For your cousin and your uncle to get involved is absolutely horrible. Everyone wants their own freedom, and anyone who is trying to control someone does not respect that person and what they want. In this scenario i would tell your uncle and cousin respectfully to mind their own business. \n\nTo cousin i would say. \" Hi, i understand that we are close, and the reason i didnt tell you about me and my fiancé is because i didnt want anyone to find out because of how our family is with dating. Also dont blame me for you not being able to take responsibility of your own actions. you can blame me if you want to make yourself feel better, but the truth is your not taking responsibility for your own actions. Believe what you want\" \n\n&#x200B;\n\n&#x200B;\n\nso i want you to reflect on something. If your constantly having to respond to others judgement and opinions for things you want to do in life, your going to be miserable. \n\nMe personally, not matter who it is my brother close family or anything. If you try to control my actions, i rather not have any relationship with you because these kinds of people will always make your life worse, they will never enhance it. your better off not talking to them",
            "She is unhappy that your a secure independent woman who was able to choose a different path than your parents. Rather than confronting her insecurities she is blaming her. She needs to look within not outwards.",
            "Mostly she's just misdirected her anger to a easier target which is you. She may have been pissed intially but I really don't think she realised she just unloaded her pent up frustration on you. \n\nMaybe try calling or texting the fact that you weren't aware that her pops lied. Or maybe you can give it some time before that. \n\nIt seems like she's looking for a scape goat for her lack of courage. \n\nEhhhh.... Sorry incase that was insulting to you or your cousin.",
            "An adult never takes decisions because 'someone else did it'\n\nAn adult never pushes responsibility of their decisions on to others\n\nAn adult puts responsibility on right people.\n\nUnfortunately, your cousin is not an adult. Your uncle did not raise a functioning adult. And when you have a child in an adult body, you're going to have these problems. I feel bad for her too. This sounds like an indian family, coz i am an indian. And i think there is very little you can do here. Most importantly, you should not blame yourself for it, it has nothing to do with you. \n\nAnd as for your relationship with your cousin, i hope it gets better, you should totally support her, if she needs your help, but also be mentally ready that it could be over. And the responsibility of that end is also not on you, but on your uncle, and the whole culture that is surrounding their family.",
            "You don't have to be an emotional punching bag for your cousin just because you found a way to be happy in life.",
            "Uh what.\n\nPhones work both ways, you know? Shes honestly just mad at herself for getting married on your uncle's say-so without even calling you to confirm or talk about it.\n\n>if I had told her I had a boyfriend, she would have had the courage to stand up to her family.\n\nNo, she wouldn't have. She's mad that her life is in the dumps and is lashing out.\n\n>I don’t want this to be the end of our relationship, but I don’t know what I can do to fix this. \n\nWell, it's not really just your choice. Your cousin is coming to realize that the world is not dewdrops and sunshine, you were lucky that your mother was sane, she was unlucky hers wasn't.\n\nYou can always write her a letter, explaining how the family is. It's likely she never thought of it that way. She's only now realizing that critical thinking about what she's told to do can be a good thing sometimes. You can tell her you love her and will support her no matter what she chooses -- be it fix their marriage or get a divorce. Your mom will probably be on your side on this, too.\n\n>Her husband is incredibly controlling and hardly ever lets her go anywhere without him or a member of his family.\n\n...because this marriage looks like it seriously needs fixing. I don't know what culture you're in, but you should have options.",
            "Wow, it's incredible how HER life choices and HER lack of bravery is somehow your fault. Let her sulk.",
            "Not your fault. I really have nothing much to add to the advice other redditors have already said, but I just wanted to tell you did nothing wrong.",
            "Your cousin is being completely unreasonably as her behavior has continued!!\n\nI can understand her initial outburst and can attribute it to her feeling hopeless and lonely in this situation. Many times we are taught that all girls have to face adjustment, controlling behavior, and superiority of husband / in laws. But on learning that you would be entering into a love marriage, she must have realized she would be alone going through this. She probably was expecting you would be comrades in your suffering.  \n\nHaving said that, you having an arrange marriage wouldn't have changed much as she would still be in this shitty situation with her husband. Nothing but her / her parents lack of due diligence is brining this upon her. \n\nShe did the mistake of trusting her parents once. She shouldn't do another by alienating you too. I would try to approach her once; letting her know you realize how difficult this is for her. If you have the emotional BW, do try to support her if she plans to leave her husband. But please bear in mind, you do not share much responsibility here. I understand you might be feeling bad for her.  But that does not mean you deserve the silent treatment.",
            "I smell an Indian/Muslim family.",
            "I am a male and I’ve had an arranged marriage, it’s been 22 years, five children and 1 grandchild on the way. I am far from happy, but I’ve had to make things work. Your cousin is just looking to blame anyone for her misfortune and you are the easiest target. You either have to accept you will probably never have the same relationship again. She may wake up one day and realize she can’t blame her life on you, after all you are doing you, it’s her fault she let your uncle decide for her. I was 15 when I was arranged and married at 16, I wasn’t a legal adult sonI had no choice. Thank God your mom let you choose!",
            "just keep telling her every time she brings it up or is rude to you “sorry but it’s not my fault that I was smart enough to reject ridiculous & oppressive religious tradition and you weren’t”",
            "If you hid this from her just so you can have the easy way out. You're in no means wrong as it is your life but I would hate being related to a person as selfish as you.\n\nYou basically assisted your uncle in a tradition you strongly despise. Arranged marriages work but sometimes they don't - you could have used your mother as an example. You could have chosen to stand up for your cousin. You chose not too.\n\nYou only care about yourself & that's what she's mad about. Lies & Manipulation - that's what she's mad about.\n\nThe demise of her marriage is obviously on her and her choice. She chose this life - actually - her culture/tradition chose this for her.\n\nSo while she can't blame you. You're not a saint either. You were so *close* to this cousin - You chose the easy way out. \n\nWhat you can do to *fix* this? - Ask her to meet you over coffee and discuss your culture/traditions and analyze your actions and be sympathetic. Ask her what she *wants*.",
            "Is this in India? This sounds like it's in India.",
            "Are you living in a Western country?\n\nYour cousin should never have agreed to marry a guy she did not want in the first place.",
            "NTA. The one who made her go for an arranged marriage is her father and she herself agreed to it. I think she is just trying to blame anyone/anything for her own problems. If she was more strong willed, she could have gotten a divorce and started over at 26.",
            "This is partly why it's so hard to make friends with Indian people sometimes.  They seem to be such a rigid and closed off community.  In any case, I encourage you to follow your heart and happiness, not others' outdated expectations.",
            "So what take from that is she would accept the exactly circumstance she is in now as long as you also had to endure a shitty marriage as well? She may be your cousin, but that's not how a true friend would behave. She is jealous of you because unfortunately she didn't have easier parents but you had. She needs to fight her own battles and not blame you for not being able to do it.",
            "What? Did she sign a contract or something? Just say no and that he lied to her. Unless she's at risk of physical violence I don't see why this doesn't work.",
            "No, no, she says she would have stood up to her father if she’d known? \n\nAbsolutely a lie, no, she has never stood up to him, not even once.\n\nShe’s mad at herself for her own weakness and is just jealous of your strength.\n\nEdit: a word",
            "It was said in a very, very bad context (Hanns Johst was described as \"the poet laureate of the Nazi Party\" and his play Schlageter was a celebration of the Nazi's rise to power premiered on Hitler's birthday) and also in a very different sense of the word \"culture\", but nonetheless: \"When I hear the word culture ..., I release the safety on my Browning!\".\n\nCulture (aka \"peer pressure from dead people\") is used to excuse abuse.  It is constantly claimed that we degenerate westerners should admire the \"strong family values\" of some other cultures.  \"Strong family values\" means treating women as disposable property, little more.",
            "Oh wow.. I would absolutely love to rock the boat here. Like, on your ceremony when you have the whole audience and your vows start with \"When I met you 3 years ago...\" shocking faces everywhere! \n\nJust an idea... really tho I would be the pillar that your cousin leans on. She's lashing out and you are in the right to not be there for her if its too much but if you still want to lend her a hand then do it. Let her know you're waiting for her to talk with you and not at you",
            "With that attitude of your cousin I think she is the one not putting in effort in her marriage, she married the person out of bitterness and now blames her situation on you.tbh just cut contact with her . She is the type of person to blame everyone instead of coming to terms with reality. Your uncle was afraid that you might inspire his daughter to rebel ,but she should have never based her life decisions copying you . Just point to her either she comes to terms with reality and make her marriage work or get the courage to divorce (close to impossible in Indian marriages) but tell her in no way are you going to take the blame for her decision.",
            "What race are you and your husband if you don’t mind me asking"
        ]
    },
    {
        "post_id": "ubyqk3",
        "author": "lost-in-my-thought",
        "title": "*UPDATE* My(22F) boyfriend(21M) has a marriage material best girl friend(f20), which I find to be odd, how to approach this?",
        "url": "https://www.reddit.com/r/relationships/comments/ubyqk3/update_my22f_boyfriend21m_has_a_marriage_material/",
        "score": 3541,
        "num_comments": 126,
        "created_utc": 1650929660.0,
        "selftext": "I finally dumped his ass over text (I would normally do it in person but I did not want to be gaslighted again) after he literally changed our whole group activity plans because of his \"marriage material\" best girlfriend and proceeded to yell at me for not hanging out with him because I had prior plans which I invited him to as well. He tries to gaslight and manipulate me and I'm not taking his shit anymore. He is absolutely in love with her and I hope one day he can come to terms with his feelings just leave me the fuck alone. I'm not a sidepiece or seat filler. Thank you all for your feedback.\n\ntl;dr: original post : [https://www.reddit.com/r/relationships/comments/u3k2f0/my22f\\_boyfriend21m\\_has\\_a\\_marriage\\_material\\_best/?utm\\_source=share&utm\\_medium=web2x&context=3](https://www.reddit.com/r/relationships/comments/u3k2f0/my22f_boyfriend21m_has_a_marriage_material_best/?utm_source=share&utm_medium=web2x&context=3)",
        "permalink": "/r/relationships/comments/ubyqk3/update_my22f_boyfriend21m_has_a_marriage_material/",
        "comments": [
            "Way to stand up for yourself!! When I was 22 I would have let this drag on for another 2 years. Good on you!",
            "That'll be very funny is that \"marriage material\" best girlfriend keeps him a friend forever and not boyfriend/husband  - Either way, no longer your problem nor situation. Hope you find a new man that wants to be with  you for you, not as placeholder nor a substitute.",
            "Good on you choosing yourself",
            "As a boyfriend, you don't ever say your best friend is \"marriage material\" to anyone, much less your fricken girlfriend. He probably liked having her as a side option like a \"just in case\" kind of deal. \n\nNone of that is acceptable in a relationship and I'm glad you got OUT! I'm glad you're respecting yourself the way he should have.",
            "Good for you!  You deserve happiness and to be the one for someone.",
            "Cue incoming post on 2XC from the best friend commiserating about how her so-called \"best friend\" blew up on her before her wedding to reveal that he was only her friend all this time because he was expecting to date her in the future. \n\nOP, your boyfriend's attitude was super unhealthy. If you're comfortable with her, you might give her the heads up. She may or may not believe you, but at least you tried.",
            "Does she know he considers her marriage material?  She's 20, she's probably ready to go off to college and get on with her life not be mom to his future kids.",
            "Good! Don't be any dudes plan b",
            "Lol “marriage material” yet he can’t even commit to his own girlfriend. You deserve and will do much better than him.",
            "I hell yes girl, free yourself up to find a real man who respects the relationship and you.",
            "He doesn’t sound like boyfriend material let alone marriage material. Glad you ran away from the crazy town!",
            "yay! i hope you blocked him",
            "just want to say i had a similar situation when i was younger. bf had a best gf who he previously dated before me. they all went to highschool together. they always hung out in a big group w a bunch of guys and always excluded me if she was there. i was only allowed to come if its just me and him or him and just a couple of his guy friends. He would always say its a guys night but i would find out that she was there too like she is one of the guys. but i just. knew that something didnt feel right.  your gut feelings are usually right. He ended up marrying her and what am i supposed to make of the time i spent w him as a gf. i felt v disrespected and used. good riddance girl you deserve better. those kind of selfish people have their karma coming back to bite them.",
            "Good for you for getting free of this immature and manipulative child. Do not let him dictate where you spend your time. If you want to hang out with that group- go for it. His discomfort is his own problem, not you or anyone else’s.",
            "👏🏼👏🏼👏🏼👏🏼 proud of you for knowing your worth!",
            "Good for you!!! Find someone for who YOU are their dream girl!",
            "You have your shit together lady! You’re going places, congratulations. I hope you find someone who appreciates you fully :)",
            "He is most likely aware of his feelings, he just gaslighting you.",
            "Good for you. A lot of men our age are so unbelievably out of touch. He probably won't change anytime soon, I'm glad you stuck up for yourself.",
            "Why on earth are so many young Americans obsessed with getting married,...at bloody 20??!! I never realised how overall obsessed with marriage, children and religion Americans are until I joined Reddit.",
            "Good for you! Thumbs up!",
            "First off, we're all proud of you for knowing your worth.  Go do all the things that you wanted to do, but didn't, because you were his girlfriend.",
            "Curious for yet another update, to see if the bestie dumps her boyfriend or vice versa. Good for you, OP.",
            "I didn’t see your first post but so glad you dumped that guy! My best friend is a guy and I can’t imagine in a million years either of us describing each other as “marriage material” how weird and gross of your ex to do that!! Good for you knowing your worth!!",
            "Congrats on choosing yourself, I don't think many of us could have done the same at your age!",
            "huge red flag. props to you for leaving, karma will do him justice, it will come i promise. in the meantime, find someone better.",
            "I’m proud of you, change is difficult. You will grow and learn from this.",
            "Congrats. It will suck for a bit at first but you are way better off!!! You are nobodies backup plan or seat filler",
            "You’re awesome! That is a very weird dynamic, for sure, and I love that you were able to get out of this situation without years of drama. You knew what you had to do and you did it! Good for you!!",
            "Good on you for standing up for yourself. You deserve respect, and your BF was disrespectful and abusive. Strength and healing to you.",
            "It’s so satisfying to see that he got dumped and this “marriage material best friend” will probably never see him as anything more than a close friend. I wouldn’t be surprised if he actually makes her uncomfortable, especially if she knew he was just keeping her around bc he’s interested in her. If she wanted to be with him, she would’ve done it by now. Good riddance!",
            "Good on you for doing what's best for yourself",
            "Super proud of you for dumping him!!! Congratulations ❤️",
            "Nobody aged 21 is 'marriage material' lol.\n\nYou're well out of there.",
            "Ew how gross on so many levels. Calling someone marriage material is vile and dehumanizing for one. Bullet dodged IMO.",
            "Bet you that girl and her bf will be broken up real soon",
            "I’m so so deng proud of you, now keep him out of your life",
            "Sounds like classic attachment/abandonment. You are afraid of losing him to this person you feel threatened by.\n\nYou could explore why you have those fears and shared with him what he could do to help you feel secure, but instead it sounds like you blamed him for your fear and let fear control you. \n\nYou have the option to reflect and hold yourself with integrity.",
            "Dumping someone over text when neither distance nor safety are a concern is real mature, but glad you're doing you I guess",
            "[removed]",
            "I’ll put in my experience here. I had a friend who I really clicked with. I was in a relationship, very faithfully I might add. The girlfriend I had, was manipulative. I cared deeply for her. When I met that friend, it was at a party me and said girlfriend threw. The friend was actually a coworker who had just started at the company. So outside of work in a party environment we instantly got along and she was extremely cool. I absolutely love talking with people and having a good joyful good natured time so when she (and her girlfriend) arrived I as the host invited them in, and we instinctively had this awesome handshake that we made up on the spot effortlessly. I the point is, I got along with this person 100% as friends and it was absolutely a great feeling because she was so honest. My (at the time) girlfriend told me the next day, I wasn’t allowed to speak to that person again, because I was “flirting” I listened because I cared deeply for her. I’ll never forgive myself for that. I let that girl down as a friend and I let myself down. I’ve never found someone who felt so real and so quickly to be such a trustworthy cool person. \n\nSo the point is, in my eyes a healthy relationship demands allowing freedom. Telling someone they can’t be friends with someone else because of jealousy, is absolutely unforgivable to me now. It’s selfish.\n\nEdit: if you are in a relationship where you don’t trust the other person, leave."
        ]
    }
]