[
    {
        "post_id": "bsmrxg",
        "author": "laurield",
        "title": "[UPDATE] My (26F) father (55M) contacted me out of the blue yesterday after 13 years. He wants to reconnect. Is it worth even trying?",
        "url": "https://www.reddit.com/r/relationships/comments/bsmrxg/update_my_26f_father_55m_contacted_me_out_of_the/",
        "score": 3459,
        "num_comments": 191,
        "created_utc": 1558734445.0,
        "selftext": "Original post: https://www.reddit.com/r/relationships/comments/brh5h8/my_26f_father_55m_contacted_me_out_of_the_blue/\n\nHi all,\n\nThought I would update you on what happened since my last post. And I want to thank everyone again for all the advice, it really helped me make a decision.\n\nSo, I decided to email him back, to try and find out why he was coming back now, after all these years, out of nowhere. And oh boy, am I glad for not having jumped all in...\n\nInstead of telling you guys what happened, I think simply translating the emails (with all names redacted of course) will make it much easier to follow. So here we go.\n\nHere's the email I sent him, in response to his first messages to try and reconnect. Not a very nice email, I know, but I wanted to see if he had really changed and if he was actually ready to apologize or at least recognize what he'd done wrong.\n\n- - - - \n\nHi,\n\nEmail not easy to read (nor write). Just trying to be honest here.\n\nI don’t have an answer to give you yet, I’m thinking about it, I can’t get past 13 years and tell myself “let’s forget everything and start from scratch” in 2 days. I need to think, given the situation.\n\nBut I do have a question for you – why now ? Your answer won’t influence my decision, I just need to understand. My first reaction when reading your emails was \"is he dying ?\". Try to understand, 13 years with no contact and I receive this on a Monday morning, out of the blue, it brings up a lot of questions in my head.\n\nAnd it’s not like nothing’s happened in these 13 years. Maybe it would be easier if that were the case (or maybe not, I don’t know).\n\nThe last I heard anything about you, via other people, was 2 years ago when gran was ill. 2 years. That’s not long ago, and I’m still recovering from that period. The last 2 years may have been the most difficult years of my life. 2 years of depression, thinking about gran every single day, being mad at you for not contacting me, hating you for not even telling me when the funerals were gonna take place, and because of all this, I won’t ever be able to get closure. And yes I also have some blame in there, don’t think I haven’t been mad at myself during the last 2 years as well. I will be mad at myself, and at you, probably my whole life, this story is not something I will ever be able to just forget.\n\nTrying to reconnect at that time, 2 years ago, might have seemed more logical to me. When a family goes through this kind of thing, with a family member very sick, they have to get closer to each other, around that family member. At least, that’s what I thought. But instead, I had people telling me you got angry at them for just letting me know gran was sick. Like I didn’t have the right to know about it ? At that time, it seemed very clear to me that I wasn’t part of your family at all, and that you wanted me to stay as far away as possible. I felt your hatred, which I never managed to understand.\n\nWhatever happened between you and me, I’d always hoped, until then, that if whatever happened for gran, I would receive a quick email, or a message on FB, anything, just to let me know what was going on. But no. So I’ve had to try and grieve gran without being able to say goodbye, and I’ve had to accept the fact that my dad wanted nothing to do with me. It’s far from easy, hence 2 years of depression.\n\nAll the arguments around money, the stories between you and mom, or even the stories between us and [new wife], all of that is very old for me. So old that today, I can’t remember everything that has happened. So it could be easy to forget about these, if there was all there is to it. But what happened with gran is something I am still feeling today and is much harder to get past.\n\nSo yes, my question is, why now and not 2 years ago ? I will wait for your answer.\n\nI know reading this email can’t be easy, as I said before, it was far from easy to write as well. But if you truly want to reconnect, on my end I need to understand before I make any kind of decision. \n\n- - -\n\nHe then replied, and his email made me the angriest I had ever been before. Since my following reply includes his whole email (I replied inline), I'll just paste my reply and you'll have his email at the same time. Here goes.\n\n- - -\n\nHIM: Ok, let’s be honest and speak freely : let’s talk about gran, poor her, my she rest in peace. I think your relationship with her was more than occasional and that at one point, she got tired only of only being contacted for your birthday,\n\nME: >> So already here, no. Just, no. My relationship with gran was very good at the time. I was at Uni and I would go spend the weekend at her place very often. We would play Yams, I would make pizzas, etc. I have lots of good memories of that period. So, no.\n\nHIM: that’s why the last years of her life she had cut contact with you (yeaah, still a money argument !).\n\nME: >> And no again. I remember perfectly the last conversation I’d had with her. I was calling her to tell her I just passed my License Degree. And she was mad after you told her that we had apparently “stolen your money”. And she just hung up. So no, I am not to blame here. You’ve taken enough from me, I won’t let you tarnish my memories of her.\nAnd what you probably don’t know, is that she asked for my forgiveness, when I went to see her 2 years ago. She knew perfectly what happened, and knew I wasn’t to blame in the story. So, just, no. When I went to see her at Uni, I would always try to avoid talking about my relationship with her, to try not to make her sadder that she already was. While on your side, you decided to bury me and break my relationship with her. So if someone is to blame here, that’s you, certainly not me. MY fault, was to accept it without saying anything, and not trying to reconnect after a while. And yes, I blame myself for that. But for everything else, you’re gonna have to wake up at some point and accept the consequenses of your actions.\n\nHIM: By the way, quickly on the side, not having any contact with me, ok, but why did you cut ties with [new kids], they didn’t have anything to do with the situation, [new wife] has always felt really affected about this.\n\nME: >> I wasn't against them. But you lived together. If they’d tried to contact me, I wouldn’t have said no, far from it. But here again, you’re putting all the blame on me, that’s quite easy.\n\nHIM: Getting back to gran, indeed, I didn’t warn you when she got sick, nor when she died, because, and I’ll be perfect honest here, I imagined you coming out of nowhere, without warning anyone, without having taken any news from her for years, and I imagined you coming to do the inventory.\n\nME: >> Funny, that’s EXACTLY what I told [gran’s best friend] at the time. It’s crazy how you’re turning the situation around to your advantage. Let’s be clear, right now. I DON’T GIVE A CRAP about your money. And when I heard about gran, no, I wasn’t the devil you created in your head, I just wanted to see her, for me, and for her. NO SHITS GIVEN about the f***ing inventory. If that was what I cared about, no need to go see her, I could have just found you or taken a lawyer. \n\nHIM: It’s because you cut ties with gran that I didn’t want you there and that I didn’t try to reconnect back then. We were very shocked at the time, with gran’s best friend, about the way you acted. So no, it was absolutely not a question for me to try and reconnect with you then.\n\nME: >> The way I acted. Nobody thought that maybe, just maybe, I needed a moment to process what was going on? Years with no news, and the whole situation gets thrown at me out of nowhere, with no warning. When I received the FB message, 2 days later I was on a plane to go see her. Afterwards yes, I took too long to call her again when I got back home. And yes, I blame myself for it. But here again, it’s very easy to paint me as a devil, without having even tried to understand what was going on in my head.\n\nHIM: To answer your question, « why now », well I’m asking myself the same. It’s been weeks, months that I’m thinking about it and I’m trying to let my heart speak instead of my brain.\n\nME: >> Your heart ? Seriously ? I don’t see anything in this email that shows me you even have one.\n\nHIM: And at the same time, if I didn’t do this, would you have done it ? I’ve gone through my past, persuaded myself that I needed to stop banging on about my resentment towards you which also had consequences on your sister who didn’t do anything.\n\nME: >> Here congratulations, this is the best I’ve heard all year. So you’re basically trying the blame the fact that YOU cut ties with her, on me. I must be dreaming. Nobody ever prevented you from taking her on weekends or during holidays, when I decided to stop coming. By the way, legally, you HAD to continue seeing her. But no, you’re right, that must be on me again !\n\nHIM: It’s not only during « grand happenings » that you’re supposed to get news from your family or try to reconnect. By the way, I am to blame regarding your sister, for not continuing to reply to her messages since 2008. \n\nME: >> Oh, wow, you’re actually accepting part of the blame. It’s gonna snow.\n\nSo, to recap your email :\n\n· You have absolutely not changed one bit. You stay the manipulator you were 10 years ago.\n\n· You are a First Class mythomaniac. You’ve invented a diabolical version of me, your daughter, and truly believe your own lies.\n\n· Obviously, you’re pushing all the blame onto me (why not, after all, I am a devil who wants to take all of your money).\n\n· And, of course, you’re not apologising for anything.\n\nSo my answer is an absolute no. I officially do not want anything to do with you anymore. If at your age, you still don’t realise that the life you invented for yourself is a huge mass of lies, sad for you, but on my end I will continue living, knowing you once and for all out of my life. I managed the last 10 years, I will live even better now that this whole thing is finally over. So, maybe, thank you! Thanks for proving to me that I was right about you, and that I shouldn’t spend even 1 more second thinking about you. My goal with yesterday’s email was to see if you had changed, I have my answer.\n\nDon’t even try to reply to this email. I am blocking you, and if that doesn’t work, I will simply delete every single of your messages when they come in, without reading them. I won’t give you the chance to explain yourself, you just did, everything is clear as day on my end now.\n\nI’m going to bring back a sentence you sent me years ago, when I had tried to reconnect. You said “if for you, I don’t have a wife, then I don’t have daughters anymore.”. Well today, I am telling you : if you don’t have a daughter, then I don’t have a father anymore.\n\nDo not EVER try to contact me again. I hope that is clear. Not tomorrow, not a year from now, not even on your deathbed. For me, you died today.\n\n- - -\n\nAnd there we go! Yes, I know, I've been downright nasty. But honestly, I think I needed to get it all out. After reading his email, I felt like I was going to burst out in flames, he reaaaaally pissed me off.\n\nAnd I feel so much better now. It's like, maybe I needed to push all my anger out, to feel 'free' in a way. I don't know how to explain it, but I feel so much lighter now, I haven't felt like this for years.\n\nFeel free to comment of course and let me know your thoughts on the email exchange. And again, thank you all so much for the support. I wouldn't have managed to do this without you guys.\n\nTL;DR: I replied to his email, telling him how I felt about the whole thing and especially about my gran. I wanted to see if he'd changed. He very much did not.",
        "permalink": "/r/relationships/comments/bsmrxg/update_my_26f_father_55m_contacted_me_out_of_the/",
        "comments": [
            "I'm sorry he brought up these old wounds and tried to make it your fault.",
            "all the internet stranger encouragement to you for staying strong.",
            "You responded far more than I would have. He kept trying to push buttons in each response. When you responded and disproved what he said, he'd change topic and throw something different at you. \n\nDoesn't seem like there is anything worth talking to him about from what I see in those messages. You're right to block him and move on.",
            "I skimmed over your first post and more fully read this one and the conversation between you and your father. While I don't have much advice, I will say that I cut out my father going on two years now and I've had a much happier life because of it.\n\nThe messages between you and your dad reminds me so much of me and my father. My father is a narcissist who is the definition of the narcissist's prayer (if you haven't read it, I recommend googling it). I know it was the heat of the moment and I've had nasty conversations so similar to what you just had with my own father, but realize that conversations like this will just give your dad fuel for the image he wants to paint of you.\n\nThere will be no convincing him about who he is and what a shit dad he is. He's not going to realize that he's not apologizing for anything and he's not going to realize that he's a mythomaniac. All he's going to see is that you're attacking him when he reached out with an open heart (that's the way he'll spin it to everyone else). You are totally in the right and it feels good to get it all out. But if he ever approaches you again, just walk away.\n\nYou're doing great, girl. Keep living that great life of yours without him in it.\n\nEdit: Spelling.",
            "You weren’t nasty at all. Like, your restraint and ownership of your own faults was very healthy.",
            "You really called him on his bullshit. And I don’t think you were particularly nasty in your exchange. He was a total asshole, of course.",
            "🤜🤛 right the fuck on. good for you.",
            "Sending you a cyber hug.\n\nHe sounds a lot like my bio father, trying to blame 4 year old me for his actions. Except he tried to use Bible Scripture to justify his actions.I also cut off contact with him.",
            "Fuck him. Well done.\n\nYou weren't nasty. You were HONEST and forthright. You laid it all out, plainly and truthfully. He continued to be a lying sack of shit.\n\nI'm sorry you had to do this, but I sure am glad you did after reading your ordeal!",
            "This honestly sounds like my father. Sending love.",
            "Eww, gross. What a POS he is! Your reply to him was very logical, and I hope it was cathartic...but I think you know that \"logic\" won't even make a dent in his skull. He'll read your response and twist it around in his own mind to confirm everything he already thought about you. That's OK, though. You're done with him, and if you follow through with deleting future messages without reading them, you'll never have to deal with him again.",
            "> For me, you died today \n\nBOOM! Mic drop. Fuck him. Your life will be amazing without him. I’m sorry he resurfaced these old wounds; however, I think this closure will really help in the long run.",
            "Good for you!  Your father doesn’t deserve you as his daughter.  Or your sister.  He’ll live to regret this.  But at least you can now move on and have peace.  I understand as I did the same with my family.",
            "You did amazing. It was hard to read the disgusting ways he twisted the situation to make himself the hero and you the villan, so I can't imagine how hard it was for you. I hope you ate able to put this unfortunate waste of dna behind you and move forward :)",
            "This could have been my dad, new wife, new kids and he let her cast us out while blaming us for standing up for ourselves and later finding excuses for everything and never taking responsibility for anything...  \nYou did well,  it must be therapeutic in some way to write all this down, we don't owe anything to toxic people even they're family.",
            "People always talk about giving family a chance. Those people don't have experience with these type of humans. \n\n\nWhat an absolute waste of a human being. You are far better off not having to deal with this person again.",
            "DARVO. Deny, Attack, and Reverse Victim and Offender.",
            "I'm sorry it turned out this way, but I absolutely think you're making the right decision. Now take some time to process the feelings the situation has stirred up, then close this chapter of your life. It's awful when we don't get the loving parents we need. \n\nHe seems very fixated on money, and not much else.",
            "You were't nasty, he was.",
            "I hope you're doing ok. The whole thing was skewed, he was acting like you had an equal weight in everything while neglecting that he is the dad. It's not on you to constantly look to build bridges, to salve old wounds. That's his job, hes the dad. He was putting you down for not doing the job that he was tasked to do when he made you - to be there, unconditionally. Blaming you for not fixing his mistakes is the move of a man who will never face responsibility. Everyone makes mistakes, but it's how you react afterwards that determines your worth. You are better off without him, and I hope you can heal and move on. Wishing you the best",
            "I have a similar story of neglect from my dad, him lying in court to get out of child support, prioritizing his new family over me, and then blaming me for ending visitation at 14. He always wanted to \"start fresh\" and blamed me if I ever asked to talk about the past. Wouldn't pay for me to fly home for either grandparent's funeral. Didn't tell me about an aunt's death.\n\nWe didn't talk for 10 years then he contacted me wanting to apologize. I gave him a chance but his apology was \"I'm sorry you felt that I wasn't a good dad\" etc. No actual apology. \n\nI struggle with if I should ever give him another chance and if I'll regret not having any contact him when he dies. I still don't know for sure but he's been out if my life for longer than he was in it and I'm doing just fine.\n\nI had to give myself time to grieve for the father I never had. He never was and never will be the TV dad I always wanted. I cry like a baby during Jack's scenes on This Is Us. Family has to be earned, blood or not, and I've surrounded myself with people that love me. I don't need to add a shitty person to that mix.\n\nI hope you can let go of the sadness he's caused you and realize his support or lack of support doesn't define you. You are wonderful and don't need to waste time convincing him of that.",
            "You are a fucking superstar. Kept your boundaries and stood your ground and called him out (clearly and politely) for being a shitty manipulative delusional victim. (lol how is any of this your fault at all?! Talk about scapegoat). Seriously that is no small feat, so many are terrified to do that ‘because family’ 🙄  good shit!",
            "Nothing worse then a father who’s half there or barely there. Might as well stay gone and never make contact. My dad likes to contact me every few years and asks me why I never call him or try to find out where he is when his phone is turned off. Still talks crap about my mom and blames everyone for his problems. I used to defend him but now at 30 years old, I just don’t have time for it. It’s honestly up to you. Listen to your intuition and go with what your gut tells you to do.",
            "You absolutely nailed that response, and I'm so sorry life gave you this shitstorm of a dad. I'm glad to hear it sounds like your mom was able to love and parent properly, I hope she is well. Call her once twice a month if you can manage :). You have many great things coming your way, the way you're able to set boundaries and possess self-awareness. Keep taking care of yourself. Many interet hugs to you, awesome stranger. Thanks for sharing your story, it will help others.",
            "I'm 23M, this reminds me a lot of my father. Likewise we do not talk for a lot of the same reasons.",
            "This man is a toxic mess that does not know how to feel things normally.\n\nDon't ever look back. My positive energies to you.",
            "How bizarre that you're to blame for not contacting his step kids AND for him not contacting your sister!! \n\nHow did you manage to control so many people as a child OP? It's amazing /s.",
            "I cannot tell you how many messages like that were exchanged between me and my nutjob father-shaped-substance before I gave up, told him I wasn't gonna read any messages from him and really did delete everything he sent befire reading. Got glimpses of the bullshit from what he sent or told my sisters but I've been offjcially free since my grandfather died 2 years ago . Actually, since about two months before. He was one of the few people in the family who wasn't crazy and cruel, and I weren't on his deathbed because I finally realised I can't deal with one more day of the mindfuck. He didn't recognise anyone at the end anyway. I don't feel guilt over this. I know BECAUSE he was decent he wouldn't hold it against me. I wasn't at my grandmother's deathbed either, because at the time I wasn't speaking with them. She was a piece of work like her son but she did raise me and my sisters. I wasn't speaking to them then but reconnecte with father and grandfather latee because I thought \"well maybe he's changed\". She died about 10 years ago. I never felt guilty. I felt stupid for reconnecting and exposing myself to the mindfuck after she died, but at least I got to spend some time with the grandfather when he was still lucid.\n\nBoth of them sided with the father when he was leading his hate campaign aginst my mother. I realised too long after that that my time was a privilege for them. NOT something they deserved just because they were faaaaamilyyy. Even grandfather, as good a man as he was. He made his choices and I made mine.\n\n\nI hope you see it one day. Your grandma had just as many opportunities to reconnect as you did. She was aware enough to ask your forgiveness. She would NOT blame you for not picking up the phone and calling her a week earlier.\n\nGood luck.",
            "Ooof. Being right is sometimes a cold comfort... but good for you, Op. What a piece of work that dude is. You made the right choice.",
            "You weren’t nasty. You spoke your truth and told him what you needed to tell him. \n\nThink of it like a good poop. Felt good to get it out, now you can flush it and go on without all that percolating inside of you.",
            "👏👏👏\nYou just stood up for your younger self. You did what what your parents should have done, and protected yourself. Well done.",
            "I can’t help but feel that OPs dad was looking for her to say a certain phrase: yes, I cut ties with Gran. \n\nI think OP is spot on and something about this has to do with money and inheritance. \n\n\nOp- I’m so sorry this has happened. I’m so sorry your father is such a tragic POS, and you are so amazing for accomplishing what you have in your life. You deserve so much better. \n\nMay things only get better for you. Sending you love and hugs.",
            "I cannot even imagine how difficult this was for you to write. My husband has been estranged from his father for three years now and he still wrestles with if cutting complete contact was the right decision, if he should have given him (another) chance, and the slew of other things that go on when you become estranged from a parent.\n\nHe dredged up painful things and tried making you the perpetual devil and himself the perpetual victim, and I'm proud you were able to see through. You've been a great person for your mom, your sister, and your Gran, regardless of whether you should've picked up the phone. You were hurt, angry, and confused, I wouldn't beat yourself up for not calling sooner.\n\nYou have closure to move forward and never regret, rethink, or wonder \"what if\" and that's the best gift he could've given you. You have closure, peace, and freedom... enjoy it!",
            "Wow....as a parent I can't imagine ever cutting off either of my children no matter what.",
            "go for the jugular and tell him you look forward to the day you can piss on his grave. \n\nhe seriously deserves it. The guy is a scumbag. Its what I would do. It would make me feel better.",
            "From the vocabulary I think I’ve guessed what language/country this is happening in, and let me tell you, finding in my head what the original sounded like makes my blood boil for you.\n\n“Je te voyais faire l’inventaire” is the most cruel, insulting thing you could imagine. He is low. He is a horrible crazy person and none of this is your fault. \n\nLiterally not one bit. Please go on to an amazing life without this shitstain. Many many many internet hugs.",
            "YES!!!!!! I was grinning starting about halfway through your responses. About 3/4 of the way through I was positively *smirking*! At the end I damn near woke my husband stifling that YEAH!! \n\nYou fucking **go with your bad self**!!!!!",
            "> He wants to reconnect. Is it worth even trying?\n\nno.  /thread",
            "I feel like I am reading my past",
            "What a champion response.",
            "I'm sorry this jerk came out of nowhere to try make you feel miserable again. He sounds a bit narcissistic. I hope you're doing better after letting him know your feelings. \n\nI'm still curious which organ he wanted, though...",
            "I'm so happy you put him in his place and are blocking him. No matter his rage and narcissism he can't do shit anymore and doesn't get the last word. I am SO proud of you. Reminds me of the messages I sent my own \"dad\" before I blocked him as well. It isn't easy and you may still hold on to a lot of the pain and resentment and onto the image of a fantasy family, but cutting out this toxic part of your life will be such a huge relief and give you genuine peace.",
            "Hey I don't think you were nasty at all.  I don't blame you for how you feel.  I can relate similarly to you.  My dad left me, my mom, and my 2 siblings 2 years ago and I'm battling that same depression.  He's just like yours and puts blame on everyone else but himself.  Except, my dad still communicates with me and tries to keep playing the mind games and keeps trying to manipulate me.  I wish you the best, and again, I think you handled the situation perfectly, you showed a lot more restraint than I would.",
            "He’s not your father. He’s a tissue donor.",
            "Jesus your dad was a piece of work. \n\nHe sounds a hell of a lot like my mother in law (check my post history for some highlights. A few posts in JNMIL detail some things). My wife is currently not on speaking terms with her after situations much like you just found yourself in. No matter how calm, collected, and fact based backed by actual evidence, you can't get through to people like them. It sucks, it's infuriating, and it makes you want to bash your head into a wall, especially because you're trying your damnedest to hold an actual conversation when all they want to do is talk at you about how wrong you really are without taking any responsibility for their actions. \n\n\nThe thing that bothers me the most about your and my wife's situation, is that let's say that you are the \"bad guy\" in some sense of the word from when you were younger. Even if you were, you were still a child. They're the adult. They should act like one and be the bigger person, and they fail to do that time and time again, treat you with disdain and refuse to attempt to understand where you're coming from. \n\n\nI think you are doing the right thing, and stay strong. Remember how mad you are right now. Unless he goes through some intense therapy, there's no way he's going to accept any blame in all of this. You are making the right choice. Cut him out. He doesn't deserve your time, let alone your love. You've got this, stay strong, and honestly, reddit as a whole is a great place to just vent these frustrations from time to time. Someone is always willing to lend an ear.",
            "That  hurt to read, I'm sorry. It's like he just reconnected to blame you? Out of what? Just wow. I understand why you burst out in flames, that's only hurting. I really hope you feel better now!!",
            "You did good. That was festering for a LONG time and you punctured it and let all that pus out. I'm so glad you feel lighter and freer. Go live your best life and eff him! He is missing out on a wonderful, amazing daughter! <3",
            "Wow, unfortunately I can relate to this all too well. \n\nNearly everything you've gone thru is the same as myself and my siblings. My mother divorced my father (who was VERY abusive), he remarried, had two more kids and did everything he could to pay as little child support as possible. Because he was self-employed he was able to hide a lot of his income and when it came time to send the checks, he had his new wife in charge of mailing them, which she conveniently *forgot* to do month after month for years. \n\nI was 6 six years old when they divorced, and 15 years later he still blamed ME for not choosing to live with him after the divorce! He conveniently forgot that he didn't come to see me or my brothers or sisters for YEARS after the divorce, despite him living just 15 minutes away with his new family.\n\nA lot of happened through the years and he NEVER took responsibility for any of it.\n\nHe put the final nail into the coffin that was our relationship 5 years before he died. \n\nI received word from family members that he was dying two years before his last breathe. For me had died five years before that last breathe. Did I go see him? Did I go to his funeral? No. I and my brothers and my sister spent decades trying to build a relationship with him while looking past an enormous amount of hurt he inflicted on us. Time after time it only brought us more pain and disappointment. We wanted a Dad. But it just wasn't meant to be for the five of us.\n\nEdit: a word",
            "Your father won’t realise that he IS the problem, even though you said it in the most direct way possible. He isn’t worthy a single breath of yours, and i am proud of you that you stayed your ground and said what needed to be said.\n\nI hope you can heal in regard to your gran. She loved you and you know that. And as Long as you want, she will be around you every single day.",
            "God this was triggering for me because that's EXACTLY how my nmom would have replied. Twisting everything, trying to guilt you with things that aren't even true, etc.\n\nI'm so sorry you dealt with that but it has to be at least a bit validating to know that nope, there's no relationship to be had there. He has his own reality and it's not one worth dealing with.\n\nFair warning: because things have been dredged up, you may go through a bit of a mourning/processing period once the happiness of feeling free again/getting to tell him off wears off.",
            "I'm so glad you feel like you have some closure. He will continue to manipulate and push people away and eventually end up alone. That's when he will regret this most. You deserve peace and happiness, so go get it girl. Good luck to you moving forward",
            "Dude, good for you for what you said. He earned every iota of anger you gave him. You weren't nasty or unreasonable. \n\nMay you prosper from here on.",
            "thank god you stood up for yourself, what a deplorable human being. Those messages made me so angry, glad u decided on no contact",
            "You did well. He's awfully narcissistic (or is sociopathic more appropriate?), I'm sorry you've had to live with that all these years.",
            "I think you made the right call, you gave him an opportunity to explain his action and take responsibility for them. He was also given the opportunity to reflect on what he has done and how it has impacted you and apologize for them. He not only pushed the blame on you but refused to see that he was a fault at all. You reached out in the past and he rejected you. You have been just fine without out him and you will continue to be fine. There is no need to have a father who was never there for you. Hopefully this has given you the release you need to put this behind you once and for all.",
            "Good job. Now cut him out for good. You've seen what he's like, and you got confirmation.",
            "What a monster.  He cares nothing about how his lies and manipulation hurt everyone he loved.  He only cares that the \"story\" in the end shows him as the good guy.  The most blatant point is when he has no excuse for separating you and your grandmother, so he shamelessly changes the topic to his kids.  Then 4 responses later he says YOU cut ties with gran.  What a sociopath.  The truth just deflects off the shiny surface of his skull.   He has no defense, but I'm glad you at least told him that the she knew.  She knew how horrible he was, when she died.  He can't rewrite that story now.  What an infuriating person, I hate him for you.  \n   \nAlso you were still working out how to be an adult.  You didn't know what to do when she cut you off.  And when she died you were mired in his nonsense and understandably wary of too much contact.  It's not your fault it turned out this way.  When someone is purposefully manipulating a situation (your dad), everyone else ends up acting crazy as well in response.  You and your grandma both did.  It's no one's fault but your father.",
            "He deserved worse words than you gave him. Hopefully karma gets him.",
            "Wow.  Fuck him.  That's really all I can think to say.",
            "I am so unbelievably happy that you stood up for yourself. Honestly the part that shocked me the most is that he tried to put blame on you for not reaching out to fix the situation. My father hasn't spoken to me in 14 years, and I am a firm believer that it's the parent's responsibility to try to mend fences with the child, no matter the age. This happened when you were a kid, you don'thold any responsibility for his behavior. Good for you for your response to him",
            "Sometimes I really feel like we need a certificate to be a proper parent.\n\nGood on you op, I don’t think I could have handled it better if I were in your shoes.",
            "Holy shit. I'm sorry he was back on his bullshit, but good for you for sticking up for yourself.  \nAnd oh man, good use of Mythomaniac there too.",
            "I think your final email was amazing! Perfectly worded. I hope he feels guilt for the rest of his life.",
            "Wow. That man doesn't sound like an adult let alone a father. Well done you for telling him what you really thought.",
            "My father is just like yours.\n\n\nShitty, un-fatherly, immature, and refuses to accept any blame. It took me a long time to stop trying to force a relationship with him (superficially he'd act like he wanted one too, but in reality he was never there) where I realised he was never going to be a father and didn't want to be one. It helped that he had another kid younger than me who absolutely refuses to have anything to do with him. \n\nI'm sorry he tried to waltz into your life and expected you to be grateful. He had no right to do anything other than seeking your forgiveness. You were 14 when you cut contact and he seems to think you're the monster when he was the adult in the situation. \n\nYou're better off without him!",
            "What a POS... The lack of self awareness at 50 always shocks me but isnt unexpected anymore :(",
            "That was not nasty at all.  You could've been way harsher!\n\nI'm very proud of you.   It's great you got it out and that you let him know IN WRITING (so he can reread it and have others read it) what he's done and where he is wrong.\n\n\nEff that guy.  The thing with parents is that they are in SUCH a position to hurt us, and the bad ones just don't care.  Not one bit.  I know this must have been awful to experience again, and to be disappointed again.    Inside we all just want to be loved by our parents. But time will help and you looking forward will help. \n\nAwesome job. 👍🏻👍🏻❤️\n\nEdit.  I reread your original post.  I'm furious at your sperm donor.  What an enormous pile of poo. \nI really wonder why he contacted you.  It certainly wasn't for himself.   Money, his wife making him, other bs??? Did your gran leave you something? \n\n\n\nDo you think he'll try to reach out to your sister? You know, the other daughter he just abandoned for no reason. 😕 I hope she's strong too.",
            "Wow! Just know that your Gran is at peace and knows your love for her fully.  Eliminating toxic people from your life is so liberating, isn't it?",
            "I don't know you, but I love you, and I read this post with such an aching in my heart because I feel such empathy for you. I have not spoken to my father voluntarily in over 20 years, yet I know one day he is going to come out of the woodwork, find his way around all of my preemptive social media blocks, and hit me with messages very, very similar to the ones your father sent you. I only hope I have the strength and fortitude that you possessed in calling him out on his bullshit and remaining true to my own life when he does. I know some people may say that you just gave fuel to his fire, but, honestly, nothing short of falling at his feet whimpering for forgiveness would have changed his image of you, as his image of you must be protected at all costs lest his own, fragile self-concept take a blow. So who cares? Let him think what he wants to think. You keep doing you. Proud of you.",
            "I think your reactions are spot on and you did the right thing.",
            "What a sad email. Not the part about ending things with dad, that's probably for the best. But OP doesn't seem to realize how much she is like him. Hope she finds a way to break the generational pattern.",
            "I'm gonna say no, sorry friend :(",
            "Good for you! On behalf of reddit I think I can say we are proud of you!",
            "Good for you that is a great reply!",
            "Wow, I'm glad you got there truth out of him, he's such a narcissist jerk. You're better off without him, he only blames others and can't see he was there adult, he was the dad but he wasn't very good at either of those things.",
            "Wow I'm really sorry your father treated you in this way and took no accountability, just blamed everything on you. You seem to be very strong and I think you made the right decision to cut him out of your life",
            "You were not nasty. He was vile and you told him honestly how that made you feel. There’s nothing wrong about that",
            "This sounds like exactly how my dad is, he thinks im gonna take all his money and the relationship is about the inheritance. It's so infuriating that he would demonize me to that extent and I fucking quit after a while because there is no love in the relationship. It's not worth the trouble when he thinks the worst of me.",
            "You did the right thing. As humans, we have a tendency to want a good relationship with family, and it was really cool of you to give your father another chance after 13 years. While it did not go well, at least you got closure. I'm sorry, your father seems awful. Stay strong.",
            "Proud of you! That took a lot of courage to stand up to him!",
            "You went easy on him and he deserved everything you said to him and more. One thing you got out of this is closure. Stay strong.",
            "You handled this so well. I admire how you took responsibility for your actions and set boundaries for the future. He sounds like a manipulating sociopath. You deserved better. I hope you can find strength in being a good person and move on from toxic family. Therapy and reading about others with similar experiences will be great tools for healing. I’m sure you’re already there on that front!",
            "I too burned the bridge and rode off into the sunset on my magic unicorn. Was 16 years old and my mother just took zero responsibility for herself I wrote a final eff off and she still tries to reach out I blocked her on everything .. my dad's an enabler and his new wife's even worse.\n\nThe solice I have is my own husband and kids and showing them a healthy relationship and it's the happiest I have been I keep most people at arms length",
            "Hey man, I just want to say, as someone who's been in your exact position, you weren't nasty at all. Embrace that feeling of lightness. Cutting contact with my dad was the best decision I've ever made in my life, and I hope you end up feeling the same way. :)",
            "Maybe he needs you for her will?",
            "I'm so sorry.  Just last week, I had some family problems.  They hurt so bad.  But, mine were small compared to what you went through.  I really, really feel for you.  I would say to you, You will never feel better unless u make some peace with your father.  Your father is far from perfect.  Mine was far from perfect.  I could have chosen to hate him or my mother.  But, I didn't.  Maybe, someday, you should just forgive him, in your heart.  You will feel better.  There must be something good about him you can remember.",
            "Having a father who abandoned me and then tried to come back into my life... my answer?  No.  Absolutely not. He left my mom to do all the hard work and wasn't there to walk me through life when I was impressionable and confused.  Absolutely not. I haven't talked to him since he attempted. Blocked him in every way.  Men like that do not deserve to know anything about you. They were selfish and will continue to be so.  Even if they've changed... they pay the consequences for such an evil thing.",
            "OMG NO. No. Noooo. walk away",
            "Very well done to you op. It is clear to see from that email exchange that absolutely nothing was going to change. I hope you find peace.",
            "I realised after some email contact with my parent that I was not going to get any closure from them, that their memory of my childhood was just... wrong. Either they’re openly lying or delusional. They want to make up now to make themselves feel better, but there’s no true remorse there. I’m sorry this happened to you.",
            "Someday you will realize that you didn't lose him but you got rid of a toxic person and situations that only hold you back and bring you back (the depression you mentioned) down.\n\nCongratulations for being strong and brave and welcome to a freer life. \nAll Blessings.",
            "In so glad you managed to get that all out to him. Your father is truly despicable for blaming you for all the stuff with your gran. It almost sounds like he prevented you from seeing her because he was scared she would leave money to you and that somehow makes it so much worse.\n\nIf you aren’t already - I think you should get therapy about this but more about your gran. Not calling for a couple of weeks is ok, it’s normal when life gets busy, and she could have passed the day you got home from seeing her or three months later. It’s the guilt making you think “if only I had”. You may well procrastinate but I don’t think this guilt is that. Try to find a way to heal, she knew the real truth about you and your dad, she loved you, you loved her. It’s ok OP. Grans still with you in your heart and she knew you’d have wanted to say good bye. You could hold your own “funeral” privately and say bye if you need to, but let go of the guilt please! And good luck :)",
            "What is ur dad’s history?  He sounds like mine.",
            "I'm very sorry about your dad this is just hard to handle alone, I don't know the exact story that made him leave you and your mom (I guess it includes that someone stole his money), but he just can't blame you for something you didn't do while you were 13 yo. It builded up a big massive lie that tore up your family apart and this is awful, but however, he still is your dad and I hope you will find someday the strength to forgive him because I think he feels a little guilty somehow trying to reconstruct all that even though he doesn't show it a lot. I just want you to think about the decision you made and be sure about what you did(even though I think you were right) because he is a part of you and you only have 2 real parents in this world. Find in your weakness the strength to forgive, it is so difficult to do it while we are right. There is a saying in Qur'an that says: \"And if they incline to peace, then incline to it and trust in Allah, surely He is the Hearing, the Knowing.\" \nWith all my respects ^^",
            "Just want to pay my respects for you translating all those e-mails into English, given their content. Translating them must have meant understanding and reliving the full meaning of every sentence and every word.",
            "I feel similarly about my dad, and I'm so fucking proud of you.",
            "This internet stranger says you handled that very well. You were entirely reasonable and mature. I’m sorry your dad turned out to be a selfish, conniving jerk.",
            "OP, I'm so sorry. This must be very hard. Live your life and be happy. That is the best revenge you can exact on this man.",
            "OP please find a good therapist to help you deal with all of this -- it is HUGE and you shouldn't have to cope with this on your own.",
            "This was fucking amazing. Your last sentence really went with great impact!",
            "This was BEAUTIFUL. Well done you- not at all nasty, just stating the facts. \nI look forward to the day I can be as brave as you with my own biological father.",
            "Good for you, OP! You refused to light yourself on fire to keep him warm.\n\nAs a parent, a person would have to do some Olympic level mental gymnastics in order to put any sort of blame on their child when the relationship breaks down and there's no contact for 13 years.",
            "I hope that the silver lining from this situation is that you have been given closure. What a disgusting manipulative man he is. You are clearly a very intelligent, mature, and eloquent woman! As an internet friend, I am proud of you! I’m just sorry you had to go through any of this at all.",
            "I know I'm just an internet stranger, but I'm really proud of you.",
            "You textbook handled him right.  I’m so proud of you!  Sad for you too, because HE was the reason for the estrangement with your grandmother. What a POS!",
            "What a Grade A asshole!  You are well rid of him. How monstrous, making up awful stories about you and insisting they’re true. \n\nAnd he’s still all about money.  That’s clearly all HE cares about.  Guaranteed the minute he knew your grandma died, he was ransacking her house for anything of value. \n\nI sincerely hope he’s broke.  That his second (or nth) wife finally saw who he is and got a cut-throat lawyer to clean him out. And that you just solidly shut down his attempts to manipulate you into caring for him.",
            "Your Dad sound like a first class narcissist, they believe their own narratives regardless of how fantastically inaccurate they are. You should be proud of yourself and the decision thou have made. Stick to it.",
            "I'm so sorry OP. How utterly hurtful to read that he thought you'd come and take inventory!? What the hell! How evil. Hes a disgrace. Your Gran knew you, she loved you and that all you need to take from any of this. He sounds an awful father and an awful person. You and your sister deserved more, I'm sorry he failed you.",
            "It seems your entire relationship with your dads side of the family has been boiled down to money; what they didn’t want to provide and what you feel you/mom deserved.  Your entire first post revolves around money as well as dad/you dealing with it up in this post. \n\nHave you stepped back to honestly consider that that side of the family may actually feel like they are being used as an ATM machine? Just reading between both posts, as a child of divorce, it seems you only value your dad in the money he provided. You don’t mention his value in any other context. That’s so incredibly SAD.",
            "I hate him for you. I just hate him. I need to yell at him. You made me really angry and i dont know where to go show it.\n\nI hate him. Whoever you are stupid asshole. Life is long for douchebags. You can live and miserably watch others being happy when you are on your deathbed.",
            "The hardest choices require the strongest wills",
            "Just one thing. As we still don't exactly understand what this is about. NEVER say you don't care about the money. We don't know why he contacted you. Maybe there's money and he doesn't want to loose it. But fuck it if there's an opportunity milk him dry and use this money as compensation for the pain he caused.",
            "YNTA he is and a narcissist your smart stay strong you got life by the balls own it",
            "Honestly, putting aside the question of “blame”, you both seem incredibly angry (justifiably of course, especially in your case) to the point that it’s impossible for you to have a relationship at this point.\n\nIf we are talking “blame”, for sure, he sounds like it’s mostly his fault, but you also need to find a way to let go of that anger a little if you are to have a relationship. Do you even *want* a releatiosbhip with him?\n\nTherapy will help you decide the answer to that question. If it’s “yes”, therapy will help you find a way forward. If it’s “no”, therapy will help you accept that.\n\nGood luck whatever happens, and stay strong :)",
            "I read both posts fully and idk if ppl would be understanding of how I see this...but I'll start with a story\n\nMy guardian, the man who raised me, has quite a few kids, all from different marriages or cousins who aren't able to care for them for whatever reason. There are 2 kids out of the 10 of us that that strongly dislike him. Because their mother talked shit about him so much that they both hate him. He left the mother because she was addicted to heroin. But even through this she won custody of the 2 and he took their 3rd child. He later had a marriage with more kids, and then myself who isnt biological and a few others. He stayed in all his kids lives. But whenever the 2 kids come to family functions they're so fucking bitter, cuss at him, warn us other kids that he isnt shit, etc. He just sucks it up because he knows he cant change their mind no matter how much effort he tries. The mother has completely ruined his image by spreading half truths and one sided stories about their past relationship. She complained to the kids that their father left them all. But did she ever explain why he left? Probably not. Again, he was still in their life despite all the hate.\n\nAnd let me explain why I've told this story.\n\n you guys both have made very poor decisions in the past  that broke the relationship. He even recognized his poor decisions. It is more his fault as the adult but you did say he has tried reaching out to you a few times over the years. Why haven't you let him in through those attempts?\n\nAnd I feel like you didnt have a real reason to not like him or his wife. It sounds like you pushed him out a long time ago because his wife didnt feel like it was her place to tell you to make your bed, so she would call your dad. And then you went to court to not allow him to reach out to you anymore? Do you know what court document you got against him? A restraining order? That is  very extreme when it doesnt even sound like anything abusive was happening. and I wonder why did your mother allow you to do that. If there was ever a money dispute between your parents, I wonder why do you know about it. He went to court because he had too many debts and bought a new house, but maybe what actually happened was he suddenly had a pay decrease right after he bought all that new stuff. Do you know his side of the story? Because too many debts isn't an excuse to lower child support. A change of income is. When you apply for a mortgage, your child support is factored into your debt to income ratio. It just doesnt add up to me that too many debts are the reason. Also what if your dad didnt know this law about child support beyond 18? I sure never heard it until this post. \n\nI think the information given to you about your dad is very one sided. If your mom is the one that told you all this stuff about court I almost feel like she doesnt like him and used his kids as a weapon or she unintentionally vented inappropriate information about your father to you. I mean wow...she let you go to court to force him to not contact you for what reason? He isnt right for assuming you not liking him makes your sister have to be nonexistent too, but You probably didnt give him a lot of hope and he admitted this was wrong. Your mother probably was really egging you on too and with that combination how could he win? You wouldn't accept his new family for whatever reason what should he do? Break up with everyone because you dont like someone for no reason? He should have put his foot down more to make you guys get along but he made a human mistake of distancing instead of fighting.\n\nIt was shitty to keep your grandmother a secret, definitely. And he was honest about why. How much does/did your mother talk to you about the money your father gives? And the court battles? Have you directly told him he doesnt give enough or anything like that? Why would your grandmother even say something about you wanting money? Have you heard discussions where you can hear both sides of the conversation between your parents about money? You dont actually have to answer these questions, but use them to understand the nature of your relationships. If you did talk directly to him about child support money it is simply inappropriate and should be a discussion between the two parents and not involve kids. It just seems like another thing your mother may have talked about too freely that really put him in a different light to you. I'm not saying she purposely turned you off from him, but I have watched people not like a parent solely because one parent is the prime caretaker and giving a lot of one sided information to kids. Nobody should be talking down about a parent, especially one that actually does take care of their kid (kept you on the weekends and pays child support)\n\nUnless there was abuse involved I would give him a chance without coming out the gate attacking him every time he comes back into your life",
            "It's always worth trying, maybe not to reconnect but to get to know one another as farther and daughter. Don't waste any chance no matter who was in the wrong"
        ]
    },
    {
        "post_id": "j2hohg",
        "author": "bffthrowaway313",
        "title": "How can I (29F) get over the fact that I'm not my best friend's (30F) best friend?",
        "url": "https://www.reddit.com/r/relationships/comments/j2hohg/how_can_i_29f_get_over_the_fact_that_im_not_my/",
        "score": 3454,
        "num_comments": 292,
        "created_utc": 1601451115.0,
        "selftext": "In 2013 after an exceptionally bad breakup and graduating from college, I moved to a New City and basically started my life over. After a few weeks of subletting, I found a roommate on Craigslist named Kasie (30F) who I hit it off with immediately. I've always been more of a 'boyfriend girl' in that I was with my ex from tenth grade until college graduation and he was basically my 'best friend' so Kasie was my first real girl BFF.\n\nWe lived together for four years until Kasie moved in with her boyfriend Jason (32M) and we had the best time. We almost never fought and spent all of our time at home together. We are both incidentally from the same home state, have a lot of similar interests and personalities and complement each other in lots of ways. I get along super well with Jason too and they never made me feel like a third wheel. I have a larger friend group now in New City and (thankfully) lots of girl friends but Kasie is still my bff and we talk/text constantly, hang out weekly, etc.\n\nThe problem: Annie (30F). Annie is Kasie's best friend. They've been best friends since their early 20s and are kind of a package deal. Annie is very cool and smart and funny and she and I are  good friends too and there's no competition between us or anything. She and I even hang out without Kasie sometimes. I can't stress enough that we all get along and that this isn't like the movie 'Bridesmaids' or anything!\n\nBut... sometimes I feel really sad that Kasie is MY best friend, but Annie is hers. Kasie will refer to me as 'one of her best friends' but we all know that Annie is #1. If Kasie ever says something like, 'You're my favorite!' to Jason he laughs and says, \"No, that's Annie.' If Kasie and Jason get married, Annie will be maid of honor, no question. Everyone kind of says 'Kasie-and-Annie' like they're one entity. They have very big and beautiful matching tattoos (though Kasie and I have matching tattoos too, but imagine it being something like a 1 inch potato because we're both from Idaho, whereas Kasie and Annie have gorgeous tattoos that cover most of their upper arm).\n\nI don't know how to get over this sadness. It feels really childish. Kasie doesn't ever make me feel left out and neither does Annie. I love them both. But I guess I'm just jealous that I'm not anyone's 'favorite' in the same way. It feels extra childish of me because I have a boyfriend and I know I'm his favorite, but I guess I just never got to experience having a girl BFF who also considered me her BFF like that. How can I be satisfied with being almost-the-best and not the best?\n\n---\nTL;DR: My best friend, Kasie, has her own best friend, Annie. How can I get over feeling like I'm second best?",
        "permalink": "/r/relationships/comments/j2hohg/how_can_i_29f_get_over_the_fact_that_im_not_my/",
        "comments": [
            "To quote the Mindy Project, \"best friend is not a person, it's a tier\". I have friends going back to middle school, who I would rate as best friends, but for all I know many of them have other \"best friends\". In fact, I know my cousin who is among my \"best friends\" will rate her childhood friend and her closest work friend among her other best friends. \n\nNow, I don't know how to shift your perspective to that direction but I think it can be helpful to recognize you are one of her best friends, just not *the* one and only, because she clearly has more history with Annie. In the same way that my cousin's work friend can't ever have the same intimate connection due to history that me and cousin share, I can't share the connection they have because of their unique professional experiences and physical proximity (they live next door, I live in a different city). Our friendships are different but equal in a way?\n\nIt may also help to cherish and think about your other close friendships. Maybe you will find some people who can join your \"tier\".",
            "[deleted]",
            "Every relationship is asymmetric, and there's something to learn here. Everybody is free to give as much as they want, but nobody has the obligation to give you as much as you want. You should love people for what they are (as long as they don't hurt you on purpose!), not for what they give you.",
            "The good thing about friendships is that some of the social expectations placed on intimate/monogamous relationships don’t apply in them, in that we can have and love multiple friends, without loving our other friends less. It’s not like giving out slices of pie! Love for others doesn’t affect how much love you get. \n\nAlso, It seems like you and her are best friends, full stop. \n\nI think you need to work on your own self image and confidence in yourself, as not to rely on companionship, which you have through your bestie, boyfriend, and other friends, for validation. Your role in life is not to be someone’s #1 BFF, it’s to be be you!\n\nEdit: spelling",
            "48-year-old woman here who has suffered from the same kind of insecurity about her female friends over the years.\n\nHere's what helped me. When Kasie is with you, is she 100% with you? If the answer is yes, really look hard at what that means. When she is with you, she is with **you **.\n\nNow, she may be 100% with her other friend when they're together, but that's not about you at all. \n\nThe bottom line is that Kasie isn't any less your friend just because she's also close to other people. Kasie isn't 40% your friend and 60% her friend. She is 100% your friend.\n\nYou're still young, and you have many female friendships in your future. \n\nI beg you to reframe how you see these friendships. Ditch the words \"best friend\" from your vocabulary. That's middle and high school Queen Bee bullshit and we need to leave it behind. \n\nMy own jealousy caused me to lose a close friend who was 100% there for me and I only have myself to blame.\n\nedit: typos",
            "A lot of people are talking about best friends and the meaning and that and stuff. But I wanted to touch on something else. Friendships like the one you are describing are quite rare - very few people are lucky enough to experience a bond like that in their life time. From what you’ve written, I think you have a healthy, normalized and well controlled “jealousy” - how could one not? Connections are one of the few things we truly *have* as humans, and a friend that far back in your life who knows you, your life, all about you - it doesn’t sound like you’re upset at either of your friends (you sound to genuinely love and care for them) but that you’re sad you don’t have that kind of connection in your life as well. Kasie is the focal point of this, because she is both your closest friend, and the person who has a kind of relationship you don’t. I think it’s safe to say their relationship is different than yours, but I don’t think it’s bad at all or they love you less. You are just craving your own Anne, and I think that’s very understandable. The only thing you can do is just let it be, let it wash away, and be very happy for both of your friends that they have that relationship, and that you have them, too! I think what you are feeling is normal, and with understanding and earnestness, can be worked through via just letting go.",
            "I don't think there's anything you can do. As long as you can just accept it and enjoy your friendships with these women as they are, you don't really need to worry too much.\n\n Sometimes things aren't exactly as we like, but that doesn't make them bad. It's okay to feel a bit sad, but try not.to compare your relationships too much. It will only hurt.",
            "This is exactly why I don't use the phrase best friend. It doesn't enrich anyone's lives to have a hierarchy of friends.\n\nIt might help to focus on this question: Are you satisfied with your relationship with her, on its own, without comparing it to anyone else?",
            "I used to be sad about that for years. I have plenty of very good friends but i'm nobody's best friend.\n\nBut i'm not sad anymore. Who cares? What i care about is that when they do something fun, they call me to do it with them. When they're sad about something they tell me about it. When they want to celebrate something, they invite me to celebrate with them.\n\nAnd vice versa\n\nTo be honest, that's what really counts.\n\nYou're a great friend and she loves you. Why do you want to make a classification about who's first and who's second?\n\nYes the other friend will be the maid of honor but you'll probably still get to be a bridesmaid. So you'll have all the fun, and won't have to organise anything. Or just help out if the maid of honor asks. No stress, less money to spend: ideal!",
            "If you are at a point where you feel pain about this, it’s time to pull back. Friendships aren’t about competition or rank; they are about laughs and support.",
            "You can’t help how you feel, but you might find that if you change your behaviour you will feel better about yourself.\n\n I used to have those kind of intense one on one friendships when I was younger, and I was NEVER my BFFs “best friend” so I just kind of... stopped trying to put all my friendship eggs in one basket, if you will. I have friends that are closer than other friends, but I don’t try to put anyone on a pedestal.",
            "I think a part of the problem is that - like you said - you are a boyfriend girl. You're used to thinking of relationships as having some kind of inherent exclusivity and that's just not how best friendships are. \n\nI understand how you feel though - I immigrated to another country to be with my husband and we have moved almost every 18 months since I got here. In each place I find that I connect with someone and think of them as my best friend but it's because in this country I don't really know anyone besides my husband and in laws, so it's a very low bar and it always hurt to find out I wasn't someone else's best friend too. But at some point I came to accept that I can have a best friend without having to be their best friend, especially now that I've been here a while and have several \"best friends\" in different areas. \n\nSometimes you get more from a friendship than they get from it, and sometimes there are people who consider their best friends their *longest* friendship, and there's just no competing with that when you're new. It might help you to observe your friends and learn why they consider each other best friends. It sounds like it's just because they've been friends through big life shifts and upheaval, and there's no competing with that label, but it's also just a label. You can still have a deep and solid friendship.",
            "Loving others is about who they are and not at all about ourselves.\n\nI'm in the same position as you, but I'm entirely at peace with it. Of course my best friend has other close friends, her best friend in particular is someone she's known since high school. I'm so incredibly happy to see that she's cared for by many because she truly deserves the world. She mentioned hanging out with her recently and how she was telling her best friend about something compassionate and considerate I had done and I just think the world needs more like her in it. I won't be her Maid of Honor, but she'll be mine. I'll stand with her, but I'm honestly relieved to not be in charge of party things! That's her forte and her best friend's as well, so it's really working out the best for everyone. We're so important to each other, and that's all that matters.",
            "Remember what Mr. Ping said to Po's bio-dad in Kung Fu Panda 3, after he struggled to overcome his jealousy: \"I realized having you in his life doesn't mean less for me, but more for Po.\" Be happy that your friend has other friends, and realize that it doesn't change your relationship with her in any way. You're still amazing friends.",
            "My \"BFF\" is a girl I met in kindergarten. We've been in each other's lives for 33 years. In grade 12 she went to school abroad and our relationship changed drastically. I had my life and my own shit going on at home and she had this beautiful grand life abroad. She's been constantly travelling ever since and hasn't lived in our home city ever since. I found it really hard to accept that even though she was still my \"BFF\" I was no longer hers. She has a group of 3-4 women that all go on these amazing trips together. They got matching tattoos. \n\nWhen she got married, she had a ceremony in our home town and I wasn't asked to be her maid of honor. That really hurt. She had her younger sister as a maid of honor and no bridesmaids. Since her husband was from Wales they had a ceremony there as well a few months later. I was invited to the wedding but financially I couldn't afford to go. I saw pictures from that wedding on Facebook and she had these other women she traveled with as her maid of honor and bridesmaid. I was devastated. \n\nI jealousy watched their amazing travels from the sidelines of Facebook for years until finally one day I snapped. I wrote her a long message explaining how I felt left out and insignificant to her life. This was of course the majority my own doing as I could never afford to travel. I had different priorities. Nevertheless, I felt so slighted I cut off all contact for a few years. \n\nAfter realizing that she always made a point of seeing me when she came \"home\" even though we didn't really talk anymore, I softened. We reconnected through social media. I realized that \"bffs\" doesn't mean a damn thing. She's still my person, I'm still hers. We 100% support and love each other. If I ever need her, she's there for me and vice versa. True friendships have seasons, sometimes they are hot like summer (and you feel really connected and close) sometimes they are cold like winter (and you feel disconnected and distant and sometimes they are comfortable and cozy like spring and fall. \nLabels are just labels. The reality is, there's no BEST in friendship. If she's someone you can trust, be honest with, accepts you for all your best, worst and in between qualities, loves and cares about you, that's all that matters. That's friendship. That's love. \nAt different times and points in my life I gravitate to different friends and that person becomes my \"best\" friend because at that moment in time they are the \"best\" at supporting me or giving me the type of love I need. That does NOT mean that any of my other friends are any less important to me or me to them. \n\nValue the friendship not the title.",
            "Ok. So - your feelings are valid and totally understandable. But please don’t think this woman doesn’t value you... she got matching tattoos with you, and you don’t do that with just anyone!",
            "[deleted]",
            "Bout to get downvoted to hell, but this is not something a person your age should focus on. Be thankful and grateful for your friends instead of playing a ranking game.",
            "Seems like your ego is standing in the way of your ability to appreciate the friendships you were lucky enough to make.",
            "Maybe stop trying to quantify and measure relationships against each other and just enjoy the people around you.",
            "There is a cute song from Crazy Ex-Girlfriend about this feeling. (\"You're my best friend\")",
            "Just because she’s possibly closer to someone else doesn’t mean you can’t have a meaningful, close, and special friendship. Does the label really matter at the end of the day?",
            "Best friend is a tier not a person. You can have more than one.",
            "I'm from Idaho, we can be friends. \n\nIn all seriousness, this happens in many relationships for many people. Just cherish the fact that you have two people that you are close to and can count on in a pinch, like in an alley fight with a rival gang.",
            "I'd do anything to have a friend like that in my life. It definitely helps to be grateful for your relationships and cherish them in every way, never take them for granted. I know it would mean a lot to you to be her best friend as well, but truly it's just a detail. You have a wonderful friend that loves you and that's really all that counts.",
            "You know, I have multiple \"best friends.\" I never thought that I could only have one. I figured the term \"best friend\" was meant to be someone that I thought was very close to me, someone that I loved to be around. I have acquaintances, friends, and then best friends. I only have a few best friends but I've never picked one over the other. They're all special to me in their own ways. \n\nI feel as though you *are* one of her best friends, I don't think she only has one.",
            "There's a lot of good advice here so just want to add: you do NOT want to be maid of honor, trust me. It's a lot of work, even if your friend is super chill.",
            "Ranking your friendships in any fashion is a recipe for disaster. It serves no purpose whatsoever. You don’t need a “best” friend. You need good friends. If she is that for you, then what’s the problem? She’s making your life better.",
            "Instead of being jealous of Annie, try just being grateful to have a best friend, not everyone does",
            "You don’t need to be her best friend. You don’t need her to be your best friend. It’s not a competition. Don’t make it one. Don’t benchmark yourself against anyone but you. Don’t ask how can I be better than Annie? Ask how I can be better than me.",
            "You are 30 years old!!! GROW UP!!!!!",
            "Getting over something takes time, and maybe when you consider time itll help you out, you guys will likely stay friends your entire lives, but some things will change, maybe a friend will have to move, kids might cause you to lose touch for awhile, or not, maybe you'll be even closer, the point is during your 50+ years of friendship to come things will change, just keep being a good friend to everyone and everything will work out.",
            "I too have felt this same way. My bestie has multiple best friends but I like to think we all fulfill different aspects of her life. Though it irks me when other best friend needs to bring up how they’ve known each other so long and are besties. That’s the only time it really pisses me off is when they talk about things I wasn’t around for and I feel excluded. But honestly as I get older and our lives change I realize the friendship has to evolve. And the meaning changes. You don’t have all that time you once did to just be. More responsibility and with covid the social distancing has sucked. Try not to dwell on what you feel you don’t have and enjoy what you do",
            "Have you considered that maybe you have a tendency to strongly attach yourself to one person? Since you mention you did the same with your boyfriend before? By doing this you might unconsciously put a lot of expectations on that person to validate and emotionally support you. It’s not inherently a bad thing to have friends and rely on them for your emotional needs but it might be interesting to consider how independent you are in that regard.",
            "It's ok to be sad about that. You're entitled to your feelings. Just make sure to not be overwhelmed by them.\n\n I'm in the same boat, I'm no one's BFF. I focus on the friendships I do have, and the knowledge that if I'm ever in a bind, I do have people who will be there to support me and help me out. And that's great. That's awesome even. And in the end, it's enough.\n\nThere's a lot of stuff besides that that I won't ever get to experience, because life. But focusing on what you do have, practicing being grateful for it really helps. It doesn't only help with helping you feel better in the moment, but to also notice the things you actually do have and that you might be neglecting because of this image you have in your head. \n\nAnd if it's something that continues to bother you and brings you down, to the point of negatively impacting you or your relationships, consider a couple of appointments with a counselor or a therapist. It's enough to unload, get another perspective, maybe some tools to deal with those kind of emotions.",
            "Ok this is going to sound rough but I’ve been through this with a few people. You have never been alone and you are replacing not having a bf with your friend. My sister was like this since she was 13 she has always been in a relationship, it’s sad to see her need the constant validation. Work on you!",
            "You're wrapping your self-worth into another person's opinion of a 3rd party.  She sounds like a good friend, but it's not healthy to worry so much about what others think of you or how they rank you in their life.  If she's ignoring you, that'd be one thing, but this just seems a little obsessive.  \n\nTry to make additional friends outside Kasie and Annie.",
            "I have a best friend who has been there since she was born. We are 11 months a part. She was the OG. I would still call her a best friend, even though we’ve grown apart. My best friend, now, is someone I’ve known since high school. She’s got other best friends, as do I. \n\nMy sisters are my best friends. \n\nMy boyfriend and I have been dating for 3 years, he’s my best friend and his best friends wife is also my best friend. \n\nI have people that I call my best friend from different walks of life. The one from HS and I have matching tattoos. My sisters and I will once the youngest is old enough (next summer). \n\nI love none of them more than the other, and whenever we all hang out together, no one is left out. I’m sure this is how it is for Kasie, too!\n\nI love none of them more than the others, and have very different relationships with each of them. They’re all essential to my life and I couldn’t imagine life without them.",
            "[deleted]",
            "This is very sweet and you are dealing with it in a grown up way. xxx",
            "[deleted]",
            "[deleted]",
            "I know this is *your* poor me party (I say this in a lighthearted way, first World problems, etc. etc.), but hey! At least she considers you *one of* her best friends.\n\nI ain't got nobody.\n\nI'm really good at burning bridges when I feel like people aren't interested in me anymore. I'm *not* really good at reaching out to people (especially other women) to let them know I need some friendship, love, simple human interaction...etc.\n\nI'm especially not good at making myself vulnerable enough to ask \"Hey! Why the fuck don't we talk/hangout/whatever anymore?\" It's gotten to the point that genuinely trying to start a conversation over messenger just brings gif responses... /sigh\n\nAt least you have this.",
            "maybe stop being childish and rating your friends from best to worst?",
            "I feel this, because I'm also not my best friend's best friend and that sometimes makes me a little uncomfortable and sad.  It's difficult knowledge to have, I think.  IMO, though, the real issue is this system society has set up where one person is your best friend and everyone else is on some lower tier.  I don't think that needs to be a thing or that it generally makes people feel good or helps friendships.  Another comment in this post asked whether you feel good about the relationship you have with your friend, regardless of whether she considers you her best friend, and I think that's a good way to look at things.  It's been helpful for me to think of friendships that way.  I could probably have more friends or more best friends or whatever if I spent more time socializing and put more energy into friendships, but that's not where I'm at.  I'm happy with the friendships I have, even if they're not reciprocated perfectly.  If you're happy with your friendship with Kasie other than the fact that she's a little closer to Annie, I think it's best to keep that in mind and not worry so much about \"best friend\" designations.\n\nI'm also a \"boyfriend girl,\" btw, and also a \"sibling girl,\" I guess.  My husband is genuinely my best friend, and I'm also very close to my siblings and their partners.  I've always spent most of my social time with my siblings, which is probably why my friendships developed the way they did (close but not BFF-level close).  It helps me to keep that in mind, too - that my friendships aren't randomly a certain way but rather that way because of choices I've made and continue to make.  There's nothing wrong with me prioritizing my SO and siblings, but there's also nothing wrong with my friends prioritizing each other when I haven't spent as much time with them as they have with each other.",
            "She’s your friend and she loves you, she has more history with Annie and has probably been through a lot of shit with her—the shit life throws at us is the glue that binds us with those who endure alongside us.",
            "You are her best friend. The older I get the more loosely the term \"best friend\" applies to one person. I have a few significantly close friends from over the years who I consider my best friends. My relationship with all of them is individual and unique because of how I met them, when I met them etc. You are Kasie's best friend that is just as best as Annie is. The only \"issue\" is that you don't have an equivalent for Annie. And that's okay. As other people have said it's your perception. Do you feel like there's anything lacking in your friendship? Does this insecurity extend to other areas of your life? I'm sorry if these are intrusive or difficult questions. You don't have to answer them but maybe think about it. Perhaps any answers will give you an insight on how to handle your perspective on this.",
            "See dude it's the harsh truth u can't always expect people to keep u as their top priority it's their choice and it's up to them, feeling like this will only make u get hurt even more, instead y don't u start by not having expectations, in that way u won't hurt urself and also if something good happens it's a win win, it's okay to get insecure about friendships but don't let it affect them, talk to kasie if u feel really bad but truth is u can't do much about it it's up to kasie about how she feels about u and how much she trusts u, she's been with Anni for so long it makes sense that she's her top priority, but that doesn't mean she doesn't love u she loves u as well and she cares for u just not as much as Anni, don't keep expectations and face ur insecurities trust me it'll stop u from getting hurt, if u r feeling really bad then talk to kasie but don't expect kasie to change her priority, all the best and take care",
            "The top comment is absolutely correct! I have a best childhood friend, best friend from my teen years, best friend from college, and a bestie or two from when I lived in my husbands hometown and now I have a bestie where we live today. It’s tiers and they are all different and beautiful people and I adore each one. They were my world during certain times in my life and I love them all equally.",
            "I have two best friends. My first best friend and I met freshman year of college. We hit it off completely and just clicked. We have so much in common and everything with her was just so easy. I love her to death and at this point we now have 18 years of friendship history together. 8 years ago I moved to a new city. Not long after, a new girl started working at my company and I brought her into my friend group since she was also new in town. It didn't take long before it became apparent we had best friend potential. Same thing with her, we just clicked. We get along so well and can completely be ourselves together. I started referring to her as my current-city best friend, and the other girl as my \"back home best friend.\" For several years, my OG friend was definitely still my BEST best friend. We just had so much history together it was impossible to think of anyone taking her place. But in the last year or so, I honestly think my new BFF may be on top. We live a block apart so we see each other almost daily, whereas my other best friend lives 1,000 miles away. People in our friend group joke that we're a couple or that they are jealous they've never had a friendship like ours. Like you mentioned, people say our names together like we are one entity. But honestly, it doesn't matter which friend is \"on top.\" I still love both of these women. They are both SO important to me and 'ranking' them feels kind of wrong. They have met and like each other too. They know I refer to both of them as my best friend. Thankfully it hasn't seemed to be an issue.\n\nI don't know how to help you feeling like you are second best. But just know it is possible to have TWO best friends. It doesn't mean she loves you less. They have more history, but the longer you are friends with her, the less that will matter. It might get to a point where the 3 of you have a 3-way best friendship! And if Annie is her maid of honor one day, it's more than likely because they do have a little more history and there is a sense of obligation there. Not that Kasie wouldn't have loved to have you be maid of honor.",
            "In this case, love shared is not love lessened.",
            "It's ok to be a little bit jealous. Things like this happen. I was in a similar situation. It helped me to just be happy I have a great friend. Don't think to much on it and have fun with your friend. The \"best\" is just a title that really only mattered in elementary school. As an adult having multiple friends is the new \"best\" catagory, because making friends as an adult is difficult.",
            "Friendship and love are not pie.  Loving and caring for other people doesn't take away her love for you. .  If you asked me who my best friend was, I couldn't tell you.  I have a list.  Sounds like all three of you have a great relationship please don't let jealousy of a \"title\" ruin that.",
            "From a different perspective, are you feeling \"less than\" because someone doesn't look at you as the top tiered bestie? \n\nI have 3 best friends and 2 of them have childhood best friends. It stung a little but because my best friend had always been my identical twin sister, other friends were a new experience for me. I had to process through it and realized it touched on a core wound. Knowing that and knowing my friends, I was able to leave the muck of the wound because it wasn't true. \n\nYour perception shapes your reality. When you step aside,  you get a clearer picture of the situation.\n\nBecause I know my friends so well, I tend to bounce things off them in different ways. It gives me a better perspective of what my situation looks like and not just my own. \n\nIt doesn't mean your value as a friend is tiered. You bring things to your relationships in a different way than others and thats a good thing. Your own qualities are a reason why you ARE called a best friend.",
            "This sucks for you, I'm sorry. You know your feelings are irrational but that doesn't stop you feeling them. This is totally normal, every one gets possessive and jealous sometimes, and these negative feelings can be hard to cope with.\n\nOne's teenage and college years are typically when you learn basically how to have adult friendships with each other, and you get there through experience and mistakes. You missed out on that because you didn't have a BFF at that time, so you're having to learn how to cope with those feelings now, except because you're maturer you're aware of how silly and childish you're being.\n\nIt's easy for people who did gain that experience when they were younger to say \"just grow up\", and that's a bit unsympathetic. But really learning to accept your jealousy and move on from it is just something you have to develop over time. \n\nSome things that might help are: 1. broadening or focussing on other people in your social circle for a bit so that you build up other close relationships and are less of a one-woman-gal, 2. focus on a hobby that can be part of your identity so you start seeing yourself more as \"(your name) the Painter/Baker/Paraglider\" rather than \"Kasie's Second Best Friend\", 3. see a counsellor or therapist who can help guide you through your feelings so that you can really internalize the knowledge that Kasie's friendship with Annie in no way invalidates your friendship with Kasie, and get away from the mentality of ranking or scoring friendships, 4. tell Kasie how you're feeling, this might be a difficult conversation to have and you can be clear that you don't want her to change anything, but be open about how this is your first BFF-relationship and you're struggling with how to handle some of it, this gives Kasie the opportunity to reassure you and give you advice and support (you never know, she might have been in a similar situation herself and will e.g able to really empathise) - I can see that this might feel like an embarrassing thing to do, but if she is a good friend to you she will want to help you through this.\n\nAs a very last resort I would say it might be worth stepping back from your friendship with Kasie at least temporarily, because a bit of distance from it all might give you some perspective. It's not good for your mental health to stay in a situation like this long-term.",
            "I think it's okay to have several best friends. Personally, I am very grateful to have a handful of extremely close friends and I go to each of them for something different. Four of those girls have separately called me their best friend and it feels amazing to be that for them. I know that my family sees my longest friend (from 4th grade and now we're 28) as my best friend, and they're not wrong. But I also have a best friend I made as an adult, someone I text/call daily and who knows everything about the new, adult me. My oldest best friend knows me in a different way and it's great to keep her in my life. But it's also important to have the best friends I made in college and after. \n\nYou have to understand that you are still incredibly special to Kasie and that there's stuff she goes to for you that she doesn't do with her other bff. There are things she shares with you that she can't share with Annie, it makes you irreplaceable. I go to specific friends for certain problems/concerns because I known the person I chose will handle it and provide the support I need. It's also amazing that you all get along and there's no competition.\n\nJust know you're special to her for a reason. \n\nThe more secure you feel in yourself and in your friendship, the easier it'll be to accept that you're technically #2. But just know, that when you're with her, she's not thinking that you're second, she's thinking about the awesome friend in front of her. Being second in line isn't a bad thing. Kasie still cherishes you and keeps you in her life and involves you. We're all allowed to have more than one best friend. For some people their #1 will reciprocate, but it's not uncommon to be second or third in line but still be loved, cherished, and valued.",
            "I’ve got a best friend i’ve known for 15 years and we’ve been best friends since we were teenagers. But i also had a best friend in college who I grew apart from (she was similar to you - i was her best friend and she was a little sad the other one came first, but we grew apart for other reasons). For a couple of years I had an online friend who I talked to *every day* for hours on end, and felt that jealousy when she was hanging out with rl people and i didn’t have her attention (but then again i might just be gay).\n\nAs an adult, i met a girl at work that instantly connected to and we became very close, and she and her fiance truly are *some of* my best friends. But i never stopped being friends with the one from high school - we see each other whenever we can and exchanged letters all throughout college.\n\nThrough sheer frequency of communication, most would assume the newbies are better friends. When they cut out some toxic friendships, i made the cut. I’ve lived with them (which #1 and i always wanted to do but never had the chance) and stayed at their place many many times. I’m close to both of them, while #1’s husband is a friendly acquaintance.\n\nMy partner, who i met last year, has met and interacted with all of my friends, but it’s the best friend couple they get along with best, especially the guy. They game together all the time now. \n\nWe’re all late twenties and early thirties, but i never wonder if any of my friends have other friends who are “better than” me or have seniority or any of that. I value all of them equally and put effort in because I want them all to be happy, and have seen that reciprocated many times. They taught me what true friendship and healthy communication and boundaries looked like in relationships! \n\nIf neither of these girls have ever put you out or made you feel less-than, just enjoy it! You’ll meet other people you jive with, like your partner and coworkers and really anyone you spend time with. Take those good friend skills you learned from your awesome roommate and apply them to everyone you meet, and people will want to be friends with you.\n\nI constantly want to keep calling that couple “my roommates” because it’s so much easier and more specific than “my good friends”, and I haven’t lived with them in four years, lol.",
            "People have multiple best friends from different roles and times in their life. One of my best friends is my cousin who I grew up with and spent a lot of childhood time with. One of my best friends is someone I met through a job six years ago. One of of my best friends is my husband.\n\nThey're all completely different and have different roles in my life and different ways I consider them my best friends, but it doesn't mean one of them *isn't* my best friend, it's just in different ways. They're all incredibly special and important to me.",
            "This is something I have struggled with in the past. The shift has to happen internally, although idk the steps to get to a place where you accept and understand the circumstances and are at peace with them.\n\nI have never felt like my #1's #1 as you also describe. As I've gotten older (I'm late 20s), I've accepted that it's ok. Someone else being my #1's #1 doesn't diminish my friendship with them. I think I used to think that it DID diminish our friendship in some way, but now I know that's not the case. \n\nThe thing that helped me realize it, though, is probably having good friends that show you that. I used to feel like a third wheel in some friendships, but in the last two years, I've become better friends with two people who are good friends with each other, and they don't make me feel like a third wheel. Ofc, they are closer to each other than I am with each of them separately, but I don't feel insecure about it.\n\nI hope you are able to let go of this insecurity you harbor bc it's causing you pain and I think is taking away from you 100% enjoying your friendships with these lovely people. I also hope that one day, your non-romantic #1 also views you as their #1. Idk what that feels like, for your person to view you as their person, but I imagine it's wonderful.",
            "You'll be alright girl every once in awhile you have to not give af and this is one of those times",
            "I think you need to focus on other friendships instead of spending the bulk of your emotional energy on Kasie. I’m not saying to pull away from her but this mindset of needing to be number one in her life is unhealthy for you in the long run. Maybe it’s because you haven’t had a lot of female friendships but this mindset of having to have a singular best friend is usually one that disappears as you get older. Especially in college I would say that friendships become more of a group thing instead of a single person who you share everything with. It seems like you have a group of girls that you are close to. Try to focus more on the group that any one individual. Break away from the mindset that Kasie has to be your one and only otherwise you could be putting stress on the friendship that causes her to pull away.",
            "Are you happy in your relationship with Kasie?\n\nIf you are, then you don’t need to compare it to any other relationships. If you’re not, you should focus on that instead.",
            "Best friends is a title of hype eventually people are just temporary best friends and they then become close friends, friends, acquaintances, and back to strangers. It’s the cycle of life. I wouldn’t put much emphasis on a title because as we grow up we grow apart and make connections that better fit our needs. I’ve gone from having best friends to none. I don’t find friendships as satisfying as I did when I was younger and honestly don’t think much about it.",
            "Imagine how Annie feels you move in from nowhere and she might think you were stealing her best friends! Its more of a level of friendship that isn't exclusive to one person at a time. Don't take it personally. You moved to the city and in with someone who  originally was already in the city with a life. You then also built a life. Its gonna be great.",
            "I'm having difficulty being empathetic to you in this case. You're making such a big fuss about what is essentially a kids problem. What does it matter who is whose \"best\" friend? You're really good friends and that is what matters. Maybe it'd be healthy for you to make some more girl friends so you can let go of this jealousy. Especially since both of them are nice to you and they just know eachother for way longer.\n\nIt's not bad to feel this way, but it is bad to let yourself he eaten by it.\n\nPs. All of my close friends are my best friends, because they're the best friends I could ever wish for. It's just a silly name, don't get so hung up over it. Even in school kids have best friends and bestest friends and best bestest friends. Which all mean the same thing,",
            "I'm just jealous you've got a female bff. I don't have one and I always feel like im missing out. I know it stings a bit, but you could have no friends at all. Be grateful girl.",
            "A tale of caution: My sister was a Kasie, our friend was you, and I was Annie. And her jealousy eventually ruined the entire trio dynamic and she was also ultimately ostracized from their high school friends group (which I’m not even apart of). \n\nHer jealousy turned into resentment for both sister and I and then it turned to anger. I never understood why she became so jealous. We always used to be so cool together (even alone without our Kasie). If anything, I was a little jealous of her because my time with my sister was still so anchored in our adolescence. Friend got to go on spring break trips, school dances, frat parties and all that fun stuff. We are all in each other’s lives for different reasons. \n\nTake a look and maybe you’ll notice that Annie is best friends in a different way than you. Maybe she’s even jealous of your bond - she could even secretly feel a little insecurity about her relationship with Kasie. She could have even thought you could steal her friendship away when you first met. \n\nComes to terms with the relationship because the sadness/jealousy could fester. I miss our Friend. I wish she hadn’t pulled away so much. I see her on ig and know she’s happy so that’s good 😌",
            "You sound like a 12 year old Lol",
            "You're 30 years old..grow the fuck up. .",
            "I think you just need to get over it. It really does seem pretty immature to feel that way.",
            "I feel you, my best friend also says I'm \"one of her best friends\" and someone else was in fact MOH at her wedding. Honestly I've just pulled back a bit",
            "You don’t have to get over it. You can feel your sadness and grief. If you let it come, say hello and welcome it, your emotions will walk out the door on their own",
            "Get over it. You’re friends at the end of the day, there’s more to life than best friends . Grow up :) x x",
            "Your question contains the answer. Getting over anything is a function of getting over it. It serves no purpose to judge yourself about the feelings you have. I'll go out on a limb and presume you're Human, which means feelings are part of the design. A relationship is how I feel about myself in relation to another person. If I feel my best friend is my best friend, he's done the right thing between us. It's none of my business who he has as a best friend. Although, in all fairness, he refers to me as his best friend, but I've had the situation you describe as well. Best wishes.",
            "I have exactly this situation with my best friend from high school, and he really struggled with the fact that my sister is my best friend and (without doubt) will be my best man. It doesn't make him any less a friend. It's not a competition.",
            "I have several BFs but one actual main one who has known me about 17 years.  She's the one who tells me when I'm being unreasonable and laughs at me when I rant, but I love them all the same.  You are definitely not any less, she just has one she's grown with.",
            "Wait, are you guys having friends?",
            "Let’s simplify. You are the most popular person in your group. You have friend A who is a loner and has very few friends. One day, you supported them through some huge difficulty, and as your friendship goes in, you continue to be their best friend. \n\nYou’ve had other close friends for years, and while you like spending time with A, they will never be your best friend. \n\nIt sounds like you might be associating your worth through their level of friendship.",
            "Honestly, sounds like weird leftover feelings from having your best friend be your boyfriend for many years, turning into misplaced jealousy over this friend. I'm guessing that in your mind, the role of best friend and monogamous partner are tied up more than it probably should be for a platonic friend.\n\nWhatever the reason for this jealousy, the answer is to just remind yourself how silly the feelings are when they come up and continue to ignore them. If they're really bothering you, you could get therapy but I probably wouldn't shell out for that unless there was something bigger to talk about with the therapist.\n\nAlso, are you dating? I'm pretty curious if these feelings fade if you ended up in a dedicated and/or monogamous relationship.",
            "I understand where you are coming from. I’ve felt like I was in this situation in the past. Unfortunately it’s always going to be this same scenario no matter who you make friends with- there’s always going to be someone who has known them longer. What I did was shift my frame of thinking. Friends typically click with each other about different things. If I want to go see a horror movie, I go with BFF A because she likes them too. If I want to talk about makeup, I talk to BFF B about it, etc. Essentially, I have tried to make deeper connections with a small group of girls that fulfill different areas of my life, that way I don’t feel like I’m necessarily being excluded. I don’t love one more than the other, they are just different to me in their own special ways. And maybe what I said sounded a bit “transactional”- they are still people who are extremely important to me, we can do group hang outs and are my friends because we share common interests and values. Also, if I feel hurt about something I can take a step back, give it some time and then fix it. Maybe try looking for more friends outside of this friend circle you’re already in? It will give you breathing room.",
            "Yeah I've never been anyones best friend since grade school. Always second or third fiddle. FeelsBadMan.",
            "My best friend from high school, let’s chat her Sarah. \n\nSarah got engaged. Even though she’s one of my closest friends, I knew I wouldn’t be her maid of\nHonor. I expected it would be Jessica. But Sarah made a girl named Millicent her maid of honor. I had never met, or even heard of Millicent, so this was kind of random to me. Millicent ended up going full bridezilla mode on Sarah, so Sarah kicked her out of the wedding the week before wedding date. Millicent was extremely jealous of Jessica and asked Sarah to make me her maid of honor because she couldn’t handle Jessica possibly being her best friend. \n\nWhen i asked Sarah why she made Millicent her maid of honor, instead of Jessica from the start, she said they had been best friends in elementary school and she felt obligated to make her the maid of honor. Millicent was also threatened by the friendship between Sarah and Jessica, like you seem to be with Annie. \n\nI don’t like the term “best friend” because it implies you can only have one. I have three, none of which are in the same social circle. Actually, none of them have even met each other. Each is quite different than the next, and each is my “bestie” for different reasons. And I know all three have dear friends other than me that they would consider their best friends. Maybe it’s time to diversify your friend portfolio? Regardless I think it’s important to understand that she is friends with you and Annie for different reasons, and you’ll never be able to replace Annie. And Annie will never be able to replace you either.",
            "\"Best friend\" is just a title.  For me, that goes to my childhood friend who I've known over 30 years. We still talk regularly but she has young kids (mine are grown) and doesn't have much time these days, and in all honesty we just have less in common that we did in the past. I have a newer close friend who I met at work a few years ago and we have so much more in common. We have the same sense of humor and same views on things like politics, religion etc. I guess she more closely fits the bff title but it really doesn't matter. I love them both and know they will both be lifelong friends. Luckily friends aren't like romantic relationships and we don't have to choose. I really think you're overthinking this one. It sounds like you have some great friends in your life. It gets harder to make friends the older you get, so continue to nurture these friendships and be grateful your life is so full of so many great people!",
            "I have a Best friend from high school, best friend from college, best friend from the city and best friend from work. They all know I love them and appreciate them differently. Everyone has different relationships, if you want a close relationship with a person, just continue focusing on that connection. Don't compare to others.",
            "The top comments gave beautiful advice because no friendship or relationship is perfectly equal. I am Kasie in your situation. My best friend and I share an incredibly close bond, to the point where we view each other as sisters and were each other's MOHs, while I have another close girlfriend who I view as *one* of my best friends. I know she views me as her best friend and, although I view our friendship slightly differently, our friendship is immensely special to me and I love the time we do spend together.\n\nIt's difficult to explain because it ultimately boils down to how I feel when I look at the two friendships. The emotional bond I feel for my best friend is stronger than my other wicked close girlfriend. That does not mean I value our friendship any less or love her any less. It's simply a different type of bond. Try not to view the differences as a negative thing because you know that Kasie loves and appreciates you as one of her dearest friends, which is special in of itself.",
            "I have two best friends. I felt guilty for a long time for having two, as being a best friend is so special. It almost felt like cheating. But they both know how important they are to me.\n\nMy best friend, we'll call her K, has been my friend longer than anyone else I know. She's more like a sister to me. We don't always agree, she often annoys the crap out of me lol. We both have two kids; a boy and a girl. We'll always be there for each other no matter what, she is my family. She is the family I got to choose. She is a piece of me. \n\nMy best friend, we'll call her G, is seriously just... The greatest. I love her to pieces and can't imagine life without her. We reconnected a few years after we graduated high school after I messaged her first. Neither of us was expecting how close we would become after that. She's childless, so we can't connect there, but we connect in literally every other way. We're genuinely friend-soulmates. \n\nI can't imagine life without either of these ladies and (not trying to be morbid haha) I often hope I die before both of them because I seriously couldn't live without them. Neither is more important than the other, we just have different relationships. <3",
            "I have a relationship similar to Annie’s and Kasie’s. My best friend and I are a unit. I have other really good best friends and so does she. We even spend more time with these other friends than each other, to be honest. With my BFF, we just understand each other in ways other folks don’t get. We love and adore each other unconditionally and there’s zero judgement between us. It’s easier between us because we have the same intentions for one another.\n\nThat doesn’t make my other relationships any less meaningful or fulfilling. I wouldn’t trade those relationships or choose my relationship with my bff over them. Those relationships are just different. I’m sure Kasie feels the same way about you. You bring each other joy and fulfillment and that’s no less meaningful than the joy and fulfillment that she and Annie bring each other. It’s just different.",
            "I have like 9 people that I consider \"best friends\" from various and assorted points in my life. I have my best friend growing up. My two best friends from high school, 3 best friends from college, and like 2 best friends from adulthood I guess. I feel like at most times in my life there have been 2 or 3 people that are my top tier friends. Normally for different reasons but sometimes because we all hang together most of the time. There are always other people but these are the ones I see and hear from all the time. \n\nI guess what I'm trying to say is that they might be lumped together in their other friend groups because they were lumped together before you two came together. If people met you guys now they might say Kasie and you and Annie. Your friends might say you and Kasie. It will always be tough to pick top people like bridemaids and maid of honor and sometimes that doesn't even go to the top person but rather to the person that has been there the longest. You can't really change that without a time machine. Just know that you are a best friend and there *are* going to be times when she prefers you over Annie and probably even when Annie prefers you over Kasie.",
            "“The only way to have a friend is to be a friend”. Friendship is not a coin someone hands you. It is something you give to another person whether they accept it or not. \n\nThe problem you have presented is something most people learn in their early childhood.\n\nI think you have some growing to do in this department.",
            "I think the concept of BFFs becomes less and less common as one grows older. Some people who were really close(BFF close) when they were younger who manage to continue their relationship into adulthood might continue on this path of BFF-hood, but with people that we meet when we are older it seems to be less likely. It's not that the friends you make as an adult are less valuable or important, it's just that friendship as a concept changes a little.\n\nI would look on the brighter side in this situation. Apart from a couple of moments (being a bridesmaid, etc) your experience as one of the best friends is not that much different from Annie's. You are loved and cherished by several great people and that's what really matters. I'll tell you that when I was younger I was the type to invest myself fully into every new friendship, so I had fewer friends, but always had a \"best friend\" at every stage of my life. One friend in particular, I'm sure if she was getting married would invite me to be her maid-of-honor(at the time), but in some ways that were more important she didn't always have my back. I would much rather have a great friend who was there to support me than the BFF badge. That's not to say that what you are feeling is not valid but just to give you perspective on all the great things you already have with your existing friends.\n\nI think it's also important to add that relationships evolve and change. Sometimes we move away and grow distant, sometimes we find new friends, or reconnect with the old ones. What you're feeling right now may no longer apply to the friendships you have in a couple of years. Perhaps you will find another person who will consider you her BFF? When that happens I hope the feeling will be mutual :)",
            "I had the #same situation. I met J on base when my hubs was stationed out of our home state. She was married and lived across the street. They were also from our home state! We hit off so well, I watched her house when she went out of town, and she babysat my boys. She doesn’t have kids. But when the men got out of the military, we went to our home cities and it was hard getting together. We still talked constantly and she was one of my bffs. She had another bff, K. My husband and I separated on a terrible day in feb 2017 and the exact same day, K was found dead from an overdose. J didn’t speak to me for 7 months. She lost her two bffs on one day- one to death, and one because “I gave up something I should have treasured.” No, she knew the abuse I was experiencing and we could have been there for each other. We got together one or two times after that, but our friendship is over. \nSomeone above mentioned “best friends are tiered”. I have two friends that are lifelong friends, 20+ years, and J fit right in with them. But she never put me in that category. I was always there for her, but she just let me go. I’ll never understand it and the pain is gone now. My husband and I reconciled, and ultimately, #he is my best friend. One of my life long friends had actually introduced us, and is like my sister. \nYou deserve better. It takes a lot of work, but make more friends and connections. I’ve been burned so many times but there are other people out there feeling the same as you.",
            "This happened to me but I am your BF. There is a boy I met when we were 19 and I just knew the night I met him that I had to have him in my life. It was an extremely strong feeling and so I basically invited him out or tried to be where he was going to be. He and I went through some crazy crap together. My mother tried to commit suicide and his father died in an accident about a year after we became friends. I was one of the people who was there for him, just going on drives without talking, letting him cry as much as he needed, and walking through that horrible time. He was never really the same again, not near as light hearted. And 10 years later when I went through one of the darkest moments of my life, one that changed me profoundly he was there for me in the same way.   \n\n\nI made another best friend around that same time.  She was miraculously willing to reach out to me when I wasn't going to be a great fun friend because I circling the drain of hell. We also went through grad school together and have been great friends since then. I consider these two people the closest two friends that I have. But they are different. He is like family in part because of our ages and in part because of what we went through together.   \n\n\nThey are both incredibly important to me and I to them. Both are a life line. Both are very different people. Our relationships have changed over the decades as we are all married now and living in different parts of the country. In my mind Friendships of this type are really about the long arc and marriage will change the nature of your relationships too. Neither of the 3 of us have children but I'd imagine that would further change things.   \n\n\nI think reframing it in that way will help you see it differently. She just has more time under her belt with this other friend. That is all. As time goes on you will accumulate shared life experiences and I would focus on that being the goal, to nurture and maintain.",
            "Quick question. When you had that bad breakup did you also lose a lot of friends? If that's the case I would highly suggest therapy. I don't know. Your post reads to me like some kind of abandonment issues, not just pure jealousy of their friendship.",
            "You are still close with all of them and they seem like very good people who include you no matter the age of the friendship. I would be very happy with just that and not being absolute top number 1. To be honest you did spend your youth with a boyfriend so its unlikely you will find someone now who will make you their top bff number 1 unless its your partner. Most people as they get older don't even open up their friend circle to others so...you are very lucky to have found such great friends",
            "I mean, just be thankful that you have a best friend.  Or that you have a lot of friends still. For a lot of people moving,  parenthood, jobs, aging etc just kills most of your friendships.  I know A LOT of lonely 30+  year olds.",
            "I think you'd feel best if you pivoted to gratitude for having two wonderful friends who are very kind to you and involved in your life.",
            "I never rated best friend as a person, rather its kind of like a level of friendship. I have a best friend that Ive known since I was 2 years old, he was  a neighbor and I was basically raised by his family. \nThat being said, when I went to college, I moved in with a friend from high school. After 4+ years of living together, I consider him my best friend. \nThen I have my girlfriend of 2 years, who I see as my best friend. \nI would never think of picking any one of them as my “best” best friend. \nI just remind myself its healthy for me to have more than one best friends. And if I’m allowed that, then they are too. \nMy childhood best friend is married and considers his wife as his best friend. My roommate made other friends in college whom he related to more and hung out with more often. My girlfriend has a best friend who she refers to as her soulmate. (I know it sounds weird, but they just see each other as like complimentary equals) \nI respect each of their best friends, because they’re my best friends",
            "I'd recommend also reaching out to Annie to hang out more (like one on one with just her). I've found that so often these feelings arise when we are unsure about how close we are with \"other friend\". I like to think about it like an angle with Kasie being the point where you both meet. In angle ABC Annie is point A, Kasie is point B, and you are point C. Right now at point C you're \"dangling\" off Kasie. You're swinging around unsure what degree of the angle you want to be.  Reach out to Annie and establish what your relationship entails. Solidify what kind of friendship you have with her and suddenly your position becomes fixed and known. Change this angle into a Triangle and you'll feel more secure with both of the friendships. It sounds like you're scared of what you don't know, so finding out all the variables can help!\n\n&#x200B;\n\nI sure there are times when Kasie isn't free but you and Annie are. It's hard to make the first move but it'll bring you closer to Annie and by default Kasie. And who knows, maybe you'll end up having more in common with Annie. I've definitely had a few cases where I've ended up as closer friends with someone who originally was the \"other friend\".",
            "I've spent most of my life in a trio that's been palling around for over 30 years. One of these people I met when I was 1 1/2 and the other I met when I was 5. So yeah, basically all attached at the hip. But things shifted a bit about 5 years ago because they both met their \"people\" in their early 20s and I didn't meet mine until I was 29. They're now married mothers, and I just got engaged. So while we're all thick as thieves, the dynamic has changed because they're in a different life stage than I am.  \nPoint is, life is long and friendships grow and evolve. You might bond with Annie over something that you and Kasie have no point of connection. You and Kasie might go through something together that bonds you really deeply together. You cannot know what the future holds. But you know that Kasie loves you, and that's really powerful.",
            "This is why I don’t like the term “Best Friend” I use close friends. I used to use it back in high school and I kinda started to realize how it would affect people. Some people would have similar problems as the one you stated. \n\nThere is no simple solution to this, but I’m pretty sure your friend loves you as much as her other friend. The only difference is that she has known her for far longer than you and therefore she is more accustomed to her. It doesn’t mean she has you second on her mind.",
            "Some perspective when it comes to”maid of honor” stuff. I’ve been best friends with this guy for 10+ years, since college. About 5 years ago, Matt became close/best friends with someone he met from work (they would vacation together, travel) I was undeniably jealous. Work friend gave a toast at my best friend’s wedding (I was not asked) and it fueled my feelings of jealousy (that I never brought up). \n\nWas reconnecting with my best friend (his job involves global travel so we don’t see each other in person much) and I brought up the work friend, “Todd,” and that I used to be so jealous of the cool things they did/how close they were.\n\nMy friend and Todd don’t even talk anymore. They drifted apart and aren’t friends. Matt and I are still best friends and still there for each other, and the person I was jealous of isn’t even around. Matt never saw Todd as “more important” than me, and while Todd gave a toast, I’ve been there with Matt through way more and I’m still there.\n\n\nGrowing up, my one and only best friend moved cross country. They made new BFs, but we kept each other. Some of those BFs (from high school) are still around, some aren’t. But there’s room for my childhood best friend and I to both have other valuable people in our lives. There are things I can tell my childhood BF that I’m not as comfortable talking about with other people. When my childhood BF got married, there was a HUGE bridal party. I wasn’t in it. I was asked to officiate (perform) the ceremony instead. That way, I was still a part of the wedding, and it was a special part none of the other wedding party could have done. I will probably never get to be a Best Man/Man of honor, but my childhood BF and I figured out something that was just as special, if not more so. \n\nYou are viewed as one of her best friends, and you guys have matching tattoos, you are a favorite. I love steak and ice cream, but in different ways, but I love the shit out of both. She put a lifelong symbol of her friendship with you on her body. That’s a big deal. If you’re still having problems processing, some therapy sessions wouldn’t be a bad idea.",
            "Bruh, just wanted to say that I completely feel you. I have a best friend too, but I'm not HER best friend. It puts a bit of a divide in your mind, though I love her all the same. It gets really sad sometimes though. Don't really know what to say, just that you're not alone in how you feel. Hang in there!",
            "The way I look at friends is, I find the best in them.  Friend x is really funny. Friend y is very interesting. Friend z has a lot of common interests.  There isn't one of these friends who I feel is better than the other. They are just different.",
            "So I am not a fan of people in general declaring someone a best friend because somewhere along the line, someone will feel hurt by the comparison. Your position isn't an unusual one and would have been sidestepped if your friend declared all of her close friends \"close friends\" instead of creating a default hierarchy where the bff is the winner. Polite adults don't openly rank friends. I have actually told my daughters to not declare other kids their bffs because even though their declaration is made out of love, it can make others feel left out. My older one has several \"close friends\" at age 7.  The other option is investing more energy into the other relationships in your life so you also have many \"close friends\" -- while not falling into the trap of ranking your friends. When your friendship group is more diversified that you will feel fulfilled enough to not waste your time being jealous of other people's friendships.",
            "I have two best friends and a solid handful of very great long term friends. My two best friends, one I call my best friend or wifey, and the other I call my best friend or my sister. I love them both very much, but my wifey I’ve known longer and she’s been there for me through some very pivotal moments in my life, and no matter what trauma I’ve gone though she has always been able to be supportive and never backed away or couldn’t handle it. My sister best friend, we love each other unconditionally but she is more introverted and needs space from any trauma (conversely, she tends to keep her own issues to herself thinking they’re a burden, and to be supportive of her I just need to be present and let her come around in her own time). She’s like family: we’ll always be there for each other, and always love each other, even if the support isn’t constant. \n\nThey first met at my bachelorette party, and both were weary of the other, knowing how close I was with them both, but they got along amazingly and are friends themselves now. \n\nYou spent a very long time with one identity: the boyfriend girl. And it sounds like your best friend sort of filled that pseudo-boyfriend roll as far as companionship and comfort, so you bonded really well, but different friends meet different needs for all of us. Friendships are kinda like being ethically polyamorous lol, there’s no expectation of monogamy - you can have more than one best friend, and still be just as close with each other. Also, at different stages in life, different friends will step up or step back, and that’s ok. \n\nPlatonic love is a bottomless well; there’s always more, and loving one doesn’t damage love for another. \n\nYou and your best friend are besties because you love each other. She was there for you in a time of need. I’m sure her long term friend has been there for her during many times of need. Try to look at it as appreciating that your best friend had and has someone who loved her very much and was there for her for so long. \n\nMaybe she’s the wifey, and you’re the sister :).",
            "Super happy that you have friends, so many people don't and yours sound like very good ones.  People's lives tend to wander and things come and go, relationships rise and fall due to personal choices and physical location.  People screw up, sometime offend others and the like and friendships change.  You may get promoted to bff or join another army of friends in a different location.  Don't sweat this one because you have great friends.",
            "I get this. I was super close with one of my roommates, and then she met T. T is almost like the same person as her, and they instantly clicked. Now theyre inseparable, M (roomie) and I don’t live together anymore and she lives with T, and they always post photos together with captions like “with my fave/other half/twin.” We still all hang out, but T is clearly #1. It sucks.",
            "This resonates so much! As long as your relationship with your good friend is healthy and flourishing, I hope you focus on cultivating it and enjoying it for many years to come. It sucks to have this ‘rank’ haunting at the back of your mind, but I have found at this age and with crazy times right now, good friends are SO hard to come by. As i got older and lost so many ‘childhood friends’, I am so grateful for all the good people in my life now, even if it may not last. I think only a huge issue when your friend does not reciprocate* your support and treats you like a lesser friend. \n\nI consider my old college roommate highly on my closest and most trusted friends in my life, but I know she has many other best friends that she has had in her life for over 5-10 years.\nThis used to bother me when we were younger, but as we have entered our careers (and she applies to medical school) I know our friendship may take a hiatus or even end for a time- I value any time I have had with her and the close relationship I do have with her for now🥰",
            "I stopped using the term best friend years ago and now have sisters for life.",
            "Things can change with time. I had a friend in college I was closest to and a third friend who was also close, but not as much as friend A. 10 years later the second friend and I are both going through similar life stages so we are closer. In between there was a time I was busy so the ofher two were cooser. It's all okay.",
            "You all sound like lovely people. I'm glad you have such a great friendship!\n\nThis situation will absolutely change with time. The balance of your life and friendships will shift a bit, so you won't feel so much pain along this particular axis. You might even grow closer to Kasie while Annie drifts away, who knows.\n\nA few times in my life I have felt something similar--strong love for a friend, and sadness that it wasn't reciprocated quite how I wanted. It happened in college, and I've of course totally moved on and don't think about those folks any more. And it's happened recently, and in those cases, something just.... changed. I found new friendships and relationships and was able to stay friends with those people I loved, but without all the yearning. Their proportional place in my life changed for the better.\n\nEverything changes. I bet anything you won't feel this way a year from now.",
            "I’m 35 now. In my 20s I had a handful of best friends. Friendships are finicky and years ago I decided to not use the term best friend (after losing a couple “best friends”), except towards my husband. I have many close friends who refer to me as their best friend, but that doesn’t make our friendship any less because i don’t refer to them the same. They know where I stand when it comes to ranking friendships. I am there for them the same they are there for me.",
            "I had one best friend and she passed away. So now I have a bunch of really good friends and no bff. :/ I know it sucks. But you have people who care for you and make you feel included. And that by 30 is already awesome",
            "Looks like you have a ton of answers already, but hopefully this helps: instead of focusing on comparisons, try to shift your perspective...\n\nFor example, whenever you feel bad, try to make the habit of shifting it to “I’m so lucky I have good friends I can rely on and I’m happy I was able to meet my other good friend Annie through my friendship with Kasie”\n\nWhile you’re trying to shift the perspective to feeling grateful rather than upset about their longer history of friendship, also consider trying new hobbies or joining clubs where you can meet new friends (I know it’s difficult at the moment, but when clubs and activities resume again).\n\nAlso, if your partner makes you feel like you’re his #1, don’t forget to be happy about that too 🙂\n\nI have a BFF who I believe is closer with an old roommate, but instead of feeling upset, I am happy to meet more friends through my BFF and just happy that I have a couple of friends in general",
            "One of two things are going on: your actual friendship with this person is every bit the quality you are looking for, but youre letting yourself get hung up on the trivialities of title and allowing the mere presence of another friend blind you to the fact that your friendship is every bit as adequate as youd like. If thats the case i urge you to stop focusing on this other person and focus solely on whats between you and your friend and appreciate it. \n\nthe other possibility is that youre feeling like you like this friend more than she likes you, aka shes more important to you than you are to her. This possibility, like the first, actually has nothing to do with the existence of the other friend. If somethings out of balance between the two of you, its not like that other person leaving would suddenly make you feel “enough” by her standards. so if its this option, you need to again, stop focusing on this other friend. and second, you need to accept that theres a natural imbalance between you two, and decide if its worth it to you to stay in the friendship. you cant change the dynamic; itll either continue forever or may evolve someday. I have been there - ive had a few gfs that in my mind were the absolute top notch of what i was looking for in a friend and i had the best time with them and couldnt ask for more, but i could tell that im not held to the same regard in their eyes. With some of these i made the decision to quietly part ways. With one i decided it was worth it to me to still keep her in my life. you need to evaluate whT you can control and separate yourself if ymthere is stuff that stands in the way of your happiness",
            "I notice in the post that you may consider there to be a difference between your \"best friend\" and your boyfriend, and I want to suggest for a second that these two relationships are actually quite similar, which may hell how you approach this.\n\nExisting in your relationship with your boyfriend is a level of trust and intimacy. Even if there are things that you t o do together that strengthen your bond you still have to trust that he cares about you and wants to be with you and hang out with you. Perhaps it is easier to believe in the connection here because you two have a label (\"partners\", \"boyfriend/girlfriend\") that presupposes a level of security.\nThis, I think, is true of many relationships, where labels can bring comfort, and I don't think it's wrong to seek it out. However...maybe that's what you crave with Kasie? A label that will bring comfort and security?\n\nWhen people talk about you and your boyfriend I'm sure they easily say \"OP and BF\", and there's a togetherness that holds you two together even in other people's minds. But...this really isn't that different from a best friend. Whether we want to acknowledge it or not there's a level of trust we have with a friend (whether \"best\" or \"boy\") where we believe they want to be with us. If you employ this trust with your boyfriend, consider how you can apply it to your relationship with Kasie. How can you trust her to what this relationship to continue?\n\nAnd, maybe even more importantly, what are you worried about losing? What about the situation feels precarious that you'd prefer a title of \"best friend\" with Kasie?\nI think diving into the fear and uncertainties you have and examining them could help you. If you look at what worries you you'll be better prepared to let go of the fear, or to take it head on and trust in the friends you have.\n\nYou may also want to look into the term \"compersion\", which could help you redirect your concern into joy for Kasie and Annie. I think this is the healthiest way to approach jealousy/fear/envy, because your end goal becomes joy for others regardless of what they are to you personally.",
            "I feel for you OP. I’ve definitely been there. I don’t think all these comments about many best friends are particularly helpful, even though i fully believe in many best friends. But i don’t think the point is that you don’t value your friendship with Kasie or feel like she doesn’t love you. \n\nThe point is that it is painful to realize that there is no one in this world to whom you are the top priority. You’re not anyone’s first call, first pick, whatever it is. Even though they’d be yours. That’s what i’ve felt anyways. And i have always been surrounded by amazing friends and family who all love me, and i have never doubted it. It’s just hard when you don’t feel fully chosen by anyone. \n\nI went through this in a lot of different ways and times - it was especially hard as my best friends get engaged and married and move states and turn their lives upside down for these guys - one of my best friends moved to texas just to make her husband happy, for goodness sake. There is no one in this world who would move to texas for me! (To be fair there is no one in this world i’d move to Texas for either...but still). I’ve always just wanted to live close to my best friends. It’s definitely not a priority we share. They’ve all moved away for other people. \n\nThere’s even silly little things - like i can’t get my mom to have dinner with just me because she just can’t go a meal without my stepdad. They see each other every day and he’s retired so theyre constantly around each other, and yet....having dinner with him is more important than spending quality time with me. And the MOH thing you’ve mentioned - i was not my best friend’s MOH either. Not any of them! \n\nAll these ways that people show us “i love you so much and you’re really important to me! Buuuut clearly less important than this other person.” It just hurts. I don’t have any sort of perfect answers, i just wanted to share how i’ve experienced this in case it makes you feel a little less alone.  \n\nHonestly the only thing that has alleviated this for me is when i’m in a solid relationship and then i actually am someone’s #1.  And then it’s mutual so no feelings of rejection from the person who doesnt pick you back. I hope you find a way to feel happier in your friendship and i hope you find the kind of connection that makes these feelings fade.",
            "Consciously make an effort to set this thinking aside, while acknowledging that you’re not crazy or silly to want appreciation and elevated care from your “person”. \n\nI have several friends who I have long close relationships with, and some of them are quite active and successful on social media. I see them form close friendships that they display on socials and it kinda hurts and I get jealous. But they’re good friends and I remind myself that the point is the friendship, and I have a responsibility to nurture that by focusing on enjoying my time with them and having good exchanges, not getting caught up in drama. The concept of “best friend” is alluring but honestly can be so toxic. Even if it doesn’t seem like it, you DO offer things that Kasie can’t, and your companionship, divested from jealousy and insecurity, is probably more comforting in some ways than the sometimes cyclical “best friendship” trap. \n\nI find I’m a better friend to my friends when I’m not focused on how devoted they are to me or what we are to each other. It’s weirdly like how my relationships with dudes work—if I free myself from worrying about their commitment, which is more about my own issues which are many, I feel better, and they are more interested. I hope that doesn’t sound sick or manipulative haha. I really do feel your struggle.",
            "Can't you settle for being a trio?",
            "I have two best friends and don’t really see one as better than the other. Rather they both share different things in common with me and have different personalities so we compliment each other in different ways. They’ve gotten close to each other so now we are a trio and we don’t think anything about it. Both my best friends also have close friends and one has a girl friend (both are guys, one is gay and I’m a girl) and I know those other people have different roles in their life from me and I’m okay with that. I don’t even think it’s healthy to be one persons everything or to have one person be your everything (Not that you are saying that. I think the best thing to do would be to meet more people and make more friends and maybe you’ll find even more people to be close to that will fill in any friendship gaps you may have.",
            "Honestly, you are so lucky to have not only 1 bff, but 2 awesome friends who are friends with each other!  Cherish both of them, especially as you guys get older and enter your 30s/40s.  Good friends are hard to come by.",
            "If you’re truly asking How you get over it, you just do. You accept it. At 30, you should honestly be way past this type of high school concern. By 30, most people are absorbed in their own families and see their friends when it happens to be convenient for all parties, kids, etc, which isn’t often.",
            "I have friends that are best friends from high school and college. I have to admit I did find myself in your shoes a few times in my life. One of the things that I tried to put into perspective was this: my friends are allowed to have multiple best friends, I love those best friends because they can provide things I cannot provide for them, and I love my best friend and want them to be happy. I never want them to be alone so it makes me happy knowing they have that other BF.  \n\nI finally found my top best friend. That’s my hubby. I love him to death and we’re each others’ favorites now. It feels so nice to be that “favorite” even if it’s not with a girl. Trust me, I also wish to have my girl BFF but I know that later on down the road, I’ll have her one day. :) I feel that at our ages, (I’m 26) life is so busy happening that we can’t settle down or slow down and in result, we won’t be able to get that BFF. I feel that as we get older we’ll be able to find her. \nI’m really hoping so because I yearn for her myself. \n\nI hope you know that you’re an amazing friend. Keep doing what you’re doing!! Maybe at one point, you’ll become Kasie’s favorite friend and Annie will step down due to life circumstances. Life just works in the craziest ways!",
            "I mean, OP, what kind of friend would Kasie be if she \"ditched\" Annie for you? For goodness sakes, cherish both of them. I assume you want to marry in next 5-7 years, as will Kasie and Annie? You'll all be stretched for time to see each other one tenth the time of now! Enjoy what you have and stop stressing about it. I don't want to say \"first world problems,\" but ...",
            "In my personal experience I definitely agree that the whole \"best friend\" thing is like a tier as someone else commented. I have two people who I absolutely consider my BEST friends. And each of those relationships are unique and different from one another. But I also have a couple of other really really close friends who I would also consider to be on the best friend tier. Just in different ways. I try to just appreciate the relationships I DO have with my small friend group because they are all capable of making me very happy in their own special ways. I have matching tattoos with a couple of my best friends and I don't value one more than the other I just love that I have symbols of my friendships on my body. \n\nOh and I know for a fact that my best friends have other best friends as well that aren't even a part of our friend group. And if I'm being totally honest I do occasionally get a bit of a pang when I think about my friends other close friends because I just don't have relationships with those other people. Whats awesome about your situation is that you are good friends with both of them and you can all do things together! \n\nI don't know that anything I've said here is at all helpful but I hope it is. I know how important strong friendships can be and since having female friends is new to you I do understand why you feel the way you do.  Just don't assume that you don't mean just as much to your BFF as her other friend. I'm sure she loves you both like crazy. Just in different ways!",
            "People meet different best friends at different stages in life. One of my BFFs is from high school but we havenet been able to live in the same area for 6/7 years now so or lives are pretty separate. I met my other BFF during my undergrad and we have lived a lot of stuff together and have grown from 18 year olds to semi adults together, sharing a lot of deep stuff, and I have the other BFF from my masters which I did in a completely different city. All three are very different people and have actually never met haha. I love them 3 in 3 different ways but there is no competition. BFF n2 has a new BFF who she’s been working with and n3 makes new friends easily.\n\nMy point is that people don’t always have just one BFF, and that there’s no hierarchy or competition. I also have a tattoo I had on a whim with another friend when she visited me (she’s from another continent).\n\nAnd if you’ve read this far m, my advice would be to simply talk to her about it, so she can reassure you and explain to you herself that her being BFF with Annie doesn’t mean you can’t also be.",
            "Co-sign that best friend is absolutely a tier, and there needn’t be just one. However, I also have someone I have long considered to be my top-tier best friend, but she has a BFF who is not me. Her best friend has been her friend since kindergarten, they live in the same state whereas I don’t anymore, and I know that in a gun-to-her-head situation, my best friend would name this other girl as her BFF. And it’s taken time but I’ve been able to accept that it’s ok! I have other best-friend-tier friends who might consider me their number one that I maybe wouldn’t as well! But I ask myself, do I care about these people less? No! Sometimes it’s just the situation. I know my friend and I have a relationship that we don’t share with others. And that supersedes any ranking for me. When she got married, I was not her MOH. This wasn’t a surprise, as neither she nor her BFF have sisters, so this was always an understanding between them. I do have a sister whom I consider my ultimate BFF, and that’s my privilege. Always in life there are going to be best friends and it just depends where you fall on the spectrum. I don’t know if any of this is helpful for you, and you’re not childish for feeling like you can’t measure up in some ways. But the truth is, unfortunately, you can’t. But it’s been helpful for me to focus on the value of the friendship rather than the official ranking it holds.",
            "It's something that you have to get used to. Everyone loves someone else more. That's why everyone says to marry your best friend because you guys chose each other and will forever. My best friend is an ex that I dated twice, but he knows me to my core, and I know him to his core too. I would throw my life away for this guy's safety. I have a girlfriend that I have known since I was like 8? and we have been friends for like 13 years now, and she is my RIDE OR DIE. No one can replace her. I would do anything for her. my love for them is equal, but just because I don't call her my best friend doesn't mean she is #2. it's just a label. I got another friend that I casually dated, but it didn't work out, but he is MY \"(insert nickname here)\". No one compares to him, and I NEED him in my life. I don't call him my best friend or my sister, but MY \" name\". is evenly loved as my best friend and sister, but they all serve a different purpose in my life. labels in friendships are just labels. Labels are more serious when it's a relationship.",
            "I have two best friends who I love like sisters, but they are closer to each other than they are to me. I can understand what you might be feeling. They both got married recently and even though I was in the bridal party I wasn't the mid of honor. It is a little frustrating sometimes, but I just try to accept our relationships for what they are and love them in my own way. \n\nMy advice would be just to try to accept the genuine love she gives you. Appreciate your friendship for what it is instead of what you wish it was. Clearly if this girl is your best friend then you must have a lot of great moments and memories with each other. Try to focus on the things about your friendship that make it awesome.",
            "[deleted]",
            "....by not acting like a teen and rating your friendships. Why does a friend have to be \"best\"? They're your friend. That's good enough.",
            "Try not to sweat it or be (overly) concerned.  In a whole lot of friendships and types of relationships, it's not 100% balanced and mutual and the same both ways 'round.  If it works reasonably (or better) for you, and them, great - nice bonus in your life.  Nobody's being \"used\" or abused, cool.\n\nPlenty of serious problems to worry and be concerned about.  The above ain't one of 'em ... thank goodness!  So, be glad.",
            "I'm nobody's best friend. It's something I actually realized a few weeks ago... It's hard knowing it I guess, I don't know your situation, but I think ultimately it came down to me not trying hard enough to be a great friend to my past friends. I was always so passive and I suppose unappreciative. Now I'm alone. I think I'd say to you be happy with what you are to them, and when you see them make them feel loved!",
            "I can relate 100000% and I don’t deem it childish. It’s a simple and basic human need to want to feel important to people.",
            "So I was in a really similar situation. My best friend Kayla (\"Y\") was best friends with Kaila (\"I\") from college. I always knew \"Y\" was my best friend, but knew she has so many awesome people in her life, I didn't think I made actual \"best\" friend rank.\n\nThen something terrible happened; \"Y\" died. And all of these people were offering me condolences, and I helped her mom with funeral arrangements, and her parents wouldn't even go in her house without me because I was \"her best friend.\" And I realized that I had been all along, I just always thought she was out of my league, so to speak. And she had \"I\", so I didn't think that left room for me.\n\nTry to not let yourself get so caught up in the terminology that you miss out on having some really wonderful friends to share your life with. I've learned that best friends are really special, and they aren't at all easy to find. I'm lucky, because in a weird way \"Y\" left me \"I\" as a twisted consolation prize, and now she's my best friend from 1500 miles away. \n\nI'm really glad you have not one, but two awesome people in your life. I'm sure they think more of you than you know. And they're very lucky to have you.❤️",
            "I quit calling people \"best friends\" in middle school.  I have lots of friends, some are better than others.",
            "‘Best friends‘ is a concept created by Innately manipulative personalities, when they are children, to make their friends compete, or as some form of incentive. \n\nThe concept doesn’t belong in mature friendships",
            "No real advice but I 1000% relate.. it’s kinda funny tbh. I feel like it bothers me most when something else in my life isn’t going 100% right.",
            "I'm just chiming in to say that feel for OP because there are so many scripts for how to deal with romantic relationship jealousy, but people don't really talk about friend jealousy and asymmetry. This is hard stuff and I'm glad she came here to vent.",
            "You must strive to become Annie's best friend to complete the circle.",
            "Bro. You are 29. Friends are friends, whether best or not. Just move on and realize to appreciate people for who they are and how they treat you... not how you perceive them to prefer you over other friends.",
            "You're 29... arguably too old to have a best friend or use the term best friend.",
            "I'm 15 and over the fact that I'm not my bestfriends bestfriend.",
            "I know how you feel. My best friend and I have been friends for about 16 years, she was my bestie up until about 9 years ago and I was hers. However, 9 years ago she got a roommate and they lived together for a few years and shared many experiences. They became very close and started calling each other “my person” (like Meredith and Yang from Grey’s Anatomy), they still do that to this day (on social media), and it still hurts me, even after all these years. We are still very close and I’d say she considers me her second best friend now but to me she is and will always be my best friend, even though I have many other friends. However, the other girl lives much closer to her and I live in another country so naturally we get to hang out way less. It’s funny that in my mid-30s this is still something that hurts me a bit, although it definitely hurts less than it did years ago.",
            "I just can’t imagine being upset that my friend has other great friends! That’s good for their life. I want my friends especially best friend to be happy. You need to just stop those thoughts when they sneak in and learn to be happy with it. It honestly is ridiculous. Get a hobby.",
            "While I can definitely see why you desire to be the top of the \"friend hierarchy\", but I guess the way I look at it is, you have the person in your life. Whether she considers you top of the friend hierarchy or not, what matters is she's not gone since moving out. You can contact her, share life experiences and dialogue, and that is what truly matters. But I can see why you just wish you were #1, with this envy and all that. But it would be much worse if she left and cut away from you.",
            "I had a similar situation with my college roommate where she was my absolute best friend in the whole world, but her best friend was her childhood neighbor who she had a sister-like connection with. I loved both of them, but really kind of resented her childhood best friend because I never had that and it made me feel insecure.\n\nAnd then her childhood best friend died. It was the saddest, hardest, most grueling experience for my best friend, and it really put into perspective how absurd and petty my feelings were. I would give anything to bring her back so my best friend didn’t have to deal with the earth shattering pain she experienced at the loss of her best friend. \n\nJust some food for thought. Life’s too short for pettiness.",
            "To be completely honest I do understand this a lot. I always had a best friend growing up who always favourited their other friends more but a few years ago I met someone who people describe us as who you did about your best friend and hers. As much as it may suck that you want kasie to be your other half doesn’t mean she is. It also doesn’t devalue your friendship and I’m sure she adores you like you do her. All I’m saying is one day you’ll have a best friend like that and this feeling will go away",
            "Honestly, putting too much value in friendship is not really healthy. You are you, Kasie is Kasie and Annie is Annie. You are all grown up and independent individuals. You all have different perspective and thought on life. So why compare yourself by saying on is a \"best\" friend?\n\nI have a lot of close friends and my friends have a lot of close friends. By putting someone into the \"BBF rank\" is almost rude because somehow that is saying one of them is better than the others. Just think about it. Would really want to reduce your friends values down to just that? Is there not enough individuality in thoughts and opinion that you can just pick the best product?\n\nIf your friend is still having you as her friend then just be that friend. Support her when she needs, however, don't let it be one-sided. Just like in any relationship it's about give and take (with care and respect). If you want to spend more time with her then ask. If she often decline then maybe you should ask why or reconsider your friendship. Compatibility is also goes for friendships. Though from your text it seems very much like she still consider you her friend. \n\nIf I were you I'd ask to spend more alone time with her, maybe even ask if the reason why she likes having me as her friend. Also tell her why I appreciate her company.",
            "Love doesn't divide, it multiplies.",
            "Maybe someday you'll be someone's best friend. Maybe your SO.",
            "Accept that there isn’t much you can do. They’ve had a lifelong friendship and you’re still good friends. Not much to worry over.",
            "I've never had much time for close friends because I work a lot and in many different places. I'm always in awe of people who have the time and static job prospects to be able to have any steady friends at all. I'm perpetually the new girl at the party, and a nobody at that.\n\nThe grass is always greener on the other side of the fence. Sometimes we idolize an idea so much that we forget to appreciate what we have. I hate to pull the \"kids are starving, eat your dinner\" trick but it's true. Some people have no friends.",
            "No one friendship is the same. I'm sure she loves and cherishes you just as much as Annie! Friendship is a beautiful thing, you all sound so close and you're lucky to have each other! Don't take the friendship for granted and constantly second-guess it; enjoy the moment and each other. You're not the \"less best friend\", you're your own version of Best Friend <3",
            "I’m super competitive about affection and attention from my best friends. It’s totally ridiculous and my husband regularly reminds me “Babe. Here you go. Not everything is about you.” So I reel myself in and remind myself that they are human beings who deserve multiple systems of support as do you. \n\nEach friend will play a different role in your life and in your best friend’s. Keep in mind that you have a super special place in her heart and what you have is unique to your friendship and irreplaceable. \n\nOh and get you some more best friends! The more, the merrier.",
            "Each friendship is unique and though some people are closer than others often times it really is apples and oranges. I have different people I would call my best friend for each their own reason. Friendship can even change a lot over a year, sometimes being very close with some people, other times drifting away. Don't worry about it, they have history but you have shared so much with your best friend that others have not and will not. Even my own best friend, that is widely known as my other half doesn't connect with me in a lot of ways some of my newer friends do. Thats okay, people have lots of sides to them",
            "Just enjoy each friendship you have for what it gives you: a laugh, a shoulder, nights out, or shared hobbies. Even more importantly, consider your relationship with yourself and these self imposed pressures to own other people won't be necessary.",
            "You seem to already know that worrying about ‘who is your best friend is right now’ is childish! Don’t worry about who is ‘best’ like it’s some sort of ranking. Always be the best friend you can be to all of your friends. Do that and I’ll promise you’ll look back in your memories fondly and proudly, and your friends will appreciate it!",
            "Just be happy you have a close friend. I have one friend and she lives five hours away. Other than that, I really only interact with my Bf, his family, and my 3 coworkers.",
            "Hey yo, I struggle with this too. No advice, just support.",
            "I think you should focus on feeling fortunate to have so many loving friends in your life.  Kasie and Annie have a long history.  For now, Annie is her #1.  It may stay that way forever; it also may change due to unforseen future circumstances. \n\nI'm 57 and have NEVER had a female bff like that.  My family sucks, so my friends have always been first for me. Most people just don't have the time to make a friendship a priority.  I honestly think one trick to happiness is being grateful for whatever good things come your way and not worrying over the perceived good things that others have.",
            "Be grateful for what you have and realize that there is nothing wrong with your situation right now.\n\nThis what peeves you is nothing but a meaningless petty feeling.",
            "I think it might be helpful to remember that we have different friends in our life for different reasons/purposes. They don't all fulfil the same role or need. Annie may be Kasie's \"best friend\" but you are \"one of her\" best friend's because you bring something to her life that's different from anyone else. Our relationships shift and change as we grow, you may meet someone else down the line who you form this kind of bond with, or maybe you'll meet a whole other group of people you'll start getting together with.\n\nMy sister and I are \"best friends\". I was the Maid of Honour at her wedding, she will be at mine. I am the person she often comes to first about the \"big stuff\" (and vise versa) however her other \"best friends\" are able to be there for her in a different way from how I am. They offer forms of support I can't. As an example, I'm known in my group for being very non-materialistic, so when my sister texted me on her anniversary to send a picture of the gift her husband gave her I responded, \"Your nails?\" turns out it was the ring. I assumed the ring in the photo was her engagement ring. Apparently this was hilarious because it was very different but I'm not the type of person to notice these things. However her two other besties knew right away and were able to properly fawn over her new bling. In that moment they provided a type of support my brain simply isn't wired for.\n\nI'm SURE you do the same for Kasie.",
            "You’ve gotten so much good advice here! One thing I want to say is that you say you feel childish but I think that kind of makes sense. Most women go through this feeling to some degree as teenagers - it’s part of normal social development. But during that time you were more focused on your relationship with your boyfriend. So you’re going though it now. \n\nThe good news is that I don’t think this feeling lasts forever. It’s truly a developmental *stage*. And once you’re through it, you’ll be better equipped for rich, deep friendships.",
            "I have always felt this way about my best friends. I honestly would be like so obsessed like wanting this BFF relationship and I would be so jealous if my friends have other friends that they felt were also their BFFs.  After a lot of self reflection I blame it on that I’m an only child. I was always the #1 priority to my parents and I feel comfortable having that kind of attention. I never did well with big social groups for this reason too.",
            "Awesome, relatable thoughts and comments. x",
            "It feels childish because it is childish. You’re 30. Who cares?!",
            "Tldr : you are a lesbian"
        ]
    },
    {
        "post_id": "p1pg2b",
        "author": "Throwawayadoptedgirl",
        "title": "UPDATE: My (19F) Biological father’s (45M) wife (40F) wants me to just “leave them alone”",
        "url": "https://www.reddit.com/r/relationships/comments/p1pg2b/update_my_19f_biological_fathers_45m_wife_40f/",
        "score": 3451,
        "num_comments": 267,
        "created_utc": 1628603024.0,
        "selftext": "Hello! Sorry this update has taken a while to come out, but I promise there is a good reason for it!\n\n1. My girlfriend drove down to visit me for a week and I was preoccupied spending time with her\n\n2. I was really hoping that the news I have to share with you would change\n\nSo long story short, I took the advice I was given and muted Heather’s messages to me. The stuff she was saying to me has really gotten to me and at this point I’m not quite sure if I’m the bad guy. I called Harold and talked to him about the situation, and told him that I don’t think it is in my best interests to be talking to his wife. \n\nThis is where things took a bit of a sad turn. Harold agreed with his wife and said it would be best if I just left them alone for a while. I was stunned for a few moments, because this is the opposite of what he had told me less than 24 hours earlier. That said, even if he had said something else beforehand, I know that I have to respect his decision. I told him that I would stop all contact, and when he is ready to talk again it will be on him to message me. That’s where the call ended, and we haven’t spoken since.\n\nIt sucks. I’m kinda hurt. I know I have no right to be hurt about it, but I still am. I’ve come to the decision that it’s not my job to make them like me. This was probably not going to end any other way. It’s painful, but it’s the world we live in.\n\nI’m sorry I don’t have a happier ending to share, but I’d still like to thank you guys for the amount of support and loving messages I received on my first post. I don’t think I could have endured this without you guys, and the validation you provided me. Thank you for taking the time out of your day to send such kind messages and helpful advice. I appreciate each and every one of you, and am sending virtual hugs!\n\nTLDR: Harold’s wife got to him, and there is no more contact. She won, and I am leaving them alone.\n\nhttps://www.reddit.com/r/relationships/comments/ovetpp/my_19f_biological_fathers_45m_wife_40f_said_she/?utm_source=share&utm_medium=ios_app&utm_name=iossmf \n\n(ALSO if I link the old post wrong, please let me know so I can fix it!)\n\nEDIT: Yooo!! I got on one of the Reddit YouTube videos! Apparently everyone on YouTube either thinks the story is fake, or that Heather’s sons don’t belong to Harold. ALSO, I still haven’t heard anything from Harold. I’m starting to think that something is either very wrong, or they genuinely don’t want me around. I’ve stuck to my guns though, and I’m not contacting them.\n\nEdit 2, in October: Two things have happened! \n\n1. I needed to reach out to him because my cat got sick again and he works in pet insurance and care, and I asked him for advice on what insurance carrier to use. It was cordial and completely professional. No emotions and nothing other than business. It hurt to see him act so cold, but thus is life. \n\n2. His wife, who my Dad (Markus) now refers to exclusively as “Heather”, updated her Facebook so that it says “Stay in your lane, Bitch”, directly under her name when you click on her profile. I feel grossed out that she’s acting like I’m some jealous lover who wants to “steal her man”. I’m his kid, not his affair partner. \n\nAlso I’m going down to see my girlfriend this December!! She’s been the biggest help and support throughout this disaster. If I ever get a more significant update, I’ll ask the mods to let me post a part 3! I doubt I’ll get one though. I think this is where this saga ends. I have an adopted dad who loves me, and a biological mother who loves me. I think I can be content with that. :)",
        "permalink": "/r/relationships/comments/p1pg2b/update_my_19f_biological_fathers_45m_wife_40f/",
        "comments": [
            "It's absolutely okay to be upset about this! Give yourself time to greive, it's okay.",
            "Lol, dont think \"she won\". Neither of them did, and you shouldn't feel bad for that. If anything, you should pity them.",
            "[deleted]",
            "I’m sorry for what happened. I hope that, when your brothers are older, they find you and you can develop adult relationships. Your father gave you one great piece of advice here which is “you be you.” Keep doing you and the right people will come to you in love and the people who continue to live in fear, well, that’s their journey. MEANWHILE, you are still entitled to a complete medical history or your father, and whatever else that entails (sometimes a genetic test of the father can help you diagnostically). But that should be handled by someone else, maybe the disability lawyer? Let that be completely separate from any social-familial relationship. You are NOT a second class citizen, whatever Heather wants to believe. You sound like a great self-advocate. Keep it up!",
            "Hey OP, I'm really sorry this hasn't turned out the way you hoped. I hope your health doesn't deteriorate more, too. This might be me overstepping a little, but you write super well - your first post was well organized, succinct, and captivating. Perhaps you might want to try a writing career to help out your disability income.\n\nBest of luck!",
            "Sounds like Heather is an absolute POS and Harold an spineless man. You’re better off without those people in your life. \n\nFocus on your health and staying positive!",
            "Please never think your feelings arent deserving of space. Feeling hurt over rejection is one of the most natural human responses, especially from any sort of family or parental figure. We need them to survive and our instincts dont catch up with the rest of our brain knowing we are resilient and can be okay on our own too.  And you put yourself out there, hoping for more than medical records. That takes time to process.\n\n\n\n\nI also want to say, as a kid who is semi connected to one bio parent but not the other, reconnection takes a lot of time and awakens all sorts of complicated, overwhelming feelings in all parties. Although blaming his wife makes sense from what you've shared, he may also be using her as a shield/buffer because he doesnt want to be the \"bad guy\" and she may feel protective and angry at him being in that position. I see a lot of talk about jealousy and pettiness, but it is likely much more complicated.  She doesn't know you, just as harold doesnt really know you, and Heather will always prioritize her children and Harold over a new party. I dont actually think she was trying to be cruel from what I can see. She could have been 100% honest and Harold could have lied, it's hard to consider but people handle change very poorly and often back out of big emotional situations. She sounds like she has firm boundaries and both of them need to be communicating better, you should never have been put in a spot where they triangulated with you and it seems like that was definitely happening.\n\n\n\n\n\n\nThe best thing you can do to cultivate trust and a sense of safety is respect their request, avoid sending large emotional messages,  and take care of yourself in the mean time. In some ways it isnt fair but in other ways it makes a lot of sense, especially if Heather was being honest that she got a lot of aggressive messages from your mom (which wouldnt surprise me based on the history she had with your dad).  If you havent talked to a counselor familiar with family reuniting, I'd consider it.  Although a relatively rare situation for the general population, this is a pretty common reaction for adopted and foster families, and it might help sort some of that out",
            "Before you get too convinced that Harold was all innocent in this until his \"wife got to him\", remember that Harold rejected you from the moment he found out your biological mother was pregnant.  His behavior toward you now is nothing new.\n\nYour biological parents and Heather sound like trashy people all around.  If your adoptive family is good, embrace them as your own.",
            "I don't think it's because they don't like you, Heather feels threatened by you and Harold is threatened by Heather. Heather is controlling the situation because she is insecure. Heather sucks.",
            "This sounds sus, I hope he's not being manipulated by her (I've seen this in my own father and his new wife). But above all, I just hope you're able to get the care you need without him, the surplus of you warning him for his sons' sake; there was no benefit to you doing that, that was out of the kindness of your heart and if they can't appreciate that then they don't deserve to know you. I hope things improve for you.",
            "His other kids have witnessed a hard lesson about their parents.",
            "I took the Ancestry test and have found my bio-dad and bio-mom. The bio-dad's family accepted me--his wife was like, whaddya gonna do?--and the siblings have all accepted me, especially since they knew all I wanted was a relationship with them.\n\nThe bio-mom's family, however, treats me as a hoax (but one sister DID take an ancestry test, and her genetic match is even stronger than one of my bio-dad's siblings). My bio-mom doesn't even know I exist, thanks to the oldest brother who seems to be the gatekeeper and some senility going on with her. (I'm 65, she's 87.)\n\nInterestingly, I had a heart attack caused by familial cholesterol on my mother's side. I informed the sister who informed her siblings, so I'm keeping hope that they know I have a good . . . heart.\n\nKeep being hopeful, but don't let this woman dominate *your* life. It is *their* loss, because your presence would have enriched them.\n\nEDIT: clarified some details",
            "Sorry OP, I had the same thing happen with my old man, this was years ago for me (I was around your age at the time, 24 now).\n\nI had sorta started trying to have a relationship with my old man, Mom picked bad men to be with but I was proud to say my old man was at least the best of the 3 marriages she did have. Suffice to say it changed when he found a new woman, I sorta became this weird baggage to his new relationship and it was apparent that there wasn’t a place for me any longer.\n\nTruthfully, he was an alcoholic, always had been, so I wasn’t really shocked that he decided to do it. Alcohol and cigarettes are legal ways to ruin your life, not everyone can handle them and by no means should they for their long term health. I mostly chalked it up to an error in judgement due to his historical bad choices and continual ones.\n\nAt the end of the day it definitely stings a little, but if he wasn’t previously ever a large part of your life, and doesn’t have the willpower to be, then I think it’s more of a loss for him to not know his child and the person they grow into.",
            "You're really strong, just focus on yourself right now. Harold seems like he's under a lot of stress at the moment and has a lot of personal things to sort out, hopefully he'll come around when he's ready, and if not, that is 100% his loss.\n\nKeep working for yourself, you're doing great!",
            "It's very difficult to get in between a married couple and win, even though you are his biological daughter, your biological father has known his wife for longer so this was likely to happen.\n\nPerhaps in the future when the sons grow older and independent, you can establish a relationship with them.",
            "Though I know it must feel like it to you at the moment, I have to clarify she did not 'win'. They both lost. \n\nI am so angry for you. Even if your Bio Dad contacts you in the future, I'd keep him at arms length. There's nothing I hate more than cowardly individuals who will harm anyone and everyone as long as they think it's less likely to rock the boat. I know you currently see this situation as 'Heather got to him'... but the reality is - at best - that he enabled this and didn't stick up for you. At worst, he deliberately used Heather as his guard dog. \n\nI know it must really hurt at the moment, but try and focus on the positive things / relationships in your life right now (like your GF, friends, hobbies). You deserve love and respect; don't try and chase after those who won't give you either, hoping that they will. I know it's cliché, but the saying 'when people SHOW you who they are, believe them' really rings true here.",
            "Hey OP I’m so sorry it’s taken this turn. Heather seems to be massively insecure and she is taking it out on you and unfortunately your Dad is trying not to rock the boat with her. Who knows what she is saying to him? She could be threatening divorce and taking away the sons. It really sucks and I hope that some day your half brothers can get to know you away from their mother and her issues. \n\nI wish you peace and joy on your journey.",
            "I read your original post and was hoping Harold would pull his head out of his ass, I'm sorry he didn't. \n\nAs a parent I can't imagine telling my child \"sorry, we should have no contact because my spouse thinks it looks bad.\" That says so much about him as a person and none of it good. \n\nI hope you got all the health information you needed, take some time to grieve the relationship you didn't get to have with the person you thought he was, then go out and live your best life. Best wishes going forward. 💛",
            "I feel you OP - I established contact with my estranged bio father after 30 years of abandonment, just because I was curious and wanted to know more about him/health history/other family etc. He wrote back to me and sent a card once and then nothing. I tried again a year later and suddenly I got a phone call (voicemail) from his wife saying she \"needed me to call them back\" and I just couldn't do it, based on the same kind of fears you talk about - I didn't have any interest in being rejected again.\n\nI don't regret not returning the call - as I said to my best friend the day I received the voicemail, \"She said she 'needs' me to call them back - well I needed a dad but sometimes things don't work out.\" I had a good laugh, decided that it wasn't worth much effort to try to be in contact with someone who didn't make any effort at all for 3 decades and really isn't making one now. \n\nPeace.",
            "I am a woman but holy shit OP- I will be your dad! You seem like an awesome person- funny, intelligent, resilient and brave as hell. I would be so proud to call you my daughter! \n\nHeather Duke hasn't won because you haven't lost! Harold has lost. You are the prize that they are missing out on. Don't let them determine your worth- they have not rejected contact because of you, it is because of their own fragile lives. Their life is so unstable that they think that letting anyone else into it would break them apart. They are not destined for a happy life but you are! \n\nGood luck and don't let the twats get you down!",
            "Hi OP - adoptee here.\n\nMy opinion is that Heather may have had a “perfect family” you know… the kind that meets young and does all the right things in the right order. Now that you are proven to be part of Harold’s family, she may see you as a threat to her perfect family image. \n\nRegardless of the reasoning, her behavior is abhorrent and inexcusable…. Both before and after dna testing. \n\nAs for Harold - he may also be having a hard time with separating you and his family and figuring out how to handle all the things that are happening vs what he wants to happen. \n\nNot to say that “she won” but maybe he is taking a step back to reevaluate his life and his priorities. Hopefully his new future unfolds with you as part of it. \n\nYou have every right to feel the way you do and take all the time in the world to “become ok” with what your situation is. If it helps, I found my bio parents in Korea… divorced and neither of them wants me to be part of their lives even though I’m the only kid they put up for adoption out of 5, and I still struggle with those feelings sometimes. There is no “cure” for rejection.. time helps everything to scar over but you never truly forget… you just learn to live with it. \n\nPlease feel free to contact me if you need to ❤️\n\nAll good feelings your way",
            "Did you at least get the health information you needed first?",
            "34f here, lifelong illness, abandoned by father first then mother :\nTheir loss. \nI am a freaking hero, and so are you.\nLife will be hard on you with those health issues, but I can already tell how smart and kind you are and those are two major keys to success ;)",
            "•HUGS•\n\nI missed your last post so I am just catching up. Oh, honey. I am so sorry that it all went down like that and I’m so sorry you’ve had such poor luck with your health. I’m glad that you finally seem to be getting some answers on the health front, though.\n\nIt sounds like Harold and Heather already had a rocky marriage. Honestly, Heather sounds like she’s controlling and emotionally abusive. I feel bad for Harold and their two boys.\n\nPlease separate their reaction from you. I know it’s hard, I’ve been actively working on that myself in therapy. But, in all reality, Heather is lashing out at you because she is clearly jealous and unstable. You did not make her that way. \n\nYou have done nothing wrong and it makes my heart hurt to hear that you think you’re to blame. Any sensible person would do what you have done. You are not “forcing your way in.” You were listening to what your doctors recommended to do to maybe maybe find some answers to help you survive and trying to inform them for the safety of their kids.\n\nI truly think that Harold’s first reaction during your first heartfelt conversation is his true feelings. And I think it’s safe to say that Chloe’s side of the story is probably more true than Heather’s, based off how Heather has treated you. Block her on any format including her phone number. She is a toxic human being.\n\nLastly, it sounds like Harold is doing what he thinks is best to keep his family afloat. I don’t know how young their sons are and Heather sounds like a vindictive… piece of work(my first comment got removed because of the real name I called her, oops!) Anyway, I’m not trying to justify Harold’s decision because I think he chose wrong.\n\n I don’t want to give you false hope, but I don’t think this will be the last you hear from Harold and something tells me their sons may try to reach out to you when they are out of the house. But, truly who knows. Don’t expect it, but hopefully it will be a pleasant surprise.\n\nGive them the space they need. Honestly, enjoy the silence from Heather. Please don’t blame yourself.\nAnd if you ever need anyone to vent to, you can DM me <3 Good Luck. -oh, and hi OP’s adopted dad! You sound awesome!",
            "She didn't win, your peace of mind, is greater than her. What happened is manipulation. That's rarely, ( if benevolent, it is ) a winning situation. You did your best. I gather your father will reach out. Not too give you hope. But, to keep it positive. I'm sorry to hear this. <3 Warmth..",
            "i bet you harold's guilt is eating him alive right now, this doesnt seem to be what he wants but what she wants",
            "If you ever need some encouragement or just to vent, can I recommend two subs? \n\nR/momforaminute \nR/dadforaminute\n\nI hope the doctors figure out what’s wrong soon and that you recover quickly. It’s hard dealing with emotional trauma while you’re sick. It saps your energy. \n\nI recommend trying to put these two out of your mind and focusing on your own emotional and physical well being. My daughter has chronic illness and watching her suffer is hard as a mom, but I do my best to make her life less stressful. \n\nPlease take care of you. You deserve the best.",
            "I'm so sorry this is happening to you. \n\nYou have the right to feel any way at all. Never doubt that.\n\nGood luck.",
            "Don’t invalidate yourself by saying you have no right to be hurt. You are aloud to feel your feelings. I’m sorry that your bio dad does not see your value, this is his loss, not yours.",
            "I’m sorry for what you’re going through. I never met my dad and can imagine it hurts getting your hopes up and having someone be so against you even having a chase to know them because of their own insecurities.",
            "I’m so sorry. I hope Harold pulls his head out of his ass soon and sees the light of day so he can tell his wife to mind her own business and let him do what he wants! Sending you hugs 💜",
            "You’ve gone through so much in your life already despite being so young and I want to tell you that I’m so proud of you for taking everything life has thrown at you so well. Please continue to be strong not just for you but for your adoptive parents. ❤️ \n\nAs far as Heather, don’t pay her any mind. In fact, pity her like another commenter said. I’m sorry that her inability to be a decent human has impacted you negatively, but it wasn’t your fault. I wish you the best!",
            ">I know I have no right to be hurt about it, but I still am\n\nYou have every right to feel hurt about it",
            "It is your right to have whatever feelings you have about a situation.  Whether bad or good.  In this case it seems you being hurt is totally rational and you definitely have a right to feel that way.",
            "It sounds like he was trying to appease Heather and hurt you in the process. It's not your fault, though. He's the one who will have to eventually recon with everything she did to you and their family. She's the one in the wrong here, not you.",
            "I’m so heartbroken for you. \n\nI pray you get better and as much as it hurts, leave them alone. People that bring no positivity into your life need to go. \n\nWhat’s wrong with his wife? Her response and reaction to everything was not normal.",
            "Unfortunately this is gonna suck for a bit. You've done all you could and that's enough. When the boys are older they'll find you and maybe you can have a relationship. As for your bio-dad, wow. Just wow. That man has died due to being hen pecked, there will be a closed casket service on Sunday. Just be glad this Jerry Springer show IRL had nothing to do with your childhood. Trust me darlin': bullet dodged.",
            "YOU ARE WRONG!!!!\nShe did not win. He did not win . They both something so very precious in having you in their family and their lives. I'm so sorry they are fools",
            "This is so upsetting cause based on reading these posts, I could tell that Harold wanted to get to know you. However, Heather took over the situation and mianipulated him into thinking it was the worst thing to happen to their family and marriage. I'm so sorry this happened to you and don't think for a second that you are the problem here. You got in contact with them for medical reasons and they turned it around and made you feel so much worse. Let Harold regret never knowing you and don't let him get to know you. He does not deserve you and your kindness. I hope everything gets on well with you in the future, medically and personally.",
            "It is not about whether they like you or not - it would be the same if it was anyone on Earth, for her, I'm sure - it's about her not wanting to accept that Harold had any life before her and their kids. That's not on you, and it isn't about you. It's about her.\n\nI'm sorry he's being so spineless about it, because it's clear that this isn't what he wants. But you are right to leave the ball in his court.",
            "I’m so sorry you’ve been put through this while also processing some life changing diagnoses. I think you’re right, Heather “won” but winning isn’t the goal here. She only won by likely coercing or threatening her own husband and that wedge will drive between them deeper than she realizes. You deserve a family that loves and celebrates you- and remember, family is chosen, not blood. Surround yourself with those who see your light and honor it. Best of luck to you!",
            "One thing I noted in your previous post is how much you apologised. These people should be apologising to you. You don't owe anyone an apology. I would not let this man back into your life. Those two people sound selfish and messy. Focus on yourself. I know you left the door open for Harold, but I think you should quietly shut it. You don't need him and if he regrets cutting you out later, all he'll do once let back in is flip flop. He's hurt you, he's made you cry. Always always *prioritise people who prioritise you*. Harold ain't it.",
            "Sorry you’re going through this OP. I hope it all works out for the best!",
            "I’m sorry OP. A couple of things. One, do make sure you get whatever medical info you need. And two, know That their decision has nothing to do with you as a human being, rather with his cowardice and her jealousy and need to control. It’s honestly not you.",
            "You are better than both of them. You tried to give them helpful, relevant health info and were very considerate. Unfortunately Sometimes your chosen family is better than your bio family. At this point you owe nothing to any of them. I'd be so proud to have you as a sibling, or child. You were mature, graceful and looking to be positive and responsible. I hope your medical issues get easier and I hope you know that you are fantastic and very worthy.",
            "Your adopted father is your support so trust your dad he won’t steer you wrong. You rock daddy OP. \nNow reflect on what you have achieved, from birth to 19years of tests,hospital stays, the stress of not knowing outcomes, more diagnoses this constant up hill battle and you are smashing each one. It takes a tremendous amount of mental stability and strength to keep going. \nYou knew the facts Harold is your biological father and you have the results you needed, that initial call was just for that reason alone. \nEverything after- his excitement, his wife saying one thing, harassing you while he’s telling you ignore it and be yourself, they brought their shit marriage into your life, so it’s not your responsibility to feel bad or guilty about their mess. \nThis man should be privileged to be part of your life he got the opportunity to and was happy until the wife stepped in. I can guarantee this will live in his head as a regret til death. \nYou have more important things to put your energy towards minding yourself. If they can simply say you are damaging their marriage well that marriage severely cracked before you came along, so don’t take responsibility or guilt from this. There was other battles at the start of this just like all your previously won battles, and look you won, you got what you needed.\nPlease take good care of yourself and know your dad loves and adores you, and really in the toughest of times that’s the best feeling you could have is right with you. \nMassive hugs from a virtual stranger. Head up, you’re still fighting for a good reason.",
            "Dawg, they lost. They're losers, especially Harold.",
            "I hate to say this, but if he is choosing to go no contact, it isn't just his wife got to him, it is what he wants as well. He may be using her as an excuse. I am sorry this has happened to you, you don't deserve this. And he doesn't deserve to be part of your life until he proves himself to you.",
            "It sounds to me like your bio father's wife feels threatened for whatever reason and probably put her foot down in a way that your bio father decided to go along with. I could be wrong, but that's how it sounds to me. In any case, it may just be one of those things you will unfortunately need to accept. Maybe one day he will reach out, but there's every chance he doesn't. And that's okay. You have an adopted family, a bio mom in contact, and a girlfriend. Focus on yourself and the people who love you. You're doing great with all the struggles you're facing.",
            "This is the thing. We don't know what's in H's mind or what's going on in his life, married life, work life, etc. Maybe he's been having personal issues, etc and while you're a blessing, this is a huge change for everyone involved and he may be having a tough time dealing with it as well. \n\nUnlike his wife, who is blunt, cruel and rude, H may try to act polite around you and be vague instead of telling you whom he considers a kid, what's his problem/issue that he's dealing with. \n\nI don't think this is a 'winning' or 'losing' thing. I would just leave him and his family be at this moment. Focus on yourself and your self-care. Take care, OP.",
            "My guess is the wife \"forced\" his hand and he had to make a choice.  Either that or he just has zero backbone.  I hope someday he realizes he's messed up and contacts you.  Regardless I hope Heather gets a giant hairy wart on the end of her nose and explosive diarrhea while wearing white pants to a large social event.  Keep on keepin' on OP you are better off without them for now.",
            "OP, you have every right to be hurt. That said, please remember that their reaction is about them (the faultlines in their marriage, Heather's insecurities and selfishness, etc) NOT YOU. You are clearly a loving, caring person who wants happiness for everyone around her.  You definitely should keep being you.  You've handled everything admirably.\n\nI am sorry you had to deal with this chaos on top of all of the terrible medical stuff.  I hope the medical history is helpful to you.  Maybe in time you can bond with your biodad's part of the family, but focus on your own healing and the family that loves you unswervingly now in the present.  \n\n\nOP's Stepdad: you are also a wonderful person and I hope the best things in life come to you and your family.",
            "Your bio dad will 100% regret this later on in life when he realizes how much he missed out on by not having a relationship with you. When he eventually does contact you, it will be up to you to decide whether you can forgive him or not. It just really breaks my heart that there are parents out there that are so willing to give up a relationship with their children in favor of their SO.",
            "Both the women in Harolds life are insane and controlling him. I’m so so sorry for your life and circumstances..\n\nI hope he gave you all the medicals you need at the very least, and yeah just stop messaging them completely for your own sanity - who cares about theirs. I hope you get as well as you can",
            "I think you’re the one that one, she’s got him wrapped around her toxic  finger",
            "I'm so sorry Op, I can't imagine how hurtful this has been. It feels to me that Harold has made his decision solely so his home life is easier. Which is really disappointing. But know that you've done nothing wrong, and that you deserve more.",
            "They are so horrible!  What kind of monsters react this way to a young girl who just wanted medical information?\n\nOne thing I have learned in this life, there are Heathers everywhere, and they are the most miserable people you have ever met. I guarantee you, Heather and Harold are sad and angry every single day of their lives.  \n\nOne aside:  The next time someone says \"As a mother\" when giving their two cents about something (like being a mother gives them special empathy and understanding) I am going to tell them about Heather.  This woman is a mother and she acts like a concentration camp kapo. Unbelievable.",
            "You wrote “I know I have no right to be hurt about it”, and I don’t know why you feel that way. Of course you have a right to be hurt about all this! What makes you feel like you don’t?",
            "Seriously - he’s trading his relationship with you to be ruled by a toxically insecure wife. Which says a bit about him. I’m sure it hurts and is disappointing.",
            "I'm so sorry. Fuck them. I was adopted too and my bio dad's family wants nothing to do with me. I know how it is. Sending love. ❤️",
            "I just read your original post and just like the other comments,  you should be a writer.  I was really invested in reading it. \nI'm sorry it didn't turn out like you hoped,  however,  their loss. I hope you at least got some medical history you needed and I hope your health improves.\nI always empathize with all parties in these types of situations just to gain perspective. I don't think they are bad ppl for needing space because in their eyes you turned their world upside down...an unknown daughter possibly out of infidelity with health issues. Scary stuff. Maybe they just need time to unpack it all. They may come around,  they may not.  You just need to focus on you and becoming healthier.",
            "I don't think you should ever look back, even if he reaches out to you. I've been through terrible things with my mother and I think loneliness and irrelevance will be the punishment they bring upon themeselves with these acts. You're not anyone's toy they can just drop and pick back up.\n\nMaybe I'm being harsh due to my own experience, but I can't forgive people who betray and abandon their own sons and daughters.",
            "Well, hopefully you'll have better relationship with your half-brothers.\n\nAnd I saw a comment about your adoptive mom.  No wonder she was absent in all this (unless I overlooked it)",
            "Try not to be too upset, your dad was probably delighted to see you and would want to continue to, but is getting too much pressure from his wife to stand up for you.  She sees you as a threat to HER family and is afraid that you will become a priority over them. It is his loss. You seem caring  and sensible and although you want everyone to like you, as you get older I hope you will get more confidence so that doesn't worry you any more. I think everyone wishes you well for a happy life.",
            "I’ve had something similar happen, I had no father for 18 years until I found him on Ancestry. I got into contact with him, had an amazing call for over an hour, just pure bliss. The next day he told me his wife wasn’t okay with the whole thing and that it would be best not to speak until the shock wears off. This was 4 years ago. He sends me a Happy Birthday message every year on Facebook, I say thank you. That’s the only contact we have had in that time. Absolutely crushed me too because of the phone call. I empathize with the hurt you must feel!",
            "I've got a friend who, with his wife, adopted four children, all of whom are now adults. When his youngest turned 18, she posted a lot on social media about connecting with her bio-mom, how great her bio-mom was, things like that. I asked my friend if he and his wife were okay. \n\n&#x200B;\n\nHe said that each of his kids went through this, and each was excited to find their birth parents. They recognized themselves in important ways in the bio-parents that they hadn't previously known. The birth parents were excited to meet their long-lost progeny, glad to know that they had had a stable upbringing and that had turned out well. And, he said, after a little while, those bio parents \\*all\\* manage to disappoint the children they gave up. Whether it's guilt or just uneasiness or the unknown, it seems like this is a common reaction.   \n\n\nWith that said, there's no excuse for not IMMEDIATELY giving you all the medical records he possibly can.",
            "Im so sorry, dear. 51 year old lady here, they sound awful. I’d never do that to my kid. Internet hugs to you 👵🏻",
            "Sorry this happened to you. My dad's wife also made him choose between her and me. It's been 20 years and I can't say the pain and betrayal ever quite goes away.",
            "My husband went through something similar with his bio dad in College. He reached out and his father responded and they had a few really good phone calls…it seemed. They were thinking about meeting up.\n\nAnd then one day he just never heard from him again. Just…nothing. My husband left one more voicemail telling him to go suck it and then that was it.\nIt all reinforced to my husband why he never wanted a relationship with him in the first place.",
            "Heather's entire MO has been centered around downplaying her own culpability and passing it off onto others; I wouldn't be surprised if Harold was *quite used* to shielding his wife after she makes some insane statement. Unfortunately, you've just been shown that any spine Harold seemed to have was an optical illusion. Perhaps someday when (not if) Heather flips the script on Harold, he'll come crawling back with a half-assed apology in hand.\n\nThis isn't the first time Heather has tried to deny your existence. Arguing against the possibility of parentage, then against a paternity test, then against a relationship, the history of your interactions with Heather have shown a desire to *keep you away from Harold*. As the possible \"justifiable\" reasons to keep you at arms length ran out, she had to grasp at more and more tenuous straws. Right now, it's probably the stability of the marriage for the children. Once they've become a bit less reliant, however, she'll lose another arrow in her quiver. The question when that occurs isn't **if** she'll come up with another excuse to try and keep you away, it's *what excuse she'll cling to next*.",
            "Sorry for your situation and pray for you and your health. You have been through a lot and it's really very sad. But happy that you have a good father like Markus. It's rare at least for a step parent to love their non-biological kid. It seems that your luck is good, so please don't worry about \"Harold\" your biological father.\n\nIf it helps, I would like to say that I have gone through something similar, but I am really thankful to God for blessings. I'm also a good sensitive girl like you who lost my beautiful, good Mom when I was a baby. Luckily, I was looked after by my mom's family and I had cousins too for company. The sad part is that my father didn't even mourn my mom's death like he hadn't loved her enough (this hurts me) to wait at least for a few months.\n\nMy father immediately married with an evil incarnate woman who has her aunt in Voodoo stuff to spoil other's lives and in our culture it's rampant along with the fact that such an evil step parent for motherless children is like ringing a knell (usually a death knell for the unlucky ones) and she has 2 kids of her own. WORST part is that her family members from her parents to her younger niece too helped her in her evil actions and they too did be as evil as they could. they did everything they did to hurt me, spoil my life through black magic, but are living nicely that I often wonder if Karma is real. Also I loved my father's kids, where his younger son loved me as a small kid which was not liked by his evil maternal family and his own sister too.\n\nASA after his marriage, my father suffered whenever he tried to be a good father for me, and finally he abandoned me. You can imagine my suffering as a Motherless child with no father's love. But I am lucky to have gotten good fatherly figures in my maternal uncle and grandpa. Though everyone loved me, I missed my father a lot and was depressed from childhood. I thought how could my father just forget about me...his first daughter of his first wife. TBH, my mom was an angel who is still remembered even to this day though I am not....in fact I have not been like her even by a good half and I regret. I also started to fail miserably in school, but then got back to good grades.\n\nI can understand your feelings now, but please don't hurt yourself in trying hard to get them like you. You can love Markus as your father because he loves you. It's left to your biological father to love you, but you don't have to beg for it. You have been doing good all these years without their presence in your life, so try to live happily like before. If he reaches out to you, then good. Otherwise, please just let him go. Think about enjoying your relationship with Markus who loves you as a father. Focus on your health and happiness. Don't try to get their love because they seem heartless to hurt you when you are already suffering. Get therapy ASAP. God bless you.\n\nI know that it's easier said than done but try to stay away from them to be happy. I know that because I too suffered for years and now as an adult I am over it. I just think of my father as a person who gave me birth that's all because he was a dad only for few years. He was the first person to hurt me more.... He doesn't even care about me. We meet at relatives' functions. I avoid going because I don't want to see them except my father. But unfortunately, I can't avoid attending funerals so...unlucky. At my father's eldest sister funeral, his evil wife was Just glaring at me with such hatred like anyone who saw her would have gotten scared like anything (she stares muttering curses of black magic stuff silently) that's very scary and depressing. Also, one of my aunts noticed and was enjoying asking me about it afterwards. Most of my relatives noticed that too and it was very distressing for me.",
            "So, wait, did you at least get a medical history out of Harold? Like, you're dying. All of this relationship bullshit is secondary. You can't have a relationship with them if you're dead. For your own survival you need that medical history.",
            "Hey OP,\n\nLike others have said this is time to grieve. You are worthy of love and these people have demonstrated just how small their hearts are.\n\nHugs to uou",
            "Man, Heather is a real Cee yoU Next Tuesday.\n\nIf Harold wants a relationship with you he can ignore the clear issues she's got. However, it means he probably wont get to take your brothers, but he should be aware of the possibility of similar health issues. If Heather can't handle it, that's her problem. \n\nAs for you wanting people to like you, keep it under control as people will still yell at you, or see you as a doormat to be jerks. You've got too many problems to deal with",
            "What a shitty situation. Heather should get her head out of her own ass. This shouldn’t be about her insecurities. I understand Harold’s reactions, because I bet losing his sons (along with his marriage) is a real possibility. So good job not writing him off for good, cause the way she is acting... they’ll eventually split.",
            "All the people in this story sound very immature and impulsive and don't really seem to have a good handle on how to cope with the emotions, responsibilities and decisions required of being an adult. You seem to be managing your own life a hell of a lot better than all of them, so just keep pressing on, spend time with your gf, and make friends with people more like you who you can support, and who can support you in turn",
            "I just wish that I could give you a hug.",
            "I have a half sister my biological father and his wife won't let me see.\n\nYou can be my half sister if you want.",
            "I’ve barely spoken to my dad since I (30 m) was 19. I don’t get it. What’s with old men and not wanting to talk to their sons anymore?",
            "Did he at least give you his medical records though?",
            "you father did not choose you - that must be pretty upsetting so give yourself some time to come to terms with it all\n\nthis is his loss, not yours\n\nremember this when he reaches out to you in years to come, when he is divorced, alone, ...",
            "They LOST…out on a chance to have a relationship with you. Stay connected only for medical information.\n\nTake care of yourself.",
            "Please tell me you got that full medical history before the dramatic end. 😳\nI was so sad to read this. \nAs some have mentioned, you need to seek therapy. \nFor all the traumas you have been through. \nYou made a post that your health is your identity. \nYou are more than what your body is going through. \n\nYou really shouldn’t have contacted him about your cat. That was just an excuse you used.  To keep you in his sights. \n(I have 6 cats😊)\nNo contact, means no contact. \n\nHe is your sperm donor. Not your father. \n\nYou were born from a truly dysfunctional event. \nI gathered from the undercurrent, that you seek acceptance from the bios.  Either from self worth or feelings of rejection. \nDon’t.\nYou are more than what happened to you and how you came to be. \nIt just sucks you got hit with the genetic lottery. (Are they sure it’s genetic or could it just be spontaneous?)",
            "I hope karma bites Heather in the ass so, so hard. What a selfish, insecure hag.  And Harold isn't much better if he allows that behavior to go on. Sounds like you're much better off without them",
            "You DO have a right to be upset about this. He got your hopes up and then let you down. You're not to blame for any of this. She was horrible to you. You're better off without them, but let yourself grieve.",
            "Psh they both lost imo. And you do have a right to be hurt. He's your father and told you one thing and crossed you the next. I'm sure you don't wish harm. But karma will hit them both. They point alone they told their kids in a fit of emotions? I have 2. You don't think they're going to wonder about this? Question this? Possibly at some point look for you? Then what? The truth is the truth. This is something they'll answer to at some point. I personally wish you the best and you can always pm me if you need someone to talk to.",
            "1. You have every right to be hurt\n\n2. But it's their loss \n\n3. You did the right thing",
            "First of all, you are handling this pretty well under the circumstances!\n\nSecond, I wouldn't believe a single word Heather says from now on. The part where your brothers compared your story to Shazam was really what sold me on not trusting her, because there's no reason for Harold to make up a reference he likely doesn't understand just to make you happy, and it's a reference your younger brothers would probably make given their ages. Hopefully given time Harold and his sons will be able to recognize that she's being entirely unreasonable and find the strength to stop her.\n\nFrom this point on I would only speak to Harold and Heather through your attorney, because you really don't know how far Heather will go. Get your medical records, know your history.\n\nI wish you the best of luck!!! 🍀",
            "You're completely in the right to be upset. This was a whirlwind of events with people being nasty to you. It's okay to be unhappy about this. I also hope you weren't prevented from getting the medical history you needed because of Heather's drama. \n\nI saw that your last post was nine days ago; it's *possible* Harold is waiting for Heather to cool off a bit before retrying this reconnection. I can't say whether it's likely or not the case; just that it seems plausible. I think it's worth deciding if that's something you'd want to do, if offered. Honestly the way this was handled, I wouldn't blame you if you just wanted to get your medical information and then never hear from him again. But it also wouldn't be crazy of you to want to reconnect if he reaches out again.\n\nIf he doesn't reach out again, sounds like you have a solid family already that's more than happy to go to bat for you, so don't feel afraid to confide in them if you're hurt by what happened.",
            "Better to know that your bio dad is a shit bag now than later.\n\nSorry to hear, dude.",
            "You have every right to be upset OP. His wifes a real piece of work that blamed you for things out of your control. Even without your being sick, every child has a right to at least KNOW who their parents are! Even if, in the end, they don't make contact or have a relationship with them.\n\nI bet she threatened to leave him and take their kids with her. I'm sorry sweetheart, but know that we have your back here.",
            "You gained and lost your father in an extremely short period of time. You are more than allowed to be upset about this. Take the time to grieve and heal.",
            ">I know I have no right to be hurt about it, but I still am.\n\nYou have every right to be hurt. Your pain is valid and justified. Don't let their obvious disregard for you color your own perception of your worth as a person. \n\nThis whole series of events does not reflect negatively on you; rather, this completely reflects back on them. \n\nWhen or if your dad reaches out to re-establish contact, you may welcome that, because you desire the connection and acknowledgement, but if I were you, I wouldn't make it so easy for him to someday just step back into your life like he belongs there.",
            "You have every right to be hurt about how this played out. Please don't feel bad about how you're feeling. Most people in a similar situation would feel hurt and that's normal and expected. I'm sorry it turned out this way. I hope you have a good support system to lean on while processing this.",
            "It’s his loss, you sound like a thoughtful person. Stay strong and “create” the family you want, don’t waste time on those who don’t care. ❤️",
            "Oh, I'm so sorry. He's going to regret it one day.\n\nI hope eventually your half brother's decide to get in contact, when they're a bit older.",
            "It really says a lot about your dad that he's onboard with putting his woman before you.",
            "Sounds like Harold is whipped. A \"happy wife, happy life\" type of man, just like my dad. It can be super disappointing to watch your father change his values or his mind just to go along with what his partner wants, especially when such changes negatively impact your relationship. It sounds like Harold really does care about you and does want a relationship with you, however for whatever reason (how he was raised, past life experiences, etc.) he NEEDS to be in a relationship to think that he's happy and therefore his ultimate goal right now, above all else, is to keep his wife happy. It's terrible, I know. My dad's wife has lashed out at myself (and sometimes my sister) on numerous occasions before they were married, about the dumbest crap. The most recent, I had posted something on facebook to show my support to friends who were going through tough times of a very specific nature, and she flipped out on me, since she interpreted my post to be about my family (even though my parents never did because it was pretty obvious that it wasn't). In flipping out at me over text, she told me she was \"glad she wasn't my mother\" and that she \"felt bad for my parents\". My dad's first response? In defence of his wife, \"I'm sure she didn't mean it that way\". My dad raised me, so we were closer than you and Harold, so I ended up calling him out for always defending her, and pointed out that she meant it how she said it. So this time he actually did something about it, but most of the time he doesn't, and still defends her. I mean he still married her after that incident without a second thought.  I don't have kids, but if someone had said that to my child, coupled with the other shit my step-mother has done and said to us, I would definitely pause and think real hard about marrying them. But, my dad just moved on from it like nothing had really happened.\n\nSorry for the rant, but my point was just trying to show you, OP, that you're not alone in having a spineless father, and I think that if Harold had been a part of your life from the start things would be the same. Once Heather decided she didn't like you, it would be more difficult to have a relationship with Harold and you would definitely be disappointed in him quite often.\n\nThat being said, I can understand wanting to have a relationship with your biological father, and from the sounds of it, that is what he truly wants. It sounds like everyone except Heather was excited to have you as a part of their lives. So you have a decision to make (and no time-limit to make it, so take your time): try once more to pursue a relationship with him, or decide that he's not going to be a part of your life anymore. For the first one, I would send him a message along the lines of: I can tell that Heather doesn't like me, but I was under the impression that you and your sons were excited to have me as part of your lives. I don't need to have a relationship with Heather to have a relationship with you, and so I was really disappointed and hurt when you decided that you wanted me to leave you alone. I would really love to have a positive relationship with you, and I hope that you would like the same, despite Heather's opinions. If not, this is the last time you'll be hearing from me.\n\nI wish you the best of luck with everything, OP. Take your time to decide what you want, and if you lose this relationship, know that it's okay to be upset, and it's okay to grieve it as well. I hope everything works out for you.",
            "Did I miss something, was there ever a DNA test? Did you get medical history? Even with no contact do you think you'd get a court-ordered test (if that's possible)",
            "One thing about forcing someone to choose them or another person is that eventually that person being forced will start resenting the person who forced them, especially when things are no longer great between them.\n\nIn the mean time, just live your life and remember that at one point your father made a decision not to make you his priority.",
            "Wow, I went back and read the original post.  This Heather woman sounds like a real piece of work.",
            "OP you're a better person than I would have been in that scenario. It seems like your adopted family, bio mom and, gf are already an amazing support system and Harold is missing out! Sending you love!",
            "I’m really sorry this didn’t turn out how you hoped. I will be honest, I see both sides of this. Of course there’s a longing for a relationship w/ your bio dad but I also understand that not everyone is open to that happening. I hope in the future when things settle, they change their minds and at least help you. It’s ok to grieve what could’ve been and I hope your health gets better above all else.",
            "Kinda sounds like she issued an ultimatum and forced him to choose. She is afraid of you replacing her, no doubt. I'm not sure you need someone in your life that isn't willing to fight for you. \n\nSurround yourself with positive and supporting people who love you no matter what. Family is what you make it.",
            "So sad to hear. I could be very wrong but my impression from all this is that his wife, Heather was threatening with divorce and making everything so difficult that he felt like he had to take a step back. \n\nThe way I see it, if Heather hadn’t felt so intimidated by you and had actually welcomed you into the family he would have also and there would be no need for so much drama. Sometimes step parents become jealous and feel threatened because all they can focus on is how their children will be treated with someone else moving into the picture. It’s selfish but I’ve seen it happen. \n\nI just hope you know none of this is your fault.",
            "You have a right to be upset at him. He chose his wife, and the easy way out, instead of you. Wrong choice.",
            "I'm sorry this happened to you. She must be a miserable person.",
            "Heather sounds like a jealous B word, this is not a logical reaction. I’m very sorry this happened to you.",
            "I'm not a biological parent but I would immediately lose all respect for my partner if she essentially asked me to tell my biological child to fuck off and not try to make things right after being a deadbeat for 19 years. I would also lose all respect for myself if I was given an opportunity to do right after 19 years and let ANYONE tell me otherwise. \n\nP.S. Heather keeps Harold's testicles in a nice glass display case on the mantle above the fireplace.",
            "[deleted]",
            "I'm sorry the bad person \"won\" in this case. It's unfair and you deserved a better outcome.",
            "Yes, your dad's wife sucks. \n\nHowever.\n\nYou dad deserves a happy life, as much as it's possible. Children grow up being the focus of their parent's attention. You are told that you are the most important thing in their lives. And then you grow up, and go off on your own, spending most of your time with your friends and lovers. And where does that leave your parents? Especially divorced or widowed ones? Are they just supposed to live vicariously through YOUR happiness? Or spend maybe the next 50 years alone, cheering you on in YOUR life? I don't know your father's circumstances; I don't know his options in relationships. But most older men don't have a lot of choices in the women available to us. So give him a break, knowing that he doesn't want to be alone, without a mate any more than you do.  I don't know why Heather doesn't want you around, but respect their decision, and perhaps just communicate with your dad via email for a while. And live your own life; it's time to figuratively leave the nest, and live your life, knowing that your dad has to, as well. Things may change, but in the meantime, let it go for a while.",
            "I'm confused. Mom or step mom ?",
            "[deleted]",
            "Maybe in the future you can reach out again, I'd give it a few years to see how things are doing and maybe just stick to christmas card level communication for now. I'm sorry for what you're going through, but things will get better <3",
            "Technically it’s none of her business",
            "I hope OP was able to get their medical history before Bio-dad decided to stop communication.",
            "While letting things lie is probably for the best, you’re allowed to have feelings and you absolutely do have the right to be upset about this.",
            "Feels like your bio parents don't deserve you",
            "Sounds like you are missing out on exactly nothing. Bio dad is spineless and his wife is a jerk.",
            " No you won dude, lousy dad out of your way and a witch woman no longer attacking you. you have a right to be hurt cause that WAS your dad. Treat it like a death dude, I would. just don’t become bitter, resentful or angry about it. Terrible people exist and sometimes they’re family. Maybe you will have a family one day and you’ll remember these lessons. In the short term make sure you don’t pick a narcissistic witch like your dad did.",
            "Maybe in the future things will change. Maybe it will be nice to have some halfbrothers :)",
            "Absolutely don’t take this personally. Heather has Problems. She is threatening and manipulating him past his ability to cope. Consider contacting Harold quietly after some time has passed. I am so sorry, and I hope your health situation becomes less painful."
        ]
    },
    {
        "post_id": "4uxn4r",
        "author": "vacationwoes99",
        "title": "Update: My (29M) very rich GF (25F) of 8 months wants to pay for an expensive vacation for the both of us. I don't feel comfortable accepting.",
        "url": "https://www.reddit.com/r/relationships/comments/4uxn4r/update_my_29m_very_rich_gf_25f_of_8_months_wants/",
        "score": 3447,
        "num_comments": 313,
        "created_utc": 1469662021.0,
        "selftext": "Link to original here: https://www.reddit.com/r/relationships/comments/4um20k/my_29m_very_rich_gf_25f_of_8_months_wants_to_pay/\n\nFirst of all I want to say thank you to everyone who contributed to my last post. I never expected it to blow up the way it did and get that many replies. After a while the number of responses got overwhelming and I was unable to reply to many of the later posts and/or questions. \n\nI do wanna clarify a few things which kept coming up in the last post. This situation for me has absolutely nothing to do with \"gender expectations\" or anything like that, that's just not who I am. I suppose I should have expected that response from this sub given so many of the posts are about cheating, abusive partners or people confused with gender stereotypes etc. \n\nWith that out of the way I also should have clarified in my OP that I am not a big gift receiver in general. I feel uncomfortable even when my parents, friends or other family members splurge on me. I also want to point out that people kept on bringing up scaling of money in that $200 for me has the same value that 5k has for her. Yes, that's fine in theory but it can still be hard to comprehend in real life when I have never had that kind of money splurged on me or lived such a high class lifestyle. It's easier said than done when people were urging me to accept her proposal with grace. \n\nAnyway, here goes the actual update:\n----------------------------------------------------------\nBefore posting my last post I had already decided that I was going to turn her down and I wanted to get advice on how to politely turn her down. After listening to the good people of this sub I opened my mind a little and decided to have a talk with her about our relationship, her money, and our finances moving forward with an open mind. \n\nShe came over last night after work and we talked about her proposal. I told her I was incredibly thankful for her offer but in all honestly it did make me uncomfortable. I explained to her that it was because of my middle class background and the fact that I am not a big gift receiver in general. She cut me off right then and there and said she was sorry if she felt me uncomfortable and she was only coming from a good place. She revealed to me that growing up even she had feelings similar to mine because she viewed everything as her \"family's money\" and only after she matured later on in life did she start to not feel bad about her wealth and privilege, and simply starting enjoying it for what it is. She told me she has a standing offer from her father to work a cushy job in the family business but she still does understand the value of money and that's why she still works on her own. We then talked about her family's wealth and the impact it had on her past relationships. She told me that usually she's never offered to do something this big for anyone else but she only offered this because she really trusts me, respects me and has fallen for me hard. She mentioned that in her last relationship she kept everything 50-50 because she wasn't sure about the guy and their relationship got very toxic by the end because he simply expected her to pay for everything. She said she loves my ambition and wants me to  keep progressing in my career. \n\nAll that being said, I asked her what it would mean for our relationship going forward if I accepted. We both decided that nothing changes, we keep on splitting it 50-50 as we have so far. She joked that she wouldn't let me off the hook for future dates/expenses this easily lol. For any future trips/activities we decided that we won't always go for the most expensive options or the most budget friendly ones and try to find more of a middle ground. \n\nUltimately she insisted that because she had already made the offer I had to accept. I did with the compromise being that once we are there we are going to split everything else 50-50, she will let me treat her a few times, and we won't be splurging the way she is used to on vacations. \n\nI am really thankful that his happened and we both feel closer than ever. She will be coming over on Friday to spend the weekend with me and plan/book this trip. I couldn't be happier right now. \n\n**tl;dr: She came over, we talked about the money and the state of our relationship. I accepted her offer and we both feel a lot closer.** ",
        "permalink": "/r/relationships/comments/4uxn4r/update_my_29m_very_rich_gf_25f_of_8_months_wants/",
        "comments": [
            "Communication strikes again and saves the day! ",
            "I'm glad y'all were able to work this out. Keep having this conversation as time goes on :) This won't just go away.. because \"50-50 for everything\" is not forever when two people have drastically different incomes. It isn't feasible nor is it fair to force someone who can afford nice things to go without them to spare your feelings. Not saying your feelings are invalid -- just that you can't use them to control her money. If you truly feel uncomfortable and forced to do the nice things when this kind of thing comes up, you will find that you two are simply not compatible. I don't mean that to be rude; I'm just saying that if someone essentially told me I cannot do what I please with my own money, it would be a deal breaker for me. Your girlfriend seems understanding and ready to work through this with you, but please understand she is not going to change her entire lifestyle for you.\n\n> and we won't be splurging the way she is used to on vacations.\n\nThis is her vacation that she paid for. I don't know what you consider splurging, but again, if someone told me I couldn't eat nice meals and order as many drinks as I want on my own vacation that I paid for, that would be an issue. I am far from rich, but when I go on vacation, I go all out. That is what a vacation is for in a lot of people's minds.",
            "[deleted]",
            "I'm glad you accepted, but I also implore you not to dampen her fun with this \"and we won't be splurging the way she is used to on vacations\" as some others have pointed out. It seems a bit selfish to control how she spends her money if it has no negative effect on you besides pride. ",
            "Now go enjoy this vacation for the rest of us broke mother fuckers!\n\nBut really, that was a important and productive talk. Your plan going forward sounds good. Good luck to you both!",
            "Well done!\n\nThis worked out perfectly, strengthened your relationship, and confirmed you and your GF can talk about anything. I've a feeling you two are in it for the long-haul. :)\n\nHave a blast on your vacation!",
            "So you basically accepted the flight and the hotel room and nothing else? This is going to sound obvious, but the best parts of a holiday are usually outside the flights and hotel rooms. I hope she treats you to a few things during your vacation.",
            "I do not see this a positive update. I'm sorry, but I don't. \n\nI had a very serious boyfriend that things ended over the fact that I'm more wealthy than him. Sure, keeping day to day expenses makes sense. You don't want to create a lifestyle where one person feels indebted to the other person (which btw if genders were flipped, it'd be less of an issue.) \n\nBut to make every and all expenses a 50-50 split, it's limiting the wealthier partner's lifestyle. Someone shouldn't have to limit their vacations or splurges because the other partner isn't as wealthy. I think your 50/50 split is going to cause issues down the road and you aren't looking that far to see it. My current partner is independently wealthy plus he works in finance. So compared to him, I'm the poorer partner. If he wants to kick in some extra money for a house we both love, that's fine. He doesn't have to limit his choices based on my finances. \n\nCreating a class barrier in your relationship is not a good idea and you have to stop looking at living life through her lenses as charity. She can afford it. She wants to share an experience with you. Accept that she wants to share her life with you. Don't expect her to live only your life.",
            ">we won't be splurging the way she is used to on vacations\n\nJust keep in mind that she's used to enjoying holidays in a particular way, and you've **told her not to do that any more**. She may not enjoy this holiday as much as others, and she's damn sure going to know who's holding her back. \n\n\"Hey can we go do this (expensive) thing one day during our holiday?\"\n\n\"No honey, we can't.\"\n\n\"Oh, okay :(\"\n\nI don't know how you think this is going to go well long term, you're being controlling and negative and it's likely to make her resent you.\n",
            "I'm glad that you guys have found a compromise you both are happy with. But I urge you to look at your disparate incomes in a different way. Both of your incomes come it at 100%, and each of you contribute an equal percentage of that. She's not paying for the trip, you've contributed! This is your trip together not a gift.\n\nAnd onto the \"gift receiving\" problem. Maybe you want to consider talking to a therapist about this, because you fail to understand that a gift is as much about the giver as it is the receiver. They wouldn't give it to you if it didn't fulfill them. If they couldn't afford it, or they didn't feel you deserved it, they wouldn't do it. It's about their expression of love for you. Think of it as graciously taking a compliment instead of turning their compliment around on yourself (\"You look great!\"; \"Thanks, but I've been getting fat around the middle lately\"). In fact, I think your discomfort comes from the same place as being unable to accept compliments: you feel you are in some way undeserving. But you are, and more than that the giver feels you are.\n\nBe gracious and accept the gesture that your loved ones willingly and lovingly give you.",
            "If there is a big discrepancy in your finances, my advice is this: instead of trying to split everything 50-50, I would agree on a percentage amount. $100 may not be a lot of money for her, whereas for you it could be a fortune. My SO makes about 4x as much as me. Because of this, he pays about 75% of the house expenses and I pay 25%. This feels more fair to both of us. Just a thought. ",
            "I'm the much richer partner in my relationship. This 50/50 bullshit is never gonna work out. Sure equality sounds nice and all, but you're just doing it to satisfy your own ego. You clearly can't really accept the fact that she's much richer than you and you're trying to drag her down to your level. You're making her artificially limit her lifestyle to match yours just to make you feel better about yourself.\n\nThis girl is great for putting up with you, but you're the shitty partner here. Let me reverse it for you. You could accept her for who she is, live her lifestyle instead, plus it really takes no effort on your part to do that. It'd make her more comfortable and happier, but instead you gotta make her do it your way.\n\nWhen she dates a richer guy next time, she isn't gonna have these problems because he's not gonna have these small dick ego problems. Get over it already, she already loves you, so why make it harder for her?",
            "just a thing dude, im not the most experienced man in the world but dont let your ego be bigger than your love for her, care more about love than checks. dont forget that she loves you and so do you.",
            "Fucking hell dude just accept it. She didn't do this because of the money. If I had the opportunity to do this for my fiancee I would do it in heartbeat. It's not about the money. If I had top 1% wealth, money doesn't even fucking matter.\n\nJust be grateful and stop trying to even split everything when you are in Europe. She offered. Be grateful. ",
            "I used to also have a hard time accepting gifts. Overtime I realized how much joy it gives some people to give a present. Then I started to see my grateful acceptance of a gift as the gift I can give in return.",
            "So am I reading this right? She is not allowed to splurge even on herself? If so,  this isn't a good update at all. Just because you seem uncomfortable with your partner having more money",
            "So sweet when people reason things through.",
            "Positive update overall, but I think you need to seriously consider your stance on receiving gifts and how it will progress into the relationship. She is obviously extremely wealthy and can afford things that would normally be a pretty big expense for you. If you think that you have the right to control her spending just because it makes you feel uncomfortable, I think you may have a problem there.\n\nShe's obviously at a point with you where she trusts you enough to have the desire to spend money on you, and that's perfectly normal. Don't try to hinder it with insecurities about wealth. None of that matters. As long as you are making the relationship enjoyable as well as a co-operative effort (aka she doesn't pay the bill 100% of the time), you don't have anything to worry about. If this isn't something you can really come to grips with, then this woman may not be right for you.",
            "That's unfortunate to her that you are essentially controlling her spending. If she wants to splurge and is able to, then she should. I don't see this ending well long term. Too many red flags on your part that I hope she'll be smart enough to see.",
            "Hey OP, I know you are getting a lot of flack, so I just wanted to offer my 2 cents as someone who understands where you are coming from.\n\nI make a good salary, but my fiancé makes about 3x my salary, and if you factor in his bonus, it pushes closer to 5x. I found this difficult at first, because we could afford very different lifestyles, so a 50-50 split wouldn't work without him coming down to my level.\n\nWhat I ended up realizing in time is to view 50-50 as mindset, not a hard and fast number. So over time what ended up happening is he would pick up dinner, but when we went out to lunch/brunch, I'd pick up that whole tab. He'd also ask me to pick restaurants, so I'd be able to steer us toward ones were I didn't feel uncomfortable with how much he was spending. \n\nWhen we moved in together, we decided what made the most sense was to just add together what I had been paying in rent with what he had been paying in rent, and that was roughly our budget (that might sound crazy to some people, but believe me, it really isn't given rents for a 1-bedroom where we live and given that we had both been living with roommates previously). We found a great place! It was way more lavish than a place I would have ever lived at on my own with my budget, but less lavish than where he might have otherwise lived. We each continued to pay in rent the same amount we had previously. It wasn't 50-50. It was actually 37-63, but it was in the spirit of an even split. We still continued to split things like utilities 50-50, because those are standard living costs. \n\nAs for when we travel together, it's been great in that he generally lets me plan the trip. He has been amazed by the level of quality that I've been able to find at the cost I find them at. (As an FYI - you can stay at some really solid boutique hotels for a reasonable price...you don't need to go the Airbnb option, just use some sites like Booking). Granted, he's never been the type of guy to splurge on first class airfare. Still, he lets me handle booking the flights and hotels, and we split that 50-50. But when we get to Our destination, if he wants to splurge on some activity and pick up the tab, I let him. I'll just make sure to pick up dinner or the bar tab later. It's not going to balance out on a $ basis, but it balances out on an emotional basis.\n\nWe will get married next year, and our finances will merge, but he is incredibly happy that he has found someone who is thrifty. He's happy to know that I won't expect a certain lifestyle, and he knows that with me and my view of money we will always live within our means. He has coworkers who are overly stretched, because they end up buying the expensive dream home, and splurging all the time, and as such, they are stressed and beholden to their jobs. It's a big relief to him not to be in that situation. \n\nAnyway, moral of the story is that it may be hard to navigate these tricky waters now, but you need to find what works for you, learn that \"50-50\" doesn't have to be an exact dollar split, but a mindset, and these differences in outlook may be beneficial in the long run to help provide balance. ",
            "First of all, I am very happy for you about this happy update. Good job on communicating! \n\nOP, I just wanted to say to you that I absolutely understand how you feel when you receive gifts. I have always felt weird receiving gifts from people as trivial as the gifts might seem. From a pack of gum to a whole night out, just something about them offering me all of it always made me feel off. So I would almost always try to refuse gifts.\n\nThen one day, a good friend of mine, while insisting to offer me dinner explained something to me. The reason someone offers you a gift isn't about the materialistic value. It's not about the money or it's not about what the gift actually is. It's about making the person you're giving to happy as well as being happy to give to someone. She told me that refusing gifts in my case was actually really selfish and that I had to drop my ego so that people could have the chance to give to me so we could both feel good about it.\n\nThis completely changed my way of seeing gifts and how I feel about them. I think it's important to understand where the other person is coming from when they are offering you something, no matter the value of it. ",
            "You strengthened your relationship and are going on a baller ass trip right now.  Being secure with yourself is literally always the way to go.",
            "Good, accept it. I grew up poor and now make a lot of money. I love treating my friends to stuff. It makes me feel great to provide things we wouldn't normally do. As long as they don't expect it, it's fun. ",
            ">  and we won't be splurging the way she is used to on vacations.\n\nYou think you're being noble, but you're actually being controlling. You're insisting you live your shared lives on your budget, regardless of what she wants.\n\nYou aren't coming from a place of selfishness, but the end result of your actions is your GF isn't allowed to have the vacation she wants with her BF, despite the fact that she wants it and can afford it.\n\nYou haven't solved this problem, you've just kicked it down the road.",
            "OP, please consider percentage-based contributions for things like this in the future. As it is, you're basically asking that she pretend her income is similar to yours, to live at your income level, and keep the rest of her money hidden away in a box somewhere where you don't have to see it.\n\nIt's not some dirty secret. It's a tool at her disposal, and you're making her life harder by denying her the use of it.",
            "I think you guys might need to have another talk.\n\nMy husband is fairly wealthy and he comes from a not-so-wealthy family. My family, on the other hand, is very wealthy but I am not. This puts us pretty much on the same page concerning finances - we save as much as possible and think about what we want to spend our money on. We both know it's not pretty to be financially insecure and we also know it's not great to save every cent and never actually enjoy it.\n\n>  and we won't be splurging the way she is used to on vacations.\n\nIt's her money, since you are not married, and frankly she can do whatever she wants with it. It's your decision if you want to join her or not but do not force her to share your same values. This will only create resentment.\n\nYou also have to decide if your values can work together. It seems like you don't like to spend money, would you be okay with her spending money (provided she/you both have the money to spend)? You say you don't like to receive gifts, but if she shows her love and affection that way, do you see the relationship working out if you always refuse or attach compromises to it?\n",
            "This isn't actually a compromise. She \"won't be splurging like she's used to\"? Dude, she's not your wife. You are unfairly placing limitations on your girlfriend's ability to enjoy the trip that she kind enough to take you on. You are just reading the lines of comments that reinforce the idea you already had.",
            "Go have fun with this awesome lady!",
            "Thanks, OP. I love good news here. Keep up those excellent communication skills.",
            "Wow, this girl sound amazing!!! She's so incredibly mature, sweet, and giving.",
            "I still think that if a person wants to do a favor for you because she wants to and she likes you, you should let her do it and reward her in other ways such as with love, attention and appreciation. Declining the offer says I don't deserve your investment. She wants to enjoy herself and she wants to enjoy herself with you and money is not at all a problem for her. If she wants to have fun, why do you have to put up rules and blocks. She's rich and she is allowed to splurge and live it up, she is doing it for her and here you are making things about you and how uncomfortable you feel. You have a girl that loves you and wants to do something nice for you and you feel it is out of place. Think about it a bit. I'm not saying that what you are feeling is not normal, it is completely normal however it doesn't help you much. She upgrades everything at no major incontinence to her, you guys have a lot of fun and enjoy high life. But no, you're uncomfortable. You see how this can be a damper? Go and have fun. You live once.",
            "Congrats on the positive update. It's not terribly common on this sub.\n\nI missed the first post, so I'm not sure if this has been brought up before, but a potentially good resource for you would be the book The Five Love Languages (I may have the title wrong, but Google can point you in the right direction). \n\nEssentially, the author makes the argument that there are 5 ways people express love. They are spending quality time, doing acts of service, giving words of affirmation, giving gifts, and through physical touch. Everybody has a primary love language and a different level of importance for the others. \n\nIt's possible that your gf's is giving gifts, and if so you need to figure out how to accept them, even if they are not the way you are inclined to express love. Otherwise, if she gives you a gift and you complain or protest, it's essentially turning away her telling you that she loves you. And that will cause irreparable harm over time. \n\nBut for now, good luck and enjoy your trip! ",
            "She feels uncomfortable with being able to afford more than the average person and that's why she wants to splurge on the relationship. It's a way for her to be able to do the things she wants to do in a relationship but not let it be a burden on the other person. Relax and enjoy your time together. \n",
            "Haha good ol toxic masculinity. If there's ever been a good cause for the armchair feminists to fix that cause would be relationship roles.",
            "[deleted]",
            "Am i the only one that feels like now OP is holding her back? I was expecting you to turn around and say \n\n> Okay, we'll split dinner dates and things like that 50/50, and gifts have to be bought with money we earned, but let's go enjoy the privilege we've been given and enjoy life to the fullest when we go on \"vacation\".\n\nI think you blew this one unless you left the door open to revise this conversation in the future.",
            "Hey man, good for you! Happy things worked out and that you both communicated :) Having something like this come up early in your relationship is a good thing. It means you both can discuss your issues like adults.",
            "Oh thank God you talked about it. Good job not sucking OP. Have fun",
            "She sounds like an amazing person.  Glad for u OP",
            "It warms my icy heart to hear this news. :) Glad it worked out so well!",
            "Congratulations for talking about it and for saying how you feel and asking for things you want, like sharing expenses during the vacation.  It can take courage and yet communication works when people have good intentions.",
            "Be careful if you start to get used to flying international business class.\n\nThat one's hard to go back from if you get used to it.",
            "Practically speaking, you don't have to splurge and spend a ton of money to have a great time.  It might take a little bit more planning and open-mindedness, but in my extensive travel through Europe, I've found that I enjoy holes-in-the-wall, neighborhood joints, and authentic experiences much more than a luxurious vacation.  I lived in Barcelona for two years on a somewhat frugal budget and wanted for nothing, so if that ends up on your itinerary, feel free to PM me for suggestions.",
            "Awesome work its great to see two mature adults talking through a honest and open minded discussion.\n\nIt just goes to show that if you approach any issue like this you can always work through it as a couple.\n\nProps to you both it sounds like a great outcome and a very healthy future ahead!!!",
            "Also, if you didn't pick up on it, the subtext was pretty clear.\n\nShe did the 50/50 thing to make sure you were trustworthy and not after her for her money. Now she's saying she trusts you and is starting to introduce a bit more spending to see how you take it.\n\nLook....if you want this go long term, you just have to accept that she will be providing a lot more money to the relationship.",
            "What a surprise you actually WANTED to go on an expensive trip! What was your first clue that that sounds like a fun idea?",
            "Nice update. I've been in a similar situation before and fell back on two pieces of advice dad gave me:\n\n* Don't question the intent of someone's gifts, gifts should be given and made in good faith and you never should feel on the hook for anything by accepting. Do not confuse gifts with bribes or a quid pro quo transaction (e.g. We buy you a trip, you are expected to do/feel this)\n\n* Don't turn down free awesome stuff\n\nSounds like this was just an honest gift from someone who cares about you. That sort of thing is what makes the world go around in a great way - be sure to pay it forward in a way that makes sense for you later on down the line. Have fun on your trip.",
            "It's not as though you can't have a fantastic holiday. Staying in 5 star hotels and flying first class etc can be overrated and doesn't necessarily make a holiday good. Besides, you earn \"just over 6 figures\", it's not as though you can't afford to have a relatively swanky holiday compared to a lot of people's trips in europe. ",
            "From a certain point of view, it would be selfish to say no. Is your driving need to avoid any implication of financial dependency or debt so important to you that you're willing to fuck up her vacation? ",
            "It sounds fishy to me that she \"always kept it 50/50\" in her last relationship yet her boyfriend expected her to pay for everything.\n\n\nSounds like she's feeding you what you want to hear so you'll go along with the vacation.\n\n\n\nOn a completely unrelated note I think you should accept but for a completely different line of thought- if she wants to spend time with you in a certain way and she can afford to do it then it's ok for her to feel ok doing that and it's ok for you to let her because she's not spending money for nothing, she's gaining experiences with someone she feels is worthy of the money and you two are able to gain experiences together and grow closer.\n\nI'm the king of the \"I hate when people pay for me\" thought process and I'll avoid it at all costs but this is one exception I'd take. For the sake of a budding relationship I'd let it happen.",
            "You both seem like good people. Gotta appreciate a 1%er who knows how to stay humble. And a boyfriend of a 1% er who doesn't want to be pampered. Bonus points for not caring about traditional gender roles.\n\nDo you have issues getting her gfts/taking her out to nice places? It seems like you're fine, but if that ever becomes an issue, remember that you can invest time into gifts and dates rather than just money. Getting creative and showing you know her will probably impress her way more than anything shiny and expensive.",
            "If you decide to go all the way. Remember that it becomes \"our\" money and not mine and hers.  Your view of her money will have to change.",
            "Great. Glad you both see eye to eye. I'm not used to being the receiver of gifts either and my GF loves to do things for me. I had to get used to accepting graciously and she had to be patient with me while I learned to react appropriately. It was like reprogramming my brain after a long time. The open line of communication is the important part. ",
            "you still need help, maybe solo therapy",
            "OP you are a dumb ass and your relationship isn't going to last",
            "100% agree wit you. It's easy for people to say, \"yeah you should accept dummy\" but at the end of the day, it's a huge ton of money and you have every right to feel uncomfortable with it. And it's wrong for people here to invalidate your feelings like that. I'm\nGlad you talked it out.  ",
            "Wow, you two communicated like adults -- well done!  I hope you have a wonderful time on your trip.",
            "I read your previous post and saw almost everyone egging you on to just take it  but I'm glad you didn't and told her how you feel. \n\nNot only were you able to come to an understanding but now you feel as though you are closer to each other.\n\nGood job standing your ground. I don't often say that in this sub but in this instance it was the right call. I wish you two well.",
            "This is a great update. You both have excellent communication skills, are considerate of one another's viewpoints and approached the situation with a team mindset. Have a wonderful vacation!",
            "I love this update. It's great to see you allowing yourself this experience this time. I was also going to suggest in my comment in the last post to make sure to do some low-budget local things when you're traveling in addition to any of the high-cost fancy restaurants and tourist attractions. It's a different world when you visit a country and limit yourself to a small budget but also challenge yourself to get the most out of it versus being able to afford any and everything. Each are great in their own way. \n\nEdit to add: you also have to understand that moving forward you can't begrudge her, every time, certain lifestyle experiences she's accustomed to and enjoys just because you can't afford to contribute 50/50. She's the only one compromising and making sacrifices to appease your needs and address your insecurities if that's the agreement. Allowing her to pay for things some of the time is a true compromise. ",
            "This update actually made my day.\nSo happy for you mate! Enjoy your trip!",
            "Great update. I am smiling for you two. Have a great holiday!",
            "This is very sweet. Stay grounded dude, and I hope you guys the best.",
            "Yay, adults adulting! I love this! Have a good time, and enjoy each other!",
            "Thank you for updating!",
            "Have a great time! You guys sound like a great team. Be good to each other. ❤️",
            "I'm so happy for you!! :D Have  a great time on the holidays. She's a keeper!",
            "If she has the money to pay, then she saved the day",
            "\"she will let me treat her a few times\"\n\nThis is my favorite part. You guys sound like a great couple.",
            "Did you tell her that you also sell propane accessories? ",
            "The fact that you two can have this discussion, and not flounder about, bodes well for you.",
            "As someone who has been in a very similar situation previously I applaud the maturity of both of you.   After letting my previous gf buy some things that I didn't even really want the whole family started to make it out like I always owed them something. Even to the point where she would say,  \"you should do this and that cause my mom paid for your dinner.\"  \n\nIt's nice to hear there are more mature people about this. ",
            "You both sound like great people - the best to you both for a long, happy relationship!",
            "If you put a ring on that in the future, OP I wanna see an update here!!",
            "Hurray! What a great outcome and what a great girlfriend you have. Both you and her sound like you have your heads on straight so best wishes for the future!",
            "Sounds like you have a wonderful girl there, OP. Wish you all the best going forward and I'm glad she appears to truly value your input and respect they way you feel. ",
            "\"Yay! A happy ending for the rich people!\" ",
            "She obviously really likes you, bro. Good job on communicating effectively.",
            "Great update! Soo happy there is one more positive post in this sub.\n\nCommunication is the key to success... (Most of the time)*",
            "She sounds awesome. And you sound like a seriously level-headed guy. I have great hopes you can keep up this level of communication for the rest of what I suspect will be an extremely long and fulfilling relationship. ",
            "Awesome. Sounds like she is very level headed about the situation. ",
            "That's great! Now just enjoy your trip together!",
            "I am glad you accepted. ",
            "Sounds like you got a good one OP. I request a highest of fives.",
            "Dude, fucking enjoy! My boyfriend and I aren't rich but we're solidly middle class and we plan on going on a balls to the wall amazing vacation in a year. 10 to 12k. It's going to be awesome. \n\nEnjoy that shit. Your girlfriend sounds great and you sound great for not wanting to take advantage. ",
            "I'm glad you accepted.  I'm sure she wanted to do the trip and she wanted to do it with you!",
            "YAYYYY! This makes me happy! She seems like a great person that wants to enjoy life with you!! I hope you guys have fun and have a stress-free vacation. Communication is so good and you guys are doing the right thing ",
            "You seem like such a solid dude and she seems great too. Keep up this level of generosity with each other and you won't have a bad day again.",
            "Well done.  Right decision. Good compromise.",
            "Do you think she can send me some money? Yknow like a charity thing? There should definitely be a charity for poor students...",
            "Surprised people aren't telling you that she is turning you into a slave and you need to dump her sorry ass before you become totally dependent and unable to leave.",
            "[deleted]",
            "Get an idea from where she is coming from. Is she shallow? Because if she is she might view everything in the world as replaceable, including you. If she is down to Earth and sensible then that might make you feel more comfortable. That she views you as a long term interest.",
            "This is literally the best update ever. You communicated, she opened up to you, you know she's fallen for you, you understand her more, you came to a compromise, you still get a kick ass luxury europe trip. WIN. ",
            "it will be held over your head forever."
        ]
    },
    {
        "post_id": "iijj64",
        "author": "ThrowRA0727",
        "title": "I(32m) am in love with my former sister inlaw(27f)",
        "url": "https://www.reddit.com/r/relationships/comments/iijj64/i32m_am_in_love_with_my_former_sister_inlaw27f/",
        "score": 3435,
        "num_comments": 100,
        "created_utc": 1598663379.0,
        "selftext": " \n\n# I posted this inR/Relationship_advice, but it got buried and I got only three replies so looking for advice here.\n\nTLDR at Bottom This will be a long post.\n\nI'm  finally at a point where I can't stand this anymore. I've been in love  with this woman for a very long time, maybe a couple of years at this  point and I'm not sure if I should just kill it or attempt to make  something with her.\n\nI met my  ex-wife, her sister, when I was 23-years-old and the relationship  developed very quickly and by 26 I had my son and daugther and had  gotten married. However, within months of being married my ex-wife had  an affair, but worse than that the man she cheated with had gotten her  into Heroin. After confronting her on this she said she was going to get  help, but instead she left in the night. I haven't heard from her in 4  years and last I've heard she's still with that guy and are homeless in  Las Vegas. Not sure how true that is, but being focused on holding it  together for the kids, I really don't have the time to chase her down,  nor do I want to after what she pulled.\n\nI  ended up getting a divorce in absentia. I did however maintain a very  positive relationship with my inlaws after the fact. Every other weekend  my kids stay over with their grandparents on that side and they pretty  much treat me like a son still, I still go to parties at Christmas and  am reasonably liked by the family. Nobody talks about my ex anymore  mainly to not worry my kids. My oldest, my son is very hurt by his  mother leaving. He's 9 now and I've had to get therapy for him after he  told me he hoped his mother was dead. She had been getting verbally  abusive toward the end which was when he was around 5 or 6\n\nAnyhow,  in the year following my ex leaving, her sister and my her boyfriend  had started coming around a lot to see the kids. They knew I worked a  lot and would babysit and call it practice as they wanted to have  children of their own. My kids love them and were spoiled by them, which  I didn't mind because we all needed a little positivity. They got  married and were very in love. However, her husband was killed in a  workplace accident shortly after the birth of their daughter.\n\nIt  has been extremely rough and painful for everyone involved as one can  imagine. I followed my Sil's example and began to take her daughter to  give her time to herself if things got too hard to deal with or she  needed alone time. She's been in grief counciling for a few years but  she still wears her ring and has told me she can't ever imagine dating  again. I talk to her about him frequently and she's gotten to a better  place but she's still very much in love with him, I can't imagine that  sort of pain.\n\nOver the last two  years we've been a more constant figure in each others lives. My kids  love their aunt and I have her over for dinner a couple times a week. My  daughter and her daughter have become close and love being around each  other so they have sleepovers. I've moved on from my ex by this but the  idea of dating possibly someone dangerous as their mother has kept me  out of the dating scene.\n\nI don't  know when it happened, but slowly I began to get soft on my SIL. She's a  great mom for what she's had happen to her. She's one of the sweetest  people I know and her sense of humor always leaves me laughing and  happy. Then I started realizing that I'm physically attracted to her.  I've always felt kind guilty about it because her late husband was a  good friend and since she's obviously is still grieving, so I've kept it  to myself.\n\nSince Covid started  we've been together a bit more because social distancing has had us lose  contact with most other people. Nothing romantic has ever been  discussed and I try not to flirt, but last week it was very late and  after the kids went to bed I made us a few drinks, not enough to get  drunk but she decided she'd rather spend the night, so I took my couch. I  woke up to breakfast this morning and the four of us felt like the sort  of family I've always wanted. She even kissed my forehead which is not  something she normally does. I still didn't say anything, but after she  left I found my son quietly playing with his toys in his room. He looked  upset so I asked him if he was alright.\n\nHe  tells me point blank in the way only a kid can that he wishes Sil was  his mother. I sat down with him and asked him why he thought that way  and he gave a whole bunch of reasons her being nice to him, that she  never yells about anything. He likes seeing her at his grandparents and  she draws pictures with him, which I didn't know they did. By the end of  it my heart that is already melting for this woman even more wound up.\n\nWhen  visiting dropping them off with their grandparents, I tried to breach  the subject with her folks to kinda feel around how people would see. I  made a joke about she and I acting like a married couple sometimes and  they didn't laugh and were kind of stand offish, friendly but either  they know something or they disapprove.\n\nIt's  getting too hard for me to ignore or pretend it's not getting to me.  I'm in love with her. Either I've got to kill it and find some way not  to think of her, or I have to find some sort of way to navigate through  this situation and tell her everything. If anybody out there has any  insight on how to approach a widow, especially one who was married to a  friend, with this sort of intention I could really use your help.\n\nTLDR-  Sil and I became close after my divorce to her sister and death of her  husband. She's great with my kids. I'm in love and don't know how to  proceed.",
        "permalink": "/r/relationships/comments/iijj64/i32m_am_in_love_with_my_former_sister_inlaw27f/",
        "comments": [
            "Some thoughts:\n\n1.  Don’t make a joke of this to her.  She’s fragile enough that it’ll feel in turns both threatening and confusing for her.  \n\n2.  Clearly she’s happy with the arrangement you guys have, a sort of ersatz nuclear family which carries little emotional demands and high rewards for both of you ie your kids get the love and structure they need from two adults who care for them and each other sans the drama.  Not to mention each of you playing Mum and Dad creates that polarity which enhances a possible attraction.\n\n3.  So I must ask this:  Are you absolutely sure you’re in love with her as a woman?  I mean, forget the convenience and comfort of it all- just her as an individual, would you have chosen her without all of this going on? \n\n4.  I ask because as soon as the shock wears off, she’s going to wonder if it’s that or if there’s real substance to your feelings.  No one wants to feel like a stand in and it will confuse her in the sense that she’ll have to start questioning herself as to if this is something she wants in general ie dating again, if you’re what she wants or if you’re just convenient, all those feelings of disloyalty to her now gone husband will be A LOT of emotion for her to deal with.\n\n5.  Which brings me to your expectations.  This is an “over the fullness of time” situation.  Unlike your ex, her former husband has now been idealized for perpetuity. He will never do any wrong, he will never be less to her, and he will always reign first in her heart.  A love halted before its time and shrouded in grief can become a safe space for someone - as at least she can always say, I was married once, I did have that once - and depending where she is in her grief, she may choose to stay there for a very long time and not go further.  \n\nWhereas you, whilst hurt by your ex’ betrayal, are probably thanking your lucky stars she peaced out - no one wants the chaos of addiction around their kids.  So your grief is different, you were left behind due to human flaw, and have been much too busy caring for your children.\n\nSo while you share the state of being abandoned, each of your grief is personal and different.  You will forever be second to the man who’s gone before you and I hope you can accept that.  \n\nMore to the point, you cannot launch this on her and expect a simple yes or no.  That’s irresponsible.\n\nIf you want to prove to her that you are the man she believes you are, you’re going to have to think steps ahead.\n\n6.  That means, you need to start getting more personal time with her without the pressure of a proposal to be romantic with each other.  Declaring it poses an unnecessary immediacy when I don’t see a need - neither of you are rushing to date other people.\n\nYou need time alone with her just to hang out and talk without the kids always around you.  Don’t ask her out formally, just carefully position yourself by getting time together like maybe stopping by and dropping off her fave coffee.  \n\nThere’s obviously some danger here of being friend zoned but the trick to that is not to allow her to treat you like a gf.  Just short bursts of personal time with intentional acts of attention, like if it’s Mother’s Day get her flowers, then joke “I know you’re not my Mum, but I’m so impressed by how you are with the kids that I just had to get you this.”  If that extends to a deeper conversation, say something like, “you being how you are makes me really think of who I should have in my life”.  \n\nAlways leave it a bit short on details to give her a chance to pursue it or leave it. \n\nThen the next time just give her flowers for no reason. \n\nNow she will either suss that this is getting romantic and will show you if she’s uncomfortable with it, OR she’s going to start looking at you and going hmmmm. \n\n7.  Here’s why I suggest this:  like it or not, you guys are actually good for your kids together.  And the potential of losing that just because she’s not where you are romantically, or worse, she may react negatively out of panic, is well - not really something you want. \n\n8.  I agree with ppl saying don’t run it by your in laws.  It’s not their concern right now and it may even be a non starter.  Who knows right? \n\n9.  As more time passes you’ll be able to tell if she’s more open or not, and that’s when you go full court press.  Even if she turns you down, you’ve gained enough information about her and how she feels about being romantically involved that you’ll likely be able to talk about your options together more comfortably.  \n\n10.  Obviously, follow all caution not to be neutered in her eyes.  A lot of that you can help by keeping the polarity electric, meaning do things that keep each of you in that state of awareness of your maleness vs her femaleness.  I sound like a douche but I don’t know how else to put it.  \n\nBut here’s an ex.  I know when a guy’s interested in me if he mentions how much he makes or does something overtly manly.  Once I was on holiday in the Seychelles and the very married son of the pensione owner took one look at me and decided he would fling his shirt off and chop wood right in front of my breakfast window.  I was literally a captive audience.  I wasn’t going to pursue it by any stretch, but it was his version of hey babe.  Like seriously he went through an entire tree trunk, it was amusing and flattering.\n\nI wish you luck OP, I get where you’re coming from and I don’t think this is impossible.  I just think you have to be very careful to see things from her perspective and walk that fine line between gentle and exciting.\n\nPS if this works I’ll expect an invite to the wedding.",
            "Dude, don’t run it by your in-laws before running it by her. Talk to her and see if it would be something she’s in to - and crucially, if she says no, accept it and don’t let it hinder your relationship with her.",
            "Wow that's a lot you have all been through. I think the  person who will help you navigate this is your SIL. Your inaws are processing all of this in their own way and it would be unlikely they would see things from your angle, at least not in the begining. My advise would be to tell her your feelings,  or some lighter version of them. Express your desire to continue having her in your life and your hope's that with times continued  healing that you two could become more. I would tell her you have infinite patience for her healing process and that there is no pressure for more unless/if she feels it is time. And above all I would tell her you want her as a part of your families life no matter what her feelings. (Unless that is too much for your heart)\nI hope you find your way through this and that you all find healing.",
            "No insight but I hope this is updated if something is said it happens. This might be the dreamer in me, but this sounds like a happy ending everyone(You, your son, and us Reddit readers. Can't really speak for others in your life) wants. Best of luck!",
            "There has been a lot of tragedy and heart ache in both your life and hers. There is a possibility that getting together could go wrong, that you wouldn’t work out well as a couple and that would be so damaging for the family, especially the kids. \n\nI do feel kissing you on the forehead is a sign, but also she’s still wearing the ring so she’s not quite ready yet. I would find a time to tell her about your feelings but if you date, TAKE IT SLOWLY. Don’t pressure her and don’t tell your kids about it. Communicate with her and make sure both of you are comfortable with your relationship before telling anyone, especially your kids and her parents. \n\nFrom the sound of it, both of you seem like reasonable, caring people. It would be truly wonderful if you can turn the heartbreak and sadness both of you experienced into something beautiful that will last. But you have to be patient and go slowly.",
            "Here's the thing, I have absolutely no advice on this matter. But what I'm going to need you to do is GO FOR IT, then come back with an update. It will be the best thing to happen in 2020.",
            "This is a sweet story. It happens sometimes. I know an older couple who were friends and happily married to other people for years. When both of their spouses died, they started hanging out and fell in love. They’re very happy together.",
            "I’m not reading any of the other advice because I don’t want to read anything that will change my mind. I am so rooting for you! I hope with my whole soft fuzzy heart that this is what is meant to be for you! How beautiful if these tragic beginnings could lead to a solid, lovely, renewal! Best wishes to you, 0727, I am praying for a positive update in the near future!!",
            "Another stranger hoping for a good update today.",
            "Dude go for it, you get one trip on this rock. Just know she may say no and it may forever change the relationship. But it might also go very right. High risk high reward",
            "[deleted]",
            "I unfortunately don't have any constructive advice but it sounds like your doing a great job being a father despite all the circumstances. Best of luck and I'm rooting for you both!",
            "It sounds like you have taken a reasonable approach and i'm not sure if i can add much that you haven't discussed in your post or responses to others. \n\nOne thing i'm curious about is that she is clearly not dating, but have you dated at all? Not even anything serious, just a night out with someone else?  It's clear you only have eyes for SIL, but you two have an almost-co-dependent relationship at this point and have bonded closely over shared trauma (remember that SIL lost her sister as well as you losing a good friend in her husband).  I wonder if you getting \"fresh air\" might clear your head a bit.\n\nAt the same time, I'm curious about what her reaction to that would be.  I don't mean this in a \"force her hand\" situation; not at all.  You shouldn't be playing that kind of game.  But I think you can gauge a lot about yourself by trying to break out of the mold you two have set for yourselves.  \n\nI can see you going on a date and comparing this one to SIL but at the same time, just trying to practice the whole dating ritual again might help you understand what is out there, in case what you're hoping for with SIL doesn't work out.",
            "Follow your heart man, i am sure there is a happy ending there....\nStearing will be difficult, but every move has to be to show your real feelings...",
            "Give it a shot ! Good luck, please keep us updated",
            "Shared history, shared pain, often make for the building blocks of a strong relationship. You've seen each other at your worst and your best, through good and bad. That counts for a lot. Quite a few couples fall apart when things get bad, but you two have hung on through the worst of it. \n\nGive it a shot man. I wouldn't push to hard or throw out any crazy declarations. Your kids love her and it would be a shame to make things awkward between you. Based off your MiL/FiL reactions you aren't the only feeling confused about the boundaries and nature of your relationship. That might be the best way to approach this, tell her that you're confused about the nature of your relationship, that you feel like you're more than BiL/SiL but you aren't sure what, and not sure where it's going. If she feels the same way she'll tell you.\n\nGood luck man. I really hope she feels the same way about you.",
            "Bro can i get an invite to this wedding as well? Man reading this got me rooting for you in everyway, hope things go well for the two of yous 💯\nAlso if i can't get an invite, can we all here at least get an update that would be awesome haha",
            "How sweet! I hope she shares your same feelings & you can create a magical little family together!",
            "Im sorry but this is the cutest thing ever, but i hope you understand her feelings and not pressure her to give you a yes or no answer💛 but you soubd like a delightful person and i hope all goes well. Good luck👍",
            "I don’t see anything “morally” wrong with making the move despite all of the difficult surrounding circumstances. Glad you plan to talk with her about your feelings! You both sound like you deserve so much happiness after all the two of you have gone through, I hope you both find that whether its with each other or not! Best of luck!",
            "Historically you two getting married would have not only been acceptable it would have been the norm and even the law. However now it might be considered well outside the norm. I would test the waters with her and if she is receptive try dating, then perhaps combining your households. Let your in-laws and the rest of society get used to it.",
            "This is the sweetest thing! Sorry I have no advice but hope it works out, am rooting for you!",
            "When you have dinner again and the kids is not in the same room or the are sleeping you can tell her what your son have said and see her reaction?",
            "Go for it man.  If she says no then move on.  I’d rather try then regret.  Good luck !",
            "I’m hoping the best for you and your family! Keep us posted!",
            "Good luck, man. Hope it works out.",
            "Don't act on this. It's far too complicated. If your wife were to ever reappear it would be an absolute disaster. It already sounds like it would be a disaster with your in-laws. Your children like the idea of it because she's their AUNT and because your children are young. It's someone familiar and motherly to them. I am sure when they grow up, they would be disturbed by the situation and would be hurt that you got with their mom's sister. It's understandable you have a lot of emotional attachment to this woman, but it's best to look outside the family for a new wife.",
            "Bruh just what is wrong with you like really you really don't seem to have any kind of morality. \n\nThat's your sil for God sake atleast think about your brother once."
        ]
    }
]