[
    {
        "post_id": "bdxw27",
        "author": "moveinanxiety",
        "title": "[Update]I [30f] want to discuss moving in with boyfriend [34m] but we have a significant difference in income.",
        "url": "https://www.reddit.com/r/relationships/comments/bdxw27/updatei_30f_want_to_discuss_moving_in_with/",
        "score": 7646,
        "num_comments": 211,
        "created_utc": 1555441935.0,
        "selftext": "OP:  [https://www.reddit.com/r/relationships/comments/b820za/i\\_30f\\_want\\_to\\_discuss\\_moving\\_in\\_with\\_boyfriend/](https://www.reddit.com/r/relationships/comments/b820za/i_30f_want_to_discuss_moving_in_with_boyfriend/)\n\nThanks for all the advice, I ended up broaching the topic last week.\n\nAs mentioned in the first post both my boyfriend and I have been hinting around the topic but hadn't directly discussed it. I was still on the fence about bringing it up myself when my boyfriend made a comment about how he's excited for us to live together (one day). I just responded with, \"Well did you want to? My lease is up in July.\" and he said that he did.\n\nIt was before work when it happened so we left it at that for the day and got together that evening to work out details. I expressed to him at that point that while I would love living with him that my concern was that I wouldn't be able to contribute equally and I didn't want him feeling taken advantage of. He in turn expressed that he'd never want to put me in a bad position financially and that we could easily figure out something that would be fair while still putting me in a better financial position.\n\nWe ended up deciding we'd go with a lump sum monthly that I'll pay to him to cover all the costs, rather than splitting bills. The monthly amount he offered at first I actually upped because I didn't think he was being fair to himself, and it was still less than what I pay now. He seemed happy with that and it definitely works for me!\n\nHe keeps mentioning how excited he is to move in together, and came to my apartment last week to help me clean for photos to show it! We're deciding together what we'll keep out of my furniture vs. his, what we'll get rid of and what we're going to store. He's also mentioned a couple renovations he wants to get done around the condo so we're going to go together to pick stuff out and make it a summer project. :)\n\n**TL;DR:** Boyfriend gave me an opening to ask about moving in so I seized it. All went well and we'll be moving in together in June!\n\n**Edit:** Wow... this really blew up! Thanks to everyone for the super kind words. To address the most common comment here; we did discuss splitting proportionally but ultimately decided to go with a lump sum. I definitely see benefits to proportional splitting but for where we are right now and my financial situation I prefer a lump sum. It's still significantly less than what I'm paying now, and it wont fluctuate as the weather changes so I can count on what I owe monthly not changing.\n\nMany people have mentioned chores as well. My boyfriend and I tend to do chores together. I mean right now with two separate places we each have our things that are more our responsibility but when I've stayed with him for a stretch of time we've just balanced together. He doesn't know how to cook but wants to learn so we cook meals together and then clean up together. We will each have our own washroom at his place (I've already taken over the main washroom and he uses the en suite). He volunteers at a local animal shelter once a week so those days I clean and cook if I'm around. But generally speaking we just treat doing chores as an opportunity to spend time together and be productive. :)",
        "permalink": "/r/relationships/comments/bdxw27/updatei_30f_want_to_discuss_moving_in_with/",
        "comments": [
            "Aw, this is adorable! You guys sound like you communicate well and really care for each other, good luck!",
            "Congrats! My SO and I did something similar, and I wanted to pass on something I wish I'd learned sooner: if you don't have a rental contract, you should put a utility bill in your name. You'll need that credit history, and it will come in handy for legal identification purposes (like if your state requires a copy of a utility bill, rental agreement, or mortgage in order to get a new driver's license).",
            "Awesome! As a homeowner from a purely financial perspective of course it makes sense for him. He is paying 100% of all those costs right now anyways so anything you contribute saves him money. Obviously he had other reasons to want to live with you as well.",
            "\"We are deciding\" \"we will keep\" \"we are going to do together\"\n\nthis is how i expect updates in this subreddit\n\ncongrats",
            "Congrats! I’ve been in your situation twice... and split differently each time. \n\nFirst: He talked me into moving in for financial reasons since it’s quite expensive where we live. Since I moved into his apartment which was more than double mine it would have cost me more to move in. He convinced me that the fair way was to split rent weighted by our incomes which decreased rent for both of us.  Then we would alternate paying for regular meals out and he treated me once a month to a fancy meal for our month-aversary that I wouldn’t have been able to afford. \n\nSecond: He owned his home and felt like it was taking advantage of me to have me help pay down the mortgage when it was technically his house. I also didn’t \nwant to feel like a burden but he said he would have paid the mortgage whether I lived there or not. So instead since he knew I wanted to contribute, he suggested that I put my old rent amount into a fund that we used for vacations and fun outings. It meant that we could go on nice vacations together that I wouldn’t have been able to afford otherwise. And I could feel like I added to his life too while making fun experiences for both of us. \n\nMost importantly... it’s good to remember to re-evaluate! Maybe every 6 months just to make sure that whatever you choose still feels fair for each of you.",
            "The most important thing is communicating expectations and needs - something you both have clearly managed here! One of the things I keep reminding myself as I get older is that financial equality isn't always super important - there are a million valuable ways to contribute to someone's life, and they're all valid.\n\nRecently a friend reached out to ask me if it was weird that her partner frequently cooks meals from scratch for her, but she never reciprocates - partially because she hates to cook. I suggested other ways to return the favour are also  usually appreciated - paying for a takeout night, asking if she can bring anything or help out, offering to pick up and pay for the items he needs to make said dinner, offering to clean up, etc. There are lots of ways to help each other out, and this is only going to help both of you financially in the end!",
            "Just chiming in because I've been there, and I was struggling so hard to be \"fair\" that I was putting every penny I had into bills and he had tons of disposable income left over.\nAfter we talked it out we actually decided it was more fair to try a third option .. besides lump sum or 50/50 split, which  would be a percentage split.\n\nYou have to play with the numbers a bit but for a very simple example, \n\nIf you make 1000 per month and he makes 3000 per month, and rent is 1200.. he can pay 30 percent of his income per month, 900. Then you pay 30 percent of yours, 300. It sounds like he is paying alot more but really it's pretty fairly split as you both then have the same percentage for fun money, ect. \n\nIf you just eyeball a lump sum you might end up agreeing to pay 500 per month to his 700 because it SOUNDS more equal, but then you're actually putting 50 percent of your income into housing and he's doing closer to 20% which sucks for you.",
            "When my now husband and I first moved in together, he had a great job that paid all of his expenses and then some, and I had a very shitty job that barely covered rent and a phone bill. He was gracious and generous, and I paid about 1/3 of our bills and he covered the rest while being able to save.\n\nYears later, I made more than him and I covered most of the bills while he did what he could. The rest went to savings.\n\nNow, he is again the primary bread winner. But we’ve saved a lot through the lean years and we make it work as best we can.\n\nThat’s the beauty of sharing your life with someone. Each of you will have ups and downs. But you work together and make it happen.",
            "Nice. Same situation with my lady. I was thinking I’d just ask for a standard monthly contribution rather than trying to split each bill. Glad it works for you.",
            "Yay! I love a happy update.",
            "I love that you're also picking furniture items from both people ... Making it a shared space with everyone's possessions is so important to making you both feel at home. \n\nAnd also wise to not ditch everything you won't be bringing over. It may feel pessimistic, but it's really just pragmatic to hold on to all your duplicate items. You never know why or how you might need them in the future (besides just the pessimistic possibly of a breakup--there a plenty of other occasions where backup furniture could be useful!)",
            "You guys sound so compatible! That's amazing! Congratulations!",
            "sounds like you're doing well with boundaries and communication. yay!\n\nkeep in mind that you are helping him build equity in his condo - he'd be paying that mortgage whether you were living there or not. \n\nIt's wonderful that you want him to feel like he's being treated fairly, and that's very important. But since it is his condo that he'd be paying for regardless, know that any amount you're contributing is lowering his expenses and helping him build equity. So make sure that this is also a great financial move for you, too. if you're paying him the same you're spending on your own, it's actually not working out that fairly for *you.* Be fair to him, yes. Also remember to be fair to yourself. even if you're only contributing $500 a month, you're reducing his monthly expenses by 80-100% of the amount you're contributing. So make sure your expenses will also be lower as a result of this move. Especially since, if it doesn't work out, you'll be the one moving, not him.",
            "This is essentially the exact conversation I had with my girlfriend when we moved in together.  I understand that I make more than her and weighted our rent to reflect that. Also she has student loans and I would love to help her pay those of faster even if that means I'm covering more of the rent than her.",
            "Awww , it sure put a smile on my face :D",
            "i'm glad things worked out! it sounds like your communication is really strong!",
            "Yay, happy update! Have fun moving in together!",
            "This is exactly what I did with my gf when we moved in. I currently make 3x more than her but she will make 2x my salary one day. We agreed on a set amount each month and I take on all the bills. It actually works out great for us even though I'm paying more. Having larger lump sums in my paycheck has allowed me to pay off debt faster from my student loans.",
            "Just make sure you don't rely on him too much in the future. You seem to be aware of this now, which is great! But try and move up where you work and make a more stable income in the next year so that if things don't work out with your bf, you have the money to look for a place elsewhere. \n\nNot trying to be pessimistic about your relationship. Just wanna emphasize the importance of taking care of YOU first and making sure you'll be ok no matter what other people do around you.",
            "Congratulations.  I’m so happy for you two. Way to be open and honest with each other.",
            "Work together and save together!",
            "Awwwww!!!! What a cute story! You’re going to have the best summer!",
            "You guys sound like a great pair! My husband contributes more financially as well (he makes more than double I do), but he's never made me feel guilty about it. I know if our financial situations were reversed, I would do the same for him! I always try to give extra when I have it (giving him my bonuses from work and such). I also do the majority of the cleaning, which he never expects I just feel like it's a way I can contribute to the household and it's free! You guys aren't just roommates, you are a team. Best of luck to you both! :)",
            "I'm glad things worked out well for you and your BF.\n\n&#x200B;\n\nMy wife and I started living together back in college. We shared some costs during college. Once we graduated, we decided to get a house a year after. Due to some circumstances, I became the sole bread maker of the house. However, my wife took care of everything else that going on in the house while I focus on making money and killing spiders/ants/moths.",
            "You're amazing and an inspiration for everyone struggling to speak up about uncomfortable topics! Have a great relationship <3",
            "My girlfriend makes just as much as me, and I only charge her 500/mo for a 4 bed, 3 bath home in metro Denver. \n\nI figure I’ll marry her soon anyway and we plan on having joint accounts after the wedding so it doesn’t matter. Lol\n\nHonestly I feel like she pays to much as she loves to cook and is a clean freak. I keep a tidy house but it’s not up to her standards, so she does everything and seems to like it..",
            "This is great! Good for you! My boyfriend [30m] and I [27f] have just started discussing moving in together as well and are in a similar situation. I make just over $70k and he makes closer to $375k when he starts his new job. We try too split things evenly when we can but be definitely steps up from time to time to cover the cost of cabs and meals (we live in a big city). I think it’s very important to discuss money openly especially with an SO and it seems like you’re on your way. You can also find a lot of information on this sort of stuff on the Refinery 29 “Money Diaries” Facebook group.",
            "I commend you for this! You handled this so professionally even though it was probably pretty difficult / awkward to discuss being the one in the “less lucrative” position",
            "Congratulations! I was in the same boat with my girlfriend back in September. She kept bringing up that she didn’t make as much and felt really guilty but we sat down and laid out all the bills and separated them so that we were paying about the same percentage of our paycheck (if wording it like that makes sense). She’s hourly so when she does have overtime wages she will offer to throw some towards rent to help. \n\nStep up a plan so that you both are still able to save and have your own fun money. Good luck!",
            "This is so wholesome",
            "This is a really sweet relationship post.  You’re both really thoughtful and genuinely concerned for the other.  Good job OP.",
            "Did the same.  He offered me 400 a month but I said 600. It's been working beautifully. He makes more but damn if I'm gonna be a kept lady.",
            "Warning.  No matter how lovey dovey you two are moving in with anyone is no joke.  These sorts of things can even break couples.  Just try to keep the communication open at all times and since you'll be living together make sure you give each other plenty of space.  Good luck, seriously.",
            "My wife makes more than double what I make.  This does not bother her at all, but as the lower earner, it’s not as easy for me. After consulting with friends and the internet, here’s how we decided to split expenses fairly (NOT equally)-  each of us pays the percentage equal to our percentage of the total household income for any large purchases/expenses (rent, furniture, etc) .  \n\nEx- for simplicity sake let’s say your combined total income is $100,000 and your monthly rent + utilities totals $1,000. If partner “A” makes $65,000, that’s 65% of the total income.   “A” would pay 65% of any expenses you decide to apply this formula to and “B” would pay 35%. In this case, “A” pays $650 for rent/utilities and “B” pays $350. \n\nMy wife and I use this formula for rent and used this when we bought a new couch and TV.  It takes the pressure off and allows me to contribute a fair portion to expenses.",
            "Let me just chime in real quick with how my boyfriend and I deal with it. \nHe makes significantly more money than I do, so we have a joint account that we each deposit half of our paychecks every week in to. And we pay all the bills and household expenses with that, leaving the other half in our personal accounts to be used on whatever else.\n That way it's proportionate to what we make and we don't touch the joint account other than for bills and such so it allows us to start saving as well.",
            "> But generally speaking we just treat doing chores as an opportunity to spend time together and be productive. :)\n\nYou guys are going to be very happy together. <3",
            "Honestly sounds similar to how i moved in with my now husband. Though i make more now. Things can always change. Happy i read this today, and good luck to you both!",
            "Congrats! Now go be happy and leave this terrible place.",
            "Agree with everyone else. Bills and rent should be based on percentage of income (each person puts in 30% for example). It's super unfair for one person to have to use a higher percentage of their income to pay for a shared living space in a committed relationship. Like... if I'm living with a guy, I'm testing the waters to see if he's marriage material, and if he's being cheap and forcing me to struggle more financially than him, then there won't be a future. It's especially annoying when the guy doesn't pull his weight when it comes to domestic responsibilities, which seems to be common.",
            "Partner and I had the same situation moving in together. Being open and honest and reassessing is so important. As the partner who makes more it feels good to acknowledge there is a gap but to also be fully confident that “we are deciding, together”. Eventually we will get married and even more so our assets will be commingled so I stopped thinking about it as “me subsidizing her rent” and more like “we both pay what we can afford to main the lifestyle WE both want to share.”\n\nI DO NOT recommend using chores as a way to alleviate the difference; I think it’s only OK if someone works *significantly* more hours. I think relying on chores can lock in the shitty gender roles so much of society is trying to get away from; especially since my partner also has a busy full time job. \n\nWhen we have kids, I don’t think it’d be fair for me to say “you change the diapers cause I make more cause I studied X.”",
            "communication is key. you did it right.",
            "Glad you were direct in communicating your desires and he was receptive. Sounds like a win for you both!",
            "He sounds like a keeper.",
            "I love this update. Congratulations!",
            "You two sound really healthy and well adjusted. Keep up the great communication!",
            "Yay! That’s exciting. I missed your first post, but I was in the exact same situation prior to moving in with my boyfriend, and we actually came up with the same agreement you guys have now. It’s been almost a year of us living together and it’s still working out great for us. I’m in the process of paying off some debt, and once I do that, I will offer him more money each month. \nGlad you guys were able to work something out!",
            "Good resolution. My husband and I did the same when we moved in together. Alaska can be really expensive so I said I would happily move in with him but I couldn’t afford to pay more than I was currently paying for my room in the shared house. He agreed and I paid him that amount each month and then obviously I had my other personal bills too (gas, insurance, phone etc). It worked well for us!  Good luck!",
            "Do not pay for storage! Never worth it If it's long term",
            "omg so in love this wonderful!",
            "That's incredible! Congrats! May your journey together bring you closer and here's to a life of happiness!",
            "Just came here to say I am happy it all worked out and wish you guys all the luck and happiness on this new start!",
            "He is a decent man. He is thoughtful and kind! Wishing you two all the best!",
            "When my husband and I moved in together, before getting married, we decided that I would pay rent and he would last for the internet, groceries and utilities. Anything else like our phones, gym membership she small individual, non-home-related items we would handle on our own.\n\nWe still do that actually only now it's the mortgage",
            "Congrats! I love living with my boyfriend, but there was definitely a period of adjustment we both had to get through. You'll probably discover little habits that'll feel cute at first, and then get annoying later. (for instance, boyfriend leaves dishes in the sink which I don't mind but he doesn't soak them so then food gets STUCK on). Just remember not to blow things out of proportion; communicate when things become an issue, don't sit on them and let them become bigger issues.",
            "Awww yay cute!! Have fun!",
            "I'm so happy for you!  \nMy mom always told me as a kid that percentages are more fair in relationships. Things don't always have to be 50/50. My parents both paid lets say 25% of their monthly income into a joint account and that's how my husband and I do it too. It takes the stress out of trying to keep up with your partners income.",
            "This sounds like a great update! Just make sure that you could afford to move out if you need to; don't let lifestyle creep eat up the savings you're getting from paying less.",
            "Congrats! I mean, if you're spending less than what you are now and he's getting money contributed to him, it sounds like a win-win and you're both saving some money! Hope it all works out well =)",
            "Yay! What a nice update. I bet he already knew you made a lot less and you worked yourself up over it, he sounds like a reasonable guy, and you a caring courteous person. Best wishes to your next chapter!",
            "Biiiig steps are best when broken down into baby steps...\n\n&#x200B;\n\n&#x200B;\n\nYou guys are awesome! Keep up the strong communicating, and good luck!",
            "Awesome! I’m glad you two communicated well and it worked out splendidly.",
            "This is great. You’re a partnership. My DH and I have had vastly different incomes over the years. Switching who earns more. Only time it’s been an issue was when I gave up work to raise our kids and I was the one with the issue. I really struggle with not contributing financially.",
            "Congrats. Sounds like a plan. Don't worry about the money. As long as both people are contributing to the best of their abilities - don't even think about it.  Y'all just enjoy and - don't worry about the money.",
            "My SO and I did the same thing! I make so much less than my boyfriend that if we did percentages of income I would be paying a stupid small amount, so instead we did a little under what the recommend amount per month is for someone who earns as much as I do, and he does the rest. I’m still paying less than what I paid when we lived separately. We split bills like water and electricity and internet down the middle. Otherwise I pay for myself for most things, as does he (groceries in half unless he wants fancy things then he just does that, same with like alcohol, etc). \n\nFor things like furniture we have a just in case document where if our relationship ever ends we know who bought what or what we split on. Even though he can’t really afford the place without me, our plan is that he will stay and I will leave without the need to contribute to rent if our relationship ends. I think it’s good to talk about the scary stuff and have a plan for it. Hopefully it won’t happen but if it does we’ll be glad we won’t have to figure out fairness and logistics in a really difficult and sad time. \n\nMy suggestion to you is to not feel guilty about contributing less. I did for a while to the point where I didn’t express my concerns about not saving any money myself. We had a conversation a couple months ago where he realized that I had only a couple hundred in savings from my new job. He was really upset that he was able to save so much when I was living paycheck to paycheck. He didn’t think it was fair and we adjusted.",
            "Awwwww...so nice to hear a story where things seem to work out for everyone involved. Best of luck to you and your bf.",
            "I smiled so hard at this post. I stan",
            "Love happy updates. Doesn't happen too often around here!",
            "Honestly, congrats guys. I think you guys will do well.",
            "This sounds very similar to what me and my now husband were doing until we got married a few months ago.  Worked out perfectly for us! Congrats on a happy compromise!",
            "Happy for you guys. If you decide to get married, keep the financial conversations going. Make sure you are on the same page about debt. Personally I think that is terrible and people should fight their way out of it however possible, and if I had a wife that didn't mind keeping that around then that wouldn't work very well.",
            "Glad to read your update. When you're in the relationship because you love one another, the bills work themselves out. It sounds like you're both on the same page.",
            "If I were you I'd be looking for another opportunity. You're 30 and wasting your life at a job that pays you peanuts it sounds like.",
            "Awww :) well that turned out well. Well done. I’m happy for you. Such a fun and exciting time in life.",
            "Sounds like a good lad",
            "Unless you have access to free storage, sell or give-a-way whatever it is you plan to store - chances are, you'll just end up paying storage fees and in the end never use again whatever it was you were storing.",
            "I'm great that you've had such a good communication on this. Frankly, why not just get married at this point?",
            "And this guys, is how great relationships form! \n\nIt sounds like you guys are working extremely well together and I wish you both nothing but great things for the future!",
            "Hey! I’m not sure if someone has suggested this already, but I’ve heard some couples with greatly differing incomes split according to percentage of income.\n\nSo, say you make $30,000 post-tax and your partner makes $50,000 post-tax, and say your shared living expenses are $3,000 a month, then your portion could be $1125 and theirs could be $1875. ($30,000 divided by $80,000 combined income = 0.375 multiplied by $3000 combined expenses.) And if you work less hours than your partner, you could contribute in other ways to help bridge the gap.\n\nI’m sure there’s a way to scale this better, but I can’t remember the math. Maybe something where half of total expenses are split 50/50, and the other half of total expenses are according to percentage of income. So, like...you each pay $750 to cover the first half of $3000, and the other half of the $3000 would go $562.50 extra for you and $937.50 extra for him. \n\nOh, and set up an account where you both throw money into every month to pay for common expenses, split according to whatever you decide. (Also I’d recommend hiring a cleaner once a month out of that fund, if you’re both into that idea. Keeps the peace.) \n\nGood luck!",
            "Congrats. You and your s/o have great communication skills. \n\n\nGoodluck in the new place",
            "Glad it worked out. I make about double what my gf makes just end up paying 2/3 of expenses while she pays 1/3. No biggy :)",
            "How did you guys meet?",
            "I told some of my first room mates that I'll just take a fair contribution relative to their earnings. I don't care about money as much as I cared about enjoying their company and them being happy.",
            "I think you might have a keeper here.",
            "Hey, this is the deal my boyfriend and I made when I moved into his house!\n\nI pay a lump sum, and he does with it what he wants. Works for both of us. :)\n\nI’m glad it’s going to work for you guys as well! Living with a significant other is awesome!",
            "I know this is an update and not to give advice so. Congrats on working out your issues! My future husband and I share an account where all the money for the bills go. We split the money according to our revenue, so it's not 50/50. Now it's actually more like 70/30 but you know it works. And it's a step toward the solidarity two long life partners owe to each other :)\n\nI'm glad you found your middle ground!",
            "Just an idea, my boyfriend and I do it by percentage so it’s fair.",
            "I will move in with my boyfriend in July as well because that's when my lease ends. He earns more than me and I had troubles bringing it up too. What a coincidence!\nI am glad it worked out for you though. Its so sweet good luck to you two!",
            "You both sound great and as a couple too. Congrats!",
            "My partner and I now earn roughly the same amount but we didn’t always.  We put the same amount into a joint account and then all of the bills and food etc.  come out of it.  \n\nMoving in with a partner is amazing, you guys sound like you are great communicators!",
            "These are the kind of updates I live for in this sub.  I'm so happy for you!",
            "I asked my gf to move over from HK (we met there while I was travelling - I'm also Asian so none of that WMAF stuff). It's a huge risk and jump for her, plus I already make more, so I offered to pay for everything until she gets a job - in which we'll split as fairly as we can.\n\nWe're both trying to save for a down (in Vancouver). So hopefully she can get a job soon. But for now, imo it's worth it. At least there'll be my gf beside me when I wake up now. Haha",
            "Awwwwwwww\n\nY'all are adorable",
            "When my fiancé first moved in she was just starting out in her career and was not paid as well as she is now. \n\nThis is how we split bills, pretty simple actually:\n\nTotal of both incomes divided by individual income = percentage of bill responsibility. \n\nWe live modestly but I understand this formula wouldn’t apply to every scenario.",
            "That is some clear communication!! Good job!\n\nI wish you all the luck and happiness in the world",
            "Aww that's so lovely! Actual couple goals! Need to find a man like this!",
            "Most people are only concerned about having to contribute too much. You are a rare gem.",
            "Awe thats awesome, congrats!",
            "Maybe look into a /r/PersonalFinance post as well to help you do more with your money.",
            "You two seem smart and communicative- you will be a great couple for years to come! Congrats!!\n\nAlso, one great piece of advice when I started living with my partner. In the beginning, before you fully establish who does what chores, do not take on more than half because you feel guilty. What chores you start from the begging always tend to stick to you as “your chores” \n\n\nEnjoy your house of love!!",
            "As for chores, that's how my partner and I did it for years! Usually one of us would do the dishes while the other cooked, and for most other chores we'd just both pick a chore in the same space at the same time. \n\n(Now that we're working and have a kid and a second on the way it doesn't really work out that way any more but for a long time it was a great system :)).",
            "You two sound like you are going to have many great days ahead together!  Best of luck to you both! Ya'll are awesome!",
            "When reading through your previous post, my first thought was that he would most likely be elated to have any additional help with costs considering he was paying for everything on his own anyway.   You moving in and paying less then what you were at your old place is a win-win for both of you.",
            "So glad to hear things worked out. I was in a similar situation with my boyfriend last year. I was also scared to broach the subject but when we finally talked and worked out our financials we found it would work out. We've been living together since February and I'm so happy",
            "Good for you! My boyfriend asked me to move in with him a few years ago and we both made the same amount of money. So I knew with his roomates leaving, it would be just him and I taking over his lease and we would have to split everything 50/50. Rent plus utilities sucked up most of my income. Plus I have a car payment, so I had next to no money for anything else. Until he got a better job. He was bringing in significantly more than me and before I could even ask him if there could be a shift in our 50/50 split, he tells me he will take on a larger portion of the expenses. It was such a relief! Now that I finally got the promotion I've been after for a while, things couldn't be better. Keep up the good communication. Sounds like you two have a very bright future!",
            "Haven't read too many comments but this EXACT thing happened with my now live-in GF. It was simple and was a win all around financially for everyone.\n\n&#x200B;\n\nGlad this worked out for you, we did something very similar and I gave her the option to pay X amount or if you opened up a 401k you could take whatever amount off of monthly rent that you put into that, which is 100/month.\n\n&#x200B;\n\nI still pay a lot less on my monthly bills, she still lives her same lifestyle while preparing for her future.\n\n&#x200B;\n\nI would also have him draw up a lease to make sure everyone is safe.",
            "Just adding to the thread here with a big \"thank you\" for the update, and for all of the other positive comments here. Growing up, my parents had a god-awful relationship to money – it was used as means of manipulative control, primary source of arguments, the works.  I vowed that in my relationships, I would do my best to prevent that. \n\nI (28F) am currently in a situation where I make more than my partner and we're starting to have these kinds of discussions as more of our lives intertwine (planning travel, fun excursions). Just reading all of these healthy examples of communication and ways of working things out is heartwarming and encouraging, and reassures that I'm on the right track.",
            "I’m so glad it worked out. May I also recommend putting this in writing? It’s for the protection of both of y’all and might help you think through what happens if one of you loses your job, etc.",
            "what a great outcome! my husband and i first moved in together into our first house (we were engaged at the time). he knew my financial situation very early on into dating. when we moved in together he said \"i'll take care of the mortgage and the bills, you take care of your debt and put X money aside per month for when taxes come due.\" it was an amazing agreement and i didn't take advantage. i paid off $13k in credit card debt (it took me one year with our arrangement!) and then proceeded to proportionally pay bills after that. i still have student loans to pay off but he helped me get in better financial health, and really, there's nothing better than a partner who can understand stuff like that and meet you halfway, as long as both parties are willing.  \n\ngood job, OP!",
            "These posts always make me so happy! This is such a wonderful sign that you are both communicating openly and thinking responsibly!",
            "Congrats bb! Enjoy it! It’s exciting!",
            "You are off to a great start together, and I wish you good luck and great happiness!",
            "Why are people always moving in together these days? It seems like such a hassle. And it never ends well.",
            "Way to go!  Two thoughts: write up a cohabiting agreement that also covers chores, time spent together expectations, time spent with families, friends, as well as money.  Have a written agreement of how to lovingly deal with conflicts and hard feelings.  Review monthly and adjust as mutually agreed upon.  You don't have to go all Sheldon Cooper on this (Big Bang Theory), but the sooner you write down your separate and mutual visions of the logistics of living together, the stronger your relationship will become.  \n\nThe other is to warn you that putting things in storage is a slippery slope.  Most people (myself included) wake up three years later and realize they've spent $10,000 for items that were replaceable.  Maybe put \"review storage rental\" on your cohabiting agreement.",
            "You guys sound all set\n\nFor reference, I am 29 and my SO is 26, I make significantly more than her and we split rent 450/600 weighted towards me, split internet, and do roughly 70/30 on groceries (though I tend to just let her pay me what she thinks is fair whenever she feels like it so I don’t keep a running track and have no idea if it actually comes out at 70/30) \n\n\nMost normal guys are pretty happy to be in a position of helping their girlfriend, and while we are busting down gender norms as young people and equity is a social justice requisite for our new society we’ll slowly trying to build, it still feels good to be “the man” to a lot of guys and they don’t view it as being taken advantage of. Your boyfriend is throwing all the signals that tell me he’s not thinking negative about it and is excited to live with you",
            "Chores are $$ too.  Do at least 50% of the house chores, that's a really big deal.\n\nI don't know what your dynamic is with the BF.  But If I were him, and I was paying 75% of the living costs... extra effort on cleaning/cooking would wipe away any feelings of unfairness.",
            "You've used the term \"broach the topic\" more than I've ever heard in my life",
            "You come off as quite educated and competent. Whatever your income is now will be a thing if the past fairly soon",
            "In we China.  Men pay all the rental. Girls get laid and he should pay you $100 each time."
        ]
    },
    {
        "post_id": "cl8svr",
        "author": "Jsguitar1",
        "title": "Girlfriend (25 f) dislikes my (30 m ) relationship with my baby sister (10 f)",
        "url": "https://www.reddit.com/r/relationships/comments/cl8svr/girlfriend_25_f_dislikes_my_30_m_relationship/",
        "score": 7632,
        "num_comments": 824,
        "created_utc": 1564774581.0,
        "selftext": "I am very close to my baby sister. We share a father, but not a mother. My dad, is kinda a flighty guy. As a result, I’m more of my sister’s dad than he is. I have her so often that I have a two bedroom condo and every house hunting venture lately considers her.\n\nMy girlfriend of six months doesn’t like that she’s always at my house, that she has a room, or that I do her laundry. My girlfriend was putting sheets on my bed and there was a pair of my sister’s underwear that fell out of them obviously tangled in the dryer. She lost it. She was saying our relationship is weird and I have to stop having my sister so much. Honestly, that’s not gonna happen. I love that girl, and I’m basically her dad. So I need advice in telling my probably soon to be ex that.\n\nTl;dr girlfriend is jealous of the time I spend with my little sister and basically insinuates it’s inappropriate. How do I tell her to chill? More importantly, how do I keep her from telling other people that?\n\nEdit: we did sort of fight when she said that. I told her my sister is the age I was when my mom died and I had to go live with my dad full time. I wouldn’t wish that on any child. She knows my mom died horribly and I think she knows the impact it’s had on me\n\nSide note edit: all you ladies telling me taking care of my sister is hot are too Sweet. if only you existed in real life. Thank you",
        "permalink": "/r/relationships/comments/cl8svr/girlfriend_25_f_dislikes_my_30_m_relationship/",
        "comments": [
            "\"If you cannot accept that my sister is a priority in my life, we're through.\"",
            "Hey from another much older half sibling with a flighty dad! I am 36, and my sister is 15. When I told my husband that I thought my sister would need to move in with us for a bit, he took a day off, completely cleared out his office/studio so she would have a nice big bedroom, and bought her a cool vintage wardrobe since the room doesn't have a closet. He did all of this before I got home from work. There are people who will think of your sister as an intrusion into their idealized version of a life with you. And then there are people who will make as much space for her as she needs, and see your love and support of her as a strength. You need that second kind of person, and it's okay to hold off until you find her.",
            "Oh my god, she's 10. Lots of women would take how much you care about your sister as a good sign.\n\nThe one concern I could see cropping up is that whomever you date might end up being the surrogate step parent to your surrogate father role, and not everyone is going to be comfortable with that. But if that's the case, they should just not date you.",
            "Honestly dude, you gotta dump this girl for your sister's sake as much as yours. Consider how GF's behavior looks to Sister - is that an example you want from someone who is (or could be) sort of like a stepmom figure? And that's separate from all the other (good) reasons people in this thread have given you.",
            "“The sister’s been here for 10 years and is bonded to me through blood. You’ve been here six months. I know what my priority is.”\n\nFYI, major respect for stepping up and caring for her and giving her a room in your home. You’re a very good brother.",
            "I grew up extremely close to my oldest brother and it made a big difference in my self worth. My dad wasn’t a present dad and was pretty much just there for finances. \n\nI just wanted to say your relationship with your sister is absolutely amazing and any mentally stable woman could see that.",
            "Your girlfriend is weird for thinking that something is wrong with you stepping up to help out your *10 year old* *sister.* Like what the fuck is going on through her head to get so jealous? She either thinks you're a pedophile, or she's simply jealous of a child, and neither of those are great.",
            "You'll find a much better girlfriend once you get rid of this one.\n\nMeanwhile, as a younger sister of an asshole brother, I am so jealous of your little sister. She hit the jackpot with you as her brother.",
            "Your girlfriend has in my opinion overstepped a line in calling your relationship weird if all you are doing is caring for your younger sister.\n\nIf she cannot see beyond her apparent jealousy I feel that she is only going to put more pressure on you to see your sister less or manipulate that into happening (maybe saying mean things to your sister too...? )\n\nWon't lie if it was me that girl would need to go. You deserve someone who sees the way you love your sister and thinks wow what a caring guy.. Plan day trips occasionally together etc",
            "Does this girl not know about laundry and how some things can be inside other things like sheets when they're drying.",
            "Your girlfriend was WAY out of line implying that ANYTHING was weird or inappropriate between you and your sister. That says more about her than you. I am so sorry. That must have hurt. I would have considered that a dealbreaker, if my partner considered me capable of such a thing.\n\n  \n\n\nIn the future, I would consider being very clear with people early on that your sister is a big part of your life, stays at your house, and you are like a guardian to her. Many people dont want to date someone with kids, and while your sister is not your child, you do spend a lot of time with her and some people may not want to sign up for that. Honesty is best.\n\n  \n\n\nThat does NOT make it okay in any way for anyone to get between your wonderful and caring relationship with your sister. You are an awesome brother!",
            "Are you saying that your girlfriend thinks you're fucking your 10 y/o sister?",
            "Just send her the link to this thread and tell her you’re done.",
            "[deleted]",
            "It’s odd that she would assume it’s inappropriate. Is it possible she has past trauma that causes her to automatically think that? Not that past trauma would excuse how rude those accusations are. Has she spent much time with you and your sister?",
            "I can't add too much more than what people have already said, but as a baby sister to 3 significantly older brothers (18, 16 and 10 year difference) I can tell you that she is going to look up to you and always know how much you did for her. My brothers used to always take me out to do fun things and treat me like a daughter AND a sister, and almost 30 years later we are still extremely close and have a bond I wouldn't trade for the world. So as a fellow baby sis - thank you.",
            "It’s sounds like you guys are incompatible. You seem to be in a father-like role and she is probably someone who doesn’t want to deal with kids (at least right now)\n\nTalk to her about it if you want, but you should probably go your separate ways",
            "You dodged a bullet. Take care of your sister and ditch your insecure girlfriend",
            "This reminds me of the post on here a long time ago about this guy in his 30s who had custody of his little sister 10-15. His girlfriend 20-30s was actively trying to sabotage her and get her in trouble. The guy set up a camera in the kitchen to see if his sister was doing her chores and it showed her putting away the groceries and the dishes. Later the girlfriend came in and took all the dishes and put them back into the dishwasher and took the groceries out of the cabinets and put them on the counter. Long story short, the girlfriend was immature as fuck and was jealous of their relationship. Which seems to be the case with you and your girlfriend.",
            "Man dump her so fast.\n\nTheres alot of women out there that would think your fatherly relationship with your sister is amazing!\n\nI mean you are technically old enough to be her father, ask her if she would feel better if she was your biological child rather than your sister. She might see how dumb her opinion is then!",
            "What are the other red flags? Is she selfish in ways you would not expect?\nJealous for no clear reason?\nI bet if you think about it they will start to add up.",
            "Tell her, if she can't accept that, that she can go fuck herself.\nMaybe phrase it nicer.",
            "Your gf of 6 months immediately jumped to implications of your relationship w your sister being “weird” (aka inappropriate) & that’s so beyond gross I don’t have words for it. She’s only been part of your guys life for 6 months & she’s already losing her mind over it? Your sisters got 8 more years before she’s realistically on her own...I don’t think your gf is going to suddenly become okay with you being like a father figure.\n\nIts understandable if she doesn’t want to date a man with a “kid” but she can’t then demand that you spend less time with your kid sister because she’s jealous, that’s ridiculous.",
            "You're a parent to her, not a lover and the fact your girlfriend even thought of that is extremely weird.",
            "I suspect your girlfriend has a history of child abuse ... she is struggling to believe that a relationship between an adult male and a female child can be healthy.\nBefore deciding whether the relationship with your girlfriend should continue or not, perhaps have a conversation about this possibility. \nChildhood sexual trauma has a long-lasting effect that doesn't just dissolve with time. We trust people who are not trustworthy and do not trust people who are.  \n\nSource - my personal experience.",
            "She is your sister. You are stepping up and taking care of her, and being a father figure when her biological father will not. If your (very new) girlfriend can't accept this, then you'll just need to move on and date someone with more empathy.",
            "Explain to her that you are the closest thing to a real father that she has. She's a vulnerable child who needs family. This is part of your life and is not going to change.",
            "your sister needs you more than your girlfriend. you have a bond that was built in the course of 10 years that your gf needs to appreciate. it sounds like your gf is actually jealous of your sister. maybe talk to her about why she doesn't like your sister or your relationship with your sister. there is absolutely nothing inappropriate in having a paternal role to a sister and if that's her only reasoning you really should kick her to the curb. good luck! update us!!",
            "In future relationships, you should mention early on that you basically have a father/daughter relationship with your sister. Some women will think that's great. But for other women it may be a deal-breaker because they don't want someone else's kid in their life.",
            "My sister is 20 years my elder, different dads, and she was always there for me, took me for summers, took me over boyfriends on vacations/work trips. She was as much a mom as a sister, and we remain super close. I usually laugh off the advice on here as it's always \"LEAVE THEM, NOW\". \n\nHonestly, this person is out of her mind to insinuate that you should feel bad about caring for your little sister. You will be close your entire life, and if she can't accept that, move on.",
            "My wife's panties have become tangled in our bed sheets before, what does that mean?",
            "You’re a great brother. I’m wondering if gf isn’t getting couple time with you, and that’s why she is resentful. I would not call her a POS as some on here are, I would say she has different expectations and priorities than you and can’t deal with it. That’s all. Not a good match for each other.",
            "Do you know if you GF wants to have kids? You say yourself you're basically a parent to your sister rather than a brother. Is it possible she doesn't want to be a parent and wasn't expecting this parental role?",
            "This sounds like projection. Are you sure your soon to be Ex has never been sexually abused?",
            "My boyfriend has a 10yr old daughter and it is something I had to really think about when deciding to date him or not. Dating someone with a kid means putting your own freedom and life plans on the back burner for someone who is not your biological relative. Your gf clearly didn't expect or want to date someone who, essentially, has a child, which is totally reasonable. You can't blame her for not wanting that level of complication in her life, but she should also realize that this just isn't the right relationship for her.\n\nYou two need to have a serious talk. Make it very clear that your sister is a priority, and that the relationship won't be changing. Your gf has to decide if she wants to accept that or not. If not, it's time for you both to move on.\n\nRight now she clearly thinks the relationship with your sister is temporary or could change...which is the root of the problem, since it sounds like your sister is your priority.",
            "Throw the whole girlfriend away",
            "This woman has problems and you should absolutely tell her to take a hike.",
            "I think your girlfriend is not compatible with you. She wants to be in a relationship with no children involved (for now at least), and you have a child. Sure, your sister isn't technically your child, but she's spending so much time at your place that she has her own room and you're doing her laundry, so it's kind of like she's your kid. You aren't wrong for wanting to step in and be an important part of your sister's life. Your girlfriend isn't wrong for not wanting to date someone that is essentially playing the role of a single father (although she is wrong about how your relationship is \"weird\"). Not all women will feel the same way, but your current partner does, so you're incompatible. In the future, you should be very upfront while in the early stages of dating what your sister's involvement is in your life, so that they aren't surprised you are playing surrogate father. Because the role you're playing in your sister's life, while incredibly admirable, is not something everyone is going to be up for.",
            "I'm really curious about what your gf's story is.",
            "It seems like your girlfriend is uncomfortable with the closeness you have with your sister because she has some suspicion of inappropriate behavior. The way she reacted when she found her underwear in your sheet is not necessarily out of jealousy if you think about it in that context. I think open communication about her thoughts, her level of comfort with the situation, and your perspective (which is not inappropriate towards your sister), and an olive branch to develop a relationship between your girlfriend and sister would be helpful in this situation.",
            " You already know what to do, I just want to say “When people show you who they are, believe them”.  \n\nIn other words, when she figures out you are leaving and tries to tell you it was a joke, DON’T BELIEVE HER!\n\nGood on you for being an awesome brother, by the way.",
            "If your gf is acting this way when you’re around who knows what she could or has said to your sister privately. You’re sister is priority, if a girlfriend of only 6 months is being this way, she’s not the one. Find yourself someone who will accept the predicament your in.",
            "I think it’s so admirable that you have stepped up for your sister like that. I’m not a woman who wants children but I find it incredibly attractive and desirable. What is your girlfriend’s argument against you being in your sister’s life? She sounds disgustingly immature and possessive.",
            "How I see this: Your sister is pretty much your child and holds the same type of priority in your life a child would hold. It's fine if she doesn't want to date a single dad - in that case, break up. But it's not okay for her to imply that your relationship is inappropriate. \n\nGoing forward, you should make that clear to any potential romantic partner in the future.",
            "Honestly sounds to me like your gf has major jealousy issues. For her to insinuate something inappropriate is happening with your sister is just gross and shows a lack of trust and respect for you.",
            "I think your relationship is great with your sister, and so many people have provided talking points for you to address it with your gf.\n\nJust one sidenote I noticed though which I think you should take in mind, is that your sister is actually coming to an age where you should be teaching and letting her do her own laundry. It'd actually be good to start now, I'm a bit surprised she hasn't yet, but I think your family situation might lend to that. But in either case, teach her how to do her laundry herself, you can make it another bonding experience to teach her and you'll be helping her become more self sufficient (and you know, giving her more privacy during puberty and all that jazz).",
            "You said you love her and want to work it out.  So ignore all the “fuck you, I don’t care how you feel only my sister matters” advice.  After you try reasoning with her, saying it more like “She’s going to continue to be a priority in my life, and if you want me to share my life with you, as I do, it means....”. \n\nBut don’t start with that.  You need to explain to her that you aren’t just her big brother, you’re her surrogate father because she doesn’t have one.  And she’s like a daughter to you, and a huge source of joy in your life. \n\nThis isn’t a canned response.  The details matter, and you can absolutely make some accommodations.  Your GF wants to fuck your brains out and walk around naked and doesn’t want the responsibilities of a kid yet.  If she can have some accommodations and you can both talk about it (starting with you), that’ll help.  Try to give your girlfriend some boundaries while also not neglecting your sister.  \n\nAnd for the love of god, you need to open up about your vulnerability and how it would kill you to leave your 10 year old sister in the same situation as you were in.  And go from there. \n\nAfter all that, then it’s “She’s going to continue to be a priority in my life, and if you want to share my life with you, as I do, it means....”.\n\nGood luck friend.\n\nEdit:  \nAnd also, her being concerned that you might be inappropriate with a 10 year old isn’t a huge red flag.  It means she wants to protect your sister who is clearly vulnerable.  She doesn’t have the tools to do it, but her intent was good.  Boundaries are important for girls entering puberty, and she might be protective for a reason. \n\nIf you don’t have the tools either, go get relationship counseling.  They’ll teach you communication tools.",
            "you know the right thing to do here\n\nOne simple conversation with your GF that your sister is your sister, and needs protected and some stability - and that you as her stable older brother are the one to provide that...and that if she (the GF) can't see that - then it's just not going to work...and there is the door. \n\nCould be over and done with in 2 minutes and you'll be out having ice cream with your sister within 10.",
            "I would honestly cut my losses. It's not that she is just jealous of the relationship, but she's sexualising it when she says it's inappropriate. It's one thing to feel left out because you do things with your sister, but when she calls it inappropriate through a sexual context, then there is no reasoning with her.",
            "You're an awesome brother, and if I met a guy like that I would like him MORE for it, and do everything I could to support that relationship. \n\nIn a few years you won't remember her face, but your sister will remember that bedroom and your care of her for the rest of her life.",
            "Honestly it sounds like your gf doesn't want to be a partial parent and/or always make plans with that revolve around your little sister. She isn't wrong for not wanting that lifestyle but she shouldn't shame you for choosing to take in that big responsibility. You aren't dumping your sister on your GF so either she accepts and learns and starts to love your sister or it isn't going to work; your gf will be creating a hostile environment for your sister.",
            "I have 27D, 26S, 25S, and a 14 yr old daughter. My older 3 kids dote on their little sister a lot, and have her over quite often, especially my youngest son as he has a 4 yr old daughter who adores her young aunt, and vice versa. After he split from his wife, he got his own place with an extra room and bunk beds for his daughter and sister. He met his gf about a yr and a half ago now, and she was a bit weirded out because she assumed his younger sister was just the babysitter and wondered why the heck she had her own bed (she didn't ask right away as they had just started dating). He was so used to everyone knowing who his sister was already, so his dumb butt didn't explain. Once he did explain, it changed how his gf felt about him dramatically - FOR THE BETTER. Knowing how dedicated he was to both his daughter and his little sister made her realize that he was not just a fun guy, but a good man who put his family and loved ones first in everything, no matter what!  \n\nTHAT is how your idiotic girlfriend should feel about you and the very close relationship you have with your sister! Even more so, because you have raised her whereas my daughter still has both parents and her 3 older siblings!! I would seriously question the longevity of the relationship after her response. How can you want to be with someone like that hun? If explaining that you basically raised your sister and how losing your own mom made you feel didn't get through her thick skull, I don't think anything else will either.",
            "She knew y'all were a package deal, right? She's not the one for you if she can't accept reality",
            "OP, you should probably have a serious talk with her. I dont agree with everyone saying to dump her. She's obviously insecure and if everyone dumped people who were insecure about something, I think everyone would be single. Maybe shes just uncomfortable around a relationship like that bc shes never experienced one like yours. Or something else could have happened to her that makes her feel that way. Literally just talk to her. There has to be a reason shes doing this.",
            "Your gf probs wanted a normal relationship w you. No responsibility, hot sex whenever wherever in the apartment etc and is probably angry that isn’t a possibility and is hurt you’re kind of already in a parent role and it affects the youthful relationship that she fantasises about with you. \nI imagine that’s why she acts this way and is lashing out. She doesn’t hate your sister. Just what your sister being around took away from her. \n\n\nRegardless, she isn’t the right fit for you and your situation so imo (and the opinion of seemingly everyone in the thread) you’ve gotta end it.",
            "I find it so cringe that your gf is basically sexualizing your sister. She lost it over a pair of children’s underwear? That’s just weird. Your sister is a child, and a member of your family. I think it’s great that you two have a good relationship and that you care a lot about her.  As for your gf, she needs to either accept this, or she needs to leave. She sounds toxic anyways for trying to make you choose her over your sister.",
            "your Gf doesn't want to be a mother to a 10 year old. That's understandable. You're gonna have to choose. And if you choose your GF you lose cause you gonna end up resenting her anyway. Kiss this one goodbye. \n\nBe open with potential future partners. A lot of people don't want to be stepparents so I'm not sure how it got this far, but if you say \"no I don't have kids\" then a few month down the line oh yeah I pretty much raise my sister, that IS having a kid!  So be honest.",
            "Your priorities are in the right place, OP.",
            "You got your priorities right. Your girlfriend is an asshole implying your relationship is weird.",
            "I think you're making the right decision in the \"soon-to-be ex\". She clearly does not see family as a priority, while you do. You recognize that your little sister NEEDS you in her life and there is nothing inappropriate about that. Maybe she's jealous of the time and attention you give her, but it's really your GF's opinions that are inappropriate. Your little sister needs you. Dump this chick and find someone who also feels family is important and also wants to be there for your little sister.\n\nI would just tell her that family is extremely important to you and that you are extremely offended by her twisting your relationship with your sister into something inappropriate. You feel this difference in valuing family is a deal breaker for you, that you need someone who values family as much as you do and someone who will be supportive of you helping to raise your little sister, and obviously she is not into that role so it's time to go your separate ways.",
            "Sounds like you need someone able to step into a stepmum-ish role. This isn't gonna work.",
            "My brother did and does suck as a brother. I would have love to to have a caring, normal brother. Your girlfriend is weird.",
            "I really liked seeing this post. I'm sorry for the situation you've been brought up in, and I'm so thankful for how you have handled it. Good on you for being there for your sister, and keep doing that. I always longed for a big brother like you when I was a kid, I'm sure she adores you. :)",
            "Wow. I thought the issue was going to be that your girlfriend hadn't decided if she wanted to have/raise children yet, and was uncomfortable dating what amounts to 'a dad.' \n\nUnfortunately, if she decides she wants to shout her weird, jealous opinions from the rooftops, there's not much you can do about it. Just tell anyone who asks the truth and hope she moves on to some other drama, I guess.",
            "She obviously thinks there is a sexual component to all of this and since there isn't, that is more her problem than yours.",
            "I don't think it's weird your gf doesn't want to take in a 10 year old child she didn't sign up for. She is only 25 and might not be ready for that kind of responsibility/not want kids. But then she shouldn't have a relationship with you. You're basically a single divorced dad at this point, and for some that is a deal-breaker. Just be upfront with her, break it of if it comes to that. And be upfront to future girlfriends that she (your sister) is going to be there, take it or leave it.\n\nEdit: I want to add that  I missed the  implications she  made. Thats  fucked up.",
            "[deleted]",
            "Sounds like girlfriend has some issues. Do you kiss your sister on the lips or do anything that could remotely be misinterpreted as overly intimate? \n\nUnderwear in the laundry is a perfectly valid thing. You're her caregiver when she's there, so it only makes sense that you'd do her laundry. \n\nDon't give in to your girlfriend's jealousy. It's also a serious, major red flag. She's free to move on, you basically are a single dad. Not everyone is okay with that, and that's totally cool. That just means she has to move the fuck on and date someone who isn't the caregiver of a child.",
            "The fact that you call her a baby when she's 10 years old is concerning.",
            "> if only you existed in real life. Thank you\n\nI know you didn't mean to be offensive... Why don't you date someone 30 to 35. I think if you make that a priority, you'll be more life phase aligned.",
            "Lol if only we existed. If only we werent married.\n\nYour gf is nuts. And to be honest this is a very good thing. Shes showing you what she would be like if you two had a daughter. Moms get jealous of the daddys girl and dads get jealous of a mommas boy. It really does happen. How someone acts upon those feelings is the issue, nothing else. Shes the type it wouldnt sit well with and youd have to divide your time rather than combining it all. Shes a bag of issues.",
            "OP - you know the right thing to do...\n( •​_•) \n( •_​•)>⌐■-■ \nNow...do it.\n\n(⌐■_■)",
            "Your girlfriend has issues WAY above reddits (or your) pay grade. Dump her or deal with this for the rest of your life because issues like this just get worse after marriage when it's harder for you to escape.",
            "Did you tell your girlfriend you had a daughter when you started dating? That's usually a pretty big deal to most people.",
            "the most important consideration for all the adults should be what's in her best interest. it's clear that you believe that providing her with a stable relationship and a stable environment is your top priority. your girlfriend needs to understand that she will always be your second priority. if she can't accept this, then you need find a new girlfriend who can. this is also something that you could disclose on a first date to avoid any misunderstandings.",
            "She isn't wrong that it isn't a normal sibling relationship, but that isn't a bad thing. However it sounds like you essentially have a child since you have her so much even though you don't have legal custody. If she didn't sign up for that, I understand her frustration but it isn't really something I think you'd be able to work out",
            "I totally see your point of view and agree with most points made by other commenters, but I don’t see why your gf is being vilified here.\n\nShe probably came into the relationship not fully appreciating the dynamics of your role, given that your sister has parents. It would probably be easier if your sister was your daughter, because if she doesn’t like to have kids around much then she might not have made the decision to commit to you without all the facts.\n\nI’m not blaming you but at the same time, she probably didn’t realise how parent-y your role was. Now you’re 6 months in and the resentment has built, but so has attachment. But to be honest I can understand why she’s freaking out. She didn’t get into the relationship thinking you had a daughter. \n\nIt’s not easy coming into the father-child dynamic with all the information, let alone not really understanding your unconventional relationship.\n\nIt’s also hard to talk about your frustrations with the “dad” when he’s super defensive and won’t hear a bad word being said about the child or the relationship with the child. It’s intimidating. \n\nIf it’s too much, and your sister is bearing any of the brunt of your gf’s frustrations - of course leave. No question. \n\nBut otherwise, cut her some slack, listen to what she wants to say without getting too defensive and work from there. That is if you want to continue with the relationship.",
            "Talk about insecurities! Find someone else or just be single. This woman is bad news. Your sister needs you.",
            "It is unfortunate that you are jealous and hold resentment toward my relationship with my 10 year old sister, please understand she is my priority and I think it’s best you and I go our separate ways.",
            "Personally I would go around it as that the kid is not just your sister but also your child and that's a damn well good reason to keep her.",
            "You don't need to have a relationship with your half-sister, but it makes you a fucking saint that you're actively willing to be a parent to that little girl. \n\nWhy do you want to date a girl who doesn't see that?",
            "Your girlfriend has issues and I'd rethink the relationship.",
            "Your girlfriend seems very self centered and hasn't a clue what it means to take on the level of responsibility you have. She should be proud to get to call you her boyfriend. She's a little to old to feel she's in competition with a 10 year old. The fact she basically put you in a position to have to choose between her and your 10 year old sister is unbelievably selfish. The only good thing about that is she is giving you a preview of the kind of wife and mother she would be. The answer is a cold/heartless one. So consider yourself lucky and be proud of the man you turned out to be. She doesn't deserve you. Not one bit.",
            "Kudos to you for stepping up and taking care of your sister. She's lucky to have a brother like you. As for your gf. She needs to get over it or take a hike.",
            "Regardless of whether or not your girlfriend assumed anything sexual was happening between you and your sister, she’s obviously very insecure if she’s threatened by a *10-year-old girl/your sibling.*",
            "Uh.... your girlfriend is insane. Blood over batshit crazies",
            "I don't know how you could possibly continue to want to be with a person who is pole vaulting to the conclusion that you are having an inappropriate relationship with your little sister. I think if you search your feelings you've probably lost all respect for your GF. I mean, dude, what kind of monster wants you to ditch your 10 year old sister because she's jealous of her?? You shouldn't even give her an option of getting over her feelings; it's 6 months in and this is where she's at. This is when you dump someone to find someone more compatible. Wouldn't it be nice if you found someone who didn't need to be asked to tolerate your sister, and instead found someone that adored your sister, liked to spend time with her, and respected you for what you're doing for her?\n\nOoh lawd, ditch her and take your sis out for ice cream.",
            "If you gotta explain this one, she won't get it. Youre either down or you're not. The only response to this kind of thing is \"there's the door, no one is forcing you to be a part of this family.\"",
            "Family comes first.  Let the girlfriend know that in an ultimatum little sister always wins.",
            "Props to you for stepping up to care your sister. Anyone who has a problem with this isn't worth your time.",
            "For sure dump this chick. As for your sister, shes 10 she can start learning how to wash her clothes.",
            "Your girlfriend doesn't sound like a very good person. She's sister is basically your daughter. This will be an easy conversation.",
            "You’re a great man for taking care of your sister.\n\nDon’t forget: there are a SEA of women out there that wouldn’t give you this much heartache over something that 99% of people in the world wouldn’t question twice.\n\nLook up The 9 Iron Rules of Tomassi, and I think you’ll see everything from a different light.\n\nPeace.",
            "Drop the girlfriend. It is only going to get worse from here. I respect someone who takes care of their family, when everything falls apart on them - especially when that family member is a fucking child. \n\nYour girlfriend sounds heartless.",
            "Dump her, that is a mean/ugly thing to insinuate. Thanks for taking care of the your wee sister, I am glad she has you :)",
            "I'm proud of you for standing your ground (at least, so far here with us) about how you're not going to damage a very loving relationship with your sister because of this woman. Good on you, OP!",
            "You're an amazing brother. Keep being one and loving your sister as much as you can. Your (ex?)girlfriend sucks for not understanding that, and you really shouldn't stay with her. She deserves you having a girlfriend who will love her just as much as you do.",
            "[deleted]",
            "You’re a bad ass man. Doesn’t sound like your girlfriend is mature enough to handle this relationship. I would just tell her in no uncertain terms that your little sister isn’t going anywhere.",
            "No, you definitely have this all figured out. You are a stand up guy, your sister is lucky to have you and any woman should see what you are doing as evidence that you are a good, responsible human being. Tell her this and show her the door.",
            "My siblings are very important to me. One of the things that made me fall in love with my now husband is how good he was with my much younger brothers. \nI admire how involved you are in your little sister's life. I'm worried about your girlfriend's behavior. Maybe she's just not ready for a mature relationship that involves caring for other people.",
            "As soon as she insinuated that there was something inappropriate in the relationship with your kid sister, she should have been out the door. Im sure she realized early on in the relationship that you and your sister share a close bond and if she had any hesitation or couldnt handle it she had a choice not to progress further. Her thinking she can make you choose is ridiculous.",
            "honestly, I would dump your girlfriends ass.",
            "I have three younger siblings. We share the same mom. The youngest is a 1 year old boy and Im a 24 year old female. My husband knows damn well if anything happened wed be taking care of them. As my mom and step dad are older now. I went home for 6 months when my mom was pregnant this last time because she needed the extra help with my other siblings and getting her to doctors appointments and such. My husband had no problem with it because he understands that family is important to me. I cant imagine being with someone that cant understand how important family ties are. These issues will only get worse as time goes on. Find someone who values that about you. Best of wishes to you.",
            "I wouldn’t say I’m a mum to my half-sister, but I certainly take care of her emotional needs more than our shared father does. My husband knows that we have an open door policy when it comes to her—full stop. She’s my little sister! \n\nIf your girlfriend isn’t on the same page as you, you need to re-evaluate the relationship.",
            "If you are feeling like it is wrong to put your sister first, DONT. Your girlfriend doesnt understand your relationship and I think you need to find someone who does. \n\nI raised my brother and sister and if one of them called me today needing somewhere to stay our house would be open to them. \n\nMy S.O grew up not really close to his sister and is always so surprised that I talk to my family at least every day and are super close. But he understands why it's so important to me and would NEVER get upset over it. \n\n\nThank you so much for being there for your sister. I know first hand how that can take its toll sometimes, especially when you are trying to figure your own life out. If you ever need to talk to someone, I'm here!",
            "Youre a good man, dont let anybody stop you from continuing to be a good man.",
            "Ok so I (24f) love how you are taking care of your baby sister. I think it‘s wonderful that she has a palce in your home, and it‘s a true show of caracter how you step up and take on that almost parental responsibilty. \n\nFor your girlfriend to dissaprove or insist you should spend less time with her, or even insinuate there might be something inappropriate about your relationship to your sister seems kind of messed up. Do you know if your gf has any kind of reason why she would jump to such a conclusion? (And I mean in her past/experiences, not in your behaviour!!) Maybe ask her why she would think such a thing? Try explaining why you spend so much time with your baby sister, and what your motivations are in providing for and taking care of her.\n\nIf that doesnt help, then I personally dont think it‘s worth further pursuing a relationship with your gf because that argument will not just dissolve into thin air, and if you spending time with your sister is such an issue maybe the two of you just have quite different values in life.",
            "You've been with her for six months. She's jealous of a 10-year-old. Don't even try to explain anything to her or convince her. It's time to break up with her.",
            "I have a dear friend who has a half - sister 10 years younger than him and they have a wonderful friendship and relationship to this day. It's wonderful that you're stepping up and considering your family first.",
            "Girlfriend knew about your relationship with your sister from early days of dating you, correct?  Girlfriend does not get to suddenly start pushing your sister out of your life.  If girlfriend has issues with it girlfriend has choices, shut up about it or get out of the relationship with you. While this is your sister it could have been your child from a previous relationship. Consider just how manipulative and selfish girlfriend is being in either scenario.\n\nYou are not responsible for your girlfriends feelings and actions.  That is all on her.  Consider just how damaged your relationship with girlfriend is that you think she will trashtalk your relationship with sister to others.  And start getting paranoid, will girlfriend falsely accuse you of molesting your sister?  How far will girlfriend go with her campaign to eliminate sister from your life?  Will girlfriend go so far as to destroy your life with false allegations and wreck your sisters youth by making you can’t be near her?\n\nIt is not realistic that your girlfriends expects you to change a family dynamic she know was already in place.  She should have considered the consequences of dating you and then moving in with you.  She did not care to do this, or she knew full well that she was going to break your relationship with your sister.  Hold your ground.  Explain the facts to girlfriend calmly once.  If girlfriend continues trying to alienate you from sister then girlfriend needs to turn into ex girlfriend.",
            "Yo ditch this home wrecker.",
            "your girlfriend is super insecure and it's crazy she's acting that way your sister is more important than her if she can't get that through tell her you're through",
            "Yikes. Let this one go. The right woman for you will be amazed and in awe of your generosity and capability for love and commitment to family, they will never ever ask you to change anything about your situation. You're amazing. I know everyone else basically said this, but I just wanted to help cement this for you",
            "Your sister is a child and a main priority, if you changed things with her it could deeply effect her. Your gf obviously has jealousy issues that are way too extreme....seems like a serious red flag, run.",
            "Your sister is a priority in your life if she cant accept that let her go you'll  find someone better",
            "At best she is jealous, at worst she is sexualizing the amazing relationship between you and your sister.\n\nEither way like you said, she is probably your future ex so whatever.\n\nI would suggest being honest with her about why you end it if you do. If this is based on baggage she has hopefully it gives her the push to start dealing with it.",
            "Your girlfriend is acting like the 10 year old here.",
            "If I dated a man who treated his sister like this I would be THRILLED. You are obviously a good human. Kudos to you. Get rid of the girlfriend and find a WOMAN who can love your sister like you do!!!",
            "Her reaction is a total red flag. She’s jealous of your kid sister? Are you kidding me?\n\nSome woman would be glad to have you as a Bf and support you in the role you have in helping raise your sister. I don’t think it’s this person.",
            "Dump that chick. Your sister is way more important than she is.\n\nI would dump any guy without any hesitation if he complaines about my little siblings (age 2-16) being over at my place.",
            "man, thanks for being a good brother to your sister. my older brother was such a big part of my life when i was younger, and he still does his role even when he's far far away. i mean even if she lets go of thing thing against your relationship with your sister.. would you even want someone who isn't all in for you being a good big brother? i've never wished for an end of a relationship.. but imagine when your sister is at an older age and she has to deal with \"older brother's gf that's always mean to me\". ditch that negativity.",
            "Oh my goodness. \n\nShe definitely needs to be told that you're sister is, and always will be, a priority. Show her where the door is if that's going to be a problem..\n\nAlso, you're the best big brother. Shes very lucky to have you💙",
            "I've been the same way with my sister and youngest brother. Same mom, different dads.\n\nHonestly, my wife has loved it. She's been in my life since my siblings were munchkins. It gives them the role model, and you a chance to be closer to your siblings. \n\nDo you, and if she can't accept that you help care for your sister, there's the door...",
            "Yeah your gf is taking it too far. You sound like a really good brother!",
            "She sounds very immature and selfish. I think it’s great you are acting as a father figure in your sister’s life. She needs that. Dump the girlfriend for someone more understanding and maybe a little older?",
            "If it was my boyfriend doing what you're doing, I would count it as a huge tick in the \"pro\" column of why I want to be with him.  I think it's lovely, and from reading your comments you seem like a really good egg.  Just make sure you're getting the support you need too.",
            "You got through 29 1/2 years of your life without her. You can get through the rest without her if she feels this way. Family is number one, always. Especially a 10 year old girl who looks at you as a father figure. Not to sound brash, but this is a no brainer man. I’m sorry to be blunt. It’s just, the audacity...",
            "This is the first of what will be many, many absurd manifestations of her jealousy and insecurity. Get used to it if you’re going to stay with this chick.\n\nYou’re a great guy for stepping up for your little sister. Any normal person would recognize that.",
            "I've been with my husband for 11 years now, and have much younger bros. He has never, ever been jealous or told me I spent too much effort on them.",
            "I agree with comments here. There’s not anything you can compromise on. Your sister is your priority and it shows a great deal about your character how you stepped up like that.\n\nThat being said.... your 25 year old girlfriend isn’t ready for a kid in your relationship. And that’s not her fault either, but this may make you guys incompatible",
            ">Honestly, that's not going to happen. I love that girl, and I'm basically her dad.\n\nWell you already told us what's going to happen, you need to tell your girlfriend that.",
            "how is your relationship weird? she's your baby sister! even if your dad wasn't an absentee parent, it would be completely natural for you to want to take care of her and look out for her. that's what big siblings do.\n\nthere isn't quite as much of a gap between me and my youngest siblings (my youngest brother is twelve years younger than me), but my siblings are my absolute favourite people in the world and I'd do anything for them. I used to help them with their homework, take care of them when they were sick and make up games for them to cheer them up when they were sad or upset. I taught four of my siblings how to drive and used to drive them everywhere before that. they're all adults now but we still have family game nights and go to concerts and the theatre together. they all get along really well with my fiancé; if they didn't, I wouldn't be with him, because I could never be with someone who didn't love the people I love.\n\nyou sound like such a great brother, and when your sister is all grown up she's going to treasure her memories of how loving and kind you've been. a bond like that is for life. the bond with your girlfriend definitely isn't.",
            "you pretty much already said dude. Chill or gtfo. My sister is more important to me than you.",
            "Nothing should change the relationship you have with your sister, is blood after all and if your girl doesn’t like it well looks like she has to be out of your life.",
            "Blood and water. You know the rest.",
            "I'd love to have had a sibling that was stable and caring. All of my family is self centered and when I did stay with my half sister, she would neglect me and my niece. She would use me as a baby sitter to go fuck her dealer, would sleep all day with little food in the house so I had to try to feed us. I'd wake up with strangers at the kitchen table. \n\nShe showed us where he priorities were and as a result, I dgaf what she's up to 15 years later. Also, she's 18 years older than me, so yeah.",
            "Sounds like your gf was triggered.",
            "Kinda something you might want to add to your dating profile as \"dad\" could be a deal breaker. Not everyone wants to be a parent or wants to parent. Although it may be a deal breaker it should be something brought up before yall even seriously date.",
            "OP you’re the man. Move on.",
            "I think she isn’t ready to be a parent and wants you to live the life you should be able to. But due to circumstances your having to parent instead and she’s annoyed with that fact. End it.",
            "DUMP. HER. \n\nI am so happy that your sister has a strong male role model in her life, and your relationship sounds really sweet.",
            "Your girlfriend is threatened by your sister because she can't see another female in your life without it being sexual. Sounds like she has some shit to work through and her own jealousy issues to deal with.",
            "Try to explain to her how youre more of a father figure to her than your own dad.. and play it off like youre considering adopting her. Maybe it can be a real step to that, seeing as your description of your real father isnt very great. If she keeps insinuating weird incest shit, keep your cool. Have a real deep talk with her about how you truly feel about your sister. Clearly you love her as more of a father than a brother. You should try to show your gf that. If she still doesnt understand, and mistreats your sis, maybe its time to drop her.",
            "As much as it sucks, girlfriends, they come and go - love comes and goes like that. \n\n&#x200B;\n\nFAMILY, there's only one family... especially if it's half-blood (sounds like some harry potter shit). Like everyone says, the GF needs to understand the distinction of you being an awesome older brother. Let her go and find a better GF",
            "Stinks of manipulation.  What person would stick around if the relationship between their partner and a child were *actually* weird?\n\nShe's clearly trying to make you feel insecure about your relationship between you and your 10 year old sister because she's jealous. It's not a good sign for any SO to be jealous of a child.",
            "Wow, just no! Dump her. I don’t often recommend dumping but seriously this woman is not an adult. I have a younger sibling and in your shoes I’d do the same. She deserves an adult who cares for her and meets her needs if her father isn’t.",
            "She's projecting her own issues on you imo.",
            "When you choose a life-mate, their family, friends, and baggage comes with it.\n\nIt's not a buffet you get to pick and choose from.",
            "You're wonderful for being such a great big brother who's loyal to family. You've got an amazing heart. \n\nFind someone who appreciates that instead of resents it.",
            "My kids are 18 years apart from different mothers. Their relationship is so special and rewarding for both of them. My son is the older and had me as a single parent. I was young and a type A personality. My daughter has a totally different experience. Being a dad at 40 meant I was in a better place all around. Mentally, financially and mature. \n6 years ago her mom decided that divorce was the right path for her. We (my ex) remained close friends but the damage to our daughter was inevitable. Her brother stepped in and helped her through the pain and confusion. They txt every day and she is close to his daughter. It’s heartwarming to see all of the connections. \nNo relationship is worth getting in the way of siblings being close. I don’t know your girlfriend but I bet she will be a distant memory when you and your sister are parents and grandparents!",
            "Then the GF isn’t the right person for me.\n\n\nMy little sister is 7 years younger but I helped raise her. I decide how to treat her",
            "I’ve got 3 brothers, ages 12, 10 and 8. I’ve helped raise all 3 of them since I was 10 years old, I act more like a mother than an older sister and every person I’ve ever dated has acknowledged it.  Some didn’t like it but I’ve always made it clear they’re a priority to the point that if my brothers don’t like you, might as well go on your way. My husband adores my brothers and sometimes it feels like they love him more than me and I couldn’t be happier about it. When we got engaged he sat me down and told me that if anything should ever happen to my parents he’d like for us to adopt them. All of our plans include the 3 of them. Our apartment is a two bedroom so they can have their space when they come visit, the homes we’re looking at are 4-5 bedrooms so they have their own space and always feel welcome. Your little sister has been a part of your life for much longer than your girlfriend and will be around for much longer.",
            "Your GF's anxiety is going to get worse as time goes by and your sister grows up. \n\nYou need a more understanding GF.",
            "IMO...it sounds like she may be a bit jealous? Great job on you for stepping up and filling those shoes. You dont specifically need to be THE dad in order be A dad. Everyone should have a father figure and if your gf cant handle the fact that you're practically raising your sister and filling those shoes, she needs to move on. My advice would be to address the subject sooner, rather than later. I'd you're already saying \"ex\", make it happen. Just sit her down and explain that your sister takes priority over her. Gf's are replaceable, family is not.",
            "\"You're replaceable, she isn't...\"\nFirst off,  dude,  madd props to you for stepping up for your sister and filling in the role your father unfortunately isn't... It's awesome you're there for her and you don't plan on changing that for your S/O happiness... As for the girlfriend,, she should respect yours and your sisters relationship, especially considering the circumstances... She's pretty much jealous of a 10 year old... And telling you it's weird, and that (sister) is there too much, etc. is way outta line... There's plenty of other MATURE women that would have no problem with the situation and would probably actually be one of the reasons they loved your for...",
            "This one is easy.  You're right, she's wrong. Next!",
            "I think you should decode what she's saying to you. Her language isn't that its weird, or she's jealous, she's literally insinuating that you keep your 10 YO sister around for sexual perversion. I don't understand how you haven't dropped her yet. I could not be in a relationship where my partner thought I would be capable of raping a family member, let alone keeping them around for \"inappropriate reasons\" extendedly. This would chill me to the core.",
            "I feel that this girlfriend is insecure about herself and where she stands with you and is jealous of the relationship you have with your sister. However she is your sister whom you have taken care of because you love her which is awesome btw. So you and your girlfriend need to have serious conversations about your relationship and your feelings and if she can't handle things the way they are then maybe you and the girlfriend should take a break to see if she can become an adult about things if not then maybe another partner would be a better fit for you.\nGOOD LUCK WITH WHATEVER YOU CHOOSE!!! And keep taking care of that little sister of yours, trust me from someone who has been where you are now, she needs you even more than both of you know. You are both in my prayers🙏🙏🙏",
            "I definetly think that you should move on from this relationship so your sister doesnt see this woman as a bad rolemodel/ influence in her life. You are doing a great thing for your sister and you shouldnt let anyone bring you down for that. Kudos to you for beibg such an amazing brother and for being the parent your dad couldnt be.",
            "Yeah dump her. My 9 year old sister refers to my husband as a big dumb guy. He doesn't care, because she's a 9 year old girl and he's almost 30.  Honestly if it came down to my family not being able to care for my sister she would live with my husband and I.",
            "Wipe your hands of her and move on. You sound like a great big brother and are probably a really great boyfriend, she’s weird for thinking anything about that situation is weird.",
            "If you continue this relationship it will negatively effect your sister. You'll end up spending less time with her to avoid fights and your lady will give her dirty looks and make rude comments. This kinda jealousy will go towards others too, I doubt it'll only be the sister. Next it'll be coworkers and friends. Cut the cord now before you get in too deep.",
            "I hate being one of those people who categorically says dump her but if you're gf thinks so little of you that she's jealous of a 10 year old girl then she isn't worth further time and is robbing you of time that could be spent with someone who recognises you and your sisters relationship and tries to create her own relationship with her and better her life because that makes you happy.",
            "Maybe her concern (since you’ve only known each other for 6 months) is whether your relationship with your sister is appropriate. Maybe it’s not a jealousy thing.",
            "... And one day you'll meet a lady who will see your love for your sister as an amazing thing and she'll respect you more for it.",
            "I think for your own good and your little sister you have to break out with her before she gets you in a bigger trouble, and if she can't understand that your sister is your priority now that you only been together for six months then she is never going to get it. Sorry that you are going through this,  good luck",
            "I see in your responses that you're worried about her telling other girls you're being 'creepy' or 'weird', which is super understandable, but I think any gal in her right mind who meets you and sees y'all's situation would be happy they're interested in/dating someone who is loving, caring, and responsible. \n\nI might be biased because I'm very close to my younger brother (and if anything happened to our parents, I'd take care of him in a second as long as I was able to), but you sound like a good dude to me!",
            "This is absolutely insane.\n\nTo be jealous of a literal child, let alone your beloved sister, bespeaks a deeply corrupted mentality on your girlfriend's part. \n\nIf you're going to stay together with this odd-minded woman, then she needs to take 100% responsibility for her own fucked up, misplaced feelings of jealousy, so she can work out why it's happening and fix it herself or in therapy. \n\nIt seems like you love your sister so much that you wouldn't want her to feel unwanted in her own home or like she had to compete for your affection.\n\nImagine if you had a girlfriend who supported your sister and acted in a surrogate familial role to her. That would be the healthy thing to do rather than projecting your own insecurities onto a 10 year old.",
            "Six months isn't that long. While you may like this girlfriend, there is someone out there who WILL love how much you care about family and that person will want to become part of it; instead of trying to separate you from your 10 year old sister.\n\nSecond, your sister is TEN years old? That's a child. If a woman (your girlfriend) feels envious or like they have to compete then she has more issues than she's admitting. I'm not trying to be rude, but you sound like a family type of guy and your gf doesn't. A good partner will make whatever is important to you also important to her.",
            "You are an amazing man that stood up and took over that role of dad/brother. Your girlfriend should feel proud that you love your sister that much and you want to take on the role that your dad has skipped out on. If she cannot find the beauty in this very special brother/ sister relationship, then she doesn’t deserve a relationship with you.  Thank you for being a great brother.",
            "Sounds like she's in an imaginary competition where she's the only one playing. If she thinks your relationship with your sister is a threat, she needs to get out. I can only imagine the passive remarks she can potentially make if you decide to stay with her and your sister grows older. \n\nYou can talk to her about it and establish that both she and your sister are important. Each have their own place in your life and that your relationship wont change. I can understand if sister is on every date you go to, cancelling on your gf to spend more time with sister etc, basically where gf cant spend time without sister there. But that doesnt sound like it (from what you described) It just sounds like she's jealous and petty. \n\nSo you gotta decide of it's something you wanna have multiple conversations about to understand insecurities there and reassure your relationship. Or if it is a deal breaker when your partner tells you to distant yourself from your sister.\n\nEdit: also if your partner doesnt wanna play any aunt/potential mom figure role too. That is something to talk about.",
            "I would think it was fucking adorable how well you take care of your very little sister and I would immediately try to lock you down.",
            "How insecure does one need to be to feel jealous of a 10 year old's relationship with her older sibling?",
            "Ok wait. It'd be different if your sister was an adult who could take care of herself, but a ten year old? Your girlfriend has lost her mind. She needs to know that you are the one that cares for this child and if she can't understand that then the conversation is over. \n\nYou cant make anyone understand anything btw. So either she is going to or she isnt. But be sure to lay it all out for her that what she's telling you is way outta line. Your sister is part of the package. I'm sure there are women out there that would be totally okay with that.",
            "The only thing I can think of is maybe something happened in her past that is making her think weird thoughts.I would ask her if she or someone she know had a bad experience.  Even if she did that doesn’t excuse that behavior but it would be more understandable. If not then I think this behavior is a huge red flag.",
            "Your girlfriend is the one being weird. You can be a big brother that supports your sister without some kind of weird shit going on.",
            "I've got a 9 year old boy, and he was the first topic on dates. I've been in a three year relationship now, with my son always mentioning about us getting married now. The gf is oddly jealous of her, and needs to go. Might be a bit till you find another, but don't rush it. Your sister is family anyway. She would love you even more if you find someone that cared about her too",
            "You're an awesome brother. Get you a girl that recognizes what a huge impact you are in that baby sister's life and how much you value your sibling relationship. A GF should love you because of how stand-up you are with family, not despite of it.",
            "i could understand if your sister was like 1 or 2 years apart from you, super protective and never left you alone to spend time with your gf. BUT your sister is 10..  how can anyone be jealous of a 10 year old?\n\nyour gf wants someone who doesn’t have kids and you have one. kinda. no ones the bad guy.. your gf may not even understand why it sets her off. but she wants you to herself so she needs to find someone that can give her that.",
            "Imagine being jealous of a 10 year old, and as a result she tries to strain your relationship with your sibling and accusses you of being inappropriate with a child.\n\nLet's hope she never has children, because she will be the same if she has a daughter. \n\nGlad you ended things and didn't fall into her trap.",
            "Your girlfriend is immature and needs to get over it or leave. Who is more important to you? I know you can answer that without a second thought.",
            "I would plan an exit speech that sounds really sympathetic towards her feelings, it finally clicked with you that she’s uncomfortable and you hadn’t understood it before, you know the lifestyle isn’t for everyone, blah blah.  Then I’d end it with “I’m sorry.  I feel terrible that I’ve put ___ (sister) through dealing with you.  Take a hike”.",
            "Could your girlfriend be thinking something inappropriate is going on between you and your sister? \n\nThe way she freaked out after seeing underwear is what is making me think it’s something like that.",
            "I'm not gonna bag on your girlfriend because quite frankly she's 25 and still has a lot of growing up to do. She probably didn't expect kids yet and doesn't want to take care of one right now. Honestly it's pretty selfish on her part not to take into consideration how much you care for your sister and want to be there for her.\n\nSix months isn't long enough to even try to be persuasive, I would just be up front, either stick around and be a part of this or move on.",
            "I feel like your girlfriend is probably having trouble with something mentally for her to act that way.\n\nProps to you for stepping up and caring for your sister though.\n\nAs for the girlfriend, if she can't understand your relationship with your sister or doesn't even try to. It's not worth it.",
            "Honestly, lose her now. If, god forbid, your dad took off and you took legal custody of her, then what? Plus, I'm sure your sister can tell she isn't wanted around. My brother is 13 years younger than me and he's a huge part of my life and thankfully, my husband treats him like his own brother (he has younger brothers the same age and I treat them like mine, nerf wars and all). Is she really someone you want long term around your sister?",
            "You are a very thoughtful and caring man.   You understand the void a child feels when their family is \"dysfunctional\" or lacking a solid foundation.   \n\nYou clearly love your little sister and you want her to have a happier childhood than you did - that is very worthwhile and very commendable.\n\nIf your current partner is jealous or insecure then that is on her not you.   It is up to you if you want to save the relationship but you must be very clear that you see your little sister as a top priority and nothing she says will ever change that.",
            "\"The only thing that's inappropriate around here is your inability to accept that my flesh and blood is a priority.\"",
            "You’re a good brother.",
            "So your girlfriend is insinuating that you are a pedophile?",
            "A text, \"We are done, don't contact me again,\" is all you need here. Seriously this woman is out of her damned mind, but I'm worried she'd accuse you of something if you try to get into it with her so just end it. \"We are over\" is a complete sentence.\n\nJust to point out a lot of people seem to think they need to have a sound argument for ending things and really no you don't. Not wanting to continue a relationship is reason enough and it's not a court of law where you will get into trouble if your reason wasn't \"good enough\" according to an ex.\n\nSo straight up, just end it. It's only six months, not like you've all been married six or sixteen years. Just walk away now and do not engage.",
            "You sound like an awesome big bro. So you know you gotta do what you have to do. In this case it might be better to just sever ties and put out a psa letting people you know that know her that anything weird she says regard your relationship with your sister is untrue..",
            "Sounds like you should explain to her that your sister will always be in your life and if she cant accept that, throw the whole girlfriend away. Seriously, I have a you her brother I'm close with and I wouldn't tolerate my significant other tryi g to deter our bond.",
            "You'll get over losing your girlfriend. You won't get over losing your sister(and then later probably your girlfriend). And if you choose your gf over your sister, your sister will loose all respect and trust in you. Which is more important?",
            "Your sister is ten years old and a grown woman is threatened by her. Cause that's what this is she's threatened. \n\nThis is not healthy for your sister. You love her and are probably one of few stable people in her life (correct me if I'm wrong) don't let a woman drive anwedge between you two and ruin your relationship. How long is it going to be before she starts taking this hostility out on your young innocent sister?\n\nTell her that's your sister and you love her and she needs to get over her shit or get to packing.",
            "You are an amazing brother .. your little sister is so blessed.. You don’t need the negativity that your girlfriend brings around you and your little sister.. your gf is sick to think anything about your realtionship is inappropriate obviously she isn’t very mature and she could end up destroying your peace of mind or worse become toxic to your sister ..It’s probably time to move on .. your sister is at a very vulnerable age she needs to know she is loved and supportive and not in your way and I know your gf has the potential of planting that seed in your sister’s mind .. get rid of the gf asap .. there is an amazing person out there that will love you and help you nuture your little sister I promise ...",
            "Your girlfriend is afraid you are a pedophile. That’s what’s happening here. I agree with everyone else that you need to stand by your sister, but it may also be worth getting to the bottom of your gfs irrational behavior. Because it is irrational to think that it’s suspicious for a brother and sister to spend time alone. It’s so irrational that I worry that she or someone she loves was abused as a child. Why does she mistake healthy familial relationships for inappropriate sexual relationships? Why doesn’t she trust that an adult man might sincerely want to care for his sister? I would give her a chance to answer these questions.",
            "Woah. Ditch this chick. Your sister is 10. She is jealous of a 10 year old.",
            "Your sister should be a a big part of your life and no girl should disrespect that good for you. Keep your sister safe",
            "Please don't ignore the giant red flag waving right in front of your face.",
            "Her problem. Not yours.",
            "Think the wisest and best decision for all involved here is for you to explain to you gf that in no uncertain terms will you be made to feel uncomfortable for being a good, kind and loving brother to your little sister and that your gf needs help is she can make a close brother-sister relationship seem inappropriate and ugly.  And if gf can’t accept that then she’ll have to see herself out. If you do continue the relationship I’d not leave your gf alone with your sister because I can’t imagine what she’d say/do to your sister.",
            "That you’re caring and responsible toward this kid should be seen as a plus. At least, it would be to anyone with a modicum of logic",
            "You, sir, are a great brother!",
            "You and your sister and you are 20 years apart in age, so it's realistic to see her as a daughter to you. Think of it like this: If she was your daughter, would your girlfriend's attitude be any different? If not, then she isn't the one for you. Regardless of her wanting children of your own, you have one in your life that will be here whether your gf is or isn't.  \n\n\nYou mentioned that your father is a flighty person, and that is your sister. Any person who is jealous of your family and tries to separate you from them isn't healthy to be around.",
            "I don't understand some women. Seeing my bf be so great with kids makes me love him that much more. Can't wait to have a family with him. your gf sounds like she doesn't like nor want kids.",
            "Your girlfriend is a horrible person. Horrible",
            "wtf....get rid of the gf, she sounds awful.  Way to be an awesome brother OP!",
            "I would break up with someone who insinuated something like that, tbh",
            "[deleted]",
            "That’s a major red flag. She’s showing jealousy towards a 10 year old child.",
            "Just end it and don’t look back. She’s telling you what to do 6 months in? Yeah, no.",
            "Throw out the whole gf and start over.",
            "Assuming she's not usually irrational and jealous...did something inappropriate or abusive maybe happen to your girlfriend when she was that age?",
            "There's gotta be a balance. She has to be able to accept that your sister is a big part of your life, and that she's going to have to partially take on a \"mom\" role with her if she's serious about dating you.\n\nBut you also have to accept that her want for her own life with you is totally valid, and if she feels like there isn't room for her in your relationship with your sister, that's something you're going to have to learn to balance",
            "Send her to the curb. There is hundreds of thousands of women that would think you're amazing for what you're doing.",
            "A huge red flag, whatever you do, don't listen to her, first it's your sister, then your friends, then it's literally everyone you will ever spend time with other than her.\n\nShe should be supporting you and helping you instead of trying to take you away from your sister.",
            "Seems like you know what the answer is. A good woman without insecurity issues will have no problem with you taking care if your sister, considering the situation. You're a good brother.",
            "This is so bizarre...a grown woman being jealous of a 10 year old girl...younger sister of her boyfriend no less. That's insecurity on a whole another level damn.",
            "You and your gf are not compatible. \n\nYou definitely have an unorthodox relationship with your sister, but that’s what happens when there’s a massive age gap between siblings and the parents aren’t as involved as they should be. There’s *nothing* wrong or creepy or inappropriate about this; you are being a responsible adult for someone you love and care for deeply. It’s better that you step up (because you have the means to) than casting your sister into the void that is foster care. You’re a very kind person for looking out for her like that. :)\n\nI think your gf isn’t happy about having to share your time and energy. It’s understandable. It’s okay for her to be unhappy, but it’s not okay for her to yell at you like that and accuse you of having an inappropriate relationship with your sister. She is an adult, so she should talk to you like one and express that she feels unhappy/not prioritized, uncomfortable, etc. \n\nShe also has to understand that you are *essentially a single dad*. I don’t think she is compatible with someone who has kids/has to take care of siblings. \n\nImo she should date someone who doesn’t have kids. \n\nIf you want to make this work, tell her that she needs to communicate with you like an adult and understand that your sis IS and WILL BE a priority. She’s only a child, so you want to be there for her.",
            "I was with her until I saw the ages. I had assumed she was close to your age.\n\nYour sister is a child! It’s perfectly normal to parent a young sibling who needs it. Your girlfriend is in the wrong here.",
            "100% in agreement with what others are saying: family before fancy.\n\n\nBut, and I say this having been through  it myself, I would not be at all surprised if your gf has some specific trauma in her background, possibly even from around the age your sister is. Doesn't make her right in the least, but that could be what's causing the disproportionate reaction.",
            "She feels threatened by your 10yo sister. Think about that, then dump your GF because her mentality is just fucked."
        ]
    },
    {
        "post_id": "uw5mvv",
        "author": "florarae",
        "title": "My husband is reluctant to be intimate with me after I was in a major accident",
        "url": "https://www.reddit.com/r/relationships/comments/uw5mvv/my_husband_is_reluctant_to_be_intimate_with_me/",
        "score": 7541,
        "num_comments": 314,
        "created_utc": 1653327244.0,
        "selftext": "I (30f) have been married to my husband (45m) for 5 years and together for 8. Obviously we have an age gap in our relationship and whenever we discussed possible health issues or medical care, it was regarding him. \n\nAbout four months ago, I was in a car accident. I was talking on Bluetooth to my husband because I was nervous driving on the icy roads going to our house, when another car rounded a corner too fast and lost control. It was one of those “exact wrong moment” things and my car went off the road and into a tree. My husband heard the whole thing and my last memory before I lost consciousness was him screaming my name. \n\nI don’t want to get into the bloody details, but I ended up being in the hospital for over a month. I needed multiple surgeries and have been in physical therapy ever since. I am finally getting to a point where I feel like myself again and am no longer in pain. I’ve gained back some weight and look good if I do say so myself. \n\nMy husband literally worked out of my hospital room for the entire time I was there. He went home to shower, sleep and look after the dogs, then came right back. He attended all my therapy appointments so he would know how to better help me recover at home. He was amazing and everything I could ask him to be in that kind of horrible situation. I love him so much and so yesterday while shopping, I saw this gorgeous black lingerie set and decided to surprise him. We haven’t had sex since before the accident and every time I try, it feels like he makes an excuse or expresses some concern about some random body part of mine that is no longer injured. \n\nHe was on his laptop in bed when I came in wearing my new purchases and I could tell he was taken by surprise. I basically crawled into his lap and started kissing his neck and grinding on him. He was definitely hard but then he lost it and pushed me away, saying that we shouldn’t rush this and he doesn’t want to jeopardize my recovery with sex. I was crying by the time he ended the sentence and said “I’m fine! The doctors say sex is fine!” But he was already walking into the bathroom and turning on the shower. \n\nI don’t know what to think. Is it the scars? Is the memory of me in a hospital bed unable to even sit up by myself repelling him? I finally am starting to feel good about myself and my body again and the fact that he won’t touch me is really hurting my mental health. It’s probably a long shot but has anyone else experienced this?\n\nTL;DR: I was in a major car accident and I’m finally back to myself but my husband doesn’t want to have sex with me.\n\nUpdate: \n\nThank you again for everyone’s kind and thoughtful comments, I read all of them even if I didn’t respond. Last night when we got in bed I curled up next to my husband and held him while I said basically “we’ve been through a lot, would you be willing to get therapy with me to make sure everything is alright for both of us? I love you so much and I don’t want any underlying trauma to effect our relationship.”\n\nHe was silent for about ten second and then the floodgates opened. I’ve only seen him cry once or twice in our entire relationship (at our wedding and the first time I told him I loved him), but I held him while he sobbed for what was probably an hour. He kept apologizing for it and I had to keep saying “don’t be sorry, I’m here, cry if you need to cry.” And I shed some tears of my own. \n\nIt was an exhausting but ultimately extremely cathartic experience. When it was all over and he was able to say more than a few words, he told me that there was about 15 minutes when he was sure he had just heard the love of his life die, then we got to the hospital and the doctors made it clear they would do everything they could but the extent of my injuries were extreme and severe. Then he spent hours calling family members, waiting, pacing and trying to grapple with the fact that I might die and he might be alone. Then I spent five days in the ICU, mostly unconscious. He said he’s never known fear like that in his life. \n\nIn the end we agreed to go to individual and couple’s therapy and even touched on the sex thing, wherein he admitted that he knows objectively nothing bad will happen to me if we have sex but for some reason it is sparking this protective instinct that makes him want to treat me like glass. \n\nSo we’re working on it, and our marriage is amazing. He’s the love of my life and we can get through this.",
        "permalink": "/r/relationships/comments/uw5mvv/my_husband_is_reluctant_to_be_intimate_with_me/",
        "comments": [
            "Your husband literally worked out of your hospital room and only went home to shower and keep the dogs alive. Your husband loves you and this is crystal clear. Like someone else has said, I don't think it's him feeling unattracted to you, or scars, etc. I think he is seeing your body now as a very fragile thing that he almost lost. He could very well possibly be traumatized from hearing the car accident in the phone call and seeing you in a hospital bed for weeks. I don't often suggest couples therapy, but I think it would behove him to help work this out with you in a setting like that. You're very precious to him and while it isn't rational thinking, he could be terrified of damaging you in some way.",
            "So...I'm not a mind reader, but his reaction makes a lot of sense to me when I think about the last 4 months from his perspective.  \n\nHe heard you scream, and then *nothing* from you.  Presumably he heard the crushing metal of the crash.  For him...there was a period of time when he did not know if you were dead.  Maybe he had to direct first responders to try to find you, and had to learn whether you were alive from them.  The fact that you were in the hospital for *more than a month* says to me that he was almost certainly told you might die even once he learned you were alive.  The fact that he lived in your hospital room was probably as much for him as for you--because if he wasn't there, and something happened, you might die and he wouldn't be able to stop it.  It's very possible he spent that entire month in crushing fear, trying to consciously or subconsciously *guard you* from death.  He almost certainly spent at least several days in that state.\n\nI'm assuming that the focus since then has been mostly on getting you physically okay.  It's only been four months, and he's probably spent them all in caretaker mode.  The thing about caretaker mode is that you push your own issues to the back.  You don't focus on any healing you might need to do.  (Note that I'm not justifying that, necessarily.  Sometimes people go into caretaker mode or stay in it not because somebody actually needs care, but because our own fear is too scary to face and that mode keeps us from \"having\" to deal with it in the short term). For him...the trauma of being unsure if he would still have you tomorrow is still almost certainly unhealed.\n\nAs for why he responded that way...people tend to store emotional pain they're not addressing yet in the body.  Tight muscles, strained postures, clenching...people grind their teeth and bunch of their fists under stress for a reason, and we do similar things to the rest of our body.  That kind of trauma can feel like a physical spring, stored under tension.  When you went to initiate intimacy and started *touching* his body in a way that normally creates a strong reaction, you added those feelings on top of the stored feelings, but pulling in a different direction...and the spring destabilized and went off.  You basically accidentally took the lid off a pressure cooker before it had a chance to vent.  I think that's why his response was centered around fear for your safety, even though you're feeling much better and not worried yourself.  All that trapped fear just kinda blew up in both your faces.\n\nIf that's what happened, it's not necessarily anything in your relationship that needs to heal...it's just that he needs to step back now and take the time to face that shit down.  I'd strongly recommend therapy to help him process.  I also, on a personal level, find that crying tends to let some of that tension back out.  I tend to use a Pixar movie to get the tears going--it sounds a little silly, but it helps some.",
            "I don't think he doesn't find you attractive anymore. I don't think it's the scars. I think he's just shook to the core by the whole thing and scared of hurting you. \n\nTalk to him about it. Tell him you'd understand if the trauma of the accident makes it hard for him to get in the mood.\n\nI'd just give him a bit of time to recenter. Tell him it might help him to talk to a therapist.",
            "Thank you everyone for your kind comments. I think I realized that just because I physically feel better, it doesn’t mean our lives can magically go back to normal. Which was basically what I was trying to do. \n\nWe both went thorough a major trauma and pretending it didn’t happen will only be damaging to both of us. I can’t say how much I love this man, he is my whole world and the thought that he has been hurting but trying to protect me from it by staying silent makes me feel sick. \n\nThe bottom line is we both need to go to therapy to unpack everything that happened and develop some healthy coping mechanisms. \n\nAnother part of this was we were trying for a baby before the accident and I was excited to get back to it.\n\nMuch love to everyone who commented",
            "I like all the counseling suggestions and agree it’s warranted. You’ve both been so much! But in the meantime, please don’t take his refusal as the rejection it must have felt like. He’s dealing with how he almost lost you when that age gap had previously protected him from having to do that. Mortality and reality and everything he probably thought was sorted out came unraveled. \n\nYou both sound like lovely people and I’m so glad you’re doing so well.",
            "The only person who can tell you with any certainty what is going on in his mind is: him.\n\nCounseling or therapy, either for him as an individual, or for you as a couple (or preferably both) is the necessary next step here.\n\nYou *both* have been through a trauma.  His was purely mental and emotional, whereas yours was physical as well.  But traumas change the way people look at the world, look at their lives...even how they look at their *partners*.\n\nHe at the very least needs counseling or therapy to help him process what he has been through, and *because* what he has been through is affecting the connection that the two of you have, you need counseling or therapy as a couple to learn the new landscape of communication that exists between you now.\n\nAnd none of what I am saying is meant to minimize what *you* have been going through; you've been through just as much as or more than he has, but you are (clearly) dealing with it in a different way.  It's possible that individual therapy or counseling would be of benefit to you as well, but that's less likely to address the specific situation you are asking about in your post.",
            "This is a multi faceted problem.\n\nYou know your physical state and are ready to go. He doesn't.\n\nHe heard the women he loves have a horrific accident. The whole thing played out like a nightmare. The last thing you heard was him screaming your name, but you have no idea what he heard after you were unconscious.\n\nHe heard that and could do nothing\n\nHe saw you broken in the hospital and could do nothing.\n\nHe saw you in pain going through physical therapy and could do nothing.\n\nHe was in crisis mode living with you in the hospital and could do nothing.\n\nYou get where his head is at? So to have you come in the bedroom in lingerie raring to go is a bit of a leap. He has to wrap his head around that. I will guarantee you he is still in crisis mode. You couldn't drive a straight pin up his ass with a five pound hammer.\n\nThis is not meant in any way to assign any blame on you. Like I said, you know how you feel and he doesn't. So you're going to have to employ that communication thing and gently express how you feel and what you want. And a little outside assistance from a good therapist certainly couldn't hurt.",
            "First of all, I'm so sorry you went through that. Second of all, when you end up as a caretaker, sometimes your sexual desire dwindles because you do this thing where your brain shuts off its own wants or desires and hyperfocuses on the other person because it's easier to control than dealing with your own emotional state. \n\nFor your husband, to accept that you're fine means he needs to address his own emotional state, which after a major event like that is likely something he's put on hold while you recovered. You have a very good husband, but it sounds like he's fallen into the trap that many of us who have become care takers have which is to neglect onesself. Which means he still has to process through everything that happened. So while you may have healed, he paused himself so that you could take up the bandwidth of the relationship. He did the right thing, but now that you're improving he needs to be shown that he can be vulnerable. \n\nI would start with just intimacy. He's probably been in crisis mode for a long time so that means his adrenal receptors are all worn out. Focus on contact that doesn't involve sex, but builds intimacy like holding eachother on the couch while watching a movie, etc. Sometimes couples don't recover from disasters because they don't do the \"aftercare\" necessary to really deal with the trauma that happens to both partners. While yes, of course, you went through the worst of it... he also almost lost you which likely shook him to his core. And it's something that needs to be addressed. \n\nI would also recommend therapy to help you both develop the communication skills to talk about what happened and how to process through it.",
            "[deleted]",
            "I bet that he is dealing with a bit of PTSD, dealing with the news that a loved one has been in a life-threatening accident is terrifying, but he had to helplessly listen in on the accident as it happened. I bet he hasn’t processed this completely and it could definitely be interrupting his ability to be sexually intimate.",
            "I also lost my wife during the birth of our child.  I was scared to death to even breathe on her for six months.  I would lay awake all night and just listen to her breathe.  I believe that it effected me more then did her.  I still cry when I think about that night more then 19 years ago.",
            "The two of you need to get to trauma counseling immediately.\n\nIt took my husband months to feel okay with sex after I almost died. He was also severely traumatized by what happened and he was afraid to try anything because of it.",
            "37 year old dating a 22 year old...",
            "The time for just trying to start having sex is over, you need to sit down and have a conversation with him--what is going on in his head? If he's been with you at these appointments, I assume he's heard the doctors say sex is fine? Why doesn't he believe that after hearing a doctor say it? Tell him you are feeling so much better and are so excited about having your body back and that you want to have sex and have that part of your relationship back and see what he says. I think it's very unlikely that something about your body post-accident is actually turning him off.  \n\n\nUltimately I agree with the others that the most likely explanation is that this has been super traumatic for him as well and you guys will need to go to therapy, but you might as well talk to him about it first.",
            "Does the hospital have a support group?\n\nHaving helped family through long recoveries, there are many normal issues he could be dealing with.  Does he have a therapIst?  He is also recovering from trauma as the spouse of a survivor.",
            "This is not a surprising reaction for your husband. This accident I'm sure was quite traumatizing for BOTH of you. Your husband has (rightfully) put forth so much time and energy towards your healing, and likely has had no time or guidance to process the accident or any of HIS feelings about it. \n\nYour husband would benefit massively from counseling. Virtually everyone who undergoes a traumatic event (even if the actual event doesn't occur TO them, just witnessing it is enough) would benefit from therapy/counseling. Unfortunately, far too many people can't or won't access it. \n\nCouples counseling could absolutely be super beneficial too, but if one needs to be prioritized (due to expense, logistics, availability, etc.), I'd go for your husband getting individual therapy too. \n\nIf your husband is uncomfortable with \"regular\" talk therapy, or generally against it or whatever, perhaps he would be more open to something like EMDR, which is known to be particularly helpful for PTSD, or a specific trauma. It doesn't involve talking through an event (I mean usually the practitioner would need to have some idea of what the event was, but usually not too much in details). Another option that can be effective, although I think its less \"official\" than EMDR or talk therapy, is breathwork. Breathwork for trauma therapy usually has to do with the idea that when a person experiences a traumatic event, the body holds some stress and may not let it go. Then the stress essentially continues to \"live\" in the body until it is released in some way. But again, it doesn't involve much of any talking about the experience. \n\nIf your husband was open to all options, my unprofessional opinion would be EMDR for him, and couples counseling for the two of you.\n\nBest of luck to both you and your husband on your healing journey. Remember that healing takes a long time and is not linear, so you both need patience and grace for yourselves and each other.",
            "The poor guy is definitely traumatized. In those last few moments on the phone, he thought that he was hearing you die. That would mess up anyone. He probably has PTSD from this. You should both attend therapy *together*. \n\nHe's probably also terrified at the thought of potentially injuring you during sex somehow.",
            "When your husband goes through almost loosing you, it does things mentally to them that we do not understand. I had a hysterectomy go wrong in 2012. The last thing I said to my family before my lifesaving surgery was things like “do you know our bank info, do you know where the life insurance is” things like that right before I passed out. My husband walked the hospital grounds millions of times the month I was in the hospital. He learned how to unhook my g-tube to help me go to the bathroom. He held my hand night I was on to much pain meds I was hallucinating. All of these things and the horror they caused him, he held in as to not upset me. He watched the love of his life almost die and it messed him up for a long time. We made it through it and you will too. Get you guys some therapy and talk to each other. It’s a very hard thing to process.",
            "Might i suggest therapy. I suspect he may have PTSD and using ur injuries is just an excuse. Sounds like u guys have a great relationship otherwise. Im so glad how well you are doing now.",
            "I suspect that he's scared of hurting you. It's hard when you see someone you love broken. Your instinct is to make thier life's easier. He probably needs counciling himself.",
            "it seems like you keep trying to initiate sex and he keeps turning you down - directly or indirectly. have you tried just talking to him? not when you initiate or want to initiate sex. not while anything else is going on. just sitting, preferably out of bed, and talking. start out by saying you want to discuss the physical part of your relationship. don't tell him how he feels (\"it seems like you don't want to have sex with me\"). be open about your own feelings (\"i would like to be physical with you again\"). give him space to talk to you about his reservations.\n\nas others suggest, this might take a counselor, but you need to start talking",
            "Talk to him about it don’t try to guess how he is feeling or thinking at one point he said he wasn’t ready ask him about this you both need to heal from this and only open communication will bring you both to an understanding about what you think and feel, have you ever gotten into a conversation and discovered how you feel or what you think when before you where perplexed? Just keep communicating and things will sort themselves out",
            "What a wonderful update. You both are extremely lucky to have each other, and it’s a real gift that you are able to communicate this well. ❤️\n\nPlease be patient with yourselves and each other as you work through things. Even when you can perfectly describe the feelings, where they’re coming from, and how you wish you’d feel instead, the emotional experience can often take a lot longer to heal/change. Compassion is key, and that starts with both of you being compassionate with yourselves. Look op R.A.I.N. – recognize, accept, investigate, nurture – for a great model to process feelings like the ones your husband is experiencing.",
            "I was really touched by the story of how your husband cared for you during your recovery. Clearly you have a very loving relationship.\n\nWhat strikes me most about the events you described is that you waited until you were ready for sex again and then SURPRISED your husband with this information.  That doesn't seem quite fair, does it?  Maybe examine your expectations on male sexuality: do you expect a man to be ready -- physically and/or emotionally -- for sex at all times?  For many if not most men, that is not the case.  \n\nI suggest going to your husband, expressing gratitude that he was so understanding during your recuperation, saying that you're really looking forward to bringing sex back into your relationship, and asking him how and when he'd like to do it.  Is there an especially good time or way?\n\nThen just please be a little patient with him on this.  My guess is that the amount of time he will need to acclimate will be hours or days, not weeks or months.  If it takes much longer than that, couples therapy is something to consider.\n\nGood luck, and congratulations again on your strong relationship.",
            "You guys absolutely need couple's counseling because I couldn't imagine going back to \"normal\" after helplessly listening to your loved one endure a fatal car crash. Just the thought of it alone makes me want to tear up. You might be done with physical therapy but there's clearly a need for emotional therapy.",
            "You’ve gotten really good advice (for the most part) so far. I don’t think it has anything to do with your appearance, or that he doesn’t find you attractive or that he’s “taken on the carer role and can’t see you romantically” or whatever. He clearly loves you or he wouldn’t have been so present during your recovery and he wouldn’t be clingy now. \n\nSometimes it’s easy to forget the emotional recovery is just as important as physical recovery. If someone breaks a shoulder, you don’t just put it in a cast and then cut it off in a few months and expect to be back exactly where you were before it was broken. The same concept applies to emotional and mental recovery. You guys went through a trauma; it’s both physical and mental. \n\nAnother way to think about it could be this: it sounds like you are grateful that he was there for you and helped you through the physical recovery from the accident. Maybe this could be your way of expressing that, by helping him through the emotional recovery.",
            "No I’m not crying at 7am, you are!",
            "This sounds like you and he need marriage counseling to get to the source of this. Best of luck to you in both this and your recovery.",
            "He likely has PTSD. You both would benefit from therapy to address the trauma.",
            "He was extremely clear about what it was.   \n\n“He doesn’t want to jeopardize my recovery with sex”.  \n\nUntil he feel sure he won’t he’s not going to be comfortable fucking you.",
            "So I injured myself badly a while back. Not to the extent you were injured but I lost use of an arm and had to go to PT with some nerve complications etc. My wife was terrified I'd really not be able to have sex for a while.\n\nLong story short after reassuring her it's fine and I'll be fine things went smoothly. He's probably just got it in his head you're wounded and need to be cared after and can't separate that from the reality that you're doing better now. A very direct conversation needs to be had about this and if he starts to make excuses then maybe something further like couples counseling. He should spend time understanding what's making him act this way.",
            "My thought. This trauma happened to you. And also. It was traumatic for him. So maybe the key here is to find a way to process what happened. Are either of you or both of you in therapy? It might help a lot.",
            "His reluctance maybe due to him blaming himself for the accident and the trauma of witnessing  his beloved in grave danger and him being helpless to help. Therapy would be the option here for both of you.",
            "You guys need couples therapy. He very clearly loves you, but I'm sure he has experienced trauma from your accident as well.",
            "My wife was in a car accident a month ago. Not as bad as yours, but she had to go to the ER. Lots of bruises all over her body. We just had sex for the first time, a month after the accident. My mind was not in a sexual place for that first month. I didnt even ask her for sex like I usually do. Maybe it was the stress, maybe I was scared for no real reason. I took on her portion of the house duties for the month, maybe its the switch some others are saying. Caregiver to sexual partner again. I hope it gets better for you.",
            "There’s a possibility he or both might need some sort of therapy to deal with the trauma of the accident. Possible survivors guilt or something? I think it’s a psychological issue and not a love or attractiveness issue. He might also feel you’re not ready physically, perhaps talk to your doctor together and he can reassure him that you can start returning to normal life",
            ">  He was definitely hard but then he lost it and pushed me away, saying that we shouldn’t rush this and he doesn’t want to jeopardize my recovery with sex.\n\nThis is the issue. He's afraid of hurting you.\n\nYou need to properly address this concern before you try anything else.",
            "He's probably feeling a lot of complicated emotions right now. Why not try being cuddling/intimate before jumping back to sex?",
            "He needs therapy. He sounds like he's bottled up his feelings about the accident and he needs to process them, which isn't your job. You're just feeling the effects of him *not processing* them.",
            "you just need to talk to him instead of spur-of-the-moment initiating. while you feel physically healed enough to have sex, he clearly mentally doesn't and that's okay. he could very well have PTSD from the situation, especially considering he heard the crash over the phone. have an open conversation about how you feel, and give him the space to be honest about how he feels too. you'll likely also benefit from counselling, both individual and couples. considering how hands on he's been in your recovery, he clearly loves you dearly. remember that, and give him some time and support.",
            "I'm glad you're doing better OP",
            "Sounds like you need individual and couples therapy. Hearing a partner scream in a near fatal event must have been extremely traumatic for him and he must be still hurting and anxious about everything. You may be ready for intimacy but he is not.",
            "I would say it's most likely he's afraid of hurting you.  That's not entirely rational if the doctors say it's fine, but it's hard to be rational after your wife just got out of the hospital in an accident like that.  Just take it slow and work your way back there.",
            "My husband was in an awful car accident and hospitalized for a month with extensive therapy needing to learn how to walk again. I was there for everything stayed by his side every day/night. I had to be strong for him to help him get better but any time I was alone I decompressed and I cried my eyes out. I know the accident was hard for you but I’m sure it was hard on him in an emotional way that takes some time. The reality of almost losing the most precious thing in your life and nursing them back to health is a lot on one’s heart. Just give him some time and one day it will feel like this was a lifetime ago. He definitely loves you.",
            "Omg, this actually made me tear up for you guys. There is a lot of love here, and you guys will absolutely get through this! Wishing you both the best of luck!",
            "This man loves you. I don’t think this is about the scars. What you guys have is genuine, so don’t panic. I think that he’s traumatised by what he heard.",
            "That’s the kind of love you see in movies. I’m glad you recovered!",
            "I read this after the update, so the whole thing...\n\nThis was enormous emotional trauma for him. So glad you two finally talked about it, got it out in the open, and are getting help. I think you're going to be fine. It sounds like you have an enviable relationship.",
            "Holy shit this is so flipping sweet",
            "Let's not forget, your husband was on the phone with you when this happened. He heard you, any screaming, the sounds of the accident and was completely unable to help.\n\nThen he has had to watch you recover from this, being unable to move, surgeries, therapy and the lot.\n\nHe probably still has a lot of healing to do as well. And I understand you not wanting to go to therapy, but maybe he can go by himself? He clearly has a lot he needs to recover from.\n\nEdit to add: I'm not downplaying what you went through or any trauma you have from this, I was solely focusing on your husband here",
            "I almost died from Covid and all of last year my husband was my caregiver. Sex was off the table for him and I was really ill the whole time but when I started healing I wanted to snuggle and mess around but he was not in the mood. It really hurt and it caused me to think he did not love me anymore. We ended up in couple therapy and it all came out, he could not turn off the switch of caregiver to spouse and he said all he could think of when he looked at me was me almost dying and it made him sick to his stomach because it scared him, he did not know how he was going to live without me and raise our son. He was so scared that If he touched me something bad would happen. Then he broke down and cried, he was holding much inside and I only saw my sickness and pain. We have worked on our issues and our marriage is stronger but it took time and a lot of healing and talking to each other. You have to work in the emotional before you can go on to the physical",
            "Your husband is traumatized. He needs help too.",
            "We don't know what's going on with him. You need to talk to him about it. Since emotions are already high, it might be a good idea to open discussions with a sex-positive couples counselor. (And yeah, you need to search specifically for a sex-positive therapist to find someone who'll be sex-positive).",
            "Please seek counseling for your dear hubby. He obviously loves you, basically living at the hospital with you proves that. But as others have said he probably was traumatized by listening to the accident then being helpless as you took on your recovery. \n\nTry not to be hurt, it’s obviously the last thing he wants to do is hurt you.",
            "With how attentive he was when you were in the hospital I don't think you need to worry about him losing interest. I think he's probably still mentally recovering helping you through it. I would suggest counseling for both of you. He's probably scared to hurt you since you went through so much.",
            "Probably the event was traumatic to him too, and it may take time to get things back the way they were, just talk to him, look for help in therapy as needed.",
            "I think this has mentally messed him up as you could’ve died and he hears the whole thing so I do understand why he is really scared as in his mind he can still see you in that hospital bed that would put a toll on anyones mental health and I just think even thou you are healed and not longer in pain he is still in his recovery stage and is worried he will hurt you! I reckon it’s best you just sit down and try talk with him",
            "Now that you've gone through therapy, I feel like it's his turn. \n\nHe heard that terrible accident and he's probably hesitant over triggering something for you and himself. It's nothing against you, but he probably has some internalized guilt over the accident itself. \n\nMaybe he feels like he could've prevented it, and maybe this is his way of avoidance because he doesn't want to think about it while unintentionally hurting you emotionally in the process.",
            "He had wood but lost it, likely because his lust was weaker than his concern. He started thinking too much. It sounds like he's attracted but scared. I see that as a sign of love. You might need to have a long talk and give him time to process it before trying again, but you should try again.",
            "Try talking it out with him and see where his head is ( if you haven’t already). Sit down and be open and accept his concerns & address then piece by piece. He may be worried about re-injury. You may have to start slow and build up his level of comfort because if he is worried about hurting you, it would crush him if he did. The things slow, talk it out. Also talk about his emotions and how he’s feeling post accident because yes you can very well have trauma from the accident but he may as well. Hopefully ask works out. Sounds like he loves you deeply and is considerate of your well being & may not be able to determine if you’re actually ready for intimacy or just in the mood.",
            "No, I never experienced the terrible thing you both have gone thru.\n\nI'm a man, married over 42 yr's.\nSo I can tell first & foremost,, your man loves you. If you have any doubt,  throw it out, and rest assured. \n\nWhy he's acting the way he is, I honestly have no clue. Could be the fear of hurting you. It could be some other innermost mind games. \n\nBut I think the most important thing is  for you openly talk to him. For sure, something not right. But your mind is wandering to worrisome thoughts. You never address if you \"talked\" to him you said you argued. Sorry.\n\nYou could go to theory,  and I'm sure something will be gained.\n\nBy the most important thing is that you talk. And he may not be ready for it, you obviously are. B\n\nWhen you talk to him, please Don't use \"you\" statement's,  try always to deflect back on to yourself , the way your feeling. That will eventually him to open up about his feeling.\n\nBe careful, he's going to be super vulnerable at this point. It won't take much to shut him down.\n\nTheir is no doubt about the love in your relationship. That isn't the problem,  you both suffered trauma. Your's physical,  maybe his mental?\nGive him a kiss, tell you love him, and find a time SOON, when your both relaxed,  and start the conversation.  Remember the \"I statement's\".\n\nI hope I didn't over due it. \n\nGood luck",
            "You almost died. Your body was pushed to the brink and broken. He is scared of hurting you.",
            "im so touched by the update! good for you guys, opening up and talking through things :’))",
            "This thread and your update made me cry. You have a beautiful marriage, OP.",
            "He sounds like an amazing guy",
            "It could be a little bit of “absence makes the heart grow fonder” could help. \n\nWhen you watch your parents age it can be hard to accept that they are aging. They’re still that column of strength in your mind.\n\nWhen your kids grow up they still seem like your little kids.\n\nYour husband had to adjust to you no longer being the sexually intimate partner, but rather the patient. He still loves you obviously, but you took on a new role in his live and he’s probably struggling to see his patient as his sexual partner again.  \n\nMaybe if you took a few days to visit your parents and then healthy you can back, then it might help him see you back in your old role as partner.\n\nOr maybe a short vacation to a local resort to officially mark the transformation from no longer being a patient.",
            "Your husband was in the accident just as much as you were. He needs to seek therapy. \n\nIt's not a lack of attraction, it's trauma. Has he had time to process the event? Has he been able to express the fear he must have felt that you nearly died? \n\nYou should both go to couples therapy sooner rather than later",
            "Hes traumatized and needs time to heal, he cares for you deeply",
            "Men are not machines. Just give him time, he’s still traumatized for your experience, maybe he fears you could have something broken and he doesn’t want to rush.",
            "I can’t imagine what you or your husband have been through but from reading your post, he adores you. All that went through my head is that he is treating you like you are glass, he was so close to losing you in his mind from the moment on the call to seeing you wake up he was in a living nightmare. He had a moment of realising life without you so I would assume he doesn’t want anything to harm you and in his mind right now you are still glass and he can’t have you break at any cost. \nHead up your recovery is going well, your mental state is quite optimistic for being through something so traumatic so give yourselves some time. \nFrom an internet stranger to another it is so beautiful to read about two people who adore each other. \n\nFrom a woman to another it’s literally soul destroying to dress up in lingerie and be turned down for whatever reason, so I feel you but take this one on the chin. You said you’re looking well keep that confidence.",
            "First off, it is wonderful that you are doing so much better. That had to be terrible. To go from a month long stay to doing pretty good in such a relatively short time is so great to hear. I work in a hospital, I see the difficulty in that.\n\nLike others mentioned, he definitely needs someone like a counselor to talk through things with, and a couples counselor would also help you guys communicate some more about this. \n\nHe clearly has trauma. Probably both from the accident and fear of losing you, and likely also some caregiver trauma. Especially considering it was so unexpected considering it was you and at your age.\n\nI seriously doubt he finds the scars or your body offputting. If anything, seeing scars or such might just be hard as a reminder of what happened. While I'm sure the struggle you've had getting better has made it seem like such a long time, it's been such a short amount of time in truth. It hasn't even been half a year. It takes time to process, and he likely hasn't done so while in caregiver mode, as he was focused on other things.\n\nAlso, going from caregiver mode and switching to partner/lover mode is difficult. Caregiver mode is often so removed from sexual feelings, although it can be just as intimate in a different way especially with a SO. Switching back can be hard to do. Heck, even parents can find it difficult to flip back to partner mode after being in parent mode all day, let alone caring for your partner themselves. It can also be hard to let go of. There's a feeling of control over the situation when caring for someone and letting that go means you have to deal with your own issues again.\n\nHe obviously cares so much for you. Women are disportionately left when in life-threatening health scares, but he showed how honorable he is and how much he can step up. Now he needs to focus a bit on some self-care. And that involves dealing with his feelings.\n\nYou need to sit down with him, in a very non-sexual situation, and communicate. Bring up your feelings. Listen when he talks. Don't just get defensive about feeling better. Really listen to his worries. Suggest/insist on counseling if you guys need. Remember, this has been a short time compared to all the time you've been together and compared to all the time you'll hopefully have together. There's no need to rush this, for either of you. Work this out as a team.",
            "Your husband basically saw you nearly dying. He's stroke to the core. I don't think he doesn't find you attractive anymore. It happens quite frequently in couples when someone nearly dies. Give him time, and I'm pretty sure you'll go back together in a very good intimate life. It's crystal clear that your husband loves you.",
            "This is a beautiful story and I pray both of you continue to turn toward one another as you heal. You will be stronger and more attuned to one another than ever before for the rest of your lives if you do. I am so glad you are doing well. I hope he finds healing for the trauma of the experience.",
            "First thing he is attracted you. Your injuries and scars are not it. He is experiencing  trauma too. He may need to go to therapy, too. You both should. You may be physically able but tell me do you ever get nervous driving? Feel fear? He might still live those fears. If I were him I’d be afraid to hurt you regardless of what your doctor says so. He literally saw you go through so much.  If you get pregnant and your not healed enough? Or differ complications…. Counseling. Obviously he loves you and care for you. But it is not the same as before the accident.",
            "He clearly loves you very much.  You're fortunate, be grateful for that.    \n\n\nHe's probably just still shook up by the accident, and genuinely concerned with hurting you.  (And still freaked out from almost losing you.)  It's only been a few months since you've been home, be patient with him.  He'll come back around.    \n\n\nIf he's still not affectionate after a few more months, I would propose counseling to help him work through his issues.",
            "Maybe dwell on it again after a lil more recovery time.",
            "[removed]",
            "You need to have a long honest talk with your husband. He needs to know how he’s making you feel and that he’s hurting you. He also needs to know you understand what he’s been through. I think couple’s counseling would be helpful. It will give you both a safe place to express and work through your feelings and trauma.",
            "this marriage doesn’t sound amazing to ms",
            "I'm so happy you are felling good but don't forget that the whole expirence was probably worse for him than for you. Watching someone you love being in pain is horrible. The thought of what happened to you is terrifying to me. I cannot imagine what it was like for him. I wish you the best and I'm sure everything will be fine. Maybe you guys should talk to someone.",
            "[removed]",
            "Sounds like he is truly scared of hurting you. Maybe just express that you are feeling these desires. It might work out better if he goes down on you and eats you out to completion. He's in caretaker mode and you can just lie there and be safe and still have an orgasm. Maybe start from there and work up to full sex/PIV/grinding. 🥰",
            "Therapy is probably the answer here, but one thing that is very clear. Your husband deeply loves you. Just give him time to work through this trauma, hopefully with a therapist. You've gotten through it quicker than him, you should be proud of yourself for that. But this clearly left some emotional scars on him. Sex is likely the last thing on his mind right now, not sex with you, sex at all.",
            "Your husband isn't a robot that can just cater to your every need and have zero emotions or feelings about the ordeal you have just been through. You have made this entire thing about yourself. Yeah, you're fine. But is he? In all that text, I haven't read one thing about you doing a single thing for him, not even asking him if he's okay. He was going through his own personal hell of being so worried sick for you and sacrificing all his needs and feelings for you but because you bought some lingerie, you think that is going to automatically make him just forget every single traumatic emotion he had and have sex with you like nothing bad happened?\n\nThe fact you're so confused about why he could be feeling the way he feels tells me you probably think of him more as a provider than a human being. I think you need to work on yourself and re evaluate what kind of a relationship you want before you even start to think about how your husband is feeling or how to get your rocks off.",
            "It could be none of this. He is 45. He was hard and it went away that fast? Could be his testosterone or something physically going on with him. Men never want to fess up and tell the truth or go the doctor.",
            "[deleted]",
            "Am looking for a Nurse to get married",
            "**(not what I think) So you were 22yrs old and he was 37yrs old when you started dating? Reddit has taught me that he must be immature,can’t get women his own and your relationship is creepy. \nThere are age gaps that aren’t inherently bad Reddit.  could Reddit be wrong sometimes about age gaps?! Lol \n\nHe sounds wonderful, but afraid of something happening and you losing all your progress. I recommend therapy as well.",
            "Talk to your husband and go in with an open mind!",
            "Couples a day individual counseling.  There are a lot of therapy workbooks you could do together and individually too if you want.  \n\nHe obviously loves you very much and I'm sure you two will overcome this.",
            "Vicarious trauma is a real thing and it's possible your husband is suffering from it. Watching the person you love go through a serious medical event is traumatic, let alone him hearing the accident happen and be powerless in the situation. Has he gone to therapy before? A licensed therapist can help people work through this kind of trauma in a safe, judgement free environment. He might feel that it would be  burdensome to talk about it and process things with you. Give him time and space, let him know you are there if he wants to talk and if he doesn't want to talk with you offer your support for him going to therapy.",
            "Your husband was on the phone with you when you had your accident?\n\nDo you think he might blame himself for your accident? Like “if she wasn’t on the phone with me then maybe that car wouldn’t have hit her” or “if I drove her instead / didn’t let her drive then she would have never gotten hurt”\n\nMen do that. People do that. It’s an easy reason why they may be upset with themselves and not you",
            "I don't think this is about your appearance or him being attracted to you at all. He heard his wife being in a car accident and then stayed with her in the hospital for weeks. That has to be traumatizing for him and, even though you're healed physically, it sounds like he's not healed mentally and emotionally from that. In a past relationship, my partner had some serious trauma occur, and afterwards I found it extremely difficult to be intimate afterwards. I still loved them and cared for them, but my concern for their wellbeing afterwards made thinking about them in a sexual light basically impossible. You need to take it slow with him, not just rush into it. He took care of your physical needs in the aftermath, now you need to take care of him while he heals emotionally.",
            "In healthcare, I have met a lot of people with PTSD after watching a loved one go through a traumatic event, especially hospitalization.  I'm not saying that's 100% the case, but it would help to find someone to do individual and couple's counseling.",
            "You’ve both been through a major trauma, and we all react differently to trauma. I doubt he’s not attracted to you any more; I think he’s haunted. Trauma informed therapy would probably be a good idea. Good luck, OP. It sounds like you’ve got a good guy and I bet you’ll make it through together.",
            "Sounds like he's traumatized by the accident.",
            "He might have PTSD from the whole experience. Especially hearing what had happened over the phone. He might just need some time to process what happened. Talk to him about it in a safe non judgmental way and try to figure it out. He might need therapy. Maybe you do too.",
            "My wife and son where hit by a car while we were on bikes right in front of me.  I was in caretaker mode for weeks and even when she went out of the way and got the doctors \"permission\" I still couldn't engage happily until the majority of the bruising was gone and she hadn't been having concussion symptoms for a couple weeks.  The bruising wasn't a \"turn off\" per-say, it was just a reminder that things could have been much, much worse right in front of my eyes, and the wrong move could cause unintended pain.\n\nPretend your a teenager again and slowly progress until you get what you want, talk about it frequently in \"fun\" terms, and failing all that, the all too famous, get thee to therapy option.",
            "I would maybe suggest therapy.",
            "Maybe he was thrown Off by you coming in so quick and he didn’t know how or if he should have sex. Maybe talk with him and ask him if he’s like to try again at a certain time so he’s aware that you’re planning on his reciprocal involvement. Take it slow sounds like he’s scared",
            "He may have Post Traumatic Stress Disorder. It’s treatable. He may be reluctant to talk in detail about his feelings with you for fear of hurting you.  He may have experienced a degree of horror that his mind could not bear and so pushed the memories down. So now when anything comes close to stimulating or triggering that memory he shuts down to avoid re experiencing the horror.  Suggest he speak to a trauma informed counselor. Also be patient, PTSD takes time.",
            "It’s nothing to do with you physically. Imagine the toll mentally it took on him hearing you go through it live and shifting his entire life to make sure you are okay not really knowing if you will be. He has trauma from the incident and now he’s so afraid that he probably doesn’t know how to get out of the panic mode because he doesn’t ever want to see you remotely near any situation where you can get hurt, truth or not. He probably doesn’t know how to shift back. I think he will need to see a therapist over this.",
            "I think you should give him time. You both have been through a very major life changing event and he needs time to process. Do fun and flirty things with each other, take it slow. Sex can wait.",
            "Sounds like he was traumatized and doesn't want you getting hurt again. Show him you are healthy.  Let him see you going for a jog, or working out.  I think that would start to put his fear of you getting injured at ease.",
            "Your man's might need therapy because he still traumatized babes",
            "It’s possible that he doesn’t want to potentially hurt you, more, again, etc somehow during sex and create a setback in recovery. Both of you have been thru a lot and it seems like he is still processing and hasn’t had a chance to “decompress” on his own terms now that your back home. Therapy/counseling for a short time may help get over this speed bump. I’m a physical therapist and have heard this as an issue a few times. Good luck and glad you’re well on your way to recovery and it seems like all the therapy is helping!",
            "It will take some time. But I assure you he is just worried. He saw you in a state of near death. It scared him. He needs more time to process. Try cuddling first. Take it back to the days when you first started seeing each other. Flirt like you're a teen, make the inappropriate joke. He still needs you. Never forget that. He just loves you so much he's afraid.",
            "well it seems he gotten use to the fact that there wasnt sex for awhile so thats the very last thing he is worried about he wont be comfortable until he can see your fully recovered you have to remmeber he turned that part of himself off because you were hurt now to turn that back on will take sometime just do it slowly offer him a blowjob start small then go bigger try something different  and tell him that you are ready whenever he is",
            "I don't think it has anything to do with how attractive he finds you, he is clearly over the moon for you and is wanting to be there for you every step of the way. You were in the accident and faced the trama that it caused you bodily but you don't remember it, he might not have been there but he was on the phone the whole time and is most likely incredibly tramatized and in high alert for your safety. \n\nMy grandma was the 911 operater when my grandpa had his major accident that nearly killed him, she sent first resonders to her home thinking maybe someone else was hurt bc it would be the first time someone has shown up needing help since they were both volunteer firefighters at the time and my grandma an emt and got learn that it was my grandpa. While she handnt been on the phone with him but an operator who was on the phone with him (he knew 0 would get him someone but nothing else at the time), she was tramatized by it for a long time and on high alert for many maaaany months after in regards to his safety and recovery.",
            "I've been there....I don't remember how it was with my boyfriend, but I know my Mother went straight back to the same Mom she was when I was her little girl. I was 19 and she had to bathe me again...go with me for MRIs, all of the PT, learning to walk again....if a Medivac would fly over anywhere we were, she would go start hysterically crying. \n\nShe talks about driving me home from the hospital after 9 days, \"You had Pearl Jam as loud as it would go, that neck brace on, head stapled together, pumping your fist, singing \"hey, I ohhhhhh, I'm still alive \" Everybody passed us, staring at you. I didn't care, I was just glad you were still alive.\"\n\nIt's a lot harder on them than it is on us. I don't remember any of it. And I don't remember how long it took for my mom to see me as her adult daughter again, but we got back there. He's probably in a weird place.",
            "He needs therapy. You said he was talking to you as the accident happened - there’s a very good chance he’s perseverating on the thought of “If I wasn’t talking to her she’d never have been hurt”.\n\nAlso you both need couples therapy - there’s a lot of complex emotions being processed that have probably never been felt with both of you. You guys need a therapist to navigate those emotions *together* in a healthy way. Human psychology is, a lot of times, your brain finding the quickest route to a solution that involves the least effort and least discomfort. Without guidance it would be extremely easy to develop maladaptive coping mechanisms that aren’t healthy to the relationship.",
            "I had this happen. I voluntarily went into a mental hospital and there were some treatment issues and I wanted to leave because they were making it worse. This indicated to the hospital that I should be there and they made me involuntary and moved me to the area they keep criminals and such. Shitty hospital.\n\nAnyway, I went in because I had drug induced mania. So on my way out, my depression and anxiety were horrific. I couldn’t let him out of my sight because my brain though he would die if he was.\n\nDuring this time I was pretty much emotionally helpless and he took care of me.\n\nAfter it was all over and I was on correct meds, sex felt weird. We avoided it for a long while. We both agreed that it was probably because he was put in a care taker role and I was completely dependent. Like he’s a care giver, not a lover.\n\nAnyway, I highly suggest talking about it openly. It really is the only way to get to the root of the problem.",
            "If your husband is terrified of injuring you at the moment, you could ease into intimacy. Maybe avoid p/v penetrative intercourse right now. Oral or giving each other \"hand\" attention could be the ice breaker. You both experience intimacy and \"relief\", and can cuddle afterward. I seriously doubt this has anything to do about any scars or less than 100 percent mobility on your part. Maybe you can ease into the penetrative relations by being on top. My wife even suggests you have a \"safe word\" if you start to feel any discomfort or pain. You need to sit down and communicate with your husband about your readiness and NEED for intimacy...which is also part of reclaiming your physical life back. Don't do this in the bedroom at midnight wearing nothing but a smile...he may go back on the defensive. This conversation would probably go better in private/not public after a good supper cuddled up on the couch watching a random tv show that basically is on for background noise.\n\nHonestly, I think he is still terrified and stuck in \"caregiver\" mode. This man absolutely loves you, and he showed his dedication while you were at the hospital and getting your rehab. You miss the intimacy, and that is understandable. You experienced physical and emotional trauma...your husband still experienced emotional trauma because he feels like he almost lost you and heard everything during the accident he couldn't protect you from. You both could use some individual and couples therapy.",
            "My wife had a horrific accident 4 months ago and we just barely became intimate again.  It's still extremely rough for both of us.  She desperately wants it to be normal again, but I'm terrified of causing her physical pain during the act.  Our first couple attempts resulted in her crying out in physical pain.  Please don't rush it and take it slow with your husband.  The mental trauma of seeing your wife hurting is strong.  Forgive the antiquated gender roles, but I believe most of us men would strongly prefer the physical trauma happen to us than our wives.",
            "I feel that if that had happened to me, would want some time to ensure you are not in pain or whatsoever (as women never say what they think, or choose to avoid it for the time being), and gain some power after so much effort put from your husband. For sure, you want it and he wants it. But, he may be really tired and wants some hugs. Begin with hugs for a while and don't give up. You are both young.",
            "My wife was in a car accident and spent several years recovering.\n\nIt's how I learned Partner PTSD was a thing, the mere mention of a few trigger words and my heart starts pounding and my hands shake.\n\n\nI love my wife more than I back ever properly express, and I still desire her just as much now as on our first date.\nBut the memories of seeing her stuck in that pit of pain, confusion, and despair, and watching her recover, slowly... She's a fucking baller, but I can't see her suffer again, ever. \n\nWe have sex but not nearly as often as before the accident, I can't help but remember what happened and how close I came to losing her. Not great for setting a romantic scene, I assure you! \n\nHe loves you and quite likely wants you, but he's afraid.\n\nStill sucks, I hope you two can figure it out",
            "I’m really sorry you’re feeling rejected! I’d just try communicating with him about the situation. Let him know how his reaction made you feel",
            "Maybe see a therapist or go on a vacation to completely change things up",
            "Couples therapy. Also try to discuss it away from bed. I have a life changing injury i cant recover from, and I had to be very specific with my partner that I will say stop straight away if something hurts during sex. He was nervous for a while. Perhaps start with masturbation next to each other, then hands and oral for a while. Build up to piv. Best of luck",
            "Honestly, you both need to get counseling and/or therapy. This obviously affected both of you greatly and you need to seek help.",
            "Speak to him. And please get therapy for both of you. I guarantee he is traumatised by what happened. That doesn’t go away.",
            "I think I might have perspective on this. I broke my arm earlier this year. Hubs went into caretaker mode, much like your husband did. He went way above and beyond what I needed, but he needed to take care of me. \n\nHe started talking about me dying, or rather, he doesn't know if he can handle another wife dying. (His first wife died after a three year battle with cancer) He would not be intimate with me, even if I thought it was okay. He kept saying no, or just holding me. \n\nTo top it off, I have long covid. I have my symptoms managed, but if I slip up, I'm sick for days. \n\nIn his head, I was fragile. Very fragile. We had to have a very deep conversation about my physical and mental state before he was able to grasp that I'm not going to die. Still though, he's taking things slowly. There are a lot of hugs and holding, but not much more. \n\nIf you haven't had any actual conversations, and let him talk about his feelings, please do that. Not just one, several. Your incident traumatized him. He needs to heal now too.",
            "This is one of those things that will probably only be solved with tons of communication (outside of sexual expectations), and a comprension on your part that, despite you having been the one in the accident, he also suffered a lot of emotional pain, that needs to be eased sufficiently before getting back into a sexual state of mind.",
            "It's not quite the same, but my mom was in an induced coma for months, on the precipice of death, especially the first couple of months. She has a lot of continuing medical issues, but doesn't remember much of anything while in that state. \n\nI've spoken to her about the way she looked, and things that happened while she was under, that medical practitioners did. \n\nFor me they are vivid, traumatic memories.  For her, stories, that are distant, like hearing about it happening to someone else. \n\nYour husband is certainly traumatized. He may also have some guilt about being on the phone with you. Playing in his mind that you may have reacted quicker, or better to the situation if not focused on the conversation.  Maybe even for you being out on the road in the first place. \n\nWithout talking about it, and getting counseling for the trauma, this will be ongoing, most likely get worse. \n\nGlad you're doing so much better.",
            "hes clearly loves you alot just give more time he doesnt want hurt you",
            "My question is, if he's worried that your body is too fragile for penetrative sex, then why not just touch you and get you off in other ways? Is there any intimacy between you too? Intimacy can be expressed in various ways. I'm not surprised you're worried about his behavior.",
            "I was in a car accident once and spent about a year recovering. Once I was recovered enough for sex I wanted it, but my husband was very afraid of hurting me. I had him talk to my doctor directly to ask questions and once he was satisfied he wouldn’t break me he went to town. \n\nIf he hasn’t spoken to your doctor yet, I’d start there. If he has and still seems to have a mental block then therapy for sure. Just remember that it is 100% clear your husband loves and cherishes you. Whatever is going on has nothing to do with him being repelled or anything like that.",
            "You wonderful, incredible woman! \n\nHe is terrified, he doesn’t live inside your body or understand how great you’re feeling.\n\nLike all of your rehab treatments, communication here goes a long long way. \n\nSurprising him at this point is another shock to his system, start small - work your way toward sex. Your body and you need that as well. Be safe, be gentle, be super intimate and talk through every single thing that you’re about to do and talk talk talk\n\nYou both need to learn how to be intimate together again - you got this, it’s going to be so sweet and caring and beautiful when it does happen",
            "The day of the accident you were physically injured, but he was traumatized. He needs psychological attention. Support him as he was for you all this time. He may put the blame on him for distracting you on the phone. There's nothing more harmful in life than blaming yourself for the incident of a partner.",
            "My ex delivered our baby. While it was a magical experience, it was traumatic for him because I didn’t do well and the delivery was crazy too. He had a hard time being close to me for a long time. I can only imagine the trauma your husband had. \nMaybe just try closeness that’s non sexual for a while and see if he can be intimate . Totally agree with therapy, bless his heart for having that conversation with you. Proud of you for taking steps!",
            "Reading this made me almost cry in class. :( he clearly loves you so much.",
            "I just saw this post and your update made me cry!\nGod bless your love and what you two have! It's amazing. ♥️♥️",
            "This has similar vibes to getting intimate again after your first child. Your husband isn't alone in what he's going through at all.",
            "Reading your story made me cry, I’m so glad you guys are going to be doing couples therapy. He really loves you, I wish you two the best of luck and a long healthy life together❤️",
            "I know a friend who went through a similar thing. The wife had to take care of the husband for a long time and afterwards the attraction was gone. They stayed together for their children for like 10 years then divorced when the kids were adults. \n\nI think couples therapy is the move if this continues much longer. \n\nI don’t think anyone has done anything wrong.",
            "I can see people have already suggested this and your edited post says it too, but therapy and counselling should be considered.\nThere could be some trauma or feelings he doesn’t know how to express, or doesn’t know he has, since the accident\n\nAll the best",
            "i know the nature of most of this post is not positive, and i can't even imagine what you both went through, but i just wanted to say this was the one of the most beautiful things i've read in a long time ❤️",
            "Read the update and am so happy for you. As I was reading the initial post I was thinking how this must have been incredibly traumatic for him as well. I can’t imagine that feeling of helplessness. Couples therapy sounds great for you two, but it might also be worth him seeking out his own individual therapy for a while. It might be helpful for both of you, and enhance the couples therapy process, if he has another neutral space to profess his feelings. \n\nSo glad that you are okay and that you are finding a way to move through this! Sounds like there’s just SO much love between the two of you and I’m here for it",
            "Your update made me cry I am so glad you’re both getting help and working through this as a team 😭❤️",
            "I first met Annette Adkins during study hall in 1955—and was immediately smitten. \"I couldn’t take my eyes off her,\" Harvey told the New York Times. \"She had auburn hair and a stunningly beautiful face and her eyes were just, wow.\" The two teens ended up going to prom together, but as many young relationships go, they lost touch after high school and married other people. Harvey never forgot about Adkins, though. In 2017, after his wife died, he searched for Adkins on Google and discovered she had also become widowed. He sent her a card with his phone number and after chatting for a bit, Harvey drove 500 miles to visit her, stopping only for gas and a bouquet of carnations. \"I handed her the flowers, and then I cupped her face in my hand and said, 'Whether you like it or not, I’m going to kiss you,'\" he recalled. In October, the high school sweethearts married at a '50s-style diner and danced to Johnny Mathis—just like they did at prom 63 years earlier.",
            "Maybe he has PTSD and the thought of getting physical with you triggers his PTSD symptoms.      You both would benefit from individual therapy.",
            "Girl he almost lost you, you are precious to him even more now. It’s hard to [redacted] someone so precious to you in their [redacted]s [redacted]-[_______redacted_________]",
            "I really hope things get better for you and your husband, I doubt there is any ill intent with his caution, just make sure to have a sit down and honest conversation about it, hug him, tell him not to worry and I’m sure you will get through this together as a stronger couple",
            "Damn this made me cry, that’s real love and hard enduring on both of you! It’s scary but I’m glad your both well your love for each other sounds impenetrable 😭❤️",
            "This was absolutely beautiful. \n\n\nI was sitting here, feeling absolutely horrible and hating the world. Partially because of pregnancy heartburn. Partially because of the terrible news that is everywhere. \n\nThen I read this. \n\n❤️",
            "Why did you make a new account to post this tho ?",
            "I get this.  My wife had major surgery and it was very traumatic to me (lost my first wife) and have had a hard time with intimacy.  In your case, he is clearly suffering from PTSD on top of it all.  Time and patience OP, time and patience (and a good therapist).\n\nGood luck to you.",
            "I don't necessarily have advice, but I just want to say I am impressed with your husband's dedication to supporting you in your recovery and your ability to communicate with and support each other. While the trauma directly happened to you, it indirectly happened to him, so both of you being in therapy separately and together makes a lot of sense. And if he's as devoted to you as he sounds, this could end up bringing you even closer together and better understanding each other.",
            "I’m not married and haven’t been to an accident thank god, but I felt this so deep in my heart and I tear up on this. I’m in a relationship and I love being with my boyfriend. Im not sure if im in love with him or what but I do know that it feels right being with him, and I hope that one day our relationship can develop as beautifully as your have. God bless your relationship always.",
            "This is such a great update. So glad that the OP and her husband can communicate and work through this",
            "Omg this made me cry! I’m glad you’re working on your relationship.",
            "I’m rooting for you.  It sounds like he just need to know you’ll be okay. But I believe in you.  Just wanted you to know that someone is rooting for you both. Lots of love.",
            "Man… I don’t cry often but this one got to me. It’s obvious you love each other deeply. If it were me I’d do anything to keep you.",
            " Glad your husband communicated to you what was going on with himself and that there is a path forward with therapy for each of you. Communication is the key"
        ]
    },
    {
        "post_id": "3g5394",
        "author": "throwaway546566",
        "title": "Update: I [30 F] am sitting in the back of my RV as my husband [32 M] rants about how lovely the trip would be if I hadn't joined him.",
        "url": "https://www.reddit.com/r/relationships/comments/3g5394/update_i_30_f_am_sitting_in_the_back_of_my_rv_as/",
        "score": 7453,
        "num_comments": 602,
        "created_utc": 1438962646.0,
        "selftext": "[My first post is here.](https://www.reddit.com/r/relationships/comments/3ecgbv/i_30_f_am_sitting_in_the_back_of_my_rv_as_my/) The TLDR of the first post is that I bought an RV with my money so I could write/travel in it while husband is away for business. Husband insisted on taking the RV with him without me, I convinced him to let me come. Now he is ranting about how he doesn't want me on the trip while I sit in the back of the RV hating my life.\n\nI promised I would update, but things got very hectic and this is the first chance I have gotten. This whole situation makes me very emotional, so please forgive me if this post is not as coherent as I would like it to be.\n\nWhen I posted my first post, we were on the road in the RV and my husband was giving me the cold shoulder while he bitched at me from the driver's seat. You all had some great advice for me about what I should do, and I listened to a few people who suggested that he might be cheating on me.\n\nTim had left his iPad in the back of the RV to charge while he drove. I'm not proud of this, but I was able to sneak his iPad into the bedroom while he was distracted by the road. He was logged into his email account and I quickly skimmed over his inbox but didn't find anything suspicious. I then had the idea to check his sent folder and found out that he had been chatting up his ex from college. It made me sick to my stomach to read the messages, but luckily they had not yet been physical. Translated from chatspeak, the message he had sent his ex was basically: \"I can't wait to get my hands on you! It's been years since I felt that mouth. I'm excited!\" \n\nI was disgusted, but I tried to keep calm. We were on the road headed to another state and we planned on stopping at his mother's house. I knew that if his messages were in the sent folder, that meant that he had deleted them. Tim was not planning on being caught and was trying to hide his tracks. He wanted my RV so that he could take his ex around the state and have fun without leaving a credit card trace. I took photos of the emails and sent them to myself in order to preserve the evidence. I then went back to the front of the RV and acted as if everything was fine. I apologized (don't worry, I lied) for how I had acted and suggested that we ask his mom to help us work through this. Tim said that he was sorry and that he accepted my apology. He said he was looking forward to using the RV in the future and that he was glad I had come to see reason. I smiled and nodded but on the inside I was cursing his existence.\n\nWe made it to his mom's house and I made up an excuse about having to change because my clothes were wrinkled. Tim went inside without me and I started throwing all of his clothes and belongings into a trashbag. I then went inside the house and Tim was sitting with his mom in the kitchen. He asked me what I was doing with the bag and I told him that I was giving him his clothes so that I could leave. Tim then got angry and asked me what the fuck was I doing and his mom was simply confused. She asked me what was going on and I told her, \"I'm not sure myself. I'm waiting for Tim to explain why he was planning to cheat on me with his ex.\"\n\nTim's mom then started to cry and yell at Tim while he tried to calm her down. I know Reddit does not have a lot of love for religion, but Tim's mother is a fundamentalist. She had loved me from the minute Tim introduced me to her and it would be an understatement to say that she was very upset with her adulterous son. Tim never tried to apologize to me, instead he chased after his mother saying he was sorry to her. This made her cry harder, because she knew that he wasn't even trying to make amends with me, he was just apologizing to her. She hugged me and told me to just go home and she would handle her son. I thanked her and took the RV keys from Tim (this ended up being a minor wrestling match) and left. I drove home crying, but at least I got rid of my asshole ex-husband.\n\nTim called me the next day and begged me to come back to him. He said it was all a mistake, that he was sorry. I asked him why he didn't apologize at his mother's house, why he didn't say he was sorry when I was handing him his bag. I told him that he didn't care about cheating on me, that all he cared about was how bad it made him look to his family. He tried to explain himself, but I cut him off and hung up. I blocked him on all social media and haven't heard anything since. \n\nI have gotten a lawyer and have already started the divorce process. \n   \n**tl;dr**: Husband thought he could get away with cheating on me by using my RV. I found his emails, packed his bags, and left him at his mom's house. His mom took my side and has ripped into him since. I got a lawyer and have filed for divorce.",
        "permalink": "/r/relationships/comments/3g5394/update_i_30_f_am_sitting_in_the_back_of_my_rv_as/",
        "comments": [
            "Wow, complex feelings on this one.  There's the \"Ouch, that's awful!\" but also an overwhelming \"BUT THANK GOD she's getting the fuck away from that asshole!\"\n\nI was concerned that you might stay with him for another year or two until the marriage gave its last gasp.  This is surely painful, but cleaner. And you haven't ever got to think about the other woman being in your(!) RV.",
            "Ouch.\n\nSilver lining in this, is now you have the RV to yourself and can find a better partner in the future.\n\nI'm also glad his Mother took your side, and was upset with him for cheating. You should definitely keep her in your life after the divorce.",
            "When I read your first story I thought \"He wants it so he won't leave a credit card trail\" I guess I was right. What a sorry fuck he is.\n\nI'm sorry it turned out this way but I'm glad you kicked him out and talked to a lawyer. Fuck him.",
            "The fucking NERVE of your ex; to not only plan to cheat on you, but to try to do it in YOUR RV. That you paid for! Jesus fuck what an asshole. \n\nOn the plus side- you seem like an awesome and strong person. I hope you find someone equally awesome to make happy memories in the RV with.",
            "Ufff, da!\n\nSorry that happened to you.\n\nI hope you can get through the divorce without it wrecking you.  If I can offer any advice in that regard, just try to focus on the life you want to lead in the future and how the step you take today lead you to that.  \n\nGood luck.",
            "You were too good for him anyway. Even his own mother knew it. Thanks for updating, I was really curious as to how your story turned out. I'm glad you can move on to better things (and people).",
            "> She asked me what was going on and I told her, \"I'm not sure myself. I'm waiting for Tim to explain why he was planning to cheat on me with his ex.\"\n\nGod you're fucking cool.  Do you realize how fucking sweet that sounds?  Congratulations on losing the 150lb+ of asshole weighing you down and good luck in the future :)",
            "> He said it was all a mistake, that he was sorry.\n\nHe was sorry he got caught. This guy is a massive shitdick. ",
            "You should write about this is your next book - imagine the look on his face when it's a best seller and he has to see it EVERYWHERE",
            "Just curious if the pre-nup has an infidelity clause?",
            "Please, doormats of Reddit read this",
            "It sucks, but at least you now have a sweet RV. We should all come on a massive road trip. You can fit 350,000 in your RV right?",
            "OP you are fucking awesome. You handled that situation like a complete boss. So many people on here say things like \"but I just don't know if I can end things\" but you just handled that shit in probably the best way possible. Best of luck to you, you can obviously do much better than Tim.  ",
            "You are one tough broad. You handled that amazingly!",
            "Good job.  Enjoy the RV.",
            "I thought he was just being an asshole but damn!  He was being an ultra asshole!  Sorry you had to go through all that.  Get yourself a good lawyer!",
            "I am so fucking proud of you",
            "You are bad ass.",
            "You are a smart and classy woman--you're life is going to be amazing without that loser dragging you down!",
            " this is one of the best stories ever.  Not only did he get caught, he never even got the chance to actually do anything physical.   He thought he was being by deleting emails, and borrowing an RV so there would be no paper trail.  \n\nSimply because it his piss poor attitude, and some amateur psychologists he got Found out.  Too good, op, too good.",
            "I cannot imagine a more satisfying conclusion. What a dick",
            "I'm amazed at how you held it together to out him and kick him to the curb at his mom's house. I think I would've dissolved into hysterical crying and ranting immediately upon finding those messages. You're strong, OP. ",
            "I am sorry for what you're going through, and I know telling you that you're better off without him doesn't make it any easier, but you really are. He was selfish and entitled and disrespectful, etc. I would poke him in the eye for you if I could. And I'm glad you exposed him in front of his family for the cheating asshat that he is.\n\nI wish you the best, and I hope you find someone that deserves and appreciates you.",
            "Usually I wouldn't advocate for this...but I hope you and the lawyer take your ex-husband to the fucking cleaners. Holy shit not even a little remorse for hurting you...he only cared about that he looked bad in front of his family.\n\nDo not let him crawl back to you. Divorce him, go no contact and just move on and find a partner that truly gives a shit about you.",
            "BAM! -mike drop- What you did was fantastic!  I read your previous post and immediately agreed with the other commenters that the narcissistic bastard didn't respect you nor treat you well.  Wanting the best for himself but not caring what you had/didn't have?  He could drive your vehicle but you couldn't drive his?  Geez, my hubby and I fall all over ourselves to do things for each other and make the other person happy.  I loved the other commenters who have those piece of meat moments, as that's so us.\n\nSo he already didn't treat you well, and the RV with you not in it sealed the deal.  He WAS acting suspiciously; I'm glad that you were able to quickly figure it out the way you did, and what you did at his mom's house was classic.  Especially so that his mom was right there and he couldn't spin his own little story later.  BRAVO! -BAM-",
            ">I have gotten a lawyer and have already started the divorce process.\n\nLIKE A BOSS. \n\nYou are an amazing and strong person! Enjoy your freedom from a slimy cheater! \n\n",
            "What a massive douche bag",
            "You still have great sentence structure....\n\nBack on point I'm sorry this happened OP but thank god you found out and the silver lining is you don't have kids to worry about. Still can't believe this was his endgame. What an insulting shame.",
            "My justice boner is so HARD right now!!!! Daaaamn!! Sweet mother of karma! You got him good OP. \n\nI wish you the best ",
            "Fuck yes!!!! Go you! All the internet hugs and I'm rooting for you!!!",
            "Something tells me that Tim -- for the sake of saving face -- is going to tell his college sweetheart that his \"bitch of an ex-wife\" won the RV in the divorce.",
            "What a douche. Honestly, I'm so proud of you for being as strong as you are to dump that motherfucker so quickly. You deserve so much better. Good luck!",
            "Well that sucks. Sorry.\n\nBut at least he never gets to use your RV again!",
            "This is a shitty turn of events, but really I'm so relieved you left that asshole. If it weren't for the cheating revelations, you'd still be burdened with this piece of shit that couldn't care less what you wanted when it didn't relate to his own benefit.  \n\nAlso, you're a badass.",
            "Ugh. I had a horrible feeling this would be the case, but I'm glad you kicked his sorry arse into the gutter and that STBX MIL has taken your side. She sounds like an awesome person and definitely worth keeping in your life once the divorce is out of the way.\n\nYou handled this like a boss, OP. Go forth and enjoy your RV!",
            "I'm so happy you never relented on your RV.  Now it isn't tainted by his skankery.\n\nI hope your next book is a bizarre road adventure,  with a cameo of your ex husband's awesome mom.   \n\nGood luck,  OP, and may your novels continue to sell!",
            "Damn, you've got a good head on your shoulders. Congrats on getting rid of the dead weight.",
            "Sorry to hear what you're going through. But I'm really, really glad you were so smart about everything. You have so many amazing things going for you. This is all just going to be a bad memory, and you have so many great writing & RVing adventures and way better guys to look forward to.",
            "Wow, what an asshole. Normally I'm wary about people sneaking into their partner's private things but I can understand why you did it and I think you handled it the best way that you could. Good on you for getting the hell out of there and not listening to his BS! ",
            "I'm so sorry that he cheated on you.... but holy shit you are fucking badass.",
            "At least now you have some source material for your next novel: *The RV Rendevous*.\n\nAnd it's sequel: *The RV Rendezous: Rekt*.",
            "Honestly, he's pretty dense. Taking the RV without you was suspicious as fuck.",
            "wow... Tim's a piece of work.  Things will not work out with his ex, trust, he's in it for the thrill and not anything more.  He thought that he could come back to you when he's done having his fun.  You're better off without him!\n\nHonestly OP proud of you, many would have stayed and tried to work things out because starting new is \"so much harder\".",
            "You're my hero.  Thank you for not agonizing about that cheating scum and taking him back. \n\nAlso, your MIL is awesome.",
            "goodness gracious.  your soon-to-be-ex-husband's mother is a saint.  i hope you find the peace you are seeking for.  ",
            "OP is single now/soon and can go camping.  I make any kinda cheesecake, smoke a mean brisket, and love to drive (so OP can relax and enjoy the scenery).  That's my resume. /lightheartedcomment",
            "This sounds so predictable that I can't tell if it's fake or not.  At least you subverted the idiotic cheater.",
            "sorry that had to happen, but he was acting pretty fucked up. It's good you found out and dropped that shitbag.",
            "You're a strong, awesome person! Enjoy the RV :)",
            "I was hoping for an update on this. You're freaking awesome.",
            "Wow that sucks but good job on moving authoritatively.  Enjoy your future and your RV!",
            "Holy SHIT.\n\nYou take that RV and live your life as you damn well please!",
            "I'm so sorry you're having to go through this...but the way you handled it was fucking awesome. ",
            "Novel idea: the RV of forbidden love. \"how far will the road go before you hit passionville?\"",
            "So you're saying you're available ;)\n\nSeriously though, good for you.",
            "So ... road trip to meet all the redditors who gave good advice?  ",
            "\"This is my own private domicile and I will not be harassed!\" \n\nSeriously though, you handled it really well. Enjoy your writings and don't make your nice RV a meth lab.",
            "Best part is, all the finances are already split.\n\nShould be a pretty straightforward divorce process.\n\nNow explore the country with that RV. ",
            "I just wanted to throw it out there that in some states, (depending on how it's written,) cheating nullifies your prenup. I would take this cheap cheating asshole for all you can. \n\nI want to tell you how proud of you I am for you doing so well with your writing. You are literally living your dream. I hope you can use this horrible situation as fuel for a whole new set of thriller/revenge/romance novels. \n\nMuch love and good luck to you. ",
            "This was satisfying",
            "Want revenge? I would be glad to help.",
            "Check if your Prenup has an adultery clause as well. Him planning to cheat on you may make the entire thing null.",
            "Not that he should get the house or anything, but at least you have the RV to crash in if things get hairy during the divorce and cutting assets in half (including the house).",
            "I don't believe this happened. ",
            "My favourite made up story yet",
            "You're going to have a blast! If you come to Portland we can explore some freaky  but cool places sometime!",
            "Fuck yeah.  I want to buy all of your books now.",
            "Take this guy to the cleaners'. He deserves it.",
            "This just fucking sucks, but good job OP. Good luck in the future. I hope you find happiness elsewhere in life. ",
            "Good for you. It will be tough, but have fun travelling in your RV. ",
            "You handled that perfectly.",
            "I think you handled that about the best possible way you could.",
            "Wow... You handled that like a pro. Go you for not putting up with his bullshit.\n\n\nLife will only get better without him!",
            "You handled that like a boss. Good for you for not even give him the chance to gaslight you. Best of luck in the divorce.",
            "This is awesome. Nice job. Like a boss.",
            "You got rid of a shitty guy and scored a sweet RV. It'll take time, but it's a win.",
            "Good for you! Now go be proud of yourself *and* your career, the way he never let you.\n\nAlso: I'm so sorry your marriage is over. Even if it's for the best, it is still horrible. Hugs.",
            "Good job OP.  I divorced my ex-wife when I found out she was cheating as well, and know the pain that goes along with it.  Hang in there, and know there's a better future ahead to find someone who's caring, generous, and will be faithful to you.",
            "I'll go with you on your next trip.  Cross country trips rock in RVs.  Last one I did was in a VW camper Bus.",
            "You got a fantastic life ahead of you.",
            "I'm so sorry this is happening to you! Good for you for getting out! I've got to ask a question though--did this just come up out of the blue? You said in your earlier post that this was really unlike him that y'all had a good marriage and he's never acted like this before. Did you think of your marriage as healthy up until this point? ",
            "A lot of Pre-nups are void if the spouse cheated. I'd look into that if I were you. I wouldn't doubt if he always planned on being some sort of player. What a disgusting person. ",
            "On the bright side, you'll probably get some material for a novel out of this, if you ever feel like branching away from romance.",
            "Sorry to hear what happened but at least you found out before he actually fucked his ex and you would have to test for std. Good to hear you started the divorce proceedings!",
            "What kind of RV do you have?",
            "I'm so sorry that you had to go through this.",
            "You are the baddest of the bad ass bitches. I'm proud of you. Though I'm sorry for your pain and all the crap that bastard put you through.",
            "I'm so relieved. I seriously thought something horrible had happened to you.  Like murdered or something! So glad your alright. From one writer to another. You take that rv on the road when your done and don't look back and write all your troubles away!",
            "Good for you. Enjoy the RV with someone who appreciates you and let's you drive it for fucks sake.",
            "Damn what a jerk. You're lucky you found it out, who wouldn't want a RV trip with their wife? Damn I wish my wife liked this stuff",
            "So sorry it turned out this way, but he never sounded like a man who was worthy of a relationship with you.  Be sure you secure your important belongings and consult the lawyer about what to do about him coming back to the house.  \n\nGood luck in your further writing career!",
            "OP, you handled this BEAUTIFULLY!! You deserve someone who will be faithful. Have fun with your RV :)",
            "My first thought on reading this was if you live in a community property state, the RV is half his.  That's something that your attorney can help you with.\n\nSecond thought- good for you for dumping that bastard!  ",
            "I'm sorry this went so badly for you. It is good that you found out though. I hope things go well for you in the future.",
            "Damn, that's pretty clever checking the Sent folder.  ",
            "Fuck yea dude. You're a badass. Glad you didn't take his shit. ",
            "wow. you're braver than most. sorry it turned out to be that but regardless he wasn't treating you like an equal partner imo. best wishes ",
            "Sorry this happened to you but good god, you are a badass. That was quick thinking and instant justice. You seem to have a good head about this all and I have a feeling things are going to work out just fine for you",
            "What does RV mean?",
            "Maybe the pre-nup won't hold up because of him planning to cheat? Might as well check up on it and see. Fuck your ex-husband.",
            "OP, you are AMAZING, and stand as a great example to all the other men and women on /r/relationships with cheating SOs.",
            "youre really lucky you found out what a prick your ex is. protect yourself from bozos like this in the future, you deserve better, obviously. there are more shitty guys out there than good guys so do the math and be careful ",
            "Sounds pretty shitty :-/. Atleast you have an RV. ",
            "Fuck him. Use it as fuel, write the best damn book imaginable. Send me a copy as well, would love to read it.",
            "I'm so sorry, jeez what a jerk!",
            "Wow, boss!  Way to handle your shit!  I bow down to you!",
            "Nice! You handled that AMAZING! Safe journeys to you!",
            "Ugh, what a slime. The fact that you unrolled this at his mom's house was just *perfect*. I'm glad you've got this kind of relationship with his mom. \n\nIt sucks that he was planning an affair, but cheers to you for kicking his sorry ass to the curb. Best wishes as you get through the divorce. May you and the RV have many happy years together!",
            "This isn't the kind of update I'm happy to see. On one hand, I'm glad you found out when you did, but on the other, I feel awful for you. This must be incredibly rough on you and I really hope things work out for you.",
            "You sound very resourceful, handled that very well. Sorry about your horrible situation but you seem like you can handle yourself. Good luck.",
            "I read your first post, and like many here, I assumed the worst. I'm very saddened to read that your husband turned out to be a turd. On the plus side, you left that turd and are moving on. Good for you! I hope you're taking some time to enjoy your RV and your new turd-free existence.",
            "Wow, I know this is hard for you, but this is a he'll of a story, loved the part where his mom took your side, I guess she is a great person, my advice to you, apart from the reddit classic lawyer up, hit the gym and delete Facebook, it's don't look for love right away, take your time to travel and write, you will do great",
            "I don't have to know you personally to be proud of you, right? Because I am. I'm very very proud of you. ",
            "You handled that beautifully. Congrats on your new jerk-free life!",
            "I KNEW IT! Son of bitch is playing you like an Xbox! What a dick. What a filthy, depraved dick.",
            "On the upside...maybe you have a new inspiration for your romance novels? :D\n\nRegardless, that was pretty bad ass. Kudos. ",
            "All I have to say is: good got you! Enjoy being single. Drive drive drive! ",
            "Have to say, OP, you handled this wonderfully and correctly. I am sad to see that he proved suspicions correct, but your head and heart are in the right places and you'll come out just fine. Proud of you, lady!",
            "You go girl! Way to stand up for yourself! You realized before long what he was doing and took care of yourself first. \nAt least you can drive around in your RV and live your existence better without him ^w^ good on you darlin~",
            "Holy shit. You are **the man/woman**. Found out your husband was cheating, didn't break down, didn't have much hesitation - you literally threw his shit in a bag and handed to him, then drove away.\n\nI wish more men/women were like you. Maybe we wouldn't have so many cheating asses.",
            "Hey, OP, if you're ever in North Texas, you've got a drink, on me.",
            "I applaud you for handling this shit situation like a total boss.",
            "You fucking owned this situation. Good for you. ",
            "Reading this made me sick to my stomach. Stay strong. ",
            "Like a boss!!",
            "(((hugs)))\n\nTake care of yourself! ",
            "...I gotta say, that was extremely clever what you did dropping him off at his mom's house where he belongs. \nReddit also seems pretty good at sniffing out relationship issues.",
            "I feel that, with this subreddit only two things happen. Something really bad or a misunderstanding. That means that a percentage of the updates or stories in general are bogus.",
            "This whole story seems like made up bullshit. \n\nAlso:\n\n\"I knew that if his messages were in the sent folder, that meant that he had deleted them\"\n\nWhat?  No it doesn't.  Nancy Drew here doesn't know how email works.",
            "ok, this is such bullshit. not everyone in a relationship is trying to cheat, but that seems to be the only outcome on /r/relationships. some of you motherfuckers are liars.",
            "*Nana internet hug* Good for you!! Kudos! :)",
            "I'm so sorry you're going through this, but so relieved and happy you're going through WITH this, if you know what I mean. Good job on the sleuthing and not putting up with being disrespected in your marriage... and your RV.",
            "You fucking GO girl!!!!",
            "What an awesome 'drop the microphone and get the fuck out of there' moment.  Congrats OP!",
            "Even from this post, I love your writing style.  I see you did a throwaway for obvious reasons, but I'd love to know what you wrote and check out some of your books.  Could you PM some titles to me?  Maybe that's weird, but I just want a good story!",
            "Your writing is excellent and you're such a classy lady. Reading this actually made me say \"You go gurl!).\n\nWould love to read your books if you'll let me purchase them. :D",
            "Such material for your romance novels",
            "That's brutal. I really feel bad for his poor mother.\n\nOP, I know its tough now but you seem like a strong person and you will be thriving in no time without this jerk in your life. You handled that perfectly. The mother though, she's going to be utterly crushed for a long time.",
            "> She asked me what was going on and I told her, \"I'm not sure myself. I'm waiting for Tim to explain why he was planning to cheat on me with his ex.\"\n\nBOOM! *drop the mic*\n\nAmazing OP, just amazing. Well done!",
            "Just curious. Do you have kids with Tim?",
            "Good for you. I am sorry you're experiencing a cheating spouse, but good for you.",
            "Tim is a dick",
            "I hope that prenup had a cheating clause. That fucking dick.",
            "What a piece of shit.",
            "I'm really glad you updated. I'm sorry it ended up being like this, but you handled it perfectly. I was hoping you'd leave him somewhere. His mother's house is a decent spot. I had a feeling he was planning on cheating. It's really twisted how he planned to use your RV to betray you. At least now you know.",
            "Ah. Brutal. Good for you, and good luck finding someone who appreciates you.",
            "Good for you OP. I'm sorry it turned out ugly, but you handled it like a champ. ",
            "You, OP...you are my hero.  I love you.",
            "I read the first post and thought, \"No way this marriage lasts.\"  Then the update comes along and sure enough it didn't, but not at all for the reasons I expected.",
            "So... Road Trip?",
            "I like how you handled this. Just the right amount of emotional composure and vindictiveness to give this asshole the maximum amount of shame. Well done and good luck.",
            "Sorry to hear that this is the result, but I'm glad nothing bad happened on the road back. Driving while that emotional and crying can be very dangerous.",
            "I applaud you for your level head throughout this ordeal! When I discovered my then husband's (whose name is also Tim. Fucking Tims) messages to his side girl, I was completely disarmed of wit. Even trying to screenshot his messages for proof was difficult. I was so rattled I forgot the keystrokes. It blows, but you're better off without a jerk who doesn't respect you.",
            "Whelp... time to take a legit road trip. Fuck that guy, OP. Enjoy the open road. =)",
            "I don't suppose there's anything in the prenup about him cheating?",
            "OP's next romance story is going to be wicked fucking good.",
            "Jeez, woman!! When i was reading your first post, i kept saying to myself, why are they married then?? GOOD FOR YOU!!",
            "WOW, you go!  \nStay strong and keep going.",
            "You're basically leading my dream life and I'm so glad that you got rid of this negativity in your life. I hope your future will be even better!",
            "If you could update us on what happens after the divorce that would be interesting ",
            "You sound like you have your shit together, OP.  Sorry about your asshole ex.",
            "Handled it like a boss! ",
            "I am so glad you are safe and moving on with the rest of your life.\n\nI am sorry he put you through all that shit.",
            "Go you. :)",
            "Is this the real life?",
            "Hahahaha, since when did /r/relationships become the Sherlock Holmes of cheating? Cheating, holy shit. Called that from a mile away. Slam dunk. ",
            "Eat pray RV.",
            "I'm very proud of you. That was an awesome response to a terrible situation. ",
            "Uggh, you poor thing. At least you're on the other side of this shitty, shitty thing now.\n\nI have to say, reading the comments on the first thread I thought people were jumping to the possibility that he's cheating on very tenuous evidence, but I guess I was wrong.",
            "I feel bad for your ex's mother. She has seen in person how he, her son who she gave birth to and educated to be a good person, has failed her so terribly in an important part of life. I understand that you had to do it and support that you did, but she's going to be wounded.",
            "Sounds like a typical road trip.",
            "Your ex is a fucking prick, I'm so sorry that happened to you.  Good luck in the future without him!  You will be so much better off!",
            "You handled this really well. It was so brave and strong of you. You will be so much better off without this cheating coward dragging you down. Internet high five!",
            "You handled that beautifully, well done. ",
            "Good for you. That is heartbreaking stuff. It'll take time to get over the hurt, but once you do, you'll be stronger for it and able to find yourself a healthy relationship if you so choose.\n\nIt may not mean much coming from a random internet stranger, but I am proud of you. :) <3\n\nGood luck! And enjoy your travels in the RV!! I am super jealous!",
            "The nerve of this guy... unreal. \n\nUsing your mobile home to cheat on you. It's so satisfying to read these stories when people get what's coming to them.",
            "sigh, the life and times of tim. ",
            "You are my hero today :)",
            "Good for you! ",
            "Awesome! Tim lost you the minute he chose to sneak around on you, and that's his loss. His ex is more than welcome to keep him, and if she knew he was married when they reunited, then they deserve each other. \n\nCome on over to /r/ExNoContact if you want. Getting out is one thing, staying gone is another. ",
            "That's really sad. Sorry for your pain OP. ",
            "You are ONE KICK ASS LADY, LADY.",
            "Wow. Good for you. Take that rv and go on a long road trip with friends!",
            "Don't cook meth in the rv",
            "I just ditched my fucker of a partner (found out he had put a camera in my mother's room while my.friend was staying in there and filmed her getting dressed/sleeping/whatever). A month later I found an awesome guy who I absolutely adore in a way that I didn't think possible. Went from a shitty 6 year relationship that gave me depression, to off medication and loving life because of this guy. He knows all about my history and my fuck up and my hardships and is still amazingly supportive. I'm mad in love with him. But shhh. It's to early to say it though its pretty obvious that were both struggling not to at this point. \n\nHe's snoring behind me right now. Can't stand snorers normally yet here I am grinning like an idiot listening to him.\n\nYou'll never look back once everything settles. The divorce will be an annoyance that will drag it out though.",
            "Hell yeah, you totally did the right thing. You are a strong badass woman. Things will get better",
            "As soon as I read the first post I knew he wanted the RV to see someone else. It was pretty obvious by how you said he was acting.",
            "You fucking rock.",
            "Good on you for leaving his lying cheating ass! Stay strong!",
            "I am very sorry that you went through this.  You handled that much better than I think I would have.",
            "Divorce advice. Find top rated attorneys and consult with all of them. Most are free, some charge a bit. But if you talk to them first they will then refuse to be your ex husband's council because they already heard your side of the story first.",
            "Wow, thanks for letting us of reddit into this painful time in your life :/ I think it's awesome that you're standing up for yourself and have gotten rid of him. Stay strong. ",
            "Time for a huge adventure solo road trip that will heal you and get you back on your feet.",
            "I'm so sorry!  You handled it well.  Cheaters only care about themselves.  I hope you find a good man in the future.\n\nI went on a date myself last night and found out he was still in a relationship. I noped out of there.  Helping people cheat is bad karma.\n\n",
            "Hopefully you and his mom can still be friends. She sounds like a great person. ",
            "Good for you! It takes a strong person to do something like that. Never look back. ",
            "OP, that's an epic way to handle things. Good on you!\n\nI also wanted to comment on your job - it seems like one of the coolest jobs in the world! Keep chasing your dreams & don't let anyone get in your way! c: ",
            "Good on you miss!",
            "Fuck, that's awful. I'm really glad that you were able to find out in such a black-and-white way, with such an easy exit, before things could get worse. Goddamn, though. What a complete piece of shit.",
            "You did well.",
            "Sorry this happened to you, but you handled it very well.  In case you start to waver, do NOT take him back!  Move forward - you'll be just fine. :-)",
            "This sounds like the start of a romance novel, before she meets the guy. ",
            "That's really shitty and good at the same time. When I started reading the beginning of this post I had a feeling I knew it was coming. It seemed like there was a reason he didn't want you to be there. Whatever the reason was, it was something he didn't want you to know about and that's why he was pissed. Either way it doesn't matter now. Hopefully you move on and eventually find someone who treats you with more respect.",
            "You are awesome!\n\n",
            "All i can say is: You go girl!",
            "way to grab the bull by the horns. good for you! go get yourself a KOA membership and set up shop at any number of their awesome campgrounds.\n\ni'm glad you didn't put up with this shit.",
            "It's looking like buying that RV is one of the smartest purchases you ever made!   ",
            "I'm so proud for your courage and bravery. Change is hard. Good luck in your future endeavors!",
            "And that ladies and gentlemen is how you get an RV. /s\n\nSorry to hear this. He deserves every bit of anger he will be getting from his family. Good detective work. \n\nI do suggest you take the RV out for a drive and go away for a few days. Clear your head and think about your life from here forward. Ask a few friends if they're available - i think companionship will be good right now. ",
            "Good for you. You're handling this amazingly well.\n\nI found out about my ex through the same sort of thing, and I wish I could say I had the self respect and thought to handle it like you did.",
            "Good for you!  You will be happier in the long run, I promise.",
            "YOU GO, GIRL.",
            "Sorry your going through that. Nothing is harder then relationships. I hope your husband will be honest with you. ",
            "Thank you for updating. This story stuck with me for some reason... He was being such a dick and I feel for you. Cheers to a new future, I'm sure you'll find someone who treats you with the respect you deserve :). ",
            "We all know how relationship advice ends on reddit...",
            "You freaking won here girl. Straight up won.\n\nIt's not often you get the chance to out someone so quickly and efficiently. And you said and did all the right things. So glad to see you called his BS immediately even while still possibly in an emotional state and cut him off. Absolute best things you could have done, you are amazing.\n\nYou likely learned a lot and will easilly find something better. ",
            "Does the prenup have a cheating clause?",
            "Omg u are soooo cool. U handled this amazingly, and trust me he is the looser here. You can go on a roadtrip now and spend your time with awesome folks rather than waisting it on your asshole ex. Also, bring your MIL a happy mothers day card because she defended you like you were blood related. She is one super cool MIL. Have a nice life, im so happy for you!\n\nhugs from an internet stranger.",
            "I'm happy that you had a pre nup! ",
            "You should begin to cook meth and become a millionaire drug Lord. That would teach him.\n\nYou already have a RV. so you are a step ahead from Walter white.",
            "Wow. I'm sorry you're having to go through all this but at the same time, the way you handled him really put a smile on my face. Happy trails :D",
            "Trade the RV for the mother?",
            "Now you need to start hitting the gym.",
            "Good. For. You. Good. =)",
            "If this was a movie, you'd take everything and he'd be left with nothing but the RV.",
            "damn. what a jerk he is. :( sorry you are going through this. but on the bright side things could be worse. ",
            "I hate cheaters, they make me absolutely sick. but I can't believe how piss pore so many are at hiding it. \n\nAt least put a decent fucking password on your device, for christ's sake. I don't have anything to hide but I still won't ever tell someone my passwords/pins. That's my private shit. You'd think with something so incriminating to hide they would at least take some measures.",
            "I'm truly sorry this happened to you.  :(  Here's to a better future!",
            "YOU! Holy spine of iron, you are amazing and I want to *be you.* I flailed around at my desk a little bit. You are gonna be just fine, lady!",
            "Well, I doubted he was cheating after reading your first post but as it turns out I was dead wrong.\n\nI'm sorry for what you're going through. I'm sure its a whirlwind of emotions having just discovered you were betrayed by your partner. That said, you certainly have a flair for the dramatic. Throwing a bag of his clothing at him in front of his mother?\n\nI suppose if you already identified that his actions were a deal breaker it doesn't really matter if you gave him room to explain.\n\nThe part where I kind of hesitate is that you made it sound as though if he had said sorry to you directly in that moment that there may have been a chance.\n\nIts not right, but it is normal behavior for people to feel defensive/guilty/angry when they get caught doing things wrong. If you were interested in continuing your marriage on any level, if may have been worth sitting down and having a talk about it. It seems that you decided that was not an option as you had already made your decisions. (Evidenced by you throwing his stuff in a bag and telling him you caught him right in front of his mother.)",
            "nailed it",
            "Send me a link to your books and I will buy a copy of each. Why? Because if you are telling the truth, you are smart and I am proud of you, and if you aren't, it was a great story :)",
            "You are amazing! Stay strong and enjoy your new RV!!! :)",
            "Sorry this guy hurt you like that; glad you got a wake up call to what a selfish SOB he is.  Hope you can turn this heartache into an awesome best-seller.  \"Eat, Love, Drive\"",
            "You are awesome! You handled that with way more class than i ever could've, you go girl! ",
            "I know it's a cliché, but... You go, girl.",
            "I'm relieved at the steps OP has taken to get out of this relationship but I'm wondering if I'm out of touch on one issue.\n\nDon't couples share finances? Aren't large purchases such as a car or RV supposed to be bought and owned together?\n\nIs this a thing of the past, or just a habbit of the poor? To me it doesn't sound healthy to think of it as \"my money\" and \"my RV\". ",
            "YOU GO GIRL!  LEAVE HIS SORRY ASS! You did the right thing.  Everywoman on the planet applauds what you did.  Change the bank accounts, change the locks, pack his stuff up and put it in the garage.  ",
            "hit the gym. ",
            "I'm so sorry for how hard this must be for you. But when I finished reading this, I literally sound out loud, \"BOOM!\" and then imagined you dropping the mic. You're awesome. ",
            "YOU ARE MY IDOL!\n\nI am eternally sorry for your current situation and wish you the best, but let me say this; You handled that like a champion.",
            "YAAASSSSSSS!!!! I was so excited for this update. I know it sucks be please be strong. Stay away from him you deserve so much better. I'll give you love!!!!",
            "People: If your spouse makes you sign a pre-nup, you've chosen the wrong person. If your spouse demands separate bank accounts, and what's his is his and what's yours is yours, you've chosen the wrong person. \n\nA marriage is a full and complete partnership. There's no more \"mine\" and \"yours.\"",
            ">but at least I got rid of my asshole **ex-husband.**\n\nThis is where it lost credibility for me. ",
            "[deleted]",
            "Such a satisfying end to a crazy situation!\n\nMy only complaint is I see that you blocked him on social media and lawyered up, but I'm not seeing any mention of hitting the gym. That's the critical 3rd step in any breakup.",
            "I missed the part where you found proof he was cheating? I'm not trying to downplay what happened, but we don't know the whole story. However i do believe what you've written, and you should try to find out from him why he wrote those terrible things, and after you hear him out, then you can divorce/cheat on him.",
            "Saying he missed a girl or wanted to see her isn't exactly cheating "
        ]
    },
    {
        "post_id": "hetem6",
        "author": "DiscombobulatedOwl81",
        "title": "UPDATE: My [F27] flatmate [F27] has told my boyfriend [M31] she's in love with him.",
        "url": "https://www.reddit.com/r/relationships/comments/hetem6/update_my_f27_flatmate_f27_has_told_my_boyfriend/",
        "score": 7449,
        "num_comments": 327,
        "created_utc": 1592969362.0,
        "selftext": "You can read the original post [here](https://www.reddit.com/r/relationships/comments/hczgd8/my_f27_flatmate_f27_has_told_my_boyfriend_m31/).\n\nOkay! Firstly, thank you all for your advice (and **no thank you**) to the few who took it upon themselves to DM me to be inappropriate or creepy - wtf, read the room).\n\nIt gets a little intense, so first I'll just cover some things I wasn't able to in my original post.\n\nI trust my boyfriend completely. Even if I didn't, this apartment is large, not massive....I know where that beloved MF is 24/7. A lot of you asked when after my housemates confession he told me about it: he  told me a couple of hours afterwards. He explained to me after we had a chat about it that he was afraid I wouldn't believe him or be angry, because at first he'd thought it was a weird joke that made him uncomfortable, and he felt (rightly so) weirded out. I agree with the bulk of you that her continued touching is harrassment, and while a number suggested he just confront her himself, I empathise with being in a situation without breathing room where someone is sexually harrassing you. It's not easy, and you can quickly find yourself unsure if those brief moments of crossing a line happened. He's not on our lease, and understandably he was concerned about me and the power dynamic in the house (bc her room is a mini granny flat, she pays the bigger share).\n\nI also don't believe that it was, as some suggested, a hypomanic episode. I have BP2 and while I understand the 'love rush', she exhibited zero other behaviours, and never tried to contact my BF outside of the weird touching. I also can appreciate there's no way she was actually in 'love'.\n\nSO:\n\nYesterday, after a tense few days of trying to avoid her, my BF and I were in the kitchen at breakfast, with her around in the living area. I went to 'our' bathroom (she has an en suite) which is just off the main area to brush my teeth. I walked back out to grab my phone as she was sidling behind my boyfriend who was looking in the fridge, and caught her *running her hand and forearm across his lower back where his tee shirt had ridden up a little*. My boyfriend, who didn't see me, yelped really loudly and just lost it. He yelled at her to \"stop!\" and when they both saw me he starts going \"you see?! You see?! This is what I was talking about!\"\n\nI was furious, just whole body anger, and I could see she had now realised he HAD told me about her confession/behaviour, and just sprinted to her room and slammed the door. My BF and I went out for a walk to calm down, and he kept apologising for not being \"more firm\", but he was shaken up - some of you told me I should just confront her head on, which in the moment I 100% sided with, I was so angry for him. He told me he'd rather give her the opportunity to do it diplomatically. I appreciated what you guys said about lock down being extenuating, and in discussion with our mutual friend, I was willing to believe that an element of it was naivete, and a bit of fantasy gone too far. I was willing to be kind to her.\n\nWhen we returned with a plan of action, we knocked on her door but she didn't answer. We tried a couple of times but she wouldn't come out, although she was 'seeing' my Whatsapp messages. Come late afternoon, I was just over it, so I knocked, and told her I was coming in. I sat her down on her bed and told her gently but firmly it was inappopriate, making us uncomfortable, told her she had to get the hell over it/herself if she intended to continue to live with us. She burst into tears and starts crying about how she's \"so sorry\" and what a \"bad person' she is, and she can't believe the pressure of lockdown is getting to her, whatever, and I felt bad. Started sympathising, trying to be compassionate...and then she says \"It's just so unfair that the guy I'm in love with has a really great girlfriend\".\n\nReader, I lost my shit. Unfair, *my ass.* I told her she had a lot of growing up to do, and perspective to learn, and that she owed the house an apology. She started to have a meltdown, a full, weeping, hiccuping snotty meltdown. *AND THEN*  when I stood up to leave, I spotted, in her clothes rack, my freaking shirt. I took it, and went back to my room.\n\nMy housemate cried loudy with the door OPEN until 7PM (for....attention???) when I cracked. I used our emergency contact sheet, called her mum, told her she had to come pick up my housemate. I've never met this woman who came rushing in like a superstar, but the look of annoyance and embrassament on her face when she arrived and found her 27 y/o daughter having a tantrum told me this wasn't a new part of her personality. My housemate also STFU pretty quickly after she realised her mum was there. They didn't say anything to us, and we just hid in our room until they were gone. I think she'll be gone at least for a while, but I texted her to let her know it would be best if she texted me before she came back. IDK when I'll see her. Technically the lease ends in August so my BF and I think we can make it work and find someone new, and if not, it's not so long til we can resign without her.\n\nAs a coda to all this?? My BF mentioned if she took a blouse, maybe she took other stuff too. I appreciate some of you may consider this an invasion of privacy, but I did go back in, just to check the clothes rack. I found: a set of my jeans, my tee shirt, one of my boyfriends work shirts, a vinyl I owned, my fucking charm bracelet from when I was a KID from inside my jewellery box, and a sheet of my old antidepressants...this was just what was on the rack/on display. I imagine there's more in the drawers. I don't know if this was the right thing to do, but I left them there for now bc I don't want there to be any 'doubt' she stole them.  There's zero chance she's going to live here any more. Honestly, I hope she does get help. I'm really angry and violated, as is my BF, but I can empathise with the havoc an uncontrolled mental health issue can wreak on your behviour, and while it's still wrong, it still sucks for her to experience it and lose friends. NOTE: *I can't be sure, none of us can! But I feel like maybe (?) she has a histrionic personality disorder.*\n\nTL;DR: my relatively normal housemate who told my BF she was in love with him turned out to also be a thief. Yikes!!\n\nPS! Our mutual friend has told me another friend who went to school with my housemate had told her a rumour she'd told a bunch of people in their year that she had leukemia. YIKES.\n\n(edited for typo)",
        "permalink": "/r/relationships/comments/hetem6/update_my_f27_flatmate_f27_has_told_my_boyfriend/",
        "comments": [
            "I would just go ahead and take your stuff back, especially your medication and bracelet. She already stole from you so if you give her the chance surely she will try and lie to cover it up. Maybe it’s going to far but if it were me I would look through her things to retrieve anything else of yours that may be in there.",
            "That’s a whole lot of yikes. I personally think you should go back and get your shit. You know she stole it. She knows. Unless you’re pressing charges it doesn’t matter. Since some of those items are sentimental you run the risk of her coming in the middle of the night and taking it all/ quietly moving out and never seeing your things again.",
            "Hi! I don't know if this'll go to the top or just get lost in the bottom - but I'm going to just go in and take my stuff. I think recording me doing it might be weird, and legally iffy. I'm also not really concerned that she could be violent or aggressive if she came back, I think the whole situation has been pretty humiliating for her. It kind of seems like it's about eliciting attention or sympathy. How much she felt was genuine and how much was manfactured and magnified to feed that need, IDK. I still hope she's okay. I've definitely let my health issues push people away before (albeit, never so dramatically) so I don't think I'll be calling her crazy.  \nMy boyfriend pointed out that I wore my jeans last week and that we'd all been listening to the binyl in the living space a couple of weeks ago, so I'm kind of interested to see if this was maybe an episode or an ongoing but usually managed thing? I also only switched my medication at the end of April but I have zero clue if the foil pack I found was my discarded last lot or taken before I changed.  \n\n\nAnyway! Thanks again for all the help and advice :)",
            "Sounds like this girl wanted to be you. She started with your stuff and the next thing was your b/f. Feels like a Life Time movie.",
            "girl you better look through her entire room and tell her mom about it, she’s definitely hiding more of your stuff",
            "Stroke of genius to call her mom. Best of luck finding a new roommate to you and your boyfriend.",
            "Get in there, take photos/video, but take all your stuff back NOW. You can text her mum and mention that you've had to go through all her stuff and found X dollar(pound?) amount of your possessions, which you have reclaimed.",
            "Let her mom know what you've already seen just on the surface, and that you're going to get whatever else is yours in the room. Have your BF video as you do it, so there's no question that you retrieved anything other than what was yours. \n\nBut you definitely need to get all your stuff out of her room. Because if her mom decides to come and pack up flatmate's stuff, she won't know whether an item might be yours or not. And that's some creepy identity-stealing stalker BS there. Take your clothes, take your man, take your life... ever see the movie \"Single White Female\"? Chica has issues. Protect your BF and yourself.",
            "[deleted]",
            "Wow wtf giiiirl. Good job on you for quick thinking and calling her mom. She’s craaaayzy",
            "Ten points to Gryffindor for calling her mom. \n\n\nFunny story: Three weeks ago I kicked out a mentally ill person for a drunken knife fight. I'm going to tell you what I told my 11 year old when she felt guilty for not wanting to even see this person anymore, and it applies to you and BF: \n\n\nYou get to feel safe in your own home. That's important, and that is your right.\n\n\nPersonally, I've been feeling guilty and mad about all of it, and reeeally mad this three ring circus dropped in my kitchen. So how are you feeling? I'm sure BF is going through a lot. Are you doing things for yourself? \n\n\nPS: go through her stuff, take back what's yours, take pics of anything threatening for documentation, then take the high road and don't post her headless Barbies and unwashed vibrators on Reddit. Or whatever you want, but that's my vote.",
            "Don't bother getting evidence. \n\nJust get in there,  thoroughly search the place and take back whatever is yours. \n\nThis is likely your only chance to do so. If you leave it until she returns,  your chances shrink significantly. \n\nOnce you've taken it all back,  make sure she doesn't have access to anything you'd miss if you never saw it again. \n\nThat might mean paying to put some things in storage.\n\nIt might mean putting a lock on your door, or taking turns to guard it.\n\nIt definitely means moving out,  or having her move out, as soon as physically possible.",
            ">I left them there for now bc I don't want there to be any 'doubt' she stole them. \n\nThere is doubt now. You put them in there when you entered her room. That's a story she could tell and how could you refute that? So since there is no upside to leaving things there I agree with others and take them back now.",
            "Take pictures of your stuff in her room. Then get your shit back. \n\nI know it’s probably not the right way to go about it but I would totally just go through all of her drawers and shit to see what else she’s taken.  \n\nShe’s already violated you. You are retrieving your own property and may not get it back otherwise. \n\nJust think about when she stole all that shit from you! She’s been all up in your space. Repeatedly.",
            "Go get your stuff back now. She's a grown ass woman whose reaction to being confronted about your boyfriend was to have a literal tantrum for hours that was only stopped by her *mother*. There's zero chance she's going to own up to taking your things, or confess where it all is, or take the effort to dig it all out and give it back in a timely fashion. Take video or photos of the stuff in her room if you want, but get it all out before she comes back.",
            "Wow glad that's done with. That was so much worse than I expected. Imagine if you never found out. Thank god you both are safe she sounds unstable.",
            "I gave her the benefit of the doubt but she's definitely crazy... holy shit! Even stealing your and your bfs things. It's good that he shocked the shit outta her with that 'STOP', tbh I would have knocked her door down and started swinging at her for doing that. \n\nYes, that crying was for attention, she wasn't doing it before you came and talked to her so Yes, it was another desperate way for her to create sympathy since it slightly worked before. \n\n>PS! Our mutual friend has told me another friend who went to school with my housemate had told her a rumour she'd told a bunch of people in their year that she had leukemia. YIKES.\n\nYou should have been notified about her mental state before you even moved in with her. Idk how your mutual friend did not mention that you're moving in with a crazy b.\n\nAnd it truly is infuriating to have that b say \"it's unfair\"... what she's doing is unfair! Stealing, harassing him and then acting like the victim. Wtf?",
            "So you're just going to let her keep your stuff? Bad move...",
            "Holy shit!!!! That woman is a *menace*, jesus",
            "Whoaaaaaa! That got dialed up a few notches from the first post. I hope this works out for all of you. Glad you got Mom involved. Seems like she knows what's up.",
            "You’ve handled this incredibly well. You’re compassionate without letting her walk all over you. Your poor boyfriend has been getting sexually harassed and you’ve been totally supportive of him. Well done with all of this. You have full right to be angry and full right to take your stuff back",
            "Call her mom. Tell her she needs to go and tell her when you went in to talk to her you found she stole some personal things of yours.  Let her know you don't want any trouble, you know she needs help but she needs to go. Let her know if this ends quietly you won't take the stealing issue further. This is not the first time she's stolen shit.\n\nMom will appreciate this.",
            "I’m sorry I’m baked af right now and I loved this story. So juicy lmao!!!",
            "She's a creep, her actions although maybe in part from mental illness that can't be used as a crutch. Sometimes people lack boundaries because they're assholes (disfuckingclaimer: I'm not talking about legitimate mental illness that lack control, or don't realize, doesn't matter we need to be held responsible for our actions regardless and yes sometimes people have issues and are JUST giant assholes) her actions just seem like she got caught with her hand in the cookie jar and crying gets her way.. \nGet your stuff out of her room, search it. Let us know if you find a shine or something.\nIt might be reaching on my part but I feel finding your boyfriends clothes in there.. this situation might have gone differently if you didn't confront her like you did. Good job and best of luck.",
            "Be sure you take your stuff back.  I can't remember from this if you have another housemate but if you do give her a chance to go check for stolen stuff too.  Have your BF as well in case she has something of his you don't immediately recognize.\n\nThis is good, you can take pictures of all your stuff in her room as you take it out, call her mother and give her the value of things you found stolen and say you won't be pressing charges if in exchange she doesn't move back in.",
            "That was such a journey from start to finish. I got anxiety just reading it. Good on you for being so level-headed throughout the whole process, very admirable. I’m sorry you’ve had to experience this. Happy for you guys that it’s mostly over now and you can hopefully resume your lives soon...",
            "I had a housemate steal a camera from me (amongst other things) but I always felt uncomfortable mentioning it all (they were a cousin) until I saw what was on the camera. Very provocative photos of him in lingerie. I never mentioned it because I thought it would be funnier for him to realize the camera was missing knowing those pics were on there.",
            "Doesn't matter what illness she has or doesn't have, she isn't capable of living on her own as an adult, and certainly cannot be anyone's housemate. At least not until she is successfully treated.\n\nYou should comb through her room in its entirety and get all things out that belong to you or your boyfriend. Inform her mother that her daughter was also stealing from you.",
            "A \"normal\" grown up, when confronted directly about something so embarrassing would just apologise and try to make the whole conversation as quick as possible. Her behaviour shows that there is probably something going on with her mental health, and I feel sorry for her. That said, you and your boyfriend are 100% in the right and handled everything like champs, I don't know if I could have kept your calm.",
            "She definitely displays signs of Borderline Personality Disorder. She is sick, and the right thing to do was to call her mom. I would recommend getting your stuff, and breaking ties with her completely. This type of person has a very hard time with any sort of boundaries whatsoever. She will do it again unless she get some serious help, and even then, she will never be “cured “. I’m sorry you had to go through this and she has a long road ahead of her",
            "I would go back in and get all your stuff, then pack up her shit too! Pack everything she owns into boxes so her parents can pick it up and there is no doubt that she isn’t living there anymore.",
            "Just take your stuff back. Take her room apart and find all your stuff. Don't film it, that isn't proof of anything except that you went through her stuff. After you have found all your things, put her stuff in boxes and ask her mother to come pick it up",
            "> She burst into tears and starts crying about how she's \"so sorry\" and what a \"bad person' she is\n\nThis kind of crap is almost always manipulative bullshit. So that you start comforting the offender instead of the other way around.\n\nUgh.",
            "I’d assume borderline personality disorder before I’d hop on histrionic. You should read about it. This is pretty mild compared to some of what is considered standard behavior for that disorder. \n\nEither way, you have been more than mature about all of this, OP. Good for you!",
            "> It's just so unfair that the guy I'm in love with has a really great girlfriend.\n\nThis particular sentence explains her behavior completely.   \"The guy\" is just an object, he has no feelings, no desires, in her mind.  The only obstacle to getting everything she wanted was YOU.  Not him.  He said no multiple times, and she completely ignored it.\n\nHopefully you understand how disturbing and wrong this is.  With genders reversed, imagine a guy who just won't take 'no' or anything you say for an answer.  \n\nShe is a psychopath.  No empathy.  Complete inability to understand what your boyfriend felt or wanted (and also what you felt and wanted).  Inability to consider anything but her own selfish wants.\n\nHer mom knows, of course.",
            "If you are leaving your stuff in her room. Change the locks, so she can’t come back without your knowledge.",
            "install a door knob with a lock until your lease is up im sorry this is happening",
            "Damn OP, well done across the board here. Here’s hoping she gets help and also gets the fuck out without any other issues.",
            "You will never get your things back if you don't go get them back now. Evidence is great for court, but if this goes to court she's going to \"lose\" all your stuff and you'll never see it again",
            "Holy shit. This is all bananas. She sounds manipulative as heck. \nGo get your things!! You are risking her coming back and potentially packing it all up deeper. I have seen people cling to things like those even when theyre outed. \nPersonally, I would dig and make sure I had everything that is mine. After finding the charm bracelet, she is owed no courtesy.",
            "Steal yo shit. Steal yo man too. Lol she's just spoiled trash.",
            "Oh goodness. She needs a psychiatrist, and I hate for her that she's clearly at the mercy of something larger going on in her mind. \n\nYou handled this so well. Good call with alerting her mother. \n\nLet your boyfriend know, from this internet stranger, that he has no reason to be embarrassed. The most common response to sexual harassment is freezing up or shutting down. So the fact that he wasn't \"firmer\" with her isn't shameful or wrong. It's very human. \n\nBest wishes as you move forward.",
            "She wanted your life. So sad. \n\nNever stay in the same house again, it’s not safe!!",
            "Single White Female vibes!",
            "Holy shit I thought about this the other day after reading your op not that long ago. Thanks for the update. Sorry your RM ended up losing her shit like that but at least now you know that’s who she is",
            "Go toss her room and get your things back.",
            "Sounds like she's got a lot of issues to unpack there. You dealt with this very empathetically and maturely, and I hope you are able to resolve the situation and get your stuff back",
            "Take pics of all your stuff where it is that she put in her possession. Text them to her. Take your shit back, put a lock on your door and keep food she could mess with locked up in your room. Get a mini fridge for your room. Remove all toiletries etc from your bathroom.  Keep locked up in your room. Have you ever seen the movie Single White Female? Watch it. She's nuts. She wants to be you, and have all that you do, and is willing to do whatever to get it. Scary.",
            "This sounds like some sociopath shit. Jeez I didn’t even consider a mental health aspect, and still originally said one of you had to go that this wasn’t going to get better. You’re too nice lol.",
            "I had a flatmate who had many disturbing behaviors, the most dramatic being she repeatedly tried to steal money. She'd borrow it, promising to pay back later via transfer, and then claim these vague \"bank errors\" as the reason she couldn't pay. She ended up owing several hundred euros to a former flatmate who contacted us for help because she moved out of the country, so flatmate was fully ignoring her texts and calls. flatmate was conveniently away and only returning to move out at the end of the month, but I had to hold her things hostage and demand the full payment in cash before allowing her through the door to pack and leave.  Anyway the point of this all is I recommend (if you can) locking the door from the inside and keeping a key in the lock- this prevents anyone from opening it, even with a key, from the outside. That way she can't show up unannounced.\n\nedit: removed word that on second thought isn't appropriate",
            "The Histrionic disorder isn’t far fetched at alllll",
            "Please get your stuff and do a more thorough search to make sure you got everything. \n\nChick has issues, no benefit in more confrontation.",
            "Also, you handled that awesomely! Your flatmate is lucky she crossed you and not someone with a worse temperament.",
            "You sound incredibly mature and kind hearted, and I wish you the best in life.",
            "Get your stuff back and try to find a friend or family member you can stay with. Leave a note saying, \"I know you took my stuff, I got it back, do not contact me or my SO ever again.\"\n\nIn some flats/apartments, you can pay a fee to remove yourself from the lease. See if you can do that. If not, ask your friend or family member if it's okay to sleep at their house until the lease is up and continue to pay for it.",
            "Good riddance. My ex best friend was similar. Didn’t have a situation with my boyfriend but she would get herself into messes and inappropriate situations then have a total meltdown when she got caught. Running away, threatening to kill herself. I also found out she stole $1,500 worth of money and valuables from my family when we let her stay with us for awhile. She told me she has Borderline PD, which I can empathize with but did not excuse her behavior. Especially since we forgave her after the first round of things she stole and then she stole more from us. It’s unfortunate that she’s going through a lot but you have no obligation to continue putting up with it.",
            "OP, get a lock on your bedroom door so if she comes back she can't take more of your stuff.",
            "Holy crap this escalated. I'm so glad you and your bf are on the same page this whole journey. Good luck on getting her out!\n\nStealing antidepressants???? There has to be a way to get her charged for something. I'd have called the cops or the landlord stat",
            "Oh wow.  I'm sorry, but I admire that you truly gave it your all to give her a chance.  But when you found she was stealing from you, she'd been making this bed to lie in for a long time.  My biggest suggestion.  Move valuables away from the house.  Move a week earlier than her so SHE has to to argue that it's hers and not the other way around.  Because once it's gone, it's gone.",
            "Check under her mattress for your things too, God knows what she squirreled away.",
            "I’ve lived with a friend who turned out to have the thief gene before, go get your stuff AND go through the drawers. They will hide stuff in weird places. I found a pair of shorts hidden in a suitcase years after she moved out. They will do things like hide your nice dress in a drawer under all of their old T shirts. She clearly didn’t respect your privacy or your health even if she was going through/stealing your medication.",
            "Hi! If it was me, I'd take my stuff back. I don't want do sound alll paranoid and stuff but there might be a chance that she just up and leaves with it, meaning everything of value to you in that room will disappear for possible all time.\n\nPlease be careful, as her behavior seems a bit suspicious. And definitively make sure your bf knows you don't blame him for anything. Victims of sexual harassment can feel like it's their fault and that their partner will be ashamed of them, even if they did nothing wrong.\n\nGood luck, friend!",
            "Please get your stuff,  make sure she doesn't have more hidden away, and don't let her live there with you ever again. What I find the creepiest is the part about touching your bf so intimately when you're out of the room—that's someone who wants to create a situation of deception and lies.  \n\nI'd call her rockstar Mother again to say, \"Thank you so much. Also, when I was in xx's room the other day, I noticed several items which had been taken from my room, including jewelry. Theft obviously \n violates the terms of our agreement, and we don't want her back here.\" \n\nThen arrange out when someone will come by to pick up her possessions. I wouldn't deal with the daughter at all from now on. No good can come of it.\n\nOh and change the locks, of course!",
            "This is quite the riveting story. \n\n\nYou have a great BF.",
            "This was a very entertaining read. I think you and your boyfriend handled this very maturely given her behavior. How embarrassing to have to have your mother called to come get you for this ridiculousness at 27 years old.",
            "Hell yeah get her outta here!! Gotta love those psycho chicks that think their crazy antics are cute 🥵",
            "Holy Single White Female.\n\nI’m sorry you and your boyfriend are going through this.  That is absolutely nuts.",
            "She sounds histrionic in her need for attention and immature belief that your boyfriend may be interested and her attempts to seduce.  Histrionic personality disorder could be caused by lack of a strong parental figure and she may have been sexually molested as a child. The lack of boundaries and her attempts to seduce your boyfriend plus the tantrum all point to stunted adolescence. I also wouldn't depend on her mother helping her get a therapist if she's already made it to 27 with this type of behavior. \n\nI would move out immediately with your boyfriend. She's going to be in a very self centered state and not take responsibility immediately. She will see herself as the victim here. You need to be calm, firm, and somewhat empathetic when you explain why you're moving out, if you choose to do so. \n\nYou may also want to inventory everything she's \"borrowed\" from you and let her know you've repo'd your things.",
            "She wanted to steal everything that was yours.",
            "I just want to say that you and your boyfriend have handled all of this like absolute champs. As bad as this was there were tons of chances for it to be so much worse.\n\nEDIT: What a weird comment to be downvoted.",
            "Good job for standing up for yourselves and standing your ground. Keep vigilant if she returns, she sounds unstable.",
            "Go through everything and take back everything that’s yours.",
            "Jesus Christ. Glad y’all are safe and rid of her!",
            "Hi, go get your stuff. Turn her room upside down to find out what else she took, too.",
            "oh damn, I thought she just was immature and had a crush but this lady has PROBLEMS. Yeah cut her off.",
            "Take your stuff back while you have the chance. Forget about proof, if she was going to lie she could just as easily claim you planted them there once she was gone.",
            "You might consider installing a lock on your bedroom door",
            "Girl, go get your shit!",
            "What a roller coaster. Shits wild.",
            "Talk about Crazyyyyy. Yeah cause .. no. Record. Get your things back. And cut all contact with her crazy ass.",
            "Your former flatmate sounds like she has Borderline Personality Disorder. I hope not for all three of you. It may be in your best interests to move and to cut off all contact. BPD individuals have a tendency to become stalkers. At the very least, change all of your locks as soon as possible.",
            "Wow I’m so sorry you’re going though this, I really feel bad for you. You and your bf handled it maturely and I hope it gets better for both of you. I just wanna say that your bf is a gem for being honest and transparent with you. He’s a keeper. Also, I’m sure you already did this, but please have a talk with him and make sure he’s okay. I’m sure your roommate’s behavior has shaken him up quite a bit.",
            "I am so glad this all turned out in your favor, eventually. If I were you I'd be SO afraid that my boyfriend would like the attention and actually play along with what housemate was doing. Man. Some people are real psychos, hope you'll get a better housemate in return xx",
            "Time to move in with your bf.",
            "Take your stuff back before it too late.",
            "Thank goodness you found out when you did. If she lied about having CANCER, just imagine the things she could say about your boyfriend. I wish you the best in finding a new room mate.",
            "Wow. At this point I don’t think it was invasion of privacy at all for you to go into her room - you were literally looking to retrieve your stolen things.",
            "So glad it had a positive outcome. Good call with contacting her mum. I can see how someone gets overwhelmed in a fantasy, but when she turned around and said it was so unfair that the guy she loves has a great GF, I would've lost my s\\*\\*t too. She made herself out to be the victim of witnessing your happiness. \n\nMake a video of you going into the room and taking back your stuff. Send her (And her mother a list of the things you found in her room) Get everything back before it vanishes forever.",
            "Take photos and take your stuff back. I know it's lock down but this is important so maybe get a friend round as a witness when you go search the rest of her room for your things. \n\nText her mum and tell her that you found stolen items in her room and ask her to keep an eye out for anything she doesn't recognise as being her daughter's. \n\n100% she will try and spread rumours about you. The truth is your best defence here. Get what happened out in the open with your friends asap. Get them to compare any stories she might have told them to find other lies. I doubt that leukemia is the only lie she's told lately. Getting what really happened into your friendship groups public knowledge early and getting evidence that she's untrustworthy out is going to really help there. \n\nFinally if possible, move out sooner. If you can afford to then get a new place and just pay the rent on both. If not then could you hire a storage locker and temporarily move in with a friend/family? Either way, tell the landlord what's happening. \n\nFinally give your poor boyfriend lots of cuddles and affection, and reassurances that he doesn't need to apologise.",
            "Yikes!!! Congrats on sorting out this mess. Sound like house mate needs some therapy, real quick.",
            "Sounds like histrionic personality disorder with Munchausen’s. You handled this situation like a champ!!",
            "She sounds absolutely awful. You were actually really mature and compassionate in handling her. I'd have knocked her teeth out.",
            "Holy shit dude!  Sounds kind of like a single white female thing, you're lucky it ended where it did.  She stole your meds dude, I'm wondering if that was some weird manipulation tactic to make your depression come back and cause damage to your relationship.  I would take a picture of everything you found, send it to her, and tell her she's not welcome back.",
            "Hope you took back your bracelet at least also though how can she prove you stole your own stuff back. It should have never been there in first place. Take ya stuff back",
            "Weird idea but I think there's a chance the person she likes is you. Between the theft, the idolization of your relationship, \"has a really great girlfriend\", etc, it's a possibility. I think in her head you two were playing house, and bf moving in broke the illusion. Then she projected her feelings onto BF",
            "This girl has an obsession with you and things that belong to you including your bf. She just wants him cause you have him. Damn fcking stealing. If you want to go nuclear then sue because if that were me I'd make sure she wouldn't come at me ever again.",
            "You should go photograph your stuff and take it and go through her room with a fine comb and look for other stuff she has definitely stolen off you. Video or photograph as you go.",
            "you are such a strong woman b/c i would've decked her! mental illness or not, she knows what she was doing was wrong. please go back in and search her ENTIRE room for your belongings!",
            "I'm all for the protection of other people's privacy.  However, once you've found stolen items, all bets are off.",
            "u should contact the police becuz she stole from u",
            "Whoa, I am so sorry she was sexually assaulting your BF on top of making him uncomfortable in general with what she said and her behavior. \n\nIf I were you, about your stuff, call her mum again and say that you hope roommate is OK and doing better, but you have discovered something else uncomfortable and need to tell her about it. Tell her about all your stolen items, say that you had noticed a shirt of yours while you were in her room with her, and after she had left you went in to grab it, and noticed more things of yours. Ask her what she thinks you should do, tell her the only thing you have taken back is the shirt for the moment because you didn't want to touch any of roommates stuff while you recover yours.\n\nIf mum gives you permission to take your stuff back, then take photos of what you find as you find it before you remove it so you have documentation in case roommate accuses you of anything. Or, mum will come back and help you go through her shit to find all of yours.",
            "As far as your guess of Histrionic, I don't think it's bad. I think you've pretty on the mark. The only other one I'd toss out there is Borderline. Glad for you that she's gone. Hope things level out a bit more now",
            "This is all very Single White Female. Be careful, OP!",
            "She’s lucky you are so compassionate. I would already have put her shit in boxes, taken all my (and partner’s) shit back, called the landlord to see if she could be taken off the lease early for stealing, and texted both her and her mom that she is not welcome to come back for any reason other than to collect her boxes. Creepy ass woman!",
            "Clearly you don't want to live with her anymore. \n\nShe may not want to give the flat up either, especially if she's been living there longer. I would definitely have a plan B of finding a new place in case she throws a hissy fit about keeping it.\n\n It sounds like a really nice place to live (without her).\n\nI imagine if she comes back in July and hears that she needs to move out in August that it might be pretty difficult for her since she's clearly already having a rough time.",
            "Maybe your new place should only be you and him. I think your relationship will really grow. Good job calling mom",
            "Wow! She sounds like an absolute nightmare. I'm glad you called her mom and got her mom to take her. This girl needs help and I hope she gets it. She sounds like she wants to be you and is very jealous of your relationship. I hope you find a new roommate who is hopefully normal!",
            "Well you are certainly better off. I would definitely go just get your stuff back. If and when she comes to get her stuff, she will like just gather everything up to cover up what she stole.  Get it back before she can. And I would suggest demanding to be in the room or at the door when she packs up, and flat out tell her you know she stole because you found stuff of yours out in the open, who knows what else she took that is hidden away.",
            "Unless you want to call the police and have her arrested for the theft, Go in there and go through all of her stuff and find everything that belong to you.  You have just cause because you've already found items that belong to you.",
            "It looked like she was trying to take your place in more ways than one. I wouldn't be surprised if she eventually took your identity so she could take your BF. That is a scary thought.",
            "I just want to say how Impressed I am with how you handled everything in the end.",
            "I deal with shit like this (meltdowns, weird surprises about people’s history) as hiring manager/HR for my job and i think you handled it well by calling her mother. There’s clearly something going on with her that has left her rather dysfunctional as an adult. \n\nIt takes many people a LONG time to really understand that *they* are the one’s causing trouble in their own lives. Hopefully she’ll get the help she needs.",
            "So if she pays the majority how are you gonna kick her out?",
            "I may be wrong but it sounds like she has borderline personality disorder.",
            "Time to go through everything in her room. Not kidding.\n\nShe isn't just obsessed with your boyfriend.  The way she acted is just a symptom.  She wants to be you because she hates herself and doesn't have her own identity.\n\nI remember your last post but this one with the stolen stuff adds a lot more information.  My sister's roommate was a lot like that and stole stuff.  Tried to \"steal\" guys she thought liked my sister, other things too that I won't mention.\n\nI wouldn't be surprised if there was also stuff in there from your friend  her former roommate.  So ask your friend if she noticed anything missing.\n\nThis poor woman has psychological problems.  It's not her being a brat she needs massive amounts of therapy.",
            "I’m probably not the first person to say this but this is seriously Single White Female irl",
            "i would 100% go back in and get my things. My roommate and I had a huge falling out, to the point where i was afraid to live with her. i moved my things out while she was at work because i was afraid she would follow me to my new apartment. I went into her room to grab some things i knew she had, because we were close and shared a lot of clothes, make up palettes, shoes, etc. i ended up finding a LOT more things that i never gave her permission to use, plus they were hidden in drawers or clothes she had worn but i hadn’t seen her in. \n\nthis also doesn’t sound like bipolar. i’m with you and thinking of maybe a personality disorder.",
            "How is it an invasion of privacy to take your things back, when she invaded your privacy to begin with by stealing said items? It's not like you're stealing. They are your belongings after all. If she moves she might keep your stuff out of spite. There is no need in my opinion to mention it to her because she didn't mention to you that she stole your shit.\n\nI don't really have anything to say about the bf situation as it seems to be resolved as far as the roommate issue unless she doesn't leave. You'll just have to be firm in not renewing her lease.",
            "She seems obsessed with you guys. I say keep yourselves safe because if she's already taking lots of your stuff, and is \"in love\" with your BF while still being able to tell you you're such an amazing GF, then one day this obsession might lead up to a kidnapping or something along the lines of *danger*. These things are real even if they rarely happen. Stay safe. Really.",
            "I might call the cops about her taking your meds. You want it in record that you didn’t give them to her.",
            "This happened to me too but my boyfriend kept it quiet for a month until I pestered him as to why she was acting weird around me. I don't think he realises it but he hurt me more than she ever did.",
            "You’re a very sympathetic and understanding person. Very well handled and I do hope she gets some help.",
            "I gotta be honest, this is how horror movies start. I don't want to jiinx it, but based on everything you have described about her, either she is bi-polar or have some mental issues that is just coming out. I hope she isn't one of those psycho girls you see in the movies with lipstick spread over her face screaming \"If I can't have him, no one else will!\"",
            "Yup. Just a trouble maker stirring shit up for the fuck of it.",
            "This is disturbing in a whole other level. Jesus Christ. Run away girl. Far far away.",
            "My god, I’m so sorry for you but “reader, I lost my shit” made me laugh hysterically.",
            "I’m in my first year of grad school school to be an LPC (definitely not an expert) but I thought of histrionic while reading your story",
            "What is wrong with that person\n Geez",
            "Wow wtf what a big time trip 😲",
            "Good for you, confronting her! And getting your stuff back, geez, she seems a bit unhinged. However, my one concern would be where you said you asked her to text you before she came back and that the lease “technically” ends in August. I’m not sure what you mean by that, but I would encourage you to be careful about not giving her any amunition for an illegal eviction hearing. You don’t want to lock her out of the house or work around iffy lease conditions and be stuck having to pay her reparations or something because, as she will tell it, you “kicked her out and barred her from her home during a pandemic due to a misunderstanding”.",
            "3 words: SINGLE WHITE FEMALE",
            "There is a movie called  The roommate on Netflix this sounds like a similar situation. Just be careful and at least you both agree what she said and did is uncalled for.",
            "Very well handled OP. Refreshing to see somehow handle a situation without turning it into a melodramatic opera. Best of luck",
            "sounds like she isn't the person who you thought she was!",
            "Oh my lord. I’m so sorry you had to deal with this, that is insane. Thank god youu called her mom honestly. Having dealt with many people with personality disorders she sounds to me like she has borderline personality disorder. Some people with that can mask the disorder for some time but when stressful events happen they can totally get triggered and do the most ridiculous things and act out. \n\nI hope she gets help too, good on you for getting the wheels turning for that to happen. I hope you won’t have to deal with her much more and you can continue on with your life without the unnecessary extra stress! You handled it really well.",
            "Youve been so kind to her in dealing with this really fucked up incident. Stand up for yourself and what's yours. She's a me tally unstable thief. Just go take your shit while there's less chance of confrontation and I'm sure it'll go smoother than trying to go through all of her things with her when she gets back. Good luck. Sorry your roommate is an asshole.",
            "The original post and update sounds like it could the beginnings of one of those Lifetime Movie Network plotlines.\n\nI'm going to agree with some of the other's here... Take the rest of your shit back now. It's no telling what else she's taken from your and your bf.",
            "Take pictures of your stuff where you find it and take it. Actually take a video of you entering the room and show your belongings and take them back. They are YOURS. Send a video to her mother and say you won’t be pressing charges as long as it’s clear that daughter needs to find a new place to live ASAP. Tell her you don’t know what your boyfriends decision is yet",
            "I understand the mental health, but do you understand she sounds crazy too? I mean she is stealing things, knowingly when to approach your boyfriend and has manipulated you in ways that now you feel sorry for her? She got you, I will say take your stuff and let her mother deal with her mental health or whatever issues she has, why are you feeling responsable?",
            "Get your stuff back but ensure you have proof, the last thing you need is if it all goes topsy turfy is legal issues. It's a really messed up situation and I feel for you, cut out the slackers and drips in your life, she doesn't deserve you as a previous freind.",
            "yeah.. she needs help for sure",
            "OP, I’m so sorry you’re going through this!\n\nMy ex step-sister (parents are now divorced) also had a habit of stealing my things. I initially did a sweep before she moved out because I noticed her wearing a shirt of mine and had mutual friends tell me she was bragging about me not noticing missing stuff. I didn’t want to believe it at all but when I went in her room, I found SO MUCH STUFF, and, like you, I decided to leave it be so I could confront her. But the very next day a very sentimental necklace went missing. I waited till she was out of the house and told my dad, then asked him to witness (and even film) me going through the room so NOTHING would come back making me look like the guilty one.\n\nI would suggest you go through her entire room before she comes home and either photograph each item that’s yours (while it’s still in her stuff before you take it back to your room) or just have your BF film the entire thing. When you find something that’s yours, Mental health problems etc. aside, this girl may have an addiction to stealing and you may lose things that you’ll never ever get back if you don’t!",
            "I would pack her stuff up for her. Just so you nothing else was stolen. Bummer about your roommate. I get covid has people thirsty or whatever but she was 100% wrong.",
            "She doesn't look like a very mentally stable person be careful lock your door when you fall sleep or you might find her inside your room staring at you and your bf",
            "This is why people need to get guns and carry at all times to be honest.",
            "She was trying to manipulate you by saying how hard lockdown was and then crying loudly and stuff. Also why would she take your stuff like wtf it sounds like she wanted to be you and so that came with wanting to be with your man. Its all messed up",
            "I had an old roommate steal from me. It sucks dude. She tried to commit suicide the morning of the day we were supposed to move out, so her parents (who were out of state) asked me to pack her things for her. As I went through I found a bunch of my clothes I thought I misplaced, including my favorite hoodie from my best friend, my shorts, some underwear, and a vibrator (who the fuck steals a used vibrator??? Ew.)\n\nJust take your stuff back, she’ll never admit to it. Good luck OP.",
            "Just take your stuff back!",
            "Not only did she steal your clothes, but she wanted to steal your bf too smh",
            "Absolutely make sure your medication is not in anything that could be considered her possession. You don't want some sort of legal he-said she-said where she accuses you of distributing a controlled substance in your name to her",
            "Go take your stuff back, it's yours. Otherwise, Jesus. I hope you get rid of this flatmate and out of your life ASAP.",
            "This sounds exactly like a girl I know, Whom I am convinced as a histrionic personality disorder.",
            "[removed]",
            "I find it so sad and disturbing that SO MANY people exhibit such mental instability to the point of creepy and dangerous. \n\nI mean, how the hell does their brain work? In what universe is it OK to steal and feel they are entitled to other people's boyfriends?\n\nWhat level of fucked up do you need to be to behave like that?  And the audacity to believe it's \"unfair\"....??  Wow...it just blows my mind...\n\nI was just reading yesterday about a girl who was living with her sister and the sister's boyfriend, thought she deserved him more and even got to the point of touching his genitalia while he was asleep! 100% unhinged. \n\nThis psycho needs to gtfo asap or you you wouldn't know what else she is capable of. I wouldn't put it past her to even consider physically harming you.",
            "I'm really sorry you are having to go through this.\n\nYou absolutely made the right decision to get her mom involved. She needs help and her mom can get that for her.\n\nBut THANK GOODNESS that lease is up in August! \n\nYou can use the time she's not there to make a plan and arrangements to get out.\n\nI also recommend keeping your escape plan private and set passwords for things. Make sure you both (your bf and yourself) have to authorize things. Just in case this roommate tries to pretend to be you or in case she comes back and tries to sabotage your plans.\n\nI'm so sorry your bf was having to deal with harassment. It's absolutely not okay what she was doing to him and I'm glad that he felt comfortable enough to let you know.\n\nNow you both can plan your next steps. \n\nHopefully she stays away and gets the help she needs.",
            "[deleted]",
            "This story isn't real. Wake up sheeple!",
            "I don't have much to say, as you handled this excellently. But I just wanted to applaud how considerately you handled your boyfriend's feelings and needs. It's horrible feeling violated, and often the last thing you want to do is confront the person who did it. You really dealt with this incredibly well, your boyfriend is a lucky MF and that girl just sounds unhinged. Calling her mum was the best thing you could have done.",
            "This is the most high school thing I've read in a long time. \n\nAlso - \n\n>I agree with the bulk of you that her continued touching is harrassment, and while a number suggested he just confront her himself, I empathise with being in a situation without breathing room where someone is sexually harrassing you.\n\nWhy can't a 31-year-old say \"Please stop touching me; it's inappropriate\" from the outset, instead of waiting and having a meltdown? I've been in the same situation - at work, even. I used my words and they stopped."
        ]
    }
]