[
    {
        "post_id": "60xit1",
        "author": "throwaway_9744123",
        "title": "[UPDATE] Me [20s F] with my fellow student [20s M], fellow student has a history of harassing women and is applying to become a teacher in our department. Should I do something?",
        "url": "https://www.reddit.com/r/relationships/comments/60xit1/update_me_20s_f_with_my_fellow_student_20s_m/",
        "score": 3428,
        "num_comments": 80,
        "created_utc": 1490217593.0,
        "selftext": "About a month ago I posted about my worries on [here](https://www.reddit.com/r/relationships/comments/5uq0sv/me_20s_f_with_my_fellow_student_20s_m_fellow/). \n\n**tl:dr** of original: fellow student often harasses young female students and was applying for a job that would put him in a position of authority over exactly those students he targets. I felt I needed to do something to prevent this from happening. \n\nMy special thanks go out to /u/time_keepsonslipping and /u/Pillbot10011 who had a very, *very* good discussion on sexual harassment in academia and how this was quite a 'damned if you do, damned if you don't' situation. However, they did help me see that I actually had a solution that was staring me right in the face. \n\nI went to my mentor, a male professor who's high up the management ladder and actually even responsible for HR for the part of the organization that concerns this story. (Like I said, the solution was *really* staring me right in the face.) I trust this man and I knew he would believe me and follow up on my worries without a second thought. \n\nI wasn't wrong. I went to see him and simply told him something was worrying me deeply and I needed some advice, after which I told him the story. Now, you should know, this man is a very calm and funny guy. This was the first time since I've known him to find him go quiet and to see anger build up in his eyes. \n\nHe asked me for the name of this person and I told him who it was. Then he told me he will go to HR straight away to ask about the status of his application, and if needed would use his executive position to veto the application. \n\nHe came to see me the next day to tell me the department had already turned down the guy based on his qualifications, so in the end, I was worried for nothing. **However**, we started talking about the subject of (sexual) harassment students may face and how they feel rather helpless because they don't really have anyone to turn to and the system actually discourages students from speak up about it.\n\nTurns out this professor has been very, *very* active in trying to implement integrity and equal opportunity policy on a university wide level, but this was only focused on staff, not students. He took it upon him personally to see policy will be revisited on a university level to also include protection for students, not just staff and that he would use my example as the reason why we need to do this as a university. He also told me that in terms of short term action he would personally go to each department head that falls under his jurisdiction to discuss this matter.\n\nWhen I spoke to him again some time later, he told me the department heads weren't really open to even acknowledge the problem (surprise, surprise) let alone do something about it. But he's not the kind of man to take no for an answer, so he's planning to go over their heads and develop some management tools for the whole organizational unit that he hopes will also affect the individual departments. \n\nIn the end, I am really glad I took action. Even though in the end, action wasn't needed to prevent the thing I was worried about, I think me speaking up to my mentor has triggered some processes on different levels in the organization that will hopefully lead to some change. I know from experience that this is a very slow process, and I won't notice much change before I'll leave my university, but still, a start was made. If anything, it will lead to more awareness of this issue on different managerial levels. I'm quite happy with how everything turned out. \n\n**tl:dr** - Had a chat with a professor I know high up the ladder in management. Turned out, fellow student wouldn't have gotten the job anyways. However, my chat with that professor triggered - I hope - positive action on a broader, university wide level that will hopefully lead to some positive change in the years to come.  ",
        "permalink": "/r/relationships/comments/60xit1/update_me_20s_f_with_my_fellow_student_20s_m/",
        "comments": [
            "Your university is so lucky to have this guy in the faculty. Good news.",
            "Thanks so much for speaking up for other females in the department, and possibly risking your career. \n\n\nI'm glad that your mentor takes the issue seriously and is trying to change the culture.  \n\n\nGood luck!",
            "As a young girl in undergrad who wants to go into academia, knowing that there are people like you and your mentor in the world give me a lot of hope that my experiences won't be the same as those before me. Thank you!!! ❤️❤️",
            "Even if it was unnecessary now, you might have saved future students from harassment by putting these changes in motion. ",
            "This is a great to hear update. It's very heartening and it makes me feel like at least some benefit came from my experience in my last semester at my program. I am psyched that your mentor immediately recognized that harassment isn't only manifested in asymmetrical relationships but also horizontal ones. The only thing I would say to keep in mind is that ensuring that the management tools are in place doesn't ensure they'll be used. And that selling yourself as a department that takes these issues seriously can be a bit dangerous, because it makes people feel like they can come forward without repercussion and then they get smacked in the face with unexpected repercussions, which was my experience. HOWEVER. All in all, this is a very heartening update.",
            "I admire you so much for taking a stand. Your mentor is a good man, too. It's great to hear that there are some men out there who believe women and take harassment seriously. That's depressingly rare in academia (and tech, but Uber is a story for another day...)",
            "As someone who got sexually harassed by a professor and watched that professor get nothing but a slap on the wrist after reporting it, while I failed the course, dropped out of university, and had my life ruined... Thank you. ",
            "This is one of my favorite updates ever on this sub <3",
            "Great news thank you for coming forward.",
            " You and that prof are both awesome people. ",
            "I work in reeearch/academia. Thank you for this!",
            "Thank you so much for speaking up. It's people like you and your tutor who instigate an institutional change in attitudes towards sexual assault and harassment! ",
            "Your teacher needs a cape.\n",
            "Good work you! And your mentor!\n\nYour university is lucky to have both of you. ",
            "Good on you! I like to be the one to give advice or hope someone else does something, but sometimes I know that it's me or no one who's going to stand up and do the right thing. I think this is an instance where you stepped up to the plate and are making a difference, and you should definitely feel proud of yourself! Also, it seems like this is a pretty deep issue, as your professor divulged, and you being part of the solution is a huge step for your entire educational institution. Just look up the 80 professors who have been caught with child porn in the last decade - it's pretty scary what kinds of things are NOT making the news.",
            "Your mentor sounds like a great man.",
            "You and he are heroes to me.  \n\nYou, with no power, stood up and spoke to someone WITH power, not knowing if there would be any fallout against you.  That takes bravery.\n\nHe, with power, chose to use it to improve the world, and actually put himself on the line in case of repercussions, all for the sake of others.  That takes bravery.\n\nThank you both for being in this world.",
            "Thanks so much for speaking up. It may not seem like much to you, but you got the ball rolling, and now your mentor is using the info you gave him to use his much greater relative social power to move toward a positive change.",
            "Wow, good for you. Much respect! ",
            "You. You rock.\n\nIt's always the hardest to be the first one to speak out, but you did it, and that's both brave and awesome. \n\n",
            "echoing what everyone else has been saying, good job standing up for women. ",
            "Wow! You made a difference, OP. Your professor sounds like a freaking awesome human being, and so do you!",
            "Your mentor is amazing, I hope he knows that.",
            "This internet stranger is very proud of you. Little steps like these accumulate and make all the difference.",
            "Holy god! Thank you to you and your professor-mentor!!",
            "Open-source get the courage award!",
            "I am thrilled that you did.  ",
            "It touches my heart to see people like you taking action. Sexual harassment is real and so is sexual violence. maybe you and this mentor can create a sexual violence peer education type of thing - we just started this in my school and I am so excited for it. Definitely lookup universities who may have it. This is very amazing of you! ",
            "Thank you for speaking up. You took a big risk and lots of students will benefit in the future. ",
            "I literally got chills reading that, because apparently that's what my body does when my brain says \"Fuck yes!!\" that intensely.  \nSo proud of you for taking that action, and so incredibly pleased that there are men out there like your mentor that will fight for women to be treated fairly and be protected from harassment. ",
            "[deleted]",
            "I'm so proud of you, OP. I'm sorry this is happening, but I'm glad there are people like you to speak up and people like this professor to use their powers for good.",
            "I love happy endings!",
            "Well done, as a woman in academia I applaud you. \n\nvery very well done",
            "Yes. Make sure you get legal and advise from above!",
            "[deleted]",
            "[removed]",
            "[removed]"
        ]
    },
    {
        "post_id": "atg5kc",
        "author": "hellywelly",
        "title": "UPDATE - My (30f) sister (33f) periodically fires verbal abuse at me and blaming her psychiatric disorder (BPD). I can't bring myself to forgive and forget.",
        "url": "https://www.reddit.com/r/relationships/comments/atg5kc/update_my_30f_sister_33f_periodically_fires/",
        "score": 3426,
        "num_comments": 90,
        "created_utc": 1550832710.0,
        "selftext": "Link to original post - https://www.reddit.com/r/relationships/comments/as8ijf/my_30f_sister_33f_periodically_fires_verbal_abuse/\n\nI'd like to say a massive thank you to everyone who took the time to respond to my post! I was over the moon with how many people replied. The advice I received was very insightful and useful. I used bits of everyone's answers to compose a letter to my sister before speaking to her on the phone. The letter consisted of sentiments of love and understanding, but also emphasised how her behavior has to stop, and that she needs to seek DBT therapy. I also set very specific boundaries in place and asked her to agree to them. I gave her a heads up via Whatsapp that the email had been sent to to ask her to read it and think on it before we spoke.\n\nHer reaction was very positive -\n\n\"I just want to say thank you, thank you from the bottom of my heart, for writing this letter. I am so incredibly grateful and so moved, that you would do this for me after all I have said to you and on top of that having to deal with being sleep deprived and having baby issues. I honestly I am in tears right now because I truly thought that I would have to try and rebuild our relationship on my own and honestly I haven't got the tools or knowledge to know how to do that and I've been so stressed not really knowing what to do or say but knowing that I need to resolve things. I also knew that we needed to set some rules and understandings to help you cope with the situation should it happen again and so I know the consequences if things get too bad and this will hopefully help me to get myself out of it. We'll talk more about this on the phone but this is so good for me. Sorry I haven't covered everything in your email but I don't have much time, just on my lunch break. But I wanted to thank you for taking the time to research and then write down your thoughts, it does mean a lot because you mean so much to me and I don't know what I would do if we didn't keep in contact, not saying that to hold you emotionally hostage or anything, I would be ok, just know that you mean alot and it's incredibly important to me that I stay on good terms with the family. We can discuss the therapy thing when we talk. Hope you have a good day xxxx\"\n\nI'm so happy that she didn't misinterpret anything from my letter and that it went down so well. Good people of Reddit, you may very well have saved my friendship with my sister! I'm very grateful! Let's hope what she says is more than just words and are turned into actions. Have a lovely day, everyone!\n\nTLDR - After receiving Reddit advice, I wrote a letter to my sister. She was very happy and has agreed to improve.",
        "permalink": "/r/relationships/comments/atg5kc/update_my_30f_sister_33f_periodically_fires/",
        "comments": [
            "I love a happy ending like this! It might not be smooth sailing as your sister does have strong emotions, but this is such a heart warming response. Yay for sisterhood!",
            "Yay! So happy to hear that. It might be hard for her to suffer the consequences of your boundaries, but in the long run it makes sure no resentment builds, so the relationship is so much healthier for both of you!",
            "[removed]",
            "Wow what a mature response from your sister.\n\nI grew out of my BPD diagnosis and what helped was being told by my psychologist that my anger outbursts were in fact fear and that my breakdowns were actually panic attacks. I still struggle with fear to this day, a decade later, but not the destructive anger outbursts.\n\nSometimes just understanding why you react the way you do is enough to work on it, I wish the best for you and your sister ",
            "I am going to recommend when you do talk, that you make sure that Therapy is definitely brought up again and that you establish that going forward if she doesn't have a plan of action for it that you will need to back off.  I wish you the absolute best but I also hope you keep your boundaries clear and you enforce them if necessary again. ",
            "That is a lovely response and shows the love you share as sisters. It’s a great start to what will hopefully be a good journey together and for her separately. Keep strong with your boundaries and ‘punishments’ and make sure you look after yourself first. \n\nAfter reading the first post I agree that you have done the right thing and have had some great advice. My extra little bit would be that maybe you might find it cleansing or relaxing to share some former problem areas in a supportive environment like r/BPD or r/justnofamily. Not to bring up bad memories but to release them in a freeing way. Even just writing them down in a book and maybe burning it afterwards could help. To ‘get them off your shoulders’ kind of thing. The action being symbolic of a fresh start for you and your sister. \n\nI wish you both happiness and love in your future relationship 💜",
            "I am so happy to hear that.  \n\nI(30F) am pretty sure my sister (27F) has undiagnosed BPD (doesn't do the self harm that I know of, but does a LOT of self-sabotage, lashing out in anger, deep insecurities about being abandoned, uncontrolled emotions, etc.)... she won't go to therapy, is resistant to getting a job (was fired from her last one and now lives off her boyfriend)...\n\nI've decided that instead of trying to \"fix\" her, which is what my mom and dad do a lot of (because that is their job I suppose), I've decided to just be a good example and encourage her.  I know she's resistant to help but there is nothing I can do except be there for her if she asks, hang out with her (but don't rely on her), and just keep it light and in small doses. \n\nI hope one day she can help herself, but I now know there's nothing else I can really do.",
            "Damn. We see a lot of 'faux-pologies' round here, so it's genuinely lovely to read a REAL one. You both did wonderfully here, and I wish you both luck going forward. Your letter will likely really help her future work on herself, as it is a tangible reminder that she is loved and will not be abandoned.",
            "I'm sorry I missed your original post, but just wanted to chime in as someone who is happily married to someone living with BPD. Counseling has taught us both a lot and our communication styles have changed a lot and improved our marriage. My biggest takeaways:\n\n1. It's important I validate his feelings instead of try to disprove something just to make him feel better. (i.e. \"I'm sorry you're feeling that way, what can I do to help?\" vs. \"Don't be silly, you shouldn't have to worry about that\")\n2. I am not responsible for his feelings! I encourage him to work it out on his own, but I no longer get sucked into it or try to fix it.\n3. I haven't even had to do this in a long time but, stick to your boundaries! We have outlined what is and what isn't acceptable in our marriage and I don't cave.\n4. If he says he's feeling overwhelmed or needs space, I give it, no questions asked. I don't push arguments and allow him the time he needs to process.\n\nIt's worked out great for us and we have so much fun together! Sending good thoughts to you and your sister!",
            "This was totally unexpected! I have similar problems with my sister (bipolar), so I think I'm going to try this. Thank you for sharing.\n\n&#x200B;\n\nWishing you both the best!!",
            "Unfortunately,  people with BPD have a tendancy to destroy close relationships. I know this, as I have been the destroyer and have BPD. She has to want to change and get help. It's not your responsibility and by no means are you required to endure it because you're family.",
            "Wow that is amazing news! My sister does the same and refuses to see it as anything other than my fault, so we don't have a relationship anymore. I wish you two the best on improving your relationship! ",
            "So glad your sister took your thoughts positively!\n\nReading your first post is actually super relevant to me right now, because my mother has BPD, and I am bipolar, so our dynamic has been very similar to how you describe yours with your sister. I've recently been just fed up with being the more mature one in my relationship with her and struggling with how to approach her with basically saying, \"enough is enough.\" \n\nI'm going to read through some of the suggestions on your first post and try compiling a letter to her. I hope it will be as well received as your sister's was.",
            "The only thing I would like to add is, as hopeful as it sounds, it will still be a long journey ahead. Not to be cynical but BPD is still at times very challenging, so expect that there will be setbacks. I wouldn't want you to feel so hopeful and immediately return to square one once your sister is unable to regulate her emotions again. But good on you for continuing to try and hope things will progress in the right direction.",
            "I'm so happy the situation had a happy ending. ❤  Huzzah!",
            "[removed]",
            "i’m so proud of both of you. bpd is super rough but i’m glad your sister is practicing self awareness—that’s a huge step in the road to coping! ",
            "So happy you got a positive response from your sis! My brother has it and we have never been able to get along because of it. \n\nIn reading your original post, the one thing I wanted to add was that when she has outbursts, she likely means those things in the moment she feels them, and then those feelings dissipate and she doesn't mean them later. \n\nMy (toxic) brother's version of this sounds like, \"You're such a whore, that's obviously your ex boyfriend who posted on your Facebook (...nope, that's a friend from childhood summer camp, but I digress) and you don't even care that your husband can see because you're so disgusting and selfish\" and then a day later, \"You're so pathetic and sensitive! Good god, how can you stand to live with yourself when you can't even take a joke?\" I'm guessing as your sis works on coping strategies and relationship building with you, her apologies will be a lot better than my brother's variety 😂",
            "I’m glad she’s seeking help. I was about to say BPD isn’t an excuse. I have it, and DBT DOES help! I hope she gets better :) ",
            "Jesus that is a better response than I would have ever expected.  I am so happy that she at least took the right first step.  Good luck guys!",
            "that's fantastic! DBT therapy is awesome. I'm co-facilitating a class on it today for people with addictions. It's life-changing if she's willing to put in the work. Just know it will take time for her to build those skills. ",
            "How amazing is that reply?! Sis took responsibility and acknowledged how important you are to her!! Hopefully, she follows through and this can be a new, wonderful beginning for you two!!  All the best  :)",
            "Mental illness does not give you a get out of jail free card for being a jerk. Yes, it does make things harder sometimes. But to just act however scott free? No. It should be worked with. And I'm glad to see that this is your case! Hopefully everything works out!",
            "As someone who also has a sister with BPD this made me cry.  I'm so glad she was able to hear what you had to say & good luck to you both!!",
            "I hope it does go better, but I'd just caution you this love bombing and hoovering are part of the abuse cycle. It's extremely likely she'll go back to her old ways within a 2 or 3 weeks once she no longer fears you leaving her life. It's literally how BPD works and anyone who has lived through the horror of loving someone with BPD knows this stage all too well as it sucks you right back into their toxic behavior. There'll be excuses to not get therapy and rationalizations of why you deserve her abusive behavior once again. \n\nNot saying it's impossible to improve your relationship with your sister, just be prepared for it to get real hard again in a couple of weeks. As others recommended, get some books on how to deal with BPD people and set and keep very firm boundaries to protect yourself. BPD is never ever an excuse for putting up with shitty abusive behavior. You gotta have empathy for yourself. Good luck.",
            "Don't take this the wrong way but something about the wording of response puts me a little on edge. She says that you need to have boundaries set 'to help YOU cope with the situation.' This makes me feel that in therapy she may push all the fault on you, but I'm not a therapist and I have no training in this so my opinion isn't worth much and I'll probably get downvoted for this but I feel you need to be careful moving forward. ",
            "Apologizing means nothing if actions don’t change is what I’m saying. Someone actually doesn’t want you too keep apologizing if your actions do not change. I meant what I said that if someone generally loves you they will ultimately work with you because it took me a long to realize that I was actually the problem. And all of those apologies leading up to that meant nothing before I was just doing it to do so as it seems. There are no red flags, it’s just real life my guy.",
            "This makes my heart so happy. Good luck in this new phase of your guys' relationship :)",
            "This brings me such joy for the both of you.\n",
            "This is one of the most heartwarming, mature updates I've ever seen. Go you OP for still being able to reach out (AND set boundaries) after being so hurt, and go your sister for being so level-headed and insightful in her response. I hope you guys have smoother sailing ahead. ",
            "excellent. \n\nkeep to your boundaries, and that will help her with hers, and this might be the best of times for you both. ",
            "R/bpdlovedones is a good one but they're a bit harsh",
            "Love this. I went back to your original post and read through because I also have a sister with BPD and needed to read this. ",
            "I have bi polar schizo effective disorder.  Blaming her illness to shoot personal attacks at you is an excuse to cut you down to make her feel better, she's just being an asshole.",
            "Best of luck dealing with the borderline sister. ",
            "My sister has a social dysfunction that she blames on every one else. So I have taken her lead and blamed my own disorder on every one else as well. This makes everyone else give my sister a hard time for setting a bad example for me.",
            "My 37 d has BPD and BP, it is agonizing.  She blames me for everything bad thing in her life. Have you read \"I Hate You,Don't Leave\" it helps explain some. But life never gets easier. She hasn't worked in 4 years. ",
            ">I honestly I am in tears right now because I truly thought that I would have to try and rebuild our relationship on my own and honestly I haven't got the tools or knowledge to know how to do that\n\nI just want to point out that this is incredibly self-aware and introspective. From someone who's been in therapy for most of their life I just want to say I'm deeply impressed at her self-awareness. It's actually one of the more important and helpful tools she's already got that will help her heal.\n\nGood for everyone! ",
            "BPD is hard. Expect ups and downs. It's really hard sometimes. ☹️",
            "This is beautiful, thanks for updating! ❤️",
            "I just realized I do this...and I know I have bpd..I always think I'm being rational because I was feeling \"fine\" before but looking back now I could have handled it better...",
            "If she truly does have BPD, then her acceptance of her disorder is amazing, if not rare. My mom is BPD but, like most, don’t see it’s a problem. So it goes. \n\nI hope for the sake of you both that she is able to adhere to your boundaries. I wish you the best of luck and all the positive vibes I can muster. ",
            "[deleted]",
            "Read walking on egg shells. Saved my sanity in dealing with my bpd mother ",
            "[deleted]",
            "There’s different spots on Reddit u can post just type in the type of mental issue and there should be a group for it on reddit usually..",
            "[removed]",
            "Put a bar of soap in sock. Works every time.\n\nEdited to add: Then, definitely, do not beat her with it when she goes to sleep"
        ]
    },
    {
        "post_id": "3tbtre",
        "author": "sadwifeconfusion",
        "title": "I (36M) snooped and found out that my wife (33F) of three years has been living some kind of sad double life and is not who I thought she was.",
        "url": "https://www.reddit.com/r/relationships/comments/3tbtre/i_36m_snooped_and_found_out_that_my_wife_33f_of/",
        "score": 3423,
        "num_comments": 168,
        "created_utc": 1447872936.0,
        "selftext": "Throwaway because the wife knows my main. Sorry in advance for this rambling mess.\n\nSince my wife and I got married three years ago, things have been…off. I know that people grow and change with time, but around our wedding, my wife changed drastically. She bleached her dark brown hair blonde right before the ceremony, and I honestly thought I was in the wrong church for a split second when she came down the aisle. We moved into our house right after the honeymoon, and she went into full domestic mode. We’d shared cleaning duties before, but once we moved into the house, she became INSISTENT on doing everything before I could even get to it. Since this is our first house, I thought it was some kind of homeowner nesting thing, but it never stopped.\nHer hair color is none of my business and I think most people would be happy not to have to clean, so I honestly didn’t really think much of either of those things at the time. The big thing has always been how closed off she got after the wedding. When we were dating, she’d tell me long rambling stories about her feelings and rant to me when she was upset and all that, and I liked hearing about what was going on inside her head. After the wedding, that stopped pretty abruptly. If I ask her how her day is, she will only ever tell me that it was “fine!” or “super!” She doesn’t talk to me about her feelings anymore, ever, even when I explicitly ask “how do you feel about x?” She also stopped telling me about anything important that happened to her. About a year after we got married, her grandfather died. Did she tell me she’d lost her grandfather? No. She told me that she had to go to a conference for work on the other side of the country, which I thought nothing of. On the second day she was gone, her older brother texted me to tell me that my in-laws had really missed seeing me at the funeral. When I called her to ask why in the ever loving hell she didn’t tell me, and then LIED about it, all she would say was “I didn’t want to trouble you. You have a lot on your plate”. After that, she went on a couple of “spontaneous family trips”. She’s really, REALLY close to her family, so the first time she said she was going camping with her brother at their alma mater, I didn’t think a lot of it other than to be slightly disappointed and confused that I wasn’t invited, because her brother’s cool and the three of us go camping together a lot. But the second time, I started hearing alarm bells. \n\nI’d like to say I’m a more secure man, reddit, but after the second “spontaneous family trip”, my wheels started spinning and I started to think that maybe she was cheating. This was a weird insecurity in the back of my mind for a while, since she wasn’t showing any other big signs of cheating (she wasn’t guarded about her phone and hadn’t changed her routine/appearance). A few weeks ago, she told me she was pregnant. I was over the moon about it until I asked her how many weeks along she was, and she nonchalantly said “about 12 or 13”. She’d been pregnant for like three months before she even bothered to tell me! She’s not really showing at all, and she doesn’t usually drink, so I had been completely in the fucking dark. I honestly hadn’t even suspected. \n\nThat was kind of it for me. I was sure she was cheating, and that it wasn’t my kid. I thought there was no possible way that a woman would keep her pregnancy a secret from HER HUSBAND for three months. So I snooped. Yes, I know I was wrong, but I wanted proof that she’d been having an affair before I moved out. One of my best buddies from college is a divorce attorney, and when I asked him what I should do, he sent me the info for a key logger. I installed it on my wife’s laptop and was prepared for the worst. Now, I feel like what I found is somehow worse than her cheating. I didn’t find any steamy messages, but I found out that she keeps a diary in a word document that she writes in every day. I know I should have just stopped once I knew she wasn’t cheating, but once I saw my name in her diary, I couldn’t stop. I read all of it. All seven separate documents, going back to way before we’d even met.  \n\nTurns out she’s not cheating. She’s depressed as fuck, hates herself, and has absolutely no trust in me. All of the stuff I’d been confused and bothered by has some kind of sad, self-loathing explanation. She hates having blond hair, but she writes “I know he’d divorce me if I went back to being a brunette, because wives are supposed to be blond” almost every week. The “wives are supposed to be” thing is tangled up in everything. She thinks wives are supposed to be quiet, which is why she doesn’t talk to me anymore. She thinks wives are supposed to “make things easier for their husbands, not harder”, which is why she didn’t tell me when her grandfather died. It just goes on and on and on. She didn’t tell me when she got a huge promotion and a raise because “he’d leave me in a heartbeat if he knew I made more money than he does. Men can’t handle that”. It hurt to know that she thinks of me as some kind of one-dimensional 1950’s husband, and I’ve been wracking my brain to think of anything I could have done to make her think this way. \n\nWhat I can’t handle is that she’d lied about the big stuff. I honestly don’t know if I can forgive her for not telling me about the miscarriages. The “spontaneous family trips” were actually her miscarrying two of our children, one at five weeks, the other at about 10. She went and stayed with her parents while she was recuperating, and her brother and sister came to support her. But not me. I didn’t get to be there for her, because she thinks I would leave her immediately if I knew that she’d “killed” our children. She’s convinced that she caused both miscarriages because she smoked pot for a long time before we got married. For what it’s worth, it sounds like her family tried both times to get her to tell me, but she wouldn’t. She finally told me about this pregnancy because her parents threatened to tell me she didn’t. \n\nI’m just absolutely fucking dumbfounded. I don’t even know what to think right now. I’m just so baffled because everything she says about me in her diary is insanely nice. She goes on for pages and pages about how much she loves me and how she thinks I’m her soul mate and how she would do anything for me. I just can’t understand why she thinks that I would leave her. Knowing that she’s spent the last three years walking on eggshells around me, convinced that I would leave her at the drop of a hat is just so…confusing and awful. I feel like our marriage is some kind of lie. The woman I thought was self-confident and ready to take on the world is actually full of self-loathing and really, really, REALLY depressed. I don’t know her at all. She’s been suffering silently with depression long before we met. She has no faith in me, no trust. She thinks that every hug and kiss I give her and every “I love you” I say is a lie. \n\nI just don’t know what to do. She obviously needs serious help, but I don’t know how to get it for her. I can’t tell her that I read her diary. If she has zero trust in me now, I can’t even imagine what she’d think if she knew if I read six years worth of her private thoughts. I feel like I need to get my in-laws on board somehow, but I don’t know what to say to them. I know I can’t ignore this, but I feel like any move is the wrong move. What do I do??\n\nTl;dr: thought wife was cheating so I snooped and read her diary. She's actually insanely depressed, has secretly miscarried two of our children, and doesn't trust me one iota. How do I get her help without making things worse?\n\nEdit: after I posted this I realized I'd kind of omitted the deal with the key logger. It's worse than it sounds, honestly. After it showed me what she'd written that day I went onto her computer while she was sleeping and opened up Word. I saw that she had several documents called \"diary year x\" so I downloaded them all onto a flash drive and read them at work. I went too far, I know.",
        "permalink": "/r/relationships/comments/3tbtre/i_36m_snooped_and_found_out_that_my_wife_33f_of/",
        "comments": [
            "I think I'd consider discussing everything you know with a professional, and see what they suggest the next step is. ",
            "Counseling. Right now. She needs way more help than you or her family can give her. ",
            "Woahhh, that is some really bad depression. She needs major, major therapy, and you both need couples counseling. She's lying to you about very important things in your life and is internalizing a stereotype that wives should be like a 1950s housewife (why is she thinking this in the first place if that's now how she was before marriage?). You need to tell her about what you've read and that she needs separate therapy and you both need counseling together.",
            "She needs therapy. She needs serious, intensive therapy. And you both need counseling together. \n\nHer views on marriage and how to treat herself and you are incredibly unsettling and unhealthy. She needs professional help. \n\nBlaming herself for miscarrying, suppressing her emotions and self hatred are all heart-breaking. Please get her help. And yourself help. And your marriage help. ",
            "Wow. This is way above reddit's pay-grade. I agree with the other posters. She needs counseling ASAP, and it probably wouldn't be a bad idea to get into couples counseling. \n\nGood luck OP, hopefully she gets the help she needs. ",
            "Normally I'd say reading a diary is a bit of a violation, but in this case, I think it may have been necessary.  Your wife is obviously very unhappy and skilled at hiding it, and there was no other way you were going to know.\n\nI'm not sure how you go forward on this, though, because you're right: if she doesn't trust you now, finding out you read her diaries for the past several years is hardly going to help that.  I'd say you should talk to your in-laws first, but let them know that you are primarily concerned about your wife's/their daughter's health and happiness.  \n\nI'm so sorry both you and your wife are going through this.  I will say that sometimes, there is a huge cultural pressure to be a certain way once you become a wife.  Whether it's a general cultural perception, social media influence, or family expectations.  It doesn't have to come from your husband, so don't beat yourself up over that if you really can't see that you may have influenced those thoughts. ",
            "Don't beat yourself up over the snooping too much.\n\n1. You knew something was badly off, and it *was*.  You weren't being paranoid.\n2. Also, she's the woman you love, whom you married, and who needs your help very very very badly right now.  If you use the information you gained to control her, or to be abusive, or to exploit her fears, then sure, you're the world's biggest dick.  But if you use the information to help her...then...good?  Your marriage vows probably said in sickness and in health, and she's sure as fuck sick right now.\n\nBeing married does mean that your spouse gets to make some decisions on your behalf in some cases.  And this is a crisis; sometimes you have to cut a corner or two.\n\nGoing forward:\n\n1. You're right, you can't just tell her\n2. She needs serious professional help, very badly\n3. I think you need to get her family on board.\n\nBasically, I think you should reach out to them behind her back, tell them the gist (they already know a lot of it), and then between you all you can collaborate to find a way to get her the professional help she needs.\n\nImportant stuff to keep in mind:\n\n1. This isn't really her \"fault\", any more than having asthma is her fault.  You probably feel a little hurt and betrayed that she didn't turn to you for help with this problem, but in a very real sense, the core problem is that she *couldn't* turn to you for help.\n2. This is probably pretty urgent to fix.  Especially if she's pregnant.  If she miscarries again it could do a lot of damage to her; if she carries to term she's at serious risk of post-natal depression.  Either way, lives are possibly at stake; she needs help.\n3. This is fixable.  May not be fast, probably won't be easy, but modern medicine can do a lot.\n4. Once the serious \"holy shit\" stuff is sorted, couples counselling is probably called for.  There's a lot of rebuilding that needs to be done, once the two of you are capable of being on the same page.",
            "Christ on a crutch!  Get her into therapy ASAP.  Someone long ago fucked up her idea of marriage and is causing her to miss out on so much in life.\n\nDon't even mention the diary.  Put it to her as you feel like you are not doing something right as a husband and you want her to be happy.  Tell her that the couples therapy is the only option since she will not open up to you.  Once in therapy, paraphrase things from the diary just to lead the conversation.  Leading with the diary will only cause her to retreat further.",
            " “I know he’d divorce me if I went back to being a brunette, because wives are supposed to be blond” \n\n\nThere is a lot of good advice here about therapy and talking to her and such, but I would also encourage you to suggest she become a brunette again somewhere along the line. If she obsesses over it that much, maybe you telling her you want her to be that brunette she thinks she can't be will be a small token of you loving and accepting her.",
            "Aside from the counseling, which is a fantastic recommendation, how are you with her parents?  If you get along with them, I think you should call them and share with them what you found, and see if they have any insight.  She's obviously been telling them much more than she's been telling you.  \n\n",
            "I don't think you have the room to lie to her here.  She needs serious help, and I think she's only going to get it if you're very very honest with her.\n\nTell her everything.  From the beginning, just like you did here.  Reinforce over and over how much you love her, then make an appointment with a therapist for her.  I'd start with couples counseling, just so you can go with her and express your concerns - make sure she doesn't gloss over things.\n\nI'm also concerned that you don't have *time* to be super gentle about it.  If something happens - I hesitate to say \"goes wrong\" - during or after the pregnancy, something like post-partum depression, on top of her already crippling issues.... she may not be able to handle it at all.  Pregnancy is so hard on a woman anyway, all her anxiety and depression may be magnified just by being pregnant.  I assume she's been going to her doctors regularly?\n\nI wouldn't get the inlaws involved... yet.  If she starts going to treatment and improves, she'll be happy you didn't embarrass her to them.  If she refuses treatment, you can get them involved as reinforcement.",
            "I used to be similar to your wife. It's strange, kind of like a perfect storm that creates someone like this. My mom was feminist/homemaker, too. My parents are outwardly \"happy,\" but there's a lot of negativity and tension inside the marriage, and she may have had a similar experience growing up. It sucks when your parents are basically living a lie, and that's the impression of marriage you grow up with. \n\nIn my teens, I gravitated toward bad relationships, some abusive. They just further pushed me into depression, and I naturally fell into the \"everything is great\" homemaker role where I would give more and more and they would take advantage. I was trapped so far into my mind it was hard to get out. \n\nFast forward to now, I've been in therapy for two years, and a healthy relationship for one. I would not be where I am now without my amazing therapist, who has taught me boundaries and self-worth and communication. I would not be where I am without my amazing boyfriend, who helps me practice what I learn in therapy. I still have issues relating to my past, even after all these years, but I'm finally learning to untangle myself and get out of my damn head. I can speak my mind now. I am happy. I am authentic. \n\nPlease get her into therapy so she can see what kind of life is possible. Help her find happiness. ",
            "You are trying to apply a logical solution to a very volatile situation and person.  She clearly doesn't think healthily, so while you approach the issue logically and healthily, DO NOT be shocked if it does not go well.  The trap is, you now know these things and feel an obligation to fix it.  And while that is admirable and awesome of you as a person, you can't let it destroy you while you try and save someone else who may not be ready for saving.\n\nThis situation screams Talk To A Professional(s) before making any moves.  \n\nAlso, I realize you feel like you have something to lose by telling her about your researching what she was up to, but truly, you aren't going to risk anything that wouldn't have happened no matter what you do, how you frame it, or how you approach it.  You don't have that power, especially in dealing with someone with this skewed of a thought pattern.  \n\nThe important thing is that you eventually tell her.  Both for your own well being and conscious, and because hiding things from her is just as bad as her hiding things from you.  \n\nA slight chance here that if she knows you \"goofed\" up in life in your relationship with her, she may feel a lot better about her goof up.  Then again, that's somewhat applying logic to a situation that is so clearly not lending itself to linear problem solving.\n\nGood luck to you.  Please don't strangle yourself in trying to help someone else.  Professional help seems like a must in this situation.",
            "That kind of ingrained belief system is coming from somewhere - likely childhood.\n\n\nShe doesn't trust or love herself, so it doesn't make sense that anyone else would. The only way the logic makes sense is if she believes you don't really know her.\n\n\n\nShe has GOT to get into therapy, like yesterday. Take her to a couples session. Tell her \"A husband is supposed to take care of his wife\" if that will help. Tell her you read her diary when you're with the couples therapist. Tell her you thought she wasn't interested in you anymore and that's why. \n\n\nOr, print selections of her diary and go to therapy yourself and ask the therapist what to do next.\n\nTherapy is the ONLY answer.",
            "Goddamn. I wish I knew what to tell you, but I am stumped. \n\nShe's not well mentally. That much is clear. But it's tough to know how you can broach the subject without revealing that you read her diary, which may not be the best thing for her to learn right now. \n\nWhatever her diagnosis is, she's suffering from some pretty insane delusions. I understand you feel betrayed by her lies, but there could be something much more serious going on. \n\ntalk to a professional before you do anything else. ",
            "As others have said, your wife needs councelling. It might be hard, but try not to be angry at your wife for withholding the latest pregnancy. I've been through miscarriages with my wife and it's difficult to know when to announce a successful pregnancy (I was nervous the entire pregnancy with my son, right up until he took his first breath). There's not a good way to announce a miscarriage and even though she should have told you, she was obviously in a bad place (not telling you stuff like that is a symptom of depression). \n\nYour wife needs help and she needs it now. This needs to be dealt with before delivery. You do not want to wait until post partum. She may need antidepressants -- you both should do research on what the risks/benefits are (and unfortunately, it can be difficult to tease out because of how medications are rated for pregnant women). ",
            "I kind of wondered if that might be it (suddenly insisting that she does 100% of the cleaning, weirdly chipper attitude all the time, blonde hair). \"Wife\" status can put a lot of pressure on already insecure women who feel like if they don't do this and do do that their husband will leave them immediately. \n\nYour wife CLEARLY needs counseling, which you already know. What if you suggested \"couple's counseling\" and then kind of segued to individual counseling after that?",
            "I've been dealing with depression and it's just so hard to understand how much it completely screws with your head, your perception, and your decision making until you're in the midst of it yourself.  \n\nYour wife isn't lying to deceive you.  She loves you and doesn't want to burden you with what she's going through.  Talking about depression with someone who's on the outside is just... well, it's about the hardest thing I can imagine.  \n\nAs someone who has been down that rabbit-hole, please try not to be angry with your wife about the deception.  She's hurting, badly, and she needs all the love and support you can give.  \n\nSerious therapy for her and for the both of you is the best step you can take right now.  I really do wish you all the best.\n",
            "I'm so sorry for her. She must feel so trapped. And I'm very sorry that you had to learn about her this way. It must have been such a shock.\n\nIt is true that you violated her privacy and she may be very very angry about that. It takes a lot to rebuild trust. I do agree that you should consider speaking to a professional first, without her, so you bring this up with her in a constructive way. For the time being, would you please buy her some flowers and give her a hug for me?",
            "Therapy, therapy, therapy.  And be prepared for a long recovery time.  She's buried herself pretty deep in her facade and it's hard to undo that considering she more or less got what she wanted from her efforts.  She didn't cause you any trouble whatsoever.\n\nI'm just trying to figure out which Stepford wife in her world kidnapped and brainwashed her hours before the ceremony.",
            "The first thing you can do is suggest casually that you miss her old hair colour. If she thinks she has your permission, and even encouragement, to go back then she might do it. Seeing her old self in the mirror every day could have a big positive impact on her without you having to give away that you read her diary.",
            "As pretty much everyone else is saying, therapy/counselling is a must, right away. \n\nI don't think anything else will help and even therapy will take work and time. \n\nI guess the good you can take from this is at least you know she loves you. She's just got some issues she is dealing with. And it sounds to me like you're at least willing to go through it with her, since she's not cheating on you. \n\nGood luck man, hopefully your next update is a good one. ",
            "I totally understand the feeling, especially with how much and how serious the lies are, that she is doing this to you. But as someone who has experienced serve depression and anxiety I wanted to try to provide you with another viewpoint, so you can see that most likely isn't the case.\n\nWhen I am in the midst of my depression I am literally a different person. Even though I go through periods of normalcy, when I am depressed I have always felt like this and it will never end. It taints all my memories and makes me absolutely sure that I will always be like this, things will never change and I am a terrible person who deserves to feel like this. You are tired and angry and so sad you just want to scream and scream because there aren't any words that can express how badly you feel. You feel like your heart is being crushed in your chest and there is nothing that makes that feeling go away. Everyone knows how awful you are and you are a burden on everyone around you. The people in your life are so close to leaving, because really you are so awful, they should leave you. At my worst, I would beg my boyfriend to leave me.\n\nIn this state for me, it is difficult to get out of bed or to eat. Brushing my teeth or showering is an accomplishment. Going to work and being polite to everyone and not letting anyone see you cry is a marathon. \n\nI felt like this even though I was in treatment with a psychologist/therapist and a psychiatrist. I would see my therapist weekly and was on some pretty heavy medication. \n\nMy depression came out of genetics and some difficult things in my childhood. I have worked for years to get myself into a better place, and I can say that I'm not perfect (and I never will be) but there is a light at the end of the tunnel.\n\nSo although it is totally natural to see this as her doing this to you, you have to trust me when I say that it isn't really about you. In her reality, she is doing this to protect you from the evil inside her head. It doesn't make any sense and it isn't rational but she is so far inside her own head she can't see that right now. \n\nShe obviously needs serious help. I'm not sure what the best course of action would be, but a great place to start would be NAMI- the National Alliance on Mental Illness at 800-950-6264, Monday through Friday from 10 a.m. to 6 p.m., ET. They also have a lot more information on their website (which I can't link) at nami.org They have a specific section for family member and they can refer you to more resources specifically in your state. If you need help finding resources- PM me your state and I can find some more specific stuff. ",
            "If you want her to be completely open and honest with you, then you should be completely open and honest with her. All I see here is a man who truly loves and wants to help his wife, and I think telling her all of this is the only way to do that. You can't go on like this, and she definitely shouldn't without getting serious help. Were you aware of any psychological problems that she may have had before you got married? \n\nI don't think it's a bad idea to talk with her family and get them involved, especially since she really seems to trust them. But I think you should talk to her first. Explain that you invaded her privacy because of how secretive she's become, and that you were concerned. It may not justify it, but I also think it's pretty reasonable based on what you've said here. \n\nAlso, I know its hard, but try not to take her trust issues with you too personally. When you're severely depressed and filled with self-loathing it is impossible to understand how anyone else could love you. ",
            "I'm crying for your wife and I hope that you can work on your marriage together. To be trapped in her own mind must be absolutely terrifying and now she probably feels like it's been too long to confess everything, so she doesn't. Counseling is absolutely necessary, both individual and couples.",
            "I'm echoing what everyone says on counseling, but please give her a chance to work through all this with you. It sounds like she does love you so much and is terrified about losing you. I don't think she's been lying to you to be malicious or because she doesn't trust you. She just has no self-esteem for whatever reason. Stick by her, do nice things for her when you can, reassure her about the things it sounds like she was concerned about, such as her hair. I think you all can make this work. Best of luck!",
            "Well, I think she needs therapy - like, yesterday - but I see what you mean about not wanting to break her trust. Consider telling her, gently, that you've been worried about her and so went looking for clues to her emotional state. Definitely ask and see if her family has noticed any changes in her behaviour. Maybe if they're worried too they can suggest she sees somebody.\n\nWhile you think about ways to get your wife the help she desperately needs, how about looking for opportunities to reinforce more positive behaviour? Work at drawing her into a conversation about her day, get as much out of her as you can, and then tell her (cheerfully, casually, *not* like you're trying to make a point) that you love hearing about what she's been up to.\n\nCook together when you can, find an opportunity to take on some of the cleaning yourself, and if/when she objects tell her you want to take some of it off her plate - \"We both work, seems fair that we share the cleaning too!\"\n\nI'm guessing she has to maintain her blonde hair, have you asked her whether she's considered going back to brunette?\n\nAll of these are potential ways to treat some of the symptoms, but the underlying cause is probably beyond your ability to deal with. She needs professional input on this, I think. What's her parents relationship like? Is it very traditional?\n\nI haven't touched the pregnancy thing, but with the cocktail of hormones that will be going on in her body right now this could be a particularly difficult time for her. Keep an eye out for any more changes in behaviour, start finding ways to get her help and try to model a healthier relationship for her from your end. That's all I got.",
            "Your post made me cry. Your poor wife. \n\nSee this is why gender roles are toxic bullshit. She's so wrapped up in this stupid false ideal that it's hamstrung her. She loves you, clearly! \n\nSuch a sad situation. Above my pay grade, for sure, but I'll bet others will have some good advice for how to address this going forward. My instinct is to go find her and tell her the things you've said here, then hold her, and reaffirm that you love her independent of these ideas.\n\nAnd maybe couples' counseling can give you guys the tools for becoming emotionally intimate again. \n\nI'm sorry, my heart is so sad for you guys.",
            "Man She needs some help, best of luck to you, I myself would maybe find a way to talk the family into getting her into therapy. Tough position your in. I know I'd be floored if my fantastic wife was in a similar situation. ",
            "Nobody on this thread is going to be able to diagnose what is wrong. It sounds like either she is suffering from psychotic depression or was raised with an incredibly disturbing view of what it means to be a wife. I don't think you went too far considering her odd behavior. I think you need to get her to see a therapist and probably a psychiatrist. If you frame it as a problem in your relationship rather than a problem with her it may feel less threatening and if you also attend counseling it may make her more likely to agree.",
            "You need to find a way to bring this up to her, but tell her you aren't mad.\n\nthen she needs to start seeing a therapist, and then when she is used that you both need to see a couples therapist and work this out.\n\nShe sounds unstable and should be medicated.",
            "Talk to her. Sit her down. Tell her to dye her hair back. Tell her you know about all these details, and you don't care - or even, they make you love her more. But tell her all of it. This will help her understand you seriously do care about her in every way. She has serious issues, but she loves you, and she needs to hear from you that you love her for what she is.",
            "first, you need to have a serious conversation with your wife, the focus of this conversation is getting her to understand that you are there for her, that you love her and would support her through her troubles, that that is what husbands and wives do, support each other. this conversation needs to last as long as it takes for her to understand that you aren't going to punish her for her troubles, and that the only thing you are upset about is that she thought you wouldn't care. this is priority one. 'im here and im not going anywhere, come back to me'.\n\nsecond, professional help. this is a seriously deep rooted self hatred that *will not be solved by the first conversation*. this is something that is going to take years of therapy, both couples counseling and individual.\n\nsupport from her friends and family will help too, you aren't in this alone. \n\nalso, be prepared to deal with her turning this on herself, possibly every step of the way. your resolve will likely be the first step to her *seeing the truth* of your relationship, and ultimately her decision to live with a better, mentally positive, self image.\n\nbest of luck to you both.",
            "First step is, stop making this about you. It's not you. It's a darkness in her head; don't get insulted that she thinks this way, she's seeing everything through darkness.  Don't get huffy about it, she's being blinded by this sickness and can not see true. She _loves_ you. Concentrate on that.\n\nShe needs therapy, intense therapy and probably antidepressants, IMMEDIATELY.",
            "wow... that is a **serious** mental illness.\n\nWay above anyone on reddit's paygrade. Hire a professional of mental health for your wife. She needs it.\n\n\n>She obviously needs serious help, but I don’t know how to get it for her.\n\nwell... she is obviously willing to do a LOT to keep you... so just tell her she needs to see a specialist. From what you posted here it sounds like she would do anything you would ask her to.... which is not normal but you can use to her advantage... I guess... man I don't envy you at all this situation is really messed up! Best of luck!",
            "There is something very wrong with your wife. Please get her help.",
            "I wouldn't feel bad about the keylogger. You needed answers for yourself and your future children, and there was no way you could have found out otherwise. It turns out she really *needed* you to invade her privacy so that you can get her the help she needs. It was a breach of trust, yes, but a necessary one. I'm hoping you two can get through this!",
            "You should talk to her family too in addition to all the other stuff you have been told here. ",
            "Oh wow. Yeah. Get to counseling stat. It sounds like she needs it. And so do you.",
            "Depression is very often misunderstood.  Everyone gets depressed.  When you get depressed for more than a couple of weeks, you are moving into the area of major depressive disorder.  It's not just about being sad.  The brain chemistry changes.  You NEED to get her professional help as soon as possible.  If she is clinically depressed, you will be saving her life.\n\nedit: i don't know how you can best approach her about what you know.  However, you guys should see a psychiatrist before seeing a therapist.  If it's clinical depression, medication may work (it might not, treatment is different for everyone).  However, i think it would be best to see a doctor first before seeing a therapist.",
            "You're a good guy.",
            "OP, please seek therapy for yourself. Your wife changed immensely after marriage and you have never brought yourself to even ask her about just her hair color, much less her complete taking over of the chores, and also her complete lack of communication with you. You sat back and let her take over all the household chores, even though she works as long hours as you, if not more, and her job is as hard as yours or harder. She stopped telling you ANYTHING about her feelings. And you never even asked her WHY she became completely different. You NEVER asked her why she wasn't confiding in you anymore. At ALL.\n\nYou write: \"She has no faith in me, no trust. She thinks that every hug and kiss I give her and every “I love you” I say is a lie.\" YOU changed COMPLETELY! NO normal conversations, NO chore sharing, NO information about her job or her health. You say she has \"spent the last three years walking on eggshells around\" you: that is because you stopped caring about her, or at least, completely stopped communicating and observing her--and started letting her take complete care of you as though you were her child. NO WONDER she is so worried and thinks her marriage is destroyed! \n\nDo NOT EVER print out her diary and show it to ANYONE. It is NOT yours and you have NO RIGHT to show it to her parents or anyone else in her life or even her therapist. Please destroy your copy immediately. She is no danger to herself or others. Do NOT betray her further.\n\nPlease stop talking about \"treating\" HER and about \"committing\" HER. You say you have known her and loved her for 6 or 7 years--and you haven't even had a conversation with her about her feelings in the PAST 3 YEARS? \nEdit: for length and repeating ",
            "You need to talk to her parents and brother. Explain what you discovered. Leave out how you discovered her diary, obviously. Gameplan. Fix this.",
            "I honestly think you need to reach out to her family because everyone needs to come together and figure out what is best for your wife.  \n\n\n",
            "You need to confess, but at the same time confront.\n\nBasically tell her that you need to have a serious talk with her and want you both to sit down this evening to have it.  When you sit down you begin with how much you have seen her attitude change since getting married.  Say that you love her no matter what but you felt like the girl you wanted to marry was not the same person as the one who showed up on your wedding day. \n\nTell her how humiliated you felt to find out that her grandfather had passed from her family.  Married people are supposed to be a team and her lying to you about that is 100% unacceptable.  Then mention the family camping trip and how you were hurt that she had not invited you along.  Say how you were feeling about 2 those trips, the truth. \n\nThen mention the second trip.  and say that by that point you were 60% sure that she was cheating on you.  Then the pregnancy happened.  She was so far along and you did not know at all, you thought that given all the lies to date this baby might not be yours and so you did something bad.\n\nNow is where you confess.  You say that you are incredibly sorry for what you have done, and you hope that she can forgive you.  But your state of mind was that you knew she was lying to you and so you started doing some snooping to find out for sure.  Tell her you found her diary and have read it.\n\nNow you understand that she has not been cheating on you, but you are confused.  In your mind the most important duty that a husband and wife have to one another is to tell the truth.\n\nYou understand that she is depressed.  You understand that she is afraid you will leave her.  However the actions she has taken in an attempt to preserve her marriage have put the marriage in danger.  You are not interested in being married to whatever she thinks a \"wife should be\".  You wanted to marry the girl she was before the wedding, that's why you asked that girl to marry you.  Whoever it was who showed up to the ceremony and every day since, is someone else. ",
            "Someone got into her head and fed her all of this nonsense. This is just so sad. She needs therapy. ",
            "It sound like your wife suffers from impostor syndrome, where no matter how successful or capable you are you feel like it's all an act and you greatly fear being exposed as some kind of con artist/charleton.  You need to come clean to your wife and get her into counseling immediately.  This goes far beyond normal eccentric behavior.",
            "I know reddit loves to diagnose everyone and their dog as borderlines, but... I have a friend who is borderline who has a lot of these thought patterns. The blonde hair thing in particular jumped out. Whatever your wife's issue is, she needs a lot of therapy. You might need to get her family on side with you as well in order to get her to accept help. ",
            "I think you should be honest about getting the diaries, but not about the key logger. \n\nI think you should tell her that everything she's doing that she says she hates are things you don't want or need. You can say you like her as a brunette and that her obsession with being a perfect housewife and not telling you anything that might worry you has actually caused you to have concerns that she may be cheating instead of making you think the marriage is perfect.",
            "Any chance your wife was born in Asia?\n\nAlso, who the fuck put these crazy ideas in her head?  You need to find that person, magazine, or whatever it is and root it out.  That shit is toxic.",
            "You already have all the answers you need on here but I get so confused why people always apologize for snooping on their SO's stuff. If they're being shady and weird enough that you feel it's necessary to do to find out what's going on, you have the right...",
            "depressed and pregnant - this is drown the kids territory. girl needs to see a head shrink like yesterday",
            "There's a lot of sane responses here.  So I'm gonna go the insane route.  I think you're being had.  I think you should dig deeper to ensure this isn't something to throw you off her trail.",
            "Yeah get her to a psychiatrist asap. This is the type of shit where one morning you wake up and she's sitting on you holding a meat cleaver.",
            "Unless she decides to pursue some kind of case against you for the keylogger (which your divorce attorney buddy could presumably help you handle), I don't see how you can make things worse than they already are.  Tell her the truth.  Admit that the snooping was messed up, but so is feeling like you don't even know your own wife - and you're even more horrified that she doesn't seem to know you either, if she thinks you wanted all these things that are the exact opposite of why you fell in love with her in the first place.  You don't want some 1950s Stepford wife, you want *her*, flaws and all.  Then ask if you two can start from square one, starting with therapy for her and counseling for both of you.  If she won't, then unfortunately, I think you may have to view her fears as a self-fulfilling prophecy and go.",
            "I have to get something in my stomach before I finish reading this. Brain is weak. all I have to say is that I'm so sorry dude. I read about 75% of it.  The only point I wanted to make now , until reading the rest is that you keep saying \" i know i shouldn't have\"  \"hair color none of my business\" etc. The way that she was acting anyone would think what you were thinking. And the hair color? I'll take heat for this comment. That's your wife. That's a big change. You have reason to be upset.  \n\nBecause i havent read the whole thing yet, im unsure of the question ( if there even is one or you are just venting)    Its clear that she loves you a lot, and that you love her a lot.  if your question was  \" do i tell her \"  I strongly suggest NOOOOO  ....   for now..  I assume ppl are going to say that you have to tell her. But bro, you gotta keep that to yourself.  You can NEVER tell her about the keylog.   ( a fav of mine btw in a real crazy relationship i had..  gd one by ur buddy  : )  )   This deal needs to be thought out very patiently.  Be back to read the rest.  That was a deep post.  You seem like a real good dude.  And btw, ur wife seems like a very kind woman that loves you very much.  I was positive I was going to read that she was having a lesbian affair.  that wasn't the case.  Don't wrap this up before thinking long and hard.  "
        ]
    },
    {
        "post_id": "4pn07j",
        "author": "Grad04",
        "title": "[Update] My best friend [22F] of 16 years who has never shown interest in me surprises me [22M] at my graduate school apartment and seduces me into a friends with benefits relationship.",
        "url": "https://www.reddit.com/r/relationships/comments/4pn07j/update_my_best_friend_22f_of_16_years_who_has/",
        "score": 3414,
        "num_comments": 168,
        "created_utc": 1466776844.0,
        "selftext": "Original Post: https://www.reddit.com/r/relationships/comments/4dh3b3/my_best_friend_22f_of_16_years_who_has_never/\n\n\nThe previous from my first post **TL;DR:** my best friend of 16 years who has never shown interest in me shows up at my college apartment one day and randomly has sex with me. She's been coming over pretty much every other day since the semester started. I've liked her for years but she won't give a definitive reason as to what this means or where it's going and it's scares me.\n\nDespite most people including many of my closest friends telling me to just end things with her or force her into a decision, I decided to just ride it out accepting that I'd probably get tossed to the side when someone better came around for her. \n\nWe went on to be FWB for about 4 months and those were honestly the most nerve-racking months of my life never knowing when or if it was going to end or what she was really thinking. I tried my best to play it off as if it didn't bother me but really it was a bitter-sweet time for me.\n\nAfter our school semester ended we drifted a part a little bit, we both were spending time with family and friends. We both had extremely busy semesters and spent most of the time studying or with one another so it was expected. \n\nShe ended up going on vacation with her parents to visit her grandparents in England. She did invite me to come along months ago but I already had other obligations so I couldn't go with her despite wanting to.\n\n\nWe did talk on the phone a few times while she was away, I actually had annual soccer tournament with my traveling team and we met this all girl's team at the tournament that I was telling her about it since she plays soccer as well. \n\nShe seemed happy for me that I was having fun but I could tell that it was bothering her I just chalked it up to maybe I sounded like I was bragging or something.\n\nTwo weeks later she asks me if I can pick her up from the airport because she flew back early and she nearly knocks me over she hugs me so tightly. She never shown so much intimacy in public before she even tells me that she really missed me. \n\nIt's like 8pm and we go to Starbucks she's being like really different, a lot quieter than normal and she seems a little nervous around me like she wants to say something.\n\nEventually she confesses that she realizes that she does like me as more than just a friend and she apologizes for her unfairness making me wait so long before giving me an answer. \n\nShe tells me that before she left she didn't really know what she wanted, she didn't know if she wanted a relationship or if she was ready to be in one. She said that she was afraid to get into a relationship with me only to realize that she didn't want it and feared that our friendship would be never bounce back.\n\nShe told me that she experienced a lot of things in England and was sad that she wasn't able to experience them together. She talked to her older sister who lives in England who really put in some good words for me. \n\nSo we're officially dating and everything has been awesome, couldn't be happier. Sorry if this update is bit lacking, I tried to summarize three weeks worth into this post without making it a novel. But if you have any questions about anything just let me know.\n\nThanks for the advice on the original post really gave me some solid perspective.\n\n**TL;DR:** We're finally dating and everything is great. I guess it pays to be patient sometimes. We'll be celebrating our first month on the 1st of July.\n",
        "permalink": "/r/relationships/comments/4pn07j/update_my_best_friend_22f_of_16_years_who_has/",
        "comments": [
            "Congratulations. Hoping for the best!",
            "I'm happy for you! I'm glad you waited it out, it seems like every post on relationships has a hoard of people saying break up no matter what the scenario is. Congrats ",
            "This is awesome. How did both your family's react to the news?",
            "[removed]",
            "Good for you!\n\nI've been married to my very best friend long enough that we have grandchildren together. It's the way to go",
            "Congrats on (all the) sex.",
            "My dad asked my mom \"Do we really want to mess up our friendship?\"\n \nThey are messing it up for the last 30+ years and still going at it, me and my brother being the proofs of how messed up their friendship got :D\n\nSo congratulations!",
            "Glad everything worked out, but this:\n\n> decided to just ride it out accepting that I'd probably get tossed to the side when someone better came around for her. \n\nIs just fucking sad man. You need to work on improving your opinion of yourself if you were willing to just let that happen.",
            "Congrats!\n\nBut... Be wary of people who aren't interested until someone else is in the picture.",
            "i read your original post and came back scared to read this! SOOOOO happy to see an awesome update!!! congrats :)",
            "YAYYYYY awesome update!!! I wish you both happiness (:",
            "sometimes people meet and they hit it off immediate and it's smooth sailing, sometimes you take the long way to get there - either way you got there. good for you.",
            "We're all happy for you, but now you're aware than any \"couples\" argument would likely lead to her avoiding you because she doesn't seem to like direct confrontation. Work with her on this.",
            "Every.  Single.  Responder.  To the original post told you to dump her, this will end badly, etc, etc.  I kind of think r/relationships is broken, honestly.  Such a preponderance of cynicism in this community.",
            "I swear these updates where people ignore the top comments advice are always for the better ",
            "I'm so happy this worked out for you! Her reason for holding off seems legitimate - or at least, I'm empathetic. I've been in that place before. When you have a good friend, and romantic feelings begin to develop, there is indeed a gnawing fear that when she goes south, you lose not just a romantic partner but a (in your case lifelong) companion. I hope everything works out for you, and good on you for sticking it out, and good on her for not dicking you around either. I wish you both the best on your new adventure!",
            "I'm so happy for you!  My husband and I dated once when we were much younger, but after we broke up remained FWB on and off for the next 8 years or so.  I ended up transferring to the same university as him because there are only 5 schools in the US that have my major.  We remained FWB for almost 6 months before we started dating, he proposed to me very shortly (within 4 months) after we started dating.  We just got married 2 weeks ago, and we could not be happier.  I'm so excited for what the future holds for you and your girlfriend!",
            "It's nice that your story has a happy ending.",
            "Super happy for you! Wish you both the best! ",
            "I'm sooooo happy for the both of you!",
            "Yay!!!! Not expecting that! Go you!",
            "Lacking my ass... It had everything. Including sex! ",
            "This is close to what I experienced in college as well. Best friend (girl), then FWB besides her knowing I wanted more. Glad to say I'm still with her almost 20 years later and married the last 10. Could not be happier it worked out that way. Hope it does for you as well. ",
            "Congrats on the relationship, I'm glad something good came out of this. And hey, you've got an easy anniversary to remember too! ",
            "Sometimes people are just a bit scared of intimacy!",
            "This is almost exactly what happened for my current relationship. Lol",
            "I love stories like this, there's always something, while very cute and romantic, very hot too about your situation being FWB with a childhood friend so suddenly and then finally getting together...I'm so happy for you! My husband and I are similar; we were close, best friends for about 3 years, then we started to mess around a little and gave eachother our first kiss, then a little bit later we became official and yesterday we celebrated being together for 5 years and we just got married in February! I think it's the same for you where, when you're with someone who's always been your best friend...its an amazing feeling...you already know everything about each other so there's no awkward 'dating' or gradually finding out they do things that drive you crazy; you will still learn so much together, you'll have conflicts and disagreements, but it's easier I think and goes better when you're core is being great friends.\nI hope you two have a happy, long relationship!!",
            "\nI wouldn't say this update is lacking, I would say happy updates or updates with almost 180° turn arounds are the absolute best. Especially because it's like the happily ever after story; guy falls for girl, girl thinks guy is cute but just great friend, time goes by then something clicks, then girl goes off to foreign country, friend/sibling + distance smacks girl to reality, then plane ride home = happily ever after. There's your romance story.\n\nNow go make some kids you lucky people you!",
            "This girl could honestly have been me a few years ago. For whatever reason I had to work out my fears and insecurities about a certain guy while still actively casually sleeping with him. How crappy I made him feel when I was refusing to date him is not one of my proudest times. \n\nNow we've been married for two years and we have a baby on the way, and I'm so happy I finally figured out what I wanted. ",
            "this is honestly like one of my day dreams w/ one of my old best friends who'm i kinda drifted apart from. I'm super happy for you OP! ",
            "Dude thanks for some good news..... Congradulations buddy.... Love is a beautiful thing and we are happy for you.... Thank you for wrapping up my week with a love story\n\nYou rock",
            "Just from skimming the story it sounds like you both had deeper feelings that needed to and finally came out. Way to go!",
            "In the words of Steve, \n\n\"Both men and women want to have sex. It's natural, except we're on different timetables. Women want to have sex, like, y'know, fifteen minutes after us, so alright, if you hold out for twenty she'll be chasing you for five.\"\n\nSeems like this is more or less what happened to you. To attain the sex, you must first lose all desire for the sex. ",
            "Here's to hoping none of the millions of shitty things that can happen, happen. Cheers OP!\n\nI do want to touch on this: \n\n>I decided to just ride it out accepting that I'd probably get tossed to the side when someone better came around for her.\n\nI hope you realize now that you **are** that guy. It's obvious in your statement that you place her on a pedestal and that's fine, but I really hope you start to recognize your own worth and stop putting her out of your league. You did it! You and you alone and, best of all, you did it by being yourself. Don't second guess and let insecurities get the best of you. She chose you, out of every guy she knows, she chose you. If that doesn't get you high af on life then idk what will. Try not to lose sight of that!  ",
            "If she had officially called you her boyfriend she would have had to stop fucking all those other people.",
            "Don't start celebrating stupid things like \"weeks\" or \"months\". Needlessly romantic things like that are just going to set a expectation for a specific standard. Not to mention something like a month isn't any sort of amazing period of time. It takes a lifetime to know someone, a month is nothing more then a drop in the bucket.",
            "That is AWESOME  MAN!!!! yay for you. Disregard my personal message. I sent it before reading this update.",
            "Yay! congrats dude, im so happy for you!",
            "You must be feeling great! Congrats!",
            "Good things come to those who wait.\n\nSometimes. :)\n\nGlad this worked out for you!",
            "Congrats dude. All the best for you guys!",
            "Feh, \"lacking.\" It was perfect. Congratulations and enjoy the ride!",
            "Thats so cute! Congrats for the both of you!",
            "I read your original post and was hoping this is what you'd do. A few months of bliss aren't worth not experiencing just because it may eventually come to an end. Lucky for you that's not what happened, and it you'd given her an ultimatum you'd likely be in a very different position right now.",
            "Yay! Happy ending! ",
            "Congratulations! ",
            "Question, and feel free to ignore it if you want to stay private about your sex life. Is sex better before or after becoming official? Is the new intimacy better than the FWB and sneaking behind everyone back? ",
            "Strange way to a happy ending but totally happy for you",
            "Good thing this has worked out so well for you both!!\n\n*I love happy beginnings!*",
            "Dawwww. All the best OP <3",
            "Congrats man sometimes it does pay off waiting for the right one, got a picture of her you would like to share just curious what she looks like",
            "So what is the problem here, exactly?",
            "Let this be a lesson for all. Fwb = true love. Congratulations bro!",
            "Congrats buddy. The same thing for the most part just happened to me. Liked a friend for a while. Played it chill and the other day she said she loved me. Never thought this day would come... For atleast me and her. :)",
            "Really glad to read! Congrats to the both of you and great wishes!",
            "That's great! :) Although my situation is completely different from yours, me and a long-term close friend have currently been dating for a little over 9 months now and we're still going strong. People always say that the best relationships are built on friendship, and I believe that. I really hope it works out for you two. :)",
            "This is an amazing story. Congrats! Sometimes the good things are worth waiting for.",
            "I congratulate you man! Best wishes!",
            "Just go with the flow man. Congrats. Enjoy yourself. ",
            "Congrats man! Best love story 2k16 :)",
            "Fuck yeah man. I'm really glad it went the way it did, I think you played this perfectly! ",
            "Hell yeah!!!\n\n*brofist*\n\n*high-five*\n\nHapy for the both of you!!",
            "Congrats. Dont forget to be confident. You seem a little down on yourself all the time. That isnt healthy for you or a relationship. Remeber to be yourself! ",
            "As someone who has been dating their best friend for almost five years now: I'm so happy for you two. :-)",
            "Fuck man I am so jealous. Happy for you!",
            "Yay!!! So glad you both are together! ",
            "I didn't see your first post so couldn't comment but my advice would have been to wait it out. My hubbie and I have been married 10 years this October - 14 years ago this is how we started out. \nCongrats OP.",
            "Proud of you. Sometimes you gotta look beyond labels and enjoy the moment. Glad it worked out well",
            "The rare stories where two fwb progress to actual relationships! So happy for you OP. Thank you for starting my weekend off with a happy story ^ ^",
            "I'm glad everything worked out!!\n\nI never saw  your first post, but I probably would have told you to wait out out a bit (like you did).\n\nMy husband and I were best friends, and then kind of did the FWB thing for about 8 months before becoming official. My husband had suggested trying dating about 4 months in but never wanted to label anything. Now we have been happily married for 2 years.\n\n\nSometimes waiting it out makes it all worth it in the end.",
            "This is like one of my Japanese Saturday morning cartoons, said I to OP. ",
            "I don't want to be the Debbie Downer here. But don't celebrate this as some amazing success. \n\nListen OP. The best way to keep yourself from growing old, bitter and cynical is to use some rational thinking to go along with letting the magic of love and relationships happen.\n\nRemember, she had all those years to express she liked you. She didn't. She \"came to the realization\" that she did. Which means she had to warm up to you. I'm going to tell you as a 34 year old who has had 4 serious relationships in my lifetime and is now married and stupid happy with my marriage the reason why my marriage is almost ten years old and I'm stupid happy is because from the outset me and my wife were crazy about one another. We were very attracted to one another. We liked spending time with each other. Sure there were some doubts initially but they didn't linger long.\n\nIt took her years dude. Remember that before you plow into this head first without a helmet without thinking. Remember that before you give yourself over to her and start getting all these amazingly intense feelings of love and devotion for her. Remember she was lukewarm to downright cold to you and had the opportunity to not be. \n\nLet me give you a lesson that you're going to learn soon now that you're done with school. Real life is real life. It's not a movie, book or television series. There's a strong chance that your crush didn't \"come around\" to liking you for some cute, beautiful reason that you've only seen or heard about in fiction. Chances are \"coming around\" to liking you is a real negative. And here's why.\n\nWhen you meet someone you're into you should be attracted to them from the outset. That attraction is the foundation of a relationship. The relationship then forms around that initial attraction. Her having to \"come around\" to being interested in you after all these years really doesn't bode well. \n\nSo before you celebrate that this is some sort of victory remember that she had to \"come around\" and let that temper how you proceed in these beginning days. If eventually she can prove to you that \"the right person was in front of my face all this time and I just didn't see it\" then fine, plunge head long into that beautiful abyss of love. But for these first few months to a year? Stay guarded, or you're going to have your heart shattered.",
            "Sounds like some good news from England! ",
            "Yay! Congrats!",
            "Wow that worked out better than I thought it would! Congrats!",
            "The weener finds a way ",
            "Gotta work through that fantasy somewhere. Might as well write about it, eh?",
            "man, can someone say whipped?"
        ]
    },
    {
        "post_id": "kmiu1k",
        "author": "lightgeschwindigkeit",
        "title": "My dad (74) trashed my apartment. I want to kick him out, but my wife says she thinks it's \"not the right thing to do\".",
        "url": "https://www.reddit.com/r/relationships/comments/kmiu1k/my_dad_74_trashed_my_apartment_i_want_to_kick_him/",
        "score": 3411,
        "num_comments": 409,
        "created_utc": 1609263345.0,
        "selftext": "Recently my wife and I went on a vacation for two weeks. We're lucky that in our country, COVID has been kept at bay, so travelling within the country is pretty easy.\n\nMy dad lives in our apartment.  He doesn't pay rent. While we were away, he continued living there. Upon our return, the place had pretty much been trashed.\n\nThere were fast food wrappers all over the floor, in the living room and bedrooms. Dirty shirts (several of them mine) being washed in the kitchen sink. Toilets in the bathrooms clogged up. One of the windows was left open during a rainstorm, letting rainwater in. Open condiment jars and cold cuts left out. Moldy food on the stove. A dozen half-finished coffees everywhere. Laundry just thrown on the floor in the living room. Appliances that were working perfectly fine before we left broken.\n\nHe is actually in good shape mentally, but he's just always been a slob.\n\nThis isn't the first time he's abused our space. He refuses to live by my rules, even though the house is in my name. A while back, he allowed his friends to use our home as a meeting place. When one of them started trying to recruit people for a MLM, I said that the party was over and that I wanted everyone off my property.  I called the cops and unfortunately in the heat of the moment, I lost my temper in front of them by saying if f the cops didn't remove them from my property, I would do so with force.  My dad then got upset with me because I had \"disrespected\" his friends and made him look bad.\n\nI talked to my wife about it, and while she acknowledges that my dad is a slob and a hoarder, she doesn't want to kick him out because he gave us money towards the home for our wedding.  She said that if something happened to him it would weigh on her conscience if she sided with me in asking him to leave.\n\nTL;DR - Dad trashed my apartment and I want him to leave.  Wife said she feels bad about asking him to leave because dad gave us some money to buy the house and because of the risk of something happening to him.",
        "permalink": "/r/relationships/comments/kmiu1k/my_dad_74_trashed_my_apartment_i_want_to_kick_him/",
        "comments": [
            "Things that arent signs of a slob: leaving windows open for days  during a rain storm, washing clothes in the sink and leaving them there, leaving out sandwich making stuff for days, clogging multiple toilets in a short time frame and leaving them(he is forgetting to flush and just reusing the same water without flushing), thinking MLMers are your friends.\n\nHe needs to be evaluated for dementia.\n\nEdit: these are all signs of starting a task, forgetting what you are doing, and abandoning it.",
            "People who have dementia often seem at first like they are disrespectful and careless, and their loved ones become very angry with them. This can be more difficult to see if your relationship has always been fraught.\n\nI respect not wanting him in your space- it's entirely expected- but I would try to handle it compassionately and get him checked out. A lot of what you're describing really sounds like it could be a sign of cognitive decline, and if you figure that out later on, you may regret treating him harshly for behaviors that were actually a sign of underlying illness.",
            "[removed]",
            "How did he manage to break multiple appliances over two weeks? That's not normal slob behavior. I really question your opinion that he's in good shape mentally if he does things like trying to wash shirts in the sink but giving up half way though.",
            "> There were fast food wrappers all over the floor, in the living room and bedrooms. Dirty shirts (several of them mine) being washed in the kitchen sink. Toilets in the bathrooms clogged up. One of the windows was left open during a rainstorm, letting rainwater in. Open condiment jars and cold cuts left out. Moldy food on the stove. A dozen half-finished coffees everywhere. Laundry just thrown on the floor in the living room. Appliances that were working perfectly fine before we left broken.\n\nThere's a really good chance this is some form of dementia. My eighty-something granddad was doing stuff like this before he was diagnosed. He needs assessing and he's probably going to need to move to some sort of assisted living facility. If he was just a slob, why was he trying to clean shirts in the sink?",
            "There's no way these are the actions of someone \"in good shape mentally but just a slob\", open your eyes OP. Your saintly wife at least gives you the opportunity to get him evaluated without completely abandoning him up front. If there's somehow no medical issue or he refuses to accept the diagnosis, then you can issue an ultimatum.",
            "I think your bad relationship with your dad is blinding you to the obvious fact that he's sick. A slob would let the dishes pile up in the sink. Maybe not take out the trash. Read all of this over and just think of how this guy could possibly function alone. It's a miracle he didn't burn the house down. \n\nGet him checked out. If you want him out of the house, a nursing home or something similar is probably the best option.",
            ">He is actually in good shape mentally, but he's just always been a slob.\n\nThis is not right. He's not just a slob, there's definitely something wrong here.",
            "So who cleans up after him when the two of you are at home? Your wife?",
            "There’s NOTHING mentally sound about a hoarding slob. Get him checked.",
            "Early signs of dementia by the sounds of it. Being alone and without support has made it more visible. Is he usually unclean to this level? I mean the jobs all sound half done",
            "[removed]",
            "[removed]",
            "Please encourage your dad to see a doctor. This behaviour may be the early signs of dementia.",
            "Uh- your dad isn't being obstinate, your dad is very, very sick and needs more support.",
            "There's something wrong with your father dude, no sane person leaves a window open during a rainstorm, along with everything else he's done",
            "OP, your dad is not mentally OK. This is not normal \"slob\" behavior, particularly breaking your appliances in only two weeks. You need to get your dad evaluated by a psychiatrist to understand what's going on with him, unless this was his behavior when he was young as well (trashing his own home after leaving him alone for a few days).",
            "My friend, as someone who works with elderly patients, I’d like ask that you have him evaluated for dementia/Alzheimer’s. What you described is what I see from a lot of my own patients and is often why they’re placed in my care. Just food for thought.",
            "Dude, definitely get him checked out before you make any rash decisions. This does not sound normal.",
            "OP this isn’t just slob behavior this behavior warrants you getting him evaluated for real.",
            "This does not sound like the behavior of someone who is in good shape mentally. He may need a higher level of care than you can provide. I would urge you to consider finding an assisted living facility for him or perhaps even nursing home care.",
            "I'm an RN, mostly working with the elderly.\n\nPlease have him evaluated, even if it's a mini mental status exam. \n\nSome of the things you listed are typical things I have encountered while caring for people with dementia. In the early stages, it can be very hard to tell someone has any cognitive issues. They can be quite good about hiding it, especially since personality isn't typically affected until the more later stages (depending on the type of dementia). I'm overseeing patients right now with slower progression that have had dementia for a few years and the first time I met them, I honestly questioned if they did. There needs to be a more in depth analysis - just having an everyday conversation isn't enough.\n\nAlso, at his age, other mental illnesses and medical diagnoses can mimick dementia. Time for a follow up with his PCP.\n\nAlso also, hoarding is a sign of mental illness. So no, he's not mentally sound, and maybe hasn't been for a long time.",
            "I'm reading your description of what he's done and that doesn't mesh with your statement ,\"  He is actually in good shape mentally, but he's just always been a slob. \"\n\nI'm sorry but that just isn't true.  You may not want him living with you and that's a decision you'll have to make but this man is not well.  Please have him assessed.",
            "You have a kindhearted wife.",
            "I agree he needs to get checked out. It sounds like he isn’t capable of caring for himself. \n\nTry and help as long as you can, assuming you both work he will eventually need to be moved into a home for the elderly. \n\nWhen you go on your next vacation you will need to find someone to check in on him daily or find a relative he can stay with.\n\nAging process is rough.",
            "If your father is a slob and a hoarder he is not in good shape mentally and should go see a doctor. Especially the hoarding. This is usually a sign of mental illness. Please take care of your father. I've seen this in my own family as well as my husband's. It is sad, and many times their mental health will become noticeably worse with time.",
            "[removed]",
            "If he can't take care of himself, then you need to look into local options for assisted living. Even if you think it's just his way, rather than any age-related cognitive issue, he's obviously not capable of taking care of himself.",
            "Others have commented that your dad should be evaluated for dementia, and I agree, but also, I have a father who is the exact same way. \n\nMy dad has always been a “hoarding slob” and we can debate the mental illness aspects of that all day, but at some point, you have to be comfortable. In your home, life, relationship with your father. Mine could do better, but chooses not to, so therefore he’s welcome at my house to visit, but I’ll never go to his. He will also never live with me. I don’t think you’d be wrong in asking him to leave, especially if he’s mentally okay otherwise, and has enough money for his own place.",
            "Dude, my gramnam had dementia, these are some pretty big red flags. Please get him evaluated.",
            "This is a side note but holy shit that sounds aggressive for you to treat his friends like that. I certainly hope there’s a lot more to the story than just some old timers talking about MLM schemes.",
            "It sounds like your father may be incapable of taking care of himself. And he'll likely get worse. I'd plan accordingly.",
            "While a gift is never a free card to stay with people forever no matter what, I agree you need to have him get checked out as a condition for staying instead of throwing him out. And then treatment, depending on what is found.",
            "Hoarding is a mental health condition.  As other posters have said, he needs to be evaluated for dementia.  In the US, when relatives leave their elderly parents to their own devices, there is the chance of an elder neglect or abuse law suit.  Happened to a friend of mine whose mom was found wandering in a park.  Her dementia manifested years earlier.  I mentioned it to my friend, like \"Hey, M. your mom didn't remember that your brother was present at her grand daughter's party yesterday.\" My friend ignored me. A couple of years later, elder neglect law suit.",
            "For what it's worth, my mom - who had been a successful physician most of her life, was very together, and smart, experienced something similar.  I started to notice that every time I went to visit her, her apartment was increasingly in bad shape. It happened more gradually but she eventually went into full on hoarding and her apartment was a hazard.  We finally convinced her to see some doctors, and she had early onset dementia.\n\nIt was particularly hard with her because she was so damn smart that she could mostly cover the deficiencies at least for short periods of time, so you could talk to her and she seemed pretty \"normal\" if a little batty but she was always \"eccentric.\"  \n\nOnce she got diagnosed we were able to get her into assisted living where they helped her keep her apartment clean, kept her safe, and while she wasn't happy at first she really did come to love it there and feel comfortable.  Sadly she passed three years ago.\n\nI share this because I deeply wish I'd intervened sooner.  I'm an only child so it was on me to notice something was wrong, and I just kept thinking well she seems fine when I talk to her so I guess she's just become a messy person.  The regret I feel is real, I know I left her living in gross conditions because I wasn't ready to admit she was ill.  \n\nPlease encourage your dad to get checked out.  Get him whatever services are available to support him in your country - maybe someone who comes to the home and helps him with things like self care, or possibly a safe place to live where he can be somewhat independent but also supported.  Don't live with regret like I do.",
            "This dude is a right wing nut who if you look at his post history isn't past making fun of a ninth grade kid for not being able to do math. Maybe this dude just doesn't believe in disability????",
            "Like all the other comments are saying, I'd have him checked out for dementia",
            "With alzheimers behavioral changes are often what is noticed first.",
            "If you want to kick him out of a house that he helped pay for, then you need to pay him back first.",
            "Don’t kick him out you’ll regret it when you’ve cooled off.",
            "[deleted]",
            "pay back the money he gave. then kick him out. problem solved",
            "I don't honestly believe that he's alright. Could you consider some illness? Depression or dementia? Your wife is a saint. You are very lucky to have her.",
            "Giving you a wedding present doesn’t mean you’re obligated to let him live off of that present indefinitely! \n\nAlso, he doesn’t sound like he’s doing very well, mentally. He has several signs of dementia, and is certainly of appropriate age to assume it’s possible. If this is the case he isn’t safe to leave home alone nor is your home necessarily the best place for him, anyway. \n\nI wish you luck in figuring that out. It’s a very sensitive issue to deal with, and it’s very difficult to watch a loved one go through it. However, it’s also very important that you understand that most people aren’t capable of handling that type of thing on their own and you are in no way responsible for taking it all on.",
            "You need to get your dad checked for dementia then make a plan for his care. What you describe are behaviors that go well beyond just being a slob. And it starts years before the person is so cognitively misfunctioning that it can't be hidden anymore.\n\nMy mother had dementia and Alzheimer's and she hid it for a very long time, at least a five years that I've been able to piece together, probably longer. She was charming, outgoing, and volunteered for everything. But things just got more and more \"off.\" And it was so easy to shrug it off or get mad about what seemed like just eccentric or weird behaviors. Because in the beginning these were just amplified behaviors of what she already was. My mom was a child of the Great Depression, so yeah she was always of the \"waste nothing\" mentality. But then that turned from things like, \"Let's repurpose these glass jars into cute gifts and save wrapping paper\" to stuffing bags with junk mail and keeping it under her bed. To not being able to explain why she didn't put that bag of groceries away and there was rotten food on her counter. To repeating the same story over and over but insisting it had just happened yesterday each time she retold it.\n\nIt is easy to miss these things as normal or to excuse them away, because this usually takes place over a long period of time and dementia patients can put a great deal of effort into seeming normal on the surface. Only once in the year before my mother completely slid into full-blown no coming back from it dementia did she say anything about her mental state. In a moment of clarity she told me she was worried, because sometimes she felt \"fuzzy\" like she could not remember things. And I shrugged it off and told \"We all get that sometimes Mom. You're tired, go take a nap.\"\n\nAnd it kills me that I didn't see it then or hear her. She knew something was wrong, but didn't know how to articulate it. And I didn't recognize what was right there in front of me until it was essentially past the point of no denying it.\n\nYour dad needs help. Don't turn him away, get him to a neurologist ASAP and start laying the groundwork now to have a care plan in place. And if you can, get yourself on his bank accounts as a signatory (don't put yourself on there as a joint account though for liability issues) and help him set up online banking that you can then monitor. He's ripe for MLMs and scam artists and that can all devolve really quickly. As can being able to pay bills or even basic care. And you don't want to be figuring those things out after he's to the point of no return.\n\nYour wife recognizes this goes beyond someone being messy. Listen to her. Get him help. And stop for a really long moment and recall how he was in earlier times then contrast that to the way he's acting now. Like did he always leave windows open to let rain in when you were a kid? Or take so many shits the toilets overflowed? I doubt those behaviors were there when you were a kid.\n\nAnd no, what you describe is not someone in good shape mentally. He's just not to the point yet where he can no longer hide what his real mental state is, but his actions now do. Get him help. I'm sorry you're all going through this. It's a seriously terrible thing and I wouldn't wish it on anyone.",
            "Uh, as a former carer of people with dementia, your dad is showing worrying signs. You need to take him to a professional, immediately.",
            "It sounds a lot more serious than just being dirty, this honestly sounds like something to talk to a doctor about because this is absolutely not normal behavior.\n \nThis sounds like early onset dementia that was left unsupervised.",
            "It's easier to blame them and call them a slob than to face the horrifying reality your parent may be in mental decline. Please get this checked by a medical professional. I don't see any assholes here, just a family in crisis.",
            "Please get him checked for dementia.",
            "This is not him just being a slob, this is early stage dementia. Go get him evaluated before you make *ANY* decisions.",
            "My dad died three days before Christmas.  Don't do something now in anger that you won't be able to take back once he's gone, which frankly may not be as far off as you'd like. These are absolutely classic dementia symptoms.",
            "Your dad is not a slob. Something is wrong. He needs an advocate and some support. Please do some googling! Bless.",
            "Bro your dads mental capacity clearly isn't where you think it's at. He is likely suffering with some cognitive impairments especially at his age.\n\nMaybe you just want your dad to be healthy mentally but clearly this is a sign that he isnt.",
            "First off - dad definitely needs to be evaluated, these are not normal actions and could be serious. \n\nbut second... i couldnt imagine kicking out my 74 year old father.",
            "YTA\n\nWait wrong sub.\n\nStill TA though.",
            "My dad sounds very similar to yours, he has his own apartment which we all lived in as kids with him, it wasn't in a great condition then, but once we all moved out, years and years of hoarding and neglecting to maintain the place turned his apartment into one you could barely see the floor, barely move around due to all the stuff, a smell of stale mould, dust it was awful.\n\nA couple of years ago, about the time when he turned 60, my dad was diagnosed as being bipolar, I always thought he was a little eccentric, but it wasn't until he went into a full blown phase of psychosis I knew something was terribly wrong. He ended up being hospitalised and during that time I completely gutted his apartment got help renovating the place, and I now live with him, with my partner and daughter, after he went through a considerably bad phase of depression. \n\nHoarding and being \"slob\" could definitely be a sign of some sort of a mental illness. It's definitely hard when they refuse to see anything wrong, my dad did, and i wanted to just give up on him, but i never would have forgiven myself if anything had happened to him. \n\nHe's doing pretty well now, even helping out with some house chores, as he knows the hard work I put in to clearing out the place and making it livable again. I frequently have to remind him to change his bed sheets, wash his pyjamas and clothes and to shower.",
            "your wife is a saint.  That is the first easy answer.  The rest is a tough call.",
            "You’ve gotten a lot of good advice about your dad’s mental health, but just an FYI. If your father lives there he’s generally allowed to invite anyone he wants over. If you physically try to eject them you would be the one with an assault charge. He lives there, it’s his home, and adults are allowed to invite people into their homes whether their landlords approve of them or not.",
            "Is your dad in a position where he can afford to live independently (but chooses not to because he's freeloading off you), or does he have very little money?",
            "Either this is dementia, or your father has so little respect for you that he is *deliberately* trashing your house as a power move. \n\n> she doesn't want to kick him out because he gave us money towards the home for our wedding\n\nAnd how much of that money is now being spent on fixing all the stuff your dad has damaged? \n\nRegardless, this goes well beyond \"slob/hoarder\" territory. Your father cannot live with you any more, but kicking him out to live alone might not be the answer either.",
            "Dude it’s your dad. He took care of you and even gave you money for your home/wedding. I agree with a lot of the other comments that it’s likely dementia. I agree with your wife that you absolutely cannot kick him out... He’s 74 - He’s not young. \n\nHonestly to me, sounds very extreme to kick him out. Do you care about your father? I suggest getting his mental state evaluated.",
            "This is how it started for my grandma please get him checked for dementia",
            "I don't think he intentionally meant to trash your apartment but it doesn't sound like he should live alone )-:",
            "OP- your dad didn’t trash the place. It sounds messy but cmon. Trashing the place would mean broken windows, broken furniture, shit on the walls. You should be concerned about his wellbeing, not kicking him out.",
            "You both acknowledge that your dad is a hoarder, but then say he is mentally fine. Hoarding is a manifestation of OCD which is a mental illness. I am a diagnosed hoarder, so I should know. You are not medically qualified to evaluate his mental state. You should have him evaluated by a professional. \n\nMy mom has dementia. Until recently she was a professional linguist. Her doctor (whom I have spoken to directly) still says it's okay for her to drive her car and live independently. She gets confused sometimes and forgets things, but she is very smart and able to cover for it. I wouldn't know that she had dementia if she hadn't told me and her doctor confirmed.\n\nEven if your dad is mentally ill, you are not required to house him. But it might help you to know what is going on with him so that you can help him find the right place to live. He's just going to bounce back to you if he does have untreated OCD or the beginning of dementia. There may be social programs in your area that can help him, or special living situations available.",
            "You are thinking like a idiot. You don't have respect on your dad he is a old man you should take care of him. 'what if you get old & your son does this thing to you'?\nYour western countries relationships are shit",
            ">He is actually in good shape mentally, but he's just always been a slob. \n\nI'm going to go out on a limb here and say that isn't the case here. \n\n>she doesn't want to kick him out because he gave us money towards the home for our wedding \n\nHow long is that going to be held over your heads? He needs to go, for your sake and your wife's. He is going to ruin your home *and* your marriage if he is allowed to stay.",
            "I’d get him check for dementia, just to make sure. We didn’t know for a long time my grandmother had dementia and just thought she was doing weird things cause of being from a third world country and always doing weird things, but at a certain point it was dementia from her diabetes and my aunt felt bad about it cause she didn’t catch it early on.",
            "He is your father, it doesn’t matter what he did I agree with your wife . You can’t kick him out.   I found this somewhere maybe you should read and everyone going though similar situations should read it too. \n' \nAS IS'\n\nHave you ever been in a discount store where merchandise is labelled 'slightly irregular', or 'purchase as is'? They don't tell you where the flaw is. And once you buy it you can't return it. Well, in case you haven't noticed, we all live in the 'as is' department. Stop and think about the people in your life. They're a mixed bag of strengths and weaknesses, virtues and vices, right? If you're looking for perfection, you're in the wrong store. What's the point? It's this: The only way to have a successful relationship with someone is to love and accept them 'as is'. Don't buy into the myth that most folks are 'normal' except the ones in your life. Based on that idea, relationships are an endless quest to fix others, control them, or pretend they are something they're not. Thomas Merton said, 'Love is letting those we love be perfectly themselves, and not twisting them to fit our own image. Otherwise we love only the reflection of ourselves we see in them.' A hallmark of spiritual maturity is acknowledging that nobody is perfect, and committing to love them in spite of it. Paul writes: 'Be gentle and forbearing with one another and, if one has a difference (a grievance or complaint) against another, readily pardoning each other; even as the Lord has [freely] forgiven you, so you must also [forgive]' (Colossians 3:13 AMP). To love someone 'as is' means to focus on their areas of strength and support them in their areas of struggle. 'What about their flaws?' you say. '...Love covers a multitude of sins' (1Peter 4:8 NLT).",
            "Just maybe there were other people hanging out with him during theses 2 weeks?",
            "He is disrespecting you, and it sounds like all the repairs has more than made up for the money given.",
            "Why is he staying with you guys anyways?",
            "This speaks heavily of dementia.",
            "A lot of people are suggesting dementia but no advice. As someone who grew up with hoarder parents who are total slobs, this resonates with me. I grew up with five siblings in a house that was utter chaos. Our house was disgusting at all times. I was never allowed to have friends over because of this and more often than not, my siblings and I were the kind of kids that would show up to school two hours late and covered in dirt. We had an entire bathroom that we just didn’t use anymore because the toilet got clogged one day and my parents didn’t do anything about it. They left it clogged and smelly for YEARS. I remember playing hide and seek in that bathroom and needing help getting out of the shower because I physically couldn’t pull my feet from some unknown sticky substance. I could go on, but you get the point.\n\nDo my parents have mental health issues? Yes. Depression, ADHD, Bi Polar, ect. But they are well aware of their situation and still do not seek treatment for these things. My parents are in their late 50’s now and their houses are trashed. Cars are always disgusting. Some people really are just careless and disgusting. You know your parents best. If this is not new behavior, then I don’t think you have to worry about him.\n\nYou haven’t mentioned if he has any income coming in. Does he?\nI personally would give him a time frame to move out. I think two months would be reasonable. Tell him he needs to be out by March first. If he has a job or some form of retirement/social security, this should be fine. If he does not, can he file for assistance? Food stamps? Help with utilities? We need a little more info on this.\n\nIf he does not have access to income or assistance, then a conversation needs to happen. Do you have any other siblings or family members?",
            "I actually disagree with most commenters, I don't think what your dad did is that big of a deal and I think the word trashed is overplaying it. Um so it takes 5 seconds to throw away the wrappers and old food, maybe 10 seconds to put away or pitch the condiments, unclogging the toilet may take 5 minutes and the shirt thing just isn't weird to me, so what he was washing a shirt in a sink oh no you better call the cops!! Trashed to me is paint and wine stained floors, broken sofas and tables and chairs, etc. And seriously half a dozen coffee cups of no how can you live in such filth! Seriously, your dad needs to tidy up and quit being so messy but I'm gonna venture a guess that you don't have kids because everything you listed is a day in the life of most parents 😂",
            "Everyone here is going to tell you to kick out your dad, and I'm guessing that's what you want to hear. That's how /r/relationships works. However, I wouldn't if I were in your shoes. He is your dad. There are ways of establishing boundaries that don't involve abandoning a dependent, elderly parent. I am not sure whether he is financially dependent on you or not. I am also not sure whether by \"kick him out\" means leave him to fend for himself or finding someplace else for him to live. And I don't know the full extent of his behavior and how many times you've tried to establish the rules for him. Or the overall context of your relationship, for that matter -- how he raised you, how much he helped you growing up or didn't.\n\nAll I can say is that I don't think being a slob and having friends over is sufficient reason to abandon an elderly parent financially. Absent any context. I myself am sometimes a slob. People are different and sometimes you just need to understand your family members for their faults and learn to live with them. That should involve compromise on their end, don't get me wrong. But if you're asking about abandoning your elderly father to the wolves because he didn't clean up after himself, I don't think the punishment fits the crime.",
            "Whose house is this? Also, are you actually in that same apartment or is this an extra home to be rented out for income? \n\nIf he's living in a separate room, like a renter would, he's allowed to be a slob and invite weirdos. But then you'd have a security deposit to compensate you for the broken stuff. \n\nSo, perhaps this situation needs a revision of what your roles exactly are as you then can set different boundaries.",
            "Give him a final warning and ask him to pay for all the damage done, if he isn't willing to do that then kick him out, he doesn't respect you or your property.",
            "You know what's \"not the right thing to do\"?\n\nThrashing someone else's apartment. Just because he agreed to help you financially to get it, doesn't give him the right to so that kind of shit.",
            "What are you doing? Stand your ground!",
            "You’ve repaid him for the money by letting him live with you rent free. You leave him alone for 2 weeks and he ruins the place. It’s your house. If you don’t want him there then he shouldn’t be there, it’s not abandoning him if he won’t follow your rules and if your wife’s scared of something happening to him then maybe a care home would be an option",
            "He has more than been paid back for any amount he contributed towards purchasing the house. He is now actively trying to destroy it. \n\nHe needs to go, because you can’t trust him to be alone in your home. This is your biggest purchase, and you will be devastated if he does permanent damage. \n\nI can foresee broken water lines, fire, mold, all the things that slobs can cause without batting an eye.",
            "Sorry, covid isn’t a catch all excuse. Nonpayment of rent because you lost your job is one thing, destroying your place and antagonizing the people you live with will get your ass shit canned. Muh pandemic or not.",
            "NTA. That's just unacceptable.  Your wife us free to help him find alternatives. It's both your home, and you both have the right to veto who you share your home with",
            "He has no respect for you, your wife or your home. Honestly I think you should kick him out.\n\nSure, he gave you money to go towards getting your home as a wedding gift, but that doesn’t excuse trashing your home. It’s manipulative and disrespectful.",
            "So regardless of what may be wrong mentally, I’d also want him gone ASAP. His behavior should not be excused and him giving y’all money doesn’t mean y’all have to just put up with him indefinitely. You kick him out regardless of whether your wife agrees.",
            "Your dad could have done the same to you what you are about to do but he didn't. He taught you, gave you life, gave education. If he had abandoned you for making noise or making rooms dirty, you could have been homeless asking for a piece of bread instead of asking for the suggestion to kick your dad.\n\nShame on you.",
            "The three of you need to sit down and lay down some ground rules. Let him know that if he does not follow them, you will move him into an apartment. Be firm and if he violates the rules, find him a place, pay the first two or three months rent and move him into it. The situation calls for some tough love.",
            "Kick him out, and, if you want to be nice about it, consider getting him professional help and/or somebody to take care of him, even if he isn't in a home yet. His living habits are absolutely disgusting. I would've kicked him out after a week tops. Dirty dishes/laundry piling up is one thing...a sign of an incredibly lazy person/slob. Still incredibly annoying to be around/live with and would be a dealbreaker for me. Clogged toilets, windows being left open allowing rainwater to come in, food being ruined, mold, all of that...that's seriously messed up, and possibly signs of serious mental illness, and/or dementia. It's possible he just forgot to clean up after himself, and it's possible he simply didn't care to. Kick him out/get him help.",
            "[deleted]",
            "I’d kick him out too",
            "Time to take ol’ dad out to the back forty....",
            "Tell your wife this 'ok, Im not going to kick dad out. Im going to tell him unless he pays for a cleaning team to come in and for the appliance repairs he will have to leave. and unless he agrees to and does live by our rules he will have to leave. He will have two weeks to decide. It s 100% in his power whether he stays or goes.'\n\nif your dad doesnt want to stay with you he doesnt need to fix things. If he does want o stay with you he fixes them-easy peasy.",
            "Tell him he needs to clean it up, hire a cleaner, or theres no way you can live together with him anymore",
            "Nah, he is entitled and needs some sort of accountability.\n\nEta: I didn't say dementia because Op said his dad has always been like this and is cognitively ok. There are older people who don't have dementia and are like this. But it is worth a check still Op. Otherwise, accountability IMO.",
            "He thinks he can control you because he's your dad. If you can kick him out you have to, make sure you earn him if this first term your wife that's\nThat your gonna give him some chances and tell him he'll be kicked out of her doesn't follow the Times of her dies but give him money and kick him out. I'm sure he'll be fine if you pay him enough",
            "What kind of uncivilized neanderthal does that shit. Kick him out. I'm willing to bet he's done similar nonsense in the past.",
            "Your house.  Your father.  Your decision.",
            "Was he this way when you were growing up?  Do you have memories of your mother trying to keep his habits in line or has he gotten worse over time?  If he's gotten worse over time then he ought to be evaluated for dementia. \n\nAlso, ask yourself why you let him move in in the first place.  Was he having difficulty keeping his own place clean?  Did you know about his tendencies when you let him live with you?    If he's always been this way he could destroy your marriage.  If you really feel guilty about the money then you could pay him back and it could be a starter fund for him to live on his own.  \n\nHe's an adult.  Would you treat your grown children the way he's treated you?  He's your father, not your wife's father, so you have more say in this.  Ask your wife if she would treat her children the way your father is treating her.  Would she treat you the way he's treating you?  \n\nHe's an adult and if he can't manage his life on his own then he needs help.  Real help.  Not a well intention-ed son and guilt-ridden daughter in law.  \n\nAsk your wife where she draws the line.  If he started wearing her lingerie when no one was looking would she ask him to leave or install a padlock on the master bedroom (which, IMO is an unreasonable length to go to.)  If he's going to leave a mess is she willing to be the one to unclog the toilet and pick up after him?  \n\nHow much is she willing to put up with before she says enough is enough?  Would either of her parents behave this way?",
            "Is he sick ?  Dementia? Alzheimers etc",
            "At his age he needs evaluated for dementia, or Alzheimer's. My dad had it like his dad at 55. He did everything you mentioned, but the thing that made him say, \"I'll see a dr,\" was the fifth time he fell flat on his face stepping off the curb outside grocery store and needed oculofacial reconstructive surgery after.\n\nHe passed this year. They did mad scans on him because he had a stroke, fell, hit his head on a table edge going down, and stayed in a coma. Apparently he had signs of \"silent strokes\" as early as his 30s. Mom now swears this is about the time he became mean.",
            "Your wife is right.\n\nA friend of mine, their mother behaved like you describe on a gradually worsening curve till eventually they found her sitting outside smoking a cigarette in her nightdress... in a snow storm, she was completely oblivious to being cold or that it was actually snowing, her fingers were literally blue. They took her to the hospital immediately, freaking out, and a nurse took the time to get a full behavioral history off them, get a doctor involved and long story a bit shorter got her diagnosed with late stage dementia. \n\nSadly, it was too late for any treatment to slow the progression and she had to be admitted into a care home very shortly after and died within 7 months of the diagnosis. Friend and his dad now have to live with the fact that they spent several years having screaming fights with his mother over things which were symptoms of the disease, not her actual behavior.\n\nPlease don't be left with that kind of regret, get your dad assessed now.",
            "Time to get Dad into a facility where he can be cared for.",
            "Sounds like Early Dementia, don't worry, is very workable at this stage you describe, he has grasp of reality and clearly knows is not ok, because it would be normal to see it with you there and not when you go out on vacations. And once they get they have it, is easier to live and work with them.",
            "Get him checked out, pay the money back or get him into safe, supervised care as appropriate, and send him on his way. Whatever’s appropriate. But get out from under the debt and get him out if he’s not demented.",
            "So, he is either suffering from some sort of mental condition, or he is dependant on some sort of drug or alcohol. I'm not a professional, but I think he needs to see one. I understand he was probably always a little like this, but this level says theres something else going on",
            "There is no way any of us know of your dad is depressed or if this is dementia or ADHD or any numbet of malady's.  I think you need to listen to your wife's concerns though as you together decide what is best.  Good luck!!",
            "I’m going to go out on a limb here and say that maybe your dad was never in “good shape mentally”.",
            "My dad was a slob and hoarder in the sense that he rarely threw things away and didn’t look after what he had. So I don’t have a lot of sympathy for such people, he put us through hell. I’d say, you’ve got to draw a line. Kick him out. He can’t buy the right to act so disrespectfully.",
            "This... isn’t normal. \n\nMy dad was a hoarder, but he also had some brain trauma. He was notorious for being unable to start and finish a task.\n\nYour dad seriously needs to be evaluated and maybe even be put in a home. You first need to make contact with his doctor and tell him your concerns. From there, your dad will need to be evaluated for trauma or dementia. \n\nFor my dad , it was a car accident and a weeklong coma, but it could be anything if he’s always been like this.\n\nJust to reiterate - this isn’t normal. Kicking your dad out will save your sanity, but I’d recommend getting him assessed immediately, and then moving him to a home. What you have going now is not working and he isn’t safe being on his own.",
            "Pretty much like everyone else said: I'd rethink the whole \"mentally there\" thing",
            "How'd appliances break, if you don't mind me asking. I find that wild af.",
            "I’m not sure of what you should do, but I am sure of one thing: stay married. You have a good wife. Most women would be like, “your dad needs to go.”",
            "Sounds like Dementia than being a slob.",
            "Your wife sounds like an amazing lady ❤️ I’m not sure which country you are from, but if this was posted in “am I the asshole”, I’m sure most of the Americans on there would be telling you to kick him to the curb like yesterday. It does sound like he may have a mental disorder, I agree with getting him evaluated.",
            "*Dementia Symptoms*\n\n\nRequires a medical diagnosis\nSymptoms include forgetfulness, limited social skills and thinking abilities so impaired that it interferes with daily functioning.\nPeople may experience:\nCognitive: mental decline, confusion in the evening hours, disorientation, inability to speak or understand language, making things up, mental confusion, or inability to recognise common things\nBehavioural: irritability, personality changes, restlessness, lack of restraint, or wandering and getting lost\nMood: anxiety, loneliness, mood swings, or nervousness\nPsychological: depression, hallucination, or paranoia\nMuscular: inability to combine muscle movements or unsteady walking\nAlso common: memory impairment, falling, paraphasia, or sleep disorder",
            "Ain't no way that much damage was done in 2wks by someone mentally competent.\n\nI'm lazy AF & my place looks fine after months of neglect.\n\nYou make yourself sound silly when you reference being 'lucky' about the covid response where you live. Almost like you haven't a clue its warfare from China to bring down the West (& freedom in the process)\n\nFake pandemics & rigged elections are great signs of begging for a revolution. Hope you Chinese Bots & Soy Boys are ready 🤙",
            "I mean, he may have some type of issue going on, so that should be checked out first and then you both need to plan on what to do **if** it's something serious. BUT if it's nothing, then he needs to be put out and he needs to find his own place. I get your wife because I used to be the same way, giving people chances because they'd done one thing for me, like 5 years ago, but someone trashing your apartment isn't right and she needs to realize that. Does she want to be forever babysitting someone with a bad attitude and who will keep ignoring any ground rules you set for living with you? There's definitely a time and place to be there for family, but you are not obligated to them if they are purposely making things harder for you.",
            "I never take sides when dealing with married couples , but dad needs to go . This isn’t about money( which btw was was a gift , no a , I can come crap on your life whenever I’m ready  down payment), this is about respect of their space and  he knows Better. Give him a talk about how you want things to run from here on our abs if he can’t turn it around in a week ( 7 days ) then he will have another week to find a place to live. He is a grown man and he can learn to clean up after himself. Period .",
            "Your father is 74, it sounds like something may be wrong with his mind.  Ask him general questions and see how he responds.\n\nWhat year is it?\nWho is the current President(or equivalent if you live outside the US)?\n\nDementia is progressive.  My mother showed minor symptoms years before I finally had to start taking care of her.  There were things I didn't know about because her friends weren't telling me as well, which I found out later.\n\nYou can slow down the progression of the disease with medication, but it cannot be cured.\n\nIf your father refuses to go to a doctor or hospital to be evaluated, look into other options.",
            "Sounds like a tough situation. With COVID-19 and if my dad were still alive, he could stay or trash my place anytime. Family is family but if you need him out, he likely needs a little help. Just to get out but he (or you) 🤷🏻‍♂️can find a better place",
            "I had the same issues with my old man. When he started leaving the front door to house wide open and wiping himself with my beach towels and leaving them in the bathtub, it was time he became not a resident of my domicile.",
            "Hoarding is actually a sign that something is off mentally. Despite the mess, people who are hoarders see nothing wrong or abnormal with their situation. Your father is quite a bit older so I am of the mind like others here that he has some signs of dementia or another related illness that is causing the behavior. I’d try to have him see a doctor.",
            "Gifts aren't obligations, they're not meant to be abusable or have strings.\n\nIt was a wedding gift, not payment for rent and housekeeping.\n\nConsider the cost of fixing all the shit he's broken and ruined pay back and then tell him he has 30 days to move out\n\nUnfortunately, there are people who are this much of slob without just cause\n\nYou know your dad, you know if this behaviour is typical, evaluate him if not, to ensure it's not some mental decline of age.",
            "Hi,\n\nI agree with your wife,  I think she's right but is not articulating her gut instinct. I also don't think you've taken the necessary steps to be able to ask this person to leave and are acting out of frustration and anger. This is your Dad.\n\nAlso, I hate to say this but you actually can't use force on someone on your own property, that's still considered assault.\n\nThat said, please read wchijafm's comment. It is absolutely spot on.His behavior is a sign of a lack of wellness for some reason. A compassionate way out would be to get your father to a few doctor's appointments.\n\nAs a 25 year old female, I had the exact same experience - except I was the 'slob'. My parents left for a week and I opted out of the trip precisely because I was not feeling well. As it turns out I was suffering from a severe viral infection and mold toxicity. I opted to try to help myself while alone the entire week, including making food I thought would quell symptoms, forcing myself out to get remedies and herbs that I ended up just leaving haphazardly over their kitchen and leaving food half done. Reaching out to people I hardly knew to connect and express desperation.\n\nWhen they came back, They were horrified. And honestly, it was NOT a big deal in the end. The bigger deal was that I was sick and didn't know why. In reality, I'm an incredibly balanced, sane person. But I surely was not well at that time. Had they seen the scene as a sign of my degraded health state, they could have helped me and likely turned things around. I'm well now, but it was 6 months before I went into a hospital and when I finally did, I had lost weight, stopped eating, was dehydrated and having heart palpitations, wasn't showering, and had lost menstruation completely. \n\nYou don't want to ignore the signs.",
            "This is a very difficult one and I wouldn't like to be in your shoes. It is hard.\n\nI'm not going to give you any advice cause honestly I don't know what I would do in a similar situation. All I'm going to do is share with you something I read a while back and has helped me deal with the decision I took about going NC with my abusive, hurtful and disrespectful son.\n\n* Let's get out of this habit of telling people well:\"that's still your mom. That's still your dad. That's still your brother. That's still your sister\".\n\nToxic is toxic whether it's family or not. \n\nYou're allowed to walk away from people who've abused you. You're allowed to walk away from people who constantly hurt you. You're allowed to walk away from people who don't love you. You're allowed to create boundaries. You're allowed to choose your breaking point. \n\nStop encouraging people to deal with toxicity and drama. \n\n(Lessons taught by LIFE) \n\nHope it helps and gives you some clarity. Maybe talking with a professional might help too. Sending your way best wishes, positive vibes and thoughts, blessings and prayers.",
            "You kick him out. What he did is absolutely unacceptable.",
            "I know a lot of people are saying to check him for dementia, and sure, you should do that.\n\nBut you said this isn't the first time and that he's always been an inconsiderate slob.\n\nIs he can live elsewhere, he should. Or this will be your life for the rest of his.",
            "He's a slob. Ok. Watch YouTube tutorial videos on how to fix the window. Is the laundry ruined? He sounds like someone who just doesn't know how to do things. Show him how the washing machine and dryer work. The other stuff can easily be picked up and thrown away. In my culture, we care for our elderly. Older people can learn how windows and washing machines and dryers work. Show him. Have a friend be a housesitter when you leave town. If you think he's of sound mind but just dirty, there are many ways to fix this situation.",
            "In the US, you can have medical POA. It can go either two ways with the elderly/inflicted willingly giving power of attorney to make judgment calls, or in certain circumstances they will have their “right” voided if deemed necessary, ie danger to self like mentioned before. Plus due to his age, he/you should already have started the process of having an AD/POLST form completed. Especially before any major turns like you have mentioned already. They are only deemed authentic and legal if the person who is having the forms completed are of “sound of mind”. \n\nI was part of having my great-grandfather fill his out prior to worsening and dying while in home hospice where I was his caretaker. You will need someone who is not of family to be present as well to sign the documents to make it legitimate. For my grandpa, my ex was present with me and my mother who was given POA signed her signature and then my ex. That is what I believe is the best case scenario in situations that your father might be starting towards.",
            "I have one question for you. When you were child, did you made me or maintained your fathers house clean? If it was not clean sparkling then did he kick you out? That should give you answer. \n\nExpect what to do today, you will get tomorrow when you reach your fathers age",
            "Where do people find such wives! Those are rare who actually care about your fam as well. Normally a lot of partner's just get agitated in the first instance",
            "Fool me once shame on you, fool me twice shame on me.\n\nTwo things I’d say. \n\n1) He is who he is, and you had warning signs. You dropped the ball , just as parents of teenagers have to take blame if there youngsters’s party gets out of hand, and trash their house while the parents are away on holiday.\n\n2) My response would be huge compassion. Guy gave you money, and life.\n\nThat compassion might include cognitive testing by a medical professional, to see if some simple fixes were possible. (Ie certain nutritional deficiencies or like.) \n\nRegardless a personal organizer, who specialized in elderly, and/or weekly housekeeper, might be able to immeasurably improve his quality of life. Maybe he needs someone to distill his self care down into a barracks like arrangement, by putting his memorabilia in display cases out of reach, creating labels, checklists, and posted instructions cards for complicated tasks.",
            "Your dad sounds like my granddad, who has alzheimers and lives in a retierment home where nurces look after him 24/7.",
            "This does sound like dementia or depression, but it also sounds like he's intentionally getting back at you for his perceived disrespect of him and his friends.\n\nI'd challenge him on it. It's your home, he can respect it and you, and that may include getting appropriate support, or he'll have to move on.\n\nYour wife being a bleeding heart about it is probably what he's relying on, if this isn't a medical issue.",
            "kick him out like yesterday. your wife should mind her own business, it's your dad.",
            "I'll chime in and agree with a lot of the others in this thread are saying-you should get him evaluated for dementia. Many others have made good points as to why. If he does get diagnosed, you could look into a carer for him or some sort of home that is specialized in memory care.",
            "Tell your dad he needs to consent to getting a mental evaluation (for Alzheimer's or related issues) or he's got to move out. If your wife doesn't agree to that, then your marriage is as good as kaput because no reasonable, decent person on earth would EVER ask you to tolerate this in your own home. \n\nRegardless of what you wind up doing, he can never be left alone in your apartment again for longer than a few hours.",
            "Your dad is not in good shape mentally, get him some mental health. If you’re in a country where “Covid has been kept at bay”, I assume you are not in the states and access to mental health services should be affordable to come by.\n\nDoing this for your father isn’t just about getting your home back in order, it’s also for his own benefit. He’s likely suffering and needs help. Old men can be stubborn to admit that they need the help.",
            "He does this because you have allowed it. Stop allowing it and tell him to move out if he can't respect your space.",
            "Your dad has dementia. YWBTA if you don’t get him the medical help he needs.",
            "The guy called the police on his dad  and wants to leave his father homeless. He's isolating his father by keeping him away from friends and treats his dad like a guest. He exaggerated his dad's \"trashing\". None of what his dad did is trashing because there wasn't any damage, only a mess. He made the mess when no one was home which is fairly normal. Calling the police is abusive. Leaving someone homeless in a pandemic is abusive. Isolating an old sick man from his friends is abusive. Not providing medical care is abusive. Taking the old man's money is exploitation. The dad is experiencing elder abuse and needs help. I'm the only one to mention this and was told to go fuck myself. This man is a narcissist. A lot of abused people will react in ways that appear to be distress but its not necessarily a mental illness, just a natural response to being mistreated. The guy is a narcissist plain and simple. He's the one that needs to leave the house that his dad paid for.",
            "[deleted]",
            "I need a good relationship",
            "OP, any update on the situation?"
        ]
    }
]