[
    {
        "post_id": "3glzks",
        "author": "Throw8726",
        "title": "[UPDATE 2] My [35M] Girlfriend [31F] uncomfortable with my wife's ashes.",
        "url": "https://www.reddit.com/r/relationships/comments/3glzks/update_2_my_35m_girlfriend_31f_uncomfortable_with/",
        "score": 3341,
        "num_comments": 281,
        "created_utc": 1439311122.0,
        "selftext": "Again thank you for all the support in the last two posts. You really helped me keep a clear head through all of this. I had no idea reddit could help me so much! \n\nI didn't plan on posting again, but I have surprisingly good news. \n\nOP: https://www.reddit.com/r/relationships/comments/3g747t/my_35m_girlfriend_21f_uncomfortable_with_my_wifes/\n\nUpdate: \nhttps://www.reddit.com/r/relationships/comments/3gh3a2/update_my_35m_girlfriend_31f_uncomfortable_with/\n\n\nLast night I came home from work to find a framed photo from my wedding hanging on the wall with the chain dangling around it. There was also a 5 page note from M on the coffee table. \n\nI'm not going to type the whole note, because a lot of it was very personal to M. However I will say that there was a LOT of apologizing on her part. She told me that she thought a lot about the ring (and even did some googling) and realized that it's not all that uncommon. She said she was completely embarrassed by her reaction and that she was uncomfortable with the thought of being around ANYBODY'S remains. She called herself disrespectful, childish, and pathetic. :( \n\nM also said that what I did was a beautiful thing, and shows what a sensitive and loving man I am. That she want's to be with me more than anything and doesn't want to change a thing about our tradition (taking the ring traveling). She told me she nows see's that it's a lovely idea and said my wife was lucky to have me and my family. That she as well is lucky to now be a part of my and my family's life. \n\nShe concluded saying that she felt as though we had a good connection and handled conflict well. She said she hopes that I know her well enough to know that this isn't the way she typically reacts (I do). She also told me she was going to get therapy, as she is worried about what will happen once somebody she knows dies. \n\nThe last part of her note said that she left a surprise in my fridge (a 6 pack of my favorite beer) and that she'd love to enjoy them with me if I'll have her. She told me to take all the time I need before calling her and that she hopes someday I'll forgive her for her actions. \n\nI called her immediately. We talked, and she pretty much repeated what she said in her note. I repeated what I said at dinner (that she is my number one, and that I am so sorry for lying about the ring). We have plans to see each other tomorrow night. \n\nI love the photo of me and my wife. I don't have many photos of us, and none that are framed. The chain looks perfect around it, and it's a nice little memorial to have in my home. I love the idea of starting a new home with M, while still having my wife's memory be a part of it.\n\n\nI know this is not what many of you wanted to read. You wanted me to kick M to the curb. However, I think that a year of good actions make up for one bad action. Her apology was genuine and I really do feel as though this won't happen again. If she tries to control something like this again, and I can't resolve it, I guess I know where to post ;) \n\nI can't thank you all enough. \n\n\nEdit: I was expecting you all to be disappointed in me, and yet the first comments are saying how happy you are for me. Thanks again reddit! \n\n**tl;dr**: M made big apology. Forgave her. Happy. ",
        "permalink": "/r/relationships/comments/3glzks/update_2_my_35m_girlfriend_31f_uncomfortable_with/",
        "comments": [
            "This is what a lot of us wanted to read and it shows that she can learn from her mistakes.  I wish both of you the best!\n",
            ">Last night I came home from work to find a framed photo from my wedding hanging on the wall with the chain dangling around it.\n\n>That she want's to be with me more than anything and doesn't want to change a thing about our tradition (taking the ring traveling).\n\n>She also told me she was going to get therapy, as she is worried about what will happen once somebody she knows dies. \n\nWow. I mean, I consider myself to be a pretty rational person. But even I'm not sure I would be self-aware enough to figure all that out in this kind of situation. Good on her.\n\n",
            "[removed]",
            "I think the \"dissappointment\" would have been if you decided to get rid of the ring and/or take her back if she didn't apologize for her actions.",
            "Congrats on the happy ending!  I think you did the right thing.  she realized that she was in the wrong and that she needs some help.  That was very mature of her and should give you reason to be optimistic about your relationship.  Your situation is one that is very hard for people to understand unless they've been in it.",
            "She owned up to her mistake. I think in this case, that's a big thing. Congrats on the happy ending. :)",
            "People aren't perfect. People fuck up. Sometimes the people in this sub forget that we are given only pieces of a person as seen through someone else's eyes. So don't worry about the people who wanted you to dump her. They don't know M and you clearly do. \nI am very happy for you.",
            "I know this is late, but everyone seems to be dogging your gf with no real life experience. I seriously dated a man who's wife died of cancer at a young age and early in their marriage. After getting serious and moving in together I found it very difficult to deal with their wedding picture hanging on the wall and stacks of photos of her all around the house and her things still all around. I would never have asked that he get rid of these things, but to have it all in my face everywhere I turned, it made me feel very unwelcome, as well as having a noticeable effect on his ability to progress through the stages of grief. After some time I asked if he would be willing to remove the hanging photos and consolidate her things. He said he never could because it was too hard, but I could (a weird spot to be in). I bought a nice wooden box with a frame cover and put a special picture of her on the lid and filled it with the photos and small trinkets and their rings and put it on his dresser and boxed the rest of her things in the closet. He was satisfied with that and seemed to appreciate the care I took with her things and putting the photo box on his dresser. I asked about her, I listened to their stories whenever he felt like sharing that part of his life, I feel like I knew her. I would however have been bothered if he wore or carried 'her' around with us everywhere we went. I don't feel like that would have been part of a healthy relationship. She was and always would be part of his life, no physical thing with him at all times was needed to hold a memory and I would have also found it hurtful (not that I agree with your gf's approach to expressing this feeling). He ended up passing away, young as well. I have a box with memories and took the photos down after a year, on my own, to help with the healing process. Everyone grieves differently and in their own time, but if you are ready to have new relationships then I think it is fair to ask for things like this to be placed aside in memorial. ",
            "I was one of the people who thought that M was simply uncomfortable with the idea of the ashes.\n\nI am so glad that I was right, and that it worked out for you.\n\nI think you might owe it to M to definitely make her a priority now (that's what you were going to do anyway).\n\nThe deceased will always be remembered, but the living must go on living.",
            "Her actions show a lot about her character - that she is willing to admit when she is wrong, and she can own her mistakes. I would consider this incident a blip in your relationship, and I hope you have a long and happy relationship together.\n\nIf she ever starts being controlling again, address the situation immediately.",
            ">The last part of her note said that she left a surprise in my fridge (a 6 pack of my favorite beer)\n\nI mean the apology was nice but let's concentrate on what is important here. :)\n\nGlad it worked out in the end. Congrats OP.",
            "We hate it when stubborn assholes either insist on remaining stubborn assholes or when those assholes pretend to apologize but don't mean it. We *do* appreciate stories when communication results in revised mindsets and cooperation. I'm so glad that this story was the latter! Her gift to you was especially demonstrative and a great olive branch. (...Talking about the picture, though I'm sure the beer helped.)",
            "> (and even did some googling) \n\nShe found your threads OP",
            "This is a really nice update/conclusion. Yes, we didn't want you to stay with her, but that was with the information we had. :) It's nice to see that she's realized that her reaction was unfair and that she acknowledged it as disrespectful. \n\nHope it all works out. ",
            "Couldn't be happier for you.  Hope things continue to go well for you both.",
            "I love reading these types of stories.  Although she came down harder on herself than she needed to (called herself pathetic), she handled apologizing amazingly well.  You both sound very mature and handled this with amazing grace.  Good for you guys.",
            ">Last night I came home from work to find a framed photo from my wedding hanging on the wall with the chain dangling around it. \n\nThis is beautiful!! and extremely loving of her! \n\nI think things will turn out well for you, OP!\n\n",
            "Good for you! The reddit hive mind always goes to breaking up if someone is being unreasonable. I'm glad you were able to see through that and able to come to a positive conclusion. Also, good for your girlfriend in being able to see the benefit of therapy in this situation.",
            "I think she might have found your previous post while googling.",
            "This is a wonderful update and shows the stellar quality of your GF.  Being willing to own up to your mistakes and work on your personal failings are traits that you definitely want in a life partner. ",
            "Actually I wanted you to kick her to the curb but I think this is an amazing update.  M is capable of self reflection and changing her ideas based on new information - that is a hugely awesome quality as a person.  I'm so glad she came around.",
            "Oh thank God...no, this is EXACTLY what I wanted to read...I'm so happy for you and SO glad that it worked out in the end. Good luck to the both of you!",
            "[deleted]",
            "anyone have the content of the second update?\n\n\n",
            "Well clearly by \"googling\" she means she found your Reddit posts and read the comments.",
            "I think she did everything right and is moving in the right direction. If you forgave her, then that's all that matters. Hopefully, this is just a rocky patch in a healthy relationship. ",
            "She did a complete 180, good for you! I'm happy that it turned out this way. I guess that for someone who doesn't have much experience with death, it can be a bit difficult to deal with. But eventually she opened her eyes and looked into it, that shows maturity. ",
            "I think your girlfriend is great. She is willing to admit she's wrong, she has the ability to apologize unreservedly, she does research to gain insight into her own conflicting thoughts and emotions. These are all big things that are very valuable in a partner. ",
            "She has gone an extra mile for you. \n\nYou could still move the wedding pic to your study though.. It doesn't take away anything from your love & memory of your first, and saves being a constant reminder for this girl.. \n\nKudos to you both. ",
            "it's hard to be on her end. good on you!\nMY experience with late wife ashes was weird as well.\nWe were cleaning out his closet. We'd been dating for 3 months. I ask- whats in this box? he says he doesn't know.\nI open said box. It's the bag of her ashes and her toe tag. \nTHAT was a weird conversation.",
            "This is *wonderful*. This is exactly what most of us want to read when someone posts an update! Communication is a maker or breaker in a relationship. I'm so happy for you both and glad that she is coming to terms with mortality and getting help regarding her fear of it. \nOh man. **So proud** of you for not giving your ring up, though, OP; and proud of M for letting her guard down allowing you to honor our late wife. Awesome. I think this will ultimately being you two closer. ",
            "I have to be honest and say this was the last thing I was expecting from M, but this is a great update! She's really shown strength of character by admitting her mistake and hopefully your relationship will become stronger from now on.\n\nI wish you both well for the future.",
            "I am very glad that M has come to her senses. It shows maturity on her part and she seems sincere and her apology seems genuine. I'm glad you guys will be able to move past this. I'm happy that you're happy! ",
            "I wanted you to kick her to the curb, I have to admit it...but that's because I never thought she would take the time to realize how childish and moronic she was being.  She was coming off as an irrational person...and I am so glad that I was wrong.\n\nThe fact that she put that much thought and effort into empathizing with your point of view speaks volumes as to the kind of woman she actually is.\n\nShe reacted poorly, realized she reacted poorly, and made amends for it.  OP...I think you've found a keeper.\n\nCongrats",
            "Yay!",
            "[removed]",
            "What a wonderful update! I'm glad she was able to realize what she was doing. Not everyone has that ability.\n\nThis bodes well for your future. \n\nCongratulations. :-)",
            "Gah feels. \n\n*Hugs* OP! Big *hugs* ",
            "This makes me more happy than two anonymous people on the internet should. I'm really so happy for you OP, and I don't think there's any reason anyone should be disappointed in you. It sounds like she really learned from her mistakes and the picture was a really sweet gesture. It sounds like you had an amazing first marriage and I'm happy that you are getting to share it in a very \"normal\" ;) way with someone who sounds like a great person.",
            "Congratulations on all of this working out!",
            "I'm really happy for you. When I read your update I was so sad that it seemed that you and M were finished based on a difference of opinion. So glad it's all sorted and you can still honour your wife's memory as well. Both women are lucky to have had you. ",
            "I'm glad to hear she changed her mind, did some research and is going to therapy. That is a nice ending to everything. I know I was one of the ones to tell you to end it, but I'm glad it seems to have worked out.   \n  \nBest of luck. ",
            "This makes me happy. Good on the both of you!!",
            "I won't lie, I'm a sucker for happy endings.  Congrats on navigating through to the other side!",
            "Glad to see M turned out to be just as beautiful a person as you OP. ",
            "Congratulations on things working out for you. I'm just now coming in on your story, so I still want to say I am sorry for your loss. I am very ecstatic for you that you have found someone special again. \n\nI also want to say I think that it is the coolest thing to have your wife's ashes made into a stone and put in a ring.\n\nIf you don't mind, would you please tell me how this was done?",
            "I'm so glad she came to her senses!  Looks like googling did her some good and I'm glad she was able to see how unreasonable she was being.  I think the framed pic and chain is a beautiful tribute to your wife and I think it's a good sign that you two were able to work through this situation.  Good luck!",
            "I'm so happy for you! This is pretty much the best outcome anyone could have asked for. Certainly better than I was expecting.\n\nCongratulations. You've found somebody worth holding on to. :)",
            "Awww she sounds very mature. She got emotional, had a rethink and decided it wasn't bad. \n\nI'm really happy for you both, give her a really really big hug yo. ",
            "Welp, I just cried over a stranger's life... So happy for you guys!  I think this is a wonderful outcome!  Yaye!!",
            "I am so happy this worked out the way it did.  ",
            "Dude, I'm really happy for you.  Too many of this sub turns out bad.  It's really good to read a good news story.",
            "I'm amazed she came around. She did a very sweet thing and I'm glad they both have a place in your heart, OP. ",
            "I've seen too many positive updates on this site lately.  I come here for the shitshows, not the feels.  Still, happy for you dude.",
            "I'm so glad she re-evaluated the situation. You seem like a great man, and I wish you both the best.",
            "You guys are going to be fine. You both have very good conflict resolution skills.",
            "OP this is a huge honking waving *green* flag! As others have said, it shows she can admit when she's wrong and change her mind. Very good sign for the future of your relationship with her.",
            "Yay!!!! This is awesome! ",
            "This is really touching, I'm glad it all worked out. \n\nI'm trying to work out what to do with my share of my Dad's ashes when I inherit them (my grandparents have some, my mum has some, and some got planted with a tree, after grandparents and mum pass all remaining ashes go to my brother and I) I really love the concept of turning them into a diamond. ",
            "As they say a diamond is forever...\n\nAnd patience is the greatest virtue!",
            "GOD FUCKING DAMNIT THAT WAS AMAZING TO READ!!\n\nShe went from she-beast to the woman who will stick by you through everything.\n\nGOD I AM HAPPY READING THIS SHIT!!!!",
            "[deleted]",
            "I'm glad she realized how wrong and selfish she was being. Sounds like she really came around and that shows a leap in maturity for her! \n\nCongrats and best of luck to you, OP!",
            "Googled \"Ring From Wife's Ashes\" It's the second result.. ",
            "I called her out in the last update, and I'm really glad to say I was wrong!  I'm glad she looked at it from your perspective and found something that works for both of you!",
            "I think several people hit on the fact that she was awkward about death, and that turned out to be right.  Good for you both!",
            "I was really hoping to read this kind of an update. I got the sense that M was relatively rational, but her judgment slid when she realized the ring contained your late wife's remains. It's easier for redditors and outsiders to look at the situation from another perspective because we don't have our emotions involved with yours and M's.",
            "Not sure if the fact that she found your post online or not matters, but when people suggested that she did I  got curious and just googled \"ash remains dead wife ring diamond\" and your post was the fifth results on the first page. So I would say it is very likely that she read your post and all your comments and any new updates and comments after.",
            "So she read your post on reddit ? ",
            "Can we place bets that she googled it and found these posts? ",
            "I'm a little worried about how easily she dismissed your feelings initially, and was using the ring as an ultimatum, then took a full 180. It makes me think she found your post, considering it's in the top 5 results for \"wife's ashes ring\"\n\nThe therapy is good start though.  Keep your antenna up for any other odd demands.\n\nGlad to hear it's getting better though.",
            "Nothing shows true character like being willing to admit when you were wrong and genuinely apologize for it. I'm so happy to hear that your girlfriend is willing to help you honor your wife's memory. ",
            ">She told me that she thought a lot about the ring (and even did some googling) and realized that it's not all that uncommon\n\nRead: She read your post on reddit.",
            "While I'm glad things seem to have a happy ending, I'm concerned by the complete 180 in her feelings about it. I doubt that someone with such an intense reaction to other forms of laying someone to rest would be able to handle the ring and chain as she did. Before, she gave the impression of intense disgust. She basically called you a freak because of it and I'm worried she switched the stone with another. Suddenly being ok with something that caused so much disgust just doesn't really happen.\n\nPlease make sure the stone is the actual stone.",
            "Was not expecting this but so glad to see it!  That's quite a turnaround.",
            "Wow! what a 180°! Who expected her to come to her senses after that  last update?  I sure didn't.\n\nGlad it worked out for you, OP.",
            "While her initial reaction was immature, the follow up took some maturity to do. I wish the best. ",
            "As a widow, who has my late husband's ashes in my home as well as many pictures of us together, and who has been dating someone for a few months...all of this makes me very happy. Best of luck to you, OP! You deserve happiness!",
            "My guess: She talked it over with a reasonable friend who told her how mean and ridiculous she was being and that it was going to cost her a relationship with a good man.",
            "> (I do)\n\n\nWoah woah OP. Marriage already? Haha just messing with you, great update. Best of luck to both of you.",
            "Yeay for communication and taking a good hard look at one's own actions. It sounds like this relationship is a good thing for both of you.\n\nHope things continue to go well.",
            "I'm happy you solved it.",
            "Did anybody else tear up? Just me? Okay. \n\nCongrats on a happy conclusion, OP. I hope you and M have such a lovely life together. :) ",
            "I wanted to read this! Yay for reason :D",
            "Where are those damn ninjas cutting onions?\n\nI'm very glad for you OP. Best of luck to you.",
            "Fantastic update! Glad things are looking up.",
            "We'd all prefer to hear you broke up than you get rid of the ring. I'm sure every one of your readers would agree that this is the ideal outcome.",
            "This is so lovely to read! Wishing you all the best, many adventures and a wonderful future.",
            "This is fantastic. \n\nApparently I've been cutting onions today\n\n*-sniffle-*\n\nI'm glad things worked out.",
            "Any ideas about why the first update was removed? Just curious.",
            "Glad she backed down from her crazy stance.",
            "This is much better than what most of us expected to read.",
            "That's awesome ! Best of luck to you both. ",
            "Thank god. Open communications and heartfelt apologies/emotions again saves the day. That's two days in a row. Congrats!",
            "Holy crap I'm gonna cry",
            "I like a happy ending! ",
            "Yay! I'm glad she came around. I hope you both will be very happy.",
            "Thanks for the one happy ending Ive read to any story so far today. I wish you all well.",
            "Yessss! I knew it was because of general discomfort! I'm so glad you guys actually talked it out.\n\nDeath and mourning are complicated; people jump to conclusions because they assume we're all on the same page. But, we're not.\n\nThe fact that this isn't her usual behavior too, is very telling. Her apology sounds heartfelt, and every relationship has bumpy moments.\n\nThe fact that you overcame this together, met and exchanged feelings, and were able to comfort each other and bond over it, means so much.\n\nYou guys are awesome. Here's hoping for a wonderful home and future together.",
            ":')",
            " I'm glad you didn't dump her because her ability to recognize how ridiculous she was  being and taking steps to correct her behavior is hopefully a good indication that she is mature enough to admit when she is wrong. Not everyone is capable of that level of introspection because it's uncomfortable.",
            "I am sorry you expected everyone to want you to kick her to the curb. It is hard knowing a man you are in love with ever loved another woman. Even harder when she passes and he isn't full of bad stories. She seems to have figured out the important things and made her peace. I wish the best of luck to both of you.",
            "Man, I guess it's too late for the ol' lawyer up, hit the gym, delete Facebook ",
            "I think most people were upset that she wanted you throw away the ring, which is basically throwing away your wife's ashes. Personally I think this was the best solution out of the situation.\n\nPersonally, I never heard of people turning ashes into a diamond. I did some googling and found people do some pretty different things out there. Like put them in a snow globe, or put them in a dildo urn. TIL.",
            "Youngish widower here.  I've had my issues with girlfriends and dead wife's pictures/belongings/etc.  I'm so happy M did some research and came to the right conclusion.  And I'm glad you are trying to make her #1.  No one wants to feel like a consolation prize.  Best of luck to you both.",
            "M is a redditor.",
            "I'm really glad M was able to do some research and work through that. I think you two will be stronger for it.",
            "I'm glad to hear everything worked out for you, OP :)",
            "What a fairy tale ending. Honestly I'd be a little uncomfortable with all that baggage too and I'm really proud of her for acting so maturely and sweetly. You guys are so lucky to have each other! Hope all goes well in the future. ",
            "I think that at the point in time your story was, M was not seeing reason. I mean of course her seeing reason would be better, but you can't really make her change her mind. She calmed down, did some actual self reflection, and made the right choice. Which is awesome! But it doesn't always happen and you can't really do much/anything to make someone see the light.\n\nYour relationship got a reprieve, its great. I hope you guys do well. I'm glad she had her moment and realized she needed to change. It wasn't so much everyone wanting you to end things in some sort of bloodthirsty FINISH HER! kind of thing more so than \"if her position is that ring can't be around\" then she's making the wrong choice and you don't owe her any compromise on that particular issue. If that is what causes the end of the relationship, it would have been the right choice for you.",
            "Fuck you OP. Got me choking up at work. Not cool.",
            "I'm so happy for you now! (:",
            "I'm a 34 year old male attorney sitting in a suit in a downtown cafe trying to hold back tears as I read this. I think people around me think I just got a bad text or something. This is truly beautiful. ",
            "I'm so happy she came around! Thank goodness you're with someone mature enough to be so self-critical and admit when she's wrong.\n\nI wish y'all all the best for your life together. :)",
            ">I know this is not what many of you wanted to read.\n\nWho cares what those plebs wanted to read.\n\n>tl;dr: M made big apology. Forgave her. *Happy*. \n\n*That's* what most want to see.",
            "This is such a fantastic update!! I am so happy that M realized that the reverence with which you treat your wife's remains shows that you are sensitive and kind and that it is the same reverence with which you'll treat *her*. You wouldn't be the you who you are with M if it weren't for your wife! I am glad things are working out for you. :)",
            "Wonderful resolution. That being said, I think it sets an unhealthy precedent to call your failure to tell her the third ring was your wife's ashes \"lying.\" It would be a weird thing to come at her with out of left field and you don't seem like you would have lied or danced around the truth if she asked.",
            "Tearing up. Sounds like you've had the good fortune to meet two amazing women in your lifetime. I wish you both the best of luck! It says so much that she came around, apologized, and did what she did.",
            "Out of curiosity, does your girlfriend have an Asian/Chinese background? Attitudes towards death and human remains are quite different, e.g. videogames like WoW being banned from showing skeletons.",
            "Good for M, and good for you! I was royally pissed off at all the people saying shit like \"good riddance\" in the previous thread. Everyone was so quick to assume that she was revealing herself as a controlling bitch, or a crazy person, or that she wanted to erase all evidence of your wife's existence.\n\nTruth is, sometimes we have gut reactions to things. She thought the ring was disturbing. She reflected on that and realized that her initial reaction was wrong. She shouldn't have acted the way she did, but she very clearly wants to make it up to you. I'm extremely glad that you're giving her the chance to do so, rather than listening to a bunch of judgmental assholes.",
            "I think what's important to remember is reddit tends to jump the gun a little on cutting people we feel seem toxic. This is because we've watched two many people not change and continue to hurt our OPs, while the toxic person they described did not change. This is why updates are so important. The person the op's describe in the beginning generally are waving giant red flags. We have never met these people, we have no idea of their capacity to change or come around open minded. Sure the op's will *say* how out of character blah is, how perfect their relationship is outside of said problem etc but half the people who post here have been so conditioned by either family, SO or outside influences that they can't really see how imperfect or dangerous their relationship is.\n\n\nI guess what I'm getting at is I think I can speak for us all when I say we're happy for you. We're seeing a different side of the person you posted about and it seems to be a good one. Sorry if we tend to jump the gun a little bit :)",
            "Wow this is what relationships are communication and doing one's best to understand while being reflective of one's self. I am very happy for the both of you and the strong relationship you will continue to grow.\n\nAlso not having stigma about therapy is very strong and nice to see as well ",
            "Can someone explain what the fuck how common it is has to do with anything?",
            "I don't know, I still think she's a weirdo. She has very extreme reactions. Therapy is definitely a good idea for her.",
            ">I know this is not what many of you wanted to read. You wanted me to kick M to the curb.\n\nNope, I definitely wanted to see M come to her senses and realize she was being ridiculous, so this is a great update! I think it's very likely that M found your posts if she did a little searching on your situation, and if that's what happened, it's a good thing she did. I wish you and M a lifetime of happiness together, OP!",
            "Sprinkle some in her food.    ",
            "Yeah, call me cynical but I'd keep a close eye on where the diamond is at all times. I have a feeling it might suddenly go missing/become replaced by a fake after she gets what she wants - move in with you.",
            "Keeping trinkets and reminders from an old relationship around when you're trying to start a new one is fucked up.",
            "I think you need to just move on from your dead wife. She's dead and no longer part of this shit world. Enjoy your new girl and stop being such a superstitious weirdo.\n\nHonestly, she might not have given a shit if you weren't so adamant about making this ring part of your every move. (Bed post, in your pocket everywhere) That shit's just too much. The ring should have just been something you had put away in a box of mementos or something. That you would be so cavalier \"This is my dead wife! This is my dead wife!\" suggests to me that you're a bit unstable and probably need grief counseling, cause man, you really just can't let shit go.",
            "[removed]"
        ]
    },
    {
        "post_id": "dx5vvr",
        "author": "AverageJohnDoeThe2nd",
        "title": "My (25M) girlfriend (27F) opened up about her past while drunk, not sure if I should talk about it or ignore it",
        "url": "https://www.reddit.com/r/relationships/comments/dx5vvr/my_25m_girlfriend_27f_opened_up_about_her_past/",
        "score": 3335,
        "num_comments": 131,
        "created_utc": 1573904503.0,
        "selftext": "A little background: I've been dating this foreign girl for a little over 2 months and we've had an absolutely wonderful time so far. Quite early on she already opened up that she has quite severe anxiety, but had medication and counseling to control it. Since coming here it's been really stressful for her with finding a job, a place to live, all the paperwork etc, but on top of that some of her medication is not freely available here, which she has run out of now. Once she has her medical insurance all set up, she'll be able to get other medication and go to a counselor.\n\nThis week she had a couple of drinks and got drunk. She called me after and we talked about some normal things, but after a little while she began opening up a bit more about her past. She said there have been periods where she's been depressed and at times had suicidal thoughts. I didn't really know what to say, so I said that I'm real glad she didn't because otherwise I wouldn't have met this wonderful woman. She talked about missing her friends etc and I tried to comfort her a little bit.\n\nI'm not sure how to handle this situation. She apologised for saying those things over the phone, which makes me think to just forget about it. But on the other side, I really want her to know that I care a lot about her, that I want to be there for her, that she can talk with me about these things and that it won't scare me away. Let her know that I'm in it for the long haul.\n\nTL;DR: girlfriend opened up about past depression and I need advice how to deal with it.",
        "permalink": "/r/relationships/comments/dx5vvr/my_25m_girlfriend_27f_opened_up_about_her_past/",
        "comments": [
            "Imo: You should let her know that you are thankful that she talked to you about her problems. It must have always been in the back of her mind. Tell her that she is a strong person and that you'll always be there if she needs someone to talk. She might feel bad atm because she deconstructed the image you had about her, at least in part.",
            "I agree with people's advice about thanking her. Opening about this stuff shows a person really trusts someone and thinks highly of them so while it's a lot for you to handle, it's a weird compliment as well.\n\nThat said don't be afraid to set boundaries around discussing stuff like this. My GF and I both have eating disorders (pre-dating meeting each other) and we both firmly refuse to engage in 'baiting' type talk with each other like when the other says 'do you think i'm gaining weight?' or 'did you read about this diet?'. \n\nWe will ask the other why they are feeling like they are needing that coping strategy right now but refuse to engage in the behaviour. We always try to do it with love as in 'I will not harm you by helping you self harm' rather than  shame like 'oh my god, why would you do that?'\n\nWe also found that often it was easier to open up when you weren't face to face so phone calls, texts, walking side by side or lying in bed in the dark made it easier to say vulnerable things such as disclosing feelings or setting boundaries. \n\nAnd for really really tricky stuff as we got to know each other better and read moods and cues we used certain animal memes and photos as a proxy. It's a bit like when kids ask if teddy can have their tummy rubbed when they feel worried about asking for their needs to be met directly but surprisingly adaptive to adults. My GF and I store up our chosen animal photos and memes and send them if we don't have words for stuff yet so the picture of the snake in a jumper says it for you and then becomes a shorthand so you can ask later 'are you a snake in a sweater kind of day?'\n\nI find everyone with anxiety responds well to boundaries and a lack of uncertainty so instead of her thinking 'oh shit what if he hates me now because it's 7 hours since I talked to him about this' you can text and say 'hey, just grabbing breakfast and doing the laundry so probably going to be off text for a bit but if you'd like to talk about stuff from last night, want to chat after dinner?'\n\nThat kind of response stops her spiralling which then makes he unable to talk it through later and sets your boundary that you need time to process it. It doesn't enable but creates the best possible way to come back to stuff for both of you. I always find it super helpful when people don't leave me hanging or return my vulnerability with sincerity.\n\nHope that helps. Also if it's appropriate offer to help her with the practicalities of finding meds and therapy in your country. It's hard doing that with anxiety anyway but even without anxiety having a native who just knows how the medical system or whatever in new place works really helps. \n\nOften a lot of living in a new country is translating the culture more than the language per se. I live in the UK and have played guide for many American friends who are baffled by the NHS or why British people queue so much even though we all speak the same verbal language. It really helps having someone show you instead of get knocked back or stuck.",
            "She doesn't want to be an emotional burden. Just let her know you are there for her.",
            "Here's the most important thing I have ever learned about being a boyfriend/husband.   \n\nYou do not have to fix everything.\n\nSometimes, you just need to listen and understand and support.   In this case, the knowledge of what she has told you needs to be held in confidence and paid attention to in the future.",
            "Hi OP! I’m basically in the same boat, but roles reversed! I started dating someone 2 months ago, and I’ve drunkenly told him things that I regretted the next day. I’ve apologized a dozen times over, but he reassured me that I can’t scare him away with my mental illnesses. Heck, we can relate on some levels, since we share ADHD. I still feel really guilty, but I absolutely feel like I can trust him even more.\n\nWell, I’m in the throes of a depressive episode, and I’m currently in hospital. I fully, entirely, definitely expected my boyfriend to get freaked out and break things off or at least back away. That’s a helluva way to kick off a relationship. But he blew me out of the water by telling me he’s thankful I’m getting help, he still loves me, he wants to sneak his cats into my room, he misses me, AND he visited and gave me a foot massage. I recently got privileges to leave the unit, and he said he’ll take me on a date. When I said, “I can’t leave the hospital...” he replied, “Then it will be a hospital date!”\n\nYou have no idea how much all of this means to me. Just like your girlfriend, I’ve let myself be vulnerable around him, and he responded with kindness that melted my heart. Vulnerability is very scary, and taking the time to say, “I know opening up is hard, I feel honoured that you let me in, and I will always listen” can make a world of difference.\n\nIn my opinion, let her know how you feel so she doesn’t agonize over it and try to push that vulnerability away from you. If there are parts of what she told you that make you concerned - talk about that, too. There is nothing quite as relieving as knowing that someone you care about WANTS to know about and support you through your illness, not just tolerate it as a side effect.",
            "Hi OP!\n In my experience as someone diagnosed with Generalized Ansiety Disorder and Clinical Depression, talking about how you feel can be even fisicaly hurtful because, on my moments of insecurity, you don't want to be a burden on those who are important to you. \n In your case, you are a important new person on her new fase, see how worthy you are? I would be terrified to lose you or scare you away because how problematic I am but also I would hate myself if I don't tell you about it. That's a brand new and delicate moment of her life, I clearly can see that she's problably stressed and insecure with all this changes at the same time while she tries to stablish her new treatment on this new location.\n All you can do for her is to be patient and compreensive, talk to her about feelings always (not only hers) because you'll open as safe place of conversation for both of you to be honest without gilty and shame.\nGood luck!",
            "It's good that she opened up to you. \nEven if you can't relate, just let her know that you care and you're there for her. \n\nYou should definitely talk to her about it, it will have been building up for a long time. \nI only moved about 125 miles across North england and I miss my old town (sort of), family, mates. I'm acutely aware of how old my mum is getting and how little time we have. I'm not a sociable person and so I ended up feeling a bit isolated and alone generally for the first couple of years, and you are missing the support of old friends and family.",
            "She’s apologizing because she’s probably feeling insecure about telling you that sensitive information because she isn’t sure if you see her differently/ treat her differently. I think it would be good if you told her that you are thankful for her telling you that sensitive information and that if she ever would like to discuss it with you you’re here for her. ( I’ve been the “gf “ in a situation similar)",
            "As men we often feel that it's our job to fix things, but this isn't something you can fix. Only time can heal this wound, if at all.\n\nShe wants someone who will listen and not judge her. You don't have to understand why she feels the way she does, either. Some things in life are inexplicable, and our emotions are often the definition of that word.",
            "Just be there for her, man. You can’t fix her, and she may never completely heal. Depression sucks, but it sucks worse feeling alone with it. As long as she’s seeking shelter in the warmth of your embrace, be that for her. If either of you are religious, do what’s appropriate there as well. Just don’t think she’s too broken to be worth your time.",
            "[deleted]",
            "You done good, kid. Just thank her for sharing, being vulnerable, and letting you support her. The rest will take care of itself.",
            "You can always tell her she is not obligated to talk about it, but you are there to talk about it regardless- this implies you care about her but doesn’t make her feel like she needs to talk about it all right away, nobody wants to feel interrogated about sensitive matters.",
            "For those that do not suffer from depression the idea of ending it all may seem foreign, but to those that do suffer from it, it's just part of life. Imagine that you constantly are being tormented and having all your flaws and imperfections shoved in your face by the person you hate most, for people with severe depression it's a constant, and that person is themselves. Depression is something we all feel, that elephant that sits on your chest at times, but for people with disorders that cause them to get stuck in that state it can feel like the whole world would be better off without them. \n\nIf she's opening up about this to you and you care about her talk her through it. If she's out of her medication I would recommend getting her in to talk with a doctor about options, the often have samples on hand that may be able to get her through until she is covered under insurance. Help her out without making it your sole purpose, be there for her to talk to if she needs it and spread a little extra love on her, she's away from home and we're heading into the holidays which can be hard on anyone, but especially someone with a depression disorder. \n\nTo ignore a problem is to put off a solution. We all should do a little better about talking to people and making sure they are ok. Having gone through that doesn't make her weak, but the fact she's still here doing things most people wouldn't even consider should be a huge testimont to how strong she is, so what if she needs some help, ya?",
            "As someone who still struggles with these thoughts, you should show her you appreciate her opening up, and encourage her to be more open and transparent. Love is a powerful tool.",
            "Speaking from my own experience with depression it's literally like having a demon bnb in your ear every day that basically puts u down. It's not really feeling sorry for yourself. You will get these thoughts like u are worthless stop trying to talk to people you know nobody really cares and you have to fight bbn it. As long as she has someone to talk to she will be fine I've dealt with it most of my life and it's just like everybody else we have a dark and a light side but depression tends to take on a mind of it's own.",
            "One of the most powerful and all around useful things to say in this type of situation is “I’m glad you told me.”\n\nIt’s hard to open up about your struggle. And now she is probably worried that she made the wrong decision to tell you, that she is burdening you with something that isn’t your problem, etc. \n\nThat lets her know that she was right to say something and you’re there for her.",
            "Do talk to her about it. It takes courage for people with anxiety and depression to open up and trust in people. Definitely thank her for sharing, and be there for her whenever she needs you to. Sometimes, all she need is someone to listen.",
            "Sounds like you found a human. \n\nA pretty good one at that as she's working on finding her own normal and not coping negatively. \n\nRelationships are worth investing in.\nVery few will ever be out-of-the-box *perfect. \n\n I have encountered women who have had very little hardship in their lives. And I have met women who have had the kinds of challenges where you find yourself truly amazed and inspired by their refusal to give into the pain and persevere. \nShe opened up. That, by itself, is difficult for many who suffer with depression as depression comes with a social  stigma. It already makes the sufferer feel different and seperate. So it often goes untreated for that reason. \n\nIf she opened up, and alcohol was needed, then she guards her secret. See it for the gift it was. Don't fear being strong for someone you love. \n\nIt's part of what loving someone is all about.",
            "Absolutely share how you feel with her. I was in a similar situation and I know full well that a woman would appreciate more than anything someone to care about them as much as you seem like you definitely would. There aren’t a lot of caring people out there, be one and she will find you very special.",
            "love and be around, no need to talk about it.It's painful to remember.",
            "Give her the biggest hug you can",
            "Absolutely please talk about it, while the two of you are alone in a private setting. It will be an uncomfortable conversation but its one that needs to happen",
            "Just tell her what you wrote in this post and ask her what she would like. Knowing that you're there if she needs you but you don't want to pressure her into talking about it more if she's not ready will be heartwarming, because it's thoughtful, supportive, and really really considerate of how she might be feeling.",
            "Just let her know your happy to talk about her problem because you care about her, if she said all this when she was drunk it probably means that she wants to open up about it",
            "This was so difficult for her to do that she needed to drink. Don’t ignore it, just be supportive if that’s what you want out of this. She’s clearly still struggling with it, so just be available to her and listen. She probably needs your emotional support more than your planning what actions to take.",
            "I would just tell her exactly what you said in your last paragraph. Those are the things she wants and needs to hear. I'm speaking as someone who also has severe anxiety and depression and has had a few failed attempts at suicide.",
            "All life has its loads. we try to carry them as best we can. When we meet others in similar circumstances we lend a hand or heart or both.",
            "You sound like a good guy. I deal with anxiety and depression from cPTSD. It used to be rough sometimes on my relationship with my husband. He always felt like he needed to fix things for me, and that caused frustration for him because he felt like nothing he said helped. He started being less stressed about it when he understood that I just needed support sometimes.\n\nJust listening can help. Providing support and love can help. So saying what you wrote here about wanting to be there and such will probably mean a lot to her. Also letting her know that there's nothing to apologise about.\n\nShe may not be aware that alcohol is a depressant. It doesn'tmean that she should never drink, but just being aware that she could feel mentally worse afterwards. Personally, I don't drink unless I'm in a good spot mentally, and sometimes, it still brings me down or makes me anxious.\n\nEdit: I should define support. Support is listening, holding a hand, giving a hug, validating that something is stressful or difficult. Support also needs to be spread out with a counselor, friends, and SO. So moving to a foreign country would really mess up her support system.",
            "OP, it's a big step to admitting such socially \"unfavorable thoughts\"  depression and suicidal tendencies can weight heavy on the person suffering AND their surrounding.  It does  not mean that this person cannot be happy and spend some time under the proverbial \"sun\" without having to worry about \"those feelings\".  Try your best to be there for those good and less bright days.  One day at a time.",
            "I’m so grateful that I read this post. It’s so sweet and genuine. Honestly just tell her exactly what you said here: you’re in it for the long haul and you want to be there to comfort and support her. Be open and honest about your feelings! All the best!",
            "Sounds like you handled it great on the phone and she's very lucky to have you. Just make sure to reassure her that you appreciate her trust in you and are always willing to listen.",
            "Thank her for sharing. You dont have to say anything that's the awesome things alot of times we just need someone to listen. You can totally ask if there is anything you can do but most of the time people already have the answer it's just that whatever is wrong is weighing on them but generally we figure it out if we just vent to someone. And that's everyone tbh",
            "Your overthinking it. Yes she was drunk but drunk people are sometimes the most honest. She wanted to tell you, and you should be glad about that. As other have stated, thank her. Drunk or not, it's not easy to open up like that. Tell her you got her back. it doesn't need to be a big thing.",
            "Everyone has suicidal thoughts at times. I tell my boyfriend about it, and he says he's there for me. Also ask, do you want to talk about it more?",
            "Totally just my opinion but there’s sometimes stuff we got to work through our selfs.\n\nMy advice, just be there for her when she needs. \n\nDon’t smother her\n\nDon’t try and fix everything\n\n... and Don’t tell her to ‘ Just cheer up’\n\n\nLet her know you got her back if she needs it. Even if that’s just a ear to listen or a shoulder to cry on.",
            "I lived for 12 years with a woman who had sever depression and anxiety. In fact, we now know that  she had complex PTSD.\n\nA few things, this may seem obvious but you are not the cause of any of her depressive or anxious episodes. When she has a bout of depression, the best thing you can do is be supportive, understanding, and show her you care about her.\n\nAlso, this is not her fault either, although she will likely claim it is during an episode, even if logically she knows better. The best thing you can do is be supportive,understanding and show her you care about her. \n\nWith all of that said, the responsibility to get help is on her, but she seems to be doing that. She is probably worried that after finding out this information your opinion or feelings about her have changed. She opened up a huge vulnerability to you. And she is asking a lot of you to be involved with someone who is depressive and has anxiety disorder. You don't have to stay with someone who is with those issues if you don't want to. But ignoring this will not help anything, acknowledging it will let her know you care and let y'all each make the best decision for yourselves moving forward. She probably doesn't want to continue the relationship with you if you are not willing to be supportive of her illness. Not that you have to, again, you don't. But you each need to know where the other stands.",
            "Yeah just be supportive OP. At the same time encourage her to get mental health treatment so things don't get bad like that again. For future reference you might wanna look up local mental health crisis hotlines in your area too- just in case things get bad. As a significant other you can be supportive of her, but that doesnt mean you should be her therapist or her only source of support.",
            ">But on the other side, I really want her to know that I care a lot about her, that I want to be there for her, that she can talk with me about these things and that it won't scare me away. Let her know that I'm in it for the long haul.\n\nThen tell her!!!\n\n\"Hey gf, I really want you to know that I care a lot about you, I want to be there for you, and you can talk with me about these things and it won't scare me away. I'm in it for the long haul.\"\n\nDone, and ya wrote it yourself already.",
            "A lot of people go through this. Just be there for her. You have no control over how someone feels. You can influence but it's always up to them on how they feel.",
            "Only let her know you are in it for the long haul if you really are. I recently had a suitor declare their love for me. I told them to hold the phone. And explained to them that I’m not the perfect person they were making me out to be and that I can really struggle at times. They told me we could be there for each other and grow together. Then jumped Ship the first time I was having anxiety attack.",
            "What I cant get past is how considerate you're being with the whole situation, that is amazing of you. Many people suffer anxiety and depression and the stigma behind it often keeps them from opening up, and it's great that in that weak moment you let her know you still love her regardless. \n\nI would say, this isnt a conversation for you to bring up again. Especially if she had been drinking when she confided in you.\n\n If she starts acting out and you suspect her mental illness is acting up, maybe broach the topic in a way that lets her know you're only looking out for her better interest. Otherwise, I would say just be considerate like you already are and treat her very gently. \n\nSome days she may need some extra love, and if you're willing to give her that, that's all anyone can ask for.",
            "Depression and suicidal thoughts happen. You should address it. Let her know you’re glad she shared and you are there for her. Being someone she can talk to about anything is important in a relationship.",
            "Better yet, say it in  card that is heartfelt that she will always have when she feels down and knows that she can come to you.",
            "She is alright, she is honest with you, thats very good, looks like she trusts you very much. These are very deep, personal and private thoughts.\n\nLooks like she is going through a lot right now. She has a lot on her back. For all that she is going through right now, its normal. Put yourself in her shoes, be a foreigner, jobless, homeless, paperwork hell and health issues. How would you cope?\n\nAll i am saying, is that if you love that girl, you shouldn't give up on his girl, but quite the opposite. Help her, support her. It will take time to get things right, maybe even years, but when that happens, you'll get to see happier, more fun sides of her. Help her get there, and perhaps, you will have a bond for life.\n\nEDIT: After reading your post again, it seems you are there for the long haul. So let her know that!",
            "I've been in a very similar situation with my current girlfriend (Foreign girl, depression etc). \n\nLove her, show her you care by just being there for her. By her some chocolate and a rose for next time you see her and just make her feel loved. Being in a different country can be scary and exciting but having someone she can feel close to will definitely help.\n\nThese aren't issued to be ignored of course, but just let her talk to you about them when she's ready.",
            "It's another, large step into the relationship. You need to jump on that and double-down on how happy you are that she didn't off herself, and felt close enough that she drunk dialed you and brought it up.  Stress that, without the creep factor, you really like your time together. Maybe if she needs help(not financial! ) you can help some way.",
            "Tell her she doesn't need to be sorry about the conversation and that you would be happy to talk about any of those things if she wants to.",
            "Let her know that she can talk to you about her problems. But dont push her to talk about her past it will push her away. She will talk to you in do time.",
            "All you can do is love her and be there for her, man. Thank her for telling you. And remember to take care of yourself as well.",
            "I would definitely bring it up to her. \n\nDoesn’t have to be a really serious conversation, just enough to know you hear her, you care, and you’re here for me. Lowkey could be a little subconscious test of hers to see if you’re gonna stick around. From your post, it seems like you want to, so I’d definitely make that apparent by being supportive",
            "You are the best of boyfriends. She trust you. And you fully support her. I think the best thing you can do is continue the support.\n\nBut I would recommend you help her navigate the medical resources. There has to be non profit agencies that focus on mental health issues. Depression is can become an energy sucking killer. She needs to be able to get a script locally and resume taking her meds.",
            "I would start with addressing it again with her briefly, tell her you are thankful for her trust whether it was genuine or the alcohol, you arent at liberty to discuss her matters with anyone but her. Validate her conditions, tell her while you may not understand it 100%, youll do your best to support her in any way she needs that you are capable of helping with. Understand that with severe depression and anxiety, those 2 will play off eachother, depression is feeling like no one cares that you're suffering, anxiety is feeling like everyone is watching you suffer and not helping. Another huge yet simple thing is just making her feel included, just because she doesnt accept the invite a few times doesnt mean she wont ever accept it, sometimes when someone is struggling getting invited to something fun and exciting is sometimes better than actually doing something fun and exciting because its exhausting being depressed and being anxious.\n\nGood luck friend.",
            "Just that you’re writing this alone shows how much you care about her. Looking into what you can do to be there for her... it’s respectable and incredibly mature. \n\nI think if you’re comfortable with it you should certainly bring it up. Let her response dictate the depth of the conversation. If she wants to open up more when she’s sober, let her. If she doesn’t add much or changes the topic, that’s fine too. \n\nI’m just one person- but I know it would make me feel really loved/ cared about  if my SO did that for me.",
            "People tend to express themselves to ones they are closer to when intoxicated. Take it as a positive that she felt the need to tell you,maybe she didn't know how to say it out when sober. But since now you know, you both can still have a chat about it and you can always help her out.",
            "You should let her know everything's okay. And if she ever needs to talk that your there. That you understand and love her",
            "> But on the other side, I really want her to know that I care a lot about her, that I want to be there for her, that she can talk with me about these things and that it won't scare me away. Let her know that I'm in it for the long haul.   \n\n\ntu duuh, you answered yourself :)",
            "Honestly what you after \"But on the other side...\" sounds like exactly what she should say.  Maybe put it in a card or a note if you feel like she won't hear it if you say it face to face because she's so uncomfortable with talking about it.  (I know that feeling from both sides honestly.)",
            "I mean in all honesty, I would just bring it up next time. Say hey you brought that up the other night, then later apologized. And that you want to let her know that if she ever wants to talk to you that you’re there and that you really enjoy her company. \nIt shows you’re compassionate man. \nCompassion goes a long way \nGood luck and best wishes  ✌️",
            "It means she trusts you. It took a lot of trust to open up to my boyfriend about my depression and how severe it is. However, I wouldn't start a conversation about it with her unless she wants to. Just tell her that it means a lot she trusts you to be so honest and that if she needs to talk you're always there. Sometimes it will be some heavy shit, but sometimes we just need someone to listen. All that being said, if you aren't in the right state of mind to take on other people's issues, it's okay to say you need a second to recoup mentally.",
            "I would just say to her. * I'm glad you felt comfortable enough to share that with me I know you are having a hard time so I'm glad I can support you it's nothing to be ashamed of everyone has a past*",
            "Hey, all states have Mental Health funds to pay for counseling. They can connect her to a prescription program. It’s for everyone!",
            "Tell her just what you told us.  That will mean a lot to her. Good luck OP. 💕",
            "The best thing you can do is to seek to understand, then to be understood. Step 1 is listen and try your best to understand her, and when she answers something, seek to understand; Ask her if your interpretation of her feelings are correct, to confirm that you understood her. If she says; well I thought xy and I felt xy during this time because of xy. Your answer would be; so because of xy you felt xy and had xy thoughts in your head? Her answer would be: \"Yes exactly\" or something that confirms your understanding.\n\nAlso, ask her to go more in depth about certain things when the time is right. Let's say she mentions the feeling of a particular day in her past, ask her to elaborate on what happened during that day, then again; seek to understand. \n\nOnce you have the basis of why she feels the way she does and she sees that you understand her, you can make her understand that you're always ready to listen, and understand. And if she asks for advice, be honest and tell her that you're not an expert before maybe giving her some of your thoughts/advice on the matter. That alone, simply listening and understanding can already be extremely helpful. It's called empathetic listening. Where you literally only listen, and answer to see if you have understood what she said. Not just nods and mhm i see's or \"aha I see\" etc. But I don't hold you for that type of person anyways.\n\n I have a friend that when I tell her some deep stuff, she listens, but she doesn't try to understand, barely asks questions, barely says anything at all. It's 100% eye contact and nodding. But that doesn't give me confirmation that she understands my problems. And the advice to social anxiety I got was \"to get out more often\". I didn't ask for advice, I simply wanted her to understand, but she didn't try to do so. And that in turn left me hurt. It makes me not want to open up again because now I'll be afraid she's just gonna sit and nod like a puppet and disregard my problems with a mainstream piece of advice that I didn't need. \n\nSo, try to understand her. Don't be like my friend when it comes to these things. But I've already mentioned that I think you're not the type of person to nodd and go mhm all the time.",
            "Tell her exactly your last sentences here - you care, you're there, and she can talk to you without fear of rejection. Simple and open reception, to me, seems to be exactly what she was looking for. Good catch man, y'all be well",
            "OP, you are an incredible person to be so supportive of her!! A lot of men would run for the hills, so it says a lot about your character that you are trying to help her and you are in it for the long haul. Talk to her, let her know how you feel, and that you are there for her 100%.",
            "You have to talk to her about it!\n\nShe needs to be able to open up to her boyfriend completely, you cant be really close to her, if she does not and she will fear loosing you if she tells you what is rly going on inside her on bad days, which will sooner or later rather feed her depressive tendencies instead of keeping them in check as much as possible.\n\nIt is not easy to have a partner with depressive tendencies, so also for your sake, you have to find out if you can handle her issues. Way too often partners hide their issues completely way too long and then the fallout of not being able to resolve them together is immens (at worst until having a kid).",
            "It’s really sweet that you’re being supported. I low key don’t want to congratulate you because this should be the standard but it’s a standard most people fail at these days",
            "You're a great guy. Not only did you listen to her, but you care enough to come here and figure out what's the best thing to do. She trusts you, and that's a beautiful start to hopefully a long relationship.",
            "> She apologised for saying those things over the phone, which makes me think to just forget about it.\n\nShe probably felt like she needed to. I have anxiety and have compulsive tendencies and I am a compulsive apologizer, especially when it is dumping my stuff on everyone. The problem is the reassurance and guilt I feel. \n\nSo, I think she really wants you to tell her that it's all good, any time, and reassure her this: \"I really want her to know that I care a lot about her, that I want to be there for her, that she can talk with me about these things and that it won't scare me away. Let her know that I'm in it for the long haul.\"",
            "I'm this way, so just be ready- even on meds there's gonna be deaths, family issues, rough periods..that a magic pill doesn't fix especially if it's due to unresolved past trauma. Also self medicating with alcohol or drugs to numb the pain",
            "Thank her for opening up. Reassure her that you appreciated the fact that she did and let her know that you will always be there for her. Exactly as you said it. That you want to be there for her and this didn’t scare you off.",
            "Running out of meds is a HUGE deal. She could get very bad side effects. Maybe help her find a free clinic that can help her with medication now.",
            "Sounds like she has opened up to the point where she may regret it. Have you ever been at a turning point in life that made you feel insecure? If so converse about all of it.",
            "U are already doing right by acknowledge what she said to u , also she going thru lot of change and stress at moment so she no doubt feeling quite vulnerable, just support her without trying to fix her xx",
            "Tell her that it’s okay she’s gone through things that have made it difficult for her to adjust and that you accept all the perfections and imperfections she has, and most importantly you value the honesty and trust she was able to give you by opening up. You don’t get over anxiety but not talking about it. Talk therapy, cognitive behavioral therapy, and EDMR are all powerful tools along with meditation. The most powerful tool is encouraging her (lightly) to face her demons using tools like these. Medication is helpful for anxiety with talk treatment of some sort but a bandage is usual not the actual cure to get rid of anxiety.",
            "U can show her  that u care , be there for her support her in those hard times let her know that no matter what you will aways love her ...",
            "Thank her for opening up and talking about her problems but avoid marrying/LTR her.",
            "She will feel safe if you do the same. Share your deepest thought with her. \n\n\nUnless she's an undercover FBI agent. (Pun)",
            "Give her a hug. Talk about it, and hug it some more.",
            "You should hang out in person, snuggle up, and say exactly that. Most likely she apologized for saying this over the phone because she would’ve wanted a hug in this situation (that’s what i would want).",
            "Oh man maybe I read this wrong but the title gave me a totally different idea of what her “past” was going to be lmao",
            "First of all, get her to download the GoodRx app. It provides substantial discounts for prescription meds and she may very well be able to afford her medications until she gets her health insurance set up. As someone who's been with someone with severe anxiety and depression for a long time I can tell you that it's nearly impossible for her to deal with the rest of her life if she doesn't have her medication. And if she's out, she might also be suffering from withdrawal symptoms which, in the case of many anti-depressants and anti-anxiety drugs, can be pretty severe and even make her anxiety and depression worse. Please do what you can to help her stay on her meds before trying to deal with any of the other stuff.",
            "I think in this situation forgetting it is simply not an option- but reifing her problems and mental health into a bigger deal than it already is , would simply add further stress indicators for her.\n\nThe most important thing is ensuring she can be stable- which sounds like she may need supporting medication- there should always be something called a reference drug that she can take - has she spoken to someone over here yet??\n\nEDIT : and I agree, thanking her for opening up is important, as well as being strong.",
            "If you care about her then just being there to support her is all you need to do. Acknowledge it and make her feel like she never has to get into that state ever again, over time love and happiness will prevail (hopefully).\n\nGood luck dude.",
            "I think mental health is a very important aspect of one's life and I think that if you want to go deeper in the relationship it is important that you know the details of each other's mental health. She was brave to tell you and you did the right thing in listening to her in a reassuring calming way.\n\nIt is probably a good idea to talk about it again, when you are both sober. It is also very good that she is aware of her mental health issues and that she is/has been taking care of it.\n\nWish you two best of luck! :)",
            "I echo everyone else’s sentiment, but also want to add that there are some natural herbs she can take in the meantime to help with anxiety, until she can get her insurance and meds sorted. I suffer from extreme anxiety, but pharmaceutical drugs don’t work for me. A tincture of passionflower, lemon balm, or hops may help her some. It’s not the same as getting her meds, but it might help her relax and feel less anxious. Cbd can help too.",
            "She will talk more about it. You should prepare to either live with that or leave her.\nIf you decide to listen to her issues, then make her feel confortable. Tell her she doesn't need to drink and she can speak openly with you.\nIf she ended up telling you that it's enough evidence to safely assume she needs to talk about it.\nIf you don't want to get involved, she is giving you the best chance to bail out. Of course hearth speaks louder and you will be at her side even in the event of  you not being confortable. But then you already know what is happening.",
            "I always feel really honored when someone is willing to be transparent and vulnerable with me. I think you feel the same way based on what I’ve read. I think you should tell her that, you don’t have to make a big deal out of it or bring up the specifics - but just let her know that she has nothing to be sorry for and there is no reason to apologize. Tell her you consider it a privilege and feel even closer to her now and that you want to be that safe place for her to land - cause that’s what love and courtship is right? Finding someone who feels like home and building a figurative house with them.",
            "Cats out of the bag. It ain't going back. And she suffers from some mental issues. They don't just go away.\n\nDon't push her into talking about it, but basically say what I just said; Mental illness doesn't just go away and if the two of you want to make a Go of this relationship, you deserve to know more and to be part of the solution. \n\nLet her know that you're willing to support her emotionally, if she'll let you. And that you want to talk more about it - when she's able.",
            "She is such a lucky person",
            "Hello OP. She doesnt want to bother you, and you should be thankful that she opened up to you. \nNow comes the unpopular opinion:\n\nLet it be. Talkin out of experience. Once upon a time i was naiv and young and i thought its worth it to put up with a mental illness like depression while me beeing totally healthy. Its not worth it. Tried it two time cuz unlucky as i am i fell for a depressive woman two times. It didnt make me happy and it wont make u happy. \n\nWhile i cant say i am picky with woman, by now i realised that there are plenty of fish in the sea and altho it hurts, its not worth it to waste my time on a depressed soul. I feel like having the right to be selfish on that one. Depression drags u both down if u really gonna happen to love her one day. Escape as long as u can, even if it means hurting both of u. Better sooner than later.",
            "I don't think you should ignore it at all. Being drunk makes us do things we are not comfortable doing, both good and bad. In this instance, I think she is letting out something bottled up. Embrace that and talk to her about how you are there for her. As far as anxiety and dealing with that, I always recommend to people to work out more. Our bodies need that in general, it releases pent up energy, and gives us endorphins which reduce depression and anxiety. Just keep in mind, you are a support and not a crutch so focus on doing everything together.",
            "All the responses are of one point of view. I feel compelled to give another point of view and I know that many won't agree because all I see is one view point. I would say consider gently and respectfully ending the romantic relationship. I'm going to come at this from a pragmatic and non-emotional view point, which is the benefit of posing a question online. The reason I give is that we are all a result of our genetics and experience, regardless of what happened to her... her response has been to be self-destructive. This is a risk to yourself and your future potential children. Stay friends with her and help her, but you are not obligated to be in a romantic relationship. Young people sometime feel compelled to fix their partners. I will be advising my children to help people but not necessarily within a romantic relationship",
            "I’m done with all that. I’ve had it all. Suicidal gf, stalker gf, rape victim gf, gf that is diagnosed with bipolar personality disorder, gf with an alcoholic abusive dad, gf with alcoholic abusive dad AND drug addict brother. No more. I know it’s cruel, but without exception, girls like that are a gamble. Now when I find out that a girl has any of that, I’m out. It’s not like I look for these girls, but somehow I find them. \n\nI have become so aware of this, that once, I met a really cool girl, we had a great talk and we were both attracted to each other. So After we spent 3 hours talking, I looked her in the eye and asked what dark thing happened to her, because something did happen. Her surprise was all over her face. Turns out, parents dead, taken care by brother who wed her to his best friend to get her off of his back. She cheated on her husband, they were in divorce proceedings. \n\nI want a “bland, boring” gf that has a loving relationship with her parents and siblings, no polycystic ovary syndrome (which can affect mood swings), no chronic mental issues. I’ve had my share of heartbreak, and I’m one bad relationship away from giving up on the idea altogether.",
            "Just let it be the only unnormal thing as people get a little stressed now a days instead of coping with shit they medicate people to levels of stupid. Shes fine let it be it's not a big deal. The problem is basic feelings everyone has are now made into a big deal to the point of being crippling.",
            "Dump her psychological unstable ass.",
            "Thank you for sharing this. \n\nI hope and pray that she seeks peace and strength in Jesus. \n\nJust like all of us...\n\nShe needs Christ. \n\nJohn 14:6 🕊",
            "If she was drunk just move on and don'ttalk about it.  Wait until she is sober",
            "Speaking from personal experience, she should NOT be drinking. People like us all too often use alcohol to self medicate, because well...it works (at the moment). She might be substituting booze for her now unavailable meds."
        ]
    },
    {
        "post_id": "qb0cip",
        "author": "Epicyclez",
        "title": "[Update] My [27/F] GF [30/F] hasn't had a job in 4 years and it's wearing me down",
        "url": "https://www.reddit.com/r/relationships/comments/qb0cip/update_my_27f_gf_30f_hasnt_had_a_job_in_4_years/",
        "score": 3334,
        "num_comments": 106,
        "created_utc": 1634605105.0,
        "selftext": "[Original post](https://www.reddit.com/r/relationships/comments/jjb9kf/my_27f_gf_30f_hasnt_had_a_job_in_4_years_and_its/)\n\n# TLDR: Broke up. She was taking advantage in the last two years.\n\nI posted about a 4 year relationship causing me mental, emotional, and physical health problems due to said partner failing to find a job or contribute to the finances in any meaningful way. I made the post at the height of the COVID in my area, trying to keep the relationship alive. At the time, we had moved to a new state and a smaller town to live more cheaply, and to help address my physical needs that couldn't be met in the city with everything and everyone locked down. \n\nThings were good for a few months. However, the job question came back again. I was working full time, and had taken on new responsibilities for keeping myself in shape, working hard to lose the weight. That's when I noticed she was just kind of... existing. She wasn't excited about anything in the area, and wasn't doing much to find jobs. I had a talk with her in October, and we agreed that perhaps my request that she find a salaried 9-6 job could be relaxed, and part time would be sufficient to help out. After all, I only needed two things from her: space from time to time, and her to help out in any way she could with the finances. \n\nThe first of two final straws occurred that winter: I was working to build a new business from scratch, and I had to leave my job in order to do it, which meant around ~4 months of negative income. It was going to be tight, but she agreed to help support by finding an easy job. This support never came. She couldn't do it, or didn't want to. I began to notice it felt more like the latter. As a result, we barely made rent in February, thanks to my taking on contract work on the side (effectively working two jobs). \n\nWe had a huge fight in February over this. I wasn't willing to be that close to being homeless just because she didn't want to work a job that was beneath her qualifications. I made it explicit that this was a deal breaker for me, and that I would not move an inch in the relationship until she started contributing in the way we discussed. She agreed. \n\nAnother 5 months went by with no job. At this point, frustrated with her lack of success, she asks me to move with her to her hometown and move in with her parents while she looks for a job where she had a network. I flat out refused and we went on break. I moved to a new state and hoped that maybe some space would allow me to think clearly about the relationship.\n\nBy September this year, I realized I felt completely happy to be on my own, and stress free. We broke it off completely. To my knowledge, she still doesn't have a job as of this post. \n\nI feel used, emotional, physically, and financially abused, and hurt by how casually someone could run me into the ground like this. But I also feel hopeful about myself, and I'm seeing a therapist who's helping me unpack it all. Further, my business was worth it, and it's taken off and given me enough time and space to deal with all of this while maintaining a healthy lifestyle. \n\nOverall, the biggest downer is I feel like i've just wasted 5 years of my life with someone who I'm fairly sure was a subtle abuser the whole time. It hurts to say it, but the way I always felt like the bad guy, or the way she would guilt trip me and keep me from my friends... bad news. I'll never let anyone do this to me again.",
        "permalink": "/r/relationships/comments/qb0cip/update_my_27f_gf_30f_hasnt_had_a_job_in_4_years/",
        "comments": [
            "You didn't waste 5 years, you saved yourself 50.\n\nThis experience will help you if you decide to have another relationship. You will know how to identify positive traits and will not give too many chances when dealing with negative traits. You're much more likely to have a happy future.\n\nWell done x",
            "I feel you! I went through the same shit with my ex bf. I supported him for 6 years. It burned me out so bad that I resented him and fell out of love with him. It took me a long time to finally end it (long story) but when I  broke up with him and walked away, I could literally feel the weight of the world lift from my shoulders. It was so liberating.\n\nI applaud you.",
            "You didn't waste 5 years of your life.\n\nYou learned A LOT from that relationship, and you are going to take that knowledge and apply it to find a much healthier partner for you when the time is right. You know how to see the signs now of a bad partner. You know where you need to draw the line.",
            "[deleted]",
            "You did the right thing.",
            "It's done. You're relieved of that burden. Learn from this. Grow as a person from this experience. Can you ever let someone take advantage of you like this again? Not likely!\n\nYou'll get back on track. The weights been lifted, mate. Good luck.",
            "Not every relationship is forever, but if you learned and improved yourself and discovered what you do and don't want from it then it wasn't a waste.",
            "You sound like you have an amazing work ethic. You're young, and you seem to be skilled and talented. Combine all of that and you sound like an amazing person. And we know you're compassionate, because you gave your ex every possible chance and then some. \n\nYou're a catch, and you deserve to be with someone who both appreciates you and complements you. \n\nYou've got this!",
            "I’m so happy you finally ended this toxic relationship! As as a person who had financially supported my ex 9 years my senior, I know exactly how you feel. I’m just glad that you got out and hope that you’ll meet someone who can help you build a future as you rightfully deserve.",
            "Reading this felt very familiar. You did a great job, man. Get ready for the shock of being with someone who will actually put effort into your relationship/life together. It feels amazing.",
            "You’ve likely learned some extremely valuable lessons in terms of your relationships, and what you need from someone, I don’t think five years is wasted, it just took longer to figure things out when your head is clouded, and you were  mentally and physically trying to maintain a relationship on top of everything else.\n\nNow you know what kind of person to invite into your life, my guess is you’re going to have a very short fuse with those type of behaviors in the future, and this is a lesson learned early",
            "I'm sorry that this happened to you! But on the bright side: now you have a better eye to avoid such a person again, and your life only has up to go from here on out.\n\nFind someone who values you, your friends, and your needs! You are not a piggybank, you deserve love and respect like any other person.",
            "I have just been through a similar relationship (though not as bad), I think you did the right thing. \n\nI loved her but she had no goals really, was so painful watching her waste her life away doing the bare minimum everyday, even in our relationship...\n\nGood on you for getting out of an abusive relationship. I know exactly what you mean when you call it that. It drains you, and you can talk to them till your blue in the face. They won't change. \n\nBest of luck with the future of your business!",
            "I was with a guy who had a job when we met, but as time went on, he worked less and less. We had to keep moving to smaller and smaller apartments. By the end of the relationship, he had gotten a really great job that was exactly up his alley, but he was rarely going in to work.\n\nHe wanted to buy a house but had barely any income. Turns out he was telling his friend that he was excited for me to \"buy him a house\" in the area he wanted so he could hang out with his friends all day.\n\nOnce we broke up, a huge weight was lifted from my shoulders. You did the right thing. And it wasn't a waste, it was a learning experience.",
            "When I first came out to my family as gay one of my aunts told me that she was concerned I would ever find someone to love me. Her concern became something I then started worrying about and then proceeded to date people that had interest in me regardless of any red flags. My confidence was low and I endured many long term (going nowhere) relationships. Three of them in fact (1st 5.5 years, 2nd 5 years and 3rd 7 years) in total 17.5 years of being with people that did not appreciate me. I had two amazing children with the last relationship, but that ex partner has been financially and emotionally abuse post break up, so that relationship really is not over until my kids are adults.\n\nAs queer people we receive so much negativity that it is hard to not internalize it. And it can effect us in ways we don't even realize it.\n\nI hope you realize your worth well before I did.",
            "[deleted]",
            "I'm glad you could find your way to fulfillment. Yes, it can be tough to get over a bad relationship, especially when you feel like you've wasted your time with the partner, or feel exploited. But such is life. Therapy should certainly help you feel better about it all. I think you're much wiser now, after all that happened. I'm really glad you stood up for yourself.",
            "Good job leaving. I was in a relationship like that with someone like that. It's a waste of time.",
            "You spent 5 years growing as a person and growing your life around you. It's a shame that you were being weighed down, but you persevered nonetheless. I'm glad you're doing better now and good call on the therapy - helped me out an awful lot in my time doing it. Keep the great work up and find someone who's ready to grow with you.",
            "Had an ex that was the same way.  She liked to use the excuse that she \"contributed love.\"\n\nI asked her how \"love\" was supposed to pay the bills...\n\nNever did get an answer.",
            "Narrr you haven’t wasted shit you got a mad life lesson and your in therapy that’s the best place anyone can be I think",
            "A lack of drive is a huge turn off for me in a relationship. I am most attracted to goal oriented people. I also would never want to be the sole supporter for someone. I think it changes the power dynamics too much. I like independent partners. I can only imagine the toll it would take to carry someone like that for so long. Sounds like splitting up is the best outcome.",
            "Don't beat yourself up about it. I'm sure half the people who post in this subreddit have lost a huge chunk of their 20s propping up layabouts. What amazed me when I dumped my layabout was how much cleaner and well-organised the house became. How can you do so little as to not even do a bit of housework? And I didn't even dump her because she was lazy but because she kept slapping me.",
            "Keep your head up champ. You’re crushing it",
            "I was in a similar relationship and leaving was the best thing I ever did. I moved on, found another partner. She is a hard worker and we are a team, only then I realized how much was wrong in my previous relationship.",
            "good luck for the future OP !",
            "You did it! You're free!",
            "Time is of no consequence when it comes to learning our lessons.  The lesson is to love yourself so much that you won't accept less than you deserve.  And you deserve the world ❤",
            "Not excusing your ex at all but she sounds super depressed. Or lazy as hell. Or possibly both.\n\nGlad you’re out of that relationship! Thriving and on your way to health and happiness. It wasn’t all a loss. You learned a lot about yourself and how you want/should be treated in a future relationship and at the end you held your ground. Good for you dude!",
            "Cutting you off from your friends is a red flag.  Unless your friends are serious bad influences, like addicts, criminals or something unsavory, cutting them off is always a trap.  Your abuser doesn't want you to see other people who will question their behaviour.",
            "She's the one who lost. You are bettering yourself while she's staying stuck in a rut. She'll eventually have to realise that she'll never find a guy who'll just accept her laziness (or could it be depression?)",
            "Thanks for the update 👍 \ngood riddance and good job moving on",
            ">I feel like i've just wasted 5 years of my life\n\nIt's not wasted if you learn from this and don't make the same mistakes and keep moving forward.",
            "You live and you learn",
            "It's going to feel so good when you finally find someone who has their life together",
            "Wow, I remember reading your post and hoping that, whatever happened, you would be okay! I am so incredibly happy for you. Your future is bright and will be filled with much happiness 💖",
            "I am so depressed.  6 years and she hasn't worked.  I hate my life.  She doesn't work out.  I honestly just want to die.  She has killed my spirit.  I can barely function now.",
            "Dude, you and everyone else. Most romantic relationships suck and take the zest of life out of you. Get therapy and don’t look back.",
            "I didn’t finish reading it but if your partner can’t hold a job and help with the finances, time to find someone else.",
            "You realize if you had been married you would have been required to give her half your stuff and pay alimony.",
            "Is this something she tried discussing this therapy? Unless she’s actually using you it could be debilitating anxiety/social anxiety preventing her.\n\nNo you didn’t waste your time you learned a lot. Congrats op for doing what’s best for you!",
            "Long term unemployment is a tough traugh to get out of.. employers see how long you been out of work and they don't bother. That's why a lot of people stick to one job thier whole lives.\n\nBasically.. it went on too long and she gave up. Unfortunately for her it also cost her a relationship with a working man - most women, especially in the US, are usually the ones carrying the forever jobless guys.",
            "I get you're upset but you weren't financially abused. YOU CHOSE to pay for her, for years. That was your choice. She never forced you. It was your choice to keep the relationship going despite the advice given to you. Despite the fact you claimed it was a deal breaker you kept dating her for almost another year. \n\nShe was a shitty partner and maybe even used you, but you also made choices you're gonna have to deal with at some point when you're ready.",
            "Shes a narcissist. Just like my ex was abd nothing was ever good enough. Stay away from toxic people like this. They are nothing but users.",
            "Was she depressed? Was she suffering from some sort of anxiety or an inability to adapt to the changing dynamics in the workplace? Did you belittle her for being “lazy” ? I’ve struggled with work as well and can’t imagine how it would play out if my partner rather than just being utterly abusive over it, had instead abandoned me? Maybe it would have been better? Maybe I could have been sad and has to figure it out, but then moved on? \n\n I finally ended up deciding to completely change types of work (instead of doing professional/sales work I’m now doing physical labor) I found something through a temp service and have been doing pretty well at keeping it going. But what is helping is that at the current job I don’t have to interact with people much so if I cry throughout the day or whatever no one is there to notice. The other great thing is that I get my hourly wage for doing my job without concern over profit margins etc. So, at least the job part is better (also working on mental and physical health) but the relationship still has issues.",
            "So you quit your job to start a business (not necessary but a choice) and it’s her fault you barely made rent? Seems like there’s some mutual blame to go around here. Doesn’t mean you have to stay in a bad relationship but demanding a partner subsidize your entrepreneurial ventures isn’t realistic either",
            "So proud of you! It’s not easy to leave but you did it and are now free to be you. \n\nYou now can meet whoever, go wherever and challenge yourself.  Live in the now.",
            "The best lessons are hard learned.  Good job!",
            "It's better to look at failed relationships not as failures, but ways to learn what you don't want in a relationship.",
            "Good for you! I know how you feel.. my ex was financially abusing me for years and didn't care that we didn't have money either. I kept telling him to stop wasting it on drugs and take out... to please save his money, that it was a dealbreaker for me if he didn't get his act together. Well i finally kicked him out after he spent 90% of his check in 3 days and lied to me.\n\nFor the first time in 5 years i feel free. We have 2 children together, but it's actually less work without him here and a huge relief. I will never let someone treat me like that ever again. I know just how you feel!",
            "From experience, it is better to have found out and gotten free, before u got sucked into parents house, marriage, etc and then to break away it cost more in lawyers, court fees, support, etc.\n\nGood for you for taking care of yourself first.\n\nWanting to be with some one sometimes makes us sacrifice ourselves, but sometimes those ppl are not worth it. It took u 5 years to learn..it took me 11 years. \n\nOne day u will find someone to sacrifice urself for, and they will do the same for you. Just be patient",
            "Don't look back, look forward.  You are still young enough to find your happy fulfilling life. Good Luck.",
            "Nothing is a waste if you get to learn and do better from it.  Good on you ending that toxic relationship.  I also supported a useless SO for a few years and it also financially ran me to the ground. Intense therapy post-breakup taught me to never ever even get near that scenario with a 100 ft pole ever again.  BUT, a good takeaway is that we're the ones that are independent and we're the ones that are able to make money back.  They're the losers and they're the ones that will fail if they never get their shit together and that's no longer our problem it has always been theirs.",
            "Relationships aren’t really a waste of time, because we often walk away with lessons learned. Congrats on standing up for yourself.",
            "You learned something from this and learned how god damn resilient you are even if your partner can't pull their weight. Youre a badass.",
            "It’s not wasted time if you learned and grew from it. You’ve matured and came out a much better person in those five years and you learned a shit ton about yourself and what you will never allow to happen again. You’re still so young and seem to be in a great spot at 27. Be proud of yourself and remember to stay living in the now and focusing on the future.",
            "Been there.. It's been 6 years since we broke up for that reason and she still struggles to maintain a job or get a new one. She's the type of person that always had someone close to rely on financially so she nevers feels threatened enough to fend for herself. I'm happy you broke up with her, you'll see how much lighter you feel without carrying another person in your shoulders",
            "Why do people date others with no job?",
            "dont look at it as years wasted, look at it as years avoided pre divorce and years you learned to look for evil people",
            "It took me 15 years to figure it out...so good on you for sorting this through sooner! Focus on you. The healing from an abusive relationship takes a while, but is soooo worth it. I'm with a partner now that I could have only dreamed of finding before. Good luck!",
            "I’m sorry you had to go through what you did. There was no excuse at all for not being able to find a job. If anything, she was lazy with her willingsness to support you when it was time to turn things around.\n\nI don’t know you, but super proud of you for making a decision for the betterment of yourself.\n\nNow - moving forward - you’ll know what more to expect of a relationship.",
            "Wow. Good on you OP. I like how you flat you told her no when she asked you to move in with her folks. Congrats on the business.",
            "Here's another thing to be happy about. At least you don't have a child with her. If you did, you would have to keep in contact with her. You can fully put her behind you. \n\nShe'll probably find someone else and repeat this pattern.",
            "Don't give without a giving heart ONE. And two don't reframe your inability to maintain your own boundaries as someone else's characters flaws\n\n\nYou really had me believing your tale until the straight up \"refusal\" to move in with her parents... at that point it's clear the issue wasn't one of finance but because you allowed yourself to be in the position of being wirh someone you didn't have respect for",
            "Better late than never.",
            "Happy to hear you're living your best life now!!!",
            "Does she have a mental illness? I am wondering if that's why she was having difficulty having the motivation to find work.\n\nEither way, that was completely unfair of her to rely on you and guilt you like that. I have been in an abusive relationship myself and it really messes with your brain. I felt like a complete idiot for subjecting myself to that and wasting time as well, but we really thought we were doing something right, helping, and blinded by love. We make mistakes and we are free now! That's all that matters.",
            "I am really happy for you. You are not the bad guy here at all. If she was keeping you from friends and guilt tripping you, it was not a subtle abuse but a pretty full blown emotional abuse. \n\nIt's valid to feel regret right now, but trust that in a few months/years, you will realise that it taught you a lot. You are an amazing woman and deserve lots of love and care and you will find it when the time is right. :)",
            "Good vibes here only",
            "While it sucks that you basically burned yourself for someone who wouldn't spit on you if you were on fire, at least it's over. I'm 90% sure she was going to leave as soon as she got on her feet anyway. Hopefully, you completely blocked her from your life because no good would come from not doing so. Keep moving forward."
        ]
    },
    {
        "post_id": "3o73kl",
        "author": "ineedabra14",
        "title": "UPDATE: My dad (36M) won't get me (14F) a bra and I need one",
        "url": "https://www.reddit.com/r/relationships/comments/3o73kl/update_my_dad_36m_wont_get_me_14f_a_bra_and_i/",
        "score": 3335,
        "num_comments": 306,
        "created_utc": 1444462505.0,
        "selftext": "Original post: https://www.reddit.com/r/relationships/comments/3na5b6/my_dad_36m_wont_get_me_14f_a_bra_and_i_need_one/\n\nI tried talking to my dad one more time and he was still not willing to listen.  He even got kind of irritated this time and told me to worry about my studies and less about boys (I didn't even mention boys).  \n\nI thought about asking the school nurse but she's honestly intimidating so I asked my math teacher after class.  She was really, really nice about it.  I trusted her so much that I told her everything about my dad and my dead mom and how lonely I felt, and she was really helpful.  She said her dad was in the military and she understood moving around a lot.  She told me to stay after school today and she took me to Target.  Before we left she gave me a tape measure and told me how to measure myself for a bra so I did that in the bathroom (turns out I'm a 32D).  \n\nShe bought me bras, curly hair shampoo/conditioner, and a book on puberty and stuff.  She asked if I wanted feminine clothes too but I said no thank you, she was already so generous.\n\nMy dad saw the stuff and he got really mad at me.  I told him my teacher bought it and he said I shouldn't be blabbing to strangers and accepting their money.  I thought he was going to take my stuff away but he just sort of gave up and went outside to smoke.\n\nSo, I have bras now, but my dad's still really upset with me.  I haven't been able to sleep much tonight.  He's never yelled at me before and I feel awful.  \n\n  \n**tl;dr**: Nice math teacher bought me bras and other items, dad got mad about it and is still mad",
        "permalink": "/r/relationships/comments/3o73kl/update_my_dad_36m_wont_get_me_14f_a_bra_and_i/",
        "comments": [
            "If you're in the US, you probably have a local chapter of Big Brothers Big Sisters near you. It's a nonprofit program that pairs boys and girls up to age 18 with a Big Sibling, someone to act as a mentor and spend time with you. If you just need to talk with a woman sometimes, this might be a good program to get involved with.",
            "[deleted]",
            "[deleted]",
            ">told me to worry about my studies and less about boys \n\nI think this is quite telling....it seems that your dad doesn't really understand that bras are NOT just for boys to look at, they are a functional item that you need to be comfortable. \n\nNext time you talk to him, you might want to emphasize to him that bras have nothing to do with boys and they're just something that girls need for their comfort. \n\nIf you find it hard to talk to him about this stuff (which wouldn't be surprising...he clearly isn't the easiest person to talk to), maybe you can write him a letter. That way you can organize your thoughts and allow him to read them on his own. \n\nIt sucks that he's acting this way, but I'm so happy for you that you have such a nice math teacher to help you out. \n",
            "If you're a D, then you definitely were long overdue for a bra.  I'm glad your math teacher was able to help you out.  Remember to never throw it in the washer/dryer.  Just hand wash it every now and then and hang it up to dry.  Don't hang it somewhere where your dad can see it and throw it away.",
            "Oh honey, this is so sad. Do you think you could get your dad to sit down with your math teacher or with a guidance counselor, or even a female relative, and talk about this? As nice as your teacher is, your dad still could use a wakeup call about this. You're going to need more shampoo and bras eventually, and he's got to learn these are real needs for you.",
            "It's not the same, I know, but I'm an almost 30 year old mom with boobs and curly hair. If you need to talk you can always message me. ",
            "You're young but, in a situation like this its best you grow up a little faster and stop depending on your dad so much, psychologically and financially.  You have learned that when you need something, go to someone else, you can't depend on him.  He doesn't want you \"blabbing\" because he knows he's wrong and he's scared and embarassed and can't handle being a single dad.  He's upset so you should just leave him alone for a while and let him process what is going on.  If you argue with him he'll just be stubborn and go on a power trip.  Do what is best for you, let him yell, let him be upset, he'll get over it and eventually realize you are right.\n\n\nIt's true that you have to be careful who you express vulnerability to, and who you accept gifts from, lots of people out there will manipulate and exploit a vulnerable young teenager.  At your age though, think of it like this: If you ask an older person for a favor, and they expect something in return that in any way makes you uncomfortable, then run the other way.\n\n\nAt this stage, its okay to tell your dad little white lies, because he does not want to face reality.",
            "Listen, I'm really sorry to have to say this but this is not ok. Your dad's behaviour is disgraceful a do might even say abusive. He's denying you things that you NEED, not luxuries, not wants, NEED. I looked back, and seeing he didn't allow you pads or tampons when you needed them made me furious on your behalf. This is going to, probably already has, impact your life in a negative way. Your dad isn't thinking like a rational caring parent. Mentioning boys, berating you for actually talking to someone, all raise red flags in my mind. I don't want to distresss you, and I don't want to make things worse, but maybe you should try talking to your teacher again. Explain everything that's going on and maybe also see your counciller. Your dad needs to change his behaviour, but you're still a kid and it's clear he won't listen to you. Get an adult on side to speak up for you.",
            "[removed]",
            "> he said I shouldn't be blabbing to strangers and accepting their money.\n\nThen maybe he should be listening to and taking care of you.",
            "You being a fucking *32D*, and asking about getting a bra, and your father telling you to *quit worrying about boys* in response tells me everything I need to know about how fit for the job he is. \n\nWhat a jerk. Him refusing you things like tampons and bras, and then equating these needs to your attention on boys is ignorance to the point of abuse. You really, really need a better female influence. ",
            "[deleted]",
            "This really brings back memories for me. My wife told me for a couple months that our daughter needed a bra at the age of 11 and so I finally went to the store and I start going for the training bra section and was I in for the shock of my life when my daughter got the same size of bra that you did. I was in shock for at least a week because it was official that she wasn't a little girl anymore. I don't think your father understands exactly what is going on with you. I wish I knew him so I could have a little chat with him about what your going through. By all means I'm no expert but I would definitely get you some of the essentials like that. It really has nothing to do with trying to get boys to look at you but for your own self esteem. If you do have a talk with your father again try to let him know that you are growing up and you really have no choice about it.....it happening right now!",
            "Teachers seriously need to be paid more. A lot more.",
            "Jesus Christ your Dad was going to let your D-cup titties keep flapping in the breeze?! PM me girlfriend I'll buy you a couple bras. Yeesh\n\nEdit: and some undies too. I got that platinum VS credit and they don't sell clothes anymore so it's just sitting around. Seriously!!",
            "Unrelated, but you may find /r/thegirlsurvivalguide helpful as well. ",
            "I am really, really pleased that you talked to your math teacher.  I know that was a big step and I'm so glad she was kind to you.\n\nYour dad's anger breaks my heart.  As a parent, it is his JOB to put aside his personal issues when you need basic care.  Someone who's grossed out by poop doesn't get to opt out of changing his kid's diapers.  Someone who's grossed out by feet doesn't get to not take their kid to buy shoes.  Whatever his problem is with you, bras and boys, the correct reaction is for him to get the hell over it and get you what you need.  You know what?  Even if you WERE interested in boys, that's normal for your age!  For your dad to just shut it down and use his anger to get you to stop talking about it isn't right.  That's emotional blackmail.  \n\nWith that said, your dad has the power here, and I have a feeling that pushing it might cause him to dig in harder.  So I would let this issue lie and quietly keep wearing your bra, and hopefully as the \"new normal\" sets in he will get over it.  Keep reaching out to trusted teachers/authority figures.  If you have a doctor's appointment coming up, make sure to keep it and bring up some of this stuff.  They might be able to talk to your dad.  \n\nAs for the school nurse -- I trust you that she's intimidating, and if you truly can't talk to her don't force yourself.  But you might try testing the waters with her a little bit.  If she's nice underneath, that intimidating-ness could make her a great advocate.  But again, trust your instincts.",
            "Jesus, you're a D cup and your dad didn't realize you would need a bra? It sounds like he REALLY doesn't want his little girl to grow up, but that's just delusional at this point. ",
            "Your father seems to be having a huge challenge about you being in puberty and becoming a young woman. The denial of getting you a bra at 32D, the denial of tampons and pads, and the random mention of boys all point to this. \n\nPlease, please stay in touch with this gem of a teacher. Your father may do other things as you continue growing up, and based on an experience I had with a student your same exact age whose mother had simular fears, this may turn into a rough ride. You absolutely NEED an adult to back you up. \n\nDo you have any other family besides your father? Any aunts or grandparents? ",
            "OP, please check out /r/RandomActsOfBras and /r/ABraThatFits \n\nThese ladies will do what they can to help you stay supported! \n\nAlso, /r/BodyAcceptance is pretty crucial at this point in your life. Keep reaching out for help to people you trust. Your dad is not being the parent you need right now, so you'll have to create your own support network. Just remember that there are lots of people who care about you, have been where you were, and would love to help you so they can see You Happy.",
            "Your teacher is amazing! \n\nAs for your dad, he probably doesn't know how to deal with your feminine issues and needs. He probably doesn't even realize you need those things, so maybe you should ask for some allowance so you can handle that on your own. And the yelling, he must feel like someone else just pities you. He probably doesn't want someone to feel bad for his kid, and you should maybe try to tell him why you needed female help on this issue. ",
            "Remember you've done nothing wrong. I am really proud you were brave and spoke to your math teacher. \n\nAbout friends: Common interests are a good way to find like-minded people. Are you artistic? Athletic? Do you read a lot? There might be some free art/sport/book clubs for teenagers in your area. \n\nP.S. Your story is really touching. You sound like a great young girl. Just remember to keep taking care of yourself, even if your father cannot understand that bras, pads etc are things you really need. Keep asking. There are also places that give out stuff like pads and tampons for free. I bet there might even be places that give out free training bras/sport bras. Keep your head up and remember you DESERVE a good bra.",
            "I was always really small chested in high school and my mom never bothered to take me to get a bra and I never brought it up, then once i wore a lacey shirt and noticed I could see my nipples through it kind of and got really embarrassed.  \n\nI don't see why a bra has anything to do with boys.  Honestly hiding nipple contours is the main reason I wear a bra at all.  Unless I'm wearing something lose or a hoodie I wear one not even for support.  It feels less modest to go without.  \n\nYou need a governess, girl.  ;) keep talking to the math teacher and make sure she knows how grateful you are.  Tell her more about the situation as time goes on.  She'll be able to recognise problems you might not see.  She might be willing to meet with your dad.  You're going to need more than a few bras over the years, he'll have to buy them for you eventually.  ",
            "As awesome as your teacher is, I'd keep what she did on the down low.  She risked her job doing this for you, and the school will see it as a liability case.\n\nShe's not your legal guardian, yet she took you off of school property.  She educated you on sexuality, which is something a school requires parental consent in most US districts.\n\nIn short, your teacher did the right thing, but risked her job to do it.  Try to keep it from getting back to administration.",
            "I'm glad to hear a teacher stepped up for you and got you some things you needed, she's a saint for that.\n\nI really hate to say this too, but I think your dad has firmly planted himself in the sand on this one, and it will probably be up to you to handle your needs from here on out, along with anyone you trust whose willing to help you.\n\nDad's checked out and there may not be any pulling him out of this.  I was one of the ones who suggested having the more serious talk with him, and I have a daughter of my own.\n\nMy suggestion is that you try to find ways to make a little bit of money, whether it be babysitting, lawn mowing/snow shoveling, or whatever you can do.  Dad has indicated he's not gonna be helpful here so you're likely gonna have to make up for it.\n\nI'm really sorry, OP.  Hopefully your dad can pull his head out of his ass soon, but don't expect it.",
            "Your dad is being negligent, to the point where it's almost abusive. Someone needs to open his eyes to reality. ",
            "32D?!? This isn't about boys this is to prevent major back issues. You need those puppies supported! I'm a large C and I thought I got back ache from having the excess weight all day.",
            "You're lucky you have such a sweet teacher! Try not to worry or feel bad about your dad, I'm sure it's tough for him seeing his daughter growing up and not knowing how to handle it. Have you thought of trying to get a little job or doing chores or something for him for some pocket money that you could use to buy the necessary things yourself? ",
            "Good on you OP. And good on your math teacher. It's awesome that you found someone at school you can trust. Im glad you found the help you needed. Your dad is another thing. My guess with him not wanting to buy you the things you need is that they could remind him of your mother (feminine items could just bring back memories of her)? That, or hes just stubborn in his ways. Either these things are practically a necessity for any woman. You should set up another day with your math teacher to go shopping. It would form a great bond between you and her. Either that or have someone personally speak to your father. You should have got whatever you needed when you asked him. And to neglect your needs like that and brush it off like it's nothing isn't cool. But I hope your dad has a change heart, best of luck to you OP.",
            "I think this is a mix of problems.\nA) your dad has no idea what it means to be female\nB) has a basic understanding of female puberty and won't learn anything more on the subject\nC) is afraid of you growing up\nD) is even more afraid of your burgeoning sexuality \n\nHe's keeping himself ignorant because it's easier than admitting that you are growing up, becoming an adult, and that one day you are probably going to start being interested in sex and relationships. He's probably afraid of losing you since he lost his wife/your mom and hasn't bothered to date or live a life.outside of being your father.\n\nI think you need to go to a school counselor and discuss your situation and the possibility of the counselor helping to facilitate a discussion.between your dad and you and stepping in to mediate where needed.\nIt might also be pertinent to ask your dad if he would read the book on puberty you were given. Just tell your dad that you understand it's awkward and no on likes it, but that you want him to know and understand what you are going through so he can be there for you if/when you need him to be. \n\n",
            "I'm glad it worked out for you, your teacher certainly seems awesome. I'm a teacher, I don't know how things work in your district, but in mine I would be fired/reprimanded if I allowed a student into my car for any reason.",
            "Holy shit your teacher rocks so hard.",
            "Wow, you are so incredibly lucky to have such a sweet teacher! She must really think you're special. :)",
            "If you ever need anything please contact me via PM on here. Your father has issues and it's not your job to deal with the. No one is saying he's a bad person we are all just trying to get it through to you that going with tampons, pads and bras is flat out neglect.",
            "Your dad thinks you're still \"daddy's little girl who's gone to preschool\". He's delusional and probably needs some counselling. ",
            "Everybody's giving you advice on talking to your dad. Yes. Do that, if possible. Keep trying.\nBut also have a back up plan. One day, and it seems like pretty soon, you may need to start providing for yourself. Even now it would help you. Look for jobs. Something you could do after school. Save up money for a case of sh*t hitting the fan.\nAnd don't give up on friendships. You don't have to find friends that would become your soul mates straight away - impossible. But if you have a few people you can hang out with, and still take them into your life with a tiny grain of salt just in case -  you'll feel better, more alive.\nNo need to go hunting for friends. It'll come. No pressure.\nTake care of yourself. You're the most important person in your life.",
            "She is a 14 year old girl with a D cup. What is wrong with dad? Of course she needs a bra. If boys are his issue she is drawing more attention by not wearing one. I'm furious for her. ",
            "(((hugs)))\n\nHe is uncomfortable with the thought that you are growing up into a woman.  A lot of men are uncomfortable with that.\n\nContinue to look for female role models in your life.  Your math teacher was wonderful, but you need more than one to avoid any appearance of impropriety.  \n\nAunts, cousins, neighbors, women at church or in other groups,etc.  \n\nAre you in a sport?  I used to be your size at your age and I know that running really hurt.  But I loved gymnastics, even though I would never compete at high levels.  And swimming. \n\nWith periods and cramping and tampons and pads and all that mess ---  puberty is a challenge, but we all got through it! ",
            "You're Father is an idiot. It was rough for me with my Daughter, but no way I would be like that.",
            "That's really awesome that your teacher helped you out like that! I just want to say, as far as hair goes - check our youtube tutorials! There is seriously a video for everything, and if you look for different ones on curly hairstyles or just general curly hair wrangling - it'll help a lot. Good luck, i hope your dad gets used to the idea that his little girl is growing up soon.",
            "Your math teacher is a sweetheart.  It's a shame that your father hasn't reached out for the grief counseling it sounds that he needs so badly, along with someone who can explain the needs of a young girl.",
            "Glad to hear everything worked out well.\nLike I posted before, if you need anything else I could give you an Amazon GC or PayPal money to help out :)\nGood luck!",
            "I would just give your dad time to cool off and not keep bringing it up. You did what you needed to do, he just doesn't get it. He'll calm down eventually, just keep being a good kid in all the ways you are normally a good kid.\n\nWhen people get really upset like that, there's usually some personal emotional reason rather than the situation itself. He might be embarrassed and worried that your math teacher is going to think he doesn't take care of you or isn't financially stable enough to take care of you. \n\nAs regards the \"accepting money from strangers\" thing -- maybe next time he would be less upset if you've \"paid back\" your teacher by helping her out in some way (tidying the classroom, correcting homework for her). It doesn't sound like the teacher cares but might ease his embarrassment or his fears about your mooching, or whatever is making him freak out.",
            "I get the feeling that since your father lost your mother to a cancer that primarily attacks women he kind of wants to deny that he has a daughter ( with ensuing female 'problems' ) and could lose you the same way. The fact that you're turning into a woman is frightening him?",
            "In Australia we have a thing called the Kids Help Line for anyone up to the age of 25 to call for help and advice on anything. My suggestion is that you find whatever equivalent there is in your country and call them for advice. The people who run these hotlines can provide plenty of information for you and tell you about places you can go to for support. Your dad doesn't understand your needs and this will be a constant issue until he is educated about it. You need to get advice on how to get through this. The stuff your teacher bought you won't last long so you will need to find a way to get replacements. Finding a support group or mentor will make everything feel so much easier. \n\nIf your dad really does care about you, he will get over it once he understands that as a female you need certain things like bras and that you are going to need advice from a female perspective as you grow into an adult woman. But until then, I strongly suggest looking for support groups or mentors.\n",
            "Keep standing up for you self. You have to. Your dad is the one who is wrong here is is letting grief and denial get in the way of your care. He has to accept that you are a developing woman. ",
            "Thanks for posting and update!  I read your original post back when you posted it and wanted to know what happened!  As far as your dad is concerned, he'll calm down.  Just give him some space.  Some men are like that.  \n\nI would suggest, if you have a few dollars, buy your math teacher a thank you card and leave it on her desk.   Or get a piece of paper and hand make it.  I know you thanked her, just give her a card, it's something nice for what she did.",
            "Hang in there, you did nothing to feel bad about",
            "This breaks my heart. \nMy dad was single for a long time after my mom died, and was still single when I went through puberty. But just because he was a single parent didn't mean he gave up on his responsibility to me to help me grow up with what I need. He got a female family friend to take me bra shopping, and I had sisters to help me with the period stuff.\nOP, your dad may still be grieving about your mom, but that does not give him the right to refuse getting you things you need to survive. I cringe at the thought of you stuffing toilet paper in your underwear for 3 years. \nIt may be hard to do, but you just need to straight up tell him that bras are not sexual clothing items, but serve a function (especially since you're so well endowed, a bra could really help take the strain off your back). You need to be able to advocate for your needs, OP, and as difficult as it may be to stand up to your dad, you're going to have to, since he's not advocating for you.\nI wish you the best of luck, and if there's anything I can do to help, PM me. ",
            "So, in case you didn't know....don't machine wash or dry bras (or decent panties for that matter) hand wash and hang them ",
            "It's really hard to be a single dad to a growing up daughter, trust me. Glad you could get help, if you see something in books that is relevant to your situation maybe show him to add some credibility? Big grown-up man might find it hard to take small girls seriously. All the best, update us :)",
            "Hey, if you ever need to talk/ask about anything from an older girl, feel free to PM me a letter and I'll write you back! \n\nBut I also really think you should ask your teacher to get you in contact with Child Services, as your father is clearly displaying neglectful or mental illness behaviour. It is not safe for you to be in his care.",
            "I'm astounded that any person with a functioning brain in their skull would not realise that a girl with a chest fitting 32D dimensions needed a bra. \n\nYour father must be extremely stupid or in denial, or both.",
            "honestly...your dad needs to talk to someone how to raise a daughter...you not getting bras (32D at 14 lol, how can you miss that) can have real consequences to your health as well, same with the period stuff...he's also making you into an outcast. Try telling him that. Doubt it will help though. He needs to talk to someone who knows their shit! Preferably your teacher maybe.",
            "How does your dad not think you need a bra at a 32D!?!?!?! If you were still an A maybe a B I could understand how a guy could be like \"oh you dont need one\", but a D? \n\nIm really glad your teacher was really helpfull. Bras dont last too long because they stretch out. Might have to buy another one within the next 6-12 months? Definitely try to get a job even if its part time when you turn 16. ",
            "It sounds like you could do with an older female adult to confide in over the next few years. I suggest as an icebreaker you ask your dad to suggest a relative who you could talk  to and who would then deal with  your dad",
            "I'm so happy for you! As /u/EonofAeon said, keep in contact with your maths teacher as best you can - and buy her some chocolate at the end of your time in her class!",
            "First of all, I love your teacher and you were very wise to approach her. My guess is you dad has zero idea how to deal with the normal puberty stuff you are going through and I wonder, do you have any female relatives to talk to? If not then there was a great suggestion about seeing if there are any Big Sister organizations in your area. You could also ask that same teacher for suggestions. You need women to talk to, your father doesn't get it.",
            "Teachers are amazing people",
            "Jesus how the hell is your Dad ignoring this problem? This isn't like \"oh you are starting to get little boobs and want a training bra\" At that size I am surprised you aren't in pain just from day to day activity (I was a slightly smaller size at your age and would have been)\n\nHave you considered talking to any sort of counselor at your school?\n\nOr maybe even coming to your Dad with an age appropriate book (age appropriate for you age) explaining how all of this stuff should be happening at this age? It sounds like he's just burying his head in the sand and refusing to acknowledge you are growing up.\n\nAlso please use the school nurse as a resource. As intimidating as she may be I can't imagine she wouldn't try to help with this issue. ",
            "I just love and am so thankful for teachers like this!",
            "Lot of good advice here.  Don't expect your dad to change.  He is what he is.  You can't teach an old dog new tricks.\n\n*EDIT:  Don't be discouraged by your dad's behavior or his attempt to dissuade you from getting help from others.  It's a defense mechanism to justify his own lack of action on these matters.  He is clearly in the wrong and he's making excuses for his own behavior under the guise of some principled position.  It's nonsense so that he can tell himself he's doing the right thing.  Be confident in your own need to get a solution or answer to any of the problems you have.  Don't hide out with your problems \"in the back row\" of life.*\n\nYou're going to have to get help from other individuals to fill the void of your lost mom.  Love your dad for what he is, but you're going to have to find other individuals to lean on.\n\nDon't be ashamed or put yourself in a position where you are suffering because you have certain needs or questions.  Don't be embarrassed.  There are no stupid questions in life when you are 14 years old.  Those same questions or issues will look like stupid questions when you are 35 years old, because you didn't bother to ask or find out when you were 14.",
            "First off I'm sorry about your mother. I too lost my mother, and without knowing everything, it sounds like your dad is still having a tough time with that loss and you becoming a women. My dad would act in similar ways, men tend to show outwardly anger when we feel sad, anxious or depressed. As a guy we're told to,  \"suck it up and be tough\" it's almost programmed into us. I would personally say build up a strong support system which you've already started and I hope you continue to do so. \n\nMore than anything know its not your fault!\n\nI hope you get the emotional support you need and you dad gets the help he needs! Until he finds peace with your mother's passing he's going to have these irrational outbursts. \n\nStay strong, build strong relationships, and know where to find help.your doing well just make sure to keep taking care of yourself and trusting you intuition. ",
            "How in the hell could your father not believe you needed a bra when you are a D cup? I'm sorry OP, you deserve better.",
            "Your dad is freaked out cause you're growing up, and there's nothing he can do to stop in.  It's not fair that he's acting this way.  And as a guy, he can't understand.  ask him if he's prefer not to deal with it, if there's someone else who he's recommend you talking to.  Although your teacher seems like a great person.",
            "Dad's don't want to accept their daughters getting older. Good job confronting another adult.  Hopefully soon he will realize you're going to grow up whether he likes it or not and try harder to form a better relationship with you.",
            "32d is a very big chest wen for a grown woman. I can't believe he expected you to carry those around unaided. Glad you got the teachers help! ",
            "[removed]",
            "If a teacher took a student out to buy underwear in the uk, all hell would break loose. The differences from country to country amaze me sometimes. That teacher sounds amazing.",
            "Your dad's a sick fuck to be thinking of your vagina this early when all you needed was a training bra. ",
            "[removed]",
            "Everyone is congratulating the teacher for helping her out, but I feel like she really crossed the line here.  The teacher should have gone to talk to the father one-on-one and offered to take her to buy the things.  I'm happy OP got what she needed, ultimately, but I really feel like the teacher crossed the line.\n\nI am a teacher, teaching abroad, and I could not imagine something like this going well.  \n",
            "[removed]",
            "No worries. He will get over it.\n\nI am sorry about how he is sometimes. I do think that he does love you.",
            "I dont know your dad and all, but maybe the people of reddit should all write him a letter\n\na child should not be raised that way imho :|",
            "If you're a 32D, you really need to make another attempt to talk to your dad. I was a d-cup in high school too. It's quite painful to not have this. \n\nMaybe your dad can help you pay back your teacher? ",
            "Your Dad is losing his little girl. On your journey to be a woman, cut him some slack. he knows that you will not need him in your life after this. from now on he will be a bystander in your life. ",
            "[removed]"
        ]
    },
    {
        "post_id": "e89ukg",
        "author": "None",
        "title": "UPDATE: I (32F) got broken up with tonight by someone (29M) I thought I was gonna go the distance with, and I guess I just needed to tell someone.",
        "url": "https://www.reddit.com/r/relationships/comments/e89ukg/update_i_32f_got_broken_up_with_tonight_by/",
        "score": 3328,
        "num_comments": 463,
        "created_utc": 1575897538.0,
        "selftext": "[Link to original](https://www.reddit.com/r/relationships/comments/e0smwt/i_32f_got_broken_up_with_tonight_by_someone_29m_i/)\n\nYesterday, I noticed the key to his house that he had given me early on in our relationship, so of course I was very sad thinking of how close we had been and how much he had seemingly wanted me to be part of his life. Then, I noticed something special of his that his mom had given to me, that I didn't feel comfortable just throwing away. I broke no contact to ask if he wanted it back, and let him know that his key was in the mail.\n\nHe responded and said I could get rid of it. Knowing that he was looking at his phone, I ventured even further across the no contact line to let him know that this was so hard for me, since he had played an equal part in how close we were, and driven the relationship just as much as I had. Then he put up an emotional wall and ditched me without a real reason.\n\nHis response?\n\n\"I'm sorry for shutting you out. I used you for companionship until I didn't need it any more. I don't have any more answers for you.\"\n\nIt's a strange hurt. It gave me what I need to never look back and fully know that I would never ever go back to someone who is so emotionally out of touch with themselves. Someone who could do that to someone. But it also is making me question people. We were good partners, and took care of each other. We never bickered and enjoyed our time together, and he just pulled the rug out from under me and revealed an incredibly selfish person. Who was I even dating?\n\nAs much as I want to tell him how selfish he is, I think he knows. When I responded, I told him \"You broke my heart in the process, and this is going to be a hard wound to heal. I do appreciate the honesty.\" And I think I will leave it at that, because I will never regret taking the high road. I shared so much with this person, and suddenly that person doesn't exist. At least I can intentionally move forward now.\n\nTl;dr: Ex boyfriend who dumped me after seemingly wonderful relationship told me that he used me for companionship until he didn't feel like he needed it any more.\n\nUpdate 1: I want to be clear that I wasn’t looking for any specific answer, or to rekindle things. I was looking for ANY reason that would make this easier to process and move on. Thanks so much for all the comments so far. ❤️\n\nUpdate 2: I in no way feel that I was manipulated. The original post was written 30 minutes after being dumped; the 2nd after 2 weeks of reflection. He is a good guy, and a decent human being. His parents have a really fucked up marriage and that has to affect his view. Either way, he clearly told me with his actions that he didn't want to be with me. My brain was stuck on his words. We talked about futures. He called me legs after ONE DATE because he felt like it was \"going somewhere\". He told me how excited he was about me, and how he had never connected so efforltessly with another person before. I don't think it was all my delusions. There was fault and hurt on both sides; nobody is a bad guy here. Everyone needs to sit down.",
        "permalink": "/r/relationships/comments/e89ukg/update_i_32f_got_broken_up_with_tonight_by/",
        "comments": [
            "Stay positive. Stay busy, go out with friends, gym, work, etc...it's always hard. Some hurt more than others but keep moving. Focus on yourself moving forward and things will get better. Good luck, merry christmas, happy hanukkah...all that stuff.",
            "\"I used you for companionship until I didn't need it anymore\" such a harsh thing to say. Just be grateful that things didn't get too much further before finding out how apathetic he is",
            "Did we date the same guy?! Something similar happened to me at the start of the year. Ex started talking about buying a house, and how I should sell my house so we could get a massive house together. Then he ghosted me for days and dumped me by text a week before our 1 year anniversary.\n\nThe reason he gave was literally he didn't want a relationship anymore. No reason. He wanted alone time, and I was taking up too much of it. He wanted to be by himself. A friend saw him on Tinder less than a week later.",
            "[removed]",
            "I’m gonna go against the grain because most people are being pretty naive and looking for a bad guy. \n\nSometimes there are no bad guys and it honestly sounds like one of these cases. \nThe 6/9 month mark is usually the make or break for me. And most of the time it ends because one of the two is not that into the other. It’s the point where the « it’s nice to be around someone » turns into the « do I want to stay around this person for a long time ? ». \n\nIn your case it sounds like he didn’t want to and he cut you out pretty clearly. And while his response may be hard to swallow it’s a honest and respectful one.",
            ">Who was I even dating?\n\nI have been through this exact same feeling before. You thought you knew someone and suddenly you realize that you may not be able to trust your own judgment. \n\nGive yourself some time to heal. Be patient with yourself.",
            "This is why I generally advise against closure. You got an answer but it didn't really teach you anything and likely made you feel worse.\n\nYou go searching for answers you might get them and there is no guarantee you'll actually want to hear them",
            "> I ventured even further across the no contact line to let him know that this was so hard for me, since he had played an equal part in how close we were, and driven the relationship just as much as I had. Then he put up an emotional wall and ditched me without a real reason.\n\nI'm sorry to say because I know you're hurting, but from the outside this was kind of an inappropriate thing to say to him after he broke up with you, and I'm not surprised his response was a little curt. He gave you a reason, which was that he didn't want to be in a relationship. Asking him (even implicitly) to soothe you through the pain afterward or make him feel guilty for his choice is not really fair. This kind of conversation is what friends, family, and therapists are for. He may have even been deliberately cold so he didn't give you false hope of rekindling, since you asked if that was a possibility when he broke things off and your text sounds like you're trying to reopen a conversation that he meant to be closed.\n\nIn future, it's best to find closure internally instead of relying on the other person for it. You are likely not going to get the answer you want.",
            "It's honest but harsh. And at least he had the decency to apologize and talk to you rather than ghosting.\n\nI find that a lot of men in their late 20s (maybe a lot of men in general, just going off my experiences), deal with break ups (if you get far enough to call it a relationship) like this. They sort of just \"shut off\" and then move on to the next person, fulfill their needs, break it off before they get emotionally attached because they're not sure what they want/think they can do better/don't want to get tied down/whatever the reason, and then continue the cycle. Sucks but it is what it is.\n\nYou can do so much better and you're worthy of a guy that's going to value your relationship as a long term commitment. Allow yourself a small window of time to grieve (you had feelings of love for this person and even if he didn't share those with you, your feelings are still valid so of course it's going to hurt) but don't let it consume you.\n\nThe next step after that is continuing the search. Be upfront about wanting something substantial. Also take this time to work on your communication skills. I remember having troubles being able to talk about what was bothering me in past relationships, which led me to writing a lot of letters/emails/long texts. I've found that it's better to be able to articulate what you want. Work on talking. Based on your previous post, it sounds like you guys prob didn't communicate well-enough (so what if he was an introvert, introverts can still talk about their feelings - so many people use that as an excuse to bottle up rather than talking through problems). Be mindful of that in the future.\n\nThat all being said, good luck! You're still young so you've got plenty of time to find a man that's worth your time.",
            "**\"When I responded.\"**\n\nDon't reach out to him anymore. Everyone has offered pretty solid advice here, but I'd like to add that there IS a light at the end of the tunnel.\n\nEach day is a **new** day, and a step closer to you living your **best** life.\n\n:)\n\n&#x200B;\n\nEDIT: I wanted to quickly say that his text to you was really cruel.",
            "When someone in a relationship does a 180 and you are left wondering \"were they ever the person I thought they were?\"...it is like an unexpected death and, in a way, it is. The person who you thought existed does not exist anywhere on the planet anymore because they never really existed. It is a huge mindf\\*ck. You question your judgment, you question your ability to assess people. Just know that there are some people who are THAT GOOD at hiding their true selves to get what they want AND allow yourself to mourn for the person who you will never see again. \n\nIt's hard to see any benefit at the moment, but just know that your \"spidey sense\" for similar people will now be more honed and you may be able to avoid this type of person more easily in the future.\n\nBe well.",
            "Thank you so much for sharing this OP. I am going through a breakup that is wildly similar and it had been one of the hardest to a navigate.",
            "I'm so sorry you had to go through this. Break ups suck and there are just some break ups that seem to hurt that little bit more. \n\nYour ex sounds a lot like my last ex. We had a happy 6 months together, had conversations about what we wanted from a relationship-  marriage, kids, house. It felt like the real deal. The butterflies in my stomach made the love feel so intense and real. It was more intense than anything I'd felt before.\n\nThen everything seemed to make a 180 degree turn. He never wanted to spend time with me, shut me out, wanted to be alone all the time, felt negative when around me for too long. He made up excuses about being busy. He travelled a lot for work too, for weeks at a time and that suited him perfectly. \n\nObvs I turned to Google for an explanation. I had no idea what to search for so I searched everything it could have been. Until I found some sort of an answer. Attachment. Your ex sounds like a classic Avoidant type. Fears intimacy, using distancing tactics, generally doesn't want to be close to another person for fear of loss of their independence. Sometimes the avoidant type doesn't really understand why they behave the way they do... He's not the villain.. and again it sucks to be in your position.. from a psychological view his behaviour is kinda explainable. It's no excuse for it defo because he really hurt you. Knowing there's some sort of explanation really helped me get thru it. It didn't lessen the pain, I guess only time can do that, but it helped me create my own closure. I hope it helps you too",
            "Being broken up with sucks but I'm not sure I get all the bullet dodged comments. You were right at the point where you really start thinking long term with someone.  He thought about it, was honest with himself and decided that he was happier single than with you. That's just the truth of it. We can gather from the post that they had differing views on this but that's what breakups usually are. Even if you initiate it, the end of a relationship can be difficult.  He's dealing with his own emotions and you've made it clear that you'd like to get back together while he's trying to move on. It was a bit harsh but he just doesn't want to give you false hope. Everyone is processing their own feelings and needs to turn elsewhere for help. \n\nBeen on both sides of this and it sucks. It'll be difficult but hopefully you have friends and family to turn to. Good luck.\n\nEdit: fixed a typo",
            "Girl, it’s tough, but delete his number. I’ve done before what you are doing— reaching out to let him know how hurt you are with the hope that his response gives you some kind of answer or closure. Break ups can seem so much easier to swallow when there is an answer to the “why”–like he met someone new, or you did something specifically wrong, and so on. The hardest breakup to accept is the one you’re going through right now. Nobody did anything wrong, it just fizzled out. As harsh as your exes statements may be, it just sounds like he realized he wasn’t ready for a serious commitment. he may have also realized, as you admit yourself that him being kind at first and his response gave you the implicit go ahead to push on talking to him about your relationship, that he needed to be harsh in order to shut down the postmortem.\n\nYou are not going to get what you were looking for or hoping for in continuing to text him. Given how long your relationship was, there is a very good chance that you will find something else of his or related to him that will make you feel like you have to reach out. If you aren’t strong enough to resist, delete his number. If one day he does think he may want to settle down and is interested in rekindling something with you, he has your number and he can call you.",
            "[deleted]",
            "I don’t know why everyone is giving him such kudos for being honest and absolving him of being an ass. Glad he was honest, I guess, but keep in mind, OP, he’s a jerk. He just also happened to admit it.",
            "OP, about a month and a half ago I experienced something very similar with my partner of 2 years. We had already bought our anniversary gifts, he was planning a birthday gift for me just two nights before, we were still going on dates but I could tell something was up so I confronted him and a week later he pulled the plug.\n\nHe told me that our conversation made him feel sure in his decision and even though there was nothing I did to drive him away, he just felt unhappy with himself and wanted to go travel at length and do things that would apply great stress to our relationship. Of course I tried to barter at the time but now I realize that he is just far more selfish than I had thought. We had a great relationship where we talked about marriage, buying homes, having children, and we didn’t really fight on top of what I thought was a healthy dose of communication.\n\nThe other commenters are right, he could have just made some changes to himself to adjust but many people are not cut from that cloth so where it would have been easy for us to adjust, it’s not like that for others. But you deserve someone who always has both feet in the door.\n\n\nI feel sad for my ex, that he is in such a bad place with himself that he threw away a perfectly good relationship with a supportive partner but it doesn’t make it sting less for me. I really felt like my world had been shattered and I still feel that way, it’s just not as scary now. I miss him dearly but he has caused me a great deal of pain and suffering.\n\nMy best advice is to just keep busy, focus on healing properly and letting yourself feel things. No contact is the best way even when it’s difficult because you’ll feel so much worse after you speak with him. Things do get better but I’m afraid there’s a long road ahead. The world is your oyster. \n\nSending you so much love and healing. Things will get better. Remember that healing is never linear so you’re still going to have some bad days mixed in with your good days.",
            "Don't worry. Not everyone is like that. But dating and relationships can be a real minefield. Doesn't mean it's not worth it, just means being patient and keep to your standards of how you want a relationship to work. Eventually, you'll find someone who is compatible with you and values other people the same way you do.",
            "I'm sorry, I can't pretend to understand your pain, but I'm glad you'll eventually be able to move on and be happier for it. I hope I'm not wrong, take care of yourself!",
            ">I used you for companionship until I didn't need it any more  \n\n\n  \nThat's cold as ice. I'm truly sorry this happened to you.",
            "He either thinks a lot of you and is being self sacrificial, allowing you to move on cleanly and easily with the help of thinking him cold and cruel. But ultimately to be kind.\n\nOr he is cold and cruel. \n\nIf it’s the latter, it’s pretty terrifying how convincingly he played his role. And how calculating he is to allow you to place your dreams with him ... knowing he would never allow them to come.\n\nEither way I’m so sorry you are in pain and your heart is broken. From one 32 year old broken heart to another, I feel your pain. \n\nXxx",
            "Just be happy you didn't marry this person. My ex-husband slowly began to become distant and I felt more like a roommate than a spouse, it hurt, but trust that it will make you realize what love is when you truly find it.",
            "You are actually one of the lucky ones. I spent 14 years of my life with this person, had 3 amazing kids. She slept with one of my good friends a couple of years ago, a groomsmen in our wedding, she then left, possibly through guilt. I no longer give two fucks about this person, but now she is playing the children for what she can. I adore my kids, the kids adore me. Thankfully at this stage, the kids don't believe the shit that comes out of her mouth. My middle child said to me the other night \"Remember when you kicked us out of the house?\" I had to go further and ask when and why? Turns out it was a day she wanted them earlier and told them I kicked them out! I have never, and will never stoop to that level. I do not disrespect her to the kids. Fingers crossed, karma will happen. \nSo honestly, walk away and take pride in yourself for not letting it go to these levels.\nRespect",
            "Look on the bright side, you don’t have to be used for companionship anymore and have all these years of your life to yourself now to do with them as you please and with whom you please. \n\nYou now have a chance at true happiness!",
            "My heart!!  You’re not alone. The same exact thing happened to me about 6 weeks ago now. Everything was fine- a seemingly perfect relationship and then bam- done. No explanation. no fight. Please don’t let this apparent stranger steal your happiness! I know how weird it can feel but the only thing you can do is be happy and grateful that they left, because they weren’t giving you their true selves.",
            "You don't want to be with someone who doesn't want to be with you.",
            "Please don't let him be the reason you become a cold shoulder to the rest of the world. I understand it hurts your trust in people, and it should to be honest. This man betrayed your trust and hid his true self in a relationship.\n\nPlease understand while there are cold, emotionless and selfish people out there, the majority of people are real and selfless, and don't let this into your head to hurt your future relationships.\n\nTake some time for yourself. Go out to a movie with friends, eat some ice cream and watch the notebook... Do whatever YOU want to do. And just know one day, you will look back on this very day, and smile at how large of a bullet you dodged.",
            "I remember after breaking up with my ex I still felt so guilty about it that I kept keeping in contact with him (at his request) until one night we're talking on the phone and he's telling me about this woman he's seeing and that he was texting her \"the usual\" in his words - how she's the most beautiful woman in the world, he loves her more than life - all the exact same things he had said to me early on in the relationship and I had this moment of clarity. All the guilt and residual feelings I had for him just fell away because I realized he'd never actually loved me and there was absolutely nothing to regret except that I'd wasted so much time in a relationship that was never equal and could never have succeeded in any real way. After we got off the phone that night I never spoke to him again. \n\nIt's so freeing to know there is nothing left to look back on fondly, no reason to feel guilty or ashamed, and that you did nothing wrong. You got conned by a con artist, same as me, but that's on them. You're a better person and will end up far happier than they ever will because you know what it is to love. Take the lessons you've learned from this relationship with you into your next one but leave the baggage behind. You're worth it.",
            "[deleted]",
            "OP you were blindsided and this is something that is incredibly difficult to get over. I’ve been through a few breakups but the one that hurt the most was very similar to what you described. One day he confessed he loved me, things were wonderful, he was planning a cottage getaway with my brother in law and the next day he broke things off out of the blue and said “I don’t love you and I don’t want to be with you”. \n\nI was so confused and I didn’t understand, there were so many questions I had for him. To make matters worse he had recently moved into my apartment building and lived directly above me (a move that I thought was bringing us closer).\n\nNot trying to make this about myself, but it’s been about 4 years now and I still have no clue what happened. I tried reaching out a few times but discovered that I had to answer my own questions about what happened. I think you can relate to the conclusions I put together in my situation: he wasn’t honest about how he was feeling, he was selfish (possibly even a narcissist), he only wanted me when it was convenient for his life and most importantly, there was nothing I could have done or nothing that I did that was wrong. I opened up and was honest with my feelings and that’s all you can do. \n\nHe’s not the person you thought he was and that’s hard to realize because it’s scary to think that you could be tricked again. Don’t let this ruin your trust or faith in a good relationship, take the time to acknowledge your pain and worth then try again.",
            "Hey. I went through an eerily similar breakup a few months ago and have been having a horrible time getting over it. I just wanna day reading your perspective and the comments, has been really eye-opening for me. I’ve been blaming myself and longing for him , but you’re right, why would I want to be with someone who has the capacity to do this to someone? I’m gonna save this post and re-read it when I need reassurance. Thank you.",
            "I'm sorry your heart got broken in the process but I feel like as far as breakups go, this couldn't get any smoother.  You know for a fact he doesn't feel the same way about you, he was very blunt and honest in a very timely way, and he even in a way admit to his selfishness so you're not really left seething wishing you could give him a piece of your mind.  Minimal time wasted I think for a more serious relationship.  \n\nHonestly months from now you will realize you're in a much better position not in that relationship.   Breakups are so tough when they are fresh and I seriously feel like your mind almost becomes altered to be in this super anxiety-ridden state.  I hope you are able to find distractions through the holidays, but also hope that you are able to find internal peace and keep focusing on yourself, as well.",
            ">\"I'm sorry for shutting you out. I used you for companionship until I didn't need it any more. \n\nPretty horrible, but at least he was honest.",
            "Sorry to hear that that sounds hurtful",
            "I broke up with my SO not too long ago, almost a couple months ago. I too thought we would go the distance, be together for life etc. But that wasn't in the cards for us, and that's okay. It'll get easier, trust me, especially since he was able to be blunt and straight forward and let you see into his exact feelings. \n\nOnce you embrace being single again, it won't feel so bleak. I agree that it does suck, wondering if you'll be able to trust someone again. I try not to let that mentality come into play and remain optimistic, it would be bleak if all of our ex's caused us to lose hope that we'd find genuine partnership and commitment. \n\nIf you have the time and the money, I'd recommend a few therapist sessions to sort through your issues. It's really helped me lift the fog and see things for how they actually were, it gave me a lot of closure and now I don't think too much about her anymore and I'm grateful things ended and I was able to learn more about myself in the process. \n\nI wish you the best of luck and hope you find someone who'll appreciate and want you for who you are :)",
            "I’m glad you were able to get what you needed in order to move on, even though it was harsh. Sometimes we need that extra push in the form of information, especially in a case like yours, as your original post painted the situation as ambiguous. Not knowing the reason for something can end up causing more pain. We all want answers to our questions. \n\nThis will hurt for a bit. With time, you’ll heal and move on from him. Onward and upward, as they say.",
            ">  I used you for companionship until I didn't need it any more. \n\nI never really thought about it, but I genuinely feel like this is exactly what my ex wife would have said had I ever got her to fess up to why she wanted out of the marriage, which to me, was out of the blue.\n\nI remember, when she and I first started dating, I had found out she had just recently broken up with her ex. We were hanging out, and he had called her. She picked up, and I didn't hear much, aside from he sounded upset, and her response;\n\n&#x200B;\n\n\"I dunno... I don't want to try any more, I'm just bored of you.\"\n\n&#x200B;\n\n&#x200B;\n\nI remember thinking if I ever wanted to be in that guys position. \"Naw, it wouldn't happen to me.\" Silly, silly me.",
            "In a way as awful as that is with that cold and blunt text, this is also good in a way (in the long run). There's no \"what if\", you know where he is at and you know 100% there is no future between you two. So you can go about, heal and recover and begin a new and better life without this guy. Endings are always very hard no matter how they come about :( Good luck.",
            "At least he was upfront. There's a reason why he was chronically single, and I doubt that it was his choice. Nine months is just that.... nine months. You can't get those nine months back. But you're lucky that it wasn't two years. Or five years. By that time you are heavily invested into the relationship and if he were to inevitably do that to you again than it would hurt much more.\n\n\nThe best thing to do is to forget about him. Go out with friends, go take a trip somewhere if you can, just distract yourself. Eventually you'll get over him.",
            "I’m so sorry that happened to you 😔 I can tell that you have a big heart and you’re very emotionally mature, keep up the good work, don’t get bitter or hardened over this. It’s so cliche to say, but one day you’ll look back and be thankful for the experience and also thankful that it didn’t work out.",
            "I am so late to this, but I think you handled it well. It sucks, and it will suck, but understand that this is a wound to heal and there will be scars. They will be present, but eventually you won't notice them as much. \n\nAlso realize that he is not the normal. There are good people out there that will be interested in you as a person and not just a \"companion\".",
            "Imagine not being so honest and he just ghosting you. I’m glad you guys were honest with eachother",
            "I'm proud of you for staying civil and taking the high road, OP! I know firsthand how it can be hard. I have an ex who did pretty much the same thing; in that case there were some issues (e.g. unequal chores and emotional labour), and when I tried to address them the relationship simply deteriorated because he wasn't interested in all that. Turns out I was just convenient for him in the moment :S\n\nI am similarly grateful for what an arse my ex made of himself during/after the breakup, it does make it easier to move on!\n\nYou sound very kind and maybe because of that I would like to add that you shouldn't be afraid of feeling anger, down the road. Sometimes anger is justified. Your ex was truly selfish, it seems like he has problems of his own to work on, and I think he has probably lost a wonderful person",
            "It sounds like he used you for companionship and honestly, fuck him. \n\nUse this time to take on a new hobby, or get back into hobbies you enjoy. Hang out with your friends and family and do things that make you feel good. You will find happiness and you will find someone who isnt going to just use you. \n\nI am so sorry this happened to you. I know this hurt and it's a bad feeling. Things will get better. Head up queen 💖",
            "A very dear friend of mine is going through this exact same thing at the moment. I'll tell you the same thing as her: people are jerks and selfish, sometimes too much for our own good.\n\nYou need to let the grief cycle happen. You seem like you quickly moved through denial which is super important (good job!). If you stick to the no-contact agreement, bargaining shouldn't be too hard to overcome, too. Also, it sounds like you don't have any reason to feel guilty. Face any perceived faults with as much analytical logic as possible and either accept responsibility or banish false self-deprecation as quickly as possible.\n\nIt is both possible and likely to vacillate black and forth between the hurt, anger, and depression stages. If you find yourself getting trapped in any one of these stages, I highly encourage you to seek a grief counselor.",
            "He is going to regret saying that one day when he realizes just what he had and squandered away.",
            "You're well rid. Get in touch with your girlies. Start dating other people (as the saying goes : the best way to get over a guy is to get under another) Have fun. Enjoy being single. And never internalise the way he treated you, it should only reflect on him and the fact that he's not all that afterall. Hugs.",
            "I just had this happen in my own relationship. Nearly word for word. My boyfriend said \"I tried for 9 months to love you, it just wasn't happening\". Girl, my heart hasn't stopped aching for a few weeks now. But I just wanted to say you aren't alone and if I could hold your hand and tell you it's going to be okay, I would💞 hugs",
            "Don't you wish dating people could come with reviews sometimes? So you could know I'm advance or let someone else know in advance what a partner is like? \n\nMaybe that's just me. \n\nI'm sorry you're hurting right now. Invest in yourself and try to focus on the positives.",
            "I'm amazed by people who don't see this guy as an asshole. It's one thing for feelings to change and to grow apart. It's another thing to have a platonic friend or acquaintance for companionship. It's another thing to USE someone for romantic affection knowing that you are not motivated by true interest and love for that person. \n\nHe's a user and a shitty person. From personal observation of a male acquaintance who is like this...they are never truly happy in relationships, even if they pretend to be. In my \"friends\" case, women are just a means to an end-be it because they look hot so he looks good by extension, he is using them for sex, etc. But he is never truly invested and as I told him, he's not going to be able to switch this personality flaw off when he finally thinks he found someone he can love because...he can't actually deal with anyone else's feelings or emotions but his own. This is okay for a 5 year old but for a grown man? You dodged a bullet.",
            "> \"I'm sorry for shutting you out. I used you for companionship until I didn't need it any more. I don't have any more answers for you.\" \n\nThis man used you. I think you dodged a bullet. Don't feel bad... you have a whole life ahead of you WITHOUT a user in it!",
            "geez that's brutal. i'm so sorry  it would be one thing of his feelings changed in the course of the relationship (it can happen to anyone) but this was deliberate. Very hurtful :(",
            "I went through something similar a few years ago. Actually thinking about it now still hurts. She would contact me every few months to see how I was doing, and every time I would spiral and just break down. It got to the point where I had to tell her to stop contacting me. To this day I can't talk to her. We had dated for a few years and it got to the point where I was looking at rings. I asked her parents for their blessing, her older brother even. I don't want to talk bad about her as I cherish the memories, even if they are tinged with sadness. She broke up with me because she wanted to find herself. Several years later.. she is a single mom with kids that have several different fathers. Maybe I dodged a bullet, but it still saddens me. \n\nI'm sorry for your heartbreak. At least you know.",
            "Yeah, it sounds like what happened is just what he said. It's a very strange gift; I know it's very hurtful, but he gave you exactly what you needed to move on. We should all be so \"lucky\" to get that when someone dumps us.\n\nMy guess is that you DID have a great time together, but for whatever reason, he wasn't feeling it in terms of making this a long-term, potentially forever thing. I think deep down he knew that you guys weren't right for each other. Sometimes people just can't articulate this clearly. Could the breakup have gone better? Sure. But breakups are always hard and messy; people get hurt, etc. But you absolutely have what you need to move on.\n\nAll this means is that you now have a chance to find someone great for you who will want to be with you long-term (I'm guessing that's what you want).",
            "[deleted]",
            "He gave you something that belonged to his mother (is she ... still with us?) and told you to just throw it away? Jeez. He sounds like a callous person with major issues.\n\nThis sucks and I know it hurts. My sister dated a guy who did this. Basically was like, \"I used you so I didn't have to be alone, I don't know what to tell you.\" At the end of the day you need to realize it truly IS him and not you. It was the same deal: she thought they had an amazing relationship, he pursued the hell out of her, love-bombed her even, and then he was just like, \"I'm done\" very coldly. The good thing is that he did it now instead of wasting more of your time. One word of caution: My sister's ex reached out and tried to take back the shit he'd done, begged for her back. She knew it was a bad idea given how coldly he'd dumped her. She took him back anyway and a few months down the road, he did it again. Dude had MAJOR issues. After that, she cut him off and when he came back AGAIN, completely ignored him.\n\nI hope this won't sour you on relationships. Yeah, this guy had issues and he hurt you, but not everyone is like this. It's not a reflection on you or on relationships in general. \n\nTake care of yourself. My advice would be to block him and resist any urge to reply further, even if he does. He ultimately did you a favor (you can do better than him and find someone who won't do this to you) and there's no point in any further contact. Whether he's being honest about his reasons for breakup is irrelevant at this point. Focus on yourself.",
            "It’s hard to accept, but the easiest thing is to focus on the “I deserve better.”\n\nIt may seem petty, but you do. \n\nYou need a relationship that the other person is ready to put their all into. Someone that has more in common with you. You’re ready to settle down, and he wasn’t. You wouldn’t want to be with someone like that any longer than you were, so get back out there 🎉",
            "I feel your pain so much. A year ago I had the similar thing happen to me, but closure for me took a little longer. I have been for the last year almost waiting for her to fall back into my life, despite knowing full well that she never will. But over the year have been working on self repair and my own mental health, and it's taken until I deleted her from all my social media (old posts and photos) till I finally got closure. We were together a little longer, but it sounds like you still had a great connection \n\nStay strong, take pride in yourself and never give up on knowing that you are the better person in this! You still have such a wonderful life full of surprises waiting for you to explore",
            "Ugh. I am sorry for your heartbreak, but I am glad you found out within the first year and not after sinking more time into him.   \n\n\nOne of my vetting questions (if I ever start dating again) will be: do you consider yourself emotionally available? If they answer yes, follow up is \"what does emotional availability look like to you?\"  \n\n\nSo many people say they are dating because they want a long term relationship, or that they want to fall in love. But, then they don't account for the fact that their own emotional development doesn't include the capacity for real intimacy–– that they are only capable of the gestures of what a relationship looks like on a surface level. By participating in that it is enough to satisfy them for the short-term, but it is no way to go about seeking real partnerships.",
            "Marie kwando , the tidying up lady suggests to throw out everything, even pictures from previous relationships to make room for a new relationship",
            "All the best! You deserve better ❤️",
            "A lot of people in this thread strangely giving the guy kudos for his honesty. What sticks out more to me is his complete and utter disregard for her feelings. It may be the truth, but what a terrible terrible thing to say to someone you used to be close to.",
            "I just want to say how proud you should be of yourself for giving yourself to someone completely and for being that in love. Just make sure you don’t fear of this happening again and I hope you can give your wonderful love to someone who gives you just as much back. \n\nYou’re a lovely person and I know you will find the right ‘one’ for you. Be proud of the way you have handled yourself.",
            "You are a class act.  You will find love,  I believe. \n\n Hang in there! You are special and deserving of love,  mama.",
            "I somehow missed your original post, but I’m glad I saw this because it (and this) are exactly what I needed to see after this weekend. His personality seems so similar to the guy I was in a situation with, that it’s helping me process some things. \n\nI don’t really have anything insightful to say, but thank you so much for sharing. I hope you find happiness!",
            "“Someone I loved once gave me a box full of darkness.\n\nIt took me years to understand that this too, was a gift.”",
            "When I was in my freshman year of college, my then boyfriend broke up with me. We had been together since 10th grade. It was the most serious relationship I’d ever had at that point. I was certain we would move in together after college, get married, spend our life together. \n\nBut we both went off to college. I moved 5 hours away and he stayed home and commuted. We were around different people, in different areas and really learning who we were as people. \n\nI tried to grow myself around the relationship. No matter who I became, I was his girlfriend first. Which, thinking back, is a horrible mindset.\n\nHe broke up with me because we grew apart and he fell out of love. And it. Sucked. I was depressed for a while.\n\nI let myself cry for a couple of days. Confused in friends and just let myself be sad. But the more time passed the easier it got. I still thought about him sometimes, but I didn’t cry about it anymore. \n\nFive months later I met the man I would end up marrying. When I least expected it to happen.\n\nI know it sucks right now and you probably feel like someone punched you in the gut.\nBe strong. You’ll get through this. It’s going to suck and it’s going to be hard, but I promise it gets better.\n\nIf you need to talk feel free to PM me. Best of luck :)",
            "Yep. This sucks a lot. You have my sincere sympathy and a huge virtual hug! I too am (32F). It'll be about a year now since the man I thought I was going to grow old with pulled the rug out from under me. Like that last heart break, I healed and attracted someone who saw me shine. These relationships are cyclical. I learned a lot about which relationships to holdfast and when to let go. There's bound to be someone who's sees you for what you're worth. When you give it your all and it's not enough, you gotta see that he's not who you thought he was. Strangers are easier to move past. (Wince) Totally sounds cold but seeing him for what he really is, helps. Nevertheless, always keep yourself first, that way if the next guy is yet another stranger, you have TWO legs to stand on. Not one. Musch love sis. Have a pleasant yule.",
            "I'm sorry this happened to you, I know things will be better for you because you deserve it.",
            "I'm sorry this happened to you. I understand your original post. You're an incredibly insightful person. This has been a hard lesson to learn. Always listen to that feeling in your gut. Continue to speak your truth.",
            "[deleted]",
            "Ugh I honestly feel like it's always the ones that gush so soon into things that are always the ones to do this shit. At least that's always been the case with me. In future take their rushing as a bad sign, especially if they don't respect your wishes to slow down",
            "[deleted]",
            "so sorry. you seem so sweet. youll def find someone<3 you two dont sound compatible",
            "I was in a very similar situation recently. He was a lot easier to get over after the last blunt text like that. Block/delete/forget. You dealt with this really well so can take comfort in that. Good luck for the future!",
            "At least you got an answer. I *married* this guy’s emotional twin after 8 years together and spent a year and a half married before he decided he was never really happy. Same parents with the fucked up marriage, same apathetic attitude, same selfish way of being dumped even though I was his WIFE. \nAlls I can say is, girl we are better off. Better men are out there. I’ve already met them. Hang tight. I know this is the WORST feeling on the planet. You will smile again.",
            "Decent is a fine word to describe it I guess but that’s a serious dodged bullet.  Apathetic people are some of the types of people I can least stand after straight up assholes.  One is a prerequisite to the other, and it’s just bred from selfishness, horrible quality.  The honesty is great to be able to move on, but it doesn’t mask the fact that somebody would date for an extended period of time for such a petty reason.",
            "Oof, that was such a nasty thing to say. I’m really proud of you, OP, for taking the high road. \n\nOne of the things I learned in my extremely messy breakup - five years together, owned a house together, tldr is he started working in another state half time and started cheating on me emotionally, then dumped me and blamed me for it - is that you have to manage your own responses to this stuff, because expecting your ex to behave the way you want them to is going to end badly. They’ve already proven themselves to be not the person you thought they were just by the fact that they’ve blindsided you - I’m so glad you adjusted your expectations of that human accordingly, because it took me months of being consistently disappointed by a person I thought I knew to get there.\n\nThe other thing I want you to make sure you recognize with yourself is the unique challenge of your relationship that you thought was just fine blowing up in your face. Right after my ex dumped me, someone said “he didn’t even give you the luxury of your relationship falling apart,” which has always stuck with me as a very apt assessment of these situations. There’s a special place in hell for people that absolutely broadside their significant others with a surprise breakup and it’s a specific sort of trauma that you unpack in therapy (if you’re not already there I recommend it) and affects you differently than a relationship that mutually disintegrates, for lack of a better word. \n\nAnyway, I wish you well. This kind of stuff is not easy and I hope you find some peace soon.",
            "I hope op doesn't see this comment and it'll just get buried with the others, but I'm thinking maybe he wrote that specifically because he knew it would help her get over him",
            "I can kind of see where he’s coming from, because it sounds a lot like me, but at the same time, 9 months is a hell of a long time to lie to *two* people. \n\nI’ve been in the exact situation from the other side. I’m a turbo introvert, and never really dated anyone ever (27m). I’ve had my flings here and there, but there was one girl I also met on bumble who was great. Smart, kind, sweet, and all things good. We hit it off immediately and started seeing each other a 1 or 2 times a week—no longer than a total of 2ish months if I had to guess. Then one day, she was lying on my chest after sex and said “I feel so safe with you.” It instantly came crashing down around me and I realized I was just using this girl for the companionship, for the emotional connection, for the physical touch, to feel important to just one person, and to make me feel like I was normal. I really did like *being with her,* and I never did anything other than give her all the respect and attention I could trying to be what I thought a good person in a relationship could be.\n\nI realized immediately that I’d been lying to myself the whole time about why I was pursuing her in the first place, and I was in turn lying to her as the byproduct. It wasn’t malicious or anything, and I broke things off in a similar way by essentially sending her a message containing all of my thoughts and apologies. Ultimately, I felt bad, because she was someone who had everything going for her (goes to Harvard, parents have incredible home at country club, she was working on a patent and company for her career in GIS), and I felt like I was going to pull her away from that no matter what by pulling the rug, so I did it as early as I could think to do it as not to pull out too much with me. For pulling the rug, I’m embarrassed and sorry, and it’s because I was too weak and inexperienced at the time to do good for myself and for a partner. \n\n9 months is a long time, and I don’t think I can excuse a lot of his behavior in the same way as I might be able to within 1.5 months. I’m sure it wasn’t all fake, and I hope this gives you a little insight.",
            "It really looks like you dodged a bullet. He seems...a little...",
            "Damn reading your first post and this one I have such mixed feelings. I mean he did the right thing by realizing he wasn't feeling \"it\" and letting you go. He could have let the relationship drag on and on hurting you even worse, but he realized your tie was stronger and cut you loose to hopefully find someone worthy of you. But damn is he not a cold hearted bastard. I know this sucks, but time will pass and you will meet someone who makes all the crappy relationships worth it.",
            "Wow, OP, I disagree with many of folks here. They're acting as though you were unreasonable to seek out some sort of explanation. But, IMO, you weren't. You were in a seemingly great relationship with someone for 9 months - so much so that you had met his mother.\n\nIf my boyfriend of 6 months broke things off, tomorrow, with very little context, I'd he super hurt, confused, and heartbroken. This isn't a situation where OP saw it coming . She didn't, was blindsided, and wasn't given the opportunity to speak her truth.\n\nHis response wasn't some \"utilitarian\" bid to crush OP's longhoping for him. Nor did he snap in frustration by her continuously harassing him for an explanation. He was simply being an unempathetic, cruel, douchebag. Being, \"honest\", doesn't invalidate how disgustingly cruel his response was. If he were empathetic if any way, shape, or form, he would have been tactful. A simple, \"I'm no longer interested and don't have anything to say\" would have sent message. Informing her that he viewed her as a playtoy to meet his own needs? Cruel and unnecessary.\n\nOP, you dodged a bullet. This man is missing something.",
            "Not bickering is not a strong point in a relationship.",
            "I mean..why said that if he wasnt trying to hurt you?\n\nHope youre doing ok :)",
            "Why selfish ? He is being honest and why would he force himself in a relationship he doesn't want just for the sake of not being selfish ?\nWhat he did to you, you will do to other people. A breakup is never an easy thing and the one who takes the initiative of breaking up is not necessarily a bad person.",
            "No one can deny you the love your meant to have. Be patient. They will show up",
            "That’s cutting. I’m sorry. You’ll be better tho!",
            "I feel exactly how you do. I still don’t understand it. it hurts so much. It really does feel like having the rug pulled right out from under you. I’m so sorry you’re experiencing this heartbreak too. I feel so used.",
            "I feel you. I found out on Friday that my girlfriend of 3 years cheated on me. Everything reminds me of her. My emotions are all over the place. It's horrible what people think is acceptable to do to someone who loves and trusts them. Stay strong.",
            "It's nice that you got some closure but you really shouldn't have broken no contact. I'll be really honest: you would have gotten that answer in a few months anyways. Because it's obvious that someone who treated you that way wasn't looking for more than a short-term resource, whatever that resource was. To be honest you are old enough to have more self-control than to keep going after this guy for answers. You'll never be able to move forward regardless of what answers you get from him unless you start looking inside and asking yourself what you need, and stop fixating on what role you may or may not fulfill for others. Sorry to be harsh but this advice is coming from having been in your shoes before.",
            "Sorry that happened to you. You don't deserved it. But it could have been worse, you could have gotten pregnant and be broken up with by such a 'callous' person. All the suggestions here are true and correct. Make yourself busy with a hobby or with social life, hang out with friends and  relatives as all of these make time go faster. Focus on yourself and move on and don't look back. Focus on the positives in your life and try to  enjoy as much as possible. At this stage in your life, you don't need drama. Despite of what happened, remember that you deserve better and that still, life is beautiful and there is so much to live for. Goodluck. And happy holidays.",
            "You're in a better place now. You can focus on yourself and get to 2020 with a fresh slate.",
            "Wow. That fucking sucks. I’m sorry you are going through this. The next couple of weeks, months, are probably going to be really hard. Me personally, I feel like I’m going crazy. The anxiety has me feeling like I’m drowning.\n\nIt doesn’t help much, but I talk out loud to myself about my ex and all that on camera to help me cope just a little bit. I have a ton of unlisted videos up on my YouTube account. Posting them there helps me feel like I’m being heard, even though nobody will ever see them.\n\nI hope things get better soon. Best of luck.",
            "It happens and it stinks.  Be grateful you only lost a few months and not a few years or a few decades.  And you learned something. \n\nAt least he had the insight to know you were a place-holder.  Some people do this and they aren't even aware of it, they just look around like they're in a Talking Heads song and leave.",
            "Been thru exactly the same thing, it hurts worse due to the unrequited feelings.",
            "With a response like that and with what seemed like a stable person/relationship.  I'm sure he had thought about the relationship he had with you for a long time and had distilled his feeling down to the most truthful and blunt response.  While that REALLY sucks for you to be told like that at least it was honest (like you had said). \n\nPeople will do some interesting stuff when they get desperate and lonely sometimes.  Go on dates with people who they know they arnt compatible with just to have a person to go on a date with.  They will often treat the date like they were intrested in the person just for the sense of normalcy.  \n\nI feel like he may have been doing that with you but got to the point where he had to be honest with himself and eventual you too. That the relationship was him just going through the motions and he really didn't feel the way for you that he was portraying.  I'm sure he didnt know a better way of handling the breakup other then how he handled it...like a bandaid he ripped it off quickly and painfully.  \n\nWhile it may not have been easy for you (I've been there is sucks), no way of ending the relationship in an honest way would have been. A long drawn out discussion would have been just as heartbreaking.  While it sucks that it didnt work out at least you didnt get any deaper into a loveless relationship and end up in the dead bedrooms subreddit \n\nGood luck and when you do finally meet \"the one\" you'll look back and start to see the signs and holes in the relationship you couldn't see before.",
            "OP, I am in the same situation and my ex is not blunt, he leaves it open ended. I question \"who was I with\" all the time. \n\nI think it's great that he was even capable of saying something like that. It sets a boundary, tells you what you need to know to move on,  and allows you to heal. It completely sucks right now, but it will be best in the long run.",
            "Clearly using someone for emotional companionship is a shitty thing to do. I do think that a lot of people do it without actually knowing that is what they are doing. \n\nIt's actually quite remarkable of him to know that's what he did and to acknowledge it directly to OP. \n\nMost people don't get that much of a real answer when they are broken up with so harshly.\n\nIf he knew he was doing it, then that's an insanely shitty thing to do, but my guess is that he realized that's what he was doing and then broke it off after he thought about it for a few weeks.\n\nMy best guess is that he really enjoyed the relationship if OP is accurately depicting it. Then, at some point about a month ago, he stopped enjoying it because the emotional hole that he was using OP for was fulfilled. \n\nIt was at this point that he had a realization about the relationship. So, while him and OP connected well and everything was going really well, he then realized that the relationship had runs it's course for him. He wasn't interested in a long term relationship with OP and he didn't know what to do. \n\nThen, he had to mull it over for a few weeks to find out if this was a temporary thing or if it really was true that he was done with the relationship. Turns out, he really did only want it to be a short term and pleasant relationship, but he isn't sure what he wants going forward. \n\nAt that point, OP emailed him and then he had to make a decision. Break up and move on, or put up an act in the hopes that his feelings would come back. \n\nFor most people, this is the best way to end a relationship, with as much honesty as possible. Much worse is for the person to put on an act or cheat or ghost or whatever. \n\nMost people aren't socio-paths that use people intentionally for emotional support, most people do it but don't know they are doing it until much later on. Most people just know that they feel a lot better when they are with that person, so they keep on seeing that person. \n\nIt's never easy to go through a break-up, so I hope OP feels better soon.",
            "Yeah those people are assholes. I was in a relationship like that for a long time but the girl was always straight upfront with me that I was only there for emotional support and that she wanted nothing more.\n\nMy brother is doing the same with this girl he's seeing, she wants more but he keeps saying no no but they still see each other in the meanwhile. I'm sure like me she's hoping he comes around tho...\n\nIn the end it worked out for me, I found someone who wanted me completely and jumped and it's been awesome and she soon found someone else to also have a complete relationship.\n\nHowever not being honest with the other side is straight up wrong.",
            "He gave you a response most people would die for. \n\nThat’s hard and it won’t be anything but hard. \n\nBut that’s a straight jacket response.",
            "I’m pretty sure the person I’ve been with for the past year and a half is like that. I wish he would admit that he is actually using me like that and doesn’t love me. Like others said it hurt but at least you got the truth. Mine still says he’s a nice guy and I’m the one at fault for everything.",
            "This is essentially what happened to me 6 months ago. My defacto fiance told me, \"I love you and I do need you...but I don't need you right now\". She was always a victim in her life and I think in the end she couldn't actually admit to herself that she used me, just like your ex used you. \n\nOn our last call she wasn't as forthright as your ex, but she essentially described needing me for the length of our relationship and dropping me when she no longer did. I think I took the highroad, although I did say so part of her was \"broken\" for treating me like that...but I couldn't help it. She had issues she will always run from, and unfortunately I was collateral damage of that flight response.\n\nIt's been 7 months and it has gotten easier but it still is incredibly painful. I wish you the best OP. PM me if necessary. ❤️",
            "I've been through something similar. It's tough. Stay strong, there'll be ups and downs and that's totally okay.",
            "[deleted]",
            "You must be in a lot of pain right now.  I'm so sorry.  That's a devastating thing to have happen.  I want to tell you that, it's okay to wallow right now.  I mean REALLY wallow.  Be sad.  Be crushed.  Be all the things that you are.  And, one day, you'll also need to climb out of that hole.  You'll find there is sunshine and happiness.    \n\n\nAs for how to trust again, it's a leap of faith.  It's always a leap of faith.  It always has been, and it always will be.  But one day, you'll be out of that hole, you'll have taken some time, and hopefully, you'll be ready to take that leap again.  It's a risk.  But life is full of risks.    \n\n\nI wish you all the best.",
            "I'm sorry this happened to you. Something similar happened to me, and believe me, it sucks now but you'll eventually learn and grow from it. I think it's good that he gave you a clear answer, because you won't keep wondering \"what if\" anymore. There's nothing you could have done - you broke up because he just didn't care enough.\n\nFyi, I think when there's seemingly nothing wrong, you never argue, etc., it's actually a bad sign. It probably means you're still in the honeymoon phase and not comfortable getting messy and emotional with each other (or at least he probably wasn't). Considering he never discussed these feelings with you before, it sounds like he's not ready to be in a real relationship that involves sharing feelings and being there for each other. I think the breakup is the best thing for both of you, and it sounds like you're aware of that now.",
            "Seems you need to mourn the loss of someone who was dear to you.  Sucks they did that to you.",
            "I'm sorry to hear about your situation. I think it happens to a lot of us and the scars won't heal easily or at all. My relationship just ended in the same way - someone I thought I'd be with for the rest of my life and thought he'd stick through it with me and he had made mention of that too. Then without warning he dumps me and that's pretty much it.\n\nLife is like that sometimes and it's nice to vent. Even though you know the answer to what you must do now it doesn't really make it any easier.",
            "Humans are strange. Quite often we don’t really know why we do things. We make up stories to ourself by default to make sense to ourselves. Shown for an example by Michael Gazzaniga research on split-brain patients. From an early age we learn that we better have an explanation for our behaviors. Otherwise mummy well get even angrier. \nMaybe he’s out of touch with his inner life and doesn’t know why. Who knows what? I been there myself. Like ‘’this girls is too good for me, I’m so fucked up, only gonna hurt her, better brake it, she’s better of that way in the long run, but she is so emphatic so she will  worry about me, better make her believe I’m an asshole so she can just forget about me... Not a rational way of reasoning, but I done it and have had friends who have done it. \nMaybe he’s depressed?",
            "TBH, the \"easiest\" answer is \"I did something unforgivable, you don't want this\" and even that (I've had it happen to me) isn't easy to walk away from.\n\nYou had **long term** plans with this guy.  That isn't an easy thing to detach yourself from.   \n\n\nAt 9 months, my guess is the \"honeymoon\" effect was in play or starting to phase out.   Basically you are so wrapped up in the \"new\" of a relationship, your brain tells other signals to stuff it early on.   It just sits there and says BLISS BLISS BLISS!.   Over some time (like 6 to 9 months) the same things no longer trigger that BLISS BLISS BLISS thinking.   That means the irratiating thought of \"but he chews with his mouth open, gross\" is allowed to rattle around your head when it was previously denied.\n\nIt could have been something like that for him.   Or he could have let the relationship go faster than he was ready for and then essentially \"woke up\" and was like \"how did I get to here?\".\n\n\nThe best way to think about this is that he had \"reasons\".  He had enough \"reasons\" to have an uncomfortable converation with you about breaking up.   But in truth, he also didn't care to share those \"reasons\" with you explicitly (which is fair).   Asking him why, which I understand for you feels like a great way to try and process this, is likely coming across to him as \"tell me what I have to argue against to get back together\".   He's saying he doesn't want that.\n\nDon't let this hurt your faith in people.   In the end, he chose to be mature and end this directly rather than what loads of other people get \"well I'll just betray their trust and let stuff sort itself out... plus more fun for me\".   Cheating is horrible because not only do you feel betrayed, but you are often \"discarded\".  You literally get to see the person you were cast away for as well, which stinks.   \n\n\nI'd suggest reframe your perspective here.   Yeah it stinks this guy didn't work out.  He was legit and just came forward with that and ended things in a mature way.   But you also should fill your life with people who appreciate you - so making any \"just as friends\" plans is kindof silly - he doesn't want that.  \n\n\nGive yourself some time to grief the loss of this guy... and the future plans you wanted.   Eventually you'll feel better and be ready to try something else.   There is no magic period of time.  There is no good way to accelerate this, it just happens when you are ready.\n\n\nI will add, if you try to jump back in (but still have scars about this) you're going to potentially generate a negative/toxic relationship.   I say that from experience as well.   \n\n\nToxic relationships are like the honeymoon thing, but instead of BLISS BLISS BLISS coming into your brain you get AT LEAST IT'S NOT AS CRAPPY AS MY LAST ONE!   which as silly as it sounds, that is what happens.  You are thrilled to not be experiencing the same type of hurt/pain/whatever... but just because someone isn't exactly aweful as the last doesn't make them immune from being a jerk in other ways.\n\n\nSo... instead of getting jaded about people in general, look at how you let the honeymoon effect play into things for you here.  What would you do differently?   Is there any feedback you could have solicited from him to change this?  Was it unavoidable?   Adapt!",
            "I don't know you, and I don't know this person, but this sounds like a lie to me. Specifically, him saying \"I used you for companionship until I didn't need it anymore\" sounds like a lie. There could be a lot of reasons for this. Maybe he's really hating himself right now and is searching for ways to cast himself as a villain to justify this hatred. Maybe he's casting himself as a villain to make it easier for you to move on from him, which in turn will make it easier for him to move on from you. Maybe he's lying to himself, and he thinks that's what happened because he's not willing to confront or admit to himself what was actually going on. Maybe he has no idea what's going on in his own head and just picked the first cogent explanation that occurred to him. In any case, I wouldn't be 100% sure that the person you dated for that period of time was a fiction. To me, it seems just as plausible that the person who put up those walls and sent that text was a fiction. In any case, you did the right thing, and my heart goes out to you for the pain this has caused and will cause you as you go through the healing process. Remember to take care of yourself.",
            "I had a eerily similar breakup a few months ago. He became very distant and then broke up with me, I thought our relationship was perfect. He was so cold during the breakup, it hurt, but I think it made me realize he wasn't the person I thought he was. Our exes are broken people that don't deserve our love and companionship. You're handling it so well already by trying to stay no contact, time will heal all <3",
            "You deserve someone that will love and respect you. The silver lining here is better that it ends now than later. Good luck, I am sure you will meet someone amazing one day!",
            "Oh boy this is a big fear of mine:(",
            "I am 6 months in with someone who might decide to do the same thing. I think the truth of it is that anyone can do this, I would even venture to say that MOST DO do this. I am grateful that he let you know when he did, but I am sorry you’re in pain. \n\nI also think our age (i’m 31) makes it feel a little more acute.",
            "Listen, I started to come out my version of your big hurt, after maybe six months, when I realized that if I didn't want to spend my life with someone, then I would break up with her. And then I realized, how could you spend the rest of your life with someone who really didn't want to be you.\n\nHe doesn't have to give you reasons. The fact that he's decided he doesn't want to spend his life with you is all you need. You would do the same. Some people who break up see the clarity fast, in others, it slowly simmers, but once they reach the decision, it is valid. They don't have to explain.",
            "Same thing happened to me -- except we had been dating for 5 years... and now he is giving me the silent treatment and totally ignoring me. I've never felt more discarded or disposable and am so confused.",
            "The world 🌎 is full of idiots. Illuminate them from your path and live a happy life! You deserve a man who loves you!",
            "This is a tough one. If I'm being honest, I've done this myself inadvertently, and I'm guessing he didn't set out to hurt you.\n\nSometimes, when one partner is in the process of getting to know a potential long-term partner, they're doing all the right things, going through the motions, but still exploring the relationship. They're not deliberately leading someone on, they're just looking for their own answer and that's received as an investment into the foundation of something long-term. Often times, it turns out that it actually is the foundation of something long term, and I'd argue that that's one of the right ways to start a long term relationship.\n\nI think in these situations the problem arises when they find the answer is actually a no. Maybe it's that the problem was they needed more perspective, maybe they thought they genuinely needed long-term companionship but that idea died out as the possibility grew real.\n\nI guess the point I'm making is that there are alternatives to him being a sociopath, and the honesty is a good indicator that he was just as surprised as you were.\n\nI'm sorry you're going through this :(",
            "Good for you for taking the high road. I’m going though a break up in which I was no longer happy and caused the breakup. My ex has taken every low road possible to attack my character and my career with public revelations about very personal things to friends and coworkers. Messages to previous exes and screen shots of their conversations to embarrass me. More than anything, I have never been verbally attacked with such vicious, vengeful language (“I will burn you to the ground” etc.).\n\nAnyway, the point is, good for you. I don’t know your situation, but having thoughtful, humane response even when you are deeply hurt speaks to your high character.",
            "My ex-fiancé blocked me and left me in the dark hours after the engagement party. She let her Dad end the relationship and after it was all done, I discovered her Dad was money motivated and simply put, the apple doesn't fall far from the tree. It was a 4 years relationship and ended because her Dad failed to get what he wanted and she didn't even defend me when I most needed her. Be happy that you got your answer straight up, I had to search for mine",
            "If you haven't already used it, I can personally recommend the Headspace app, and particularly the \"handling heartache\" module as a good way to snap out of a negative thinking spiral if you find yourself in one. Give yourself time and space to grieve - this is a loss.",
            "Make sure you find yourself a reason to wake up everyday and try to make sure that it is something that helps you makes you feel better on a daily basis. I can't say I know how you feel or what you're going through but in the recent past I've come to learn that all it takes is a moment for one's life to change for the better or for the worse. \n\nI hope you find strength and heal!",
            "I’m going through something incredibly similar to your situation right now and I’ve saved this post so that on hard days, I can go back through all of the comments here that will remind me that it’s gonna be okay. I woke up today feeling purposeless and alone, and somehow knowing that someone is going through the same thing I am right now is comforting. We’ll get through this.",
            "Thank you for sharing this. I am going through something similar. Got broken up over text after a six year relationship. Guess I saw it coming as soon as I decided to move to a different country for a better future. He said he’d follow but my gut knew he wouldn’t and that will be the end of it. It happened several months back but I still have a hard time moving on sometimes. I employed to no contact rule but he keeps reaching out and giving me mixed messages - like he wants me in his back pocket till he finds someone new to move on with. I on the other hand am so much better off without talking to him but I have a hard time setting strict boundaries because at the end of the day I am still not ready to accept that it’s the end of our story. Although I have to say I’ve come a long way in the last nine months and can tell you that time is the best healer. For anyone reading this, hang in there, yes you’ve probably heard it a million times but that’s the best advice in this situation. That and take up a hobby - reading works for me, helps to enter a different world I suppose. Good luck on your journey, you have a lot of compatriots going through the same thing !!",
            "You know, I wouldn't jump to assuming this is an \"incredibly selfish person\", because once you reflect on the situation did you really do your own due-diligence to protect yourself and make sure you were on the same page from the get-go. Ask yourself, did you really ask questions to assess what HE wanted, what the two of you were after a time, where things were going? Did he lie to you and mislead you directly by telling you what you wanted to hear? Were you direct about what you wanted? OR did you just passively hope that you were on the same page without confirmation? \n\nLook, you need to treat yourself and your time as valuable, your heart as something you want to protect. If you go out in the world of dating apps, there are a LOT of people who will be more than willing to waste your time, be your part-time lover, hang out from their own loneliness. They aren't bad people, but you'll feel horrible and heartbroken if you aren't making yourself a priority. That looks like telling a man what you want and are looking for, even if you're scared to scare someone off. You'll scare away the one's that aren't right for you, who will be MOST of the people you meet. \n\nIt also looks like checking in and not just settling into routine. Making sure you are actually growing as a couple rather than disconnectedly-coexisting. This heartbreak could be something you could have prevented. \n\nAnd yes, there are outliers to every scenario, there are liars, but learn to ask the right questions and trust yourself to cross those bridges when you come to them, and in the meantime be more pointed about and clear about what you want for yourself and a relationship.",
            "I don’t know what I can add to what has already been said but I feel for you really. I’m glad you’re sticking to what you know you need right now and applaud you for your strength so far. Just be prepared for the waves of emotions that will come out and engulf you when you least expect it but eventually these waves get smaller and smaller to the point you’re able to stand tall and be proud of how much you’ve grown from this experience. I wish you good luck!",
            "Just hang 10, you'll be alright. Swingers is usually the movie I recommend to people who are going through heartbreak, and then some healthy Kill Bill Vol 2. Then topping it off with Finding Nemo. The great thing about reddit is, chances are someone is going through what you are. Just remember, that you're like a big bear, man.",
            "Similar thing happened to me recently. Someone I still love broke things off stating she wasn't ready for a relationship at this time. She asked that we pause our romantic relationship. Two months later she sends me a message stating that she is seeing someone else. It hurts a lot, and I know I deserve better than that. Still hurts though, I wanted to marry her someday and thought she felt the same.",
            "I've never been in a relationship before, and I fear and hope I'm not someone like this. I'm trying to get over a fat crush right now and its tearing me up inside. I'm sorry things broke up the way they did, you seem like a kind person. Why do kind people face the harshest realities..?",
            "I read a lot of heartbreak stories on reddit but I think this post resonates with me more than most. It's sad for you obviously because you had the rug pulled out from under you. But it's also sad for him that one day he woke up and realized that what he was building with you wasn't something he wanted anymore and he knew he was gonna have to hurt you. I'm sorry you've gone through it, I've been there. I hope you find someone that fits even better and lasts much much longer.",
            "It hurts a lot to go through a break up. The pain you feel is a part of who you are and how you process separation from a loved one. This feeling is something you own and is yours alone - it is a powerful thing. In my view it has nothing to do with the person or relationship you morn, let me explain why. After one hard breakup I realized that when I've gone through breakups I recognized this breakup pain from an earlier time, from my childhood.. i had the same emotions when my parents would leave me with a babysitter. I felt torn apart and all alone. This is my pain to feel when I am being separated from someone I love, regardless of the ex... this knowledge that my feelings were separate from the person I was dating and not because of them gave me power back over my feelings. The ex didnt matter. I did. \n\nAlso,  this pain will help you empathize and help others in the future. \n\nTo help you feel better please know that it is always better to be single and loving yourself than in a relationship with someone who doesn't love you the same way.  You deserve better. Being happy and single is so much fun one you are ready to enjoy it again. And when you are happy and single then you can be ready for the right person for you. Don't morn a relationship that was with Mr. Wrong.  Focus on living your best life.  You are great and you deserve it!!",
            "I was in a relationship that was so important to me. I truly thought we both loved and adored each other equally. In the end I found out he lied to me so often and about so many aspects of his life, I felt like I never actually knew him. That is the most painful part to work through, that you were tricked and used. \nTake comfort in the fact that your love was true and you gave it your all. Know that you being authentic and vulnerable does not make you a foolish. The person who lied and was dishonest is the person that has the issues, not you. Take time to grieve and be compassionate to yourself.  Best of luck my friend.",
            "I think he made a post too.",
            "As someone whose marriage of five years (relationship of 7) is ending (not on bad terms), I feel this. \n\nIt sucks and it’s sad. I’m currently in a place where I’m trying to distract myself. It’s tough.",
            "I’m sorry this happened to you. I just went through this exact same scenario. It’s truly a different type of pain! Time is on your side",
            "I’m so sorry OP. I totally relate",
            ">\"...I used you for companionship until I didn't need it any more.\"\n\n>He is a good guy, and a decent human being.\n\nUm.",
            "poor sweety\nits hard to say, but try to move on; focus on what you have; your friends, family",
            "I'm sorry. Something very similar happened to me 2 months ago. We were together for 9 months. We were planning on moving in together, talked about getting married one day. It was loving and effortless and not like anything I'd ever had before. Everything seemed perfect. Early October, we went on a picnic together. I'd prepared all of the food and supplies, drove us to the park. She was sitting on the blanket and I was setting out all of the food I'd prepared, when I got a text. Yup, she broke up with me via text while sitting right next to me.\n\nWe talked for a while, cried. She told me I was a perfect partner, but she couldn't handle being in a relationship anymore. I was devastated, but didn't argue or beg. I told her I loved her and I would never want to be in a situation where I made her unhappy, and if this was what she needed than I was okay being friends once I'd had some time to process. She said we could hang out again once the dust had settled.\n\nThe beginning was so hard. I couldn't eat for 3 days. I tried texting her 2 weeks after, just asking how she was. I knew that she'd been dealing with a lot of stress with work and school. She said she was fine, but she needed space. I gave it to her. Sent her a text a month after the breakup. Told her I had a couple of her things at my place that I'd like to return, and that she had a couple at hers. Asked if we could meet for coffee and light conversation (dipping our feet into the friendship pond) and to swap things. Told her I understood if it was too much for her right now and that I could just drop off her stuff with her roommate if she wanted.\n\nShe responded a few days later saying, \"Yeah, just drop my stuff off. Yours will be in a plastic bag by my door. I don't want to see you again. I know I'm being a coldhearted b\\*\\*\\*\\*, but I'm over it. I'm sorry you got mixed up in my bull\\*\\*\\*\\* by chance. Bye.\"\n\nThat was it. I picked up my things when I knew she would be at work, dropped off hers. She didn't even return most of my things. Just my full water bottle and a fork. Like she'd just dumped whatever I left the day she broke up with me into a grocery bag and left it on her doorstop for a month. She never texted me again, so I didn't either. The stuff I left was replaceable and I didn't want to return to her place or even risk a cruel response if I texted her about it.\n\nI may be a romantic, but I'm also a realist. Even as deeply in love and devoted as I was, I knew there was a chance we wouldn't work out. But I thought if things ended we would still always be friends. We were so close. She knew me better than anyone. We shared each other completely. Then she just cut me out completely. I felt betrayed. She was the first person I'd trusted with my heart and she'd ripped it out and stomped on it.\n\nIt's been a month since that text and you know what? I'm okay. I'm happy, optimistic about the future. I'll admit writing about her and what happened made my throat feel tight. But I can talk about her without crying. I can appreciate the time we shared. We made each other happy for a long time, and I learned a lot about myself. I can recognize that part of our relationship weren't great. She could be so good to me, but she wasn't always. Her playful ribbing wasn't always playful. She tended to take out her stress on me. She could be very self-centered and self-pitying.\n\nI can also see that I was so concerned with her happiness that I didn't consider my own often enough. Not only is that not fair to me, but I can see how that would put pressure on her to act like she was happy when she wasn't. I can recognize all of these things. I can acknowledge that the way she ended things was crappy without holding a grudge.\n\nTime really does make things easier. It's not about forgetting things, it's about regaining your prospective. Right now you're deep in your grief. The path to being okay again probably seems difficult and distance. But you will be able to get back to feeling like yourself. Let him go, and focus on yourself. I started spending more time with friends. Started a hobby I'd always wanted to try. Just keep going. Be gentle with yourself, but don't stop your momentum.",
            "He met someone else. People will make time for you if they want, no matter busy or introverted they are. When people don’t want to make time, they don’t want you.",
            "i think he did the right thing. although it seems rude and heartless, it was the fastest way for getting you to understand that there is no hope. this hope of yours could have lasted months, years... and you know, a lot of people keep this hope alive so they never feel completely lonely. but he was true to you. now you have your answer, he isn't giving you any chances anymore. that's it. it's HORRIBLE. well, cry loud against a pillow in your bed, watch some youtube videos of how to move on, question yourself what went wrong, remember him in the details... it is part of the process. cry as hard as you can. but DO NOT allow yourself to not live. go see your friends, family, do stuff. in the beggining you will feel miserable doing stuff, but you will be slowly giving room for other things beside him :) good luck",
            "[removed]",
            "I'll probably be the odd man out, but I don't think the ex was being rude, hardhearted, manipulative, or deceitful. The relationship was ONLY 9 months long. And we don't know at what time he realized that the relationship was either not working for him or was unfair to the OP. It could have been a miscommunication where he thought it was casual and she started hearing wedding bells and he cut the ties cause at that point it isn't FAIR to OP. \n\nI get it, break ups suck. I'm sorry you are heartbroken. Be kind to yourself cause there is a type of grief that comes when things end (whether it's losing a person, a relationship, a job, etc). I hope you are feeling better soon.",
            "I did something similar with my ex. The only reason I could give her was I'm depressed. Now I've seen she's had a couple of boyfriends, and I still feel the same. Life is weird.",
            "Im so sorry this happened to you. You dodged a huge bullet. It sounds like he has no capacity for empathy. You’ll find someone who actually loves you in the future.",
            "I think you dodged a bullet. People do grow and change, but it seems like this was a case of him knowing he was using you for companionship for a while, aka he is aware of the type of person he is and hid it from you. If someone could hide who they truly are like that during a relationship, that’s a huge red flag. My ex, who could “NEVER cheat”, who would just end things or talk to me if there were issues, who presented himself as a selfless, generous, good hearted person, ended up cheating, lying, gaslit me. Was psychologically abusive, and just straight up crazy. Looking back, our relationship had serious issues and I was not happy. But it went from “we can’t wait to move in together and start our lives”, to “cheating is natural and happens in nature, I thought you’d get over it”, “I’m looking out for number 1”, and “I don’t feel bad for what I did”. \n\nSome people are aware of who they are, and are aware enough to hide it from people to get what they want. I’m sorry you’re going through this",
            "wow... what he said was really harsh. im glad that youre taking it well and that the bluntness made it a bit easier. he does seem very out of touch with himself and others by how he handled this break up.",
            "That must be tough to hear, but at the same time should have made healing so much easier for you. You do not need him in your life and you can find someone better (if you want).\n\nI find that many men, after being in relationships for a certain amount of time, start getting a bit too reticent and too confident, believing that they're such great catches and the actual relationship is holding them back from \"all the other women I can be with\".  If your partner stops being grateful for you being in his/her life, it's almost certain that switch has been activated.",
            "I'm gonna be honest, you played the victim and got a response. \n\nHe broke up with you, after a 9 month relationship, where he actually honored what you had when he ended it. He didn't destroy you, he broke up with you; something he had every right to do. I think his comment of using you was to get you to not contact him anymore. Right after being told that he's not suited for a relationship you ask if you two can revisit things--why??? He was clear in who he realized he is and how he views relationships (\"silently resents them\").\n\nI know beak-ups suck, but outs ok to be broken up with. \n\n\"Tonight he asked to come over, and said he had been thinking about the email all day and he really appreciated me sending it. He said that I don’t ask for anything unreasonable and have been an easy to be with partner; he thought he was ready to share his life with someone, and he’s just not. He said he keeps thinking that he’s just better off alone, and that he quietly resents the time relationships consume, that was his alone time before, and he recognizes that this is unfair to me.\n\nI asked if we could ever revisit things, if someday we’re both single, maybe we can just get a drink.\"",
            "Jesus. I'm so, so sorry. I had something almost identical happen recently. Come to exnocontact with us. Plenty of us that have been there. I'm always a message away, if you need someone. \n\n:( What a total fuckhead.",
            "[deleted]",
            "DODGED A BULLET.\n\nCould you imagine having kids with someone who could do that? How you would have to explain to a 5-year-old child that it's okay, their daddy loves them even though they did this shit AGAIN? \n\nYou can get through this. Focus on yourself, have a merry little christmas, give the finger to anyone who tries telling you you were wrong in this. You can do it. I believe in you."
        ]
    }
]