[
    {
        "post_id": "4cfe98",
        "author": "gfjq23",
        "title": "Update: Me [32F] posted on Facebook about Santa Claus not being real. My niece [13F] is a Facebook friend and is now devastated. Sister [36F] is furious with me.",
        "url": "https://www.reddit.com/r/relationships/comments/4cfe98/update_me_32f_posted_on_facebook_about_santa/",
        "score": 3229,
        "num_comments": 266,
        "created_utc": 1459257859.0,
        "selftext": "To summarize the last post, I posted a Ryan Reynolds meme about Santa Claus not being real on Facebook which my 13-year-old niece saw. My sister flipped out about it and wanted me to publicly rescind and say how Santa is real, but I thought my nieces were too old to believe in that stuff and refused. It lead to a crazy fight between us. Link to the [original](https://www.reddit.com/r/relationships/comments/4ad97e/me_32f_posted_on_facebook_about_santa_claus_not/).\n\nAnyway, I talked to my nieces and neither of them believe in Santa, so they were baffled about the fight. I talked to my BIL and he said my sister has been flying off the handle lately. We agreed she should probably get a check up and he convinced her to go to the doctor. \n\nOnto the update. They did a MRI and nothing showed up. Then they did some bloodwork which looked fine, except some elevated cholesterol. She isn't pregnant. They pretty much wrote her off as a crazy person and sent her to a psychologist for stress. After a session, the psychologist told her to do some \"deep breathing\" and sent her away as fixed.\n\nShe got worse. She stopped sleeping and barely ate, yet still gained weight. Any small annoyance would send her into a rage. Commercials were making her so upset she would ugly cry. I asked my BIL if they tested hormone levels or anything like that and he said the doctors didn't feel it was necessary.\n\nShe called me one day crying and apologizing, saying she was the worst sister ever and I had every right to hate her. She was so devastated she ruined our relationship and such. It was weird and NOT my sister, so when I got a chance to speak I told her she was going to go see my doctor and I wasn't taking no for an answer. I set up an appointment and my doctor ordered a full blood panel including hormone and vitamins before my sister drove to town for her appointment.\n\nWhen my sister drove up we spent the morning shopping and she was unpredictable. One minute she was happy and the next yelling about some perceived sight (\"That fucking pretentious makeup counter bitch just looked at me funny for my cheap drug store makeup.\"). It was uncomfortable, So I just walked on eggshells to keep her from exploding.\n\nAnyway, results of the bloodwork and a good doctor: perimenopause. Her hormones are completely abnormal. None of her doctors would even consider it because she was \"too young\" for menopause, so they didn't even bother running the tests. She'll be coming up with a care plan with my doctor for hormone replacement therapy and diet change to hopefully get back on track.\n\nShe still a nutcase right now. For example, she called me crying the other night because she will never have more kids (wha...her husband had a vasectomy years ago). I'm driving to her place next weekend and we're going to batch cook a bunch of meals for her new diet plan (I'll be doing it with her as I could stand to eat healthier). So it'll be a slow process, but we have a diagnosis and plan. I'm just taking her outbursts as \"crazy hormones\" right now because it'll take awhile to even out. \n\nI got her a dark chocolate cake for Easter that said, \"Happy Reverse Easter (when the Easter Bunny takes back your eggs)\" because I'm kind of a jerk. She thought it was hilarious though, so we are good.\n\n**TL/DR;** Sister is going through perimenopause, so she's irrationally, but understandably nutty right now. Oh, and Santa Claus still doesn't exist.\n\n**Edit:** Removed the comment about being bipolar. Though my SIL has professionally diagnosed bipolarism and does have wildly swinging moods within minutes sometimes (though usually a manic high or low lasts weeks), it wasn't my intention to slur a group of people. My sister was acting very much like my SIL can act sometimes, so it was the best reference I could make. I apologize for offending anybody.",
        "permalink": "/r/relationships/comments/4cfe98/update_me_32f_posted_on_facebook_about_santa/",
        "comments": [
            ">I got her a dark chocolate cake for Easter that said, \"Happy Reverse Easter (when the Easter Bunny takes back your eggs)\" because I'm kind of a jerk. She thought it was hilarious though, so we are good.\n\nthis is the best thing ever. so glad you figured it out. good for you for realizing she was totally out of whack and helping her get back on track. good luck!",
            "> perimenopause. Her hormones are completely abnormal. \n\nHoly crap when my mom went through this (before she got onto hormone treatments to balance her out) she legit acted like a crazy person, so I know *exactly* what you're going through. \n\nMy dad gave her an ultimatum to get it checked out because her behavior towards us was getting so irrational and violent, especially me. That's the one and only time I've ever heard divorce mentioned under my roof, because my dad said flat-out to her in the midst of a terrible argument he could not live like that any longer. \n\nNow she's post-menopause after getting hormone treatments and you would have *never* imagined she behaved that way in the past. ",
            "[deleted]",
            "[deleted]",
            "Good for you!  As women who have had children, our hormone levels should be checked often.  I had the same issue as your sister.  I was told by my doctor that I was clinically depressed and was given pills for depression.  When they didn't work, I was told to double the dose.  That's when I knew something was off.  I went to a psychologist and was told I just needed to give the depression pills time to work, so I stopped doing that too.  Finally I found a doctor that worked in bio-identical hormones.  He did all the blood work and lo and behold, my body had stopped producing the needed levels of estrogen, progesterone, and testosterone.  After a new diet plan (paleo) and some good compounding hormone replacement therapy, I'm as good as new.  \n\nI wish your sister all the best.  This is not easy to go through.  You can't control your emotions when your levels are off, no matter how hard you try.  Also, you are a great sister for not giving up and recognizing this might be the issue.  ",
            "[removed]",
            "I suffer from PMDD and can relate to what your sister is experiencing. Props to you for getting to the bottom of what has been causing it because so many people can be miss diagnosed with a mental illness when the symptoms are actually caused by hormone imbalances. These sorts of things can destroy relationships because it is awful being on the receiving end, it is really good of you to have stuck by her through this. The apologising thing in my experience comes from having a moment of clarity when you can truly see how irrational you have been and how much you have hurt the people around you, its horrible but it still doesn't stop you from switching back to crazy within the hour. I hope she gets better soon.",
            "You, ma'am, are an AMAZING sister. Well done. She will be so grateful when her hormones are back under control (as will her husband and kids). I hope I have someone who looks out for me as well as you looked out for her. \n\nI hope your sister starts feeling better soon, and take yourself out for a VERY well earned spa day. You deserve it.",
            "A lot of doctors just write off emotional disturbances in women as depression or, if they're less professional about it, \"just being an emotional woman.\"  Good on you for pushing to get a second opinion and find the root of the problem.  I have PMDD, and many people, including doctors, don't realize how much hormone disturbances can mess you up.\n\nAnd the cake sounds awesome, it sounds like she's got a pretty decent attitude about it now that there's a diagnosis.",
            "I'm just relieved to know a 13   year old didn't still believe in Santa Claus.-g-",
            "Hormones are no joke. They control you. I watched numerous people change drastically dealing with various hormone changing situations in their lives. Having kids, post partum depression, menopause, issues with reproductive organs that made their hormones outta wack, various health issues that effect hormomes... it changes people. \n\nGood luck.",
            "Good for you.  It is not actually too early for perimenopause at 36, doctors are sometimes just too prone to say \"Yeah, whatevs, you're just being a drama queen.\"  It's surprising with her mood swings her own doctors hadn't pulled the hormone panel.  Hopefully she will get some relief with proper meds control, but yeah - perimenopause is a bitch on your mood swings.  My sister had a tubal ligation in her late 20's and had to go back on birth control in her late 30's to get her mood swings to settle down.\n\nFor the record, I think the Reverse Easter cake is fucking awesome.",
            "She is lucky to have a sister that cares about her.\n\n",
            "This happened to my mother, her menopause hit at 35 and they wouldn't give her any treatment because she was too young and they didn't believe her...",
            "Just a note: I don't doubt your SIL has a bipolar diagnosis, but mood swings within minutes are incredibly rare and unlikely with bipolar disorder. Labile moods are much more indicative of borderline personality disorder.",
            "My mother wrote her dissertation on perimenopausal women. It really doesn't surprise me that it didn't cross the minds of any of the doctors she saw previously. Well done on getting her a second opinion.",
            "[removed]",
            "Pretty much anyone who gets butthurt over a facebook post needs this type of deep medical analysis.  ",
            "> I got her a dark chocolate cake for Easter that said, \"Happy Reverse Easter (when the Easter Bunny takes back your eggs)\" because I'm kind of a jerk.\n\nYou were tempting fate, my friend.  You very well could have had a literal death by chocolate.",
            "One of my best friends, who's a similar age to your sister and is a single mom, has a 13 yo daughter than I discovered DOES still believe in Santa Claus. I was like \"are you kidding???\" And my friend says no and that she wants her to still believe. Personally, I know the daughter has been made fun of in school for it, as if she isn't awkward enough. I dropped it for this last Christmas but I don't think I'll be able to let it go another year...",
            "Did anyone look into an underlying cause for the perimenopause?\n\nMenopause at 36 years is uncommon; it can happen, but it could perhaps be time to see a geneticist also.\n\nUsed to work with genetic disorders that cause early menopause.",
            "This happened to a family friend, and the family just imploded. We were all hearing about things through the grapevine, and this was a mothering figure I spent every child hood summer with (all of us kids were the same age and we knew all the parents well, and were raised as a village until about college age and drifted apart). There were DV reports, kids started to fail classes and act out, and the couple divorced. The wife had been told *this is the issue, and this is how to fix it* and refused to believe she was the problem. In the divorce she went after everything, and when she didn't get the kids *she went after the kids' stuff* \n\nIt was really messed up and made me sad, but now the kids are grown up and she's just out of the picture. I'm friends with the daughter on Facebook and every family related post is just her dad. \n\nI'm so glad you're on her side on this, and that she wants to get better. It's a rough road because hormone treatment is finicky and different for everyone. Good luck!!",
            "Doctors who don't listen really make me angry.",
            "[deleted]",
            "You're an awesome sister :)",
            "Kudos on you for noticing that something was wrong and taking her to the doctor. So glad to hear that everything's good now!",
            "Perimenopause can cause all that? I have lived through so many women who went through menopause and perimenopause and *maybe* got a little cranky. This sounds extreme!",
            "SO glad you got it figured out! My mother went through the same thing, but the doctors wouldn't do anything for YEARS (I was still in middle school so I had no idea she was anything other than crazy). Now she has FINALLY gotten treatment and she is back to being awesome. So glad you pushed it so your sister wouldn't have to go through that for years on end. ",
            "You're an incredible sister. ",
            "That cake. You are a 10/10.",
            ">Anyway, results of the bloodwork and a good doctor: perimenopause. Her hormones are completely abnormal. None of her doctors would even consider it because she was \"too young\" for menopause, so they didn't even bother running the tests. \n\nMy mom had premature ovarian failure and early onset menopause around the age of 30. Doctors can be infuriating sometimes. I wish assumptions were not made and corners weren't cut. If x could be a possibility, don't rule it out due to a low likelihood. Even if the chance of it being that is low, it still very well could be the issue!! What is the harm in testing to verify/confirm and find out?",
            "Peri menopause is when I developed a massive drinking problem. I literally felt like I was losing my mind. Getting help before she does any damage to\nHerself or others is so critical.\n\nYou're a great sister to stay on top of her!",
            "This definitely took a turn I was not expecting. I thought it was going to be something completely unrelated and she was just taking it out on you (which is kind of still the case but not something she's doing intentionally). \n\nI'm years away from this, but my mom is going through menopause. She has the hot flashes and not much else right now. I guess I didn't think just HOW much hormone levels effect our personalities. I'm glad to hear that you stuck with her and everything is on the right track now. You're a good sister.",
            "I'm glad everything was cleared up and your sister is getting help! And feeling very lucky that my menopause has never been that bad.",
            "You are, quite simply, amazing.",
            "You are a wonderful sister.  It would have been easy to write her off as some crazy person and be done with her, but you didn't.  I love my sister, but I don't think I would have had the wherewithal to stand up like you did and really dig into this mystery.  I probably would have retreated to a corner and mourned the loss of my relationship.  Again, you are a great person.",
            "You are an awesome sister. That's all I can say. Someday she will look back on this and know how awesome you are. ",
            "Usually with these kinds of cases, they never want to admit there's a problem, much less see a doctor. I'm glad your sister was cognizant enough to get checked out, congrats on getting to the bottom of it!",
            "When my mother was around 40 or so she had the same type thing happen, irrational and depressed and losing weight in her case. She ended up having some sort of tumor on her thyroid that was causing it to over produce. They removed it and now she is totally normal again.",
            "Make sure they keep an eye on her ovaries; long-term hormone replacement therapy increases risk of ovarian cancer. They caught it too late in my aunt.",
            "You're an awesome sister.  Best wishes for you both!",
            "My mom started menopause when she was in her mid-30s.  It's really not as uncommon as they make it out to be.",
            "Perimenopause symptoms can begin as early as mid to late 30's! If you feel like you're unable to control your emotions and feel aggressive or upset without cause, please see your doctor and push the issue! There *is* a cause!",
            "You are a good sister. This is what sisters who love each other do. I'd do the exact same thing for my 2 sisters and I know they'd do the same thing for me. ",
            "This is definitely one of the weirder stories on this sub. I'm glad it is getting better, hopefully she is ok soon",
            "So scary how much influence hormones have on your behaviour, personality, feelings, thoughts, etc. It's like they can change *who you are*.  Terrifying.",
            "Lord, this is really, really scary! I'm happy something, um, good came from an insane post, and it's a blessing that your sister has someone like you to help her and her family through this time.",
            "Its so weird that her doctors wouldn't even consider premenopause. Ive heard stories of women who can go into it as early as their 20's. Its rare but it happens. Its good to know that you had her back and wouldn't take the first opinion as an absolute.",
            "This was one of the few relationship updates that for whatever reason I was dying to read. Glad it had a (mostly) happy ending!",
            "She is lucky to have you, OP. You didn't give up on her.",
            "Jesus Christ, hormones are scary.",
            "I'm glad this got resolved...\n\nSo there was something wrong with her afterall. Better than just her being in denial about her children's ages I suppose.",
            "I'm glad to hear it got figured out :)\n\nI did want to mention though, someone who is having crazy back and forth mood swings like that is not bipolar and you can offend some people using bipolar as a blanket term for people acting like a \"crazy bitch\"",
            "omg, that's crazy OP!  I was thinking thyroid or something... I'm really glad you were so persistent and advocated for your poor sister.  She must be feeling like she's tossing around in a washing machine.  How awful.  You're a good sister.",
            "You are an awesome sister! I don't know if I'd have the patience to do that ahahha I'm glad I have only one brother!",
            "Glad you've been able to find why she was acting not her usual self, even if it is a treatable medical condition.",
            "I'm glad you got things figured out! It's nice knowing that there was a cause for her behaviour and that she wasn't just being super mean. It's good to hear a happy ending on this sub. ",
            "You're a great sister! I'm glad she's getting the help she needs. ",
            "You are legit the best sister ever. I wish you both the best :)",
            "What I love most about this is that you recognised that this wasn't your sister and instead of writing her off you kept looking for an answer and a way to support her. She's very lucky to have a sister like you.",
            "Thank you for continuing to take care of your sister. She may not be able to show how much she appreciates your loyalty,  but it has probably just saved her life,  and a lot of extra pain and sadness for her husband and children.  You go OP!!! ",
            "This is definitely not where I saw this Update going aha, congrats on working everything out :)",
            "if my siblings give me that cake when I hit menopause, I reckon I'd forgive them pretty much anything, that's hilarious.\n\nWell done on being so caring and not just writing her off.",
            "What a great job you did. You win the Best Sister award for sure!",
            "You're a good sister.",
            "I feel like this situation is something you and your sister get to share a lot of laughs about down the road! ",
            "I believed in Santa until I was 12. And I can concur that menopause sucks. I got on HRT before too much time passed because I started having horrible feelings of what is even the fucking point of being alive, why are we here, why am I doing this... It was terrifying. The hot spells are nothing compared to this dark sucking feeling of melancholy.",
            "> I got her a dark chocolate cake for Easter that said, \"Happy Reverse Easter (when the Easter Bunny takes back your eggs)\" because I'm kind of a jerk.\n\nThis is the best. Can we be friends?",
            "Make sure she gets tested for hypothyroidism, and not just the TSH (which does not offer a good diagnosis on its own), but her Free T3 & T4 thyroid hormones, and maybe antibodies for autoimmune thyroid diseases. Her symptoms sound very familiar – and having thyroid disease can throw all the other hormones off. For some reason, it's difficult to get a diagnosis, and most doctors go straight to psychiatric meds before considering there could be a root physical cause for symptoms. I've seen that scenario over and over again in support groups online.",
            "My mom went through something very similar to your sister, only she didn't have anyone to stand up for her, nor a doctor that would test for perimenopause. The result was several long years of my pre-adolescent and adolescent life during which I thought my mom was actually insane (not to mention emotionally abusive at times). It was only some time later that she realized what had been going on. Now she often speaks of those years with painful regret, especially since my own memories of events are ugly to think about. She hates that her hormones made her lose so much control.\n\nI am so grateful that your sister has you! Your insistence that she get proper care is so wonderful. It will take time for her hormones to find balance, but I'm sure that with your continued patience and support, she'll be your sister again soon. I wish you and your family the very best. ",
            "You, your family and you sister have my deepest sympathies.  My mother went through unbelievable misery with peri-menopause.  It's hell and I dreading I might experience the same.\n\nThe only thing I can suggest is to see if hormone therapy can help.  It's not a universal fix but it's better than nothing.",
            "Wow I'm glad you helped her! I hate when doctors are like \"let's not do any tests that need to be done at all, you're either crazy or making it up.\" Those assholes.\n\nAnyway, I'm pretty sure you just saved your sister and bil years of suffering, I'm serious!!!",
            "You're a good sister. I'm so happy to read this update and find that she hasn't just gone over the edge without some reason. Doctors are notoriously (infuriatingly) dismissive sometimes. I'm so glad to hear your doctor isn't. ",
            "Good on you for being caring and persevering. \n\nHopefully this is a lesson to her and her husband to pursue second opinions.",
            "What the fuck do you mean Santa does not exist. How else have presents been put under my tree for the past 20 years?",
            "I'm pleased you got it sorted. My Mum went through at a similar age to your sister. She went cold turkey due to a doctor dismissing it based on her age. She saw the same doctor a few years later who asked about her cycle and she said she didn't have one anymore. He checked her notes and noticed it wasn't in there. She told him you sent me away when I told you so that's on you.\n\nShe gets upset now when she talks about how hard it was so I am so pleased your sister had you to get her the help she needs!",
            "why tf is it so hard to get helped out with your hormones",
            "Take a look at her labs and make sure they've done a full thyroid work up. Most docs don't do anything but TSH. That's *not* enough, and has a very low sensitivity (is inaccurate) and the pros are still fighting about the range where treatment should begin.\n\nIt's best to be informed on this. High cholesterol, low appetite, weight gain all point to this. Thyroid problems can also cause sex hormone problems. Www.thyroidchange has tons of good info. Unfortunately, with thyroid disease, you (she) must be your (her) own advocate. ",
            "[deleted]",
            "Not really a big deal or related to anything, but vasectomies can be reversed, and even if her husband had become completely infertile, she still could have theoretically had another kid via a sperm donor and IVF. So going through early menopause is still pretty significant in terms of \"never be pregnant again,\" even if previously it was already highly unlikely.",
            "I'm glad your sister has some answers and a plan.\n\nPlease don't use \"bipolar\" to refer to unpredictable outbursts of emotion or changes in mood. I'm diagnosed bipolar and harp on this all the time -- it contributes to the stigma against us, and it's very much not how we generally behave. \"Unstable\" or \"unpredictable\" are more accurate and descriptive. Thanks!\n\nedit: god, the groupthink here is unbelievable. downvote me because I don't want my daily life misunderstood, stigmatised, misappropriated, and used as a fucking slur, and i spoke up and was fucking polite about it. y'all would fall all over yourselves if there were a transphobic or racist slur, but i guess people living with mental illness or disability don't get the same courtesy.",
            "> Oh, and Santa Claus still doesn't exist.\n\nI'm devastated, *devastated* I say!",
            "As another route ... Look into toxoplasma gondii... Has shown to make people fly off in rage for what seems like no reason. ",
            "If they're mad about Santa don't even think about mentioning Jesus.",
            "Actually Santa Clause was real. Not just like in the stories with reindeers but he was a man who gave children gifts!",
            "Has anyone asked why a 13 year old has facebook? Is that a thing? If so why is that a thing? I remember it coming out while I was in high school and didn't get one until I was almost 18.",
            "I'm seeing a lot of down votes for people mentioning she's 13 and shouldn't still believe in SC. I agree with that, but I'm wondering why you dissidents don't. Can someone elaborate?",
            "How did she seriously still believe in Santa at 13? Does your sister shelter the hell out of her? \n\nLike I think I was already drinking beers at 13.",
            "If you're young enough to still believe in Santa, you shouldn't have a Facebook...",
            "Delete your Facebook, contact a lawyer, and hit the gym",
            "How is she gonna react to the whole god/Jesus talk then?",
            "She's a teen she has no business believing in Santa in the first place!!",
            "If she's old enough to be on Facebook she's old enough to know Santa isn't real",
            "Man I thought I found out late at 10 ",
            "Perimenopause isn't an illness and doesn't make people psychotic.",
            "[deleted]",
            "She's thirteen how long were they planning to hold this thing out??",
            "[deleted]",
            "32 years old is too young for perimenopause. I hope you can make an appointment for her to see an endocrinologist and/or psychiatrist. Something sounds very off.",
            "Shes 13 and still dosent know that? What an idiot",
            "[deleted]",
            "Pppppp lease, St Nicola's did existed ",
            "Honestly, it sounds like you were being passive aggressive to begin with. No one posts a \"Santa isn't real\" at any time, anywhere. Your super long written post screams of \"let this be validation of my shitty misdeed\". What you should do is try to figure out a way of dealing with your sister, or simply avoiding her entirely. The damage is done. Get her and your niece something nice as a way of saying sorry.",
            "Apology not accepted stop the slurs",
            "Tell her to smoke a joint, or maybe an edible from your local dispensary. To much info happening with medical cannabis today to ignore it. Don't allow the typical 'pill' prescription to be the answer. Good luck to you!  ",
            "More troubling is the fact that a 13 year old still believes in Santa.. ",
            "So... facebook proves its uselessness yet again. And your sis is pissed that she can no longer lie about a creepy burglar that steals into her house in December to her children.\n\nStop here, I want off this world.",
            "[deleted]",
            "[deleted]"
        ]
    },
    {
        "post_id": "694z9h",
        "author": "Newrandomthrwaway",
        "title": "UPDATE: I [24F] need to tell a good friend [24F] that she smells",
        "url": "https://www.reddit.com/r/relationships/comments/694z9h/update_i_24f_need_to_tell_a_good_friend_24f_that/",
        "score": 3216,
        "num_comments": 63,
        "created_utc": 1493865459.0,
        "selftext": "[Original post](https://www.reddit.com/r/relationships/comments/4rmsqm/i_24f_need_to_tell_a_good_friend_24f_that_she/)\n\nIt's been a while since I asked for advice on telling my friend she had a strong body odor. It didn't get a lot of attention and it was a good result so I forgot about it. I believe I called her the night I posted and pretty much told her what I said I was going to tell her. I let her know that I really wanted her to get the job and then asked her if she knew she smelled (in a more tactful way - can't remember the exact words). She said she did know and the conversation went from there. She didn't give me the exact reason why and I didn't ask. I mentioned that since our work requires a uniform (I wear mine a few times before washing because it's an office job and I don't sweat), she should be washing hers often if she got the job. She was thankful that I brought it up with her. I followed up with talking about the job and giving her other advice about applying.\n\n\nShe actually did end up getting the job with me (yay!) and has become more hygienic. She's still not the cleanest but she doesn't smell like she used to and her car/room don't have the same heavy odor. To be honest, I forgot for a while that we even talked about this and almost forgot that this was even an issue before. I don't think she really remembers, either. It was a fairly easy conversation once I told her and it didn't change anything about our friendship. I wish I had told her sooner, but I'm glad I did tell her.\n\nKind of a boring update, but a good one. :)\n  \n  ---   \n  **tl;dr**: Told a friend a while ago that she smelled. She appreciated my honesty, we are still friends and she got the job!",
        "permalink": "/r/relationships/comments/694z9h/update_i_24f_need_to_tell_a_good_friend_24f_that/",
        "comments": [
            "Great update! She probably appreciated learning that after the initial embarrassment wore off, and now she's on to bigger and brighter things. Win win! And good on you for being such a caring friend :-)",
            "[removed]",
            "You're a good friend and you did the right thing.",
            "[deleted]",
            "This is the best possible result, and I'm really glad it worked out for her and for you",
            "You're a good friend LOL. That's my biggest fear, that I smell really bad or I have shit all across my face or body and everyone feels too embarrassed to say so. But I don't really need to worry about that, if my friends even notice one hair out of place, I'm gonna be made fun of for the rest of the week. Conversely, with them, if they have even a speck of dust on their face, I'm gonna make jokes about it and inform other friends even after the issue has cleared up. I love my friends. ",
            "Cool - an update that doesn't stink :)",
            "I actually remember this! I'm glad it turned out well. She's lucky to have a friend who can tactfully tell her the truth.",
            "I had a similar situation once. Not only did I recommend doing laundry more often and showering daily (in a tasteful way), I also got her a \"Just Because\" gift, some fancy body wash, delightful shampoo that makes your hair like silk, some body creams, and a nice perfume. I also had included some nail polish and a manicure/pedicure kit. I told her it'd be fun to have a spa day, pamper herself. She really liked it.",
            "I'm glad it went well! I've had similar issues that a good friend helped me with so I'm glad it went similarly! :) Sometimes you just get complacent and need a gentle kick I'm the butt to be more proactive and keep on top of it.",
            "Wonderful!!! Sometimes being honest is so difficult but beneficial for both you and your friend! :)",
            "She remembers, and she's grateful.\n\nSource: Have been tactfully told I (slightly) smelled by a good friend, changed hygiene habits, this was a decade ago.",
            "I'm glad you told her before she applied, and that she's sticking with it! \n\nMy mother has always had poor personal hygiene. She smokes, has dogs, doesn't do laundry hardly ever, and rarely cleans her house. She was working for a church in a small office and her boss had to pull her aside after a couple of months and inform her that her odor was offensive. They gave her some extra cash for dry cleaning and a $400 gift card to buy some fresh clothes, but she was beyond offended. She couldn't believe they told her that. She did freshen up her wardrobe and began cleaning her clothes more often and showering every day, but that only lasted for a few months. ",
            "\"Aye yo,\"\n\n\"Yo?\"\n\n\"Ye' stink\"",
            "Great update. You were a good friend.",
            "Thanks for letting us know. I love hearing updates on the older relationship quandaries. ",
            "Good on you. It's funny, I think guys have an easier time being brutally honest with their guy friends. Or at least that's been my experience. If I stank, my friends would be shitting on me for it within seconds.  Even the ones I don't know that well, and it goes both ways. ",
            "Happy it worked out! These situations are always a true test of friendship. \n\nI was in a similar situation with a girlfriend/fwb last year. When I brought up the situation, she got mad, left and broke up with me via text a few days later. Probably for the best...",
            "I have a friend that smells but she showers daily and a complete neat freak. It's mind boggling why she has this Body odor and she knows it as well. She uses deodorant and all that stuff, it's really messing with her head cuz here are times she won't go out because of it. ",
            "I can pretty much guarantee that she remembers. But hygiene is important and you're a good friend for not simply avoiding the uncomfortable topic.",
            "She didn't forget.....one does not forget when someone tells them they smell no matter how gentle you tried to be. Hopefully, she will keep up her new hygiene regime. ",
            "Good job, good friend:)",
            "Dang, you're a solid friend. Honesty is so hard to come by, which is such a shame because it's so important!\n\nThis is the best timeline.",
            "What was the cause of the odor?  What did she do to fix it? ",
            "Great update! Everything went better than expected :D",
            "This is such a good lesson. It says a lot about us as a society that many of us would rather avoid a person/let them fail than actually share hard truths. OP was tactful, kind and probably changed her friend's life in a very profound way. I  always approach people who are flying low or have something in their teeth but really struggle with pointing out more personal stuff like BO or snot. It sounds silly but I'm going to take this post forward and try to be more courageous with my honesty.",
            "My best work friend smells. Shes this kind of hippy all natural chick and she uses this homemade deodorant that just doesn't work, if not makes it worse.\n\nI kick myself for not telling her first. But a client from work complained to our manager about it and she was horribly embarrassed. I wish I would have been the one to tell her first. It caused her a lot of anxiety.\n\nShe even said she wished someone would have said something to her. Ugh.",
            "You're insinuating that she didn't clean herself before? Isn't that why she smelled?!",
            "Have you got her number?"
        ]
    },
    {
        "post_id": "3mw4aw",
        "author": "Possiblytrapped12",
        "title": "Update: I (28/m) found ovulation sticks and a pregnancy test in my girlfriend's (26/f) room. I do NOT want a baby and I thought she was taking her pill.",
        "url": "https://www.reddit.com/r/relationships/comments/3mw4aw/update_i_28m_found_ovulation_sticks_and_a/",
        "score": 3218,
        "num_comments": 193,
        "created_utc": 1443565715.0,
        "selftext": "Original Post: https://www.reddit.com/r/relationships/comments/3m53df/i_28m_found_ovulation_sticks_and_a_pregnancy_test/\n\nVery short update. I apologized repeatedly and profusely, and she stayed pissed. It took an edible arrangement bouquet, a dozen red roses, cupcakes, and a steak dinner at Ruth's Chris to make up for accusing her of trying to trap her into marriage/kids. Things are now finally back to normal after I groveled and she promised to keep me informed about possible mishaps in the future.\n\nTL;DR: The moral of the story: keep calm. Do your research. Talk to each other. NEVER TAKE ADVICE FROM PEOPLE THAT TELL YOU THEY'RE FROM THE RED PILL.",
        "permalink": "/r/relationships/comments/3mw4aw/update_i_28m_found_ovulation_sticks_and_a/",
        "comments": [
            "I'm 33, with kids and all of my friends have kids now too.\n\n\nEvery single of us has pregnancy tests because sometimes life gets stressful and the cycle gets late.\n\n\nThose tests help us drink safely. \n\n",
            "Ruth's Chris? DAMN. \n\nGlad you made it up to her. NOW, you know.",
            "You took advice from Red Pillers?  \n\n**Dude.**",
            "I'm glad things are working out for you. Good luck in the future.\n\nYour TDLR should be this subreddits motto.",
            "Wow, it's almost like all of the top comments of the last post were completely right. I'm glad things worked out for you, but I'm not sure I would be so okay with my boyfriend flat-out accusing me of trying to get pregnant (when frankly he has no reason to), red roses be damned. As I stated in your last post, \"wanting to know if\" does not equal \"wanting a specific outcome.\"",
            "Take advice from others? Dude. You were with her for 2 years and, when seeing some shady business, decided TO TAKE ADVICE FROM STRANGERS ON THE INTERNET instead of asking the woman you'd invested 2 years of your romantic love into. Don't blame anyone else for your own stupidity.",
            "[removed]",
            "why would you think red pillers could ever offer a single piece of useful relationship advice",
            "For fucks sake. When did people stop talking to their SOs?",
            "The thing is, your situation could have been avoided if you just listened to your gut. That's seriously the case with 90% of the questions on here. Your girlfriend had never EVER EVER done anything to make you think she wanted to get pregnant, aside from thinking freaking baby Timberlands are cute sometimes. You had TALKED ABOUT IT and were on the same, \"we don't want babies anytime soon\" page. \n\nI promise you, ladies who trap men into pregnancy give off real warning signs. Just like abusive partners give off real warning signs. Assholes very very very rarely emerge, suddenly & fully formed, when you are two years into a relationship. (And then, it's, like a brain tumor or sudden onset mental illness.) \n\nThe Internet and this sub specifically can scare the shit out of people, but it shouldn't... The one thing it shows us, again and again, is people are fucking predictable. Period. Next time, stop, think (\"what kind of person is my girlfriend?\"), and ask in a manner befitting your partner. As you now know. \n\nGlad everything worked out. You are so, so lucky she forgave you. ",
            "I used these things when I was on the pill too just make sure it was working properly. ",
            "Glad it worked out for you.",
            "If I were your girlfriend I would have dumped your ass for being so dumb.  I won't even go into the whole trust issue.  That was just idiotic.",
            "She should have dumped you.\n\n",
            "The moral of your story is actually pretty good advice for life in general.  ",
            "Haha, i love the last one.  Good job, OP. :)",
            "Dude their ribeye is THE BEST.",
            "Thanks for the update- it really made me laugh.",
            "FWIW, mortons wouldve been a better call\n\nruth's chris relies on marketing; mortons relies on their 21 day dry aging process",
            "hahahahahaha",
            "Update 3: she's pregnant ",
            "Man, people here are really being jerks.\n\nFor what it's worth, I wouldn't have dumped you. Ruth's Chris would have done it. But then again, I'm a guy.",
            "[deleted]",
            "Im glad you learned your lesson. Well both of your lessons.",
            "Yeah, I saw your original post but didn't comment because it was too late. \n\nIMHO, she has no right to be angry. Just like if a condom broke during sex, you don't hide it. You own up and say \"this is now a concern.\" and deal with the problem together. She has absolutely no right at all to hide birth control problems from you, because it will be both of your responsibilities as adults to deal with any consequences that crop up, not just hers. \n\nShe screwed up on her pills. She should of told you upfront. Sure, if you came across as overly abrasive and accusatory, maybe apologize for that behavior, but the greater fault is hers for trying to hide her screw up when it could lead to something you both obviously don't want. ",
            "Wow. Most people, when they want a sign that you're sorry, are fine with an honest and sincere \"I'm sorry\". She wants lavish gifts and money. \n\nNot only that, but she tried to make you feel bad for worrying about your reproductive choices. \n\nSounds like a sociopath. I'd leave her.\n",
            "Hopefully next update isn't GF got pregnant wat do?",
            "Let me guess. After all that making up you got her pregnant?",
            "[deleted]",
            "Well! She's making sure you know who has the power in your relationship and you're eating it up! Next time she wants to have her boots cleaned, she'll know she only needs to hold them up to your face.",
            "I'm a female and I have never thought about getting ovulation strips. I screwed up my BC before, took the morning after pill to be sure and moved on with it. Honestly the condoms were probably the easier, cheaper and more logical way to go- and they would have been an easy way to tell you. ",
            "[deleted]",
            "[deleted]"
        ]
    },
    {
        "post_id": "3iqkkc",
        "author": "throwawayhelpusdecid",
        "title": "My husband [29 M] gave me [29 F] an ultimatum to lose weight, but now he says I am too skinny. I packed my bags and left, but he keeps calling and asking for a second chance.",
        "url": "https://www.reddit.com/r/relationships/comments/3iqkkc/my_husband_29_m_gave_me_29_f_an_ultimatum_to_lose/",
        "score": 3216,
        "num_comments": 624,
        "created_utc": 1440776380.0,
        "selftext": "Hello Reddit! I'm normally a lurker and can't think of a better name for this account right now.\n\nI met my husband 6 years ago when we both had just graduated college. He was a lovely guy, handsome and very well put together. He loved muscle cars and weight lifting and I loved everything about him. I fell in love with him instantly and was over the moon when he asked me to marry him.\n\nA year into our marriage, I became pregnant with our son and gained about 30 lbs. I was 5'3\" 125 lbs before the baby and 155 lbs after the baby. I still fit into the same clothing sizes so I didn't think I had gained too much weight and that it would come off with breastfeeding and some more exercise. \n\nAfter the baby, my husband started pressuring me to lose the weight. He said that his friends were making comments about how fat I had gotten and that he was not as attracted to me as he was before I had the baby. He gave me an ultimatum that I either would have to lose the 30 lbs in six months or he would leave me. I was very upset about the demand, but I didn't want to lose him so I tried my hardest to lose the weight.\n\nEvery day for months I would wake up and go to hot yoga for 90 minutes. After I got home from work, I would run or do some bodyweight exercises. I tried to keep my calorie count below 1200 so that I would lose 2 or more lbs per week. The weight slowly but surely started to come off and I was back down to 130 lbs by the end of the six months. My husband was happy and things looked like they would be okay.\n\nAfter I lost the weight, I noticed a shift in the attitude of my husband's friends. Most of them are perfectly nice guys, but a few of them are absolute pieces of shit (the same ones who called me fat). Once I returned to my old weight, these friends started to make comments about me and how sexy I was. I told my husband to make them stop and he said that he would speak with them, but the rude comments never stopped. I channeled all of my frustrations into working out and I lost an additional 15 lbs of body fat and got more toned.\n\nThis past weekend, my husband's friends were over at the house and one of them grabbed me and tried to grope me. I told my husband and even though he was angry at his friend, he was still angry at me. My husband said that I was leading his friends on by losing so much weight and that I was trying to make myself skinny so that I could cheat on him. I was disgusted by this accusation and packed my bags and left for my mom's house.\n\nLast night, my husband called me and begged for me to come back home. He says that he knows that he was unfair and that he won't let his friend come over anymore, but I am so tired of dealing with this that I'm not sure I want him back. He's the one that told me to lose weight, but now he's blaming me for being too skinny and I'm afraid he's going to make me develop an eating disorder. But I also still love my husband and it hurts me to be apart from him.\n\nI'm so confused and I'm not sure what to do.\n\n   \n**tl;dr**: Had a baby and gained weight, husband told me to either lose the weight or leave. I lose the weight and then some and husband's friends started hitting on me. Husband blamed me for it and I left him. He called me yesterday asking for a second chance and I don't know if I should give him one.",
        "permalink": "/r/relationships/comments/3iqkkc/my_husband_29_m_gave_me_29_f_an_ultimatum_to_lose/",
        "comments": [
            "He blamed you for his friend's decision to grope you. \n\nHe accused you of trying to cheat. \n\nHe pressured you into losing weight to win the approval of his friends. \n\nI can't imagine why in the world you would go back to that. ",
            "[deleted]",
            "Your husbands love and respect fluctuates with your weight. Think about that. ",
            "Don't go back. Ever.\r\n\r\nYour husbands \"friends\" are pieces of shit. Also, your husband is also one for being so easily persuaded by them to basically *hate his own wife*. \r\n\r\nAnd once you were \"good looking\" again, they came back. And showed no respect at all to you. \r\n\r\n> Leading his friends on by losing so much weight.\r\n\r\n**ARE. YOU. FUCKING. KIDDING. ME**\r\n\r\nHe loved you when you were \"normal weight\". He blackmailed you into losing weight when his friends didn't find you attractive anymore. And then he had the audacity to make you believe his pieces of shit friends are like that because of you.\r\n\r\nHell. Fucking. No. You deserve better. And you need to be aware that he will *never* stop getting influenced by his friends. **Their opinion will always be more important to him than you.**",
            "This is the most pathetic and immature response to fatherhood I've seen in a long time.  Congratulations on kicking this asshole to the curb.  I see a bright future ahead of you. ",
            "Tell him you think you'd like to lose a little more weight, then ask him his current weight. Then say \"That should do.\"\n\nSeriously, what a complete POS. ",
            "[deleted]",
            "Let's be clear here: one of your husband's friends **sexually assaulted** you, and your husband blamed you. \n\nIf you really, truly don't want to leave this guy, I would, *at least*, make him ditch the toxic friends as a condition of your return.",
            "Don't go back, your husband is a monster. He failed every opportunity to support you. I can't even believe some of the things he's said to you.\n\nDamn, woman, it sounds like you could do so much better. Take the baby and RUN!\n\nP.S. Where is that baby? You have him?",
            "You led his friends on by losing weight? That's actually what he thinks? That by doing as he demanded, and losing weight, you were inviting men to sexually assault you? \n\nWow. He's a total asshole. ",
            "> My husband said that I was leading his friends on by losing so much weight and that I was trying to make myself skinny so that I could cheat on him.\n\nThis is not someone that you want to be in a relationship with, and it's not an attitude you want being taught to your son any more than you're legally required to make him visit this man.",
            "There are too many people in your marriage. Your husband is weak willed and indecisive, his insecurities are making him dependent on his friends approval *over you*, and they are treating you like communal property. There is so much not-OK, boundary crossing, control-freak shit happening here even before the guy groped you. Like expressing their opinions on your post-pregnancy body to your husband. Like blackmailing you into weightless, and then freaking out when you did it too well. It's not good enough that your husband has promised to not have the **guy who groped you back in your house** - he needs to cut that guy from his life. Period. Along with any other bag of dicks who went along with this shit. By not removing these people from his life, he is placing his friend's approval over your well being. \n\nThat needs to be the baseline before you can even decide IF this marriage worth saving. Other posters have mentioned that his love and respect are tied to your weight. He wants you thin, but not too thin, least anyone else notice how shiny his toy is, and is willing to be emotionally abusive to achieve what he wants. What other areas of your lives does he have control over? These are huge, communist party parade sized red flags here. \n\nTL;DR: Red flags abound. Until you and your marriage matter more to your husband than what his friends think of you and your marriage, it's doomed. \n",
            "My heart hurts for you. Really. At this point you've been slandered by his friends for being fat; gone on a Beyoncé level post-pregnancy weight loss regimen; been sexually assaulted by your husband's friend; been blamed for it. All this with the tacit and even *explicit* approval of the man who promised to love, cherish and protect you for better or for worse.\n\nI'm sorry, but he treats you like an object, often like a malfunctioning object. This is not okay. This is not how you want your son to grow up, I'm sure. \n\nYou did the right thing. Don't go back.",
            "Your husband sounds like a prick.\n\nI am one that totally encourages people to discuss when they are losing attraction due to physical things, but he sure went about it in a prickish way.\n\nHe's emotional,y abusing you.\n\nYou're better off without him.",
            "Your next response should be divorce papers. I wouldn't give the time of day to someone who's love for me is directly proportional to my weight.",
            "Everyone gets less attractive as they age. With exercise and effort one can hold it off, but eventually we all grow old.\n\nDo you really want someone so shallow that in 20-30 years they're almost guaranteed to leave/cheat?",
            "What would have happened if you needed an emergency c section because the baby suddenly came in sideways? You'd be laid up and unable to exercise for MONTHS. Could he deal with having to help you get into and out of bed and onto and off of a toilet for several weeks?\n\n\nSo, at 155 lbs you did 90 minutes of hot yoga and ran AND ate less than 1200 cal AND lost 2 lbs a week.\n\nThat right there is the cusp of disordered behavior.  I can't imagine how exhausted you were /are. Now, I know 1200 is plenty, especially at 5'3\" but 1200 and exercising 2 hours daily? That's just hard to imagine, especially with a new baby.  What meaningful things in your life have been completely replaced by diet and exercise?  Don't get me wrong. Body building is a great hobby, but it's notorious for eating disorders and body dismorphia.\n\nYou hadn't gained much weight, and the baby weight normally can take a year to come off.. because your life priorities and sleep are really out of whack, and slow and steady weight loss is the key.\n\nYour husband sounds like he's incapable of empathy.",
            "You tell your husband that his love of you shouldn't have ANYTHING to do with what his friends do or do not think you are.  Also, he shouldn't be friends with guys who are commenting about his wife's weight or saying how sexy she is, period.  Tell him if he wants a second chance - he needs some therapy to develop his own opinions, and he needs to rethink the people he's friends with.",
            "So your husband's friends call you \"fat\", and instead of shutting them down and telling them to cut that shit out, he relays the message and pressures you to lose weight.\n\nThen when you lose the weight, they start with the rude comments about how sexy you are, instead of shutting them down and telling them to cut that shit out, he does nothing.\n\nThen when one of them gropes you, instead of telling this guy to get the fuck out of your house and never talk to him again, he blames it on you.\n\nYour husband is the person that should have your back.  He does not.  He prioritizes his friends over you.\n\nI would not blame you for not going back.",
            "It sounds like he has no fucking idea what he wants. That includes you.\n\nLeave him, OP. You sound like a hell of a woman - it takes a lot of heart to lose weight like that for your husband. You deserve a guy that knows he wants you and treats you with respect.",
            "It's one thing for a spouse to encourage another to lose weight. That's okay. \n\nIt's another thing for a spouse to say, \"lose the weight or I'm leaving you.\" In most situations (except for morbid obesity where all else has failed) that's *not okay*. \n\nIt's another thing for a spouse to say, \"It's your fault that my friend groped you. You were leading him on.\" That's *never okay* unless you actually were intentionally, overtly, and unambiguously encouraging the friend. \n\nIt's another thing for a spouse to forget that he demanded that you lose weight, then accuse you of doing it to be able to cheat on him. \n\nIt seems from your story that he doesn't trust you (he thinks you want to cheat on him), he doesn't value you as a person (he threatened to leave you if you did not lose 30 pounds in 6 months, going from somewhat overweight to a reasonably light build), and he continues to associate with people who do not treat you with respect. \n \nYour husband does not sound like a nice man to me. He does not sound like someone who values you as an equal partner in his marriage. \n\nIf I were you, I would think long and hard about whether to give him a second chance. If he's generally a nice man outside of this, I would painstaking explain to him how demeaning it was for him to use him leaving as an ultimatum. Explain how you felt for six months the way that he's felt since last weekend. He can't do that. I would also say that you don't want him to spend time with the friends who acted that way anymore. Not, \"I won't bring them around the house.\" If they're harassing you and talking about your weight with him, they're awful people and awful influences. He needs to distance himself from them to be the kind of person that can have a mature relationship.",
            "\"My husband started pressuring me to lose the weight.\" \n\n\"He gave me an ultimatum\".\n\n\n\"A few of (his friends) are absolute pieces of shit (the same ones who called me fat).\" \n\n\"the rude comments never stopped.\" \n\n\"one of them grabbed me and tried to grope me.\"\n\n\" he was still angry at me. My husband said that I was leading his friends on by losing so much weight\", \n\n\"that I was trying to make myself skinny so that I could cheat on him.\"\n\n\"Last night, my husband called me and begged for me to come back home.\" . \n\n\"I'm afraid he's going to make me develop an eating disorder.\" \n\n\"I'm afraid.........\"  \n\n\"I'm so confused.\"\n\nI doubt you are in serious physical danger, yet, but you are already involved in a classic cycle of abuse.  Everybody has growing up to do, and everybody has a lot to sort out emotionally around the birth of a child, etc., but your husband is controlling, immature, demanding, posessive, image focused, FAILED to defend you properly in a pretty bad situation (you getting groped means you are the victim of a crime; sexual battery, I think), shows little regard for you but seems focused on your body and image, and doesn't take what you say or want seriously.\n\nIF you go back, he needs to attend some counselling, with and without you, from at LEAST a qualified marriage and family therapist, and I'm not sure a psychiatrist wouldn't be better (to establish if he has an actual disorder).\n",
            "I think you should send him this link and let him read it, let him realize what a douche he is, and then fucking leave him.\n\nHe clearly cares more about what his friends think more so than anything else. Sounds like a disgusting pig. ",
            "An example of \"leading someone on\" would be making flirtatious remarks or sending risqué pictures. \n\nMaking an effort to improve your health and appearance is *not* \"leading someone on.\" ",
            "Three times, your husband has put his friends above you:\n\n* After you gave birth to his child, your husband issued an ultimatum because his friends thought you were too fat.\n\n* You lost the weight, and his friends started harassing you. You asked him to stop them, and he didn't.\n\n* Your husband's friend assaults you, and your husband blames you. \n\nYour husband is spineless. I don't think you are even on the same list of priorities as his friends. He likes his status symbols like his muscle cars and his weight lifting because it makes him look impressive to his friends, and you are only important to him if you fulfill the same role. \n\nLeave him. If he goes to counseling and changes his behaviour, then maybe you can have an amicable coparenting arrangement together. But you deserve so much better than him as a partner.",
            "No do not give this man a second chance, he is too influenced by his friends and too invested in ultimatums, if it is not the weight it will be something else.",
            "Your husbands friend are shallow pieces of shit. Your husband is friends with them because he, too, is a shallow piece of shit. This will *never* be a healthy relationship, and you're better off without him. Cut your losses and run like hell.",
            "Wh..what?? He blamed *you* after his immature, no respect for women, poor excuse for a man, friend molested you? \n\nThey say you can tell a lot about a man by his friends. In this case, your husband proved all by himself what a piece of shit he is. Drop the extra weight, him, and count your blessings.",
            "He gave you an ultimatum to do X or he would leave you.  You did X.  He then accused you of doing X to cheat on him.\n\n??? He's a joke.  Good riddance.  Find a real man.",
            "I would have left him on the spot when he said lose weight or I'm leaving you. That's not a guy who actually loves you.\n\nEspecially when he told you his friends are saying rude things about you. What is he - 9 years old? What a rude and immature thing to say. As a husband he should have told them off, not told YOU to change.\n\nIt's one thing if you gained 100 pounds and just sat around all day eating bon bons, but you only gained 30 pounds and it was because you had a baby.\n\nNow he's being a total psycho about you losing weight. This is not the type of guy who should be married to anybody.\n\nThe only dead weight you really NEED to lose is your husband.\n\nHis friend sexually assulted you. He should be going to the police and ditching this guy, not blaming you.\n",
            "I don't know how to put this delicately.\n\nYour husband is an asshole.  You made the right decision to leave, don't change your mind.",
            "One of my best friends has gone through a similar situation, and I'd bet good money that he's cheating on you. I think he gave you the ultimatum in the first place thinking that you wouldn't be able to do it (side note: fucking awesome that you did, good for you!) and then it would ease his conscience when he left you. For somebody to jump to the conclusion that their SO is cheating because they've lost weight - an action that was instigated by him in the first place - is a giant red flag. It seems like he's just looking for a reason. Plus, as someone else mentioned, what do you think he's doing when he's out alone with these \"friends\" in order to impress them? He's a piece of shit and you should definitely not go back. ",
            "In case no one has said it yet, file a police report against the 'friend', & get a lawyer asap. You need to start documenting via official records this guy has shitty decision making skills.  No doubt his friends will back your husband up in court in any sort of divorce proceedings or custody dispute.  I would expect him to be a dick during that as well.  Follow your attorney's advice. Reread this thread if you need strength.  Protect yourself,  and your son. ",
            "Your husband is an abusive douche. \n\nIs this the role model that you want for your child - a guy who's friends with someone who sexually assaults you,  and then blames you for it? Is this the guy you want to spend the rest of your life with?",
            "Your husband is a jack-ass.  You're his wife and he needs to protect you, ESPECIALLY from his friends.  By the by, if one of my friends put his hands on my wife he'd get his ass kicked and then he'd get frog-marched out of my life.  He needs to understand that you're a victim, not the aggressor and he needs some sort of counseling or perspective.  Good for you",
            "Your husband, much like yourself, is grasping at straws to try to stay in the relationship. He may talk a big game now but he is 29 years old and he has shown you exactly who he is through his actions, words, threats and the friends he keeps. Believe him and find a man that loves you, not the ego stroke you provide him. ",
            "\"Show me your friends and I'll tell you who you are.\"\n\nThe fact that he not only associates but bases choices about his life and relationship around the opinions of these people says a lot about your husband....none of it good.",
            "fly you fool",
            "Shallow, victim-blaming and just plain stupid: What a catch!   \n\nI say: Stay gone! No more chances. ",
            "I know a way that you can drop a ton of weight real quick, kick that piece of shit to the curb",
            "Omg what.  He body shames you after having a child with him then blames you for his asshole friends behavior for losing the weight? ??  I'm so angry just reading that.  This guy is a piece of shit I'm sorry but you're better off without him. ",
            "I don't know if I want to make the distinction that sexually assaulting your friend's wife is even worse than sexually assaulting a person in general, but your husband's friends are disgusting and your husband's reaction is really concerning.",
            "Are you kidding me?!? \n\nStrike 1) Ultimatum to lose weight RIGHT AFTER having HIS Baby.\n\n\nStrike 2) Did nothing while his friends made lewd comments about your body\n\n\nStrike 3) Blame you for getting sexually assaulted by his friend.\n\n\nOMG girl nope the fuck out of there! He respects his friends more than he respects you. You are clearly just a hot piece of ass to him and nothing more. Fuck that. ",
            "What is going to happen when you get old and have wrinkles? Is he going to make you change that as well? He only cares about what you look and not about the person you really are. Can't beleive you're still married to such a shallow person!",
            "I mean, I wouldn't. Anyone who blames you for the negative actions of someone else needs a reality check. That, and I imagine its a pretty big double standard.",
            "What the hell did I just read?!",
            "Don't go back. Your husband blamed you when you were sexually harassed/assaulted. There's no redemption for something like that. ",
            "Marriage counseling. Stay at your mom's house. Do NOT go back unless you are satisfied with the developments in marriage counseling after at least a couple months.\n\nThere are several red flags in your marriage. Marriage counseling will make them apparent, and should help make it clear whether they are fixable or not.....and worth the effort.",
            "So, your husband gave you an ultimatum because of the opinion of friend?! It seems he cares more about some asshole's opinion than your relationship. \n\nThe groping part of your story is just disgusting.  He cares waaay too much about this friend. I'm not sure he isn't in love with him. You're the one he should be sticking by no matter what...\n\nRun. You've dodged a bullet! ",
            "He's already cheated/cheating ",
            "Your husband and his friends are disgusting. No good man would let his friends talk about his wife that way, and no good man would talk to his wife the way he talks to you. ",
            "He was upset with you for gaining a very reasonable amount of weight after a pregnancy. He wasn't attracted to you and he told you to lose weight or he was leaving. You lost the weight. A friend groped you and he got mad at you and accused you of leading them on.  \n\nI would bet $500 right now that sometime between you gaining weight and his ultimatum, this man cheated on you (and blamed you for it).",
            "Your husband is literally a monster. Divorce that asshole.",
            "Your husband has a weird relationship with his friends.  Everything about your relationship has to do with what his friends think, not what you think.",
            "Divorcing seems like the right move. Your husband and his friends are jackasses. He blamed you because his friend groped you? WTF? When his friends called you fat his response was to tell you to lose weight instead of knocking them upside the head and telling them you just had a baby? He let his friends make rude comments about you *all the time* and never thought \"hey, my friends are total jerks and I should drop them? He *still* doesn't want to drop his friends but just wants to not let them come over, even though they contributed to the destruction of his marriage? NOPE.",
            "What a shallow man you have landed. He runs with shallow friends. Good luck. ",
            "There are so many good men out there, you don't need to waste your short life with this asshole. Please don't ever go back to him, no matter how much he claims he'll change ",
            "I hate reading shit like this because you sound like such a catch before or after you started working out, and your husband takes you for granted.  What I would do to be with someone like you.  I'm not going to tell you to stay or go but whichever you decide, just don't lose sight of how you deserve to be treated and don't put up with anything less.",
            "The fact that he decided to issue an ultimatum in the first place should have been such a red flag that a bull would storm out of nowhere to trample him and gore him roundly.",
            "Holy shit there are so many red flags here.\nIf you want to be happy I would suggest not going back to this man, ever. No one should EVER make you think that their love is dependent on your body weight. The fact that he let his friends make you feel uncomfortable and harass you and then have the audacity to put the blame on you is fucking wild.\nAs someone who suffered from an eating disorder for ten years, this is the sort of thing that causes a warped body image and it's a slippery slope.",
            "He's been cheating on you.  I guarantee it.  ",
            "Let's put this in the most basic of terms: you were sexually assaulted and your husband blamed you (the victim). No, I don't think you should give someone like that a second chance.",
            " If you take him back, you'll basically be telling him that it's ok to continue with his actions. He also didn't stick up for his wife. He chose his friends over you. I wonder what would have happened had you not got away from his friends. I have a feeling that your husband would have allowed them to continue hurting you. Just sayin'.",
            "Speaking as a guy:\n\nLOL, no, don't give him a second chance. He gave you an *ultimatum* over baby weight? Lost his shit *at you* when *his friend* hit on you? Lady, you hit the scumbag lottery. No need to ante up again. Keep it civil for the kid's sake, but for everyone's sake (especially the kid) stay the hell away from that guy. ",
            "He sounds extremely immature & self centered.  Unless he is willing to go into intensive couples therapy, you should seriously evaluate this situation.  You have a child together, so it is more complicated.  I will pray for you.",
            "Your husband is a dick. He throws it in your face that you've gained weight, and then blames you for his douchebag friend putting his hands on you?\n\nNo honey, no. You can do much better with someone else.",
            "So you know he's cheating on you right?  He's projecting that onto you. ",
            "Might be too late but heres my opinion (m37). When i got married i made my wife my first priority. No one, not even my parents came before her. I was the same for her. \n\nA (former) friend of mine complimented me on marrying a woman with big tits. I told him to get the fuck out of my house right then and there. Cut him ofd completely. I have and always will put my wife and children first. To hell with anyone else. If your husband does not tell his friends to fuck off especially after the way they've treated you, then I am sorry to say, he's a little bitch. \n\nYou deserve better. ",
            "[deleted]",
            "OP, your husband is basing his love off of your weight. God forbid, you go through another body change. Then what? \n\nAlso the fact that instead of defending you when his best friend groped you, he said that he was leading his friends on is so, so wrong. You can definitely do better. He's a POS and you deserve better. ",
            "what a fucking jerk. this is some abusive shit. who the fuck tolerates another man HITTING on your woman, much less GROPING them. In my circle that dude would get laid out, party's over, everyone get the fuck out of my house, i dont want to see that dude ever again in my life or else im going to prison. You dont hide behind your own fucking insecurity and then project that shit onto your wife, accusing her of cheating? What a shame. ",
            "Fucker got what he threatened you with. Serves him right. Props to you for having the guts to move on with your life. In two years when you're with a much better man enjoying a real relationship and he's still crying about how he let the good one get away just remember to laugh and thank him for showing you the way out the door to a better life. ",
            "Your husband is a fucking douchebag.  No sugar coating.  And  a materialistic moron.  Thats it. ",
            "Your husband is PATHETIC.\n\nIf any of my friends said anything like that, that shit would be over before it started.\n\nIf any of my friends groped my girlfriend they would be spitting out teeth, there would never be any blame on her.\n\nYour husband sounds like a real piece of shit in general, I really don't think you're going to end up being happy with him.\n\nIf you go back, sure you might be happy for a while, but he is going to be shitty again and it is a 100% guarantee.",
            "This pisses me off. \n\nYou and your husband have a son. You and this guy are husband and wife, not boyfriend and girlfriend. Do you think any of this behavior is appropriate to either of those? To the role of husband and father? \n\nI might break up with a girlfriend if she seriously let herself go. You had a child. I would never *divorce my wife* because she had some weight issues, let alone weight issues that have a very good reason. I would tell her I wasn't attracted to her, and that it was bad for the marriage, but your marriage shouldn't be contingent on how attractive you are. It is. Seriously who the fuck cares if you are good looking, too? This isn't all about you two. You have a child. Are you a good mother? Are you a good partner? \n\nIf my *girlfriend* was groped by my friend, he wouldn't be my friend anymore; your *husband* and the *father of your child* has a friend who did that and that friend *can't come over anymore.* \n\nIf my friends gave me trouble about how my *girlfriend* was fat that trouble wouldn't last long: your *husband* started to ride your ass about losing weight, and furthermore, was ungrateful and later hostile because of it, because his friend needed to be impressed, and then were impressed. Why don't you influence his feelings and his opinion as much as his friends? You're supposed to be a step up, right? And is he a fucking man? Can he not make his own decisions about you? And if he is, he decided what he did. \n\nI would assume, unless I had a very good reason in the past not to, that my *girlfriend* was being honest with me: your *husband* assumes you lying about your motives and leading somebody on. \n\nNow I'm not going to pretend that I know you divorcing him is the right thing, but you need marriage counseling or a divorce. This is not acceptable behavior, especially not when you have another life to be responsible for. There's no time or energy for this bullshit. Think about your son. ",
            "Your husband is abusive. This is the first step to destroying your self esteem so that when he cheats, stays out late, ignores his kid, he can blame it on you for being too skinny, too fat,  getting too much attention. Get a lawyer ASAP for divorce and custody. I wouldn't be surprised of he used your child as another way to control you or stay in your life.(Do what I want or you don't get child support...)",
            "If you're ever tempted to go back, just remember... One day you're going to get old. And if you're husband is that fixated on your appearance, he probably won't like that. And there's not a whole ton you can do about that. So he'll just wind up making you feel bad about yourself, and then still leave you for a younger hotter woman (assuming he can get one with his shitty attitude). You deserve someone who sees and values your inner beauty and wants you to be healthy and happy above all else. I'm glad you had the courage to leave!!",
            "...to begin with, he threatened to leave if you didn't lose weight after having a kid. Someone like that is an animal in heat first, and a parent and husband last of all in their priorities. Holy fuck.\n\nAnd then past that once you did lose weight he got angry at you in return with no proper reason. Also his some of his friends are asswipes and yet he values them over you, or is too weak to choose his friends wisely.\n\n...yeah I don't see how returning to him can end well. I hope your son is fine, I don't think he should be raised by his dad in this context. Good luck with your life from now on, I'm sure there will be someone better and more reliable you come across someday.",
            "Fuck him. Fuck this. Fuck that. You don't need that shit in your life. I wish you luck with your future with your son and hope you stick to your guns leaving that douchebag and his friends out of your life.",
            "You should have left as soon as he gave you the ultimatum",
            "This is mental abuse. My horribly abusive ex used to blame me for other guys' flirtations toward me, would suggest I only wear makeup if he was around, and accuse me of trying to get attention from men if I dressed up even slightly provocatively. He was also a body builder and put me on a meal plan and gym routine until I mentioned I may compete and all of a sudden he would put me down and say I wasn't good enough. All of it was a method of control, and he said it in a nice way so I didn't recognize it as abuse at the time. \n\nIt sounds like a similar thing is happening here: he wants you to be just hot enough for him to be attracted to and feel proud of, but not too hot because he doesn't want you getting attention or having too much confidence. He does not have your best interest in mind if he is treating you this way- run. You won't regret leaving someone who makes you feel like that.",
            "Think about this: Your weight was more important to him than being in the life of his newborn. You weren't the only one he was threatening to leave. Not exactly a keeper",
            "Fuck that guy. May he rot in hell. I'm sorry you decided to procreate with him, hopefully you're child will be a much better person.",
            "Fuck that guy. You're much better off without that piece of shit.",
            "It's not going to get better he's controlling and he wants to control you. Make him change for you and the first time he breaks that promise file for divorce.",
            "You lose weight because \"you\" want to lose it.  Your were sexually assaulted by his friend and he blamed you.  I would not get over that, he is setting a bad example for your child.  Do you want your child to witness his vile friends assaulting you?  Then saying it is your fault?  Worse your only as attractive as his friends think? ",
            ">He loved muscle cars and weight lifting and I loved everything about him.\n\nI don't want this to sound like I'm generalising, but if these \"attributes\" amongst the constellation of things that makes up a person's personality, are what you chose to describe your husband from that time, and worse still are the kinds of things that made you fall in love with him, then colour me extremely skeptical that this was the first instance of gross sexist and generally disrespectful attitudes towards you.\n\n\n>Most of them are perfectly nice guys, but a few of them are absolute pieces of shit (the same ones who called me fat). \n\nNewsflash: your husband is every bit as PoS as the test of them. Which is why a) he's friends with them in the first place, and b) didn't defend you and ditched them when they said those things.\n\nI'm sorry there's a child in the middle of this, but I don't know how it could possibly ever work out. You mentioned being on the verge of an eating disorder: I suggest you don't ignore it, and find yourself a good exploratory psychotherapist to help you through this, bit also to help you understand why you were so drawn to this kind of person in the first place. The only thing worse than going through an abusive relationship is going through several without ever understanding why these patterns keep repeating.",
            "LEAVE HIM! For good. Jeez. I'm sorry that you're going through this but your worth is not dependent on your appearance, I promise. What about 30 years from now when you've aged and aren't necessarily \"sexy\" any more? I know that attraction is an important part of a relationship but if he really loves you, he'll love you regardless of some fluctuating weight, especially since that weight was necessary to create and bring a child into the world.",
            "I mean, you obviously know what you need to do right? I’m shocked that the straw that broke the camel’s back wasn’t the god damn ultimatum. What the fuck kind of decent husband tells the woman who gave birth to his child that he will leave her if she doesn’t lose the weight she put as a result gestating his own child? He should be kissing your fucking feet that you put your body through hell giving him this kid (your choice too blahblahblah but women do get the short end of the pregnancy stick), and if gaining some baby weight got you there, he should thank his lucky fucking stars.\n\nListen, I’ve been relatively thin my whole life, a little less than your original weight, but I’ve gained as much as 20-30lbs before and while I’ve been insecure during my chubbier times, not one damn guy I happened to be with at those times ever, ever, ever put me down about my weight or even mentioned it unless I did first and I would never ever expect them to. And if they did, they would so be long gone because there are so, so, so many other guys out there who are either sensitive to that kind of stuff or just don’t plain give a shit that their partner gained a few, ESPECIALLY after having a baby.  \n",
            "To be blunt, your husband is a fucking douchebag. He should have married you, not your dress size. You had a BABY. It isn't healthy to force all that weight off right away, especially if you're breastfeeding, then you do the amazing feat of losing that weight and he blames his asshole friends' inability to keep their hands to themselves on you? Fuck him. You made the right call. You're a person, not a trophy.",
            "Threatening to leave you after you put on baby weight. Blaming you for his horrible friends. Not defending you. Screw this guy. You don't want your child to be raised in that environment. I hope he's a better father than husband at least.",
            "I just want to say it's amusing to me that you were too fat, then back to \"normal\" and then basically \"too hot.\"  Your husband didn't like you at 115 because you looked too good for him.  You probably are.",
            "How is this even a question? Your husband is clearly a piece of shit for not only treating you like that but for having friends that treat you like that. And LETTING them. and quite frankly I cant even imagine the type of person YOU must be to even consider going back to him. like seriously, how is this a question? Do you REALLY need our help on this one? If you have any self respect just get the fuck rid of him. But ive met too many messed up people to have faith in that. If what you said is true and you honestly cant decide then good luck on this one.... Youre in for a shitty abusive life and youll have no one but yourself to blame.\n\nEDIT it sounds like youre making the clear decision. For now. Perhaps my faith in humanity isnt totally broken. As another said, bright futures await you.",
            "Seriously?  Six months to lose weight after you spent 9 months growing his child?  Tell him to go fuck himself and keep living apart.  What a loser piece of shit.  Note that I currently weigh less than 115 pounds.  ",
            "FUCK THAT GUY ",
            "You're husband sounds like a loser. ",
            "Your husband and the people he hangs out with sound like massive fucking neanderthals. Absolutely disgusting. Do not give him a second chance. Live it up with your toned new figure and tell this bastard to fuck off.",
            "Hell naw.  If he can't love you for you, he ain't worthy of you.  Tell him that he and his friends can get to stepping.  Then hire yourself a damn good divorce attorney.\n\n&nbsp;\n\nEDIT: He also should have stuck up for you against his douche of a friend.  The fact he didn't shows you the content of his character.",
            "What an asshole.  First with the ultimatums, then being mad at you and not just his friend for groping you.  He should have kicked his friend out, banned him from the house and done special things to appologize for you.  How can anyone be upset with their wife for getting her body into great shape. \n\nHe doesn't deserve you!!",
            "I can tell you what to do. Have you read the comments? We are all telling you to get the fuck out of that relationship and find a man who respects and love you no matter what.\n\nYou would be a fool to stay in that relationship with a child. I can't imagine how he'd treat your child if they got fat.",
            "Besides all the other good advice you've received here I'd consider filing a police report against his groping friend. What you described is a crime. ",
            "He's playing mind games. Don't go go for it.",
            "For the love of god tell this dude to go fuck himself. Seriously wtf is wrong with him?",
            "The guy is almost 30 years old and is still acting like an asshole and hanging out with asshole friends.  He is not going to change who he is at this point.  If he was in his early 20's I might say he could change who he is but at this point he is pretty much going to be this jerk the rest of his life.",
            "I can't believe he gave you an ultimatum about losing the weight right after you had a baby. He's an inconsiderate arsehole. ",
            "He is an asshole & has assholes for friends. You & your kid are better off without him. ",
            "He sounds abusive. You don't need that shit. ",
            "Let me start by saying that his actions are deplorable and his friends are disrespectful.  He should not be friends with the ones who are a-holes. \n\nBut if I may pose a question: do you think his shift in behavior has anything to do with fatherhood or the baby?  It doesn't sound like this was a problem before the child.  He may not understand the feelings and emotions he's going through.\n\nIt may be helpful to attend counseling together.  Or even suggest that he sees someone.\n\nI hope everything turns out well for you.",
            "Damn I couldn't imagine my friends making remarks about my fiancée like that. That's so shitty. Love doesn't fluctuate with weight. ",
            "Really sorry you're going through this :( ",
            "Oh boy he is not a nice person at all. Every one gains weight during pregnancy, I gained 30lbs too just like you. Two months after the baby I wanted to start working out but my husband actually stopped me because I had a c section and you shouldn't work out for 3 months. My baby is now 5.5 months old and I started the weight loss program a couple weeks ago. He encourages me now to work out but has never demanded that either I lose it or he leaves. \n\n\nI am telling you this to give you a bit of perspective on how a good person treats his wife especially after she has been through pregnancy. He has not treated you well at all. Don't go back to him because you are right you might develop an eating disorder and will have self esteem issues. ",
            "Fuck that! That guy sounds like a stereotype that someone would find themselves with before leaving and finding someone MUCH better. What a joke!",
            "Fat or skinny, you touch my wife, I break your face!",
            "OK so it starts with weight loss and gain. But then in a few years, what about aging? Would he expect you to not have wrinkles and always be up to *his* standards? \n\n\nOn top of that, he couldn't even stand up for you! You're his WIFE! Yet it seems his friends and their opinions are more important to him than you and your well-being. \n\n\nYou deserve respect and love, not the kind of bullshit he put your through. You're way better off without him.",
            ">My husband said that I was leading his friends on by losing so much weight and that I was trying to make myself skinny so that I could cheat on him.\n\n\nWhat the... was he on drugs?\n\n Are you sure we're talking about a human being here?\n\nI don't even..\n\nEDIT: coming back to it, you mentioned he's some sort of a body builder. Is he taking some weird supplements that could have been driving him nuts? It's just that the scene you mentioned is so far away from human decency that I don't even know how that could happen with a lucid person..",
            "Don't go back.\n\n\nWhat's going to happen when you age? What will happen if you put on a little weight again? Will you sit there and take his blatant disrespect? Will you watch as he treats you like shit and let's his friends do the same? Will you let your child grow up thinking this is ok and healthy? He cares more about his friends and their shitty opinions than he cares about you. Just let that sink in.",
            "All I gotta say is...your husband is such a fucking asshole.  Don't worry about losing weight anymore, just lose him.",
            "Remember you're worth so much more than that. ",
            "I think a lot of other people addressed this train wreck but I wanted to contribute to this point: \n\n\"Last night, my husband called me and begged for me to come back home. He says that he knows that he was unfair and that he won't let his friend come over anymore\"\n\nNope. The appropriate response would have been \"I'm never talking to that piece of shit ever again.\"\n\nYou are more than the flesh on your bones, and he has completely failed to realize that. \n",
            "Stay far, far away! \nAnd if his friends ever treat you inappropriately again, YOU says something to them. Don't wait for someone else to do it. ",
            "your husband fucking sucks",
            "Your husband and his friends are all fucking assholes, period. \n\nSexual assault, nasty comments, emotional blackmail, victim shaming, and accusations of cheating... you've been through many things a spouse (or any person, for that matter) should have to endure. \n\nPlease think about if you're willing to put up with this, you do not deserve this.",
            "It sounds like you married a douchebag-meathead and are now experiencing how a db-mh treats his woman once he thinks he has her locked down for good.  \n\nDo you really want to raise a kid with this guy?  If you have a daughter, I guarantee you that she will develop an eating disorder because of this attitude toward women and their bodies that your husband has.  \n\nI couldn't forgive the fact that he blamed me for being assaulted,  but you're the master of your own destiny.  I would highly recommend counseling if you do try to work this out,  in any case.  ",
            "this guy has serious issues. SERIOUS issues.",
            "He sounds like a real piece of shit. I'd judge you for marrying him, but I am just as bad about marrying a piece of shit.",
            "It may be hard to see that you deserve better for yourself, but think of it from the viewpoint of your child. Your CHILD deserves better. If he is weight obsessed about you, there's a good chance he'll be like this with your child. Puberty is not an ideal phase for one's appearance - do you want your child to hear about their physical 'defects'. Do you want your child to grow up thinking that they have to look a specific way to please their father?\n\nHow was he during the pregnancy, the delivery, and the newborn phase? How soon did he start pressuring you about your weight? How is he with your child? How a person behaves while under serious stress can tell you a lot about who they are.",
            "Listen, you and only you know your husband and all the intricacies of your marriage. Sure, random people's opinion may give you some clarity, but in the end you just need to think about what's right for you and only you. Trust your gut. ",
            "he's a grade A tool with a whole bunch of other tool-friends in their toolbox",
            "I mean only you can decide if he's worth going back to but I knew he was a dick after the comment about him loving muscle cars.",
            "Wow, what a jerk!!  It sounds like nothing you do for him will ever be good enough.  Good on you for getting fit and healthy though!!  ",
            "ew\nfind someone less shallow",
            "Keep the baby, leave the crazy insecure husband.  He's a bag of dicks and you deserve better.  He's a lacky that falls into his friend's bullshit and that will never change.",
            "OP I read this sub every day and this is some of the most infuriating behavior I've ever read here. I mean this is fucking outrageous. Here you are, having gone through the hell that is pregnancy and labor, you've given him a child, and his first move is to demand you lose 30 lbs in 6 months or else he leaves you? What in the actual fuck. This combined with him siding with his friends who called you fat, his victim blaming when his friend sexually assaulted you (ANY form of non-consensual contact is assault) and his unbelievable accusation that you were leading his friends on by being too hot tells me he has ZERO empathy for you as a person and he views you negatively because you are a woman. He may have realized he was wrong overnight, but his misogynistic outlook is one thing that will not change overnight.\n\nOk I gotta back up--you were leading his friends on?!? His friends know you are not a sexual option because you are married to their friend. By saying you were leading them on, he's saying it's ok for them to view you as a conquest even though you're his wife. And then he has the audacity to blame you because his friends are pigs?\n\nThis is fucking repugnant and despicable, OP. If he issued an ultimatum over your weight now, what's next? What happens if you develop a thyroid problem that makes you gain weight and prevents you from losing it, no matter how much you work at it? So much for that in sickness and in health part of your vows, I guess.\n\nYou're not always going to look the way you did when he met you. You will age, you may gain weight as you get older, he likely will too. You should not have to maintain a weight of 130 to maintain your marriage. 155 is a healthy weight for fuck's sake. OP, take your kid and get away from this jackass. Holy shit.",
            "O_0\n\nThis dudes a piece of work.",
            "I like muscle cars but I'm not a dick lol. Your husband is such an idiot. I'm even angry at the weight loss ultimatum but to even accuse you further after you got your figure back... You're better off without him. ",
            "Luckily for you, this situation is very cut-and-dried and there is no grey area here.\n\nYour husband is a fucking asshole, with asshole friends. \n\nDo not go back. Stay strong, and remember, he is a fucking asshole. It's real simple.",
            "If you love him, and he wants to change and you want to be with the man he changes into, then you deserve to be happy.\n\nBut he was out of line more than once and doesn't deserve a thing from you.",
            "I'm going through a divorce right now and just got a book about narcissists you might find beneficial. It's called \"will I ever be free of you\" by Karyl mcbride",
            "Holy shit this is horrible on so many levels. Take your awesome body, fat or skinny or whatever, and share it with someone who deserves you! ",
            "He should have knocked his \"friend\" out for groping you. \n",
            "Please don't take him back.",
            "fuck him, take the kid and run",
            "when people are that sexist, you shouldn't be friends with them at all, much less \"friends I don't bring home.\"",
            "I understand him losing attracting after gaining the 30 lbs. But he should have broken his friends's jaws for the shit they were saying and drug them across the pavement for trying to grope you. He should punch himself in the face for not punching them. So much wrong with how he handled the situations. Basically, your man bitched out.",
            "Your soon to be ex-husband doesn't deserve you.  He does deserve his douchebag friends!\n\nLeave him and do better for yourself!",
            "This guy sounds insanely selfish and vain. He doesn't deserve you. This sounds like the type of guy every other guy just innately hates. He's a bad person",
            "I can't believe a man would tolerate one of his friends grabbing his wife, let alone being mad at *her* for it!",
            "Your husband is an asshole.",
            "You deserve better than this and you know it. Your baby deserves better, too. ",
            "Stick to your guns, you will be so happy you did",
            "you husbamd is a gigantic douche",
            "You should've walked out the moment he threatened you to lose weight or lose him. That is an absolute act of not loving you. He could be concerbed about your weight and health, but he went totally superficial. \nI don't know what are you trying to gather here. You partner is a superficial piece of s..  He either loves you the way you are or don't. \nOn top of that he blames tou for everything that happened? He is also insecure. \nYou have the perfect recipe for a disastrous relationship. \nGo find a man that loves you for whobyou are not how you look. ",
            "I would leave him SOLELY for any one of those issues - you carried HIS baby for 9 months and he says \"lose 30 lbs in 6 months or GTFO\"? Not cool. \n\nEven more not cool is him saying it's your fault that his friend groped you - no, that's his friend's fault and his friend's fault only - but especially when he's accusing you of being too sexy AFTER you lost the weight he DEMANDED you lose? Not fucking cool. \n\nPlease please please never look back. You deserve better.",
            "He's a classic jerk.  He acted like a baby and let his friends run him and you.  Let him call his friends and cry to them.  You won't ever be happy or feel safe with him again.  He is telling you that YOU are the cause of his problems, leading his friends on, really? Violence comes next from him.  Kick his ass to the curb. You will  always wonder what he won't like next about you.  What  comments will his old or new friends make?  He thinks by saying he was wrong that you will take him back and all will be well, but it won't ever be again.  He's a jackass.  Do you want to live with a jackass?",
            "His friend gropes you and the best he can offer you is to stop letting him come to the house? That's crazy. It tells me he values his friendship more than he does you. That guy should be invisible to him now.\n\nFrankly, you husband sounds like a piece of shit. I can't imagine any man who loves his wife threatening to divorce her over her weight. This is especially so because it was so soon after you gave birth and he was willing to split up your new baby's family.\n\nAs for a second chance. You need to decide what is best for your child first, then you. Is he going to be a good father and role model? Is he going to respect you? Do you still love him?",
            "Give him an ultimatim. You or his friends. Your husband is being a bit unfair, but it sounds like his friends are toxic to both him and you.",
            "Your husband is an ass. You gained weight because you grew a fucking human being. He needs to grow the shit up. Be done with him",
            "Good people don't usually hang out with shitty people. If his \"best friends\" are assholes, he probably is one as well.",
            "First of all, kudos to you for losing the baby weight. I am struggling with that right now so I know how hard it is. \n\nSecond, how DARE he give you an ultimatum after you gave him the privilege of fatherhood and then make you feel poorly about your physical success.  Do not return to this manipulator. It sounds like he will find any reason to put you down no matter how you look. There is someone else out there who will appreciate a determined, beautiful woman and you deserve that. ",
            "I am going to put this as nicely as i can. Your husband is fucking stupid. ",
            "Don't go back. Period. An ultimatum to lose weight or he'd leave you? That isn't love. If one of my friends dared to try to lay hands on my girlfriend, we would have a serious falling out. None of his behavior is acceptable.",
            "This guy is an asshole in so many ways.",
            ">My husband said I was leading his friends on by losing so much weight....\n\nOne of the most astounding things I've ever read. ",
            "That's amazing that you would go such lengths to be with your husband, I feel like I have a problem because of the whole 'weight' thing, like I don't want to be the only skinny one in the relationship.. I wanna be with someone my size.. ",
            "He won't let his friends over?  For what they did, he shouldn't even be friends with them anymore let alone letting them come over.  PErsonally I would have punched the person that tried groping my wife, especially in my own home.\n\nHe blamed you for his friends action and blamed you for doing something that you struggled hard to accomplish because of a demand of his in order to keep your family together.  F that.",
            "You're married and have a kid less than a year old. Has he been a douch since the kid was born? Yes. But dont fucking end it all over what is clearly your husband freaking out over nearing 30 and thinking \"is this it?\". He's having a personal crisis and wants approval. First he wanted yours. Then he wanted his friends approval and for you to prove you werent going to let yourself go, albeit in a VERY immature and childish way (ultumatums are never acceptable). \n\nHis friends are clearly douchbags and he needs to upgrade. But he may still have hope. Talk and COMMUNICATE and dont let REDDIT make your decision for you.",
            "Is your child a girl? Would you want your daughter to be around by and raised by someone like that? Just think of the self esteem issues she will develop. ",
            "Your husband shouldn't have been saying anything about your weight to begin with.\n\nGive him no mercy and no chance. You deserve better, friend.",
            "You can't trust him.  His love is conditional on you being the \"correct\" weight, whatever that means.  I am glad you have taken the first steps and will find someone someday who loves you for who you are.  ",
            "I think you need to loose more weight, that is drop the 170lbs (or whatever your husbands weight is).",
            "Doesn't sound like a guy worth being with if he treats you that way.  Seems like you already see that.  Additionally, the weight you lost in the amount of time is also unhealthy.  I think it's time for you to focus on yourself.  Make sure you don't starve your body of nutrients.  Nonetheless, awesome job on the weight loss.",
            "He gave an ultimatum, run far and don't look back. ",
            "I knew at muscle cars - dump him, he sucks.\n\njust kidding, you have a kid, maybe you can make it work out, although I wish you didn't have a baby.  But he needs to understand your point of view, because up until now it's been all about him and his needs (you're too fat, now your'e too thin...for him).",
            "I have a 1 year old. I gained weight. I'm just now starting to drop it. I'm doing this because I want to. My husband thinks I'm crazy for even worrying about my weight because to him I'm perfect just as I am. The fact that your husband gave you an ultimatum to lose weight or he'd leave you -- complete fucking bullshit. He relays to you that his friends find you fat. Then you lose the weight and are sexually harassed by the same friends and he blames you. Fuck all that. You can try the counselling route but your husband sounds like a jerk. Your spouse is supposed to be your biggest supporter and protector and based off this post, that is not what is happening here. I urge you to leave this relationship. Our friends are a reflection of ourselves. His friends are a reflection of who he is as a person. I do not see that changing any time soon.",
            "i bet hes hardly a fucking adonis",
            "Tell him you'll come back if he loses 50 pounds. Let him see how much fun it is. Then when he's done tell him you're impressed, but you'll only come back if he puts it all back on. \n\nRepeat until he gets the picture.",
            "WOW. \n\nAs /u/DWRoelands said:\n\nHe blamed you for his friend's decision to grope you.\n\nHe accused you of trying to cheat.\n\nHe pressured you into losing weight to win the approval of his friends.\n\nI can't imagine why in the world you would go back to that.\n",
            "Your husband sounds like a piece of shit. You carried and gave birth to HIS child and then he tells you he's not attracted to you so lose weight or he'll leave?? Then you do what he wants and he's STILL not happy. He sounds mentally/verablly abusive. RUN FAR AWAY",
            "Your husband is a piece of crap. I'm 5'4\" - when my husband and I first met I weighed 115. At my heaviest I was over 210. Now, I'm never going to get back down to 115, my body just isn't built that way anymore, but I have lost almost 50 pounds and am within 20 pounds or so of a healthy weight (despite the fact that I'm wearing a size 6/8, go figure). Never once did he tell me I had to lose weight. He never even told me he was less attracted to me. Telling a woman who's had a baby that she has 6 months to lose the TOTALLY NORMAL amount of weight gained while GROWING A CHILD IN HER BODY is shitty.",
            "He's definitely one of those \"Wife as Accessory to Lifestyle\" types.  You're the 'thing' he brags about that makes others envy him.  Meanwhile the friends know this, so they take the opportunity for any weakness, ie your temporary physical state, to have a go at him to tear his 'air of superiority' down.  I can guarantee that in the next 10-20 years, once you'd shown any signs of natural ageing, he would have swapped you for a younger woman.\n\n",
            "*hugs* \n\nI'm so sorry you had to experience that. Just so you know, being gropped is not your fault. You didn't ask for it. You didn't consent to it. \n\nDon't go back to him. You might love him, but he doesn't respect you and he certainly doesn't love you the way he should. If he did, he would have dropped the guy who gropped you.\n\n**EDIT**\n\nAlso, I noticed you have a son involved in this situation. I can understand that you might not feel comfortable leaving your husband because of the damage you perceive it might do to your son but nothing is worse than raising a child in that type of situation and having them believe that , that behaviour is OK. You can share custody and it might be a bit difficult for your son to get used to in the beginning, but when your son is older, he will thank you for that.\n\nI wish you the best of luck with this situation, I really do. ",
            "What a shallow asshole..\n\nthis seriously sounds like some Maury stuff...",
            "it doesn't sound like his actions were ever motivated by your health or anything like that, it was purely aesthetic. i also don't think that he ever really wanted his friends to stop making their comments about you, he enjoyed it, *this is why he demanded you lose the weight*, to impress his cronies. but of course, like an arrogant child, once his friends start paying *too much* attention and he thinks they are more interested in ogling you and not for his own company, he blames you for getting exactly what he set out for. worse yet, he's not upset that they're disrespecting you, he's whining and lashing out because he isn't the center of attention.\n\nim sorry to say, i don't think this will ever change. but you know the situation better than i ever could, think hard and make your choice one way or the other. because now's the time.",
            "You married someone for better or worse and after you bore his child he gave you an ultimatum? Now this? Leave him and find a real father figure not this shallow piece of shit. ",
            "He's emotionally abusive. Look a up the power and control wheel.",
            "Do not go back. Could you *ever* imagine treating someone you're supposed to love and support the way he has treated you?  \n  \nBeing a single mother will not be easy, but you also need to think of your child. Do you think your husband's behavior is going to foster a healthy environment for your kid? Will they have good self esteem?  My mother tried to \"work it out\" with a terribly abusive and manipulative man. Let me tell you from experience; no dad is better than a bad dad.\n  \n29 is SO young, and you have a lot of life to live through. Please don't feel like you don't have a choice, that you're trapped. You're not, and I am here if you ever need someone to listen.",
            "He gave you 6 months to lose weight or he would leave you after having his baby? What the FUCK!!!!!!!! You should have left him when he said that. ",
            "Erm, where's the baby?",
            "I'm going to voice some potentially unpopular opinions here. I think an automatic move toward divorce is a little rash. He's been an asshole since the baby was born but you have been together 6 years and have a child together. I think it's worth seeing if his apology was sincere and if he's willing to work on being a better father and husband. If not, then yes, get the hell out.\n\nI think there are a few steps that need to be taken if this is to work:\n\n* He needs to drop the friend who assaulted you. If he puts that friendship over your safety and comfort that is an absolute deal breaker. Not inviting him over the house anymore is not enough.\n\n* I think you should find a couples counselor, maybe start seeing one while the two of you are living apart. I'm wondering if the stresses of being a father are manifesting themselves in ways that he doesn't even fully understand. He may be projecting his insecurities onto you.\n\nTo be clear, I am NOT condoning his behavior, rather I am saying that if you love him and want to preserve your family, it may be worth seeing if his remorse is genuine and if he realizes how unreasonable he was being and how much he has hurt you. If not, then drop his ass.",
            "My lovely wife is 6 months with her second and not once have I ever considered her weight. When she has the baby she will weigh what she weighs and in 5 years she will be a different weight. I don't know what that is or care. \nI do care however that she is comfortable with herself and not having to worry about what I may thing day and night.\n\nSeek happiness for yourself and your child then you can shine your light unto the world.",
            "I'm about your height and weight, post pregnancy and yeah I've got a Lil chub but fuck that shit. I'm mostly fucking tiny still. So FUUUUUCK THAAAT. If anyone asked me to lose weight I would be so hurt, I could never trust him to find me attractive again.\nThis would cause me to constantly stress about my weight.\nSo fuck that. Seriously, please show yourself some respect this time and don't go back. He sounds awful and you deserve so much better, and you'll get it, cuz better than him will be easy to find, as he's scum.",
            "Seems like you married an asshole, not much you can do about that except love your son, love yourself and get away from toxic people.",
            "He sounds like a piece of shit. ",
            "Your husband is a fucking idiot. Find someone who appreciates you and surrounds themselves with better people.",
            "Fuck this guy so much.  The groping incident alone is appalling.  Good luck with your baby and if it's a girl, it's never to early to teach body positivity.  She's probably going to need it with a POS dad like that.",
            "Get yourselves to therapy.",
            "To be perfectly blunt, your husband is a piece of shit. It sounds like you love him way more than he loves you and he has zero respect for you. What he's doing is emotionally abusing you - if he's willing to blame *you* for unwanted advances from his friends because you choose to be fit, healthy, and look good, especially after he DEMANDED you do so by manipulating you and your feelings, then he deserves to live alone on his own deluded personal island. You are worth more than his shallow, petty horseshit.",
            "Do NOT go back to him. Threatening to leave you if you don't do what he wants is emotional abuse. You made the right choice. Be strong.",
            "Leaving him is the right decision. Not only is it not healthy for you, but if this relationship continued, there is a chance your child will see this relationship as an example of an acceptable situation. ",
            "Anyone that accuses their SO of cheating, when they clearly haven't is obviously feeling guilty of something. Dump him, take your baby, and tell him he needs help ASAP.",
            "Sounds to me that he values his friends more than he does you, his wife and the mother of his child. Fuck that dude. ",
            "Hey, the problem was never you - the problem was your husbands friends and his over reliance on their opinion. If my friends said anything negative about the weight of my partner, whoa, would they get their ears blistered. But that you were groped and harassed and he didn't take up for you? This guy will never be on your side when his friends are involved. That's technically assault and his impulse was to BLAME you!!! You will have a better life without him and his fucked up asshole friends in  it. ",
            "First off I want to say congratulations on the weight loss!  That is awesome progress in a short time,  and I can see you worked very hard to do so. Nice :) \n\nOn another note,  the way he's acting is unacceptable.  Even the weight loss ultimatum was unacceptable.  This guy sounds abusive,  at least emotionally.  You were strong enough to lose that weight,  you are strong enough to walk away from this guy, never look back,  you deserve better. ",
            "Tell him off why you won't go back with him.\n\n\n1) he) cared so much of what they said about you/him.( wanting their approval) \n\n\n2) he made you lose the weight BTW congratulations on that! \n\n\n\n3) he didnt stop them/ kick them out when you told him to make them stop. \n\n\n4) giving you that bs shit that you lost the weight to cheat on him.\n\n\n\n5)which leads to this: if they would have raped you he would blame you that you cheated on him.\n \n\n Until he really understands what's more important to him his friends or you, he will continue. \n\n\nTell him you lost the weight for him and only him  , he didn't defend you at all. He would rather have his friends approval then be by your side. And seriously he threatened to leave you if you didn't lose the weight and now he thinks you lost the weight to cheat him?!? Even though you told him to tell his stupid\"  friends \"to stop and he just let them be in your home after that? Wtf man! He so stupid. He cares too much of what they say and not your feeling .\n\n\n\nIf you really want to make it work, make him lose those friends for good, go to couples counseling, also he should just love you for you, but really great work on your hot body man.\n\n\n If anything you'll be hot for yourself and no one else :) good luck man! Sorry if my advise suck. I just wrote down what I thought.",
            "> He loved muscle cars and weight lifting\n\nConsidering you gave these as his two top selling points, I am not at all surprised at his behaviour.",
            "While I agree with most comments here, I feel like we're not getting the whole story. You married this guy, and you must have known what he was like. Maybe he didn't have an opinion on your size/weight but did he make negative comments about obese people? \n    \nI think that marriage is one of the hardest relationships and I truly hope you have the strength to lay it out for him and get through this. I lost 140lbs AFTER I was married and my husband loves to brag about my success and while his friends are respectful, I enjoy their comments about how great I look. He might brag about you which leads his friends to the belief that they can say inappropriate things. \n    \nLet him know that his friends are derogatory and insulting. If you plan to work this out, talk to his friends yourself. They will either respect you or not understand. At that point, you have stood up for yourself, stood up for your family, and earned respect. . . versus walking away from a marriage that maybe didn't need to end. I wish you the best. ",
            "Your husband is an insecure asshole. You deserve better.",
            "I can see where this is difficult because your heart is saying one thing and your brain is saying another. 6 Years with this man. Your husband and the father of your child. Especially because a child is in the picture, it complicates things. This isn't so black and white, and while I get that, I still do think you are stronger than all of this, and that you and your child will be happier in the long run without him (or his disgusting friends).\n\nSo let's really think about this....\n\nHe gave you an ultimatum. You satisfied it. You get hit on. *You* **get** hit on. Not *you* **hit on them**. And he blames you for it?\n\nI think this husband of yours doesn't have his shit together. You need to do what makes you happy -- and initially, satisfying *his* ultimatum to make him happy was a way to also make *you* happy (if I may say so). Now, that you're healthier and toned and presumably more confident, it shows and naturally, this invites attention (even unwanted attention). It sickens me that you sacrificed blood, sweat and tears to satisfy his ultimatum only to be penalized and so degradingly accused of something like getting skinny so you can cheat on him. He is an insecure man and you rose to your potential. You grew into yourself. \n\nee cummings once said, \"it takes courage to grow up and become who you really are.\" \n\nThe ultimatum wasn't easy. The journey to becoming toned and healthier was also by no means easy. But it has taken you to where you are today--A physically and emotionally strong woman who **DOESN'T TAKE SHIT**. Packing your bags and walking out was the smartest and boldest move because you're taking control of your own life and happiness and not letting some egomaniacal insecure man, husband or not, shackle your happiness with ultimatums and hurtful (borderline emotionally abusive) tendencies. \n\nFight the good fight sister! ",
            "Proud of you, OP! No one deserves that shit! You do you, girl. ",
            "Men like him are the salt of the earth.\n\nNot.\n\nDrop that piece of shit.",
            "As far as I'm concerned, you sound like a catch.  What kind of women gets an ultimatum like that and actually gives in.  You lost the weight and now he blames you?  That kind of hypocritical, superficial thinking is something you need to stay away from.  Sounds like he is very manipulative.  Hope all goes well and we get an update of how things turn out.",
            "You were pretty clearly married to a shitty person who had shitty friends. Sorry to be so blunt but you should be happy that you are away from him. Time to find someone worth your time.",
            "Where do these pieces of shit exist? ",
            "Your husband is abusive. I'm sorry, but you should not go back to him unless you are willing to drag him to counseling and get some solo counseling as well. \n\nWould you even be friends with a person who does this? What if your BFF was like 'you know, fatass, you popped out a kid but come ON you're just not hot enough to hang out with me anymore, so lose that weight or I'm outta here.' Then when you do lose the weight, plus some, she says 'You're trying to steal my husband/boyfriend, I can't believe you would do such a thing.'\n\nSee where I'm going? It's just not cool.",
            "It seems like whatever size you are, he feels the need to shame you about your body. That is unacceptable.",
            "OP, what your husband has done isn't a good thing. His friend groping you and him not immediately kicking that friend out is beyond bullshit.\n\nBut, you're married and have a kid and a long history together. I'd suggest a few things to start. First, you should absolutely look into some couples therapy. You're not in a healthy place right now in your relationship and that needs to change. Second, think very closely about your family and where you want to be in 5-10 years. Is he the person you want to be with and raise your child with, or would that do more harm than good?\n\nDon't just jump the gun and get a divorce or jump the gun and forgive. Think about it, talk to people about it who aren't family or friends, and then make the best decision for you and your family.\n\nBut to start, I'd tell him that things need to change immediately. Those friends are no longer welcome over, and his control issues over you also need to change. ",
            "Everyone else has already said it.\n\nYour husband has shown a pattern of very poor behavior towards you and despite that you have aimed to please him.\n\nYou should not tolerate this.",
            "I'm very sorry you and your child are going through this bad period.\n\nThe problem is much more than a weigh issue here. It's about his capability to love someone else in a way that will enable him to have a long lasting relationship. It would seem that his friends opinion of you is what is setting his own opinion.\n\nAsk him if he would want to spend the rest of his life with someone who is apparently only with him as long as he looks good.\n\nPersonnally, I would only go back on the condition that if he was ever to mention your looks (in any shape or form again) that it is understood that you are leaving him for good. Let him know that although it is not your intention, you could very possibly get fat in the future and ask him if he can deal with that. \n\nI would also inform him that, not only his toxic friends are not welcome any where within a mile radius of you, but that he should also let them know that any direspectful comments about you are off limit.\n\n",
            "He should be unfriending his \"friends\" and choose you over them.  \n",
            "Seems like you'll have to shed him off too. Don't ever look back. He is shallow and manipulative. Keep doing yoga though. It is the best thing to do no matter what, and it particularly helps you with a big transition like this. DO NOT LOOK BACK. ",
            "That is disgusting. Girl, you go on with your hot bod and find a  man who will respect you and protect you. You deserve better.",
            "I'm sorry that you're in this situation. His behavior is unbelievable.  It seems like he doesn't truly see you and respect you as a fellow human. He puts his male friends above you.\n\nYou did the right thing.  Maybe counseling would help but only if he saw the full depth of his wrongness first.\n\nWas there any sign of his disrespect of you or low opinion of women before you married him or did this come out of the blue for you?\n",
            "You are beautiful, you are amazing and you are STRONG. I don't know you, but for this I know that you are strong. Be that. He doesn't deserve you, especially after you went above and beyond and that still wasn't good enough. He doesn't respect you, he doesn't care. All he is thinking about is him. He didn't stand up for you. Not only do you need someone who is better for you, but also for your child. I hope you the best, PM me if you need anything, even to rant. Remember that you are strong. ",
            "Your husband is still an adolescent and an asshole to boot, no advice for you but that seems like a solid reality...",
            "You deserve a way better guy than this. Best to keep your son away from him as much as possible to reduce the influence he would have on him, turning him into another Chad who is obsessed with image to an unrealistic degree and doesn't care about women at all.\n\nGood for you for standing up for yourself, and be proud of your weight loss and toning for you, not for anyone else.",
            "Wow, sounds like a classic misogynist to me. \n\nAnd he won't \"invite his friend over anymore\"? Whoop-de-doo. He shouldn't BE friends with that piece of shit in the first place. \n\nIt sounds like he has no respect for you or your feelings, clearly. It's unfortunate that you've seen his true colors this far into the relationship, but either you take a break to let HIM work on himself and see if he can prove to you that he can change into a decent human being, or leave. ",
            "Hahahaha, this guy is an idiot.\n\nLose weight, gain weight, enough already.\n\nThis guy externalizes everything. You can obviously do better.",
            "Why would you want to be with someone who blames you for everything?",
            "I seriously can't believe this. He's blaming you for you enjoying fitness and getting in shape? You do you. You're better off.",
            "Nope",
            "Your ex husband is a piece of filth, no man should act this way. I wouldn't suggest giving him another chance",
            "Gaslighting at it's finest/shittiest. ",
            "He's a piece of shit. He's the one who should leave.",
            "What a fucking asshole",
            "Oh my god...Seriously tell your husband and his friends to fuck off. He is a dick and they are right in the bag with him. Take your rocking bod and go find someone that will appreciate you for who you are! ",
            "You were right to leave OP- I would put your hopefully soon-to-be ex in the same piece of shit basket as his friends",
            "This guy is a fuck and I have no idea how you put up with this bullshit.",
            "What I'm sure everyone else said. Don't go back and have a blast feeling good!",
            "Just get away from that guy. He is throuble. ",
            "Everyone else has shared my \"run far far away\" sentiments. I just wanted to tell you that you're so much better than this guy. Also that I'll be thinking of you and I hope you're able to stay gone from this relationship. Don't go back, this guy is a dick. ",
            "Your husband is a meathead piece of shit. Please leave him and do better for yourself and your child. ",
            "Did he ever act like this before you had the child? ",
            "He needs to grow up.\n\nThat is some reaal juvenle bullshit right there.\n\nAnd he needs new friends, but don't let that come out of your mouth.\n\nMaybe a little counseling for you two is in order, if he isn't too macho to admit he needs help.",
            "> He says that he knows that he was unfair and that he won't let his friend come over anymore\n\nSo rather than face up to his bro's, he'd rather just never let them in the house to see his fit wife? What kind of spineless gimp is this man?",
            "Yeah you're future ex is in need of one hell of a bastard slap.",
            "What specifically was the ultimatum?",
            "Fuck that...not only is he an idiot, his friends are idiots too. He sounds like a colossal piece of shit.",
            "DONT GO BACK!!!!!!",
            "To be blunt you sound like you married a dumb douchebag jock.\n\nNot gonna judge you but it clearly sounds like it was the wrong decision.",
            "Is this the kind of man you want your son to be? If the answer is no, I think you know what you should be doing. ",
            "How is this real? If my friend tried to grope my wife, i'd kick his ass and remove the piece of shit from my life. ",
            "Gurl, no",
            "I would suggest couple therapy/counseling BEFORE he moves back.\n\nSorry you are going through an awful time..\n\nI hope things improve sooner rather than later for you :)\n\n\n*Nana internet hug*",
            "He is butchering you about your body probably because he is insecure about his own. He might have been a dick initially when he told you you were to \"fat\" for him and now he is saying your to skinny probably out of insecurity. Maybe confront him and see how he reacts, whether he has a good reason or whether you should leave.",
            "Sad to hear that things aren't working out, but sometimes you just have to pinch off the shit that's hagging on and get on with your life.",
            "Your husband is a hot bag of shit of a human being. Encouraging your woman to be a healthy weight is good. Villainizing her over her body is straight fucked up. If you can leave this man, I recommend it. Your life will just be a cycle of random shit like this until you do.\n\nAlso, NO REAL MAN would allow a friend of his to make sexual advances on his woman and not put that dude into a mad checking of the beast mode order. Damn. I'm getting mad just typing this. \n\nPlease leave him. You deserve better. WAY better.",
            "I see a lot of people telling you to keep this guy out of your life. If you choose to follow their advice, I believe you'll be better off in the long run. \n\nIf you break down and go back to your husband, seek a marriage counsellor. If your husband refuses, make it a condition. If he loves you enough to try and make up for his grossly out of line behavior, he should agree to counseling. The only thing I would be wary of is him getting there and not liking what he heard. ",
            "Weight goes up and down. Appearances change. One day he will be old, saggy, and lonely and you will find someone who will love you for you.",
            "My comment for most of the relationship posts - your husband is an immature douchebag.",
            "Oh My GOD. YOUR HUSBAND IS A PIECE OF SHIT.",
            "I guess the way I'd put it is that good people can get emotional and and cross lines they did not intend to cross. This guy, however, had asshole motives all along. In that sense I think he knows he fucked up but I'd expect he's more interested in getting out of trouble than actually making things right with you. He strikes me as the kind of person who felt a sense of ownership over you and probably didn't expect you'd actually leave. Or perhaps he just thinks of respect as deference to his authority because that's how it goes in his life.\n\nI should also add that you know this person better than any of us. Ultimately you know better than us whether this guy is really trying to set things right and behave like a decent person. But do your best to determine whether he really cares about you or just losing out on hot, skinny you. After all, he had no problem threatening to leave when you had that extra weight. It's equally possible that he really is trying to control you, got caught off guard, and now knows he has to be more careful about it.",
            "He sounds like an incredibly shallow and jealous asshole.\n\nYou can do way better than him.",
            "Stay away.",
            "So he said he would leave you if you didn't lose weight, but thinks you should keep him when he blamed you for being sexually assaulted.\n\nWhat a baby-man.  Hope he's happy with his friends instead of his hot wife and adorable baby.",
            "Tell him to lose his friends and work on his insecurities, if you really want to be with him he needs to work on himself. He is insecure and will just find flaws in you and blame you for things. It never gets better until he confronts his issues and gets help for them.",
            "It is clear that the man has some growing up to do. He behavior is inexcusable, yet it is possible that he has never had the facts of life properly explained to him. If it is possible that he could grow personally to truly treat you properly you may want to give him that chance. With that said, zero tolerance for the superficial BS he has displayed in the past is needed on your part. Every marriage that lasts has moments of trouble that the couple chose to work through together. Emphasis on together. Wish you the best.",
            "You can tell a lot about a person based on the kind of company they keep, and your husband's friends (who think it is appropriate to comment on their friends wives body, positively or negative) are creeps. If you go back to him, which sounds unlikely, one condition should be that he dumps these losers. Keeping them around will only encourage him to continue the cycle of mistreatment. \n\nAlso, couples therapy is a must. He has some fucked ip ideas about a woman's supposed \"role\" in a relationship. The story about his friend groping you and your husband blaming YOU is an ACTUAL storyline from the series \"mad men\"-- a show dedicated to demonstrating how fucked up things were in the 60s. If that's not an indication of how antiquated and fucked up he is, then I don't know what is. "
        ]
    },
    {
        "post_id": "3lbqwe",
        "author": "soccermomontheedge",
        "title": "I (F28) kicked my husband out of the house in a fit of rage. Contemplating divorce over revelations about his brother's past. Am I overracting?",
        "url": "https://www.reddit.com/r/relationships/comments/3lbqwe/i_f28_kicked_my_husband_out_of_the_house_in_a_fit/",
        "score": 3211,
        "num_comments": 723,
        "created_utc": 1442511063.0,
        "selftext": "I'll try to be be brief.  I'm still fuming.  My husband (M29) comes from a big family, four brothers, two sisters, raised by a single mother for the most part.\n\nThe youngest of his siblings is J (M19) in the six years I've known J he's always seemed awkward and a little too quiet and socially inept.  I have always had a special fondness towards J because he's such a sweet person and I was a little awkward growing up myself.\n\nJ has been struggling with some classes and I've been helping him.  My husband took me on a special dinner night to thank me for this and it was there that he revealed why J sometimes struggles.  Apparently, their dad who is now dead left their mom over accusations that J was a product of infidelity.  He was not.  But their dad was super paranoid about infidelity and treated his wife like property.  The father started abusing J when J was as young as two, beating him.  He left shortly thereafter and passed away a few years after that.  \n\nThe abuse didn't stop there.  My MIL picked up where the father left off.  The beatings and abuse is too graphic and unspeakable for me to detail it here.  It's disgusting and inhumane.  My husband said that all the siblings took part including himself.  When I could no longer take listening to the details and the extent to which my husband participated I asked him why and how he could do those things.  He went into full on defense mode when he saw how furious I was and said they were told he was not their brother.  Like that's a valid excuse?  He said the family buried it and doesn't talk about it.  That J started defending himself at about 13 and the abuse stopped then.  I asked him if anybody had apologized to J.  He said he doesn't need an apology, that he just needs to forget and in time he will.  \n\nsince that night three weeks ago I have been unable to be affectionate in any way towards my husband.  It's like I went from totally in love, the totally repulsed by him. He's suddenly somebody I don't even know.  I honestly don't know why J has chosen to stay around all these animals and I'm disgusted with myself for marrying one.  Last weekend we had a back yard cook out as we often do.  Most of his siblings were here.  J knocked over a pitcher of Iced tea.  He's a little shaky and a little clumsy but it was an accident obviously.\n\nMy MIL went off and started berating him and called him an idiot and a few other names.  She started to berate him about his hands and how they shake so much and told him to get control of it and stop shaking.  I gave my husband a look, like, \"hey jump in here.\"  He didn't do anything.  I lost it.  I went completely crazy on her and told her that maybe if she hadn't beat him and other things...\n\nAt this point my husband jumped in and told me to take it easy on his mom.  I told her to leave and she told everybody to leave with her.  J only stayed because I practically begged him to stay but she told him to leave too.  I tried to talk to my husband about what happened and why I went off.  He told me to mind my own business about his family business.  I told him to leave at this point.  He reluctantly left and has been calling, and texting me non stop to forgive him.\n\n\n**EDIT**  Finally heard back from a friend I had emailed.  She's a counselor.  She told me I atcually victimized J by bringing up the abuse that Friday night.  She says I should have simply stood up for him for what happened that night.  She says I should apologize to him for that and I will tonight.  She also said it's probably going to be the first and only apology J ever gets that's even remotely related to all the abuse he suffered \"so be ready for anything\".  I'm picking him up at his friend's house tonight.  His mom kicked him out over what happened.  Everything is happening so fast now.  My parents have stepped up big time and offered to move him in.  My dad is going to teach him how to drive and help him get his DL.  He's going to give him his old car that nobody drives.  Now we just have to convince him to accept our help.  Haven't read all your comments but I will.  Just things are happening fast I need to keep up.  I know my kids will be fine.  Right now I'm in full \"get J help mode.\"  I have not read all your comments but I will.  Thank you all.\n\nOh I almost forgot.  I spoke to my husband on the phone finally.  He thinks he's going to talk his way back.  I asked him why his mom kicked out J.  He said he had no idea what I was talking about, he didn't know.  J told me that my husband has been staying at his mom's and he was there when J was kicked out.  I will file divorce, no chance I'm taking him back.\n\n**EDIT**  Some of you have asked about the details of he abuse.  I left them out to spare you.  Something inside you breaks when you hear the details of what they did to J.  I wanted people to read this and not have to visualize it.  Horrible and tragic are not big enough words.  \n\n**Edit** Sorry I can't respond to every comment and thanks for some kind words.  But just too add some clarity to some questions I keep seeing.  No, he has no remorse, nor does he think an apology is needed.  He also feels no therapy is needed for anybody, just time to heal.   But at the same time he acknowledges that J's shaking and struggle are a result of he abuse.   I don't get this contradiction but I will get therapy for myself as well and try to get more answers.  Also Yes, my dad is pretty awesome, I knew he would spring into action if I just talked to him.  My mom is great too.  I knew dad would get her to sign on as well.  They like J, and they had reservations about me marrying my husband but that was for other seemingly petty reasons at the time.  I swear on my life that I did not know my husband and his family had this secret.  \n\nI only knew that they all seemed normal but J was clearly damaged.  He is very sweet natured but you can tell he has endured some things.  I always wanted to get close to him and try to understand him but I never would have guessed.\n\n\n   \n**tl;dr** **My husband participated in disgusting inhumane abuse of his youngest brother.  I want a divorce, I think I want him in jail**",
        "permalink": "/r/relationships/comments/3lbqwe/i_f28_kicked_my_husband_out_of_the_house_in_a_fit/",
        "comments": [
            "> J has been struggling with some classes and I've been helping him. My husband took me on a special dinner night to thank me for this and it was there that he revealed why J sometimes struggles. \n\nWhy do you think he told you?",
            "[removed]",
            "I don't have any advice or anything, but I wish more people were like you, OP. It was really great of you to stand up for J. I bet no one ever has before.",
            ">  I asked him if anybody had apologized to J. He said he doesn't need an apology, that he just needs to forget and in time he will.\n\nYeah, because we all know that PTSD just disappears magically. That poor kid. ",
            "If you want an outside perspective, here it is:\n\nIf he was remorseful about it and genuinely felt it was wrong, then I could see you forgiving him.  However this isn't the case.\n\nI would forgive him for what he did as a kid because obviously, his mom resented J for their dad leaving and programmed the kids to abuse J.  However, seeing as now, as a functional adult, your husband refuses to apologize or even really acknowledge how damaging he was to J and even defended mom when she went to have another go, it's time to boot this man out of your life for good.\n\nHowever, I would also get the authorities involved. If you tell your husband to hit the curb then those feelings of abandonment will resurface, and then this will just become another relationship that J ruined in that family's eyes.\n\nYou can probably save this kid's life.  Kick your husband out and offer for J to stay with you if you have the means.\n\nI wish you luck.",
            "I am sorry you are going through this. I want to offer some perspective that other people have not quite touched on. Were you raised in a fucked up family? If so, there might have been some behavior you did, that is in fact, not normal. Families insulate children and make them think it's normal everyday behavior. \n\nTake me for example. My mom stole, used drugs as a coping mechanism and beat her husband and children. Guess what I did as a child and teen? I stole, used drugs, and got into a lot of fights. \n\nThe difference between me and your husband is that I am forever ashamed of my past. I am deeply guilty and have dedicated my life to helping others as a way to gain some karma. \n\nThe other difference is that your husband was twenty fucking three when they finally stopped torturing J. He was old enough to say, 'wtf this isn't right,' 5 years before it ended. I got my act together at 17. \n\nIt very well may be that your husband is just massively immature, and not necessarily an evil person. \n\nThis is not advice for you, but I just want to say how sad it makes me that the only reason the torture stopped is because J stood up for himself at 13. Somehow, the fight in him had not been beaten down. He had to stand up for himself bc noone else would. How lonely do you think he was? How fucked up are you going to be when you are raised in a house where everyone, literally, hates you? I don't know you, but I love you for standing up for J. The little abused and neglected kids in all of us say thank you. ",
            "[deleted]",
            "This would be different if your husband showed remorse and this was something he was willing to work through with you, together, perhaps with a professional 3rd party.\n\nBut he's not remorseful, so how he thinks you're going to be able to move past this is beyond me. \n\n>He told me to mind my own business about his family business.\n\nYou guys are married. It's your family too at this point. His family sounds fucking terrible. Do you feel comfortable raising a child around these people (assuming you may have them)?\n\nDoing the math, your husband was into adulthood when this was still going on.\n\nI can't imagine being in your shoes. This must be infuriating and amazingly depressing at the same time. ",
            "I would feel exactly as you do.\nYou are not overreacting.\nYour husband is not the man you thought he was.\nI'm so very sorry.",
            "Hmm, this is tough. I *wanted* to say your husband was a child/teenager and has likely grown up since then, probably regrets it, was coerced by his mother/siblings, he's changed since then, etc....\n\n*But*you say that the abuse sopped when J turned 13. He's 19 now, so that was only 6 years ago? That puts your husband at 23 years old? At that point, this is a *23* year old *man* abusing a *13* year old child? And he doesn't feel like he should apologize for that *at least*? Yeah, no. \n\nI would say talk to J, tell him you're there for him and are willing to help him through any sort of legal action he may want to take, and then *leave* your husband. Talk to him, give him a chance to explain himself *I guess*, but I highly doubt there is going to be anything that he says that is going to make it worth considering staying with him.",
            "Your husband sounds like an absolutely horrible human being, and I am really sorry you are going through this. It is one thing to have been involved because it was just the \"family thing\" to do, but it is another entirely to take up for it. To be honest, they should all be prosecuted. I realize that this sucks a lot right now, but this is not something I could ever live through. I don't know if you have children, but if you do that kind of abusive history would be something that he might do to your own children but also would be important in any custody disputes. \n\nHe is despicable. I am sorry you found out this way and not sooner. \n\n**Edit**: When I mentioned being involved with it because it is a family thing, I meant while OP's husband was an impressionable youth, but if this happened until OP's husband was 23 if my math is right then even the family pressure thing doesn't fly. We are talking about someone who was abusive well into his 20s. ",
            "Making him partake in the abuse was a form of abuse to your husband as well. Famliy pressure can make people (especially young people) do really fucked up things. So keep that in mind.\n\nThat said, he lost my sympathy when he said his brother doesn't need an apology and that time will heal it on its own. That's not how that works. I think a big part of this on your husband's part is denial and a fear of confronting his own actions. Take heart that this probably isn't who he is deep down, but it's still something he needs to fix.\n\nI'd consider taking him back under 2 conditions: he agrees to apologize to J and make some actual headway oward healing that relationship, and he agrees to therapy. That kind of fucked up upbringing will have left other issues that he needs to address to have a healthy life going forward.",
            "[deleted]",
            "You need to talk to J and get his perspective, for your own sake. Your husband is only capable of giving you part of the story, and right now your imagination is filling in the gaps as to how J feels about everything.\n\nDo keep in mind, OP, that living through the abuse of a sibling is traumatic in its own right. It is impossible, in my opinion, to only abuse one child in a household; when fear reigns, all the children are being abused. Your husband likely has a very damaged psyche because of what happened. I'm not saying that he is as much a victim as J, but he is a victim. It is possible to be both an abuser and the victim of abuse.",
            "Wait, you met J 6 years ago?  You might have met him while the abuse was still ongoing?\n\nYou were likely dating your husband when he was still abusing his little brother?",
            "If he had remorse we could sat he was a child and highly influencable. But he thinks it was normal. It is normal for you to be repulsed. It wouldn't be normal not to be.\n\nJ should call the police and fill a complain against them, but you can't force him to. But you can talk about it",
            "\"Mind my own business about his family business\"  - that right there shows that he has never accepted you as being part of his family.  Good for you for standing up for J!   I would recommend starting with counseling for yourself and your husband.  If your husband refuses to go to counseling, that in itself is very telling as to the state of your marriage.  When I was contemplating divorce a line from my favorite book kept going through my head - \"I've seen a marriage of love and I've seen a marriage of obligation.  Having seen one I can't live with the other\".  I knew my daughter deserved to see a marriage of love even if it wasn't my own.  Best of luck to you. ",
            "You're a wonderful human being. Thank you for existing. Unfortunately it does not sound like your husband and the rest of his family are and what's even more unfortunate is that it took this long to find that out. It is one thing to \"make a mistake in his youth\" (although if it were me this would still be something I could never get over like animal abuse because I just can't understand that mentality - it makes me sick), it is another to feel no remorse and to still feel justified in his abusive behavior of his sibling. Also even if his justification is that his brother might be a bastard (literally) how can he support his mother who made the bastard? \n\nI'd leave him. God forbid he ever suspects you of anything delusionally. A non abusive person would just leave you at the worst maybe not give you a chance to explain, but he, an abusive person, would go out of his way to punish and physically hurt you as he clearly lacks empathy and has been taught to treat people like property/personal source of amusement for his cruelty. Imagine bringing a defenseless child into the mix. \n\nYou are right to trust your instincts. This is the biggest red flag of all. You are someone who fights for the defenseless - you are not going to stand there and see someone bullied, abused, molested or neglected. He unlike you is someone who will not only stand by and let it happen but join if it is convenient or advantageous to him. He likes to hurt the defenseless and doesn't feel bad about it. Leave him and save yourself from further shittiness and heartache. ",
            "Whatever you do regarding your husband, get that horrible mother of his out of your life forever. She is evil. She should not be allowed to interact with your kids EVER. Your husband may be able to enter counseling and come to terms with his participation in her abuse of J, but she is beyond redemption. If you stay with him it should be conditional on him cutting all ties with her and anybody else in that family who defends her. ",
            "> He told me to mind my own business about his family business. \n\nSo even though you've married this man and bore him two kids, he still doesn't consider you family? If the shit show you described wasn't bad enough, this certainly clinches who your husband is as a person. \n\nYou sound like a real stand up person, which is a sad rarity in this world. I don't blame you for your response. If I were you, I wouldn't want to stay either. But **PLEASE** talk to a divorce lawyer first, and in secret. Your husband has just revealed what he's capable of. It doesn't sound like you and your children are safe around him.",
            "This is completely awful. I'm so sorry. Maybe it's worth having one last talk with him, seeing if he has seen reason since you told him to go. Growing up in that type of fucked up household is horrible for the children taught to be \"enforcers\" too. \n\nBut ultimately you are doing what's right, what needs to be done. Your priorities are in the right spot, protecting J and protecting your children. ",
            "I was like \"Ok, everyone needs therapy\" but once your husband stepped in to protect his abusive mother while she was actively abusing their collective victim I'm well in the \"Tell that whole family to fuck off, help J out as best you can.\" camp.",
            "Your view of your husband has changed. To the point it doesn't seem salvagable. One part you should realise is that the abuse he inflicted came because it was taught to him. The MIL and father instigated it, so for your husband and siblings it was a normal way of acting. Problem is that it doesn't sound like any of these people ever looked for mental help after growing up. They still are in the same cycle emotionally, the physical parts just have stopped. Your husband doesn't view his family background as strange. It's part brainwashing and part fear. He's a victim of shitty parents as much as J is.  \n\nJ is staying because he doesn't know anyone else as a family. It's better to have a known enemy you belong to, than to be solitary. Because if your family treats you this horrible already, how on earth would it be better cutting them off? You likely won't be able to get anything investigated. It sounds like J is an adult now, else you could've involved CPS. J himself probably does not know/realise that he has been abused or if so, that it's something he deserved; he's not ready to view this as a criminal act and report, and he's still dependent. Which is why you won't likely be of help to J in the future as a confidante, until he's ready to take a step to get away from them. \n\nYour husband is still the person you fell in love with, but you're now discovering a side you never were told about. And because your husband applies the cover up instead of healing method, it sounds like this is still unresolved. You could ask from your husband to go into counseling with you, but if he's not seeing a problem, it's going to be hard to address this. Think hard about the future you want. These people are still your inlaws. Your husband won't cut them off. Do you want kids? Do you want pets? Could you still deal with them being in your life, helping them bury such secrets? Because they do work as a team against one, and you've shown that you're not on their team. \n\nI don't think you're overreacting, but do take some time to consider a divorce is really what you want.",
            "You are not overreacting in the least. Abusing a helpless child is one of the most despicable things a person can do. I personally would not be able to stay married to someone who committed such acts and showed no remorse. Fuck that. There are plenty of people in this world that would never ever ever do such a thing, your husband is NOT one of them. ",
            "Good for you. I hope you do leave him. There is no excusable behavior for abuse, especially within family. You'll be much better off without being around people like this.",
            "If it is what he did in the past then work on it with him. If I was burdened by my sins growing up then I would be a horrible person right now. \n\nRight now you are isolating your husband because of his past instead of trying to work with him. If he has been good for the past few years aren't you going to just lead him towards a darker side now? ",
            "I don't at all condone what he did, but I want to side against the masses on this one.  Divorce is nothing to take lightly, regardless of the revelations.\n\nYou aren't over-reacting, but there's much to consider.  What we have is a man who has learned from his family to participate in an unspeakable act.  This is what he has always known.  I don't buy the \"He's an adult, he should figure it out.\"  True, he's responsible for his actions, but in the same situation would you be any different?  I've met too many sons and daughters of bigots to believe that we suddenly gain an open mind when we are 18 and finally culpable for the sins of our fathers & mothers.\n\nI'd issue this with an ultimatum rather than an outright war declaration.  He must recognize that what he did is wrong in order for him to continue to be a part of your life.  You have kids with him, so you don't want to remove a loving father.  But by that same token, you don't want to enable a monstrous influence in your home.\n\nYou took a stand against the MIL (and seriously, good for you!).  He now needs to chose between his responsibility to his current family and the responsibility to his old family.  Once that decision has been made, decide then if you will pursue criminal charges against his family.\n\nPut into perspective that while you are empowered to act, you are not the victim here: J is.  You can make rules for your home, and you can demand that the MIL and siblings are no longer welcome based on those interactions.  You are well within your rights to determine what damning dangerous influences are present in your home, but I'd stop short of going on a crusade against his whole family (even if they are assholes for doing what they did).  You are angered and hurt, yes, but you have responsibilities as well that must be considered over that hurt and anger.\n\nThis is an incredibly serious situation, and principles must be weighed carefully against the needs of your family.  You have to decide carefully if the actions of the past are a clear and present danger to your kids, regardless of your convictions.  Removing their father is a danger to them, there can be no denying that.  But if you honestly feel that you must side with that lesser evil, then you must do what you feel is best.\n\nAs a personal aside, a similar thing happened around the time I was two.  My situation was no where near as serious, but it just so happened that my mother issued a similar ultimatum to my Father, for which he was adamantly opposed.  Threatened with the loss of his family and the ultimate failure of his vow to us all, he sided with my mother... and they're happily married still.  They moved states, and years later were able to struggle a hostile relationship with her in-laws that lasts to today.  All of their children (myself included) recognize the in-laws (my grandparents) as the monsters that they are, and have taken it as a personal and hard lesson that we should NEVER be like them.  Their presence serves as a warning.  Were we never able to know them, we'd doubt our mother's story.  By knowing them, we both pity our father and respect our mother's strength.\n\nBut I iterate: your situation is more extreme than mine, and this may warrant more extreme measures.  If it's not a danger to yourself or your children, I'd consider a mediated meeting between yourself and your husband, and possibly with J as well.  If he still thinks what he did was okay, then you have your answers.  If he can humble himself and admit fault and seek atonement, then you have a chance of a happy ending to this tragic story.\n\nI don't want to underplay the severity of this, and I do not envy the hurt you must feel right now.  Regardless of the outcome, I hope for nothing but the best for you and your children.",
            "Wow. So you found our your husband abused his brother and you fell out of love with him. I would want a divorce too and I actually do think such a discovery can kill your love for a person, because the person you thought he was is not all that he is. However..... I would be very uncomfortable with shared custody of my kids with a man who... well he must have been abused himself as a kid, but he abused his own brother until he was in his 20s and still hasnt resolved anything at all about his behaviour.\nWhat if your MIL decides one of your kids is a the product of infidelity on your part, and he has shared custody? - Get legal help.",
            "Am I the only one that suspects OP's husband was probably beaten too?",
            "Your husband comes from some very, very sick family dynamics.  For what it's worth, it's common for very dysfunctional families to pick one child to be the \"scapegoat\" and for the other children to participate in the abuse.  It's a matter of self-preservation as much as anything else. They don't want to incur Mom's wrath on themselves by standing up for their sibling, so they participate.\n\nAt a very minimum, your husband needs some serious counseling to understand what went on and to grow a pair to stand up to his mom. ",
            ">He told me to mind my own business about his family business.  \n  \nYou *are* his fucking family. That's what marriage is. His side of your family sounds like they're all terrible people. Whatever happens, make sure J lands on his feet. The rest of those people don't deserve one ounce of your energy.",
            "You need to remember that growing up in that environment makes your husband a victim as well.  He had 2 abusive parents, who abused his brother and could have easily abused him as well, that means he grew up in an emotionally abusive environment with the threat/fear of physical abuse being turned on him.  Then they want he and his siblings to abuse J as well, and out of fear they would have.  You did actually victimize J by bringing up the abuse, because you brought it out in front of a whole group of people who abused him, and he probably had no idea you knew which is a betrayel of his brother's trust.  You didn't handle this well, though your intentions were good.  I think you definitely need to talk to a counsellor before you get involved with J in anyway, or discuss things with your husband.  I know you wanted to help, I totally get that, but you may have made things much worse.  Your husband absolutely needs therapy as well, because he was a victim, and he clearly has suffered a massive shift in what he thinks is \"normal\" because of his abusive childhood.",
            "I'm having a really hard time judging this situation fairly because you haven't given exampls of what was done to J.  How do we know if was truly abusive and not just simple horseplaying or something?\n\nI'm not accusing you of anything just trying to be objective.",
            "Horrifying. What exactly did you think of your husband and his family before you found out about what they did to J? I can only assume that your husband seemed like a great guy, but was there ever anything off about him? It's scary to think that there are charming, normal, functioning members of society capable of such cruelty.",
            "So you married into a family of monsters. There is a cure, it's called divorce.\n\nThere is no saving this as he truelly doesn't think what he did is wrong and is a full blown adult.\n\nWash your hands and walk away or suffer at their hands inevitability.",
            "You know what? Your husband is 29 years old. He really can't plead ignorance at this point. He knows it was wrong. But he chose to ignore it instead of fixing his wrongs, in fact he would rather seek tons of excuses than even attempt to fix his wrongs. When push came to shove, he showed you clearly where his loyalties lie: with his abusive mother, not with you. Not only did he not stand up for the weak, he actively defended the bully when you stood up for J. Not only did he actively defend the bully, he also slammed you when the bully left. \n\nI'm sure large percentages of murderers and rapists come from extremely dysfunctional households and have suffered unspeakable abuse at the hands of their parents. But they could have chosen to break the cycle. Instead, they chose to perpetuate it. Your husband chose too, when he defended his mother's horrid behavior. And he did not make a good choice.\n\nHe's 29 years old. It's too old to still be defending his mother. He defends her because he defends himself because he thinks he should be given a pass for his behavior. But his behavior was abhorrent. Still is, really. Your MIL now doesn't beat J but she still abuses him verbally and emotionally. He could put a stop at least to that, but he didn't. He had so many chances to do the right thing. He hasn't taken one of them. That tells you all you need to know about him.",
            "This is a very touchy subject that I think a couples therapy between you and your husband might be better off handling. Your husband in a sense has been groomed to treat the abuse of his youngest brother to be normal. He'd rather NOT confront the elephant in the room because that would required years of tearing down wall of conditioning. It would also mean introducing chaos into his family as well, which he seems to not want to become a part of (hence the ignoring and letting time pass by).\n\nSeriously, no one here commenting can give you good advice. Your husband is suffering silently, because he's conflicted between the mother he has left and you. \n\nA couples therapy isn't a magical cure, so I apologize if that seems like the only way out. Obviously you can always just find another husband; I wouldn't want to be in touch with his side of the family.",
            "I did some additional math. You've known your husband and J for six years. J was thirteen when the physical abuse stopped, and he's nineteen now, so... That means there's a chance that your husband was still abusing J when you met. That's just sickening.\n\nI saw you mentioned in another comment that you and your husband have two children, and that reminded me about something we talked about in our sociology class today. People's behaviors are the products of their environment; they can grow up hating their parents for being strict or abusive, but because it's the only example they know they often end up being the same way when they're parents without noticing it.\n\nPeople CAN change learned behaviors like that, but that requires conscious effort. Your kids are still young and your husband probably doesn't have any reasons to instantly abuse and hate them, but I'm worried about how he'll view them when they get older. He won't even acknowledge how awful his OWN behavior was, so if your kids fight and start to escalate into violence, he might just totally ignore it and let them hurt each other. Hopefully he'd know better, but... You don't want to wait to find out if he does.",
            "I don't think you are overreacting. Finding out that someone you love has participated in and encouraged abuse has to be one of the most horrific discoveries you can make. What's more, he continues to rationalize it and doesn't seem to feel remorse. Whether or not you should get divorced is something I think is beyond anyone on here's pay grade, especially since there are kids involved. I think you ought to take this to a counselor ASAP.",
            "Wow. from reading the title I thought this was going to be a situation where your husband was being deemed guilty by association. I was dead wrong. I am on your side here, hands down.\n\nYou can't completely fault him for his actions when the abuse began (I'm guessing he would have been somewhere around 10) You would think at that age he would know enough to understand his actions were wrong, but you would be shocked at how the perception of authority can alter our behavior. Even if he knows what he was doing was wrong the fact his mother was doing it, and encouraging him to would cause most children to follow suit. If you aren't familiar with the Milgram experiment I would suggest you give it a read, fascinating insight into human behavior. \n\nThat being said, he is now old enough to reflect back and realize the mistakes he's made. His complete lack of remorse for his actions and those of his family speaks volumes about him.\n\nI wouldn't be surprised if he mistreats any children he may eventually have. It doesn't sound like he fully grasps the damage that was done to his brother. I definitely would not be comfortable leaving my children in the care of his mother or siblings knowing their history.\n\nShitty spot to be in OP, I am sorry!",
            "Whoa, I was originally going to say that as a child himself surrounded by that environment, your husband was not 100% responsible for the abuse he perpetrated. But as an adult to not feel remorse and not have apologized, there is no excuse. I would feel exactly how you feel.  J is only 19 - you are doing wonders for him. More than you could possibly know. It sounds like you've got everything sorted - best of luck.\n\nAs someone who was abused and severely beaten by one parent as a child, and then blamed for it by the other parent, it's taken me a long time to come to terms (if I even have) but I have a some resources handy. PM me if you're in the Bay Area, California, and I can forward some info.",
            "Might be buried:\n\nHow old were your husband when he abused his brother?\n\nAs he is now 29, J 19, with the abuse going on between 2 and 13: he was between 12 and 23 yr old.\n\nIf so, then he was just repeating what *both* his parents were doing. A kid between 12 and 15 will just do what his aprents are doing. At 23 he should have known better, yet many who have been abused in their childhood have troubles educating their children, because their experience of \"educating\" a child is \"abuse\". They don't know what is normal to do.\n\nHis refusal to acknowledge that can be denial, insulation (he still doesn't really get it), or being an asshole. If it's the one the 2 first, he needs profesional help - though convincing him to go might be tricky.\n\nDoes he have a good, diplomat friend or fatherly figure outside of his family?",
            "I could only imagine what his kids would grow to be like. The fact that he doesn't feel that his brother deserves an apology or assistance and thought that \"we were told he wasn't our brother\" was a good excuse speaks a lot about what sort of person he really is.\n\nAt 29 years old, you should know that was totally jacked up and wrong. He feels absolutely no remorse. But hey. Look at who raised him.",
            "After reading through a lot of the responses, I want to say that I agree that your husband was abused, and that it was awful for his mother to involve him in the abuse of his younger sibling.  That said, the fact that he has zero remorse for his actions AND still participates in the abuse (by refusing to stick up for J and by lying to you about him being kicked out) AND is definitely still his mother's little robot (i.e. if she told him to hurt his own kids he'd obey without question) says to me that you need to get away from him.  And you will probably need to testify in family court about what he and his family did because the WORST thing that could happen is that you divorce him, become The Enemy, and then have to share custody.  Don't let your children near his family.  Be really really smart about the divorce.\n\nAnd thank you OP.   You may have caused some slight harm to J for your outburst but I'm certain that can't touch the good you've done by being the first person to ever be on his side in his entire life.  \n\nI would encourage you to check out /r/raisedbynarcissists and definitely suggest J check it out, to connect with others who have gone through \"similar\" things.  It might help you understand if he's reluctant to leave his family despite all they've done, and it might help reassure him that he's not the bad one.   ",
            "> I left them out to spare you. Something inside you breaks when you hear the details of what they did to J.\n\nI dunno man. I've heard some fucked up shit that happened in my husbands family. I was never broken hearing it. I just thought really differently of people that I knew. ",
            "You are a good person.",
            "He is a sociopath. I worry for the future if you have children with him. These things tend to repeat themselves in later generations. ",
            "Your Husband was abused as well! \n\nIt is very easy for a mother and father to manipulate their child. You husband and his siblings were manipulated into doing this. It's literally the reason we have laws against child pornography and statutory rape, because you can manipulate young children to do pretty much anything ESPECIALLY when you are in a position where the child trusts you, and no one is taught to trust anyone more than their own parents. \n\nYes, you're overreacting, because you're not understand the mindset he was in at the time. Also, he was a child when this happened and he won't go to jail. ",
            "To touch on what others have said about your husband being an adult: Your husband was a **grown man** beating up on a **child**, and feels *no* remorse for it.\n\nGood on you for getting your kids away. That 'family business' crap is how generations of kids got beaten on by adults and no one said a word.\n\nGuy's a monster.\n\n",
            "Husband and family all pieces of shit, you're not overreacting.",
            "What your husband does next is the whole ballgame. This is his chance to see the treatment of vulnerable people through your normal empathetic eyes, rather than the sick sadistic eyes of his family. \n\nIf he comes to you, unsolicited, with a full acknowledgement of how brutally wrong J's treatment has been and his role in it, an appointment with a therapist for himself, and a real commitment to supporting J in getting away from his family and getting the help he needs, you could consider reconciliation. Anything short of that, don't waste your time. ",
            "So, to sum up, your husband effectively told you, \"I used to viciously beat my youngest sibling. It's okay though, the whole family was doing it. Now, looking back on my past behavior, I can honestly say... No biggie, little bro should just get over it.\"\n\nHoly shit. All I can say is cheers to you for being the only decent human being in that family and sticking up for J. You're totally valid in finding your husband reprehensible based on this revelation. \n\n> It's like I went from totally in love, the totally repulsed by him. He's suddenly somebody I don't even know.\n\nListen to your gut, OP. Your husband's past behavior & current perspective on that behavior are both totally messed up. I definitely encourage you to get divorced *yesterday* and talk with police/a lawyer about the best ways to protect you, your kids, and J from this demented family.",
            "If you get a divorce, make sure to demand that any visitations he has with your kids are supervised.  ",
            "I wouldn't trust your husband around my kids. Would you trust him around yours? What about his siblings?",
            "This is very serious.  Your husband has been raised to think that it is okay to treat people like this.  What if the two of you have children?  How will he treat them?  I have been in Js shoes in my past and I still hangout and talk with my family.  I am 32 years old and I will never forget the horrible things that happened in my childhood.  While I have forgiven my family I would give anything for them to actually sit me down one day and tell me that they are sorry.  I know they never will but I would love it if they did.  \n\nJ is likely a lot like me in the sense that he likely sees the hurt and anger in his family and he does not want to cause more by cutting ties with them.  \n\nYou are a good person for standing up for him and your husband is not a bad person he just made some mistakes.  Talk to J.  Get his point of view.  Talk to your husband.  But if I was you I would reinforce with your husband that there is no way that you are going to be okay with him just standing on the sidelines anymore.  That he is a man and he is a big brother and it is his job to protect his little brother.   ",
            "Your husband was abused.  He is also a victim. Even if your husband was never physically hit, it is still abuse.  And like many victims of abuse, they learn to become the abuser. It isn't surprising he doesn't want therapy, because that requires him to bring up his own pain, but it is desperately needed. \n\nI am not saying he is without consequence, and does need to be accountable. I am saying that he is an inadvertent victim of the abuse as well. ",
            "Ok, I only read the first few replies in this thread, but something drastic seems to be missing here:\n\n\n**Your Husband was abused, and this behavior is also the result of deep trauma he experienced at the hands of his parents.**\n\nThat he thinks J doesn't need an apology and he should move on is a textbook psychological defense against extreme trauma. It's like being forced at gunpoint to kill someone, then deciding over the decades that it was actually alright to kill them because _____. It's that or be a quivering wreck for the rest of your life. It's a defense mechanism against terrible abuse, designed to keep your husband sane in the face of the insanity he faced and still faces.\n\nOn that note, it's also totally expected that a victim of abuse will react in extreme ways with their abuser. Think of a rape victim who walks into a room and finds her rapist--she'll probably freak the fuck out. Now think of a rape victim who was systematically raped for her whole childhood, and the deadweight helplessness she would react with when her rapist walks into the room. \n\nIt's the only strategy she'd have for staying alive.\n\nThat's the precisely identical behavior you're seeing with your husband.\n\nSo, he's doing the wrong thing, OF COURSE... but you're also revictimizing someone who is definitely one of the victims, *along with J*. \n\nThe bad guy here is the Mom. \n\nJ needs help, good for you for helping him.\n\nYour husband, who you said was a great guy, you you've been with a long time, is acting crazy out of character because his perception on this topic is warped by the abuse he suffered. He fucked up, but I think he's recoverable. He needs therapy though.",
            "Please divorce husband and adopt J. Such a sad story :(",
            "I think most solid advice has already been given and I just want to commend you for how good of a person you are. J is lucky to have you in his life and standing up for him, your kids are lucky to have such a strong woman as a mom and the world is a better place because of you. I know it's gonna be very hard but I hope you follow through on all this and I wish you all the best. x",
            "I know it would be a huge responsibility, but is there any way you could contact CPS and offer to take J in with you due to their abuse?",
            "I'd probably get out of there ASAP, how long untill you do something worthy of a beating, or any of the unmentionable things they did?\n\nI'd probably stay in contact with J if possible, he could use someone like you in his life, but that's up to yourself.\n\nSorry I couldn't be more helpful I'm in work but I had to say something.\n\n",
            "I am so very sorry you are going through this. I would leave. Especially if you don't have any children yet. Main reason is that he *still* thinks there is no need to apologise to the poor kid. Sounds like no real remorse there, from what you are saying. Also, he is a fucking moron if he truly thinks that kid will EVER be able to \"forget in time\". Fuck that guy and his family. They deserve each other (edit: except J, of course).",
            "J is not going to ever \"forget\" this abuse. It has helped to forge him into who he is, it has changed him.\n\nI don't know if I have any advice for you, but I sympathize with you.  I hate abusers.  Animal abusers and child abusers I hate the most.\n\nThese are some sick, twisted people.  The mother needs to be committed.\n\nEdit:  maybe this is my advice:  kick your husband out, and have J move in and stay with you.  He needs to feel safe for a while. ",
            "No, you're not overreacting. Start looking for a divorce lawyer. You're doing the right thing, helping J out. I would have done the exact same thing and contemplated (and carried out) divorce. That's not something you just sweep under the rug. Your husband feels absolutely no remorse and justified in his actions. Huge red flag. They sound like one majorly fucked up family I would want nothing to do with. ",
            "This was hard to read for me and even made me a bit teary eyed\n\nBest of luck to you and J",
            "I'm sure this will be buried and not seen at all but I would like to recommend a book for J (and you if interested), it's called \"Toxic Parents: Overcoming the Hurtful Legacy and Reclaiming Your Life\". I come from an emotionally abusive home and this book has brought so much perspective and understanding to me. It has seriously helped me in an incredible way and I hope that J can have the same benefits that I have from reading it. ",
            "Your husband didn't act the way he did because he's a terrible person - he did it because that's what his parents trained him to do.\n\nHe was a victim of shitty parenting as well.  What he did was wrong and should illicit patience and understanding from you, not accusations and blame.",
            "Honestly, you didn't see any signs from your husband, and all this because of one conversation? Usually there are signs that show a persons personality in a relationship. ",
            "People who grow up around abuse are often groomed to think of it as normal. Your husband needs counseling. I'm not saying you're going to be forgiving, but encourage him to seek counseling. \nThis is my insight: I grew up in a shitty, neglectful household and it messed with me. I thought all families were like mine. Even when I'd say something horrific, I'd justify it. It took years for me to see that I was groomed to see those things as okay. \n\nLook, I'm rambling. But just know that your husband can legitimately be a good person, and have done these awful things. In a way, he's also a victim.",
            "You did the right thing, even though I know to some extent the kids were conditioned to be cruel by an adult. Yeah, there is always that piece of them that can know it's wrong and defy the mother but it was probably 'easier' to comply and be cruel with the whole family.\n\nWhat others have already said is true--this family is sick, sick and you cannot make them better. J needs therapy like yesterday and who knows if even that will help as much as what he needs. \n\nThe problem is that here you are with a man who you can have kids with (sorry didn't read if you have kids or not) and, well, I could not trust your husband's judgement, especially after he justified what he did to his brother.\n\nAnyway, this is beyond any normal person's capabilities to deal with. I could not deal with it. \n\nHonestly, I am not sure (it depends) but you might even still be able to call Child Protective Services on his mother even though J is older now and an adult. I mean, the creep (the mother) might have grandchildren around someday and she is a mindless, idiot who needs to stay away from children.\n\nThey all need therapy but that doesn't mean that you have to participate with them. If it were me, I don't think I could stay.",
            "Wow what a messed up family. I'd be curious to know the ages of the other children during the time when the abuse occurred. These people need more therapy than there are therapists in this world. \n\nThank you for being such a caring and compassionate person, /u/soccermomontheedge. You and your family are wonderful people. I don't know enough about law, but I believe if you can somehow legally hold these people responsible for what they did to this poor boy, then you will be doing a great service for J. There are so many children like him and not all of them get support from loving people like you and your parents. Thank you so so much.",
            "OP, you need to take a look at /u/jmwest23ut's comment. Your husband has not fully accepted the fact that he did such a horrible thing. Kids are very impressionable. If you can't stand being with a person who was programmed poorly as a child, then fine, leave him, but don't blame him fully. His actions aren't excusable, but it's not like he thinks it was the right thing to do.\n\nI guarantee you he feels awful about it but is too ashamed to even know where to start. Additionally, he probably got defensive because even though he knows what you said was true, he just still can't accept that he did such awful things. He needs counseling/therapy just as much as J does and just as much as the parents need to be locked up.",
            "I'd be surprised if J was the only one being abused in that household.\n\nI can believe that one child would be disliked by the parents, but the level of abuse you are talking about is so extreme. J may have gotten the worst of it by far but the other children probably experienced their own forms of abuse at the parents' hands.\n\nYour husband has probably had his head seriously fucked with. I understand wanted to leave and never see him again but since you two of kids together and he is likely going to continue being apart of their lives you need to convince him to see a couples therapist with you.\n\nA therapist can help him understand how messed up what he did and experienced was. Can probably deprogram some of the psychological conditioning his mother did to him.\n\nSaying \"fuck off and die\" is nice, but it's not really applicable when the person has a legal reason to be around your children. For their sake and everyone else's convince him to go into therapy.",
            "Where do people meet people like these? It's scary to think out of everyone I know they are hiding a sick twisted and disgusting side to themselves.",
            "OP, you have wonderful parents who have raised you to be a kind and caring person. It saddens me that J has had such a terrible life but I'm happy that you and your parents have stepped up for him.\n\nJ will always bear the scars of his abuse but with a safe home and counseling he may overcome this and lead a happy fulfilling life. Thank you. As far as your husband goes, I hope his future is filled with pain, unrelenting pain.",
            "It sounds like you're doing the right thing.",
            "Can you really hold childhood actions against him?  If both his parents did this, he didnt really know better?\n\nStill, it is terrible.",
            "Now how do you keep him and his batshit insane mother away from your kids?",
            "I agree with what you did, however, one of the problems of doing bad stuff as a kid is that your belief system is kind of shaped by your parents, so if they're asshats you have a higher percentage chance of being an asshat.\n\nAs a kid, my mom had to go overseas to do family stuff (my grandmother was ill probably).  My father was however convinced she was going back home to have an affair and convinced me to continuously call/harass her at a regular time where I am, but in the asshole middle of the night.  I however realized how asshatty that was and stopped, however it could be easily understood how in an abusive system how going along would be less bad than trying to stop it and it's hard to be extremely moral when you are just a kid.\n\nFor jail purposes it should go first to his mom, who well is the ringleader of this circus of terror.  I know you feel more strongly towards your husband but he may have been too young to know what to correctly do as he would have been 10 when this scenario started and he may remember everything in a very coloured manner.",
            "Your husband and his family have stopped the *physical* abuse.\n\n\nI am so sorry you are going through this stressful time, but I want you to know that I admire you. You are being the difference in J's life.",
            "I think leaving him is fine, but remember that you are probably one of very few people who are close to J so you need to be super careful about the history he has and not making him uncomfortable. \n\nI dont think I would try to do anything legally because chances are that will just bring more pain to J. If you did decide this was the option to go please talk to J beforehand because it's going to be a really shitty situation for him to have to live all over again as he's questioned by many people.",
            "Situations like this take years to develop. If this actually did take place; the whole family will have been groomed for a very long time to treat this younger sibling as less than human. Your husband will have been as much a victim of abuse as the sibling. If you really think your husband suddenly chose to join in with this, you're wrong.",
            "Why did he start telling you all of this at dinner?",
            "Man your husband and in-laws are pieces of shit. No scratch that. They're subhuman trash that should've been euthanized once they slid out from under neath they're mothers filth. Ditch that scum bag, take up a maternal role for J and move to another state. Neither of you deserve whats happened.",
            "What the fuck is wrong with people?",
            "I clicked this post because I figured you would be overreacting and was looking forward to the comments, then I read your post....\nWHAT THE FUCK IS WRONG WITH PEOPLE!\n\nGood on you OP, you are a fantastic person and it's disgusting that his entire family still thinks it's okay. \n\n>  I asked him if anybody had apologized to J. He said he doesn't need an apology, that he just needs to forget and in time he will.\n\nThis was the nail in the coffin for me, it showed that your husband has absolutely no compassion, which would only result in him eventually treating you horribly, or your children horribly.\n\nGet out while you can OP. Sorry that you have experienced this, but you should be incredibly proud of yourself.",
            "I agree with your decision to divorce your husband.  \nBut I think you really need to have a plan for helping J.   I think you should ask him what he wants to do.  Even though he's being abused, it's still his family and sad to say, he's used to it.  It may be hard to convince him to leave his family - or even get therapy.   \nGo back to your counselor friend and see what see says.  ",
            "So the children blame the mother, who blames the father for blaming the mother for having an affair (which she denies) as justification for abusing the youngest sibling. \n\n\nyeah,.. OP, be prepared to be blamed by the whole family for everything that happens from here out.",
            "I don't have any advice for you. Just wanted to say that you're amazing and I wish there were more people in the world that would stand up to abuse. ",
            "I think you need to be more open to the idea that your husband also needs some help.\n\nAnd dont lie to us: by not disclosing the details of the abuse you are only trying to spare yourself the pain of telling it. I cant imagine a single thing on this earth too much for my ears, and I guarantee many people here also feel the same. Redditors yearn for those stories -- it is half the reason many people even come to post here and give you advice; it is 21st century soap opera.\n\nThat little omission in addition to the overall message here, and your (understandable) refusal to look at your husband as another victim here, seems to reveal that you have a bit too much of a protector complex in yourself. Beware of self-righteousness. It is a poison.",
            "This is a terrible, terrible thing that has been happening, and I commend you for standing up for J ad trying to help him. It sounds like you've already made up your mind regarding your husband, and you have every right to make the decision it seems like you already have. However, I would like to address something regarding your husband.\n\nWhen this started, he was still a kid. From the ages you have he was 11 or 12? I don't know what sorts of reasons or motivations he gave you for participating, but there's a very strong chance that it wasn't truly by choice. I would suspect very much that there was a decent amount of coercion from his mother and wouldn't be surprised if he suffered a fair deal of emotional abuse. The fact that a family of twenty-somethings stood by, watched, and blindly obeyed their mother (to me as if they are still scared of defying her) says something to me about how the mother has positioned herself in this family. \n\nYou have every right to kick your husband out. But another valid option is to begin with intensive therapy, for him to look at what happened to him and try to work out what I imagine are a host of issues stemming from this, you to work out your feelings having witnessed this, and together to see if there's a way to rebuild your relationship. Of course, there's every chance that he will refuse, that he will say there's nothing wrong with him. If he isn't willing to get help, then I think the decision is being made for you.\n\nAnd I definitely needs intense therapy. You don't get over that level of abuse by ignoring it and hoping to forget or by just apologizing and hugging it out.",
            "Wow this is very simliar to THE GIFT.",
            "You're husband is so desensitized to J's suffering he doesn't even see J as a person. Can your husband even imagine what he did to J happening to your kid? That might be the only way to get him to start seeing how fucked up his actions are. Your husband and J both need help separately: your husband to realize what he did and J to learn how to cope. I do not even you and I hope you are able to figure out what is best for you and your children. Awful.",
            "As someone who was in J's position don't expect the world. It's hard to process kindness as an honest emotion. And it's a coin flip if I would spit in someone's face or become afraid and overwhelmed and run away myself. Even now 10 years out I find kindness strange and slightly infuriating. \n\nAlso, it is unlikely he'll fully side with you against your husband. ",
            "Whose house was it? Did you pay for it? Irrespective of the inhumanity of the situation, if you didn't you have no power here.",
            "I never respond to these things but...\n\nYou're amazing, you did the right thing. No way you can stay married to a person with a history of abuse that you didn't know about beforehand.\n\nI do not get how so many people including the counselor think it's ok to pretend this never happened. The family needs to know it is totally unacceptable.\n\n\nAlso, your husband does not have the same values as you. He abused another human like a disgusting animal. You'll be much happier not married to a man like that.\n\nThe whole thing is toxic, get out!!!",
            "One thing that doesn't make sense to me is that you seem to have a strong relationship with J which means you've spent some significant amount of time with him.  This wouldn't be happening if J and your husband didn't share some form of kinship connection.  It doesn't make sense to me?  J wouldn't want to be around your husband if your husband actually hated him or used to abuse him in the way you claim?  Something doesn't add up.",
            "Here is something to consider.  The abuse of J was a learned behavior forced on to the family by the mother and most likely a defensive mechanism.  Because let's be honest, more than J was abused by the mother, in a family like that J became the target so the others could avoid being abused.\n\nAnd think about this, the fact that he revealed this abuse to you, and was pleased you showed an interest in helping J is his was of expressing guilt for what he has done. Until he can talk through everything and apply reason to the events, he can't accept what he did as wrong.  The act of accepting his place in the abuse would most likely break a lot inside him, his whole world view is tainted by this. He NEEDS counseling.  So does J.  Ask them if they would both like to attend a counseling session together, J may turn it down, but if your husband wants to fix what is broken inside of him he will eventually agree to go.  And I say they should go together because your husband needs to work on rehumanizing J in his mind and J needs to confront his abusers, doing it in a controlled setting will make sure it goes smoother.\n\nNow, if this is a deal breaker.  I recommend you attend counseling with your husband during his counseling over his abuse, it will be easier to explain to him why it's over in that setting.  Either way you decide, make sure there is some sessions done and progress made before you make a decision and act upon it.",
            "Your husband is a victim too. I posted a response to another commenter about this so I don't want to be redundant but he needs a real chance. If, AND ONLY IF, you can convince him to go to therapy, I think you two have a shot at getting back on track with your relationship.\n\nHe is a victim of your MIL. He was a child when it all started and she fucked him right up. Yes, young adults have the ability to decide between right and wrong, but this is largely dependent on upbringing. If he grew up in her reign of terror, if he thought that if he didn't participate she would turn on him, then he had to find a way to survive. He had to cope by making what he was doing okay. \n\nI am by no means advocating for any kind of abuse. I think J's situation is awful... I feel a visceral hatred for your MIL after reading your post. And I do not excuse anything your MIL did. But your husband and the other siblings need to get counselling to get their heads straight and to come to terms with all of this.  ",
            "Abuse of any kind is grounds for divorce. How do you know he wont react badly when your children grow older and start \"acting out\" and \"talking back\" (typical kid stuff)? My father was abused and he swore he would never act to me the way his father acted to him... I am now 30 and have changed my last name and have not spoken to him for almost 9 years because the type of abuse (emotional and physical) he left me and my mom when they finally divorced. He basically became the man he swore he never would become... Move on. Do it for you, do it for your family. Stay strong OP, I wish you the best. ",
            "as somebody who was on the receiving end of a lot of abuse from my parents and siblings growing up, and who also happens to be 19, i gotta say you're doing the right thing and that you're making a big difference in somebodies life. \n\ni still have nightmares about the things i've been through, i have almost 0 ability to trust anybody, and i suffer from tremendous amounts of anxiety and depression that makes even having conversations with people very difficult for me. if somebody had done for me what you're doing for \"j\", it would have been much easier for me to finally cut my family out of my life. \n\nwhatever happens, you've done something profoundly life changing and positive for somebody that you didn't have to do. 99% of people would have just pretended they didn't see anything and just ignored it. it takes a great person with a lot of courage to do what you did.",
            "Family of psychopaths",
            "Have you considered that your husband may have also been a victim of abuse from his parents? I'm not excusing what your husband has done but it may provide some reasoning for his actions. If he was abused as well he may have grown up considering abuse to be part of normal family behavior. This may be why he doesn't seem to understand why it is wrong, since he possibly can't conceive of things being different.",
            "Yeah, nope. I'd definitely divorce over this. ",
            "OK, I'm going to go against the grain here and say that I think your husband is just as much a product of abuse as his younger brother.  It was just abuse against the mind instead of the body.  And generally speaking, it is very difficult for people to recognize when something in the way they were raised is not normal.  Your home and early childhood *defines* normal for you, and that's really hard to break out from.\n\nYeah, you need to make him recognize how you see it, but people do sometimes have these massive blind spots.  Not to mention that he may be pretty traumatized by the things he committed.",
            "This is horrific. Your husband is someone who can participate in torturing a child without any remorse. I don't know what precise course of action you should follow, but whatever it is should involve divorce proceedings. No counseling, no trying to fix anything, because this cannot be fixed. Also, being there for J to have a soft place to land when shit starts going down is a must.\n\nI'm so sorry that you're going through something this awful. I wish you well in getting through it. ",
            "Their behavior towards J is absolutely vile. You're absolutely right in your reaction. My heart breaks for the poor guy. ",
            "Jesus Christ.\n\nI mean.\n\n... Yeah.  Jesus Christ.\n\nYou're doing the right thing.",
            "I wouldn't be surprised if you saw this behavior in him with your own kids one day. I'd run. I blame this all on mom, he was doing what mom approved of. Then buried it, and has never had to come to terms with it all.",
            "You are saving J's life and fixing your future. I'm so damn proud you decent human you!",
            "Insist on therapy.  Your husband was raised in an abusive environment and became one of the abusers as a survival skill.  If he can come to see that, and regret his part in it, there is hope for him.  If he agrees to take part in therapy for him, his brother, you as a couple and perhaps even as a family; you should consider re admitting him to your family group.  ",
            "You should probably actually talk with your husband about this. He did horrible things, but he did them at the direction of his parents. In a way he's a victim too. \n\nI'd assume he feels a lot of guilt over it and wants to bury it so he doesn't have to deal with his feelings about it. It's a natural, if ineffective, way to deal with abuse.\n\nHe and his siblings ALL need counseling ASAP. \n\nThat said, you're well within your rights to not want to be with him over this. It's horrific and disgusting.\n\nFrankly, he needs to grow a pair and accept that he did a horrible thing. He needs to apologize and try to build a better relationship with his brother. More importantly he needs to realize WHY sweeping it under the rug is just making things worse.\n\nGood luck, OP. And thanks for sticking up for J, the world needs more people like that.",
            "Another mom here ---\n\nThe thing that gets me about this - what is your husband going to do when your children reach the age when J started being abused?  \n\nHow would he feel if someone did that to his very own child?\n\nWill HE do that to his very own child?  \n\n\nHe did it to his very own brother.   He did it to his own brother over and over and feels no remorse for it. \n\n(((hugs)))\n\nGet a lawyer to cover yourself.  He has a full family of crazies to back him up.  You will be their next target, as will your children.  Get a lawyer NOW",
            "Yeah... well... I don't really know what to say... first of all, big respect to you for being so strong-principled, even if it will likely cost your marriage.\n\nMy recommendation: Tell you husband he has to come clean about what happened... meaning: He has to go the police and tell them everything - or you will divorce him and fight for him not having the custody rights of your children, based on you being afraid for their well-being. If these allegations are as serious as you point them out, this will likely end up in divorce, because he won't dare to go against his family... but in the off-chance he actually does it, it will probably do **much** more good for J than if you try to report this to the police yourself, because all of them will just deny it. If your husband really is willing to go that far against his family, then, despite everything he has done, I believe he seriously deserves a second chance (with lots of therapy etc... of course).\n\n\n>  I honestly don't know why J has chosen to stay around all these animals and I'm disgusted with myself for marrying one. \n\nYou heard about the test where they give electric shocks to animals, and at some point they don't even try to stop it, because they sort of go used to it? It's learned helplessness, essentially... J can only overcome it, if he stays away from his family, gets good therapy, and has a social environment which is vastly different from his family.",
            "You took a stand for the poor guy, and that's what's important. It's unreal that your husband is only penitent because you called him on his and his family's abusive treatment of their brother and you kicked him out but there you go, consequences have finally been given. Stand your ground.\n\nHonestly, I wouldn't want to have anything to do with anyone like that either. I can totally see legitimate reasons for divorce here. What a scumbag family.\n\nUnfortunately, I think the brother would have to press charges for jail to apply. ",
            "Good for you! Now after divorcing take J under your wing and teach him compassion, how to be socially functional and be his wingwoman. ",
            "People can always change, and you can get past these horible things your husband did.  \n\nBut the first step to this is always, always, always contrition.  Your husband is not sorry for what he did, or are anything wrong with it and therefore can not be forgiven, and can not change. \n\nGood for you op ",
            "I don't know if someone else has said this yet, but I want to encourage more discussions with him. Push and push for him to realize that what he did was wrong. Maybe he was abused too, and can't admit that yet. Maybe a part of him realizes that what he did was wrong, but is afraid of the guilt and can't admit it yet. A safe, non-judgemental place - like with a therapist - will help him come out of this toughened shell that he created to help him survive in an abusive, dysfunctional environment. Good people do terrible things in the name of survival, and he may be suffering from a form of PTSD, not being able to come to terms what he did - yet.\n\nSince you already yelled at him and kicked him out of  the house, he probably doesn't feel comfortable opening up to you anymore - to no fault of your own! Lots of people would have reacted this way. This is why we have professional therapists! Please encourage him to seek therapy. If there's any indication that he wants to come to a full realization of his actions, there's hope for your marriage. He just needs to feel like he's in a really, really safe place.",
            "Ask yourself this - do you want children with this man? Do you want children with the same DNA as this man? I am not sure I'd even adopt an animal with this guy. To me - this is too fucked up to forgive. I'd be gone. Upset, devastated, but gone. \n\nI just read that you have had kids with him. Double, triple the reason to go. He may not be a sociopath but was certainly shown the ropes. Take your kids and get gone. ",
            "OP, I admit when I read the title I didn't know what to expect but I am on your side 100%.\n\nWhile it's up to you to decide if you want to stay with him, I agree that he is or was a horrible jerk",
            "You're an amazing person and so are your parents. I'm so sorry this affected the relationship with your husband though :/ \nI wish you the best of luck and best of luck to J too. ",
            "Wow you're a straight up hero in my eyes. Im proud people like you are willing to stand up for what right even when it goes against the opinions of those close to you. Bravo.\n\nI hope that kid can get the love and support he needs. No one deserves to be treated so poorly. Its no wonder the kid has such problems with school and with socializing... ",
            "What was the abuse?",
            "I know what you're going through is hard, and you're probably feeling a bit overwhelmed. There's a lot of really good advice here, and I encourage you to find time to read it. \n\nThat being said, there are three things I feel you should consider, moving forward. \n\n1. You *must* involve the authorities. This is too big for you to take on by yourself. \n2. Your husband is a perpetrator, and also a victim. He grew up in this household being taught that this is normal and maybe in some ways being victimized himself in ways. I have a hard time with the idea that his brother received all of the abuse and he was treated perfectly normally. Regardless of whether he was victimized or not, you are correct to leave your husband. You cannot have children with this man. Who knows what he will do to them. It's unfortunate, but that's the way it is. \n3. You may be tempted to handle everything for J, to take him in and be everything his mom never was. Be careful though, the desired end result is that he is a rehabilitated independently functioning adult. Get him help, teach him to stand on his own, and make sure he doesn't end up using you as a crutch for the rest of his life. \n\nYou've done an amazing thing by standing up and taking the lead to help address this young man's lifelong struggle. If there was more people like you in the world, it wouldn't be such a bleak place. ",
            "This is a worst nightmare come true. You married a monster. A monster that doesn't even think it was wrong. Thank god you are sane. *hugs*. Proud of you for being a sane decent human being. ",
            "You are a really good person. ",
            "I don't know what you should do, but I think I'd divorce him if it were me. That he showed no remorse now and his attitude towards it is more worrying than that he participated in something his family taught him was normal as a child. I'd be scared about having my own kids or pets around him or his family with their past. I just don't think it's something I could get past. ",
            "[deleted]",
            "PLEASE DIVORCE HIM. oh my GOD if anything please find out if theres a statute of limitations on abuse for J. this stopped 6 years ago? Please try to get him help :(",
            "Divorce your husband. Save J. When you leave, things will likely get worse for him.",
            "J should have some control over this as well. If he knew his brother is going through a divorce because of him, who knows what he would feel or do? Or what sort of backlash he would get from his family? If you must, you should speak with J and get his perspective on this story, privately so he can be 100% honest. From what you've said and done, I'm sure he can find some sort of comfort around you to open up.\n\nTo be blunt, you shouldn't be the one trying to 'fix' anything about J's situation because it doesn't involve you. Sure, you married into this family but that doesn't give you the right to do a complete overhaul with how their family works. You have every right to leave your husband as how you see fit but this is J's life and the fact that he's still there and hasn't ran away or contacted any authorities shows that there could be more than just fear that's keeping him there.",
            "Hero. ",
            "Wait... They beat him because they were told \"he wasn't their brother\" by who? The father said that right? Then beat J and left soon after?? Then the *mother* started to beat J too... Why?? Thats still **her** child. None of this makes sense to me. \n\nGood on you for standing up for him. You probably gave him something he has never ever had before. And fuck the rest of that family, including your husband. If an entire family can gang up on one other family member and never feel remorse.... Uggghh, thats the worst kind of people.",
            "Initially after reading the title of your post I was admittedly a bit biased against you. But I'm damn sure on your side now. Good luck getting J help. And good luck moving away from this experience.",
            "You are a great woman. \n\nSeriously, you could change this kids life. Fuck that awful cycle of a family he has. \nImagine what kind of cycle of family your SO would've brought to your kids. You are really making a huge change ",
            "Thank you for being J's advocate!  Noone has been there for him.  :-(  I do not blame you for seeking divorce.  The lack of remorse is horrific.",
            "I don't blame you for wanting a divorce. This is not the type of environment or person you want to have a child with. Really sick family dynamic going on there.",
            "Fuck that shit.  Could you ever have kids with someone who could so easily rationalize an entire family beating on a child?",
            "OP, you are a true heroine. Heroism isn't what you see in films, it's standing up for others and what you believe in, even at great personal cost. I hugely admire what you've done.\n\nAs for what next, protect your children, protect J, protect yourself, and get the hell out of there. Your husband is a despicable individual - ditch him and never look back. \n\nBest of luck - I can't imagine how hard this is for you.",
            "Regarding your edit OP you and your family sound like amazing people and im sure you will have much support and love to raise your two children in. \n\n\nDon't worry about updating further on this thread, just concentrate on your family and get it all out in a day or two. I'm sorry this is happening to you.",
            "At first I was going to stand up for your husband. As a product if an abusive parent myself, I know the dynamic. My mother tried to convince me to do things that were wrong many times, with phrases like \"Obey your elders\" and \"If you don't do this, you can find somewhere else to live\". Sometimes I dod those things. Thankfully it was nothing along the lines of beating someone but still things that I'm not proud of.\n\nI was going to say your husband was manipulated, afraid, and brainwashed, but he's not that person anymore.\n\nBut he clearly is. If he weren't, he would apologize to J and do anything in his power to look out for him and try to make things right. \n\nHe's as sick as they are and I couldn't be with someone like that either.",
            "Good for you! Your husband is in denial and you can't be an ex-abuser until you fully accept your responsibility, make amends, and address the issue head on (usually with a therapist). your husband has done none of those things, is defensive about it, acts like it's no big deal, doesn't appear remorseful, has not made any effort to make amends (thinks J should just get over it), and is still allowing abuse to happen under his watch. That and he's lying about it when he did know J got kicked out. He seems entirely lacking in empathy or any other redeemable human emotion. What a freaking psychopath. He only mimics concern when it affect him Re: you leaving him. He and his family should rot in hell. ",
            "I could never forgive this. And if he abused his sibling like this, he could do the same to your children.",
            "I have no advice. I just wanted to say that you are an amazing person for helping J and I hope he gets better and sees you as someone he can truly count on. ",
            "you are not over reacting at all. That is disgusting, and him and his entire family should be ashamed of themselves. ",
            "If you and your family can be there for J when he needs a place to go for the holidays, a hug for a new girlfriend, acceptance of a new wife, and someday share your family with his children, you will be giving him the best chance at creating his own family that he can love and raise in the way he should have been. Thank you for all you've done for J so far and don't berate yourself for not knowing what has happened sooner.  \n\nAlso, consider mandatory abuse counseling for your children's father and his family if they plan on being alone with your kids in the future.",
            "The fact that your husband is completely apathetic about allowing his own flesh and blood half brother to be the family punching bag is beyond forgivable.\n\nThis isn't a one time offense. This is a lifetime of abuse that he's partaken in. He can go fuck himself.",
            "Document everything, I suspect this family will seek vengeance in any way they can think of.\n\nGood for you. You should have beat up the MIL.\n\nI hope J can accept your help and learn to overcome the rotten hand he was dealt.",
            "I hope this is a troll post.",
            "Wow, you are a beautiful person.  ",
            "Just know OP that if J decides to go to the authorities and the case goes to court, your husband may go to jail since he was over the age of 18 and should have stopped the abuse.",
            "The only thing I want to mention is that in helping J, give him the love and support he needs, but don't treat him like a child and hold his hand through his healing. He needs to be able to be his own person. But what you're doing is a wonderful, beautiful, compassionate thing, and focus on that love that you have and give to stay positive. \n\nI also don't know anything about the situation with your kids, but keep in mind that you've got other people to give that love and attention to. I'm sure you're doing fine there; it's just something that popped into my head. \n\nAs for your husband, well, it is what it is, and if your thoughts and feelings have completely changed to the point where you're uninterested in reconciliation, do what you need to do for both yourself and your kids. Sounds like you're doing okay there as well. \n\nTl;dr You're doing a good thing, just don't lose sight of what's healthy for all of you x",
            "I think you need to get out of this hornet's nest, I think this J person needs to helped professionally and personally. Honestly a single damaged man is hard enough to try to \"fix\" but a whole big family? Really, really hard, things cannot be undone, unsaid or unheard.",
            "If he can justify that kind of behavior with his family, why would it stop with you or your children?\n\nI would certainly suggest therapy for you both as a couple, but CERTAINLY for him alone. His moral compass is way fucked. And of course massive therapy for J.",
            "I have no advice, just wanted to say that you are an amazing person for how you're helping J. Keep doing what you're doing.",
            "\". He said he doesn't need an apology, that he just needs to forget and in time he will.\"\n\nHoly. Crap. ",
            "This reminds me of A Child Named It. If I remember right, the author talked about his siblings being involved in his abuse as well. It's a toxic brainwashing, and your husband doesn't want to face it because it was normalized and, frankly, it's really brutal to look at yourself and realize the horrible things you've done. Takes strength that he may lack.\n\nTherapy. For him and the kid brother, needed desperately, ought to be a requirement for the continuance of your marriage, IMO.",
            "Get out of that relationship. You do not know when your husband could snap again. Doesn't sound like someone who feels remorse. You cannot blame yourself though. You didn't know, the best you can do is get yourself and hopefully J out of that situation ",
            "If he doesn't think it's a big deal will he think it's a big deal to do it to your children? Get rid of him",
            "Your husband told you to stay out of **his** family business? Whoa, i thought when people married their family became your family....\n\nAnywho, if you divorce your husband and adopt J as a son/brother no one would fault you. Keep in mind if this started when your husband did this when he was a child and finds this ok now he was probably emotionally abused, too. You may wanna cross this post over to r/raisedbynarcissists to get more information on what J is going through and what your husband may have gone through to think this way as an adult. \n\nBest of luck, to both you and J. He may never know how to thank you, and he may never understand that you're helping him because he deserves support, too, but my god, even just letting him know you know he was hurt has probably given him validation for the first time in his life. You're doing a beautiful thing for another person. Thank you. Thank you. THANK YOU!!! We need more yous.",
            ">Oh I almost forgot. I spoke to my husband on the phone finally. He thinks he's going to talk his way back. I asked him why his mom kicked out J. He said he had no idea what I was talking about, he didn't know. J told me that my husband has been staying at his mom's and he was there when J was kicked out. I will file divorce, no chance I'm taking him back.\n\nGood. Your husband sounds like a sociopath and a terrible person. I'm glad you got to see who he really was early on.",
            "You're a good person, and I think you're doing the right thing. Thanks for not just letting this slip under the rug.",
            "I wish the best for J and I hope you are able to pick your life back up as all this mess settles. ",
            "If I'm not mistaken, there was a high profile case of a mother who took in a couple kids for the summer who forced her kids to torture them.  \nSounds a lot like what could have happened in this situation.",
            "WTF. Get a divorce like yesterday.",
            "When I was a kid until middle school I used to be bullied in school by other kids, since a few years ago I promised to myself that every time I see some kind of abuse I will intervene no matter what. \n\nI wish I had met someone like you when I was smaller...\n\n\nI feel a lot of respect for you and what you are doing, you are a great person and an awesome human being for standing up for him. Good luck and I wish you the best",
            "OP, you are a *damn* good person and I am so elated compassionate people like you exist. Here's to hoping for the best, for you and J.",
            "Yea, you do NOT want to have children with that man.\n",
            "Thank you for standing up for him. ",
            "Today you restored a little bit of my faith in humanity. ",
            "his true colors, damn, you are very brave. ",
            "Well that's fucked up.",
            "i honestly think J in a few years would have gone mad,killed many people and committed suicide. Blamed, accused when he was also a victim who took the worst part. You are not only saving him, you may be saving many people. ",
            "There are no words. Just..wow. I need to take a break from this sub, I keep forgetting how fucked up, people can be. Good on you, for sticking up for J. OP you're good people.",
            "I have no advice but thank you for your actions.",
            "You are good people, OP. Someone make this a bestof.",
            "You're not overreacting. You're entirely correct. He is not the man you thought he was.\n\nOn the other hand...and jesus, it's a long fucking way to the other hand...\n\nHe was raised by fucking INSANE people, who have brainwashed him in the best kind of way, when he was an actual child. I would wager bad shit happened before J was ever born, and possibly to your husband. He has been BUILT from the GROUND UP to normalize this abuse and propagate it. He can BARELY realize how fucking monstrous it is now, which is probably why he told you what he did. He's not in a place yet to begin to process how fucked up he is, or begin any process of healing or improvement. Until he admits to himself that he is an abuser, and seeks SERIOUS professional help, he should be a no go for you. He needs deprogramming super bad. \n\nFurthermore, you and your parents are absolutely fucking heroes for helping J as you are. Please, no matter how hard it gets or how much time, please be there for J. He needs someone, and you're probably the first person whose ever known the extent of what has happened to him. Take it slow, with patience, and support him as much as you can.\n\nAs for justice, or at least restitution; I'm no lawyer or cop, but the ones who said there's likely little satisfaction to be had, are probably right. He's an adult now, he'd have to face them in court if it ever got that far, they'll all turtle up to protect themselves and each other. I burn for justice and want to see the lot of them hanged for this, but we don't live in a world where that's likely to happen. And again, the mother was abused by the father, and he probably abused the other kids too, and she indoctrinated them all to abuse J. There is a sickness in them, and it has gotten down to the bone, and probably shapes a large part of who they are as adults now. Like a dog, they weren't born bad, they were raised bad, which unfortunately, makes them bad now. It's not an excuse, but it's the reason they're the way they are.",
            "> since that night three weeks ago I have been unable to be affectionate in any way towards my husband. It's like I went from totally in love, the totally repulsed by him.\n\nyou probably never were really in love with him in the first place. Yours were honest feelings of affection and care but it appears you did not have enough time to truly get to know your husband and his family enough. Nonetheless it is admirable of you to take care of such person in need of protection and a welcoming family like yours.\n\nBest of things.",
            "His participation PLUS his lack of remorse PLUS his dismissing the problems the abuse caused J, is despicable.  It sounds like the mom has a particularly disturbing level of control over her kids, which might help explain his participation when he was younger, but at a certain age YOU are responsible for doing the right thing, and he hasn't.\n\nI'm glad to hear you're divorcing him.  He doesn't sound interested in getting therapy, apologizing to J, or confronting his mom and siblings, but even if he did ALL that, it's reasonable for you to feel repulsed. And his continuing contact with a toxic family makes it clear you are safer (emotionally if nothing else) staying far, far away.\n\nYou and your parents sound like great people and are doing a noble thing by supporting J in his attempts to build a life.  Thank you. ",
            "Victims, aren't they all?",
            "Regardless, your intentions were pure and needed in my opinion! Respectfully (talking to you like a friend) If your his wife, those fuckers are your family too so it is your business. You have a bond with J, so like any loving family member you protected him the best you knew how. Coming from a wife with a crazy husband and family,... Think about it... Your husband has deep deep roots from what it sounds like of brain washing abuse himself. Just because he does something that makes you look at him different, doesn't mean he is that guy. I agree he needs to get his head out of his ass and rationalize how fucked up it was for his actions but I don't think he IS that man. I'm only reading a paragraph of your life but if you were in love before and protective of J as you are, find it in yourself that your hubby just might need some \"saving\" too. Either way take care of yourself and my heart goes out to you for your courageous jump into a very dark place. X",
            "I'm just gonna say that you seem like a good human being OP. World needs more people who aren't afraid of standing up for others and speaking their mind.\n\nNot much else to say since I'm sure all other needed stuff has alredy been said.",
            "This almost sounds like *The Child Called It*\nThere is some serious craziness in his family. ",
            "You're J's hero, OP. I'm so touched by this whole story and what you and your parents are doing. Don't be ashamed of your marriage...you didn't know what was really going on. Don't think of \"should haves\" or \"could haves.\" You're doing what you feel is right NOW. And you can rest your head at night knowing you are an incredible, strong, selfless person. ",
            "Thank you for doing everything you can for the boy. He shakes because hes nervous from beatings.\n\nAfter I got kicked out for getting mad about being beat by a garden hose my friends parents took me in for a month, its all I needed to get on my feet. J has had it worse, he will need more time. Thank you for being an angel to this young man. ",
            "J is very lucky to have you in his life. I'm sorry that you're discovering your husband and his families disgusting nature now, but I fully believe that you are justified in your reaction. If you and your husband ever reconcile, I'd say a condition of that should be counseling/therapy and a full apology for all of the terrible things he did to J. ",
            "There are lot of comments, I will just say that OP is doing the right thing.\n\nWhat happens if your husband tries to abuse your future son?\nOr you? Are you going to let his family be around your grandparents?\n\nYou probably didn't help J by making a scene, but your reaction was correct. Helping him stand up for himself is probably the best way to help him.\n\nReally, it sounds like he needs some seriously therapy and counseling.\n\n\n",
            "Wow. Sounds like a pretty fucked up family.",
            "Good on you OP. It's nice to know that some people out there still have morals and compassion - poor J didn't ask for any of this.\n\nYour husband sounds like a self entitled prick. He also needs therapy for whatever his mother put him through.\n\nGood riddance to him - people who do that kind of shit don't change their colours.\n\nIf J wants to talk, listen, but don't prod him for answers and certainly don't bring up past events again (it could serve as a trigger)\n\nYour parents sound like truly amazing, compassionate people. A stabilising influence in J's life will truly work wonders. Given time he will blossom and become a new person, and that shitty excuse for a family will be a memory. Tell him he should also consider speaking to the police or a lawyer - to me it sounds like these are the sort of people who would reek revenge.\n\nAnd hi five for giving that bitch mother a mouthful! ^5",
            "Good for you for doing what you did and what you are doing. You are strong!!!",
            "Good for standing against the crowd and being passionate about something. You asked if you were overreacting by kicking your husband out... That's hard to say. It's subjective-- but I do think you should consider that J was probably not the only \"victim\" of his father. The other siblings, and probably your MIL also were subjected by him. Just in a different way. Young people are impressionable, and the other kids likely fell in line doing what they were lead to do... Which is awful, and wrong, and bad-- but they probably couldn't see that at the time. Once that behaviors becomes the 'norm' there's no longer a right and a wrong. A MUCH more extreme example of this situation are the children who are born and raised being force fed anti-Western propaganda and eventually taking up arms against something that they don't really understand. My advice would be to step in and try to educate your husband. Crack that shell. Break it down hard... And once he can see the wrong in what he was led to be a part of and eventually came to know as \"normal\", he will come to understand the devastatingly negative affects of those actions.",
            "You sure you aren't confusing your life with The Gift? But in all seriousness the fact that he refuses to apologies is a huge red flag it is one thing to do that as a kid, since a lot of times you aren't really aware of what you are doing at that age. But to be aware and still not apologies is awful.",
            "just wondering was your husband abused by your MIL as well? or threatened? because it could be that he's just completely brainswashed",
            "Continue reaching out to friend but understand the extreme importance in not only turning to the advice of a close friend, but also enlisted the aid of other professionals who specialize in situations like your own. What you know is the right thing to do is often separate from the correct way to be constructive.\n\nThe most important lesson to possibly learn from this ordeal is to never be complacent if someone you know is actively committing violence, even like the post-secondary violence your husband committed. We all want to be liked, to have approval, to not rock the boat and to foster new friendships. But if you choose to do nothing in the face of the mistreatment of others as you look on, then you slowly immerse yourself into the dysfunction that goes on behind closed doors.\n\nWhenever something bad happens, *always* question how complete strangers would react if they witnessed that demeaning insult, or that minimization of horrific violence.",
            "Im amazed J didnt die. There has to be some sexual component to this too since they didnt kill him. ",
            "I know I'm late to the party but you're making a good move here. At a glance, I was against you. I thought, \"How could you leave him over stuff involving his family? What's it got to do with him?\" and then I read the rest. I'm sure that with the right kind of help, your soon to be ex could become a good person. However, based on your story, he would never consider that an option because he doesn't believe he's done anything wrong. Even now, he's nonchalant about it. In the process, there's a teenager turned adult who might have some real world issues as a result.  \n  \nYou need to stay far away from these people. They're dangerous.  \n  \nI may be speculating and even fear mongering but it's true. This is sociopathic behaviour, among other things. There's not one spec of regret or remorse. For all we know, they enjoyed it. You wouldn't be safe with him if he ever lost his temper and neither would the children you have with him. Plus, he'll clearly take his family's side over yours regardless of whether it's right or not. I assume they would support him in the same fashion, even if he did some seriously bad shit to you.  \n  \nHelp his brother. Get him out of that. Let him know that you won't replace a parent, won't take care of him directly, but you'll support him and help him get his shit together and be his friend. He's on the downslope of this now but it's still a rocky terrain. He'll need a place to vent. Be sure you're ready for that before committing to it.  \n  \nYour instincts are bang on and you should go with them.",
            "I read in relationship spineless OP's all the time who try to justify the shittest behavior. Honestly you have an iron will OP kudos. ",
            "You need to leave, this sounds crazy. And if they do it to this guy, they could do it to someone else.",
            "This will probably get buried but I'm so proud of you. It takes balls to stand up for J, most people wouldn't do that. You're courageous and I hope J will heal from this mentally. ",
            "So you are doing a lot of good things, but there are some realities to accept.\n\nNo matter how much good you do for J, it's not going to go as well or as quickly as even your lowest expectations.\n\nHe probably doesn't have a functional model for a loving nurturing relationship in his mind yet, he might react in odd ways to you and your families help because he won't understand things you take for granted. He's going to feel a lot of weird emotions that he will have no idea what to do with, they might manifest in weird ways. There are therapists who specialize in PTSD from childhood trauma and this would be a good place to start if you can get him away from his family. \n\nAs for your husband... Yes he is bad. Yes he participated in abuse, but he was raised in an unhealthy environment with his parents and family normalizing and reinforcing this behavior. Obviously he should have known better, but this became normal for him when he was just a kid himself.\n\nIt could be that at 29 he's an old dog and won't change his ways, but he deserves a chance to see the error of his ways and make amens.\n\nIt wouldn't be ridiculous to offer an ultimatum where he has to talk to some professionals and get some perspective on what was going on. It's not impossible that he could become an ally to J with your help. Of course this means accepting that you're the villain in your story, which you could imagine is hard. \n\nJ is absolutely the primary victim here, but your husband was too. Everyone here who puts themselves in your husbands shoes is going to pretend that they alone would have been the voice of reason, but the truth is a lot of people would have done just the same because that's how it works when you are a kid.\n\nOne last thing... The narrative your husband gave you is one he pieced together as a child when he interpreted the words and actions of crazy people. The details are probably accurate in spirit, but again there was probably a lot of ret-conning and shoehorning to come up with a story that made sense of crazy people's behavior.\n\nGood luck OP. You're doing a good thing, don't forget to get professionals involved because this is way above your pay grade. \n\n",
            "Wow, I feel bad for J.  Your husband is an asshole and was probably abused as well by his prick father.  I'd have a hard time living with someone if I knew they did that to a child.",
            "If he'd do that to his brother, its not a far cry from doing that to your children.",
            "OMG, could you imagine if you were both brunettes and had a blond haired son.  This could be your child if your husband ever thought that the child wasn't his...\n\nI hope J is able to move forward and accepts your family's help.  You and your Parents are amazing to be able to step in so quickly!",
            "I am sorry for the fuckery that you are going through with your soon to be ex husband ( he sounds like a total trash especially after pretending he doesnt know y j was kicked out, along with the regular beatings he doled out) and his trashy family.\n\nBig love and props to your family for taking in J and giving him the life he deserves to live.\n\nI think maybe try marriage counselling and see if that works, if not, then at least you will have no regrets in the future , but be warned a guy like that is serious mental damaged goods ( your soon to be ex) since he had no qualms being 20 beating the shit out of a 10 year old..... if he ever becomes a father, the shit will hit the fan.",
            "That poor kid. You may think that it made a situation worse, but this could be the break J needed to get out of a really bad situation.  Just because they don't physically beat him anymore doesn't mean he isn't emotionally or psychologically abused by these people which is basically what you witnessed in your own home. \n\nHealthy people with healthy family dynamics don't bitch at their son for \"shaking to much\" (obviously something he can't control). Normal people would ask if he was okay, have him sit down and relax, or offer to help. \n\nI am not sure how else you could have handled that information.  That is a big bomb to process, and they don't even realize or empathize with how this young man feels and that is almost as bad as the abuse itself. \n\nI hope that while he is hanging out with your parents and building a better life he is able to get therapy for everything he has gone through and everything he is going through right now. His whole world has been flipped upside down. Even though it was horrible what he went through, that was his version of normal. I hope that he has a wonderful future full of opportunities because someone finally saw him as a hurt little boy which he has desperately needed his whole life. \n\nAs far as your husband, I don't really think you ever reacted, but that is a matter of opinion. A lot of people are capable of doing terrible things in their lifetime. Just because he has gotten over it does not mean anyone else has to. Forgiveness is given, never assumed. It is your choice whether or not you ever decide to. ",
            "Food for thought: if he was a kid at the time the abuse occurred, he was taught that was what he should do. He was basically coerced into by his mother. If it stopped and if he isnt abusing anyone now- can you hold childhood actions over him now?\n\nThere are a number of books on the subject. Family stuff is super complicated...I would be wary of basing a divorce over his actions while he was under the control of another.\n\nBut, my math could be off and I could be wrong. There could be more to the story. This is reddit.\n",
            "So did your husband participate in the abuse as an adult or as a child?",
            "> I know my kids will be fine. \n\nWait, do you two have children together?",
            "On one hand your husband is the product of his environment.  On the other what happened in this family is so deeply fucked up that I would help pack your bags of you decided to leave.  Sure you shouldn't have brought up the abuse at the cookout but the fact that your husband, knowing what he knows now, didn't intervene on J's behalf shows you that he doesn't think what he and his family did was wrong.  I would not want to stay married to a person that had such an ingrained loathing  of another human being.  It's like J isn't even a person to these people.  Smh",
            "Just my two cents here: call the lawyer before you make any moves involving law enforcement. I can't really think of anything that could happen besides the family fucking with your property but just in case I think that would be the safest route. \n\nSide note: your a phenomenal person OP. Not only have you helped J but you've helped myself as well. I was never really abused I'm just a little off in the head. I don't think like most people I'm just not your average 20 year old I guess. But I do know what it can feel like feeling as though there isn't anywhere to turn probably just like j does. Your post tugged on my feels and really got me to thinking about how I could help. I may not be able to help your situation but that doesn't mean I won't encounter a similar scenario down the road. It was clear you acted fast but were uneasy and I would be too but just the results help me understand what I would do too. I just want to see people smile, the genuine smile not the kind you pose for a picture. I think taking on J will be an immensely long journey for you and your family but I have no doubts it will be rewarding and of all people you can handle it. If there is anything I could do please feel free to PM me. Even if it's money got tight I think I speak for all of us when I say, we would be more than happy to help.",
            "Damn",
            "Marry J and beat your husband.\n\nIts the Hollywood way of doing things.",
            "I thought this was going to be another \"psycho bitch angry at husband for kissing his dying ex\" story. I'm glad it's not. I have no \"advice\" and can't even imagine what the right thing to do is. What I do know is that you're a damn awesome woman. To feel so passionate about this kid that you are repulsed by your husband's inexcusable actions and incapability for knowing he did wrong, is just massively impressive. You are definitely walking your talk. \n\nGood job. Good luck.\n\n....I do suggest though, for whatever it's worth, to reconsider keeping your husband if he and his family acknowledge their cruel acts, apologize and admit they were wrong. Otherwise....fuck 'em!",
            "I think by now everyone's pretty much convinced you that no, you're not overreacting and that entire family sans J are complete pieces of shit.\n\nGood luck, and I hope J cuts off contact with them and accepts your help.  ",
            "You are doing the best thing by divorcing your husband and his disgusting family, and you are an awesome person by helping J",
            "This reminds me of a book titled A Child Called It. If you are looking for some perspective on what J may be feeling and experiencing then I recommend reading it even though the descriptions of abuse are heartbreaking. Reading it when I was younger was the reason I got into my field in education so I can help these kids. ",
            "I'm just sitting here thinking how horrible the abuse must have been in order for a person to divorce someone that they have kids with. It must have been really bad. \n\nI really wanted to know what happened, but now I don't think I want to anymore.\n\nPoor J. Hopefully he willingly accepts your help. Your parents are super awesome for wanting to help and get him out of there. It's interesting hearing about how horrible some people are, followed by hearing about how genuinly great some people can be.",
            "OP, words can't describe how grateful I am for people like you.",
            "Just wanted to say how proud I am of you for what you did, in standing up for J.  You're an amazing woman.  If you had kids, I would be worried that your husband may inflict similar behaviours on them because that's what he learned was proper.  Definitely time to get out before that damage is done.",
            "OP did the right thing.   Husband is and will be a sadistic husband and father.",
            "You are a beautiful human being. I hope you get through this and I hope J gets the help he needs.",
            "Yup, I'd peace the hell out.  You're talking EXTREME Character flaw, to do nothing, let alone contribute.  This is a sick family.\n\nOf course it's easy for a stranger to recommend peacing out.  But behavior like this, this messed up is learned, remembered, and passed along.  \n\nJust saying, that in a case like this, where the abuse was so widespread and twisted?  Complacency is just inexcusable and honestly scary. \n\nI don't think you're over reacting, and I think that removing this family from your life is the only safe course of action.  That's a lot of twisted folks.",
            "Stanford prison experiment ",
            "You are strong. I'm glad there are people like you out there.",
            "The world has hope because of people like you and your family (your Mom and Dad) I have great respect for you. God bless you.",
            "Is hubby and family American? I don't know why I ask this but just curious if there was some cultural vibe here -East European or something. The pride and obstinance reminds me of some People I know.",
            "Yes. ",
            "So, this is probably ignorant of me to say, but the unrepentant bastards who cause suffering like this in the world can't be reformed, taught, or changed. To refuse to apologize to someone who they've tormented so, it's like admitting defeat. Or something. Like it's a point of pride for them to never admit being wrong. IMO, people like that would benefit from having their *********** ripped out with pliers, their ***** cut off, their ****** ripped out, and then being **** in the head. Censored for dramatic retribution.",
            "You're a good person. This world needs more compassionate people like you. \n\n/hug",
            "I'm a victim of child abuse too. I really applaud you, OP, for supporting J like this and taking a stand. I wish someone had for me.  Thank you, it's like you're standing up for me too, further affirming that what happened to me what unacceptable. ",
            "Omg that was horrid to read....\n\n\nI think this will forever leave a mark inside me to wonder if the person I'm dating has done something similar to anyone.\n\nI'm so sorry that you had to go through this.\n\nThe way your husband had no remorse is shocking and haunting.\n\nPlease do divorce him, you have no idea how he will turn out one day, what if he gets suspicious of you? What will he do to your kids?\n\nJ needs help.\n\nJ needs a lot of help.\n\nI hope you can help him in someway, legally adopting him and get him psychologists, but this will be unfair on you.\n\nOh Jesus "
        ]
    }
]