[
    {
        "post_id": "3h37bz",
        "author": "mybfuckedmymum",
        "title": "[24F] My BF [25M] of 3 years cheated on me with my mum [52F]",
        "url": "https://www.reddit.com/r/relationships/comments/3h37bz/24f_my_bf_25m_of_3_years_cheated_on_me_with_my/",
        "score": 3206,
        "num_comments": 330,
        "created_utc": 1439640255.0,
        "selftext": "I'm sorry if this is jumbled, I'm on my phone and in total shock right now.\n\nI'm an only child that was bought up by my mum alone (my dad left before I was born). I love (well, loved) my mum to bits, she's done so much for me and sacrificed everything so I could have a good education and a happy life. I met my boyfriend when we were in university. We're both each other's first everything - first kiss, first sexual experience, first relationship. I love (again; well, loved) him with all my heart. I truly believed we would be together forever. We moved in together two years ago and our relationship has been practically perfect since then. We never fight, and he makes me feel like a princess everytime I'm with him.\n\nThis morning he woke up and went to have a shower. He left his phone on the bedside table, and when it vibrated I simply picked it up to check what the notifcation was for (I wasn't snooping, it was just habit to check it out when the sound went off). I honestly did not believe what I was reading. It was a text from MY mum saying something along the lines of: \"I hope your morning wood is as good as your afternoon wood ;).\" Obviously I freaked out and went into his phone (I know his pin code). They had been basically sexting for around a fortnight. Pics, stories of what they'd \"do to each other\", and worst of all reflection on an afternoon they spent together. I honestly can't remember what the texts specifically said, once I read them I locked his phone and bolted downstairs into our other bathroom. I pretty much just sat in the shower and sobbed until he left for work. Once he did, I threw on some clothes, grabbed my phone, purse, etc, and drove to a quiet nearby park - which is where I am now bawling my eyes out.\n\nI have no idea what to do. These were the two most important people in my life. I have pretty much no friends here. All of my extended family live overseas. I'm so heartbroken. Please help me.\n\ntl;dr - found texts that suggested my bf had sex with my own mum, i dont know what to do now\n\n",
        "permalink": "/r/relationships/comments/3h37bz/24f_my_bf_25m_of_3_years_cheated_on_me_with_my/",
        "comments": [
            "You're in horrible shock, and rightly so. The two people in the world that were supposed to love and protect you didn't. They betrayed you in the worst possible way.  \n\nYou said in a reply to someone in this thread that you don't think you can survive without them.  YES YOU CAN. Get mad, get angry, get _furious_. And then get moving. Can you afford to live in your flat without your bf? If so, pack up all his stuff and kick him out. If not, find somewhere else to live, with a friend, a classmate, a cousin, whatever.\n\nCut him out of your life entirely. Block his number, don't answer the door, delete his emails. There is NOTHING he can say that would make fucking your mom acceptable. Don't let him try to rationalize it or make excuses. Don't let him manipulate you into staying with him. He's a loser, a liar and a cheat. \n\nMaybe, _maybe_ you can decide to go forth with a relationship with your mom, although it will be drastically different of course. I suggest taking some time to get a clear head before you even think about interacting with her.  I would ignore her calls and texts for however long it takes you to feel ready to deal with her, whether that be days, weeks or months. This will be the hardest part because she's your mom and you love her. But you need to take time to really think about what's happened and get right in your own head. Maybe you can decide to talk to her again, maybe not. Whatever you decide is right for you. \n\nMost of all, take care of yourself. I am so sorry this has happened to you.  I wish you strength to get through this.",
            "As another person commented, get verification that the person who texted your bf was in fact your mother. If it is, the situation is worse than some other random woman.\n\nIf you think you cannot survive without them, you're in for a lot of trouble. Who's to say they don't continue a relationship or start up again in the future? \n\nYour mother is supposed to be your rock, your guide, your supporter; not the person who bangs your bf. If it is in fact your mother, I would be utterly devastated of her betrayal more than your bf. Cut these two OUT of your life. It's toxic, and frankly you deserve better. \n\nYou CAN do it. It will be hard, if not one of the hardest things you ever do. However, you will never trust these people again. Imagine marrying this guy with your mother sitting in a pew knowing they were together? Yeah, that's some Jerry Springer nightmare. ",
            "That is fucking insane.\n\nYou need to dump your boyfriend and seriously consider whether you want your mother in your life at all anymore. This is seriously fucked up there's not much in the way of advice anyone can give you. Good luck.",
            "A friend of mine had this happen to her. Only thing is that her bf not only had sex with her mom but with her sister too. So, if you have any questions I can relay them to her. I'm not sure what, if any, questions you'd have but anyway. I'm so sorry this happened to you.",
            "If this is true, then cut both of these people out of your life. ",
            "Please find another family member or friend to go stay with for a few days/week. Take a few days no contact to wrap your head around this and come up with a plan of action.\n\n\nYour boyfriend crossed a line that should never be crossed, he is not somebody deserving of your trust.\n\n\nNot only did he sleep with her, he is currently continuing the affair. They have been doing this long enough to have considered your feelings on the matter and who knows how long they would continue if you hadn't found those messages!!\n\n\nTalk to them about it once you've had time to compose your thoughts, get your questions answered and take time to reflect. But honestly they've beyond fucked up.\n\n\nI'm an only child of a single mum too and just trying to imagine this is fucking horrific. That level of betrayal is just unforgivable, I think you should talk to a professional regarding moving past this. \n\n\nIn your situation I'd be fucking out of there the first chance I got and not looking back.",
            "You need to dump these two from your life, disgusting, disrespectful, garbage human beings. How horrible and horrendous. I'm so sorry you have to go through this at all. Pack your crap, and go. Honestly, if possible, I'd be gone before that piece of garbage gets back from work. ",
            "He's your first everything, even first breakup. You will survive this and find someone better",
            "I'm so sorry, that's so effed up and beyond.. Think you can give any of your family a call? You really need somebody to lean on and talk to. I would want to talk to your mom to understand what the fuck is going on in her head. :(",
            "This is honestly one of saddest things I've read on sub. You had two people you love most in this world send you a rather harsh message. They don't love you. \n\nThese two people are betraying you in the one way they know 100% it's going to cause the most chaos in your life and cause immense pain and they are both doing it without even the slightest sense of guilt. \n\nYour mother has raised you for 24 years to wind up being so fucking narcissistic she'd do this. \n\nPlease don't attempt to just jump back into a relationship with your mum. You seem desperate to forgive her which makes me wonder what kind of asshole parent she is that she's conditioned you to think she's that important in your life there's no limits to acceptable behaviour. \n\nDon't, talk to them just yet. A month, 3 months. Talking to a lamppost would probably be healthier then whatever these two have to say. \n",
            "This is not your fault. This is NOT your fault. This is NOT YOUR FAULT. \n\nNow that we're clear on that, I need to tell you something I read here once: the pain you feel right now is the most intense cognitive dissonance you will ever feel. It is a result of finding out that two people you loved, and thought loved you in return, didn't love you at all. You're mourning the loss of two people you thought existed. They haven't existed in a long time. \n\nWhen they chose to get together they killed the people you love. The people who will try to apologize, try to convince you they care about you, they're lying - the people who cared about you are dead. As soon as you realize this you will be able to start moving on.\n\nIt will be SO hard not to believe these monsters who look so much like the people you loved, but you have to believe me. They are gone. Mourn them, cherish what you had, but don't have any illusions about the fact that they are gone now. \n\nI wish you nothing but love OP, good luck.",
            "[deleted]",
            "This may sound like a stupid question, but are you sure it was really your mum? And not someone else that he put the number as your mum? ",
            "Are you 100% sure it's your mum? It could be another number saved under your mom's name to allay suspicion.",
            "Okay. You have said that you still want these people in your life. How do you expect that to work? Do you pretend you never saw the texts and don't know anything? Do you confront your bf and tell him to cut it out with this other woman?\n\nExcept this other woman isn't a stranger, or a friend, or an acquaintance from a party. This other woman is your mother, and what they have done is so disrespectful and hurtful to you that this completely negates *anything* they have ever done for you to be nice. \n\nNo self-respecting woman would sleep with her daughters live-in boyfriend *while they were still together*, this woman does not respect you, and she did not care about your feelings when they were carrying this out and all the times they were sexting. Same goes for your boyfriend, of all the people he could cheat on you with, he cheated on you with *literally the closest person to you*. He is disgusting, they are both liars, he is a cheat, and he completely disregarded your feelings. \n\nTrust me OP, there is no scenario where you want these people still in your life. You CAN and WILL survive cutting them out. \n\nDo you have a friends you can go to for a few days? If so I advise you pack a bag with all your valuables, documents you need, and passport, and some clothes, and leave and go. You should be angry about this, you should be so furious that these two people could do this to you that you never want to see them again. Go to a friends, or even get a hotel room if you can afford it, start looking for flats you can live in or room shares or something because trust me, you will never be happy in a relationship where the guy has fucked your mum and consistently sexted her for weeks, and you will never be happy with your mum again either. ",
            "Isn't it more likely that the \"mom\" contact name is simply fake?",
            "I am so sorry to hear that your boyfriend and mother would behave in such a horrific way. \nPlease please keep telling yourself that this is not a reflection of you. I think many times, people in breakups blame themselves and think they must have done something to bring it on. Nothing about you, nothing you could have done would justify their selfish and stunningly hurtful behavior. \n\nConsider setting up an appointment with a professional counselor to get some support  in coping with this. \n\nI think it's okay to mourn the loss of the people you thought they were. It is basically like the people you thought you knew are dead now. However, please know that even though they turned out to be such awful people, you can create a new Chosen Family for yourself of people who do truly care about you and have your best interests at heart. \n\nLots of love to you. Please keep posting here so we know how you are doing. I know a lot of us are concerned about you. ",
            "Whatever you do for the next few days, please try to make sure you take care of yourself and your body. Eat well, try to sleep enough, exercise if you like in a way that makes you feel good, etc. This is hard enough without making enemies of your body, and it'll give you something productive to think about.",
            "Are you *100% sure* it was your mom? He could've put someone else's number in there under her name so you wouldn't get suspicious. Did you check the number?",
            "I can't really say anything other than \"what the actual fuck.\" \n\nDump the boyfriend and uh...yeah. Wow. ",
            "Once you've got a relatively long term place to stay you really need to speak to a professional. This is level of trauma is going to stick with you for a long time. You need to find someone to talk to that will make you feel safe and can give you professional level advice. Reddit is fine and good, there has been some good advice here, but PLEASE see a therapist. ",
            "Seriously where do you live. If you live anywhere near me I'm offering you a bed and a room. My fiance and I have it and lend it out to people in need. We have people crash here all the time ",
            "It is completely normal to be in complete shock. What you need to do is to go somewhere safe and quiet and have a think about the entire situation and acknowledge your feelings. After that, get into (or try to) a rational frame of mind and think about what they have done and what your next steps are going to be. \n\n\nI would recommend that you stay with a friend rather than alone in a motel, so that there is someone to take care of you and offer you emotional support at this time. If you have no friends, go to the nearest church and seek out a pastor/nun/church worker. (Not favouring a particular religion, but my point is to go somewhere where there is someone available to hear your story and give you some form of emotional support). Emotional support from a friend is especially important now because the 2 people you depended most on for emotional support has betrayed you in such a horrific manner. You're probably feeling alone and abandoned. So go seek support from a friend. With that temporary pillar of emotional support you will be able to calm down and clear your mind more effectively and think about what you should be doing. \n\n\nYou have said that your bf and your mum are the 2 most important people in your life. I am assuming the first thing in your mind is \"how do I fix this?\" In this situation there is no way both the relationship with your bf and your relationship with your mum can be repaired. You have to choose one or the other to salvage, or else the past will forever haunt and affect the dynamic between the three of you. Another option is to not choose any relationship to salvage and cut ties with both your mother and bf, which is completely reasonable given the extent of this betrayal.\n\n\nI'm so sorry this happened to you OP. Sending virtual hugs your way. Please keep us updated. ",
            "As someone who is super close to her mom, this is heartbreaking. I'm so sorry you're going through this. I don't think I'd be able to have a relationship with either of them after this. This is such a huge breach of trust, and there's no gray area here. What they did is incredibly fucked up. If I were you, I'd call someone who will let you stay with them, go no contact with both of them, and get an appointment with a therapist as soon as possible! \n\nGood luck! You can do this. You don't need people who do things like this in your life.\n",
            "I don't know if you live anywhere near Pennsylvania but you are welcome to crash with me until you get back on your feet! I am 100% serious! I'm a 20 yr old girl and minimally creepy!",
            "Confront them and let them explain, and then if it's all what it seems to be, explain that you can't have them in your life anymore, and start trying to move on. ",
            "Just remember that you're the one who's right and normal.  Don't accept any blame for the sick weirdos and their betrayal.",
            "I just can't understand how a mother did this to her own child. What in the actual fuck? ",
            "Whatever you do right now cut these two people out of your life, even if it wasn't your mom your boyfriend was cheating, there's no doubt about that at all, kick him out of your life forever.\n\nYour mom will try to manipulate to don't cut her out of your life, tell her:\n\n\"If you care for me at all don't talk to me, put yourself in my shoes imagine the two people you loved the most hurt you like this and even then you wouldn't be quite close because still is not happening to you, don't call me, don't contact me, I can't and I won't think of how you feel right now, if you care for me let me heal.\"\n\nI wish you all the best op and I send you a big hug from here.",
            "I am so sorry.  That is really the shittiest thing ever.  Time to cut them both out.  I would never forgive either of them.",
            "Your BF is awful dump him and never think of him again. He isn't worth the orgasim his dad had. \nYour mother..... What kind of mother would do this? I honestly believe she is capable of much worse and should probably be cut from life. Maybe treat her like an aunt. See her in Holidays and that's it. I wouldn't spend anymore time with her. What a horrible woman.",
            "That's one of the most dreadful things I've ever heard. \n\nIt's probably too late as you posted this 5 hours ago, but I think you should start by changing the locks on the apartment and tossing his stuff out the window. \n\nOn second thought, it might be better to get a room where neither he nor your \"mom\" know where you are. And like others have said, therapy would be wise, because this is an honest-to-Betsy big trauma likely to leave emotional scars.",
            "I'm not as forgiving towards your mom as some on here. Sorry but I would hold her to a higher standard then just a boyfriend. \nI'd cut them both out of your life. How could she ever think she could redeem herself after betraying you like this. \nGet out of there and leave them both a message to stay away from you. \nI could sooner forgive an ex then I could my mom. ",
            "Yeah this has to be a punch in the gut. I'm sorry you have to go through this gal. I'm sorry that you had your mom do this to you, Can you call a friend/acquaintance and stay with them for some time? If not can you think about moving to some other place - a small hotel until you can get lodgings. You need time away from your bf and mum. I know it pains like a bitch right now and it will for some time, but you will need to cut these people out of your life. ",
            "This absolutely gut-wrenching and you have all the right to feel like you do. However, don't let that feeling stay for too long. You need to take care of yourself and get to a safe place. Your bf will start calling you when he sees you're not home. Don't answer for a while. Sent him a text just stating \"I need to be alone for a while, don't contact me until I contact you\". You need time to think before you confront him. He'll probably call your mom and she'll start calling you too. Proceed the same way. Don't let her know yet that you know how despicable she is. \n\nOnce you've gathered your thoughts and cried all you need to cry talk to them. Let them know you know what happened and that you don't want either of them in your life. Your bf forever, your mom for a really really long time, that time will depend on how she reacts to you telling her how much she hurt you. \n\nIn very sorry this happened to you. <internet hug> ",
            "I'm echoing some other advice here, but get angry. Be hurt, sad, betrayed and upset, but more than that, get angry. Being angry will fuel you to do what's best for yourself right now. Anger will keep you from caving of he wants you to stay, it's what will help carry you through the worst parts of the heartbreak. Don't be mad forever, but you deserve to be mad right now. I'd go so far as to say being angry is necessary right now.",
            "Fuck both of them! Cut contact. ",
            "This is disgusting and you don't deserve this. Two people who are supposed to care about you (one being the lady who is supposed to love you more than anything) betrayed you in the most hateful way. They are cancer. They will eat away at you unless you cut them out. Im so sorry this happened. It's truly a despicable thing that I cannot even wrap my head around. ",
            "You need to update on this. This is horrible. Find out if it really was your mother. Some people use different names on their cells to hide calls from they're getting and make things look \"normal\" to others. \n\nI hope you're alright. You do need to investigate.",
            "Sounds like one for the Jeremy Kyle Show :/, really a nightmarish situation and I'm very sorry OP. Obviously the sexting is bad enough but if he's cheated too time to jettison that baggage, is there anyone else you can turn to? Really solid friends to help you this situation? ",
            "You're strong, and obviously a better person than they are. You will grow from this. In the end, this will be the day that everything in your life became better, not worse. \n\nYou're leaving a horrible person behind.\n\n",
            "Damn this is the saddest thing I've read in a while. I'm not even sure who you should be more mad at in this situation. ",
            "Cut them both. They are toxic. \n\nGood luck, friend.",
            "cut those toxic people out of your life, you do not need them. You will feel hurt, you will feel weak. BUT when you recover you will be more strong, independant and happy again.",
            "All I can suggest right now if leaving him and doing things for yourself. \n\nI just started a book called its called a break up because it's broken. (Buy it if you) You just need to keep repeating that. A relationship can only work if both people are in it. If one person is then you are wasting time yo could be spending on yourself or someone else. You are number one. \n\nThere's a quote I've highlighted in it:\n\nEvery moment of pain, weakness, and discomfort puts you in a position to choose how you will react and how you will alleviate your condition. Calling him doesn’t make it better—it only pulls you back into the cycle of heartbreak. He is the past. You are the future.",
            "With family like that, you don't need enemies.=( \n\nSorry OP this is a shit situation",
            "Has your mom been shitty and self-absorbed at all in the past? ",
            "Is there any way to check your mom's phone?",
            "I can't offer an advice that hasn't already been said.\nBut I wish you luck. Stay strong. I can't believe your mom done this to you. You seem to have such a strong bond and that should be stronger than anything else in the world. \nYou feel the worst now naturally but just keep moving. Literally, metaphorically, whatever. One foot in front of the other. Time heals. Or at least eases the pain.\nI'd like it if you kept us updated so we know that you're ok. ❤️ :)",
            "I'm going to agree with several of the comments that the number actually isn't your mom, but it's saved that way in his phone to hide who he really is screwing.",
            "Fuck his Dad.",
            "You have a lot more strength then I do because I wouldve went ballistic the second I seen those texts.\n\nIm sorry I have no good advice but im sure you already know you need to throw these people out of your life.\nSorry but your mother sounds like trash and your NOW ex is a pos and you deserve better people to surround yourself with. Spend as much time as you can with friends.\n\nPlease keep us updated.",
            "thats fucking horrible, cut your bf out of your life entirely, and as for you mom, do what you want. if it were me, i would guilt/blackmail her into doing whatever i wanted for the rest of my life. but its your call. the one thing to remember is this: \n\nDo not forgive her. ",
            "Just to be sure, are you absolutely sure it's your mom? I know of a few people who RP by changing contact names/details when sexting so it's possible that he's talking to someone completely separate (still disgusting behaviour that is still cheating) without it necessarily being your mom.",
            "This is disgusting. I'm livid for you, OP. If you have the resources, I'd speak with a therapist as soon as you can to avoid the emotional and trust issues that will inevitably grow front this entire clusterfuck. This makes me sick to think *your own mother*...your own fucking mother! A boyfriend, I can understand. It happens all the time. But your mom? Jesus Christ, what a cunt. \nYou can survive this, it's just gonna hurt like a bitch. ",
            "I'm so, so sorry. It's doubly worse because it's a total betrayal from both parties, not just your boyfriend. And it's almost worse on your mother's part, because you had no guarantees about your boyfriend's love but your mother's is a different story. \n\nIf I were you I wouldn't want him to stay in the house when he's the one in the wrong. I'd put all your boyfriend's stuff into binbags and put it on the doorstep and tell him to leave when he got back (and not to your mum's house, either). \n\nIf you feel like you need to get away, though, do. Go to that motel and make your plans for the future, or ring your family overseas, tell them what's been happening and ask if they can find you somewhere to rent near them. Buy a one way plane ticket and don't look back. To be fair, your life is going to be radically different from now on anyway, so you might as well start totally anew. \n\nI wouldn't even justify my mother with a phone call. She'd just be erased from my life. ",
            "You are going to need time away from both for quite awhile.  \n\nIt sucks when your OS cheats on your, but you can always cut them out of your life and move on.  \n\nBut for your own damn mother.... yeah you can cut her out of your life too, but holy hell that stings.  Even if you don't cut her out, you will never be able to trust her again.   :(",
            "There is very little that could make this situation ok. Title alone, even without the details, clearly these are two people who are supposed to love you and they screwed with you in a really gross way, and seem to show no remorse and have intentions of doing it again. One time thing? Fucked up, but maybe they have an explanation. Extended affair? Unforgivable, as far as I'm concerned. But you're you.\n\nI will say though that you need to talk to them. Don't take their bullshit or denials, don't be swayed that they didn't mean it when clearly they did. Hold your ground. But as you've said these are very important people in your life, and just cutting them out for good and storming away, while that might be the cleanest, is not really an option, is it?  Despite the fact that these people certainly have a toxic influence, you still deserve your due.\n\nnot to pry but is your dad in the picture?",
            "OP If you're around philadelphia I'll give you a place to stay.",
            "What is a fortnight ",
            "As people have said, you should first make sure it was your mom and not some other girl saved under your moms name. After that, I would force the conflict and get it done. Dragging it out, listening to pleas of forgiveness, etc., wont do any good. Confront them, and leave. After that, time is the only thing that will help. Its a shit situation. ",
            "Jesus, I'm sorry.",
            "This is how supervillains are born. Ball up this anger and rob some banks or something. Think of a theme for your costume and dress your henchmen accordingly ",
            "Ouch. Sorry you have to go through this.",
            "IMO both of these people need to be jettisoned from your life ASAP because they don't care about you.  It's not even a question.  As hard as it is to imagine your boyfriend is easily replaceable so as much as I'm sure that hurts (please forgive me for being cavalier I do have tremendous sadness and compassion for you) he's got to be gone immediately.\n\nIf I were you the soonest I'd be open to rekindling my relationship with my mother would be after several years.\n\nYou are alone.  Even if you keep them in your life you're still alone because they've done something monstrous and the only reason you should forgive them is because carrying around bitterness and unforgiveness is bad for you (one of the times where I think Christianity gets it right, actually)\n\nThese two people do not love you like you deserve.  Love yourself enough to recognize this instead of keeping them in your life.  ",
            "That is very weird. Does your mom look like you?",
            "That's disgusting. Break up with him immediately. There's no excuse, and no way to recover any kind of trust from that.",
            "Maybe this isn't the right time but damn.  Everyone jokes around so much about banging people's mom and you got pornos and shit but to think about it *actually* happening is honestly fucking disgusting.  How cruel of those 2 to do that to you.  I mean you can always find another BF, and us men are dogs we all know that, but your mother...  Damn.",
            "* Delete lawyer\n* Hit facebook\n* Up the gym",
            "Wow that is incredibly fucked up. Once you get through this, at least you'll know that you can get through anything else life throws your way.",
            "Sorry whats a fortnight? ",
            "[removed]",
            "OP.\n\nThere's a lot of hard-line 'fuck them' advice on this thread. I'm not saying they're wrong but I'm also not saying they're right. It is simple to throw this kind of advice out there when they're not the one about to lose the two most important people in their lives.\n\nMy 2 cents: do what's right for you. Follow YOUR heart. You asked for advice and you got it - take the pieces that fit how you feel. \n\nPeople make mistakes. What would the world be like without forgiveness?\n\nI don't have the answer for you and neither does anyone else. The answer is what you feel you can live with, go with your feelings because only you have to live with the consequences.",
            "Threesome! ",
            "Damn that's salty. \n\nIt's time to break bad and have a talking with both of them. ",
            "whatever you do dont try to get help on the internet.",
            "Everybody here is telling you to cut contact with them asap. I think you should at least sit down and talk with them both to get a full story of what's going on (and have a sense of closure at least). After that, then you decide on what to do next.. Rather tha  tormenting yourself the rest of your life based on your imagination of what you think happened. ",
            "Yeah, you definitely dont want to be taking advice from strangers on reddit. A) a solid portion of these people are 12-18 year old kids with no actual real world experience or knowledge. B) youre not going to learn anything you dont already know. \nTake care of yourself. Things happen people fuck eachother and fuck eachother over. Talk to one or both of them. Remember that you also snooped on his phone. You have no idea what happened really all you have is a bunch of vague shit. Everyone deserves a defense. Everyone deserves to be heard. These are people that you care about, not monsters. Dont do something crazy like make yourself homeless and jesus christ dont go out and get drunk (another solid reddit advice. See what i mean?)  ",
            "That's hilarious \n\n100% alpha",
            "That fuckin sucks lol good for him though!!",
            "You sure it wasn't his mom?",
            "Got any pics of your mom?",
            "OH GOD",
            "I think the worst thing to do in this vulnerable state of mind is to listen to strangers on the internet who could care less about how the rest of your life plays out.  All of the different opinions clashing together at once will overwhelm you.  \n\nI'm being a hypocrite by giving you advice after saying that but I figure I'll add my pennies.  This thread will help you after you have calmed your mind and can read everything in a subjective manner but right now (this is an assumption) you are finding a way to assuage your emotions and this can lead to you making irrational decisions based on the notions you derive from the onslaught of information.  \n\nIf you have the time and money make sure you eat and stay hydrated.  Thoroughly iron out all of your options.  Fact check when you feel ready to confront the situation and do not make any definite conclusions until you have extracted a sufficient amount of details to put yourself in a position of confident decision making.  Do not allow your mind to run wild thinking of what COULD be happening. Only go by the facts.\n\nIt is your life so I can't say much as to what you should do if your worst nightmare came true but at least from this point you will be able to rationalize.  Good luck. ",
            "A lot of people are advising you to walk away from your mom forever. I disagree. You only have one mom and since your father passed you only have one living parent. My advice is to take a big step back, which may include cutting contact for a while, and re-think things with this new information. It sounds like you and her had a not-terrible relationship before, that you felt like you could trust her and depend on her. Now in hindsight it's not completely true, but it's not completely false either. She provided other things for you. We can't help who our parents are. Sometimes they're broken, messed up people with bad judgment. But there's a lot to be said for having them in your life. You're going to have to draw a bright, bulletproof line between her and yourself and from now on everything is to be on YOUR terms, NEVER hers, but it's going to be worthwhile to maintain contact. \n\nTL;DR: Walk away for now but you're not required to walk away from your mom forever. Your future relationship will have to be on drastically different terms though.\n\nBut I really, really hope that it was some other person and your boyfriend disguised their number using your mother's name. \n\n",
            "Have a three way relationship! You love both of them right? You'd have the best of both worlds, could be the start of some adventurous shit",
            "Is your name Stacy by any chance?\n\nAll jokes aside, sorry this happened to you",
            "What you meant to say is that your mother of 24 years cheated on you",
            "He was trying to tell you something when he asked you \"Who's your daddy?\" the last time you had sex.",
            "This sounds like the plot to The Graduate, listen to Mrs. Robinson",
            "I'd get restraining orders against both of them and get therapy",
            "[removed]",
            "Who the fuck still says fortnight?",
            "You should dump him for being stupid enough to leave 2 weeks worth of dirty messages from her on his phone. Makes me question the legitimacy of this post.",
            "Are you from the UK?",
            "[deleted]",
            "Stacey's mom..",
            "Wow, people are quick to grab their pitchforks around here. I'm not sure how explicit the messages were, but you'll need to talk to your BF and mom to find out what actually happened before making any other decisions.\n\nIt may be prudent to have a plan ready, in case of the worse and lock down accounts.",
            "[deleted]",
            "Hey, I know it must be painful for you, but consider that maybe your boyfriend and mom didn't do it to hurt you. That is was just something very selfish they did and never suspected you would find out, therefore never hurting you. Maybe they didn't even think about how much it would hurt you before they did this selfish thing. And will feel horrible about themselves after they see how much it hurts you.\n\nNormally I would agree with the cut them off comments, but if it is the two most important people in your life it might be worth it to try and mend it.",
            "you lost me at \"fortnight\"",
            "Did you happen to piss him off on Xbox Live by any chance?",
            "Unless your mom is smoking hot, this probably didn't happen.\n\nMost 25yr old guys aren't desperate to hook up with a 52yr old.\n\nNot to mention, if your mom is hot at 52, you're probably even more attractive. \n\nSo I don't really see a scenario where he would have an interest in her. It's likely there to trick you and as others have said is probably some other woman.",
            "[deleted]",
            "This is what you get for snooping... if you hadn't of snooped, you'd still be in a happy relationship.",
            "[deleted]"
        ]
    },
    {
        "post_id": "5e78bb",
        "author": "shescrazytbh",
        "title": "[Update] My sister [23f] thinks that marrying her bf [27m] and having kids with him will make their relationship \"spark up\" again. How do I [14f] tell her this is a bad idea?",
        "url": "https://www.reddit.com/r/relationships/comments/5e78bb/update_my_sister_23f_thinks_that_marrying_her_bf/",
        "score": 3203,
        "num_comments": 23,
        "created_utc": 1479769626.0,
        "selftext": "Hey again.\n\nLink to the op: https://www.reddit.com/r/relationships/comments/5d299h/my_sister_23f_thinks_that_marrying_her_bf_27m_and/\n\nJust wanted to say that my sister and her boyfriend decided to break up. And also that she's not getting pregnant and marrying him anymore. As some people advised me, I called my brother and asked him to help me. He came over on Thursday and had a serious talk with her. \n\nHe told her to think about the future. Don't think about right now. Think about your life in 10, 20, 30 years. Kids won't fix a broken relationship and heartbreak isn't the worst thing in the world, she doesn't own anything to that guy, but years down the line if she decides to marry him, she'll have to deal with her awful relationship and take care of other human beings with him.\n\nAt first she couldn't accept it but after thinking about it, she decided that they should break up. Her boyfriend didn't seem upset at all and even though she's sad now, she'll get better and keep focusing on her education, which is important.\n\nNow I have to deal with my crazy family. My oldest brother from Europe is coming over on Thanksgiving... wish me luck. Haha\n\nBut thank you so much for helping me! People here are awesome (sometimes). :)\n\ntl;dr: My sister broke up with her boyfriend and decided to keep going to college",
        "permalink": "/r/relationships/comments/5e78bb/update_my_sister_23f_thinks_that_marrying_her_bf/",
        "comments": [
            "I'm glad things worked out. It sounds like your brother has a good head on his shoulders. \n\nNow all you can do is be there for your sister. The holidays may likely be a hard time for her so just remember to be kind and supportive. You sound like a great sibling! ",
            "So glad this worked out. Your sister was on the verge of making a terrible mistake. You are very mature for your age to be able to recognize that and find the best way to help. Be proud of yourself and happy your sister didn't make an awful mistake. ",
            "OP, as a mother of two young girls (under 4), how did you turn out to be such a reasonable, thought driven, intelligent young woman? I want the same for mine. \n\nGlad she made this decision. As a woman in my early 30s, sometimes it can be hard when we think we have a \"clock\" ticking on something that means so much. But I've seen people that didn't listen to their families, friends, etc. and it did not turn out well. ",
            "It is awesome that your brother listened to your concerns! If he ever comes to talk to you in the future to give you advice that is against your plans, remember this moment and take his advice to heart. That doesn't mean do what ever he says but just remember that he obviously cares that you are happy in the end.",
            "OP, I am super proud of you, you are very wise :)",
            "Yay! I'm glad it worked out.",
            "Awesome update OP!! I'm so glad this one turned out well; I read the original the other day and thought you got some good advice =]",
            "Your sister is lucky to have you, I've been wondering how this went down. You seem like a great person. Right on :) ",
            "Fourteen, huh?  Thanks for having a good heart, OP.  Seriously, keep it up... life is rough when you care, but somehow it all works out.",
            "You're too wise there's no way you're only 14! Haha but seriously well done. ",
            "Im glad this issue was resolved in the best way possible. Good luck to you OP, you deserve it. And happy thanksgiving, i guess",
            "You're such a sweetheart. I'm glad things worked out. Your brother is very kind. You two should be very proud of yourselves! I hope you and your family has a lovely Thanksgiving. ",
            "I'm glad it worked out! Congrats on being so levelheaded and logical at your age, you saved your sister a lot of heartache ",
            "Omg noooooooooo.  Having children doesnt fix problems.. it only creates nrw ones and magnifies your current problems making them 1000x worse!   "
        ]
    },
    {
        "post_id": "3gurep",
        "author": "throwaway81215",
        "title": "[Update] My (26/M) girlfriend (24/F) openly does not agree with my mom’s (62/F) choices. Am I unreasonable to break up with her over this?",
        "url": "https://www.reddit.com/r/relationships/comments/3gurep/update_my_26m_girlfriend_24f_openly_does_not/",
        "score": 3196,
        "num_comments": 443,
        "created_utc": 1439476841.0,
        "selftext": "[Original post](https://www.reddit.com/r/relationships/comments/3gqhpq/my_26m_girlfriend_24f_openly_does_not_agree_with/)\n\nThank you all for the comments. I was pretty surprised by the volume. I was trying to downplay my concerns about the incidents at my parents’.\n\nI met up with Rachel at her place before maybe heading for dinner together. I let her know that I wanted to talk about what she said about my mom during vacation. \n\n(I’m just going to provide a dialogue about what was exchanged to make it easier for me and hopefully less confusing.)\n\nMe:  I’m still trying to understand why you said what you said at dinner and why you are in such disagreement with my mom.\n\nRachel: It’s so weird how good looking your dad is still. He could have been a model when he was younger. Your mom is not anywhere in the same league as your dad. \n\nMe: I don’t understand what you’re talking about.\n\nRachel: I think it’s odd that they are together. It’s creepy.\n\nMe: My parents love each other. I don’t get the problem you have. I think that you purposefully brought up having kids earlier than my mom to criticize her.\n\nRachel: Well I don’t like your mom. I don’t have to like her.\n\nThe rest of conversation was more pulling teeth.  I had already given thought about what happened last weekend and I guess I share a chapter or two from my parents’ book, I want to feel confident about my partner. Rachel gives me doubt, not comfort. \n\nA lot of comments mentioned that I may have been oblivious and what I initially perceived as frankness was likely always tactlessness, that I may have not noticed it was tactlessness because I was in agreement.  I think these were factors, but I also didn’t agree with Rachel always on her opinions, I just didn’t disagree either.\n\nI broke up with Rachel last night. Her parting words were “A mama’s boy is just plain ugly. And you’re cursed with your mom’s looks!”\n\n**Edit**: So I rang my parents to let them know that I broke up with Rachel. I spoke with my dad first and he said, “You made a good decision. She was dumber than a box of hair.” Then I spoke with my mom and she asked why I ended it. I told her that she was too irrational and contradictory. She wasn’t convinced that was the entire reason so I told her everything since she has a pretty thick skin. She had a real good laugh and said that Rachel’s just a mean girl and she’s glad that it didn’t take me longer than 8 months to work that one out. And she also told my dad that he's still got it. \n\n**TL;DR**: Broke up with Rachel. She was tactless to the end.\n",
        "permalink": "/r/relationships/comments/3gurep/update_my_26m_girlfriend_24f_openly_does_not/",
        "comments": [
            ">  Her parting words were “A mama’s boy is just plain ugly. And you’re cursed with your mom’s looks!”\n\nIt so seldom happens that our life decisions are validated so immediately and unambiguously. \n\nOnward!",
            "Has she ever spoken to another human being before?",
            "> It’s so weird how good looking your dad is still. He could have been a model when he was younger. Your mom is not anywhere in the same league as your dad.\n\nDear girlfriends of the world, never call your boyfriend's momma ugly. What the actual fuck. You dodged a bullet OP.",
            "Some women hate any women associated with their boyfriend/husband. Including their mom/sisters etc. some kind of weird jealously thing. She would have spent a lifetime hating and bitching about your mom, with or without your mom ever saying/doing anything. Good fucking riddance. Your parents raised you right.",
            "Oh lord. She showed her true colors on that one. Good for you OP. ",
            "Good riddance",
            "Was she..was she checking out your dad?! Wtf!! This is super fucking weird, why would she interject herself into your parents relationship at all?? Why would her opinion matter & what kind of person does that? What a freak, be thankful she was too stupid to keep her thoughts to herself. Did she think you'd be like, \"You're right! My mom sucks!\" Creepy. ",
            "Have no doubt you did the right thing. I can't begin to understand what this problem she has with your mother is. ",
            "I've been with \"momma's boys\" and nothing you said about your mother led me to believe you are that type. Everything she was upset about, should have been a non-issue. You're lucky you caught on so quickly.  Best of luck in future relationships!",
            "Rachel, girllll, what the fuck are you even on about?! OP, just know that she's not going far in life with that kind of attitude and it's going to really push her back and fuck her over. Like, did she purposely try to self-sabotage herself?! Good job breaking up with her. Also, your mom (well, your parents), sound great!",
            "\"Hey girlfriend, I really want to have a mature conversation about why you said such disrespectful things about my mother.\"\n\n\"Dude your dad is so hot omg why is he even dating your ugly mom lol.\"\n\nYeah so you dodged a bullet OP....",
            "Wow, what an asshole she is.  She sounds like one of those people who are \"never wrong\".  \n\nHave you told your parents yet that you dumped her?  You said they weren't very impressed with her (can't imagine why, lol). I bet they are frickin relieved and high-fiving!",
            "Jesus... she's a special kind of crazy.  Good riddance to her!!",
            "You dodged a bullet on that one.",
            "well that escalated quickly.\n\ngood on you for getting out!",
            "Trust me, OP, there are so many horrible in-laws out there that when you find the right woman, she's going to be grateful that your mother is such a kind and generous woman.  Rachel is in for a very rude awakening.  ",
            "What the fuck is even wrong with that girl? It's like she was jealous of your mom? Don't tell your parents what she said about your mom's looks, tho.",
            "Holy, she is a nasty piece of work eh?  Good job, you made the right decision.",
            "She is totally going to make a pass at your dad.",
            ">Rachel: It’s so weird how good looking your dad is still. He could have been a model when he was younger. Your mom is not anywhere in the same league as your dad.\n>Me: I don’t understand what you’re talking about.\n>Rachel: I think it’s odd that they are together. It’s creepy.\n\nWowwww. \n",
            "Man, she can accuse you of being a momma's boy while having daddy issues? She's such a hypocrite! ",
            "What even happened there? Damn. You dodged that bullet Matrix style, all thanks to your Mom just existing!\n",
            "The good news is she's got a solid six years before her womb is as inhospitable as the rest of her.",
            "Well she just seems lovely. I can't imagine why she didn't make a good impression on your parents. ",
            "Oh so you're ugly now that you've broken up, but last week it was cool to fuck in your parents' home?\n\nShe's disgusting. Good riddance.",
            "I had to go back and read your ages again because...wtf?\n\nIs this chick for real? I sure hope there was birthcontrol during that playtime at your parents house.\n",
            "Wow, she is not worth you at all. She doesn't like your mom, but doesn't even know her. It's better you split now than later. ",
            "\"Dumber than a box of hair.\" Awesome. ",
            "Obligatory \"dodged a bullet\" comment. \n\nWow. ",
            "Your ex is crazy, tactless, and an awful hypocrite. Thank goodness you found out sooner rather than later. Now go hug your mom and tell her you love her :)",
            "Good riddance.  That was just rude.",
            "Congratulations on getting rid of an absolutely terrible person from your life. I'd call that a win.",
            "It's always wild to me when people you've dated for a while flip and immediately insult your looks. Like, if I'm ugly, what does it say about you that you not only stuck around and fucked me thinking that, but then got dumped by my ugly ass? You're obviously more lonely than I've ever been, ugly mug and all.\n\nSounds like a good move, OP.",
            "What a dick. Not wanting your partner to be an asshole to your parents is not being a mama's boy. Glad you got out of that situation.",
            "Damn. Oh well, people are rude. Don't worry about that, for relationships I usually think that knowing the other parent's and family first is pretty big because if they don't mesh, you're going to have a big problem on your hands. Nicely done sir.",
            "So she thinks you are ugly, yet she was in a serious relationship with you? She's just bitter you dumped her. Good for you bro. \n\n",
            ">“A mama’s boy is just plain ugly. And you’re cursed with your mom’s looks!”\n\nBut she fucked you so who is the real loser? The ugly guy or the girl who has to reach up even to him.",
            "How did this side of her just suddenly come out after 8 months? Have you just never had a conversation during that entire time? ",
            "Good for you OP. Now you can actually try and find someone who isn't a total douchenozzle.",
            "I just wanted to validate that you are not a momma's boy. You respect yourself and your parents. These are all good things. Good job being a good person.",
            "I bet if you had of stayed with this girl she would have slowly tried to pull you away from your mother and turn you against her until she was the only woman in your life. I'm glad you made your decision, it was the right one. ",
            "It seems that she was somehow threatened by your mother and wanted to assert herself over your relationship and how you view your family. It's classic controlling behavior that in the end helps her feel like the victim so she can reap the attention from others, as well as gain misplaced sympathy.\n\n\"My last boyfriend broke up with me when we were on vacation at his parent's house. He got upset at me for not having the same views as his mother/family, and when I didn't give in he got mad.\"\n\nThis is how things are twisted around to look like she's innocent, and she probably already believes this is what happened.\n\nIf you had stayed with her, your life would have been filled with gaslighting, pity-parties, and martyring, and probably alienation from your family. Glad this was discovered in the first year of your relationship, rather than down the line if you lived together or she had gotten pregnant.",
            "Hear that high pitched whistling sound?\n\nThat's the bullet you just dodged.",
            "Glad you found out now,  not later.  She didn't have to like your mom but out of respect for you and the fact she was a guest in your parent's home, she should keep her tactless mouth shut.  There was no need to say something.  So glad you figured this out.  In this case being a mommas boy is a good thing.  ",
            "I have 2 sons and you are a good son. If your mom ever finds out why you broke up with this girl, she'll be tickled pink. I'd love an update on her reaction if you do loop her in. ",
            "lol what a gross person",
            "Tacky, tacky, tacky.  You're better off without her.",
            "Is she on meds? Mentally ill? Has a brain tumor? ",
            "Bullet dodged",
            "Lol, she is the creepy one here. Who the fk with sanity would comment like that? You dodged it dude.",
            "Saying it's creepy is just odd. She is an odd person.",
            "You were dating a weird asshole. Good riddance.",
            "Wait... So you started the conversation about what she said at dinner about your mom and she responds with \"its so weird how good looking your dad is. And your mom is no where close to good looking\"??? \n\nThats... Crazy. She didnt even speak about what she said at dinner. And then who even fucking says these types of things. \n\nShe is really a special kind of stupid.",
            "Mama before drama. ",
            "We aren't all terrible! ;)\n\nHonestly though, this girl sounds like a total weirdo, you're better off without that craziness. ",
            "Should've responded \"Maybe, but I was the best you could ever get.\"\n\nJust to sew some extra self doubt into the rest of her life. ",
            "Soooo...your parents are too liberal for letting you two share a room (even though she benefits by getting sex) and it's \"creepy\" that they're together, even though she was dating the product of their union, you.\n\nYeah, I can't make heads or tails of this. Maaaaybe she was trying to use some stupid high school put-downs so she could assert dominance over your mother and take her place as Matriarch of the family? Maybe once she met your dad, she got the hots for him and decided to try to make herself appear like a better option in his eyes (somehow forgetting that she's already dating you)? \n\nI have no idea. But she is incredibly immature regardless, and nasty too. Frankness can be refreshing, but it should never be used at the expense at someone else (especially in instances where one should keep their mouth shut).",
            ">Rachel: I think it’s odd that they are together. It’s creepy.\n\nMe: And I'm starting to find it creepy how I'm with you. \n\nGlad you broke up with her OP.",
            "Sounds like you really dodged a bullet here. The first post was just uncomfortable, but her reaction was more than creepy and just showed clearly you were right to be concerned in the first place. ",
            "woooooooooooooooooooooooow.\n\ndamn. i hate my bf's mom to the point where i can't even be in the same room with her without wanting to rip my hair out, but i'll never tell her that to her face.  god.  i'm glad you broke up with the ex.",
            "Duude.\n\nThat person is... not a nice person.\n\nSeriously though, I wonder *why* she actually said all of that. What's her thought process like?\n\nFriggin *weird.*",
            "> I spoke with my mom and she asked why I ended it. I told her that she was too irrational and contradictory. She wasn’t convinced that was the entire reason so I told her everything since she has a pretty thick skin. She had a real good laugh and said that Rachel’s just a mean girl and she’s glad that it didn’t take me longer than 8 months to work that one out. And she also told my dad that he's still got it.\n\nFuck Rachel—your mom's fuckin' awesome. ",
            "Dumber than a box of hair! Your dad is spot on.",
            "Oh she's gross. Like really, really gross. I'm glad you broke up with her, she's a flipping weirdo.",
            "Wow. She's a Charlie Sheen style winner. ",
            "Mean girl.",
            "She sounds plain weird.",
            "?\n\nI'm gonna guess she has some deep insecurities about how close or good a relationship you have with your parents, is jealous/wants to be number 1, sees your mom as competition and is badly trying to bring her down. ",
            "Damn she's mean.\nWhat did your mom do to her?\nOr she just randomly made up her mind not to like your mom?",
            "What a terrible human being. Run fast and far, my friend.",
            "God I feel sorry for the man that ends up marrying this woman",
            "What a terrible girl. She obviously hasn't grown up.",
            "Her obsession with your mom is so strange. Good decision!",
            "I'm still confused why she didn't like your mom OP. It sounds like she formed an opinion before even meeting her. Anyways you dodged a bullet. She's rude and disrespectful. ",
            "She jealous as hell of your mama. I don't know why. ",
            "I'm glad this was resolved for you. I worried before that you two had ideological differences, but it really just turns out that Rachel was kinda weird and disrespectful. Being tactless isn't a crime (I can be really blunt and tactless sometimes), but being disrespectful towards someone that you're SO loves (regardless of relation) is just plain rude and indicative of problems to come. ",
            "Oh man! Good to see you gave her a 'second chance' to address her rude remarks. And she got ruder!!!! Ughhh! Good job on breaking up with her. ",
            "Poor thing. With that attitude she is going to be incredibly lonely. You dodged a massive bullet op.",
            "As I have told my wife before, there is a difference between being straightforward and being unnecessarily blunt. One states the facts as is. The other uses takes facts and tries to convey a negative message.\n\n\"Those shoes don't match that skirt\"\n\nVs.\n\n\"That outfit you have on it ratchet\"",
            "Wow, you dodged a bullet there.  My parents had me older and I have no desire to get married let alone have kids before 30.  Having children older can be better for both the parents and the child and provide advantages that younger parents cannot achieve.  You made the right choice.",
            "She has the Hotts for your old man. That could be the only reason, that could make sense on why she didn't like your mom. Your mom may not be the most beautiful woman out there but it doesn't mean your dad is out of her league. Who says something like that? Rachel is not a good person, you need to stay away from her, I could totally see her becoming emotionally abusive.. I'll bet your parents will be happy too..",
            "I don't like my MIL but I treat her with respect and I don't trash her to my SO. That is just disrespectful. You dodged a bullet. A really mean bullet.",
            "there's a difference between disagreeing and flat out not liking. she is the second one. your parents sound amazing. rachel... not so much. my parents had me, a twin, at 39 (mom) and 41(dad). they turned out to be wonderful parents and it sounds like your's are too. i think you made the best decision. ",
            "Your ex is not going to have a very good life.",
            "Your parents sound really cool. I would love to have in laws like that",
            "So, you're a 'momma's boy' if you defend her when someone calls her ugly?\n\nOn what planet was this girl born?  Really glad to see that her religious upbringing had a positive effect on her social mores.",
            "Was Rachel a southern christian conservative republican? ",
            "Im glad you dumped her. I would never be rude to my SO's mom even if i disliked her. How do people think thats okay? ",
            "Some people are like this, they aren't comfortable until they've isolated their partners from their families so that they're the only ones around for attention, and I guarantee this was more the reason than all of those bullshit explanations. She wanted you all to herself in a really sick way. You don't need someone like that, good on getting the fuck out. ",
            "You dodged a spoiled mean girl bullet there, OP.   I taught my kids ugly is not how one looks, but is about how one acts.  You are being generous when you call her tactless.  She's way beyond that.",
            "It's called an Electra complex. The straight female version of the Oedipal complex. She immediately sees a mother figure as competition for the man she wants, and a father figure as potential object of lust. ",
            "Somebody is always going to not like something about your family, but at least a show of respect is due. OP, you will be much better off without her.\n\nOut and out rudeness is a deal beaker!",
            "Good!  Now post a pic so we can all avoid her.",
            "You may have just dodged a future Michele Bachmann fan and/or horse girl that would later cheat on you with an older man. Scary stuff.",
            "Everything thats wrong with people summed up by this chick.",
            "Apologize to your mom :)",
            "I would be *very* proud if my son turned out like you when he's a man. ",
            "From your previous post, your mom sounded awesome, why on earth would Rachel not like her? I would be elated to date a guy with a mother like that. ",
            "I didn't realize respecting your parents and expecting your SO to do the same was the definition of \"mama's boy.\" \n\nGood for you OP. You will find a SO who respects you. ",
            "> Her parting words were “A mama’s boy is just plain ugly. And you’re cursed with your mom’s looks!”\n\nI'm not even gonna lie, if a girl I broke up with said this to me she'd get chewed the fuck out before I finally dropped her ass. \n\nGood response would've been \"Well my mom's looks was good enough for you.\" ",
            "Wait, what was the rest of the conversation? What were her reasons for not liking your mom?",
            "Good riddance to bad rubbish.",
            "Good job....she really seemed like a shallow person. It is nice that she validated that with her last statement to you.",
            "Rachel has some internalised misogyny to sort out and probably needs bringing into the 21st century.\n\nGood choice OP, and good luck!",
            "What a bitch. She's right when she says she doesn't have to like your mom, but she should try to have a little respect and keep that opinion to herself. I would never in a million years say something like that to my husband about a member of his family unless he asked me directly how I felt. ",
            "She did you a favor, and didn't even leave a shred of doubt as to if you made the right decision or not. Good on you, and good riddance. ",
            "So...a momma's boy is someone who will stick up for their mother when she's being treated unfairly???? Lmao okay. God. Your ex is a fucking weirdo. ",
            "Man, what an unpleasant woman your ex is. It's fine to have your own opinions, but stufing them in your face and making snide passive-aggressive remarks about it is just rude",
            "Dodged a bullet there buddy! \n",
            "So my mom is 64 and my dad is 71. However, my dad doesnt look a day over 50. Is it creepy that they aged differently? Girl needs to get a life and find actual problems to worry about =/",
            "Jesus fucking Christ she called your mom ugly without provocation? Does she have mommy issues, and she's taking it out on you because your mom is normal? I don't really get it. ",
            "Wow, she sucks.",
            "Good riddance to bad rubbish!",
            "Good for you op. You really dodged a bullet with that one. Go out and celebrate! ",
            "Wow man. Good thing you deaded crazy before she could ruin your life. Girl sounds like an exceptionally self-loathing hater.",
            "What an interesting character, haha. Well you'll find someone who respects you and your sweet mother and maybe internalize her thoughts about your hot dad. :]",
            "It kinda sounds like she was trying to get you to break up with her. I had an ex that started saying the rudest most ridiculous things to me about my mom and he later admitted he was just trying to pissed me off and break up with him. It worked.",
            "I'm kinda stunned. This is not what I was expecting at all.",
            "She's gonna try and bang your dad OP",
            "Jeeze, she obviously has some mommy issues and sounds insufferable. Bullet dodged.",
            "Well she sounds like a disgusting person, so good for you. \n\nIdeally you want someone who loves your family and vice versa. If your partner doesn't initially hit it off with your parents I'd expect them to at the very least respect them and try to find some common ground together. ",
            "She doesn't have to like your mom. My husband doesn't like my mom. But he's not a dick about it, even after 16 years together. We see my family almost every week, and he never says \"Wow, mother in law, I think your life choices were awful. Father in law could have done better than you anyway.\" He doesn't even criticize her on the few meals she really sucks at. He knows that being an asshole doesn't help anybody.\n\nGood for you for getting out early. She would have been a total nightmare.",
            "She sounds very immature and as though she was threatened by your family's closeness.\n\nYou're so much better off without her.",
            "She asked why her dad was with her mom because your mom was ugly... and then claimed you were ugly?  Why was she with you then? She be quite cray cray.",
            "Good thing you broke up. She would have tried to bang your dad",
            "Good for you OP! ",
            "Holy shit man, be glad to be rid of that anchor",
            "Good job.  It's so much easier to let a toxic relationship linger.  You made the correct choice.",
            "She's just a plain hypocrite going back to the original thread. \n\nGood riddance OP. ",
            "Wow what an idiot. You're better off. She had some nerve. Ugh. \n\nGlad you broke it off with her. Good for you. ",
            "my view has always been if a women *has to* get married or have kids by a certain point to just steer clear. they arent looking for a partner just a means to an end. good on you man",
            "Good thing you found out she sucked now and not way later in the relationship.   \n  \nWhat a bitch. And to take a final shot at your mom after getting dumped...classy move. ",
            "Good for you! You dodged that bullet! ",
            "my boyfriend looks down on my parents because they are exact opposites of his parents.. it is very frustrating, but he accepts them for who they are and loves them regardless... Im glad you broke up with her.. ALWAYS trust your gut, and that is exactly what you did!!! Good for you OP!",
            "Good riddance!",
            "I won't get into a detailed post, but I'm certain her life will not go well and that you have fundamental value differences that will make a relationship impossible.\n\nWalk away. Don't look back. She isn't meant to be your partner.",
            "I know a girl who would say Rachel's parting words. I can imagine her saying it and it made my dick turtle. ",
            "Better to find out how she feels now then years down the road after you're married with kids. Dodged a bullet with this one.",
            "Good riddance to that one! She's crazy pants.. ",
            "Good job!!  ",
            "She sounds supremely immature. My gf has a friend who is almost as tactless, she calls it \"telling it like I see it\". No, she's just a bitch. ",
            ">Rachel: Well I don’t like your mom. I don’t have to like her.\n\nK, bye.",
            "I worry that our society manufactures people with these kinds of delusions. There are numerous reasons to love another person.",
            "> Well I don’t like your mom. I don’t have to like her.\n\nWell, she doesn't have to, but you can break it up for it. You'll be ok OP",
            "Send this chick back home to /r/CringeWorthy ",
            "Holy shit, my ex-friend was just like this.  She judged everyone 100% based on their appearance.  It was jarring to her to meet someone who wasn't attractive but was still confident and had decent self esteem.  She was basically stuck in middle school, where she had peaked, and she mentally grouped everyone into the cliques she felt they would belong to there.  She was a \"cool kid\" and unattractive people were probably dorks and therefore beneath her.  No matter how much I tried to pry her away from this mindset, she couldn't budge.\n\nYou dodged a bullet, OP.  People who judge people's worth solely by their appearance are, by definition, shallow, and they won't suddenly develop depth.  She's in for a rude surprise when she gets older and her looks fade, too.  ",
            "wow those parting words were basically child logic. \n\nyou: \"Im breaking up with you\"\nher: \"well you're ugly!\" \n\nwhat is this, elementary school. You're better off for sure. ",
            "Family > god > cat > everything",
            "> Well I don’t like your mom. I don’t have to like her.\n\nShe didn't even give your mom a chance. She thought *too liberal, don't like her* and that was **it**.",
            "Bitches that put clocks on when to have kids are girls you need to avoid.\n\nUnless they are actual goal orientated people, who are doing intense study for some degree or vying for some job position based on something something. \n\nThey have no need for a clock on anything, their lives aren't going anywhere anyway.",
            "Your mom sounds like an amazing person! I aspire to be like her one day :) ",
            "Although I do think you did the right thing-breaking up-just because I think we are affected by the way we are brought up and you being brought up in a liberal household and she being brought up in a more conservative one might eventually affect your future goals as a couple (how you bring up kids etc.).\n\nHaving said that, I perceived most of her 'verba diarhea' of sorts attributed to just nerves. I will say, however, that if I had said something like what she said about being allowed to stay in the same room (more out of talking out loud) I would have later said to my boyfriend \"What a total dork I am!\" after realizing that I said it out loud.\n\nTo add to that, I am one of those people that takes 'intent' into consideration in many situations if not all. \n\nPersonally, I don't know if either of the comments about having kids at 30, or even the sleeping arrangement comment were meant to be mean spirited. Fact is--after 30 your chances for having down syndrome babies increases (especially after 35)-perhaps that's what she meant? Obviously, many people have kids after that and many do not have down syndrome kids but her comment was not far-fetched and I honestly don't know if keeping in mind when your parents had you attributed to what you perceived as an 'insult'-even though, based on many of the comments, many others are  perceiving it that way too.\n\nPeople say goofy things when they are young, when they are nervous etc. I think it would have been more productive if you had voiced all these thoughts to her and let her respond. Had she realized how judgmental she sounded perhaps she would have been mortified and felt bad about it? Then you would have been able to see her true intention. ",
            "you;re ex sounds like she is stuck in high school. Bravo on leaving her.",
            "Your dad sounds as wise as he is beautiful.",
            "> “You made a good decision. She was dumber than a box of hair.”\n\nYep. Dadvice.",
            "You dodged a bullet.\nForget her and move on.\nYou might even ask your parents if they know any single women.",
            "Wow those last words haha glad you ended it before you got any more involved with her. ",
            "My mother in law isn't always my favorite person in the world (personal reasons), but I would never be rude to her like Rachel was. Or be rude about her. \n\nShe's a bitch. Glad you got rid of her. Wouldn't someone who actually respects you, want to try to impress your parents? Instead of tear them down?",
            "wow. I just read your last post and this one and you ex girlfriend was extremely childish and need to grow up. She is always very rude and I think you made the right choice completely with ending things with her. Never put someone before your family or let them talk badly to them (to their face or behind their back). Smart choice, hope things go good for you from now on.",
            "Good.",
            "Your parents sound lovely, and a great example of a happily married couple. Your girlfriend was nasty..and dumb! She could have had not only an awesome parter in you, but equally awesome future inlaws...something not easily found, if r/justnomil is anything to go by!",
            "Good thing you broke up with this lunatic! You should just send her these posts. ",
            "Good riddance!  She obviously had issues greater than someone without a degree in psychology is equipped to deal with.  If your girl doesn't like your mom after meeting her ONCE and not really knowing her then I say kick her to the curb.  You're better off! ",
            "Yayyyy!! I am so happy for you!!",
            "I..uh... what.\n\nShe just sounds completely bonkers at this point.\n\nLike, I have a close friend of mine, who has a severe problem communicating socially (he's a lovely guy though)... sometimes I say something to him, he responds with something that just was not related and did not make any sense.\n\nI'm getting that vibe from this girl, except she's a dickhole",
            "Have you ever talked politics or religion with her? You've only been dating eight months and you're young, so it's possible that it's not something that has come up much in conversation. It sounds to me like you are from a liberal family and probably lean that way whereas she is from a conservative one, and she is conservative at heart. \n\nRachel, to me, sounds like someone who has been brainwashed her entire life to believe that sex before marriage is bad and that women were put on this earth to be pretty and make babies as soon as possible. \n\nThe fact that your mom isn't her idea of a good wife and mother, yet still managed to snag an attractive husband is threatening to Rachel. It feels threatening to her because it goes against everything she has been taught but also probably because deep down she feels that she herself is nothing but a pretty, baby-making machine. \n\n",
            "I've realized that if my significant other really really dislikes my mother, then it's probably not a relationship I want to be in. Three times now...",
            "Your parents fucking rock dude, they sound incredibly charming.",
            "I personally can't wait for Rachel to reach her 40s and hopefully the children she manages to have before she turns 30 will already have a transcript of this in their brain chips and they will refuse to take her advice on anything. Ever. ",
            "Your parents are awesome. And honestly, they sound like people I'd totally bro out with. Good call!",
            "Good for you. I've been following this and first of thank you for all the updates because some of your original story struck some chords with me.\nJust as your Dad said I'm happy for you that you found out this girls true nature by 8 months and not years. You are much better off, you sound like a good guy for sticking up for your family. Your parents were welcoming and accommodating to this girl and while she had no issue enjoying the benefits she also had no issue judging them and ultimately you.\nYou seem like you are doing well but break ups are still hard....just keep in mind you did exactly the right thing and will be so much better for you down the road.",
            "Glad you broke up with her. Her responses dumb as fuck",
            "Good work man, I just read the original and this and was thinking does she have ANY redeeming qualities?  Not a good sign if she's trashing your parents like that.",
            "That dialogue convinced me my previous interpretation was off base; I agree with your Mom that she's simply a mean girl. I repeat though that I doubt that trait wasn't obvious before this particular dinner/conversation....",
            "A partner should bring you happiness, joy and support. If she brings nothing but discomfort and stress, then she's likely not the right person for you. Also, her treatment of your MOTHER was ghastly. Was she jealous of your relationship with your MOTHER?  Insecurity isn't attractive. Also her \"frankness\" seemed like it might be on the spectrum. All in all, your GF appeared like she'd be an energy draining chore to deal with. I'm glad you gave her the heave-ho.\n",
            "Your parents sound awesome. :D Lucky!",
            "Rachel sounds like a judgmental idiot. You made the right call. If nothing else, you just don't place yourself at odds with your SO's family over nothing. \n",
            "I don't even like my parents but I would have dumped after all that. Good for you. ",
            "For one thing, the comment she made about your parents? That was too damn creepy. I could never look at my BF's parents and make a comment like that. \n\nFor another thing, you don't strike me as a Momma's Boy. I've dated one before and he brought his mother into every decision I tried to talk to him about. \n\nGet new clothes? \"Mom won't think those are nice at all.\"\n\nSuggest an activity to do together? \"Mom will think that's dangerous/stupid/a waste of time.\"\n\nGet my own damn hair did? \"Mom will think you look like a slut with that hairstyle.\"\n\nThat last one did it for me. Her parting words pertaining to you were inaccurate. I think you were entirely justified. Onto better things!",
            "Great ending. Ha, your mom sounds hella cool. The convo in this post is worse than the original story. I just said 'wtf?' and was confused by her comments about your dad...you did free yourself from a mean girl. ",
            "OP how goodlooking is your dad? Please give us the deets. Could he work at Abercrombie?",
            "I can't help but to wonder if she was trying to get you to breakup with her. Unless she's shown these colors before, it's weird that she would just change like this, unless there was some other factor. Maybe she cheated on you, and meeting your parents made her believe that this was getting serious, and so she freaked, and made you dump her, or maybe it's the same case, but without the cheating.",
            "I'm happy for you that you dodged such a (huge) bullet OP! In relationships sometimes different family members may not get along for a number of reasons but she has a problem with your mum arbitrarily (she let her stay over? She thinks your dad is too attractive for her?) and sounds like she would just be causing trouble for no reason at all.",
            "your parents sound awesome, OP.",
            "In some situations it would have been right to be on your girlfriend's side instead of your own moms(for example in my mom's situation with my dad and grandma who for no good reason(if you knew him personally you would really get that) thinks that he never works even when he does and is going to leave my mom forever and go back to his home country and that he is the worst father ever(even though tbh he is one of the best I have ever seen even if he wasn't mine :P ) but it is just a difficult situation when she comes over uninvited) but what you did was clearly the right thing and tbh I think your girlfriend might have been jeolous of your mom and wanted to sleep with your dad.",
            "Good job.  She's rude.",
            "Wow, what a b.",
            "You'll find someone else that loves and respects you and your family.",
            ">Well I don’t like your mom. I don’t have to like her.\n\nHUGE red flag. large-ass sign of immaturity. good for you. she'll make someone else miserable. \n",
            "Good job on breaking up with her. Now she can be a tactless pest all by herself.",
            "Sounds like you've got some rock-solid parents. They let you make your own mistakes and come to realize them, yourself. Once you do, THAT'S when they offer their thoughts on the situation.\n\nNice work, OP. You dodged a bullet for yourself, here. You don't need that girl in your life and certainly not as a central part of it. Move forward and don't look back.",
            "Holy Shit dude, you just dodged a bullet. What kind of human being is she?",
            "\"Dumber than a box of hair.\" I like your dad. He rocks.\n\nWise decision, OP. I guarantee there's someone else out there who's a better fit for you.",
            "Your parent's sound lovely, hope you find someone equally as lovely as them! =)\n",
            "I think you've confused tactless with complete and utter dillhole.\n\nWhat a disrespectful a-hole. Your parents housed and fed her and were by all accounts good people. Ugh. ",
            "OP, Rachel has the hots for your father. She wants to fuck him, which is why she bashed your mother.\n\nGood thing you dumped her.",
            "You're not a momma's boy. And Rachel is just a jerk.",
            "Just for the record, I'd never date a man who didn't adore his mom. Mama's boys rule! ",
            "You dodged a bullet! I'm a person who puts her foot in her mouth sometimes but even I would not go putting down my boyfriend's mom on purpose.\n\nShe's a cruel, close minded, selfish person.\n",
            "I think she was going to dump you too.  You beat her to it. \n\nRegardless, you are much better off. ",
            "She sounds plain weird.",
            "From your original post your mom sounds absolutely lovely. I could never imagine being so disrespectful to my boyfriend's parents, and not caring what they think. You really did dodge a bullet, good for you. You will find someone else who deserves you. ",
            "Wow. You did the right thing. Your mom sounds amazing. ",
            "Well done!  You are lucky to have such awesome parents!!",
            "Actually, mamas boys (with healthy boundaries) are the best partners you could ask for EVER.",
            "oh, she wanted to bang your dad and is jealous of your mom, that's why she said those things. ",
            "[deleted]",
            "Call your mom and let her know what happened. I bet your parents didn't like her/were not impressed after their initial meeting and will be relieved their son stood up for them. \n\nGood man! ",
            "I once Daten a guy who hated his mother. Not once I said a bad Word about her. You do just not say Bad things about your SOs mom. ",
            "I would like to point out that she said, \"Well I don’t like your mom. I don’t have to like her.\"\n\nOh yes you do, girlie. If your SO likes his parents and his parents like you, that relationship isn't going anywhere if you don't like them back.",
            "Good on you.  Consider this a bullet dodged.  I dated my own Rachel for five years...you got off lucky.  Your parents sound awesome, btw.  Very much like my own.  Rock on.  ",
            "Don't date women who are into older men.\n\nI like having fun with these types, but they're parasitic for the rest of us.",
            "If you don't want to be with her, you don't have to have a reason to break up with her.  Just do it. \n\nIf you are breaking up with her because she disagrees with your mom and will do so for every gf you have in the future, you likely won't find anybody until after your mother has passed away.\n\nFacts of life.",
            "Good riddance, really.\n\nOne thing tho, that I think is worth for you to consider (no need to even reply to me, just for you to think about, really). After your first post I was left thinking that she seemed like one of those people who will bring up things she doesn't agree with just to be antagonistic. I still think she is that kind of person and that it is great for you to have broken up with her.\n\nBut. Her parting words and the fact that she seems to flat out resent your mom, and not your dad, make me wonder if, in the time you have been together, you have not done/said stuff that had made her feel that way. If you have, that is also not necessarily a bad thing. She may just be insecure and hearing you talk positively about your mom made her jealous/resent her - which again says it is a good thing you broke up with her. But there is the chance that you are too attached to your mom, and that it shows in the way you talk/act, and that is why she felt this way. Even if that was the case, the way Rachel handled it was shitty, and you are still better off, but it is worth taking your time to figure out if there is a chance you may be overly attached to your mom, just so that you don't let it have a negative impact in any future relationships that may be worth pursuing.",
            "I agree with Rachel, you sound like a mamas boy. You should not have broken up with her because her opinions were different from your parents. Newsflash, your parents are not the gold standard for how to act in life. You're going to have a hard time dating until you realize that the only woman like your mom, is your mom. ",
            "[deleted]"
        ]
    },
    {
        "post_id": "3bmrg6",
        "author": "thrwawy1243124",
        "title": "I [34M] found out my ex GF [33F] died yesterday. We have a kid.",
        "url": "https://www.reddit.com/r/relationships/comments/3bmrg6/i_34m_found_out_my_ex_gf_33f_died_yesterday_we/",
        "score": 3174,
        "num_comments": 216,
        "created_utc": 1435672760.0,
        "selftext": "Me and my ex were together for about 6 years. We broke up a little over over a year ago after I found out she was having an affair. We have a 3 year old son together that I love more than anything in the world. She had primary custody of him because I feel like a child should never be torn away from his mother, unless the mother is abusive and/or can't raise him properly. Plus, I get to see him whenever I like.\n\nSo yesterday afternoon, I picked up my son up from his mom's house to spend the rest of the day with me. She went out for drinks later with her friends. I thought nothing of it, because she has done this a ton of times. \n\nI got a call around 11pm from one of her friends, a call that I never want to hear about someone I'm close with. According to her friend, she was super drunk and couldn't even walk properly. She ran out onto the street and a car hit her. She was rushed to hospital and she died on the way there.\n\nI'm in so much pain right now. I loved this woman. We have a beautiful child together. How will I eventually explain this to my son? \n\n\n\n   \n**tl;dr**: Ex-GF died after a car hit her. We have a child.",
        "permalink": "/r/relationships/comments/3bmrg6/i_34m_found_out_my_ex_gf_33f_died_yesterday_we/",
        "comments": [
            "I'm so sorry this happened. \n\nI strongly suggest talking to a grief counselor yourself and consulting a child-psychologist with regards to your son. They are trained to help you and your son deal with this.",
            "Firstly, I'm sorry for your loss.\n\nSecond, your son is at a pretty vital age where child development occurs, particularly where bonding/attachment is concerned, so I think /u/Montaron87 is spot on when he/she suggests consulting a child psychologist.\n\nLastly, as a mother the only thing I fear about dying is my kid not being ok when I'm gone. You sound like a good man who loves his child, and in order to do what's best for him you have to look after yourself as well. \n\nTake any support offered to you by friend and family. Develop a steady new routine with your son as soon as possible. Talk to a child psychologist for him and a grief counsellor for yourself. Take care.",
            "I am so very sorry for your loss. Grief is hard and awful but eventually it gets better, though your life is never the same again. Make sure you have support of family and friends around you as you deal with the upheaval to your life and that of your son.\n\nIt will be a long road ahead to getting better. Your son will have many questions, and how you explain this death to him will change as he gets older. For now he is 3 and you can tell him something like because of a sad accident mommy's body stopped working and that you and mommy love him very much. Over everything he needs to be reassured that you love him. Kids at three are very literal and do not really grasp the finality of death. Having a therapist guide you in dealing with questions from your son, as well as your own grief, is very important.\n\nI really am so sorry for your loss. ",
            "(((hugs)))\n\nI'm so sorry for your loss.\n\nContact her family - who will be making funeral arrangements?  \n\nFile for SSI dependent benefits for your son.  The monthly payments will help a lot.\n\nHe's 3 yrs old right now, so you can say Mommy's gone, and keep him busy and distracted.  Counseling will help you with the ways to discuss it with him in an age appropriate manner.  \n\nIs his child care close enough to keep?  Let them know the situation.  You may want to look into a nanny or au pair.  The survivors benefits will help pay for that.\n\nTake care of yourself! ",
            "I am very sorry for your loss, even if you were broken up, you had a connection and a history. Right now you need to rely on the support of family and friends and I assume you will have custody of your son which will be a major life change. When he asks keep it simple and at 3 he might not really understand the concept of forever and not coming back, so you tell him his mother loved him and you love him and give him time to grasp the not coming back. This will be so hard for both of you and you have my profound sympathy.",
            "Your son has a new reality, the death of his mother and living with you full time. A child psychologist will definitely help you pave the way to this new reality. \n\nHe's going to have lots of questions. Be honest, yet age appropriate. I'm sure there are good how-tos online on how to explain death to toddlers. \n\nMake sure he has his own space in your house, if you haven't already. Incorporate as much of his stuff from her house into it, so that he can find comfort in familiar things. It may also help his young mind understand more that mommy is gone if his stuff is in your house. \n\nTry and keep as much routine as possible. Young children thrive on routine and predictability as they don't understand the continuum of time.\n\nTry and keep some of the same routine he had with his mom, i.e. if Grandma watched him Thursday nights, continue that date. Don't change his pre-school yet. Incorporate changes slowly one at a time.\n\nMake sure you have a good support system for yourself so that you don't get burned out, as well as your own grief counselor.\n\nBest of luck to you and your son.",
            "[deleted]",
            "I'm so sorry for your and your son's loss, OP. Starting with talking to a counselor about how to talk to your son about this and then getting him started with a grief counselor who specializes in working with children are incrediy important. \n\n\n\nAlso please speak with the court regarding custody so your ex-girlfriend's mother/sister/other relatives don't try to take over guardianship of your son and that you can get whatever needed (home visit ready, necessary  paperwork, etc) in order to become the legal guardian of your son.\n\n\n\n\nDon't forget to gather what photos and such things of her you can to show your son often to help keep her memory alive for him.\n\n\n\nBest of luck navigating through this incrediby difficult time.",
            "I know it's hard to think about it but you need a lawyer.  Now.  If there is no custody/visitation order you may need to establish yourself as guardian sooner rather than later.  If there's no one else (ex's parents or sibling) it may not be an issue,  but better safe than having to hand over your son.  Also a lawyer can help negotiate any benefits or life insurance due your son\n\nSo sorry for your loss.  Second or third vote for grief counseling to help you tell your son",
            "Tell him the truth man.\n\nTake it from someone who was lied to all through childhood about stuff like this, it hurts more to find out you were lied to and someone tried to spare your feelings than it would have been to just know the truth.\n\nObviously you'll have to edit out some details until he's older, but don't say something silly like \"she went on vacation\" because that will cause resentment etc",
            "If you are not on the birth certificate and don't already have some sort of court issued visitation/custody... the suck is only just beginning.\n\nI would consult a family lawyer ASAP.",
            "*hug* I'm sorry for both of your losses. This will take a lot of healing, but she will forever be in the hearts of those that loved her.",
            "I'm so sorry for you and your son's loss.  You as his father will be your sons rock over the coming days, weeks and months.  He will need you and you will need him.  Don't loose yourself, don't bury the hurt and the pain by taking care of your son.  He needs you whole and in one piece for the long haul..  Seek counseling not just once but repeatedly over the years to come.  Though it sounds like she had her issues, keep her in a positive light for your son.  \n ",
            "[deleted]",
            "Man dude I am so sorry for your loss. I'm sending good vibes yalls way. ",
            "Sorry for you and your son's loss. Make sure to get custody of your son locked down.",
            "Honestly this is outside of what reddit can immediately help with other than to say, please go get counseling and therapy for both you and your child.",
            "You are my parents.  \n\nWhen I was 3 my mom died and left my 35 year old dad to raise me and my sister.  \n\nI don't have many answers for you, but I would recommend honesty with you son.  \"Mom got in a car accident and can't come home\" may not be understandable to him now, but it won't be long before he can and you won't have to bear the weight of *when* to tell him.  He will ask questions, and you will find a way to answer them.  This is how kids learn about the world. ",
            "I am so sorry for your loss.  Focus on your son and his needs.  I know you have needs to, but you are the only stable thing in his life.\n\nCan you bring his comfort items to your home and try to ease the transition? Try and keep his routine if you can (daycare, outings with friends, favorite foods).\n\nGet yourself a support group, and rely on them.  Tell them what you need, tell them what your son needs.\n\nAnd then as awful as it is -- you should start preparing for the guardianship boat to be rocked.  But stay firm, you are his father, and you are what he needs right now.",
            "I'm extremely sorry this happened. Lawyer up immediately, get his custody paperwork out of the way. If you are not on the birth certificate, establish paternity via a test right away. Ask your lawyer about what else needs to be done - social security benefits for your son being a big one.\n\nFortunately, he is very young. He will miss his mother, but at this age it is easier to overcome. There are many children's books dealing with loss of a parent or loved one and how to explain it in a way they will understand.\n\nIn the meantime, please find some grief counseling. Not only will it help you, it will help you be prepared to deal with discussing with your child about what happened to his mother. Also, do not be afraid to ask your friends or family (if they're supportive and not toxic) for help if you feel overwhelmed.",
            "Contact your local hospices. Many have grief counseling groups for different age groups that will help you both cope. They'll accommodate you and and your kid both separately and together.\n\nDo not hide this from him. He'll hate you for it later. Give it a few days, meet with a psychologist, but you'll have to explain that there was an accident and she passed away. You won't have to explain the specific details. ",
            "I am so very sorry for your and your son's loss. Truly. \n\nRecommend this for you:\n\n\nI Wasn't Ready to Say Goodbye: Surviving, Coping and Healing After the Sudden Death of a Loved One\nby Pamela Blair PhD ), Brook Noel \n\n\nAnd this for your son:\n\n\nI Miss You: A First Look at Death (A First Look At Â…Series) \nby Pat Thomas , Leslie Harker\n\n\nTime of course will be your friend in all of this. Also I urge you to get some counseling for yourself and your son for emotional support.\n\nI hope you update to let us all know how you and your son are doing after some time has passed. \n\nGrieve, and allow your son to join you in grief - together you will make it into the the future, whole and believe it or not, happy. But it will take time.\n\n*Nana internet hug*",
            "Children normally form distinct, long term memories at four. Good news is if you and the extended family return quickly to a new normal then your son will not be scarred in the way an older child would be by loss of parent. Gather up pictures and have family write down memories of happy and funny times related to your son's mother. Create a scrapbook and also digitize and store copies in the cloud. This memento is his mother now. No extra lectures on drinking etc or your son will wonder if he is genetically doomed to die drunk from less than optical choices. He has half your DNA so assume he has his mother's best qualities only. Peace be with you and your son.",
            "My uncle died right after his youngest turned 4. It was a lot of repeat of \"daddy can't come home, he died.\" Kids that young have a hard time grasping the concept of \"never.\" Reassure him that mommy loved him and get into some therapy. Do not be afraid to share the news with his daycare and/or school they might have some good resources for you and the teachers will be sure to keep an eye on him to see if he is struggling.\n\nMy older cousin was seven at the time and she had a much harder time with it. She wouldn't sleep if her mom wasn't home and wouldn't sleep in her own bed for some time. It is perfectly normal for kids to develop anxiety over losing their other parent but with a therapist you can keep it in check.\n\nYour son really just needs you to be with him now. To be a steady care giver that loves on him.\n\nSadly, my younger cousin does not remember her dad at all. No memories of her own. But a traumatic experience mixed with a young age can do that.\n\nShe also really wanted to have a photo of her and her dad next to her bed so she could look at it or hug it when she needed to. \n\nHang in there and do not be afraid to reach out. Always look for the helpers. :)",
            "My ex girlfriend - who I was just rekindling with and about to meet up with in Thailand THIS month - died last month. She was 25 and she too went out for some drinks where she was staying in Berlin. \n\nShe just... never woke up. Her heart apparently failed in her sleep. \n\nI don't have any advice - just feels for you. I'm so sorry this happened to you. I've been torn up about it since. \n\nYou want death to be something you expect and can prepare for - like a grandparent. Then you realize it just happens and someone gets ripped from your life in an instant. ",
            "Are you on the birth certificate? \n\nIf not, might want to get paternity established.",
            "I'm so sorry for your loss, OP. I can't imagine how you must be feeling right now. I'm going to second the suggestion to consult with a child-psychologist. Nobody here can predict how your child will be affected right now and it's important to get the advice of a professional. In the meantime, be good to yourself and your son.",
            "Just, \"mama loved you and she had an accident\". That said, your child may be eligible for some kind of social security check, if you're in america. Look into that.",
            "This doesn't help with any of the pain you're feeling but reach out to a professional for help. Reach out to multiple professionals, find the help you need for yourself and for your son. \n\nHang in there man, eventually you will learn how to not let the pain overwhelm you. I think the pain for that sort of loss never goes away, it just becomes manageable. ",
            "Lots of good advice here. Condolences for you and your kiddo.\n\nIt's tough to \"get serious\" when you want or need to grieve, but you really wanna dive right in. Family court lawyer, death certificate, SSA, grief counselling - all of it. The longer you wait the more insurmountable it seems due to the weight of all this.",
            "Take custody of your son. You will need to take him to the doctor he sees with her to see if there are any medical issues in progress (if there are privacy issues with this the doctor can guide you in resolving them) and you will need to find out when any immunisations are due. \n\nIf her family are decent people treat them similarly to how you would if she'd died and you'd still been together. Contact them, tell them you loved their daughter (although in this case you'll need to add \"but obviously it couldn't be\") and that you want them to still be in your sons life as much as they've always been. Find out when she has been used to having them care for your son or visiting them with your son or having them round to visit your son,  and organise to take up the same deal if they'll do it for you. That way your son does not feel he is losing grandma, grandpa, aunts and uncles. Eventually those relationships will change, they may get more close or more distant, but start from where those relationships are now for your son's sake.",
            "no advice, other than to keep it simple when you explain to your son.  he's only three - much of this will be lost on him, he likely won't have the reaction you expect, and he's young enough that he'll adapt far more quickly than you to this new world order.  please, please don't project your own very adult, very realistic pain onto him.  \"mommy went to heaven\" (or whatever, if you don't believe in a higher power).  \"no, she won't be coming back, but she really loves you and i know she's looking out for you in her own way.  even though she isn't with us any longer, you'll always be in her heart.\"  (even that will be lost on him at this point; that's more for when he's five or six and begins questioning in a more mature manner why he doesn't have a mommy.) etc.  once he's older, you can explain more in depth, but for now, keep it simple.  and address YOUR grief.  that's going to be critical in these coming months.\n\ni'm really, really sorry.  take care of yourself and your boy, and i wish you the best.",
            "/r/GriefSupport is there for you, and even though you weren't married /r/Widowers would be worth visiting too. ",
            "I was 4 when my mom died. my sister was 6. I don't remember her very well(I'm 29 now). I wish I did. she had cancer. my sister remembers some things.\n\nwrite down memories when u can. and keep pictures all together for him when he gets older. he will want to know about her.\n\nmy dad took care of us our whole lives. he is my best friend. it was hard without a mom, but my dad is everything to me. you will be an awesome dad to your son too. I don't know how u do it, but dads always find a dad joke:) \n\nplease keep your head up and do see a grief counselor. both of u should see someone as soon as possible. dad told me that he took some classes when mom died that really helped. you will make it through this. u and your son are going to need each other most of all, and your family and friends. reach out for help. \n\n\nI'm so sorry for your loss. pm me if u want to.",
            "Three simple things:\n\nI am so sorry.\n\nAllow your son to grieve, fully, in his own time.\n\nAllow yourself, as well.",
            "I'm on mobile so I can't link it, but there is a podcast about a children's grief counseling center in salt lake city. They interview the kids and talk a lot about grief in children. Please look it up and listen! It's called \"Birds & Bees\" and it's on This American life. It's specifically about, how do we explain grown up concepts like death to a child?",
            "I'm very sorry for your loss.  You may want to try /r/widowers as well as this subreddit.  ",
            "I'm so sorry... That's got to be one of the worst things a man can experience.\n\nDon't feel afraid of getting a child counselor, and one for yourself! Navigating through pain like this can be difficult, for both you and the child.\n\nI wish you the best of luck!",
            "sorry about your loss, no words will make it better for either of you, only time.",
            "I'm not sure which country you're in but I'm in Canada and we have a program here called Rainbows which is a free grief counselling classes for children and for parents. I'm a facilitator for this program and I really suggest that you look this up. It's all in a group setting so your child will interact with other children who have lost a parent. And you will get to learn coping strategies and have the support of other parents going through the same thing. \n\nI know they have this program in other countries under different names.\n\nGood luck op. Sending love and prayers for you. ",
            "Sorry to hear of your loss.\n\n\nYour son may be due survivors benefits on his mother's Social Security record. I won't make any assumptions on your financial situation but he is entitled to benefits regardless of your earnings (assuming she worked the minimum years) and those benefits could assist in providing for him or could simply be saved on his behalf. I would recommend calling SSA to apply. ",
            "At that age and developmental stage in life children are just learning how to process emotions. Processing something so deep and real is hard for us as adults. \n\nI think having vulnerable conversations about how it is okay to express emotions (even as a boy) would be helpful for him as he grows and matures. \n\nThat is a heavy thing to grow up with, I grew up with a similar situation. My mom sat me down once a year and told me the story of how my parents met, had me, and how he was gone. The older I got the more detailed the story was. She always made sure I understood what she was saying and made sure to patiently answer any questions I had. This was crucial to my healing. \n\nAlso I am so so sorry that you have to go through this. Grief is hard. Helping someone else grieve is even harder. Stay strong. ",
            "I don't have any advice to give. I'm not all that old and not that worldly.\n\nI just want to give you an \\**internet hug*\\* and wish you all the best.",
            "Go to a grief counselor. \n\nIt's normal to not know what to feel. Whatever you're feeling is normal.\n\nI'm really so sorry for your loss. You have your son, and keeping him safe and happy is your priority. ",
            "No words of advice for you, OP. Just a lot of internet hugs for you and your little one. If you ever need a shoulder, my inbox is always open.",
            "Sorry for your loss & his. How is your relationship with her family? He is going to need every one of you for years to come. You, too.",
            "I'm really sorry. Best of luck to both of your families and to your son. ",
            "I'm so sorry, man. Grief counselor could help you get your bearings straight. Don't feel like a grief counselor is for wimps. Death is something that most people are never taught to deal with properly and there is always the issue of how it happened which adds to the stress and turmoil. \n\nGood luck man. ",
            "Hey man sorry for your loss. It might not be what you want to read but you have to be super strong for that 3 year old to make sure this doesn't devastate him. Don't break in front of him a time will come that you're going to have to explain this to him so you have to be strong. You need to be the constant in his life that he can lean on. I wish you guys the best.",
            "I'm so sorry for your loss. Please, please take your son to counseling. \n\nI lost my father at age three and didn't get proper therapy, until I was a young adult. I struggled with the loss my whole childhood.\n\nPlease get help for yourself and for your son, this can hurt you for years to come if you don't do the proper healing now. I can't speak for my relatives who chose not to seek help, but for me, it helped me tremendously. ",
            "Ugh. As a mother of four young children myself, this post just took my damn breath away. I don't have any good advice for you, I just wanted to let you know I've got you and your boy in my thoughts and prayers. Never been so sad for a stranger before...I really wish there was something I could do to help you. You and your kid hang on to each other now. He's missing a huge part of what kids need during their childhood. He's gonna have a hole in his heart where his Mom used to be...and how big that hole is and how much it affects him now lies in what you do next. The two of you are best buddies now...you're all each other have. Make him the center of your world. What a painful ordeal for a child to lose his mother so young! This is heart breaking! But your love will make the pain of this so much more bearable. One day, he will realize what you did for him. You can do it, Dad. Hang in there. ",
            "Just want to add my condolences here.\n\nThere's no easy way to do what you must do.  I wish you all the best.",
            "If your employer offers an EFAP (employee and family assistance program) you should take full advantage. I'm thr EFAP rep for the fire dept I work on. It's a great resource. AND it's free.",
            "I'm am so sorry about your loss. Stay strong for your son and yourself. Look for a counselor for yourself and your child,  they will be able to help you more than you know. We are here to help you as much as possible.  I'm sure you will be able to cope through this tough time for yourself and your son. ",
            "No words, no advice... just an apology. I'm so sorry.",
            "Alcohol takes another life too soon. Sorry for your loss, pray you never feel a pain so unreal ever again.",
            "I have just lost a friend recently.. but his daughter was around 8, she unfortunately was there when they found him collapsed on the floor the next morning.  she seemed to \"handle\" and \"understand\" fairly well... it wasn't till about a week later that i think it sank in that he had passed.  children especially young children seem to handle these things better but also sometimes things manifest later in life.  he was 43 and died suddenly.. we were texting and suddenly he stopped responding so i went to sleep, figured we would finish planning our hiking trip the next morning.. i found out he collapsed mid text with me and i never knew. ",
            "So sorry for your loss, OP.  Sorry for what your son has to go through as well.  So sad. ",
            "I'm so sorry for your loss. :( I'd also suggest grief counselling and a child psychologist.\n\nDon't forget to take care of yourselves and let your friends/family spoil and look after you guys -you'll need the support and they'll also help you get through it. \n\nSending big hugs xxx",
            "Damn man I hate to hear such a horrible thing man. Im sorry.",
            "Time to be the best Father in the world right now. Your son should be your only focus, he will need you to be there for him. ",
            "Life happens.accept that your experience is only unique to you. It's time to do the heavy lifting. That boy needs you. Do the work. I'm sorry for your loss. Nobody said life is fair. Again, sorry.",
            "Just tell him the truth. Im sorry for your loss. My condolences. ",
            ":-( Just tell him about the good times. That's all you can do. ",
            "I'm so sorry for your loss. It's a loss that's very difficult to put a name to, losing the other parent to your child. Most cities of any significant size have a children's grief program where people are trained in helping children grieve in a way that is appropriate to their age. They will also teach you how to help him with his grief, which is going to be very difficult with a child who can't adequately explain how they feel or even fully comprehend death. The hospital probably has someone like a social worker who can help you get in touch with these resources. Don't forget to take care of yourself and accept help from those close to you. No one should have to go through this, especially not alone. ",
            "That sucks, keep ur head up... You can help him by giving him kids book, I'm sure you'll find something that covers this subject. ",
            "The grief you will get through. Others have said counselling and such, probably a good idea.\n\nExplaining it to your son is tough but simple. Right now it's mommy got hit by a car and she died. These things happen, and they happen often enough that it won't seem strange to him just unfortunate.\n\nYou'll get through this though, it'll be hell but you will and so will he.",
            "Reading your words tugs at my heartstrings. I think about this *literally* every single day - getting that call. Be it from a parent, a former lover, or the friend of a current. \n\nEven in your writing your strength shines through. Montaron87 provided the best advice, and I hope you'll follow up with us about the journey ahead. It will be rough, but you will have our support.",
            "Go get a lawyer asap get custody. Then from their just raise him the best you can. Explain to him his mother is dead.. how? Just be honest. He will cry. He will be sad for a long time.. but with you he will get stronger and you will both move on.",
            "I'm so sorry, stay strong OP! ",
            "Sorry to hear of your loss, the pain must be unbearable,.., and the concern for your son must be immense. \nHopefully a much closer relationship between your son and yourself might be a positive to salvage out of this tragedy.",
            "Wow, I am so sorry for your loss. So extremely sudden, but sometimes that's really just how these things go. If there is any positive news at all in this, I think it is that your little guy is still too young to over-think the situation much. He will wonder where is his mama and when is she coming back, but he will also be more able to adapt to the situation. As many others have suggested, I would recommend a grief counselor for you, and be as close as you can with your little son.\n\nSo sorry. You are in my thoughts.",
            "Time. Time heals everything. It may take weeks, months, or years. But no one day you'll get over it. Its not impossible and you can hold her close to your heart but time heals everything.",
            "I'm sorry. It's going to hurt. Just please don't get into the trap of blaming yourself for *any* of this. To quote CoCo Chanel, \"Guilt is perhaps the most painful companion of death.\" There are things in life we simply can't control.\n\nWhat would she be wishing for you right now? For your son?",
            "I'm so sorry to hear that man. I can't imagine being in your situation. Hold on to that kid, and make sure he/she has a good female figure in their lives as well as you. This can be an aunt, grandmother, stepmom, family friend..",
            "I'm so sorry to hear of that, such a terrible situation. I think that you should always say great things about his mother and remind him how much she loved him. As for breaking the news of her passing, I don't think there's any easy way to do it. I wish you the best.",
            "My condolences.  These are the hard, hard events.  You have already gotten some excellent advice for telling your son.  I can't add anything to what's already been said.  \n\nOne thing i would suggest, but it will be very difficult.  Put together a scrapbook of his mom's life.  Get with her parents, get pictures, videos (especially of her talking/singing/etc.), have some of her friends talk about her, etc., you get my drift.  This will be important later on in his life and it will help him know his mom better.  (Also, while putting it in electronic format is fine, *make sure that you make some hard copies*.  It would be a huge loss to go through  all the effort, emotions, etc., putting this together only to find out that there are any devices that can play it a few years later when he will be more interested.)",
            "I have no advice, but I am so very sorry for your loss.",
            "Don't feel bad that you feel guilty because you now have to look after him. It's natural to feel that you have had this dumped on you.",
            "Get off Reddit, man. I'm super sorry for your lose but to get some real heartfelt advice, go talk to a family member or hers. Then go see a grief counselor. Reddit, though it may seem appealing at first just to get something off your chest, may give you some things you might not need to hear. ",
            "My comment is probably not the nicest one.\n\nWhat the hell was wrong with this woman you loved?  No one with a child should be getting that drunk, not ever.  Going out for a drink is one thing, getting shitfaced like that is entirely another.\n\nIn my mind the best way to explain it is to do so in two stages.  The first being that she was out partying late at night and got hit when she was not being careful crossing the road.\n\nThe second would come later, after they are a little more mature.  That she got hit when she was not being careful crossing the road because she was so drunk she could barely walk.\n\nThe first is useful for helping reinforce the idea of looking where traffic is and where it will be prior to a road crossing.  The other helps with the idea of drinking is okey, but do so with moderation.\n\nThe girl was a cheater and a drunk, sounds like a party girl that never grew up and it will scar your child's life.",
            "What a way to go.",
            "How does someone barely able to walk manage to run into a car on a street? Where were her friends? Did no one care to watch her once she got drunk? Who goes out drinking that hard without reliable friends? I'm having trouble understanding how something so ridiculously preventable and tragic happened. ",
            "[deleted]",
            "[removed]",
            "I'm sorry, man. Maybe you can turn a negative into a positive. Use this a lesson to make sure he always looks both ways.",
            "When your son is older at least to the age where he feels comfortable walking without holding your hand, you need to sit him down and get real with him. \nTake on a serious tone and explain how important it is to look both ways. \n\nYoo fekkin neckbeards ain avv a chuckle leff in yoo worfliss sax",
            "> because I feel like a child should never be torn away from his mother\n\nThis is the most respect-worthy thing i'll read all day. You're a real man.",
            "I'll sorry for your loss. Move on.",
            "[removed]",
            "[removed]",
            "[deleted]",
            "[deleted]",
            "Sorry but ... Karma !!",
            "[removed]"
        ]
    },
    {
        "post_id": "7eamb3",
        "author": "throwaway9474592",
        "title": "[Update] My [24F] boyfriend [24 M] won't let go of the past",
        "url": "https://www.reddit.com/r/relationships/comments/7eamb3/update_my_24f_boyfriend_24_m_wont_let_go_of_the/",
        "score": 3166,
        "num_comments": 198,
        "created_utc": 1511200000.0,
        "selftext": "I wrote [this](https://www.reddit.com/r/relationships/comments/7d3wb6/my_24f_boyfriend_24_m_wont_let_go_of_the_past/) post last week about my relationship. I had last spoke to him on Wednesday, where I told him unless he could let go of the past and stop bringing things up, then this relationship was over. I was done being the emotional punching bag. I ended up breaking up with him on Saturday. I wasn't sure what I was going to do, but there were a couple of things that really sealed the deal for me.\n\nWhen he came in the house, I hadn't even brushed my teeth yet so I went to go do that. As I'm brushing my teeth, he immediately stated that I was brushing my teeth wrong, and, \"When are you ever going to listen to me about how to brush your teeth?\" Then, when we went to my room, he asked how much I had cried since Wednesday. When he said this, he looked happy. Like it made him happy that I was so upset about this whole thing, like he took it as flattery. \n\nIt was at that moment I knew it had to be over. I love him so much, and am pretty miserable, however I know I needed to do it. I keep thinking that if I were in his shoes, and the relationship was so rocky, I wouldn't be criticizing him on how he brushes his damn teeth. \n\nWhen I was breaking up with him, he kept saying this was the wake up call, and he was going to change. That I was giving up on him, and at least he can say he tried and I can't say that. He was relentless, but I stuck to my guns. Before he left, he told me he really hoped I would see a therapist, because I needed help. \n\n\nIt should also be noted that I am the same user who wrote a relationships advice post about having a boyfriend who wanted me to change my hair color. I'm pretty sure I deleted the post, so I cannot link it, but I honestly should have listened to you all then and not gotten so invested in someone who constantly felt the need to want to change me through controlling comments. \n\nEDIT: OH MY GOD! You guys are so awesome. I have been so upset, but reading these posts have further let me know I did the right thing. The hardest part is that there were great times, and even reading my posts I worry that I was too hard on him and painted him too negatively, but I'm seeing now that this is just me making excuses. I feel terribly guilty about how sad he must be, but I know this will soon fade. You are all absolutely amazing and kind.\n\nJust to clarify, I was the girl whose boyfriend wanted her to stop bleaching her hair blonde because he couldn't date me unless he saw me \"natural\". \n  \n  ---   \n  **tl;dr**: Boyfriend and I broke up, absolutely heartbroken but know it had to be done. ",
        "permalink": "/r/relationships/comments/7eamb3/update_my_24f_boyfriend_24_m_wont_let_go_of_the/",
        "comments": [
            "You're grieving for the relationship you wanted, not the relationship you had. Take some time and get to know yourself again. ",
            "He was emotionally abusing you, absolutely. I mean, *he criticized how you brush your teeth*. And then he asked you how much you cried and was HAPPY you've been crying.\n\nI've been married a long time. My husband and I absolutely have different methods of brushing our teeth. Guess what? The only person who might care is our dentist! And she's had no complaints to either of us (that I know of - I mean, not like I checked if he had any).\n\nThis guy is toxic, don't look back!",
            ">He kept saying this was the wake up call, and he was going to change.\n\nExcellent. So if you start having niggling doubts about taking him back, remember that if you get back together he will no longer have the motivation to change.\n\nI also read your previous thread and I can guarantee that everything he's told his therapist about your relationship was a distortion of reality, half-truths, and outright lies. He didn't go in there and say \"I stop my girlfriend from spending time with her family through passive-aggressive manipulation\" - he said \"I feel like she's prioritising her family over me. I do try to be understanding, but she's completely stubborn about compromising on this. Her sister is a wild party girl, and I worry about the negative effects she's having on my girlfriend.\"",
            ">Then, when we went to my room, he asked how much I had cried since Wednesday. When he said this, he looked happy. Like it made him happy that I was so upset about this whole thing, like he took it as flattery.\n\nThese three sentences just painted a portrait of an emotionally abusive partner. He literally takes pleasure in your misery and this guy wasn't even smart enough to *hide* it. ",
            ">Before he left, he told me he really hoped I would see a therapist, because I needed help.\n\n*Someone's* pretty good at projecting, I see.",
            "This dude is projecting 100%. Him saying you need help is his last way of trying to blame his controlling behavior on you. \n\nThe only thing I think you could stand to improve is your self respect so you don't get so invested in someone hurting you like this. \n\nGood luck OP I'm glad you ripped the band aid off. Be strong. ",
            "> That I was giving up on him, and at least he can say he tried and I can't say that. \n\nNo one who says shit like this has any intention of changing. Without exception. This is a blaring siren of “I maintain that everything wrong with this relationship is on you and you alone to fix.” He’s not sorry.\n\nYou did good. The relief will kick in soon, if it hasn’t already. Been there, done that. You’ll be just fine.",
            "For what it's worth, I do recommend talking to SOMEONE now that he's gone. Talking to a third party might help you walk through your relationship and become more cognizant of red flags. This could help you avoid people like this in the future! \n\nI think in time you'll find that you loved his potential, not the man he actually was. I highly doubt you (or anyone) could genuinely love someone who is happy that they made you miserable. A therapist could potentially help you really move on from the mess he tried to turn you into. ",
            "I somehow read your sentence as “I stuck to my gums”, and I was imagining you brushing your teeth as you ditched him. Well done OP. Love the way he threw in a few undermining comments on his way out the door. What a prince. ",
            "It may hurt to break up but at least now you can move forward with the rest of your life. This guy would've slowly sapped your energy",
            "> Before he left, he told me he really hoped I would see a therapist, because I needed help.\n\nManipulative to the end. Good riddance.",
            "Nice work! You did the right thing. He's the POS who needs a therapist. ",
            "I haven't seen any mention of this yet, so allow me:\n\nFor the sake of your mental health, it would be wise to block your ex on any and all platforms which can be used to communicate with you. Because, frankly, if you think this is over you're most likely wrong.\n\nFirst up is via your phone. Google 'ios block caller' or 'android block caller' depending on your phone for instructions on how to block a caller. All modern phones have this feature; your phone would have to be pretty old not to.\n\nNext is social media. I'm sure you're young enough that you can find the ways to block people on various platforms. If you can't, a quick google search will clear it up. Block him on all of them.\n\nLastly, email. Depending on your email provider, there's usually a way to setup a rule that automatically deletes mail from a certain address. So as to not make this a novel, I'm going to tell you to google for the instructions on how to do that *yet again*.\n\nBeyond that, you two may have mutual friends and acquaintances. Don't be surprised if he tries to use them as messengers. However, you have the truth on your side and you shouldn't be afraid to use it. Honestly, if someone takes his side over yours you probably don't want that person in your life anymore. After explaining to anyone what kind of abusive jerk this guy was, follow up by changing the subject. If they push the old subject, remind them you don't want to hear messages from your ex and that's final. They keep pushing, and it's probably someone you don't want in your life.\n\nThis may all seem extreme, but a manipulative abuser will usually try every trick up their sleeve in order to unbreak-up. Because it's way easier to control and manipulate someone you've been controlling and manipulating for 18 months than it is to groom someone new. Best for you to get ahead of that and cut off all the things he could use. Plus, you're got better things ahead for you without that jerk in your life ;)",
            "I'm proud of you!!  Does it smell fresher in your place already?  Because you just got rid of a steaming pile of hot human garbage, and I imagine that all areas of your life are about to get a whole lot better.  Congrats!",
            "So earlier this year I got fired from a job that I loved. I was heartbroken when it happened. I felt like a failure and I felt so upset that moving on to a new job meant I wouldn't be able to do the work I was so passionate about that I had done at my prior place of employment. \n\nBut with time, the wounds didn't just heal. It allowed me to reflect on how the manager who fired me was a toxic, corrupt, untrustworthy person. Working under her was a constant struggle, but the positives of the job made me think of it as \"not that bad\" or \"worth putting up with.\"\n\nIt's not a relationship, but it shares a lot of those commonalities. And I guess it's my way of saying to you that I know it hurts right now, because it's still so close by, so raw. But with time, you'll realize how much better your life is without that toxicity, and you will heal. I wish you nothing but the best. ",
            ">Then, when we went to my room, he asked how much I had cried since Wednesday. When he said this, he looked happy. Like it made him happy that I was so upset about this whole thing, like he took it as flattery.\n\nThat’s actually chilling. If someone were to cry over me or something I did I would feel guilty, not happy. He takes pleasure in your suffering.\n\n>That I was giving up on him, and at least he can say he tried and I can't say that. He was relentless, but I stuck to my guns. Before he left, he told me he really hoped I would see a therapist, because I needed help.\n\nUgh, the projection is strong with this one. Don’t ever believe a word that this abusive sadist says. You tried to make it work. You gave him plenty of opportunities to do the right thing and he squandered them all. He is the one who needs therapy. He is the messed up individual.\n\nCongratulations on finding the strength and courage to rid your life of his toxic presence. As other PP’s have said, the pain is over a boyfriend you should’ve had, not the one you did have. \n",
            "Omg. Don't tell me he was ragging on you for not brushing each tooth individually in a circular motion....",
            "He is a straight up narcissist and you've dodged a bullet. Feel proud of yourself. ",
            "The thing about abusers, speaking from experience, is that it's never all bad all the time. It's a pretty common tactic for keeping their victims locked in a relationship. They have periods where they're so sweet you wonder if you imagined all the terrible behavior.\n\nYou did the right thing here. Don't look back. ",
            "So much of what you wrote in your previous post and this post reminds me of my last relationship. My ex used to be fucking flattered when I cried and be like \"aww... You care!\" like it was sweet that I was so hurt and then use that as an opportunity to be extremely affectionate and take care of me and then turn it into sex. Wow. I'm SO glad you left this asshole. Here's to a brighter future!! ",
            "[deleted]",
            "You did the right thing! An emotionally abusive partner is not the kind of person you want to build a life with. You deserve *sooo* much better.\n\nI can tell that you are a super caring person. The right person will come along who will support and encourage you instead of tearing you down.  \n\n",
            "I knew you were brushing your teeth incorrectly. ",
            "This guy sounds like a borderline.",
            "This is abuse. Please read this book, why does he do that by Lundy Bancroft. Whatever things he has done to you, they have a name for it. It is actualy very tactical. Good thing you have left OP",
            "Sounds like a classic loser who tries to make you feel bad because his life isn't where he wants it to be.\n\nHe treated you like shit so he could:\n\n1) Feel better about himself\n\n2) Control you\n\n3) If you did break up, he could justify it by blaming you. \n\nYou will probably find a better guy if you know to look for the signs of emotional abuse early so you don't repeat it",
            "> When I was breaking up with him, he kept saying this was the wake up call, and he was going to change. \n\nNo.  You telling him your concerns, several times over the course of the relationship, was his waking up call.\n\n> That I was giving up on him, and at least he can say he tried and I can't say that. \n\nHe tried?  Even if he did, he failed.  And you have a right (and a promise to yourself!) to find somebody who treats you well.\n\n> He was relentless, but I stuck to my guns. Before he left, he told me he really hoped I would see a therapist, because I needed help. \n\nSo he wasn't really trying at all, and he hasn't really changed at all.\n\nYou missed out on your chance to be 35 years old, with a 5 year old and a 3 year old, getting divorced because he had to sleep with his co-worker and blaming it on you.  I'm glad that you will let somebody else be that woman.  ",
            "Sometimes when you're in the situation you need a little extra time and evidence before you're ready to bail, no harm in that.  You'll know better for next time, it's all a learning process :) ",
            "Sounds very emotionally manipulative. You're better off without him.",
            "I read over the original post and I honestly feel like we are not getting the whole story here. The details just don't add up. I feel like there is critical information that you left out.\n\nWith that said, it doesn't really matter. The relationship clearly was not working out, so you made the right choice to end it.",
            "Your ex sounds like an asshole.",
            "I'm so proud of you! It's hard to let go of a controlling relationship, but you did it! Treat yo self to a girls night or some ice cream, you deserve it sista!!!!!",
            "If I were you I’d wonder why you were attracted to this guy in the first place. He’s obviously an abusive sociopath. What’s your relationship with your dad like? Your mom? Have you always ended up with guys like this? Maybe some therapy is in place. I obviously might be getting ahead of myself, and could be completely off base, but it’s something to think about. Also, I don’t mean that there’s something wrong with you, but perhaps talking things over and understanding yourself better might be good for you and could help you out. Good luck. ",
            "Good for you. It won’t be easy but stay strong and take comfort knowing that life can be so much easier. ",
            "You will make it through this, stay awesome, be awesome. If you need a hug, we are here, you are not alone. ",
            "Yeah so he said he had a wake up call and still said you need help? He has missed the point so much that he is not just an abusive asshole, he's a stupid one at that. ",
            "Good for you! You did the right thing.\n\nNow go find yourself a guy who'll treat you decently!",
            "I for one am excited for the arrival of the virtual girlfriends so that these people will have their slaves without bothering anyone else. ",
            "You're grieving for the good parts, and what could have been if he hadn't been an ass. Stay strong OP. ",
            "Sounds like my BF. It’s classic NPD behavior. It’s abusive. Nothing less. It hurts now, but be thankful you dodge a bullet. It’s progressive behavior and would not stop. I’m in the same boat now. Should probably take my own advice. I feel for you. ",
            "This guy was toxic and manipulative and you were right to break up with him. \n\nI will say though, hanging out with a guy you hooked up with, even if it was in high school and he's now with your best friend and she's there, and you hid it from him, is still messed up if it makes him uncomfortable/upset. I think this goes both ways though, regardless of gender, it's not just a guy thing, it's more person-to-person, some people simply don't care about you being around an ex or old hook up, while others freak out. There may be more to it but you can't really fault a person for it IMO. This doesn't excuse him texting his ex though, especially if he started it just to get you mad, or any of the other twisted thing he did. ",
            "Well he was right about one thing and one thing only: seeing a therapist wouldn't be the worst idea! If it's possible (time and finances wise) it might be good to unload all the shit that's built up over the last 18 months dating this broken POS. \n\nHaving said that, you've already made progress by finally admitting that he was a lot worse than you were telling yourself and breaking free from his grip. Just make sure you keep your wits about you and don't fall into the same trap with the next relationship. ",
            "dang, first congrats on having the strength to leave a relationship like that, sometimes we get caught up on the feelings and the neediness to be with someone that it clouds or judgement about what a real relationship should be like, and that often conflicts us and leaves in a place where you either jump or stay in something shitty.  \nGood for you for jumping, take some time to do YOU. Learn something new, pick up a hobby, do something for YOU.  \nTime will heal eventually of course, and it's okay to grieve a relationship, but at least you're smart to know what you deserve/need.  \nGood luck OP, and have some fun, enjoy life!",
            "I didn't see your oruginal post, I was shocked when I read it. The only thing that gave me comfort was the knowledge that the person who wrote it is already liberated. You definitely did the right thing. Please don't delete yiur posts or save a private copy in case you start doubting you decision later. Sometimes we look back and wonder \"Was it really that bad? Was I overreacting?\" Here is your answer.",
            "Wow, it sounds like you dated my ex! It was the exact mind games and manipulation. All of the “it’s your fault I’m like this” bull. **The insanity didn’t stop after we broke up, either, so stay strong!** I remember in a desperate attempt to get me to come back, he sent an email with a fking Brietbart article about how there is going to be a civil war so I better leave the country with him and move back overseas where we met.\n\nNope. At that point I was just so beyond done. I invite you to read about it if you like in my “submitted” posts to this sub. I never even cried once since the official breakup (I mean I have cried that it didn’t end sooner, but never cause it ended!). **I cried so much during the relationship that I had no tears left at the end I suppose.**\n\nIt’s funny because my ex always said that “I was going to leave him so he should just end it now” whenever I did something he didn’t like. A part of me thinks he said that because he wanted to be right when I finally did leave...\n\n**Well good effing riddance.** I now currently live with my new bf and we have two cats and I have never been in such a healthy place overall. ***Keep sticking up for yourself, better times are ahead.***",
            "It's better to be single than to be in a toxic relationship. And calling this guy toxic is kind of an understatement. \nCheers, amiga, and congratulations! Now you are free to begin moving upward and I can tell you from experience that this has the potential to be beyond amazing. ",
            "\"Before he left, he told me he really hoped I would see a therapist, because I needed help.\"\n\n\nUghhhh that is a classic abuser technique to make you feel like you are the problem, and that you're crazy, not him. What a piece of work. Stay strong, and when you miss him remember that smile when you told him how much you cried.",
            "Minimalist comment. The guy is a supremo doucherino.",
            "I'm sorry you had to go through this, but I'm also OH SO glad you finished it. This guy wanted to control you, bring you down, strip you from your confidence, isolate you... Thank you, in behalf of every woman that has gone thru something like that, for sticking to your guns.\n\nAnd I agree with what has been said that you are grieving for the relationship you wanted, and will add that you are also grieving for the future you envisioned. Lots of jedi hugs. ",
            "I remember this post.  I’m so glad you left him.  Internet hugs to you.",
            "I am so happy you are away from this awful person! :)",
            "I'm so glad you got out! I was in a relationship like yours, a bit more subtle but just like that. But when it started I was 17 and didn't know abuse could look like that and got stuck for years. When I finally left he pretended to be drunk ( so I wouldn't press charges later), raped me and tried to kidnap the kids.\n\n You had an unbendable spine and knowledge of your own worth and I'm so fucking happy. Thank goodness. You should be really proud of yourself for standing your ground, it's not easy to walk away from someone you care about but you 1000000% did the right thing.",
            "You 100% did the right thing. I am guilty of being insecure and at times feeling down whenever my girlfriend has fun without me, but I would never make her feel guilty about doing those things, because she deserves to have her own decisions and her own life. I try my damn hardest to fight those insecurities everyday and be content with the fact that she does love spending time with me on a regular basis and we have a great time together always. I hope you will someday find that someone who truly loves you for the person you are, and allows you to be happy without having to feel like every part of your life is in their control.",
            "Oh boy. He sounds a bit like my ex. \n\nGET OUT OF THERE. You are worth so much more than this. You do not need to be told how to live your life and if a guy is making you cry/ giving you anxiety then he is not worth it. You need more. You are worth more. \n\nDo not let him bring you down.",
            "Wow, he did all that, even finding satisfaction of seeing/hearing you being upset and still had the audacity to recommend you to see a therapist? Jeez, you 110% did the right thing, because that guy needs help",
            "You're entirely wrong in this situation. It all stems from you inviting over a guy that you hooked up with. Then you hid it from him. That's going to be at the back of his mind bc essentially you betrayed him. You hid it bc you knew it wasn't right and there was a history there. That's incredibly disrespectful to your bf. I would be upset too.\n\nHow would you like it if he invited over his ex gf without telling you? And he intentionally hid it from you. That'd be messed up.\n\nThen you gaslit him to make him out to be the bad guy.\n\nYou are the problem. You don't need to be in a relationship. There are certain dos and donts in a relationship and you overstepped that boundary without thought. It's not that anything happened when you invited that person over, it's the thought. \n\nI just can't believe you thought that was okay. Luckily you broke up with him. After as bad as you disrespected him and have treated him, he is lucky to not be with you anymore. \n\nHave a little class. Being in a relationship changes things. You have to consider other people's feelings. Clearly you are not capable. You're heartless. \n\nEdit: All he wanted was for you to apologize for that friend coming over (that you slept with) and hiding it. Instead, you gaslight him and tell him he's controlling and get mad at him. You messed up and did something crappy and then make him pay for being mad. Take responsibility. ",
            "Sounds like you made a wise decision.",
            "Drop him. I had done the same kind of thing to an old girlfriend and I would honestly never have stopped",
            "Good job. You took the first step to getting rid of an anchor. Good luck to you!",
            "Be careful now. He is not likely to go away quietly. Be prepared for a possibility of post-split-up harassment. Come up preemptive strikes for whatever he might do.",
            "Your life with be so much better without this guy. You will find someone better  \n\nAlso, you may want to get some therapy, just so you can learn how to choose better guys from the beginning. ",
            "Yay!!! Great update! I definitely remember your post, and I was truly worried about you and your future if you stayed with that guy. I’m so happy to hear that you broke up with him, and I’m proud of you (and you should be proud of yourself!). I’m sure it was really difficult to pull the trigger and actually break up with him, and I’m sure you’re hurting right now, but just know and trust that *it does get better*. \n\nYou’re 24. You have the best years of your life ahead of you, and you don’t need to waste them on someone who brings you down, criticizes you and makes you feel bad about yourself. One day, you’ll meet a man that truly loves you, wants the best for you and makes you feel like the most special and important woman in the world. Remember that, stay strong, and don’t take your toxic, loser ex back. ",
            "Were you the girl that her boyfriend wanted to change her hair color because he was obsessed with his ex?",
            "OP, you will eventually need to seek counseling. After being in a toxic relationship, it will get worse before it gets better. You will have set backs, you may even  possibly try to reconnect with your ex but remember there is a reason you guys are a closed chapter. This life is so damn short, there is no reason to be anything but happy. You will be in a good amount of pain for awhile but time does heal all wounds, maybe not completely but you will learn that time is your friend and not your enemy. Do things for you, go buy ice cream, watch a funny movie, do anything that you enjoy doing. \n\nIn the long run, people who treat you like you are the only problem in the relationship and don’t take responsibility for their mistakes are not worth your energy. You will find someone who understands your flaws and not use them against you. Stay strong. ",
            "I just broke up with my boyfriend two weeks ago. I’m still hurting. I loved him. But it needed to be done. I’m just as proud of you as I am for myself for having to make that difficult decision.",
            "Go on and make an amazing future for yourself without the emotional baggage. It sucks, it hurts, but you'll see it soon enough that you deserved better. He didn't love you as much as he loved having the \"power\" to make you feel like shit. So let him be and you do you to get through this. Don't contact him or reply to him if he reaches out because he will. He's not worth it. At all. He found his self-worth to mean more than your actually relationship, as mentioned in his parting words. He only made a show to talk himself up because deflecting the break up and blaming you was easier than accepting how much of an emotional piece of crap he is. Maybe he knows, maybe he doesn't, but he knew what he was doing to hurt your feelings, so don't believe anything he has to say now. He's said and done what he wanted to hurt you, so don't let him hurt you anymore.",
            "That’s not how wake up call’s work. I’m glad you ended things.",
            "Good for you! And I’m really proud of you!!! Good luck. ",
            "Nice job. Sounds like he has a personality disorder. Would maybe benefit you to take a peek at some of the stories from the folks over at the sub \"bpdlovedones\"; they sound like your people. I hope you feel better about it all soon. ",
            "Emotional abusers tend to make you need their approval, which can easily be mistaken for love. I’m sure you have some attachments and good memories, but this dude sounds terrible and likely did a great job manipulating you into needing his approval. You made great moves and soon it’s gonna feel like “wow, how did that relationship ever make sense?”",
            "Good on you. I know it's hard but you'll feel so much better even sooner than you expect. I dated a guy just like this in college and after I broke up with him he started sending me messages about his feeling suicidal. He very well may have felt that way, but I know there was a chance he was lying and only trying to manipulate me. Just wanted to warn you that this may be a possibility in case your ex tries to pull something similar.",
            "I am so glad you ended the relationship. You deserve better. I was in a similar relationship and stayed with him way too long.  You were strong and stood up for yourself even though you loved him. If he tries to get back with you just remember there are so many more better options for you out there!",
            "You are so strong!  I know I am a stranger, but you are so strong! ",
            "Way to go! Honestly if you take anything away from the experience, at least now you know how you are not supposed to feel in a relationship. Be proud of yourself!",
            "What an ass. It hurts now but it'll hurt less soon, and then not at all. You did the right thing, you can be truly proud of yourself. ",
            "Well done! Good for you for taking control of your life and deciding the direction you want to go. It's going to be tough for a little while, but as trite as it sounds, time heals all wounds. I guarantee you'll look back on this relationship one day and be SO damn happy you got out when you did. ",
            "Congratulations on no longer being the supply for this narcissist! Go no contact. You sound pretty healthy given the circumstances. If you do need therapy, it's because of what he did to you, not because of anything else.",
            "It sucks but you had to do it. I was in a similar situation and am ashamed to say that I acted just like he did towards my girlfriend. I knew what I was doing was wrong but wasn't willing to change and it didn't matter what she did. I said those exact same words too and nothing changed. Maybe he'll grow up but if he can't find it within himself to change knowing that he's hurting you then he certainly can't look past what happened in y'all's relationship and move on.",
            "> Before he left, he told me he really hoped I would see a therapist, because I needed help.\n\nWell, you learned who he is right there.\n\n> It should also be noted that I am the same user who wrote a relationships advice post about having a boyfriend who wanted me to change my hair color. \n\nI admit that seems pretty weird to me. I guess I could see an SO musing, \"I think your hair would look better/interesting in [x color].\" But beyond that is bizarre unless the SO wants to change their hair color of their own volition to suit the SO.",
            "that comment about you needing to see a therapist... that is NOT okay! my ex treated me like this. calling me bipolar and crap, really messed my view of relationships up . glad you're out of that relationship! ",
            "You'll be alright. You did the right thing by letting go and not spending years with someone who abuses you. It's going to be tough at first because all you'll remember are the good times. But keep your head up!!! One day you'll meet someone who truly respects and values you. ",
            "I've only seen my boyfriend cry once - it was at a wedding. Seeing him cry filled me with such a deep since of grief that it made me realize that I a) never wanted to see him cry again and b) that the next wedding I wanted to go to with him was OURS. You deserve someone who feels the same way when they find out youve been crying - you deserve someone who never wants to think they're the reason you cry. I hope you're future partners treat you much better ❤️❤️",
            "Also, it's always best to break up with someone in a place where you have the power to leave. Could avoid the whole \"relentless\" part entirely. ",
            "See you in r/fancyfollicles!  You ARE going to have fabulous fun with your hair color now, right?",
            "You did the right thing! You may be hurting, but you'll look back at this and realize you made the best decision for yourself :)",
            "OCD that's all I can say, and it is a mental condition.",
            "Yeah, reading your previous post, it's a good thing you broke up with him. \n\nHe's not a bad guy, he's just way too immature to be in the relationship right now. Age doesn't always define a persons experience, he doesn't seem like he has much experience in relationships at all so for all intents and purposes he is a child when it comes to thinking outside of his own perspective and being in a partnership. \n\nYou didn't lie to him about your friend coming over, you just held off on telling him and he punished you emotionally about it for a month. \n\nIf he wants to be in a relationship where both people are updating each other constantly and can never be with anyone they don't have approval from their SO about, then he needs to find someone younger or dumber as far as relationships go. \n\nI wish you all the best."
        ]
    }
]