[
    {
        "post_id": "9mjhkw",
        "author": "None",
        "title": "Update: How do I [26F] tell my husband [31M] I'm addicted to drugs?",
        "url": "https://www.reddit.com/r/relationships/comments/9mjhkw/update_how_do_i_26f_tell_my_husband_31m_im/",
        "score": 7416,
        "num_comments": 121,
        "created_utc": 1539037373.0,
        "selftext": "[Link to my original post](https://www.reddit.com/r/relationships/comments/6cjph9/how_do_i_26f_tell_my_husband_31m_im_addicted_to/)\n\nI've been sober since May 22, 2017 :)\n\nIt's been almost a year and a half since I posted, I was a mess that day and really overwhelmed. You all gave me the push I needed to gather my courage and tell my husband about my drug use, **thank you so much for that**. I mean it, I knew he needed to know but I couldn't make myself follow through until I received encouragement a bunch of internet strangers. I hate to think what might have happened had I continued hiding it from him.\n\nMy husband has been supportive, compassionate, and kind throughout my recovery. I wouldn't be doing so well today without him, there aren't words to express how much I love him and how grateful I am to be married to such a good man. With the help of my therapist I was able to open up to him about being raped (it was a violent, ugly, all around horrible incident) and the effect PTSD has had on me (it's an explanation, not an excuse, for the drug use). \n\nWe've had to work on rebuilding trust and I realize that's going to take time. He still prefers I stay home most of the time and he has reservations about new friends- both are totally reasonable in my opinion. I understand his feelings completely. We do more together now and I feel more included in his life, which has really helped my mental health. Every day I do my best to prove my love, appreciation, and respect for him. We're both continually putting effort into ourselves and our marriage.\n\nAs for my recovery, I honestly feel a little weird calling it that. I didn't use long term and didn't face many of the same challenges as other addicts. But I am an addict, I'm always aware of that and I realize I'm no different fundamentally from someone doing heroin on the streets.\n\nDrugs were a distraction and a way to escape bad memories and nightmares. They were also part of my social life as my only friend in the area (at that time) used them too. Once I accepted that I had, and will always have, PTSD and began getting proper treatment I didn't want anything to do with drugs. I'm extremely lucky and thankful I stopped when I did.\n\nDealing with my mental health hasn't been easy. Last August I went to a behavioral health hospital for six days. I didn't want to go at first but my husband and therapist convinced me I needed to- they were right. I felt much better afterward and I met a few people like me while I was there, it made me feel better to know I wasn't alone. People can say that you aren't alone all the time but it's different when you actually experience it.\n\nMy husband and I went to couples' therapy for 3 months. It helped us quite a bit, we realized we needed to talk about things that hadn't occurred to either of us before sitting down with a therapist. It helped me understand his feelings and how my drug use (and concealing it from him) affected him. It helped him understand why I did what I did. It gave us a safe place to talk and that eventually led to better communication in private.\n\nI'm still seeing a therapist twice a month and attend group therapy once a month. I'm stable, healthy, and happy. I love my life and I'm really excited about the future. We're expecting a baby in the Spring and I can't wait to be a mom. I'm so looking forward to raising a family with my husband. Life is good. :) Thanks again, /r/relationships \n\n**TL;DR**: I've been sober since May 22, 2017. My husband and I are doing well, we're happy and very much in love. He's supported me and loved me through this process. We've had a few struggles along the way but we work through things as they come up and move forward. I'm continuing to receive treatment for my mental health and I feel stronger than I ever have. I've learned I can't hide from my problems and now that I've received the appropriate treatment for PTSD I don't want to hide from it anymore. I'm finally happy and excited about my life and my future.",
        "permalink": "/r/relationships/comments/9mjhkw/update_how_do_i_26f_tell_my_husband_31m_im/",
        "comments": [
            "In the running for best updates ever. Congrats on your recovery and baby on the way!!!",
            "Well done OP :) Thank you for sharing this update too, it's important for people to see that things can get better.",
            "Congrats on your sobriety and fostering openness and communication in your relationship!! Very happy for you ",
            "Congrats! It hasn't been quite a year for me. Meth was the hardest thing for me to drop.",
            "Congratulations on both your sobriety and your baby! I’m glad you were able to find comfort here and gather the strength to be honest with both yourself and your husband. You seem very self-aware, and you have made good use of an abundance of resources to keep yourself on the right path. Good luck!",
            "Great job!! Congrats",
            "You said you are an addict, fundamentally no different than someone using heroin on the streets. I believe this to be untrue.\n\nYou are a recovering addict. And that makes all the difference in the world.",
            "I actually remember this post, so pleased for\nYou all (all three of you). Congrats and well done OP",
            "This makes me so happy. My bf hid it from me for two years before he killed himself, I wish he had told me sooner instead of hiding it. I am so happy to hear this story, keep up the good fight. Cheers to your love. ",
            "I'm really, really proud of you and I hope you are, too. ",
            "Inspirational! Great job, OP. ",
            "Congrats!  You deserve to be the best you possible.  Stay strong.",
            "This post made my night.  Congrats!!",
            "I am an addict too (alcohol). I went to rehab and it was so freeing.  You can say absolutely anything and no one will judge you.  Congratulations girl!  I don't know you yet I'm still so happy for you!! ",
            "Hell yes! You have done so much hard work and I am so proud of you. Keep taking it a day at a time and congrats on the new arrival 😊😊😊 You and your husband have clearly come out of this stronger than ever. ",
            "So glad to hear this! Those first steps are the scariest. I'm glad you're getting the treatment you need, and congrats on your pregnancy.  ",
            "this makes me want to cry for you i am so happy. drugs can be so devastating. youre amazing for tackling it so headnon before it got any farther and he is amazing for being so supportive!!! ",
            "Im so glad to hear this I wish you all the best and congrats!!!!",
            "fanastic news. keep up the great effort and stay strong. you got this. ",
            "I'm so so so happy for you. Becoming a mother is the one thing that made it happen for me. (After a 12 year addiction.) It is SO difficult and scary, so I'm proud of you for quitting and being strong. Im proud of your husband for being supportive and wonderful for you. You're gonna enjoy that baby, let me tell you! In August I celebrated my ten year anniversary of being clean. Watching my daughter grow is the best thing in the world.  These are going to be the best years of your life. I'm very happy for you!",
            ">When I told him he just put his arms around me and said \"I love you. Everything's going to be okay.\"\n\nNew to your post but I read the previous one and this part really got me.\n\nYour Husband is a shinning example of what being \"supportive\" is. Definitely need more people like him in this broken world :(",
            "Wonderful update, congrats OP! I applaud your bravery and honesty, all the best to you and yours. ",
            "Congratulations!!! Good luck with the new baby and the sobriety. I think u will make an amazing mom. From reading ur story, u sound like a strong woman who has come so far. I am sorry for what u have been thru and I wish u nothing but love and continued happiness in ur life. \n\nAlso, good for u fellow Redditors for being there for OP last year. We’re all in this world together. It’s our job to help each other and help make each other’s lives a little bit easier whenever we can. Love and light all around guys. \n\n(Also, everyone here is getting an upvote)",
            "This update is amazing to see. You worked so hard and have overcome so much. Congrats on the many good things happening for you, and remember to stay strong, and even when it's hard, there's always someone there to guide you. ",
            "Congrats. Love you for being strong, focussed and increasing love for your husband.You are in for exciting times and with a baby, life is going to be very exciting and challenging for you both. Regards",
            "Congratulations on your journey to sobriety! Recovery is a hard road- I’m glad you have someone to help you stay grounded. \n\nI am a FF/Medic also I often feel either it helps us become very empathetic or some a little jaded and bitter.  \n\nIf you ever need to talk I’m here- Not sure if your husband would be interested but NA-ANON or AL-ANON might be a place that could help him process things and learn skills that will help him and you in the long run.  I’ve found AL-NON helpful personally. \n\nWishing you continued strength! ",
            "On the \"out of the house\" and \"friends\" disapproval, I understand and have some comments...\n\nAs addicts many of us will tend to, consciously or otherwise, allow influencers into our lives... And more often than acceptable, we want enablers and reinforces. \n\nFriends and social influences are powerful; they serve as justification and excuse for relapse. It IS reasonable to maintain a degree of vigilance with social connections, but deserves more discretion and consideration than a blanket \"policy\" cutting you out of society.\n\nTry something like... Fucking clay or Magic:The Gathering or eldercare volunteer or some weird social thing where you can interact completely disassociated from substance abuse. THAT is more palatable than isolation.\n\nWhile we like to say that our loved ones and family are enough of a reason to live, knowing about the beauty of the world they LIVE IN is something I find necessary.\n\n",
            "proud of you! Go on and be amazing. ",
            "Best update ever. I'm so proud of you! And your husband!",
            "Congratulations!! I’m so happy for you!",
            "Congratulations! Sending my love and support to you and your growing family ❤ you are a strong woman! ",
            "We were not lying. Do what we did and it does get better. CONGRATULATIONS!",
            "I highly recommend being very proactive about your mental health and having a strong support system in place as your pregnancy progresses & you get closer to birth.  \n\n\nIt's very common for people who have been sexually assaulted, particularly if they have PTSD from the event, to have things stirred up by pregnancy and/or birth.  It can cause disassociation, flashbacks, nightmares, anxiety attacks, prenatal/postpartum depression & anxiety, and other trauma.",
            "That is really amazing. I am glad that it worked out for you. ",
            "This is amazing news!",
            "Such awesome news. Congratulations! ",
            "This is absolutely fantastic, I'm so glad its worked out so well, and i really hope it continues to get better for you and your family! So happy that Reddit could be such a catalyst.",
            "Wait...a person can never get over PTSD? I thought it was just really hard but with perseverance I'd eventually be ok? \n\nYou seem ok, but life seems suddenly very long if we always have this on top of our other struggles. How are you so strong, so accepting and so ok with it?",
            "I’m four years sober from drugs myself, congrats! ! That’s a huge accomplishment what you’ve done, and it only gets better from here :) keep with it, and again, congrats!! :)",
            "Getting a baby after a year of sobriety? Alright then. ",
            "I’m so happy for you! Opening up and getting help can be scary, but it’s the first step! And congratulations on your pregnancy! ",
            "Proud of you. Keep up the good work ❤️",
            "Good for you! I'm so happy and proud of you. I wish you many happy years of sobriety ahead",
            "I remember your earlier post. \nI am so happy that you are doing well and in recovery. Congrats on your sobriety and best wishes in all your future endeavors. ",
            "This is the best thing I’ve read today. Proud of you! ",
            "Congrats on taking charge of your life and making it better. Your a very strong and amazing person. Happy for you and your husband. Congrats on the new baby. Wishing you all the best. ",
            "Feel free to refer to yourself as someone with substance abuse issues instead of addict. ",
            "Congratulations OP!! Keep living your best life! If you guys can work through this you can work through anything, so double bonus!",
            "Fan-fucking-tasted update. \n",
            "You’re so brave - sending you love and support from California. ",
            "Reading this made me smile. You were in a dark place and your husband led you out when you reached for him, but regardless, you did it all with your own inner strength. You're truly an inspiration. ",
            "Congratulations! Sounds like you've worked incredibly hard and are so very deserving of your current and future happiness ❤",
            "Absolutely amazing! You are so brave and a wonderful inspiration. Reading your story makes me feel optimistic for the future. I’ve never had issues like the ones you describe. Yet hearing someone overcome such difficulties always sounds remarkable. Please keep it going OP! Have a wonderful day 😊",
            "Wonderful update and congratulations on your baby! ",
            "This is so beautiful. Congratulations on your recovery. And always know there's people cheering you on. ",
            "Good for you. It's not easy. You say you don't know where you would be without him... well let me tell you... I've spent the last week and a half planning a funeral and dealing with funeral homes for my son's mom. She was the love of my life(despite our issues) and she overdosed on fentanyl on the 28th. To be blunt, she was my spouse and my grief cannot be put into words. That's the road you were heading down. You've done the right thing so far. Stick with it. Don't put your family through what I am dealing with. Stick with being clean, it's better for everyone.",
            "Awesome update! Best of luck to you both :)",
            "So proud of you!  I’m so happy you have a good support system too. ",
            "One of the best updates I’ve read. Way to go!",
            "Amazing update! So happy for you.",
            "Congratulations OP, very inspiring and your husband is amazing too! Good luck for your future with your little one!! All the best! x",
            "Congrats on your sobriety op!!! \n\nRegarding him being nervous about you going out, I understand his concern but it’s also unhealthy so I have a suggestion \n\nI am dating a recovering addict of over a year and our solution is to have regular drug testing. We say we do it weekly but in reality we forget all the time. Some oeople call this crazy but for us it works entirely for one reason: if he ever gets that urge to think well, I can do it just this one time and stop and nobody would ever know... he knows it’s not true. He will never be able to do it just the once and not get caught again. The possibility of getting tested is always there, it’s a reminder that no matter how he might rationalize that it’s just a one off it won’t be and it would ruin our relationship\n\nAgain, some people will think it’s too much. The thing is I’m very confident in his sobriety and don’t do it because I think he’s doing drugs behind my back. It’s just our open door policy. In my mind no different than when a partner straysromantically and there’s an open phone policy... though I’d never stay with a cheater lol. But I’m proud of my partners recovery and I don’t want to keep him from making friends or going out and being tempted. In my eyes, a routine test feels healthier then him worrying about what you’re doing when he isn’t around",
            "A year and a half clean equates to like 10 years in terms of sobriety. That is a very big accomplishment. You should be proud of yourself!",
            "Congratulations! So proud of you and happy for you! ",
            "I just saw this and read your original post and now I’m hiding in my car crying because I am so happy for you!!!!!!! ",
            "I feel so happy that you and your husband have found the road to peace. I hope that you continue the path of such love, health, and happiness. <3 ",
            "Thank you so much for sharing your journey. I’m so glad to hear that you’ve got a supportive partner. Best wishes to you both! ❤️",
            "I’m pregnant and this made me cry happy tears for you!\n\nFrom one internet mom to another, you rock!!  You’ve got this and I’m so happy for you that you have such amazing support.  Good luck!!!",
            "Congratulations! You should be proud of where you are and the work you've done, and I wish you the best with your growing family! ",
            "I am SO happy for you!! Congratulations!! ",
            "Clapclapclapclapclapclapclapclapclapclapclapclap",
            "I am so happy for you, love is all you need to overcome anything in life. I suffer from addiction and even if I am not addicted to anything I still suffer from addiction, it must be a gene defect or something. ",
            "I'M SO HAPPY FOR YOU! :) wishing you all the best",
            "This is the best update ever! super happy for you and your husband :)))",
            "Awww :) this made me smile. good job OP!",
            "Congratulations! With a baby on the way, make sure you have a strong support system in place. Babies are exhausting and the temptation to fall back on something (adderall, etc) that will take the edge off of getting three hours of sleep a day might be strong. ",
            "I'm struggling not to cry at work right now.  What a wonderful outcome, I'm so happy for you. ",
            "Dear everything i couldnt be more excited for you two! ",
            "I don’t know you but I am so proud of you. Reading this really warmed my heart. Thank you for sharing it. ",
            "Great stuff! All the best. It can get better!",
            "You got sober on my birthday! Hooray ",
            "I’ve been through a lot of shitty stuff but I always have to find out. I’m not minimizing what you did but I can tell you that being told and having you willing and ready to work on it is like a dream for a partner of an addict. I hope the best for you both, always. ",
            "Hi, I’m so happy you guys were able to get everything to work I have a question I been dating my girlfriend for almost a year now we’re so open of each other and she’s amazing I found out couple month ago that she smoke weed. I don’t have a problem with it, the only problem I have of it is she’s a  nurse and she can lose her career and I know it would devastate her. She always tell me she wants to stop she does for a week or so then then starts again. It doesn’t help her closes friend smoke weed either every time I confront her about it she gets defense and makes an excuse I need help in what to do I don’t want to lose her over this but I would hate to see her lose her job or even her nursing license over smoking weed because it would ruin her. \n\nSorry about the writing doing this late after work pls anyone can y’all give me some advice. ",
            "I’m so happy for you! You went through a traumatic experience and admitted to your husband which took courage.\nCongrats on the pregnancy and staying sober.",
            "So your husband just expects you to be locked in the house forever? He does understand that's not what recovery is about, right? It's about learning to function normally in life without using substances.",
            "> He still prefers I stay home most of the time and he has reservations about new friends\n\nThis seems like a weird/dark spot on an otherwise awesome update. I'm not familiar with the recovery process for addiction, but it doesn't really feel healthy for him to be limiting your social interactions/isolating you.",
            "Stay positive, keep growing and know that it's all worth it in the end for yourself, your husband and most importantly, your child. All the best and very well done, OP.\n\n&#x200B;",
            "This lifted my spirits. It is inspiring to hear of people who work so hard (together even, imagine that?) to overcome suffering.  Good for you guys!",
            "Congrats to your sobriety and new lever of relationship between you and your husband!and you will be a strongest mom ever!",
            "Be honest and remorseful, That worked for me.Praying for you 🙏🏻🙌🏻",
            "[removed]"
        ]
    },
    {
        "post_id": "3as7za",
        "author": "Bridewithnofriends",
        "title": "UPDATE: My fiancee (24F) has no bridesmaids and it's making her so upset she wants to call off the wedding. How can I (25m) help?",
        "url": "https://www.reddit.com/r/relationships/comments/3as7za/update_my_fiancee_24f_has_no_bridesmaids_and_its/",
        "score": 7361,
        "num_comments": 600,
        "created_utc": 1435026034.0,
        "selftext": "OP: http://www.reddit.com/r/relationships/comments/3am0dc/my_fianc%C3%A9e_24f_has_no_bridesmaids_and_its_making/?sort=new\n\nDid not expect to update this fast.  Did not expect to update at all, unless something miraculous happened.  And it did.\n\nIn short, I have the best friends in the world.\n\nI read through a ton of these comments, but not all (over 1000?!)  and decided to look for my fiance's box of wedding planning stuff, because I had a suspicion.  Inside the box was all these magazine clippings of a big church wedding, flower ideas and stuff.  And then I saw pictures of the dresses.  They were all big, poofy ornate things that don't seem akin to my fiancee's style at all.  But...they're similar to the dresses my sisters wore at their weddings.\n\nIt all sort of clicked for me.  My fiancee probably doesn't want a church wedding or any of these fancy trimmings, she's trying to win my family's favor.  The hell.  I really should've noticed this earlier and gotten more involved, I know.\n\nMy fiancee flew home on Thursday to spend a few days with her dad (Father's Day weekend and all).  I couldn't go because of work, so I was alone until this morning.  So, real late at night, I called up my buddy Ravi (26M).  Ravi's my best man, we've known each other since we were kids, split up when we went off to college, and reconnected three years ago.  We moved to SC so I could join the company he works for. \n\nI just opened up to Ravi.  It was really late but he listened to me anyway, about my worries about my fiancee.  He said that it was very likely that she was trying to curry favor with my family, but she probably wasn't going to admit to it easily.  He said he'd talk to her.\n\nI told him that he barely knows her.  He said not to worry, and that he'd be around tomorrow evening.\n\nMy fiancee came home happy (she always is after seeing her dad) this morning.  I went off to work without asking about the wedding, and she set to work on her writing (she's off for the summer).  I got home early and at like 5 PM Ravi came to my house with my other good friends: Carson, Andrew, and Tim (23-30M).  I know all these guys from various places and we're all a solid group.  Still, this was unexpected.\n\nRavi came up to my fiancee and said that the guys were taking her wedding dress shopping.\n\nWe were both freaked out as hell.  I had no idea this was coming, and my fiancee looked like she wanted to crawl into a hole and die.  She whispered to me \"they won't like me\", and I urged her to just go for it.  Ravi reminded her that he has sisters, Carson's been divorced, and Andrew's had his fair share of girlfriends, so they know dresses.  Plus, he has a lady friend that works at a small boutique, where they'd try first.\n\nShe still didn't want to go, and then he said something like \"hey, you're marrying our best friend, don't you think we should get to know you and make sure you're not a ghost or something?\"  (He's not great with tact).  But she chuckled a little at that and gave in.\n\nThey were gone for a while and came back an hour ago.  They didn't find a dress, but they looked around the stores for a while and fiancee found a style she liked (not the poofy ball gown style).  They also went out for ice cream and when they walked in the door, she was joking and laughing with them all.  I hadn't seen her so happy in a long time.  It was amazing.\n\nThen we all sat down together and Ravi asked her to talk to me about what's on her mind.\n\nI still don't know how they got her to open up.  She whispered that she didn't really want the big church wedding, that she wanted to wait a little while and plan a small ceremony for just the people we really care about.  I was all for it, I told her not to worry about bridesmaids or anything, it could just be us.  She said no, she wants her dad, the guys, and my family to be there.  \n\nAndrew, a kickass guitar player, said he'd put together a band for us.  He asked my fiancee what her favorite song is, he'd figure out an arrangement.  This is the kind of question she usually dodges, but she blushed a little and actually told the truth.  (Panama by Van Halen if anyone cares; girl knows how to rock out).  This was the real sign that she's starting to trust them.  I don't think anyone knows her favorite song except me and her dad (who bought her Van Halen CD's growing up)\n\nI told her I'd call my family and tell them the church wedding's off.  If they make a big stink about it, I don't fucking care.  I have my bros and my beautiful future bride.  That's all the family I need.\n   \n**tl;dr**: Church wedding's off, my friends are awesome, future looks bright so far.",
        "permalink": "/r/relationships/comments/3as7za/update_my_fiancee_24f_has_no_bridesmaids_and_its/",
        "comments": [
            "You have some damn awesome friends :) ",
            "[deleted]",
            "Let's talk about Ravi. Is he single? Is he cute? Because it's clear he's an amazing dude, and I have a single 25-year-old sister who is smart and pretty and the nicest :P",
            "[deleted]",
            "[removed]",
            "The public wants to know what Ravi looks like.... for science. ",
            "Excuse my pregnancy hormones but I'm reading this and bawling. Damn hormones. My husband is freaking out because I'm like \"Ravi...wah...wah!\" \n\nHe's asking, \"Who the h*ll is Ravi? And why did he make you cry?\"\n\nI'm sniffling, \"He's awesome. I'm crying because he is awesome.\"\n\nNow, I've got some explaining to do after my water facet stops leaking. \n\nThose are some awesome friends you have there!",
            "That's great! Glad things are working out with the wedding :) Hopefully your fiancee will use this experience to realize that people do want her around and want to get to know her and care about her. And hopefully this will show her how important friends are for support, etc.",
            "The world needs more people like Ravi!",
            "My heart exploded. Your friends are indeed awesome. ",
            "This is the first time in years I'm actually jealous for someone regarding friends.  Dude, with a sweet girl like that, and awesome friends who you can work with too, you've got it *made*.",
            ">She whispered to me \"they won't like me\"\n\nYour fiancee needs some serious self confidence.  Who automatically thinks that a whole bunch of people won't like them based on nothing?  Why would she think they wouldn't like her?  Based on your last post and this one, she needs some help.  I don't say this to be mean- both she and your friends sound lovely, and it's great that you have them.  That sounds like the best possible outcome.  I'm really happy it turned out that way.  ",
            "Awesome. This is the best update possible! ",
            "I'm so happy for you guys!!!!!",
            ">In short, I have the best friends in the world.\n\nYou got that right. Here's a challenge, give Ravi one high five for every upvote this update gets. ",
            "Ravi thought she was trying to curry favor.  Tee hee.",
            "[deleted]",
            "This belongs in a movie : ).",
            "That's awesome!\n  \nBut your fiance of 7 years had never really met your friends before?",
            "Am I the only one thinking they should be her bridebro's? They should be her bridebro's.\n\nEdit: And scrolling down this thread, I imagine Ravi to be the suave mofo from Parks & Recreation. I don't even know why.",
            "This is my favorite update ever!\n\nCan I come to the wedding?",
            "Is this the plot for a rom com?",
            "Ravi for Best Best Man ",
            "This makes me happy as I walk into a casino, drunk, and alone.",
            "Are you testing a script? I'd watch it. ",
            "Your friends seem awesome, and so does your fiance. I'm so happy that this had a happy update!\n\nTell her to keep writing and to enjoy her summer-- teachers deserve it. And as I said before if she wants a writing buddy or a female friend, she can contact me. \n\nCongrats on the upcoming wedding!",
            "My heart just grew three sizes. You have amazing friends. ",
            "> Panama by Van Halen\n\nNOW WE ALL KNOW!",
            "Ravi! Ravi! Ravi!",
            "As a female that.... May be... Soon in your fiancés situation, I think you have excellent friends and you sound like an excellent guy yourself. Social and generalized anxiety are real issues for some people. I hide from meeting new people the same way as your fiancé. \"They won't like me.\" Its hard to face a situation like this when that's how you feel. Excellent thread, thank you.",
            "\n>I told her I'd call my family and tell them the church wedding's off.  If they make a big stink about it, I don't fucking care.\n\nOP, may I just give you the biggest internet high five that I have ever given? I wish you and your future bride the best!\n\n",
            "You really have the best friends ever. Please make sure that you thank them for their hard work in trying to make a connection with the woman you love. That's a very important step for a marriage. My friends did it as well. ",
            "You have movie caliber best friends",
            "> Ravi came up to my fiancee and said that the guys were taking her wedding dress shopping.\n\nTell your friends they are incredible. This brought tears to my eyes, which wedding dress shopping does not normally do! Holy shit. Best update ever. ",
            "still seems weird your wife-to-be has no female friends",
            "Another bullshit made up post on /r/relationships. Honestly every post on this sub is fake. I mean seriously \"she whispered into my ear\" went into full novel mode bud.",
            "This is such a wonderful resolution to your issue. I wish all things around here ended up so well. Not only are your friends golden, but you are too for caring enough about your fiancé to really dig for the truth and work toward her happiness!\n\nHere are a few happy tears for your future...they're on my iPhone screen, but you can have them in spirit!",
            "i wanna see the montage with a top 40 song playing in the background",
            "/r/awww is waiting",
            "It seems weird she wasn't clearer trying to communicate these things to you earlier. Like suddenly she's all open about wanting a completely different everything for the wedding... I'm not the best with relationships and want to learn. ",
            "I'm in tears, you and your friends ROCK!!! all the best possible wishes for you in the future happiness!!! ",
            "Elope.  Make your own story. ",
            "Awww, what a beautiful story to read! Best of luck to you both!",
            "Ravi sounds dope and like a wonderful best friend.  Gotta admit, I started tearing up when I saw how much he and your other friends helped you out.  Stuff like that gets to me.",
            "Holy shit I don't many guys that would do that. You have really great friends.",
            "This is such an amazing thread. Woven from what true love and friendship is made of. So very inspiring. \nI would be her bridesmaid in an instant!",
            "Why are my eyes watering?  And you are a very blessed man with your friends.",
            "This is really great, sounds like you *both* have amazing friends. ",
            "I'm holding back tears on this update. You are such a supportive SO and have such a wonderful group of friends. Seriously, so happy for all of you. Have a wonderful wedding♡",
            "Cutest update in the world, you have awesome friends, please let it hit the top page of this sub.",
            "Had a huge smile by the end of the post. Good for you bud.",
            "This is great! You and your friends did a fantastic job. I can tell you really love your fiance, and I wish you two the best!",
            "Yeah, seriously.  Hook it up with your best friend because he sounds amazing.  I'm happy you guys just decided to do your own thing.  It's your day and that's what matters the most.  This is something for you two to remember.  Not anyone else.  ",
            "Damn! Tryin' to make Homey all misty-eyed! I can't remember the last time someone did something that nice for me.",
            "Im a bride with no close female friends. My brother will stand next to me on my wedding day. My fiance will have his three cousin next him. I have no engery to find or even care about a last hen party, bridal tea parties, or any of that. I want wings, games, and maybe some comedy with my brother,  for my last hen party ",
            "Awwwwwww :') this warmed my heart ",
            "This is so awesome. You're awesome for looking out for the bride. I moved to SC from far away and still have no friends. My fiance has loads of friends and wants like 6 groomsmen and I only have one sister and she doesn't even know if she will come to the wedding. Is freaking me out. Excellent job op for turning this situation around with your friends and fiance.",
            "Damn those onions!",
            "I had actually been worried about how this would turn out. I had almost suggested if her mom would do it in your original post but held off because there wasn't mention of her.\n\nI'm glad it turned out well :)",
            "This was an awesome update, I even teared  up a little. I'm really happy your fiancée was able to communicate with your friends (who by the way rock!) the first post made me feel sad about her because I also have the same fear when I get married, knowing that she was able to open up like that gave me a really big smile. \n\nHopefully you'll be able to update us once you guys tie the knot, would love to hear about it!",
            "Do a small wedding.",
            "You could hire Kevin Hart",
            "This story made me cry.  I'm a lot like your fiancée.  I'm really shy, I don't have many friends, and I only have one friend who is a girl but she and I are drifting apart due to college.  My boyfriend and I are planning on getting married and I'm afraid of only having my two sisters as bridesmaids, while he has tons of guy friends who he would want to have as groomsmen.  OP, you sound like an amazing guy who is truly sensitive to your fiancées feelings, and your friends seem great, too.  She is so lucky to have you!  \n\nAs someone who is constantly lonely and feels insecure around people, I cannot even begin to tell you how much it means when my boyfriend goes out of his way to include me, and I know your fiancée feels the same way.  ",
            "This update is the best. You have the best friends. Best wishes to you and your fiancee. ",
            "Congrats to having awesome friends and looking forward to your wedding! Not only are you guys doing something you are truly Happy about, but you're probably going to save a ton of money. \n\nAlso, are any of your friends single?! Haha",
            "When I read your first post I honestly felt so bad for your girl and did not see a solution. Thanks for updating. This is such a feel good story. You will make a great husband. And thank god for Ravi!",
            "What a fantastic post.  Your guys are awesome.  Your girl is awesome.  Love it. *sigh*, I feel all mushy. <3 <3",
            "this post is now the perfect opportunity for your friends to get laid by hot internet strangers. ",
            "Sounds like you have some great friends.",
            "This is totally cool, when my best friend got married his gf wasn't really too friendly with many girls; but I managed to organize a bachelorette party for her. Good on your boy for stepping up",
            "Yaaay! I'm so glad you worked things out!! ",
            "this is one of my biggest fears about marriage. best man? i don't have a guy friend who meets it. my family needs a huge wedding. i'd love to elope but it'd kill my mom. ",
            "My sister works in the bridal industry.\n\nTrust me there's all of this BS effort put into making all females believe it's an issue of their own self worth to \"have a big wedding\" ... it's a HUGE money maker.  People will go into debt over it bigtime.  \n\nThe entire industry is geared to getting these women and their families spend all kinds of cash and pressure them to identify their entire life into terms of this emotional (and scary) event... \n\nI've seen multiple big weddings that girls had....  to make a show of it ... and to push this self defined illusion that they're alright and they're \"successful\". \nThose marriages never made it past a year or two. \nAs soon as it was all over and the reality set in... that was it. \nA HUGE waste of money. \n\nSo my advice is don't take the bait, don't let her fall into the trap that you have realized here.   So small and personal. \nJust you two are all that matters - period. \n\nand most of all it doesn't have to involved money or buying into some contrived BS that people like my sister will try to sell you. ",
            "Ravi sounds like the name of a friend who is cool as shit and good for just about anything.\n\n\nThis story confirmed my feelings.\n\n\nGood luck to you two!",
            "I cried reading this. Your friends are awesome. It sounds like you are a lucky guy, with such a great fiance and such wonderful friends.\n\nAlso, just to add, from planning my wedding I learned two things:\n\n1. Whenever we did exactly what we wanted and not what we thought our families wanted, it ended up making EVERYONE happier. The most traditional, religious people in the crowd fucking loved our short, secular, and funny ceremony. \n\n2. My biggest regret is having and bridesmaids. Worst decision ever. And I only had two.\n\nYou guys are on track for an awesome wedding that will totally be about the couple, and that's what matters.",
            "Someone HAS to say it: AWWWWWW! :) ",
            "Ravi's the true MVP.",
            "Non-dating related Ravi question: Is he an Indian, no accent, with some ridiculously smart engineering degree?",
            "You're in SC.. South Carolina. You should get some tickets to music midtown (Atlanta,GA) Van Halen is one of the head liners. She'd probably really like that. Maybe plan it as a group thing and see if your friends would go and just hang out and listen to some good music! It seems like shes super happy about your friends taking the step and tbh if I were her, I would be ecstatic. \n\nGood job, Fiance of the year. ",
            "I just she a tear of Joy. ",
            "Oh my goodness, this is so sweet.",
            ">she blushed a little and actually told the truth. (Panama by Van Halen if anyone cares; girl knows how to rock out)\n\nKEEPER.",
            "You have awesome friends!   I'm glad to hear they made the effort to get to know your future wife and that they got her to open up and you could have an honest conversation.   Sounds like your on the way to having an amazing future with some pretty amazing people.   Good Luck!! ",
            "I'm late to the party, but I've followed along since the initial post. Reading this update put the biggest smile on my face. They say you can judge a person by the character of their friends and it looks like both you and your friends are amazing people! \n\nBest of luck the rest of the way!",
            "That is just too awesome! You have an amazing group of friends! \n\nGood luck to you and your fiancée! ",
            "Your post brightened my day so much! I actually choked up a little. Congratulations on your wedding, sounds like you've got a great future ahead of you! :)\n\nEdit: maybe you guys could check out a reddit meetup so that your lady can met some other ladies!",
            "Dude, your buddy Ravi is the kind of guy you want to keep as your best friend for life. Everybody should be so lucky.",
            "Just my tingling sense... But I gotta call a /r/thathappened here.",
            "This is a great update im so happy for you both!",
            "I.. i am so happy. I'm happy for you all. You can't pick your family,  but you can pick your friends (family).",
            "This is one of my favourite updates right now. ",
            "Good friends amazing story. ",
            "This made me tear up a bit.\n\nYou are going to be a good husband, if this is any indicator. I hope you and your fiancée have the best wedding ever!",
            "You seem like a good person with good friends, this is something that was enjoyable to read. Congratulations and best of luck in the future.",
            "That sounds awesome. Great memories ahead. It is great how committed you are.",
            "I love happy updates!",
            "Wow. I wish I had bros like this. Nice one man, all the best for your future life together.",
            "You, your bride, and certainly your friends are doing life right. Keep all of them close. Happy wedding! ",
            "Yay! This update made me feel all warm and fuzzy inside. Seriously though, your friends are amazing and your wedding is going to rock!",
            "YES!!! You have the best quality friends!!! :) I'm so glad they got her to open up, she probably feels so much better. ",
            "You have the nicest friends. This is such a cute story!",
            "Your friends are awesome. GJ.",
            "hire-a-crowd of bridesmaids:\nhttp://www.reddit.com/r/nottheonion/comments/3asa0o/rent_a_crowd_company_admits_politicians_are_using/",
            "Fuck yeah, this is the best update :) ",
            "Well if this isn't the cutest darn update I ever saw...",
            "Should have done like the Wedding Ringer but bridesmaids styles.",
            "Best possible outcome!!! Congrats on friends and fiance!",
            "You must be a good man to have friends who love you so much. That the would do something so sweet for your fiance is the icing on the cake. Who needs bridesmaids when you have these beautiful guys? ",
            "Ravi, You fucking leg-end!\n\n",
            "This made me cry. I wish I had friends, let alone friends like that. ",
            "this is so wonderful and sweet. we had a TEENY wedding (12? people) and it was perfect.",
            "Well, I thought this was going to end with an army of Reddit-sourced bridesmaids of all shapes and sizes",
            "Everything about this post makes me so happy including you trying to get some ladies for your friends. Wedding planning can be very stressful, I'm glad she is pursuing what she wants instead of what others want. ",
            "Lucky guy!",
            "Well this thread is one of my favourites ever.",
            "I love your friends! They sound like an awesome bunch :) your fiance sounds pretty damn awesome too!  I hope you pair have an amazing wedding <3 ",
            "This is such a good read. Life kind of sucks for me right now so I'm going to save it and read it when I need cheering up.",
            "Best of luck man! You have some awesome friends and the fact that they did this for you is mind blowing and amazing. You're going to have a bright future :)",
            "This made me so so so happy.  Everyone you know is awesome :)",
            "Dude when you get married you guys are gonna bone so hard.\n\nGood work. ",
            "Tears in my eyes. This is the most beautiful thing I've ever heard here. Your friends deserve so much love.",
            "When my wife and I got married, we had something very small.  Just us, a few friends, and a Justice of the Peace.  We would have had my family come up, but we live halfway across the country and my schedules are a bit...erratic...\n\nI much preferred a small wedding I think.  Not to mention saving the INSANE amount of money a big shindig costs... I just don't understand that part.",
            "Oh my goodness, you just made me tear up at work. I can completely relate to your fiancée's shyness and self confidence problems and I can't tell you enough how thankful I am that you and your friends are there for her. That was probably the perfect way to handle the situation. ",
            "This is awesome but also why couldn't she just say what she wanted??",
            "Those are some great bros. Good on you, good on them. Touching story and I wish you all the best.",
            "Great update. Your family SHOULD be cool about the change. Its what you both want, and its a hell of a lot less stress for everyone involved.\n\nThe only problem with scaling down a wedding is making the hard choices about who not to invite. Safest to keep the ceremony just close family, with a nod that some close friends can crash the ceremony, then throw an open party a week or so later.",
            "This was super moving. Glad to hear you have such fantastic friends and a super awesome fiancee. :)",
            "This is amazing.",
            "Wow. I have known a lot of decent guys and I can't think of one who would do anything like that. Buy Ravi a beer.",
            "This is a great update. It's nice to read that it worked out.  If I were to get married again, I'd be in the same boat, friend wise, as your fiancee.  I have sisters and plenty of cousins, but no friends.  \n\nGood luck with your future.",
            "Your friends are amazing. I have a feeling this is going to be something that happens to me when I'm about to get married. I'm the same way. I don't have many female friends and have always been worried about what I was going to do for my wedding. This gives me hope and made me tear up a bit. Thank you for the update and congrats!",
            "I almost teared up. You have such great friends! I'm so happy for you (and future wife!), OP! :D",
            "Congrats and great friends!",
            "WOW! this brought a tear to my eye... you have a fantastic core group of friends! good luck OP :)",
            "You could get a bunch of friends willing to be drag queens for a day.",
            "One of the best updates I've read on this sub.... Good luck with the future :D",
            "\nFaith in humanity restored.",
            "This has made me smile more than any other post I've seen on reddit. I want that for me!",
            "Awww. I teared up a little.",
            "Holy crap, that was amazing. Dude you've got some amazing friends. Your finance is lucky to have both you and your friends in her life :)",
            "This just made me so happy I'm going to cry. ",
            "I'm so happy for the both of you! I wish you the best luck with the rest of the wedding!",
            "Your friends are fantastic to do that for you and more importantly, for her. ",
            "Van Halen rules! Good job, your friends are amazing, I'm a little jealous. ",
            "Mail-order bridesmaid?",
            "Best update ever. Thank you. I needed this bit of happy today.",
            "aw, you have awesome friends and you're girl is lucky to have a guy like you! :)",
            "I'm so glad you posted an update!! Your friends sound awesome and I'm so happy for you and your future wife. Congratulations on the wedding which will now be the perfect day for the both of you. ",
            "Your guys are awesome. Well chosen sir!",
            "Let her know Id love to be her friend and help her out :) Im in a similar boat and can relate how she feels 😙",
            "This is amazing. You're awesome, your buddies are awesome, and your fiancee is awesome. And her dad sounds awesome too.\n\nThis post actually made my day.\n\n:)",
            " You should watch \"the wedding ringer\" ;)",
            "Can we switch friends?",
            "Omggggggggggggggg :) \nI have always wanted a wedding like that (eventually) and it awesome to see how great your friends are and you and your fiancé sound like sweet people. Wish the best for you guys !!!!!!!!!!!!",
            "This was from a while ago I know, but I just thought I would let you know that I got tears from reading this. Your friends are absolutely amazing.",
            "Was she a ghost?"
        ]
    },
    {
        "post_id": "l5jc7c",
        "author": "throwaway246813572",
        "title": "UPDATE: My (29M) soon to be ex-husband seems to feel entitled to another chance with me (28F).",
        "url": "https://www.reddit.com/r/relationships/comments/l5jc7c/update_my_29m_soon_to_be_exhusband_seems_to_feel/",
        "score": 7330,
        "num_comments": 157,
        "created_utc": 1611683569.0,
        "selftext": "Link to original post: https://www.reddit.com/r/relationships/comments/gklndb/my_29m_soon_to_be_exhusband_seems_to_feel/?utm_source=share&utm_medium=ios_app&utm_name=iossmf\n\n\nWell, turns out my gut instincts were right. The entire time he was begging for another chance and promising “this time would be different” (eye-roll) he was still sleeping with the affair partner and telling him he loved her and would do anything to make it work with her. It didn’t even hurt me to find it out. I was THAT unsurprised. It just helped me stop feeling guilty. I divorced his ass. \n\n I thank the universe every day that he is no longer connected to me in a romantic way. It feels like an ENORMOUS weight has been lifted off my shoulders. \n\nShortly after my original post I met someone by chance at a wedding and fell in love. This person is everything my ex husband was not. The kindness, compassion, and respect they show not just me, but to my daughter as well, is like something from a dream. I never knew love could be so easy. \n\nTo anyone in a loveless marriage reading this-LEAVE. Do the hard thing- ESPECIALLY if they have a pattern of leaving/returning/cheating, etc. Lord knows I was terrified to cut the cord. At one point in time I was actually starting to feel bad for the guy because he was begging me every single day for another chance. He tried to convince me that getting a divorce would ruin my future, our daughters future, that she would come from a “broken family”- but it was the exact opposite. It was broken already and I fixed it. Once I made up my mind that divorce was the best option, I absolutely thrived. I learned independence. I found how to be happy on my own. I found happiness in a partner. Life has never been so sweet. The bad shit makes the good shit so much better. Thank you, Reddit, for the support on my original post. It helped turn my graveyard into a garden. \n\nTL;DR: I divorced him and found true happiness.",
        "permalink": "/r/relationships/comments/l5jc7c/update_my_29m_soon_to_be_exhusband_seems_to_feel/",
        "comments": [
            ">It was already broken and I fixed it. \n\nGOLD. What a perfect way to say it.",
            "My husband feels he’s entitled to another chance with me. \n\nNarrator: “He isn’t”.",
            "Let me guess, when he found out you found someone else he started freaking out and saying you were breaking the family? I had a friend like this. He cheated constantly and then she found someone else. Suddenly he was the victim crying to the friend group. He is not a friend anymore.",
            "I’m so happy that this had a happy ending for you ☺️",
            "I remember reading your post ages ago. I’m so happy you were able to find stability and happiness despite how bad things got for you.\n\nPlease continue to have a wonderful life ✨ you deserve it.",
            "You probably won’t read this but this is exactly what I needed to hear at this exact moment in my life. I’m going through the same thing. Trying to leave but suffering the guilt and hearing his begging every day. \n\nBut I already put down the deposit on my new place. I already bought my plane ticket. Just 3 more weeks and I’m free. \n\nI’ve been doubting myself more than ever as the time approaches. So, like I said, I really needed this. Thanks.",
            "I am happy it worked out for you.  Now the real difficult work begins - not letting his dishonesty and cheating make you eternally distrustful toward others.  That is the after effect of infidelity that people don't talk about enough, and the real damage that a cheating partner can do to you.",
            "My favorite part of this update is that you didn't even touch on how he's doing and whether he's been able to move on and be happy, because *who gives a fuck about that asshole*?",
            "I wish all the other people coming to this reddit to ask for advice on relationships like yours was reads this and it encourages them to end it. We're all so proud of you.\n\nOut of childish curiosity, can I ask if the girl he was dating is still with him or what kind of twisted version of the story between you two he tells her? I always find it so funny when they make up that their wife is evil or when the affair girls breaks up with them",
            "So happy to hear you found the strength to leave him!\n\nMy mom left my father when I was a baby (I had no memories of him until I \"met\" him later in life) and I've always admired her for that choice. Being a single mother was hard on her, but she taught me how to be independent and strong, and I'm 100% better off coming from a single parent home than from a home with two parents constantly at each other's throats.",
            "I saw your original post at the time, so pleased you have upgraded and are in a much happier place! Best wishes for the future, you've got this!",
            "Giiiiiirl-you have no idea how inspired I am after reading this. Going through something somewhat similar right now. I just happened to stumble across this and it made my entire day. I am happy you realize your worth, and thank you for reminding me of my own!",
            "I am in this same situation now thank you for the wonderful update. I look forward to my future happiness as my divorce progresses.",
            "As someone who got burned by a cheating spouse who swore up and down they wanted to work things out with me while telling their mistress the same thing...\n\nThis is the damn truth right here. \n\nWe all deserve better than this and if it’s not good just leave. Start anew, it feels amazing and you’ll wonder how you ever lived so miserably before.",
            "“two happy homes are better than one broken one” absolutely love this update!! you did the right thing, proud of you OP!",
            "I'm so glad you are free, he sounds awful.",
            "I don’t think I’ve ever been happier when reading an update. Hold onto this strength when he inevitably starts slinging hatred, again, once being served those papers. I’m so proud of and happy for you.",
            "> He tried to convince me that getting a divorce would ruin my future, our daughters future, that she would come from a “broken family”- but it was the exact opposite. It was broken already and I fixed it.\n\nYup. Congratulations!",
            "You know what screws up kids more than divorced parents? \n\nParents that should be divorced and aren't. \n\nGood job OP.",
            "I do not want to ruin that awesome honeymoon period, but you just got out of something intense, everything's gonna feel intense.\n\nPlease. Be careful with the new guy. I wish you luck and happiness, but i urge you caution. The comparison is always so attractive. Just dont rush to love again.",
            "Love reading happy endings, hope you and your family stay happy and healthy!",
            "I love a happy ending ! Congrats!",
            "I ended up being friends with my ex’s last AP in our marriage. She had no idea he was married when they met, first is was the ex, then I was almost the ex, then I was the crazy one who wouldn’t let go... after the divorce she reached out when he started trying to Hoover her back in, turned out we both got the EXACT word for word email (exchanging her kid’s name with my dog’s name). Down to calling us both “sunshine”.... it was super creepy. \nMeanwhile we are both happily remarried in healthy loving relationships and ex is on wife #4... poor girl.",
            "I would love to second this! I left an awful relationship (cheating, lies, leaving, returning, abuse) and I found the most amazing person for me. You deserve to give yourself the freedom to choose what is best for you. Even if you never find someone else (unlikely), you will make a better partner to yourself than anyone if you can find a way to love yourself. Treat yourself the way you deserve, especially if no one else does!",
            ">that she would come from a “broken family”- but it was the exact opposite. It was broken already and I fixed it.\n\nGood for you!  I realized this as well right after my divorce.  I have custody of my daughter now, and we are both just amazed how little conflict there is on a daily basis when her toxic mom is out of the picture.\n\nMy new fiance is just the opposite of my ex wife.  She treats me daughter better then her mom does.  I'm glad I was able to show her what a healthy relationship looks like.",
            "I know everyone’s been telling u this but I am so So proud of u. It’s not easy when u want to always see the best in someone else but I m glad u did what was best for u at the end of the day. Wishing u all the love and happiness u can get :)",
            "You said it yourself, EX-husband and FEELS entitled, he IS not entitled.\nHe lost his chance.\nI wish you the best of luck and admire your strength!\nKeep going!",
            "Congratulations! You took the step and made a better life for you and your daughter!",
            "/r/BestofRedditorUpdates",
            "That's great.  Its not always easy to navigate.  🙂",
            "I am really happy for you that you were able to get through this and see your value. I stayed with my ex for four years. Your right staying wont change a thing!",
            "He Sounds like an immature child, I avoid relationships and prefer my own company, but I can never understand people who think they will have a good outcome when they cheat lol.",
            ">The bad shit makes the good shit so much better.\n\nThis, right here.  Would never be able to appreciate my current partner of 10+ years the way I do if I hadn't had shitty relationships in the past.\n\nYou go OP!",
            "YOU GO GIIIIRRRRRLLLLL",
            "I am so happy for you! I hope he gets zero custody, or supervised visitation at most. A sociopath like that should not be around your child.",
            "Well done!  You survived a psychopath.  Not easy.\n\nThanks for th eupdate, glad you found a kind and caring man.",
            "Never take back cheaters.",
            "I'm not crying. You're crying.\n\nGood for you mamma!",
            "So happy for you OP. As someone that was terrified to break off a 3 year abusive relationship and has since met someone that is \"everything she was not\", it's a fucking fantastic feeling to remember what love is.\n\nAnd to any of you reading this that are in an abusive relationship... Please leave. It's hard and scary but there is a better life out there for you.",
            "Congrats I am very happy for you finding a good partner and getting rid of that idiot. I remember this post and it pissing me off. It should come easy. I think he was hung up on the fact you were trying to crawl back to him and his ego was low. He just wanted you to take him back again to get the ego boost IMO.",
            "I am so happy you found someone who doesn't treat you badly and aren't dealing with that bullshit anymore. This will be so much better for you and your child.",
            "I love updates like these",
            "So so happy for you!!! What an awesome update!!!",
            "This is such a great update",
            "This is the update I needed 😭",
            "Lord. I wish my sister could see this,  but she'd still find a reason to stay",
            "Kudos on realizing he wasn't being honest and being able to walk!  Having been in that situation, it's difficult to play against the years of emotions you had built up.\n\n> Shortly after my original post I met someone by chance at a wedding and fell in love. This person is everything my ex husband was not. The kindness, compassion, and respect they show not just me, but to my daughter as well, is like something from a dream. I never knew love could be so easy.\n\nI also did this.   It turned out to be painful.  I won't be as arrogant to suggest your guy turns out the same type of person as the \"dream woman\" I found, but maybe try and make sure you take things slow?   \n\nAn analogy is say you are in prison for X years (the number of years you were married).   Everyday you eat crappy meals, live in a crappy cell - you know it can be better out there from the time before you were in prison, but the daily grind of it has you only seeing that.   Then you get released!    You wander around and find a McDonalds and OMG the food is incredible!   You get choices!!   I mean prison food didn't have that!   Condiments, what!!   I can order again if I'm still hungry?   They have kids meals?  I can't believe they thought about my kid!\n\nPoint being, you have trash as a relationship comparison right now.   It's not hard to look like a knight in shining armour against that is it?   Also the years you were in that crap relationship, they do take a toll.   Part of the problem(s) I experienced were that I had emotional triggers just waiting to trip me up, but anything that was too closely related to my ex was just something that would immediately set me into a bad mood... and then an argument.   Oh and the Mrs. Right, turned out to be fishing for a \"nice guy\" and realized I was super easy to fool - she knew my ex and it wasn't rocket science for her to figure out what about her I was not liking - then just \"casually demonstrate\" she was better at those things.   This facade didn't last beyond a year, because it's hard to maintain something like that - but, yeah I wish I would have moved a lot slower - especially in a serious relationship so close to a divorce.\n\n\ntl;dr: Kudos for realizing your ex isn't giong to change.   Highly recommend going slow with the new guy in terms of progressing in levels of seriousness, have fun and enjoy not being in a toxic relationship!",
            "Good for you! I always say the best thing my parents did for me was get divorced. You go girl!",
            "“Turned my graveyard into a garden”.  What a lovely,poetic and poignant image.",
            "Congrats ! Made me think of Loving is easy by Rex orange country ✨",
            "Oh wow, I feel this. I didn't marry the guy but I dated a guy for about a year who I also discovered had a pattern of cheating. I took him back twice, and when he was again swearing things would be different he was still cheating with the other girl and I felt the same thing you did. No surprise, not even disappointment. Just disgust tbh. Good for you!",
            "Sounds awfully familiar to my situation. You don’t realize how better you feel after you cut the cord and gtfo! \n\nCongratulations!",
            "My ex did this.  He left me for another woman and then came around begging me to take him back. I relented, mostly because we had a toddler and I figured it was best to try to \"keep the family together.\" 3 weeks later I found out he was in contact with her, begging her to take him back lol. Biggest mistake of my life was letting him move back in.  It seems like everyone always wants what they can't have.",
            "I remember reading this!!!! Omg good for you, I’m glad you made it out and found someone better",
            "I spend too much time on this sub and this was so nice to read. I’m SO FREAKING proud of you, like I feel it in my chest. Sending love 💕",
            "> TL;DR: I divorced him and found true happiness.\n\nThis is the best TL;DR ive seen on my 3 years on reddit. \n\nGood to see a girl level up!",
            "Nothing to add that hasnt been said except that you’re fricking brilliant for walking away. So many people stay in this cycle for too long.",
            "I’m so proud of you!!! And I’m happy for you!",
            "I could have written this. I am so proud of you and so happy for you!! It's so scary and difficult to make that first step, but in the end, it's so worth it. ❤",
            "This is the best update. I'm so happy for you! And thank you for writing back in to help others - reading updates like this one helps people feel confident enough to leave shitty relationships.  :)",
            "I am so proud of you! The bravery to do the hard - but right - thing is something that is inside us all... Unfortunately, sometimes the people that should've loved us make the choices the hardest. Rely on yourself first. Always, ever, because your honesty and daredevilness saved you and will probably save you more in your life. \n\nGreat writing, awesome post! I hope your love works out, that your daughter grows up to be just as badass as her mom and please,  when more drama with mr. 'I promise I will do different' assman arises, let there be another post. \n\nKind regards from your love-garden-planters",
            "Wow. So moving out there to be with him led you to meeting the real love of your life. Funny how life works. ✨",
            "I'm so happy to read this. And so pleased you met someone wonderful too.\n\nI am currently trying my hardest to cut off my ex bf as he just left me for another woman half way through our pregnancy.\nHoping I can stay strong and not cave and chase him or play the pick me dance.\nThanks for giving me some extra courage.",
            "I remember your original post and was happy to see your update. I went through something VERY similar with my ex-husband and have found someone truly amazing, like you have. \n\nI wish you, your daughter, and your new love the best in life. Congratulations on your freedom!",
            "I read something the other day about “choosing your hard”.  Divorce is hard,  but so is a bad or hurtful marriage.  Choose your hard.  I’ve been applying this to all parts of life since I heard it, and it’s an extremely helpful lens.",
            "This update makes me so happy",
            "I am so happy for you OP! Thank you for posting this update!",
            "Oh man, I remember your original post. That's awesome! Congratulations.",
            "So happy for you! I think all cheaters follow the same playbook. I left my cheating ex and my life has been so much better too. Congrats to you.",
            "My heart is so so so happy for you and your daughter!!",
            "So pleased for you. I hope he's a better father than he was a husband for your daughter's sake. I'm glad you met someone who treats you exactly how you deserve. \n\nKeep smiling and remember how bloody strong you are!",
            "Good for you. Life is way too short to stay where you aren’t happy. Being single is much better than being with a cheater that doesn’t respect you",
            "Just wanna talk about the formatting of your title, usually the age and gender parentheses follow the subject, so when I saw the title I thought you were both a 29M and a 28F.",
            "What a human mess. He must be deeply troubled to tell two people the same thing like that. That has to be very unsettling for him personally....",
            "[removed]",
            "[removed]",
            "Op immediately falls in love after husband continues to cheat and is caught again. I'm sure everyone clapped too.",
            "Thanks for sharing and glad that you've built a new life for yourself and your daughter!\n\nIf you see this and it's not too raw, do you mind sharing if there were any signs that you realise (now or then) that he was this sort of person?\n\nIt's really scary that you've been with this person for 8 years and (to quote your original post) \"seemingly separated overnight\".\n\nWas there anything you were deliberately overlooking during those 8 years or did he suddenly do a jekyll and hyde?",
            "I’ve been in a cycle of cheating with my partner and we just had another blow out fight about what I found out yet again. I just want to keep reading your last paragraph over and over and over. I don’t want out because I love him but I don’t want to feel like this anymore. I know those go hand in hand though."
        ]
    },
    {
        "post_id": "8wotk9",
        "author": "iamastarsfish",
        "title": "UPDATE: Every year, my boyfriend (21M) and I (22F) go on a “break” because he doesn’t know what he wants",
        "url": "https://www.reddit.com/r/relationships/comments/8wotk9/update_every_year_my_boyfriend_21m_and_i_22f_go/",
        "score": 7041,
        "num_comments": 147,
        "created_utc": 1530920498.0,
        "selftext": "Original post: https://www.reddit.com/r/relationships/comments/88bexu/every_year_my_boyfriend_21m_and_i_22f_go_on_a/?st=JJAFPS2E&sh=4755fc51\n\nIt’s been about 4 months since my first post and I thought I’d post an update.\n\nLooking back on this post, I can’t believe what a difference 4 months has made. After posting it, I read my own words and realized that the relationship was over. I was making excuses for him and justifying staying miserable in the relationship because I just loved him so much. \n\nWe had a talk when I visited my hometown and broke up. We both were emotional but knew it was  for the best, and I was content thinking we were going to spend time being single and discovering who we are as individuals after being so close for so long. \n\nUnfortunately, that wasn’t the case. I found out he had been cheating for at least a couple months before telling me he wanted another break. He began officially dating the new girl about 3 days after we broke up and he moved in with her after a couple months of dating. He has always been super resistant to commitments before, so that came as a shock. My self esteem took a huge hit. \n\nNow things are different. I discover new things about myself every day, I spend time with my friends who make me feel loved and important, and I’m truly happy for the first time in a long time. At first I wanted to start dating again and I told myself I was ready, but the truth is that there’s so much I don’t know about myself yet, and I want to get to know me before I focus on another relationship. \n\nAnyway, thank you to the people who commented and let me know that something was going on. As obvious as it was to them, I was completely blindsided. I’m just grateful to be out of that situation and I’m excited for what’s ahead.\n\nTl;dr : we broke up, he was cheating, I’m much better now",
        "permalink": "/r/relationships/comments/8wotk9/update_every_year_my_boyfriend_21m_and_i_22f_go/",
        "comments": [
            "Awesome that you’re putting yourself first and moving on happily. \n\nI’m sorry he was cheating. That’s tough. ",
            "I'm glad you ended things. Reading the original post just now, i kept scrolling hoping it ended up with a break up. You are young you have a lot of experiences to still have, and people to meet!",
            "Congratulations, I truly believe you will be way happier than him, if not already. It takes a lot of strength to go through the self-discovery process and I think you still have some more revelations about your ex-boyfriend/relationship that you are going to discover.\n\nI know you said your self-esteem took a hit when he moved in with his next girlfriend, but it won’t be sunshine and rainbows that you think it is. First, if he cheated on you with her, he will cheat on her - and that is the opposite of commitment. Second, there relationship is already showing signs that is an unhealthy one e.g, the relationship is moving way too fast if they have already moved in together - I think you would fully understand and have a revelation about this when you go into your next relationship when your ready. \n\nIt also sounds like he doesn’t know how to be single - he jumped from one relationship to another instantly - this is where you have the hugest one-up on him because you are starting to discover how you can love yourself without any validation from anyone else and that is a powerful thing because the more you love yourself, the more confident you are and the more people you attract because of it. So own it and enjoy it.\n\n",
            "Congrats! I'm glad you're happier now :)",
            "Wow that is messed up.\n\nMe and my boyfriend used to go on breaks or break up a lot in the beginning, but always got back together. I usually begged him to stay etc. The last time he suggested a break I told him flat out \"no more breaks, if you want that it will be a breakup for good. I want to see you delete my number right now and if you walk out the door it will be the last time you ever see me\" that straightened his ass out of that break nonsense.\n\nI was going to suggest doing something similar but reading the rest of your post I see that it's a long gone situation.",
            ">As obvious as it was to them, I was completely blindsided.\n\nOP, stuff like that is only obvious to people when they've had a lot of experiences and been burned by people like your ex. You're young and you trusted him, and he used that against you. He's a giant piece of shit, and I'm so sorry you ever had to deal with a person who would behave that way.",
            "Pretty inspiring stuff. Glad to hear you're in a great place in your life and taking the time to get to know yourself. A relationship can be a great addition to our lives but if it's filling a void we're doing it wrong. No other person can fill the me shaped spot in my heart.",
            "It's OK to feel bad too. What happened to you was horrible! And I suspect it will really hit you at some point...it hasn't been very long. But kudos to you for the strong, positive attitude and perspective. You will surprise yourself at how enormously you will change. And it might be hard to believe now, but you will meet someone that you will love more. Seriously. When love is truly reciprocated, it opens up space for things to be very different. Remember how you felt about him...imagine someone feeling that way about you, 100% of the time. Look forward to it.",
            "You give me hope that I will recover from my recent breakup. Congratulations and continue to learn and love yourself.",
            "Take the time, and one day, you'll find someone who actually deserves you.",
            "Me and my ex boyfriend recently broke up and I always want to jump straight back into dating but I think I'm going to do what you are doing. I'm actually really surprising myself with the parts of me I didn't know were there and the things I'm capable of. I'm sorry that things didn't work out, but I think of it that I get to look forward to falling in love again. I hope you find yourself and eventually find someone 100 times better than your ex ❤️",
            "I hope you know that his actions after your breakup don’t say anything about you or your relationship with him.  My first thought when hearing that he moved in with someone right after a breakup is that he was probably compensating for his sense of loss, stability and connection to you. He was afraid of commitment and as soon as you broke up with him for lack of commitment he made a huge commitment with someone else.  That screams insecurity to me. You are both young and it seems that he is much less emotionally mature than you.  I’m glad that you ended an unhealthy relationship and have given yourself time to grow and explore what another relationship feels like.  A healthy, happy relationship is the best feeling in the world.  Given his behavior, I can’t help but think it will take him a long time to find that (even if from the outside it looks like he has it).",
            "Honestly I think this is perfect timing for your life. You are going to finish grad school and start your professional life as a single and enlightened person. I took some time in my 20’s to be single and I am grateful and look back very fondly to that time. ",
            "Best decision you can make! Stay alone for a while and get to know yourself better!, I went through a break up 3 years ago (I had a 6 year relationship) and decided to stay alone cause I was too young when we started and also I wanted her back so much that I thought that it was not a good sign and that before going into a new relationship or something like that, I had to learn how to be okay just being alone and know myself better.\n\nIt was the best decision, 3 years have passed,  I started dating again, made some mistakes and learned from them, started going on trips and since last year started going on trips by my own cause I love having my friends with me but also I can have a great time just being alone.\n\nMy new girlfriend came at a really good time, I was healed and ready to start a new relationship and knowing what I want in a serious relationship, we weren't expecting this tho but I haven't felt this way in so long and it feels so good to have someone with you, even tho we have things in common, there are things we don't but we respect and learn from the other, we also come from different cultures but that's not a big deal.\n\nJust be patient with yourself and I wish you the best!",
            "My ex did the same thing, one day during my degree I had a call during class. I answered it and it was my mum and I stepped out. She said my ex had been crying down the phone because his gf who he was cheating on me with cheated on her. We had a GOOD laugh. \n\nI don’t know if I believe in karma, but I do believe bad people often get a taste of their own medicine. \n\nJust enjoy life, that’s the best revenge.",
            "I love seeing updates like this. Congrats on getting out of a terrible \"relationship\". Enjoy all you've got ahead of you.",
            "\"Now things are different. I discover new things about myself every day, I spend time with my friends who make me feel loved and important, and I’m truly happy for the first time in a long time. At first I wanted to start dating again and I told myself I was ready, but the truth is that there’s so much I don’t know about myself yet, and I want to get to know me before I focus on another relationship.\"\n\nyou are my spirit animal, this is exactly how I feel. Good luck on your journey!!",
            "Sounds a lot like my ex. We have been on and off for like 8 years with periods of 1 month to 2 years of breaks at a time. It never gets better. She always gets bored after a while and wants to break up. And every time she was seeing someone else or having inappropriate chat conversations. She can’t explain why she feels this way and I believe her, but it doesn’t change the result. The result is always the same.",
            "Thats the worst. When your SO doesnt want to do things with you because you think he is just not that kind of a person, but when he finds a new girlfriend, he does \"that\" (what ever that may be) with a new girlfriend no problem. I've experienced that as well , and it makes you feel like crap.\n\nYou have a healthy attitude towards it, and I wish you all the best.",
            "The third paragraph put a lump in my throat and tears in my eyes. I am so sorry. ",
            "I am glad you are focusing on you! I hope this positivity continues.",
            "Good for you! Move forward and what he did says NOTHING about you and EVERYTHING about him! ",
            "Good for you, I wish you the best of luck ",
            "Sorry that was the case, glad you're happier now.",
            "> I was making excuses for him and justifying staying miserable in the relationship because I just loved him so much. \n\nThis goes for most of us out there. Love is a force that can be used for a lot of good, but it's also prone to blinding us to the truth. Whenever you doubt yourself, look back to this topic and see yourself as you should be.",
            "Oh my goodness. I'm sorry that happened to you. The day after we broke up, he immediately added this girl he used to like back on Facebook, which makes me suspect that he was cheating on me for the latter part of our relationship. Oh, I don't know...",
            "Your state of mind is the absolute healthiest that anyone considering another relationship could hope for. I'm glad that you're happy and so level headed.",
            "Your post, although a bit melancholy, is actually inspiring. Good on your for realizing the harsh truth of the relationship and bettering yourself and surrounding yourself with good people and a better perspective.",
            "Congrats! I love seeing stuff like this! Just do yourself a favour and don't ever ask yourself \"why her and not me?\" Because it doesnt matter and it doesnt have anything to do with you. Some people find cars and baloons sexually attractive. ",
            "At your age you’re a very strong woman for seeing so much optimism. A similar situation just happened to me and I’m 30. I’ve been depressed for like 3 months. But we both have to thank god we dodged that bullet. Better we find out now then when we’re married and have kids. ",
            "Genuinely proud of you. You go girl!!!!",
            "My ex never admitted to cheating, but I can't imagine that he wasn't based on how quickly his next relationship got to pregnancy. He gave me a lot of lies though, and I'm still working on getting over it. \n\nGood call on self discovery before diving back to the dating pool. I've made a couple half hearted attempts, but no one deserves that, especially not you. So keep waiting until you're ready, and eventually maybe someday we'll both be bosses with significant others matching in awesome levels. ",
            "Hey OP, well done on moving on from that douche! I don't know if you received this advice on your last post but you might wanna get tested for STDs, just incase :) ",
            "Moving in at 21 after a few months of dating which started as an affair? That'll work out well",
            "I am glad you found happiness. You are still young and have a lot of time to find love. Wishing you the best!",
            "Find your happy place, you will appreciate the time you took",
            "That’s great to hear! \n\nKnow yourself, know your worth!",
            "wow im sorry for how it turned out....",
            "You deserve to be happy! Things weren't ment to be and there are plenty of fish in the sea when your ready to get back out there. ",
            "Reading this is really like a balsam for my soul. I’m so glad that you had enough strength to move on and be happy again!\nI’ve been through something similar and after a looong long time I’m finally starting to feel really happy and secure with myself and it’s the best feeling ever.",
            "Sorry to hear this but I think it's a good thing to think about.  You said he wasn't the type to be sneaky (in the original thread) and even felt like everything was going good, except for this strange behavior that he gets to express concern about the relationship every year, and want to go on a break.\n\nAlso, the idea that a person seems hard to commit to you, but does it for another -- this is why reddit users sometimes say, \"just break up, a happy and healthy relationship shouldn't be this hard\". \n\nHe was capable of commitment, just not to you.\n\nSo I do strongly suggest that as much as we love the other person and the other person says they love us, if there are some concerns -- try to figure them out together or if things keep repeating themselves to give the same problems and issues, consider some other options, ie, breaking up.\n\n\n\n\n\n\n\n",
            "Reminds me of the Kanye verse from \"Devil in a Red Dress\" that goes \"Why we fighting anyway?  Oh that's right, it's Summer Time,\"  Seriously though, just break up with him.  You are 22 and still young.  You will find a great guy that deserves you.",
            "My ex and I were in a similar situation. Stay strong because you deserve the world and someone will give it to you.",
            "You're valuable, OP.\n\nKeep believing in your own self-worth. Shatter the stigma of \"being left behind\" and keep winning.",
            "I could literally here empowering/moving on type cameo music in my head as i read your update. Glad to hear you're happy",
            "Good for you OP. I’m sorry to hear about you getting hurt, but I’m inspired by your courage and willingness to be single to figure yourself out.",
            "For future reference, after 2 years of seriously dating, if a marriage isn't firmly on the table then seriously consider where the relationship is going.  Anyone that really loves you will do anything to be with you.  They won't give you bullshit commitment reasons. They definitely won't need a break from the relationship. They will move their schedule around to spend more time with you.  Real love cherishes you and isn't flimsy on how they feel about being with you.  Never make excuses for someone.  (source: Happily married middle aged woman)",
            "That’s not a boyfriend. ",
            "I'm sorry u/imastarsfish, you're better than him anyway. Please keep your head up and be happy.",
            "You know what... You got to compromise in every ways to succeed in yiur relationship.\n\nIt doesn't matter who's the elder or the youngest.\n\nWhat matters the most is that you get to comprehend every things, problems, matters, serious ideas, and most of all the Family.",
            "I’m sorry that happened to you. But do not let your self-esteem suffer. I have in the past broke up with awesome guys, very cute, very educated, and they treated me so great. People told me I was stupid for breaking up with them. I just didn’t have feelings for them for some reason. I wish I could of. And I have dated and been dumped by guys who were objectively less attractive, treated my terribly, and do not have nearly as much going for them as the men I have decided I would not be with. However, I was devastated by these break ups. Some people are emotional or illogical. Sometimes you want to create feelings for people and you just can’t. If someone breaks up with you for someone else, it’s not because they are “better” at anything. It could be 1000 reasons and more than half of them are illogical. In any case, I’m telling you this to let you know, don’t let your self esteem take a hit.  I’m happy you are taking care of yourself. ",
            "The exact same thing happened to me. He was talking about marrying me at first and then started to get less and less committal and “uncertain about marriage.” Finally going on breaks all the time. I finally couldn’t handle it anymore and called it quits and now he’s married to the other girl. \n\nThe thing that finally made me get over him was realizing for certain that my life was so much better without him and his drama. I was able to travel and put myself first and grow relationships with people that I didn’t expect. Take your time with dating. I wasn’t ready for a few years but now I feel I’m in a place where I live myself enough to know what I want again and can give to another person. ",
            "Kudos girl! This time, doing it intentionally to focus on you and what you need to be happy, is going to give the insight you need to grow into a person who demands (in physical presence, not vocally) a healthy, fulfilling relationship. Then, one day, you'll meet someone, and while it can be compromising and frustrating, it will just work and flow. \n\nI have been trying to explain this to my mid-50's, serial monogamist mother. She finally left her 3rd and final husband and has finally seen some of the patterns her lack of insight created in her life. She got a room for rent by the beach, and is living a life where she is in the number 1 spot, considering her well being and happiness as paramount, realizing it doesn't take nearly as much work to maintain and couldn't be happier. The last year has been quite repairing.\n\nIt's a lesson we all have to learn. \n\nOh... and don't be surprised, if he sees you after, lessons learned and implemented, beautifully independent and possibly with a guy who blows him out of the water, he tries to weasel his way back to you. If he does, remember, will be the same person who doesn't deserve you.\n\nThis is something I went through and in my experience he had a baby with the girl he cheated on me with, and married the girl he cheated on her with.",
            "Don’t keep wasting your time ",
            "What you said resonated with me a lot, especially when you talked about both of you becoming better people. I broke up with my girlfriend, and we both had some issues. I wasn't very attentive or affectionate, and she was self-centered and would not work with me as a team.\n\nAfter we broke up, I realized how my negligence impacted her. I tried to change into a person that better recognized when people depended on me so I wouldn't let them down or I could give them the attention they desired. I had hoped that being single would help her grow as well, maybe turn into someone who understands why not acknowledging someone's feelings will hurt them in the long run.\n\nInstead, she got a boyfriend a month later. I'm not upset by the fact that she got someone new so quickly, but I am disappointed because I feel like it will stunt her emotional growth to be with someone else. If a person is stunted in some way, it takes a lot of work and self-introspection to change into a better version of yourself. It also takes a lot of work and introspection to make a relationship work. I worry that she isn't going to see as much individual growth if she is also working on forming a new relationship, and that's disappointing.\n\nAll of that is to say that I'm glad you also saw the breakup as a moment to grow. Too bad you ex is too distracted with someone else to do the same.",
            "Work on you! Sorry he was a fucking tool. My girl is moving out after 6 years. Drugs, co-worker shit and alcohol played a role. But her therapist and her think it’s a good idea to “take a break” I immediately suspect cheating” shit sucks   ",
            "Not gonna lie I didn’t read all of it just skimmed it but you go girl! I feel you!",
            "This will do nothing for your self-esteem or relationship longevity/health. \nDump him. Let him really find out what he wants. If you both really want it after 6 months. Talk it over and see if you can. Otherwise, no matter what he wants in his heart, his head ain't ready to commit. When you know, you know. ",
            "[removed]",
            "[removed]",
            "[removed]"
        ]
    },
    {
        "post_id": "g4ddku",
        "author": "throwaway909066",
        "title": "Update - is it worth it to try to work things our with my boyfriend, ho is jealous of my stepbrother?",
        "url": "https://www.reddit.com/r/relationships/comments/g4ddku/update_is_it_worth_it_to_try_to_work_things_our/",
        "score": 7053,
        "num_comments": 316,
        "created_utc": 1587323295.0,
        "selftext": "[Original post is here. ](https://www.reddit.com/r/relationships/comments/g367sr/is_it_worth_it_to_try_to_work_things_out_with_my/?utm_source=share&utm_medium=ios_app&utm_name=iossmf)\n\nAfter I posted, I took some time to read the comments and form a plan. I texted BF, telling him essentially that I needed a bit of space to take a breather and reevaluate. I made it clear that I didn’t want to break up, but felt like I was always being monitored and I wanted to make a game plan to have healthy communication through this pandemic. \n\nHe called me super upset and accused me of choosing SB over him. I told him that it wasn’t about SB, it’s not like I chose SB, he’s literally just someone I get along with who I can hang out with during the pandemic. I explained to him that it was not like I was spending every waking moment with him, I do my homework in the morning, we hang out in the afternoon, and my evening time is divided between the 4 of us (mom, stepdad, SB) and FaceTiming BF. \n\nBF then accused me of doing special, “boyfriend” activities with SB. He told me that it was always his dream to teach me to drive (he doesn’t even have his permit. Am I supposed to wait around for him to get it?). Also apparently me teaching SB how to bake bread? Which is stupid because I was going to make the bread to begin with, and SB “helped” by moving the heavy mixer, eating half the almond slices, and taking pictures for Instagram. \n\nHe also screamed at me for not moving in, saying how all this would have been prevented if we were living together. I told him that I have no interest in living somewhere that I’m not allowed to be. I can’t afford a fine from bylaw, and if I were to get kicked out, it would be more difficult to find my way home since I don’t drive. \n\nIn the end, I told BF that I would not give up my relationship with SB, who is part of my family and a genuinely nice guy, to ease my BFs insecurities and cater to his demands. I told BF that I needed time to cool down, and that I’d talk to him in a few days. That was all on Friday, and today I reached out to see how he was. He was still pissed at me and accusatory, so I basically told him that this wasn’t working and I want to break up. I did it over text and then blocked him, which probably makes me an asshole, but I literally couldn’t deal with anymore of him yelling at me and insulting my family. \n\nAnyway thanks to everyone who commented. I’m really sad this is the outcome and I’ve been crying a lot, but I’m also kind of relieved. \n\nTLDR: we broke up because he couldn’t see how controlling he was being.",
        "permalink": "/r/relationships/comments/g4ddku/update_is_it_worth_it_to_try_to_work_things_our/",
        "comments": [
            "Good call. Your gut led you on this one. This sort of behavior would have found its way to something else, if you chose to dismiss it.\n\nSounds like some real LDE, though.",
            "Lolol.. his dream was to teach you to drive... But he doesn't know how to drive himself.\n\nTotal and compete wackado",
            "Awesome job! You definitely made the right move here. It might be hard but he has sooo much growing up to do if he EVER wants to be in a relationship. And I just mean in general, I'm definitely not advocating you wait around for him. You deserve better!",
            "You are NOT an asshole. You needed to protect yourself from the incoming onslaught of abuse and guilt trip he was going to throw your way and you did the right thing. Things would have only escalated if you kept in touch with him or worse if you did it in person.   \n\n\nI'm sorry things are grim right now but thankfully life goes on and you will find someone who loves and respects you.",
            "Omg this is AWESOME. Good for you girl. It’s such a burden dealing with someone who is jealous and insecure. It’s refreshing when you don’t deal with them anymore",
            "Sounds like the silver lining to this whole quarantine, it saved you a lot of time and emotional investment.",
            "Good for you OP! \n\nThis guy's got some control issues, does he for real think you can only bake bread with him because it's a \"boyfriend\" activity? What about making eggs? Too brunchy/morning after for him? Goddamn, you couldn't exist around your family if he had his way",
            "The fact that he screamed at you is a huge red flag. I would have serious reservations in moving forward with this boy. He feels threatened by your family for no apparent reason and him being possessive and wanting you to move in is a classic controller move.",
            "Congrats! Celebrate! You dodged a missile. Your ex bf is a toxic abusive narcissist! The fact that he wanted you to break the law to move in with him is INSANE! This pandemic exposed who he really was. Be thankful. If he acted this way over your *family*, he would have accused you of sneaking around and having o\\*rgies with his roommates. His tantrums might have turned physical. For your sake, I hope he remains an ex.\n\nETA: you're not an asshole for breaking up via text. He's abusive and left you no choice. You did good.",
            "You did the right thing, OP.",
            "Good job OP that was complete nonsense on his part. You can find someone much more reasonable.",
            "Oh, OP, you handled this so exceptionally well!\n\nAt every step you showed a very adult thoughtfulness, you laid down and defended boundaries, you gave your ex chances to save face, and most of all, you looked at the situation *clearly*:  you didn't allow your thoughts to be clouded by fantasies of how things could be if only you could change him.\n\nI know it will sound like a strange thing to say, but this was a *good* break-up:  You have learned you can stand up for yourself in a difficult situation, and that the world won't end because you walked away from an unsuitable boy.  \n\n10/10.\n\nYes, you will hurt for a while, but that relief you're feeling tells me that you won't be in pain for long.  \n\nP.S.  Two things:  *breaking up by text is* ***fine.***  I know some redditors liken it to shoving an ex onto the next train to Auschwitz, but it was the pragmatic thing to do--you already knew how he would react and there was no point in putting yourself through his verbal abuse.  You aren't supposed to accept abuse as some kind of punishment for breaking up with someone, that's just...insane.\n\nAlso?  You didn't break up with your bf because \"because he couldn’t see how controlling he was being;\" you broke up with him **because he was controlling.**  Don't make the mistake of insisting that there must be *intentionality* for bad behavior to count as \"bad.\" The point is that when you explained that his behavior hurt you, *he refused to stop.*\n\nThat's it.  If behavior hurts you, *then it hurts you.*  You don't need testimony and receipts \"proving\" that he was doing it deliberately in order to be upset.  If someone with good intentions is told, \"Hey, that thing you're doing?  It hurts me.  Please stop,\" they...*stop.*\n\nYour ex didn't stop with the control *because he didn't care how you felt about it.*  That's all you ever needed to know.",
            "The idea that he wanted to teach you to drive despite not knowing himself is extremely... Weird? I dunno the word for it",
            "Never, ever, EVER give in to jealous bullshit. I see you’ve already broken up, AND blocked him, and that’s definitely for the best. Blocking this type is almost always the only way to end it, because they won’t let it go if they still have a way to contact you. \n\nBut I’d be willing to bet he’s not done. I know this type. If he can find another way to contact you, he’s going to do the “crawling back”, perhaps with a grand gesture, and with all the apologies and crying and anything else he thinks you want to hear. \n\nDon’t fall for it. They’ll do literally anything to get you pulled back in. And they get very, very angry when the crawling/apology phase doesn’t work and they realize you’ve actually escaped their field of gravity, truly slipped their grasp. If the pitiful apology or perhaps grand gesture followed by SHOCKING anger/cruelty after it doesn’t work hasn’t happened yet...be aware he may not be done yet. \n\nJealous types don’t accept breakups with just a few assholish comments They simply don’t. Blocking all avenues for him to contact you and keeping it that way is by far the smartest thing you can do.",
            "Your ex was extremely manipulative. Good on you for breaking up with him. Also, you aren’t the asshole for blocking him. At all. He is the asshole in every scenario. He definitely watches way too much porn. Who would be threatened by a stepbrother?? Especially when you’ve made it abundantly clear that you don’t see him in that way??",
            "So glad you got out, this is the kind of guy who gets mad at his wife for breastfeeding the baby. Total creep.",
            "Kudos! I think you responded to the situation extremely well and am glad you were able to see what was going on.",
            "That couldn't have been easy but you did the right thing! Anyone who's that jealous of family is trash, you'll find someone far better",
            "Had a GF like this.\n\nShe was projecting and was cheating the whole time.",
            "I’m so glad you broke up with him! His behavior was only going to get worse.",
            "That's a big yikes from me! Good on you for getting out. If this is how he's being now, imagine how he would be further down the road if and when you guys did decide to move in together. Girls night out? Late night days at work? Out of town vaca with your friends? Sounds like a headache and more.",
            "You dodged a bullet there. It's hard with relationships that turn controlling because the beginning is usually good/great. They have to get you to stick around, then you get attached and get it to where you would be the one to feel bad about leaving because \"other than this one thing the relationship has been good\". then, like people were saying, they start testing boundaries and \"one thing\" turns to recurring things, to no friends, no family time and before you know it your relationship centers on fear more than real love. Anytime anyone gets that mad at you for not doing what they want over what you want or makes you comfortable, turn and walk away. It can be to walk away for them to calm down, see reason and apologize or it can be a full walk away. People who can see their issues, work on them and fix them themselves are the ones you might give a chance to. Anyone who does what he did by yelling, continuing to yell and then yelling more when you tried to take time to give him a chance, deserves no more time or attention from you. \n\nTake this to learn from and find yourself someone that can trust and appreciate you, not try to control you. Also, have fun bonding with your family.",
            "Breaking up over text wasn’t unreasonable. You’re allowed to do what you need to in order to feel safest. Your ex was controlling and sounds manipulative. Limiting any future chances he could have (like meeting in person to break up) to try to change your mind is a great idea.",
            "OP, I want to say you  are not an asshole for breaking up over text and blocking him, imo he does not deserve any better. I am glad that you got out of this before things may have turned for the worse down the line",
            "I commend you for being so rational and emotionally mature, especially at 19. You dodged a bullet with this guy for sure. Don't feel bad about blocking him when he was the one being completely unreasonable and childish, and not able to have an adult conversation.",
            "It’s a shame OP that your ex insinuated that you had an inappropriate relationship with your sb. Unfortunately, with his behavior it wouldn’t end of you distanced yourself from your SB, he would find fault in your other relationships/friendships because he’s that insecure. Good luck OP",
            "Sounds to me like this dude watches to much stepsister porn",
            "Wow, you are so much better off now.",
            "I normally hate the idea of breaking up via text, but that's better than ghosting. But in your case, you made the right call. He would cry and get angry and manipulate and berate you on the phone or facetime for sure, which he shouldnt be given the power to do. He does need to grow up more before he gets another relationship, but he doesnt seem to be willing to grow his self awareness.\n\nYou made the right call for sure haha. Dont feel bad at all!",
            "Good job.  I just told my wife \"i am upset that your grandmother is teaching you how to sew when it was always my dream to teach you how to sew\".  And she replied \"suivoh, you dont even know how to sew\".  \n\nThanks for the laugh.  It will get better.",
            "You’re a very smart young lady. I’m saying this because he wanted you to move in with his roommates and you’d be an illegal tenant most young girls jump at that and it causes issues with the roommates. The issues with your stepbrother is weird and warped asf and your ex definitely has been watching too much stepfamilial porn if he thinks you hanging out with your step brother is some threat to your relationship.",
            "Good on you that type of behaviour screams out Danger, Danger. If he’s going to be that jealous over a family member whom your in quarantine with and demanding that you stop seeing him and face timing him for 3/4 hours a day you were very smart to get out while you could.",
            "Well, that sounds like a happy end to the story. He sounds exhausting. Probably won't learn his mistake for his next relationship, but that's his business.",
            "I'm not usually on the \"red flag, break up\" train, but that was definitely the best call.",
            "Just incase that nutjob left any weird doubts in your mind, the avtivities you described are what my little brother and I do together. I'm married with my own family but when baking my best little helper is my brother. That boy was bad news. Good you dropped him.",
            "You did the right thing. This dude was bad news.",
            "I remember when I use to be similar to your boyfriend. Not to that extent, but definitely wanted control and couldn't handle my own insecurities. Nothing pushes away someone faster than being that way. Its ugly, man. Maturity plays a big role here. Sometimes you're too stuck in your own ways that you fail to see the harm you're causing, and so you think \"if only my significant other will listen everything could be great.\" It's a hard lesson to learn. Although a very important one. One thing that doesnt help your ex is that he has 3 or 4 other guys living with him who are, if I had to guess, constantly telling him \"you need to control your girl bro,\" or \"she definitely has a thing for SB.\" Things along that line. Theres probably not one sensical person confined within those 4 walls which only escalate your ex's insecurities. Leaving was a good decision.",
            "So important that you know you’re not the asshole for blocking him. It’s the smartest thing to do and anyone who cares for you as an objective observer would insist you do that. People like your ex are great at emotional blackmailing and manipulation and making everything seem like it’s your fault. You feel like you have a clear head and 2 min into talking with them you question your actions and wonder if you were wrong. Please don’t unblock him. See this red flag for what it is and find a better guy :)",
            "There are so many stories of people staying with patently abusive partners and justifying it in all sorts of heartbreaking ways. \n\nYou made my whole damn day by not being one of those stories OP. Well done 👏",
            "Good job! I shudder to think of what would have happened if you had moved in with him.",
            "I think you made a good call. It sounds like your BF is jealous and possessive. Anyone demanding that you do anything or telling you who to hang out with is no healthy and it seems like a giant red flag. I have a step brother and we are close, but he's my brother. Eww. Anyone who tried to seperate us or make me feel guilty for spending time with him would be dumped aside because he's family and that's that. Good for you for recognizing the situation for what it is and making the right choice not to move in with him.",
            "You absolutely did the right thing. He wanted you to live with him so he could monitor and control you. If you'd stayed with him, he probably would have turned abusive eventually.",
            "GOOOD JOB. all I gotta say.",
            "Just flip the situation and imagine him going out with his step sister and you stalking on his  instagram, just flip the whole idea and see if you're okay with him doing everything you did. If you're okay with it then you did the right thing and you're not an asshole but if you feel like him doing it is toxic or cheating then I suppose you are.",
            "It’s just really weird that you BF is so jealous of your STEP BROTHER.",
            "Ew, your ex sounds gross. It’s not weird to be friendly with a stepsibling you’ve had for 5 years. Glad you dropped him!",
            "I went into this, just reading the title, kinda understanding where he's coming from, I've had similar insecurities in the past, but... his actions upon those fears were completely irrational, and I agree with everyone else, you dodged a bullet.",
            "Good job! Remain firm. You don't need that kind of toxicity in your life.",
            "Like everyone else said, you made the right decision. Ex was a total possessive jerkwad who definitely is not someone who you should be with, especially during stressful times like these. I hope you’re doing well, much love your way <3",
            "Give yourself a gold star for handling your business and standing up for yourself like a BOSS!",
            "Good for you! Yes, it’s painful to let go of someone you care about, but this is you taking care of yourself. Dealing with jealous partners is EXHAUSTING, SB was just one of many more dudes he would have used to protect his insecurities. He sounds fcking mental tbh. I hope you feel better soon!",
            "Sounds like you made a good decision.",
            "Short answer? No. Not worth it.",
            "Sounds like an insecure kid so you did the right thing.",
            "Smart move. He sounds incredibly insecure and it’s not your “job” to contatantly reassure him over stupid shit.",
            "Well done! You got out before it got worse and that's never a bad thing.",
            "I bet he's really into stepsister porn.",
            "Christ how much fucking step-sibling porn does he watch to get this jealous",
            "You did the right thing!",
            "Well, it’s a little late now, but I bet you anything if you’d checked his porn history, there would have been a fair bit about step-siblings",
            "Anyone else think the BF is watching too much pornhub with all the step love?",
            "You don't realize how smart you are by asking for space.  He couldn't keep his shit together.  It's your intuition telling you to leave him.  Insecure guys can become dangerous later on down the road if they never improve or seek therapy.  Protect yourself and don't be ashamed about it.",
            "The worst part about this... is that your ex-bf has his head so far up his own ass that he's going to believe you left him for your step brother.\n\nYou did the right thing. It sounds like he needs to grow up before he gets in another relationship.",
            "I had a boyfriend like this. Well done for leaving him but things may get harder. He's going to think that you've left him for your stepbrother - which is so ridiculous. The fact that he doesn't understand that he's family. He'll probably try to reach out to you and pester you a bit. Stay strong and ignore him.\n\nNever let a boy make you feel as your ex did. Trust is such a big thing, good luck!",
            "He’s being insecure cause he watches too much stepsister porn and thinks that’s reality",
            ">I did it over text and then blocked him, which probably makes me an asshole, but I literally couldn’t deal with anymore of him yelling at me and insulting my family.\n\nIt doesn't make you an asshole, it makes you smart. There was no way you could properly break up with him without him blowing up and you already had to deal with that when you said you needed space. He had nothing to say that you haven't already heard. Be on the lookout for him trying to contact you in other ways. It would also be okay to say that your ex's jealousy issues were so bad that he kept accusing of trying to cheat on him *with your step-brother*.",
            "Proud of you for sticking to your integrity and not letting your bf (now ex-bf) push you around and be demanding.\n\nOn another note, I think your ex may have been watching too much pornhub step sibling RP. Like..... That shit doesn't really happen IRL lol.\n\nGood for you!",
            "You are absolutely not an asshole for blocking him.  Even relationships that end on good terms can merit blocking to give both parties a bit of space.",
            "I had a situation once where my gf was jealous of her own little sister. Gf was a year older than me, her little sister a year younger. \n\nWhen I got to know them I asked for little sister's number since we were the same age pretty much and I thought it'd help me connect with my gf's family. Gf got pissed and accused me of cheating on her with her own sister. \n\nThing is, this never got better. I understand people can be insecure, hell I'm most of the time, but things like this are too much and should be seen as such.",
            "You go girl. Glad you took the space you needed and made the hard (but sounds like the right) decision when you saw how he responded.",
            "Still can't believe he was jealous of a step brother. This isn't a porno, jesus.",
            "Your bf watches way too much pornhub",
            "He really left you no other choice. Good job standing up for yourself, it only would've gotten worse.",
            "Sounds like someone has been watching too much porn and thinks this is how the world goes round. Congratulations on getting away from him.",
            "Anyone get the feeling dude is just mad he doesn't get exclusive access to and control over OP during quarantine?  Like \"The perfect opportunity to be everything for someone is being had by someone else!\"",
            "How does he not see that he’s being unreasonable. It’s probably better your not dating someone who can’t put themselves in someone else’s shoes even the slightest. Hopefully he realizes the error of his ways.",
            "Just wanted to say, don't cry over this guy OP. You will find someone who will understand you.",
            "Not an asshole, you did everything right and will probably feel better with one less anxiety during this time.\n\nPS your story about the SB “helping” by moving the mixer and eating the ingredients definitely sounds like some sibling shit haha. So you haven’t done anything wrong, at all.",
            "Oh thank goodness.  I only just read your first post but exBF sounded like an insecure loser.",
            "Thank goodness you broke up with him. He needs to stop watching porn.",
            "Proud of you. Well done.",
            "You are not an asshole for breaking up via text.  It's a cowardly act WHEN it's done to avoid seeing the hurt it causes your soon-to-be former partner That doesn't apply when, like here, you can't see them in person, and it's fairly likely they'll cause you physical harm if you do it in person.",
            "You don't know who a person is until you see them in high stress situations.\n\nA partner is a partner in good times and in bad. Quarantine is not an excuse for shitty behavior, even more so if he can't admit to it and take steps to improve it.\n\nGood job for choosing mature standards over an insecure boy who watches too much incest porn. (Speculation, but have you seen what's been trending for the past year?)",
            "Nice work\n\nBlocking him sounds like the right thing to do",
            "In this situation, you're not an asshole for breaking up over text and blocking him. He treated you pretty poorly and tbh he's probably watched too much porn if he thinks you have something with your stepbrother :/",
            "Dude sounds like a basket case, nice on you for making the right move",
            "I’m sorry, breakups always suck, but so glad you did this. If your ex was so aggressive and unreasonable about your STEP BROTHER imagine how much more unreasonable he could have gotten about male friends or colleagues in future",
            "Hey sweetie you did the right thing. He was staying to gaslight you and that's why you feel that way you do.  But in reality you did your self a huge favor because it would of been worse later on in the relationship. You see he asked you to move in to get you away from your comfort zone and then he would turn in to the meanest person you could meet knowing that you have nowhere to go or friends to back you up.",
            "Good for you for getting out of this abusive relationship. You did absolutely nothing wrong and blocking him was smart.",
            "Good job. He’s young, maybe he’ll learn not to be so jealous later on, and now you can breathe a bit. 👍🏼",
            "Holy shit I’m so glad you got out. Your ex was an immature control freak with, I suspect, an unhealthily large collection of step sibling porn. Life is not pornhub and you shouldn’t be reduced to avoiding your actual family to soothe a psycho’s paranoia.",
            "\\>   I did it over text and then blocked him, which probably makes me an asshole \n\nNah, not in this case. You gave him every opportunity to not be a jackass and he wanted to be a jackass. It's not \"being an asshole\" to protect yourself from further jackassery - you know if you'd called him he'd have just turned it into a drama and tried to emotionally blackmail you into staying.",
            "Honestly, he's 19, he's got a lot to learn before he can be a decent partner and it shows. You did the right thing. Let's hope that in hindsight he'll realize how foolish he was.",
            "Insecure immature jealous guy and possible control freak.  I used to be that way but I grew up. Sorry you're upset but you made the right choice.\n\n*Love shouldn't be forced*",
            "Lock down your FB as well.",
            "You did good OP. the way you broke up with him is in line with every interaction you’ve had with him since you moved back home; perfectly reasonable. You already had a one conversation of him screaming down the phone at you so there was realistically a 0% chance he was going to even give you a chance to break up with him over the phone. You should feel proud of yourself for knowing your worth and your boundaries at 19. I hope the rest of your quarantine is filled with baking, driving and time spent with your family.",
            "A reddit success story!  Good job.",
            "It honestly seems like your BF or ex in this case now, was projecting a lot of his own failures and insecurities on you. Like not even having a drivers license and wanting to teach you is stupid. I have a feeling that he was probably cheating & his behavior during this time really shows his true character. \n\nGood job choosing yourself! Stay safe",
            "Thank goodness. Reading your original post and then this one, your situation sounded incredibly similar to the toxic relationship I was in when I was your age.\n\nIt sounded a lot like this guy just wanted to control your every move and couldn't handle you enjoying anything if he wasn't a part of it. Not to mention his projection of cheating on you (and incestuous cheating at that).\n\nMy ex tried to make a similar claim about me and my cousin (she's gay and he knew I'm not straight), and anytime we hung out he thought I would cheat on him. With my cousin. I couldn't have any friends or do anything fun without him. He tried to enforce a minimum daily phone call time on me, even when I was living in a dorm and trying to make time for homework. I had to plan my whole day around him and his expectations \n\nLuckily I eventually wised up and realized he was mentally and emotionally abusive, and I'm glad you did too. Now you can go forward and recognize toxic habits and put your foot down about not tolerating them.\n\nThis is a great opportunity for you to grow and spread your wings. Best of luck to you!",
            "You definitely are NOT the asshole. This was just a peak into where his behaviours were leading to in the future. Best to get out now.",
            "OP, this guy wasn't healthy for you. He was controlling and insecure and it would have destroyed you in the long run. He was happy in the past because he had you constantly in his sights. \n\nTime to move on and enjoy life :) \n\nYou got this! Break ups are hard, and it will hurt a lot, but over time it won't hurt as frequently.",
            "Goddamn. You know I sometimes find that commenters overreact when they so and so abusive or something like that, and/or you need to break up immediately. But in this case your bf is a lunatic. He’s the weird one for imagining you and your SB like that, and he’s possessive as hell. Like I know constantly FaceTiming personally isn’t my thing, but reading everything you guys do was exhausting. On top of that I don’t get how he gets disgusted by you being around SB when your also with your family, yet he wanted you to move in with four OTHER guys and him. If SB was weird with you like he thinks, obviously you would tell your bf, but since you don’t think so, it mean your bf has trust issues with you. I want to lean toward you guys breaking up, but obviously it’s your choice and you should do it at your pace since it’s your relationship.\nAlso, it’s not you choosing SB over him, that’s ridiculous. You’re being rational.\nEdit: I see that you guys actually broke up. Good for you!",
            "I think you dodged a bullet.\nInsecure, jealous, macho control freaks should be avoided at all costs.",
            "It doesn’t make you an asshole. It makes you a very smart young woman. You did the right thing. It’s incredibly creepy and controlling behavior he was exhibiting and you dodged a huge bullet here. This was not going to get better. Your stepbrother was an excuse. This boy wanted to control you and you decided to not be a victim to that. Good for you! Many of us had to learn about people like him the hard way.",
            "Paranoid personalities are horrible to deal with. They feel that their horrible behavior is justified. Rational discussion do work to bring them back to reality but they will always remain unapologetic about the hurtful things they say.",
            "I know I'm just some rando internet stranger but I'm so proud of you. So many people ignore red flags because things were so good before these bad things reared their heads and  that's just not who they think the person is. But when somebody shows you who they are, you need to believe them and you did. Great job standing up for yourself. You are not a possession to be controlled. You are a human who is allowed to have relationships with the opposite sex, whether you're related or not.   \n\n\nI truly believe that this controlling behavior would have escalated were you to accept his outrageous demands and you would have been in a very bad place. You definitely dodged a bullet and maybe even saved your life.",
            "Holy crap I'm so glad you did the right thing, he was so out of line and disgusting for even thinking that about you and ur step bro like wtf and face timing for 3-4 hours sounds terrible. Also it was his dream to teach u to drive when you're already learning? Again wtf that's weird, teaching another person to drive is stressful af and it's also better to learn from someone whos been on the road for a few years. Anyway keep ya head up and stay safe!",
            "I’m glad you saw through all of this. The point of you moving in was to isolate you. That way he can control you. Same way he wanted you to wait on the car driving- again if you wait for him it’s all at his control if and when you learn to drive. Imagine he got annoyed about something he made up in his head and decided he wasn’t going to teach you! Gross.\n\nHe just sounds like a child to be honest. Controlling too. Good for you for blocking him so he can’t keep chasing you and harassing you",
            "Right call.  BF was an insecure, overly possessive asshole.  And probably watches too much porn....what next?   jealous of the pizza delivery guy...the plumber....the guy at the auto shop?",
            "You were absolutely not an AH for breaking up like that. Your bf is abusive & not a safe person. It was the right move.",
            "Breaking up was the right call. Not because he’s a bad person, I’m sure he isn’t, but because a lot of people are controlling when they’re young. It usually takes one good dumping and later on hopefully they will look back on it and cringe and adjust their behavior accordingly in the future",
            "Any boyfriend that gets jealous of a girlfriend's stepbrother definitely watches too much porn.",
            "You dodged a big bullet- watch your back!",
            "You are not an asshole, you did what you had to do. You did the right thing breaking up with him, and I know that doesn’t make the pain any better, i bet after a little grieving time you’ll feel much better. I’m proud of you.",
            "You made the right choice. I know it's hard now but it will get better.",
            "you did the right thing breaking up with him. You would have just been justifying yourself to him for the rest of the relationship.",
            "Wow. You handled this so well. I wish I was as cool and mature as you at that age. It would have saved me a lot of time and grief from terrible relationships.",
            "Good on you for dodging a bullet! But I'm a bit worried about him escalating when you go back to uni, since he has no way to vent his frustrations after being blocked. Please be careful! He doesn't sound very reasonable.",
            "I'm glad you made this decision. It was hard and painful, but the right one in the long term. Also, really sad that it had to come to this just because of the lockdown and a stupid accusation. Wish you the best of luck in your love life OP, and take your time to heal.",
            "Dump him for good. Super control freak",
            "  I told BF that I needed time to cool down, and that I’d talk to him in a few days. \n\n\\^ You were surprisingly calm. I would have break up with him right there. Glad you've reached a solution OP for the best.",
            "Sounds like the now ex bf spends a little too much time watching step sibling porn",
            "You just saved yourselvef YEARS of abuse and stress. So proud of you.",
            "Don't feel bad for doing it over text. There's seriously no point to leaving the relationship hanging for however long lockdown is to close things off. Given the situation, you handled this amazingly and so mature. You deserve to enjoy this quarantine however much you can and have peace!\n\nEdit: also like others have said, because he was very angry and still screaming days later, it's good you did it over the phone anyway regardless of quarantine",
            "You are definitely not an asshole for blocking him. You did the right thing and protecting your space and setting boundaries is really healthy. Kudos to you!",
            "Shoulda told him to stay off pornhub before you blocked him lol, life isn’t like those step sibling pornos 🙄",
            "no-one likes to break up and no-one likes to feel responsible for hurting someone's feelings, but you made it clear that you felt pressured and overwhelmed and by his reaction the next day he clearly didn't give a shit and was more worried about his own insecurities and your \"quarantine dates\" .\n\nif it was a long term guy friend, a fairly new friend or a friend's boyfriend i could kiiiiiind of understand a little bit of jealousy (still childish to not trust your partner imo we're in lockdown it's not like it was planned) but your step brother? seriously? that's embarrassing and also kind of messed up to think you'd have a fling or relationship with your step brother.\n\ni think most if not every commenter would agree that having to say to your step sibling you can't hang out anymore because your partner is uncomfortable and doesn't like it makes it clear they're not ready for a serious relationship. OP i think you've made a good decision.",
            "This was definitely for the best! You made the right call and I’m glad you’ll be able to live your life freely from now on!",
            "I am glad you got out. You've been very level headed with him too. Hope you don't reconsider and let him back in.\n\nFor your consideration, I've been married 20 years, and if I pulled even part of this shit with my wife, she'd have booted me out in a trice! Not saying I'd even think this way!",
            "I mean yeah good call. Theres a certain type of toxic that would lead to that. Someone needs to get.out of the pornhub incest section. I'm really sorry for you though",
            "I’m going through something very similar\nWe have not been together to long\nBut all of a sudden he feels entitled to everything that’s mine, and acts crazy childish if I do anything that doesn’t include him\nIncluding cooking my daughter dinner\nI asked for space\nAnd he’s doubling down with smothering ungrateful jealous bullshit.",
            "Your ex is toxic as fuck and kind of fucked up in the head, you're not an asshole for breaking up with him even though he will spin it that way. Pray for the next person who gets with him",
            "I love endings like this. Right call all around. He’s controlling and manipulative. He’s behavior is super unhealthy and immature.",
            "You did the right thing. This guy is a mess, and it isn’t your job to spend even one minute cleaning up. Women are not rehabilitation centers for toxic men. That being said, the only fitting end to this story is for SB to be as he has been, a kind and caring big brother, and to continue to be great company for OP to talk to and laugh with, and be a part of her support system with the rest of her family who are all fortunately close by because she was already making such good decisions for herself even before all of this came up, and after this is all over, they’ll have an unbreakable bond and be best friends forever and because OP has such healthy boundaries her eventual future partner, (should she decide she wants to have one) will be thrilled that she has such a great big brother in her life that she can trust and depend on, and who she is close with, and they will be great friends too, and everyone will live happily ever after except for ex-bf who will forever be alone because he’s shitty and even the other dudes he lives with will eventually be exhausted with him and he’ll have to whine to himself about how lonely he is in a dirty bathroom mirror with only one toilet because he sucks and nobody else will tolerate him.",
            "You're not an asshole, OP. You made a smart decision for yourself. It sounds like he may be a slight control freak, as well as immature. And those two things combined are a recipe for disaster. He showed you his true colors and you acted accordingly. Proud of you!",
            "I feel relieved for you. Had you moved in with the boyfriend he would’ve become jealous of one or all of his roommates.",
            "If he gets jealous of your stepbrother he definitly watches way too much porn. Very sad, but he seems\nto need to figure a couple of things out for himself. He shouldn’t believe he can make someone happy if he’s a pile of garbage himself, init?",
            "> I did it over text and then blocked him, which probably makes me an asshole, but I literally couldn’t deal with anymore of him yelling at me and insulting my family.\n\nIt doesn't make you an asshole.  I generally consider breaking up over text a big no, but that doesn't apply when there are specific friction that makes other alternatives unreasonable.",
            "Yes you did the right thing! I wanted to comment on the other post but wasn’t able to. I had an ex who was exactly like your boyfriend. He was jealous of every male in my life, whether I was related to them or not, he was fucking jealous. He even one time accused me of liking my brother! (Eww!!!) He was so insecure with himself that he became manipulative of my life and tried to control everything about me! from what I wore, to who I could talk to (which was *only* him)! It was an abusive relationship and so was yours. Glad you got out there! A real boyfriend wouldn’t be threatened by a fucking family member for crying out loud.",
            "Jesus christ... please do not ever get back together with this guy, he sounds super paranoid and insecure. Good job breaking up with him. You made the right call. If only he understood that he created a problem where there was none.",
            "Omg just cringed and skipped to the tldr, yea thank fuck you broke up with that desperate, needy, pathetic, insecure little boy",
            "Sorry this happened but as someone else said, it's a silver lining the shower you earlier what he's like. \n\nHonestly, I'm kind of curious what the SB thinks about all this, given he's involved in some part (mainly just by being there).",
            "Regardless of your feelings of sadness, if when you break up with someone you feel any type of relief, hold onto that because that means you made a good decision.",
            "Only u can take yr decision. \nYr BF appears to be very controlling.\nU may love him. But does he respect yr feelings, opinions, etc? Reflect over the past experience. Can u sustain such interaction into the future? For how long?",
            "I don't judge you for breaking up over text. After his abhorrent behavior, I can't say it's undeserved, considering he would have probably just shouted more abuse at you.",
            "Tbh it looks like you came out of this with a new, awesome friend in SB and got rid of some dead weight. Best to find all this out now rather than down the road.",
            "You most definitely dodged a bullet there. Humongous crimson flag right there. Also don't be sad. A relationship with someone is supposed to make you happy and bring you peace, and not become the reason for perpetual headache. Well done.",
            "oh god I'm so happy you posted this\n\nWell done (he WAS super controlling)",
            "Good thing you left your BF. I read the original and there was alot of insecure shit there that he needs to deal with. Getting jealous over your step brother and you spending time together; and then worrying about you and him getting romantically involved. Dude had some serious issues to deal with.",
            "You dodged a bullet on this one.",
            "I’m married and I don’t think we have ever spent 3-4 hours talking. He’s a young guy, and for some reason young guys are super controlling, jealous, angry, and insecure",
            "Excellent decision-making. You will find someone better - best of luck!",
            "Okay, I know people tend to have a different relationship with step siblings than fill siblings, but your boyfriend is insane. He does realise that it's your BROTHER that he's jealous of, right? It sounds like someone's been watching too much step-sister porn and got themself a problem.",
            "You ex was spending too much time on the step-brother category of porn hub.",
            "I feel like your ex has watched too much step brother porn and thinks that is the default when it comes to blended families.\n\nQuarantine is forcing relationships to reevaluate things for better or worse.",
            "TBF i had a good feeling about you the second you looked at moving in with 4 dudes and one bathroom and said “nah”. \n\nThis guy comes across as woefully immature he thinks getting to bone regularly makes up for you squatting in his crusty bachelor palace.",
            "I felt exhausted just reading about this dude. Holy hell, what a drain. \n\nGood riddance.",
            "Sounds like your ex watches too much pornhub lol",
            "OP, I want you to know how proud I am of you for sticking up for yourself and your SB. A lot of people can't see how bad of a situation they're in and I'm glad you were able to!",
            "🚩🚩🚩🚩🚩 these are red flags. Due to your age & circumstances, you may not have noticed them before. This guy has absolutely zero rights to demand anything from you...let’s just get that straight. No other person does. The fact is, he is immature, insecure & very possessive. Don’t equate his jealousy for love. Someone who loves you would not treat you this way. Be grateful for Covid-19 insofar as you don’t have to be around this guy. He is testing how he can control you, do NOT give in to any of his ridiculous demands & as far as his theories on your SB & you, was he raised in Alabama? I would be breaking it off with him & be grateful you have dodged a bullet. You deserve much, much better than someone like that.",
            "That doesn't make you an asshole hun, seems to me the asshole is the one wanting you to choose him over your family.. Insecurities of that proportion would be a sign that maybe he needs a psychiatric evaluation lol",
            "You did the smart thing.  Your ex watches too much incest porn.",
            "Damn, this is some abusive behavior, i'm glad you leave him, most of these threads are people not wanting to let go.",
            "I know it's hard and it hurts, but you did absolutely the right thing. You can't fix his way of thinking and hurting you, which would likely never end if you continue.",
            "You're not an asshole. This man sounded completely unreasonable and overwhelmed with his own insecurities, and you weren't going to be able to make him see the errors in his actions. I'm so sorry this is how it had to end for you two, but good luck in the future, and you made the right call.",
            "Nope. There are much better men in the world",
            "I'm so glad that you did what was best for you! It took me two horrible controlling relationships, back to back, to realize  that those weren't healthy or normal.",
            "In a normal break up yes blocking him is immature but Iin your case he insists on emotionally berating you so it is in your best health to block him.",
            "You aren't an asshole for blocking him.  You're smart for doing so.  He thinks you're cheating on him with your stepbrother because he can't fathom you being anything other than an object of affection.",
            "You dodged a bullet there!",
            "He probably watches too many SB/SS porn. Good for you! You dodged a bullet and you did the right thing!",
            "Your not an asshole. You can't do it face to face and this was best for you. He was trying to manipulate you and was being very unreasonable. How is teaching to drive and bake bread boyfriend tasks?! My mom taught me both, that's family thing. Plus considering he doesn't have his permit he probably is either making it up to try to guilt you or lives in his head. I know it hurts but you did the best thing for you.",
            "You aren't the asshole for blocking him. Infact you are an inspiration and a scholar.\n Trust me I was just like him. \nI was controlling, insecure, scared, always angry always gas lighting and arguing and making myself be the victim. I'd make her feel so guilty that she would feel sad for me even though I started the argument. I had no respect. No trust. No empathy. Nothing for her. The only thing that would make me feel better was making somebody else feel bad. After many failed relationships and years of counseling I realized I had deeper issues to deal with. After I faced and took care of my personal issues I treated women how they should and genuinely felt real feelings. Been with my girl for 12 years couldn't be happier. I'm not even scared to let her be alone with  guy friends. We trust each other. \nNo means trust no relationship. Point blank",
            "With this type of dipshit a text break up and block is exactly what they need.",
            "Well done OP. Don't go back there, he sounds like the persistent type and will try his best to lure you in. You are much better off without the toxic influence on your life.",
            "Good job, hope he stops watching step-sis/step-bro pornos.",
            "Here OP, you dropped this. \n🚩.. \nor maybe about 20.",
            "You broke up with him in the right way.",
            "He's probably been spending too much time on pornhub",
            "Such a narcissist. \nEwww stay away",
            "I’m so sorry things had to turn out that way, but you made the right decision. I’m so glad you were level-headed about the situation, listened to some of the good advice people gave, and went with your gut. You’re smart and strong, and you’ll be so much better off not being controlled or having a situation that creates so much anxiety, especially with everything else going on.",
            "Honestly I think you did the right thing.\n\nMy opinion probably doesn't matter, but it sounded a lot like your BF was a malignant narcissist, he needed everything to be about him, the second it wasn't he got uncomfortable or angry.",
            "Blocking him does not make you an asshole at all - you’re taking care of yourself. Please make sure to stay safe - people who are controlling are often the most dangerous after a breakup. Reach Love is Respect or a professional if some sort to create a plan to stay safe, physically and mentally!",
            "You handled that perfectly!",
            ">I’ve been crying a lot, but I’m also kind of relieved\n\nIf his absence brings you peace, then it's good you broke up.",
            "Definitely made the right choice by breaking up with him. He clearly has a lot of issues (trust, anger, control, etc...) I think you saved your future self from a doomed ending, that honestly could have gotten REALLY bad/ potentially physically abusive. You go girl 💁💁💁💁",
            "You dodged a bullet, good job OP",
            "You 100% did the right thing. Be proud of yourself! Sometimes you might regret this decision and cry about it, I get that. It's a part of breaking up. But never ever ever forget that this kind of behavior is NEVER acceptable. You deserve someone so much better than him. And I truly hope that you'll find that person one day. You totally did the right thing and that was really brave of you. Take care",
            "In no way are you the asshole- you *never* need to continue toxic, controlling relationships, no matter the circumstances. \n\nTake some time to be yourself, and move forward. This was just a learning experience.",
            "Dumping the BF was the right choice, he probably wants to fuck your step brother tho",
            "Yeah he sounds controlling and jealous. Your step brother is family. Anyone you date should understand this.",
            "Isnt it funny how we create the very hell we feared in the first place? This guy was so insecure over losing you that he lost you. Not because you wanted to leave him either, like he made this happen all on his own when his deep emotional fears were screaming for him to hold on tighter. I dont know I think people on reddit are way to harsh- we are emotional creatures and insecurities suck. I kinda feel sorry for the guy.",
            "Your ex was obsessive and crazy insecure! Seriously, accusing you of having something more with your stepbrother? That's such a sick thought to have, no matter how old you guys were when you became family. You are *family*. He was trying to make you question your relationship with every man that wasn't him and eventually isolate you to escalate his controlling behaviors so it would be harder for you to leave. That's a really messed-up situation to be in that a lot of women find themselves in and you just barely missed it. I'm happy you were able to stop for a second and think things through. As time passes by the relief you feel will only increase.",
            "[removed]",
            "I get everyone's thoughts but reddit is as always quite \"yeah breakup! great!\" But it's quite easy for him feel that way when you're with your stepbrother and don't see him during quarantine. Hard on someone who's maybe alone? Obviously it's not correct and from your perspective that's clear. But from his he's alone and his girlfriend is spending time with some other dude every day while he fears losing connection to you. I think you guys just needed to get through that accusing. Two options: either he realizes that he's not actually mad about you spending time with your stepbrother or you manage to get to him through that making sure that he knows that that won't make him lose connection and there's enough stuff that you guys can do together once the quarantine thing is over",
            "I guess he is the insecure type. And not having you around due to quarantine made him very anxious.  That anxiety made him paranoid.To deal with those anxiety ,he started to find things that justified his worry. So he can find someone to blame. So he can ease his feeling.  I'll say he is very immature emotionally. And to you that is very frustrating. But you can't expect him to grow overnight. Amd I do believe he can learn if you willing to teach him and be there for him.I'm not saying you have to. just saying he can change.",
            "Normally I would have given the benefit of the doubt... but he needed to learn from this.\n\nI would say the healthiest thing to do for everyone (assuming he doesn’t have a history of being manipulative) is to give him the chance to talk to you again so that you can make sure he knows how you felt and why things went the way they did. Maybe from that he can grow and you can feel at ease knowing he isn’t confused. If he’s not willing to listen, however, of course, don’t give him the chance. Just make sure your reaching out is just a chance to explain things, and do your best to make sure he knows that too.\n\nYou made the right decision and things will get easier. Maybe in time he will change as a person and you’ll be able to get back together without any of the problems you’ve been facing. But if he doesn’t change, then you may have gotten away from a much bigger problem that you may not know about now. But, honestly, I wouldn’t expect many people to change out of being very controlling, presumptuous, untrusting, and disrespectful very well.",
            "[removed]",
            "Hey guys, need help. What would i do to get my ex back? Serious answer guys. Letters or what would i do",
            "It is just me or I have the impression thst this story is incomplete.\n\nAm I the only one thinking OP is actually banging SB?",
            "This is bad outcome. He was a good BF all the year and this is his first mistake or he had always been an Asshole and you just noticed with this?",
            "I ship you and SB now lol...I'm sorry",
            "Saw your original post, maybe go driving with your parents instead? At the very least it would make him feel like your putting in effort into making him feel better about it. Also just because he saw you guys together on his story does NOT mean he is \"stalking\"."
        ]
    }
]